{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7213,
			"arabicnumber": "2867",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Abu Bakr bin Abu Syaibah], semuanya dari [Ibnu Ulaiyah] berkata [Ibnu Ayyub]: Telah menceritakan kepada kami [Ibnu Ulaiyah] berkata. Telah mengkhabarkan kepada kami [Sa'id Al Jurairi] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] dari [Zaid bin Tsabit] berkata Abu Sa'id: Aku tidak menyaksikannya dari nabi Shallallahu 'alaihi wa Salam, tapi Zaid bin Tsabit menceritakannya kepadaku, ia berkata: Saat nabi Shallallahu 'alaihi wa Salam berada di kebun milik bani An Najjar, beliau menunggangi bighal milik beliau dan kami bersama beliau, tiba-tiba bighal menyimpang hingga hampir melemparkan beliau, ternyata ada enam, lima atau empat kuburan -ia berkata: Seperti inilah yang dikatakan Al Jurairi- lalu beliau bertanya: \"Siapa yang mengetahui penghuni-penghuni kubuan ini?\" seseorang menjawab: Saya. Beliau bertanya: \"Kapan mereka meninggal?\" ia menjawab: Mereka meninggal dimasa kesyirikan. Beliau bersabda: \"Sesungguhnya ummat ini diuji dikuburnya. Andai kalian tidak berlarian, niscaya aku berdoa kepada Allah agar memperdengarkan adzab kubur pada kalian seperti aku dengar.\" Setelah itu beliau menghadapkan wajah ke arah kami lalu bersabda: \"Berlindunglah diri kepada Allah dari adzab neraka.\" mereka berkata: Kami berlindung diri kepada Allah dari adzab neraka.\" beliau bersabda: \"Berlindunglah diri kepada Allah dari adzab kubur.\" mereka berkata: Kami berlindung diri kepada Allah dari adzab kubur.\" Beliau bersabda: \"Berlindunglah diri kepada Allah dari fitnah-fitnah yang nampak dan yang teresmbunyi.\" Mereka berkata: Kami berlindung diri kepada Allah dari fitnah-fitnah yang nampak dan yang tersembunyi.\" Beliau bersabda: \"Berlindunglah diri kepada Allah dari fitnahnya Dajjal.\" mereka berkata: Kami berlindung diri kepada Allah dari fitnahnya Dajjal",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 82
			}
		}
	]
}