{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "Telah menceritakan kepada kami [Abdulwarits bin Abdushshamad bin Abdulwaris] dan [Hajjaj bin Asy Sya'ir], keduanya dari [Abdushshamad], teks milik Abdulwarits bin Abdushshamad telah menceritakan kepada kami [ayahku] dari [kakekku] dari [Al Husain bin Dzakwan] telah menceritakan kepada kami [Ibnu Buraidah] telah menceritakan kepadaku [Amir bin Syarahil Asy Sya'bi] ia bertanya kepada [Fathimah binti Qais] saudari Adh Dhahhak bin Qais, ia salah satu wanita yang turut serta dalam hijrah pertama, ia berkata: Ceritakanlah suatu hadits padaku yang kau dengar Rasulullah Shallallahu 'alaihi wa Salam, jangan kau sandarkan pada siapa pun selain beliau. Fathimah berkata: Bila kau mau, aku akan menceritakannya. Ia berkata: Ya, ceritakanlah. Fathimah berkata: Aku menikah dengan Ibnu Al Mughirah, ia salah satu pemuda Quraisy terbaik saat itu. Ia meninggal dalam jihad pertama bersama Rasulullah Shallallahu 'alaihi wa Salam. Saat aku menjanda, Abdurrahman bin Auf melamarku bersama beberapa sahabat Rasulullah Shallallahu 'alaihi wa Salam lalu Rasulullah Shallallahu 'alaihi wa Salam melamarku untuk budak beliau yang telah dimedekakan, Usamah bin Zaid. Aku diberi tahu bahwa Rasulullah Shallallahu 'alaihi wa Salam pernah bersabda: \"Barangsiapa mencintaiku, hendaklah mencintai Usamah.\" Saat Rasulullah Shallallahu 'alaihi wa Salam berbicara padaku, aku menjawab: Terserah Tuan, nikahkan aku dengan siapa pun yang Tuan mau. Beliau bersabda: \"Pindahlah ke Ummu Syuraik.\" Ummu Syuraik adalah wanita kaya dari Anshar, sering memberi dana di jalan Allah dan sering disinggahi tamu. Aku menjawab: Baik. Beliau bersabda: \"Jangan, Ummu Syuraik adalah wanita yang banyak tamunya, aku tidak mau kerudungmu jatuh atau penutup betismu tersingkap lalu orang-orang melihat sebagaian yang tidak kau suka. Tapi pindahlah ke putra pamanmu, Abdullah bin Amru bin Ummu Kultsum.\" Ia adalah seseorang dari bani Fihr, Firh adalah Quraisy dimana Rasulullah Shallallahu 'alaihi wa Salam berasal. Aku pindah ke kediamannya. Saat masa iddahku selesai, aku mendengar penyeru Rasulullah Shallallahu 'alaihi wa Salam menyerukan shalat jamaah. Aku keluar ke masjid lalu shalat bersama Rasulullah Shallallahu 'alaihi wa Salam. Aku berada dishaf kaum wanita yang berada dibelakang kaum. Setelah Rasulullah Shallallahu 'alaihi wa Salam menyelesaikan shalat, beliau duduk di atas mimbar dan beliau tertawa, beliau bersabda: \"Hendaklah setiap orang tetap berada ditempatnya.\" Setelah itu beliau bertanya: \"Tahukah kalian, kenapa aku mengumpulkan kalian?\" mereka menjawab: Allah dan rasulNya lebih tahu. Beliau bersabda: \"Demi Allah, sesungguhnya aku tidak mengumpulkanmu karena harapan atau rasa takut, tapi aku mengumpulkan kalian karena Tamim Ad Dari dulunya orang nasrani lalu ia datang, berbaiat lalu masuk Islam.\" Ia menceritakan suatu hadits padaku, sama seperti hadits yang aku ceritakan kepada kalian tentang Masih Dajjal. Ia menceritakan kepadaku bahwa Dajjal naik perahu bersama tigapuluh orang dari Lakham dan Judzam. Gelombang mempermainkan mereka dilaut selama sebulan lalu mereka menepi ke suatu pulau dilautan hingga matahari tenggelam. Mereka duduk didekat perahu lalu masuk ke pulau. Seekor binatang menemui mereka, banyak bulunya, mereka tahu mana kemaluannya dan mana duburnya karena banyak bulunya. Mereka bertanya: Celakalah kau, apa kau ini? ia menjawab: Aku adalah jassaasah. Mereka bertanya: Apa itu jassaasah? Ia berkata: Wahai kaum, pergilah ke orang itu di ujung kampung, dia merindukan khabar kalian. Adh Dhahhak berkata: Saat ia menyebut nama seseorang pada kami, kami takut jangan-jangan ia setan. Kami segera pergi hingga memasuki perkampungan, ternyata disana ada orang terbesar yang pernah kami lihat, paling kuat dan tangannya terbelenggu dileher, antara lutut dan mata kakinya terbelenggu besi. Kami berkata: Celakalah kamu, apa kau ini? ia menjawab: Kalian telah mengetahuiku, maka beritahukan siapa kalian? Mereka menjawab: Kami dari arab, kami naik perahu. Saat gelombang menghebat, kami dipermainkan selama sebulan kemudian kami menepi ke pulaumu ini. kami duduk didekat perahu lalu kami masuk ke pulau. Seekor hewan menemui kami, bulunya lebat, tidak jelas mana kemaluannya dan mana duburnya karena banyaknya bulu. Kami bertanya: Celakalah kau, apa kau ini? ia menjawab: Aku adalah jassaasah. Kami bertanya: Apa itu jassaasah? Ia berkata: Wahai kaum, pergilah ke orang itu di ujung kampung, dia merindukan khabar kalian. Lalu kami segera menujumu dan kami takut padanya, kami tidak aman jangan-jangan ia setan. Ia berkata: Beritahukan padaku tentang kurma Baisan. Kami bertanya: Tentang apanya yang kau tanyakan? Ia berkata: Aku bertanya pada kalian tentang kurmanya, apakah sudah berbuah? Kami menjawab: Ya. Ia berkata: Ingat, ia hampir tidak membuahkan lagi. Ia berkata: Beritahukan padaku tentang danau Thabari. Kami bertanya: Tentang apanya yang kau tanyakan? Ia menjawab: Apakah ada airnya? Mereka menjawab: Airnya banyak. Ia berkata: Ingat, airnya hampir akan habis. Ia berkata: Beritahukan padaku tentang mata air Zughar. Mereka bertanya: Tentang apanya yang kau tanyakan? Ia berkata: Apakah disana ada airnya dan apakah penduduknya bercocok tanam dengan air itu? Kami menjawab: Ya, airnya banyak dan penduduknya bercocok tanam dengan air itu. Ia berkata: Beritahukan padaku tentang nabi orang-orang buta huruf, bagaimana keadaannya? Mereka menjawab: Ia telah muncul dari Makkah dan tinggal di Yatsrib. Ia bertanya: Apakah orang-orang arab memeranginya? Kami menjawab: Ya. Ia bertanya: Apa yang mereka lakukan terhadapnya? Lalu kami memberitahunya bahwa beliau menang atas bangsa arab di sebelahnya dan mereka menaatinya. Ia bertanya pada mereka: Itu sudah terjadi? Kami menjawab: Ya. Ia berkata: Ingat, sesungguhnya itu baik bagi mereka untuk menaatinya. Aku akan beritahukan pada kalian siapa aku. Aku adalah Al Masih dan aku sudah hampir diizinkan untuk keluar lalu aku akan keluar. Aku melintasi bumi, aku tidak membiarkan satu perkampungan pun kecuali aku singgahi selama empatpuluh hari kecuali Makkah dan Thaibah (Madinah), keduanya diharamkan bagiku. Setiap kali aku hendak memasuki salah satunya, malaikat membawa pedang kuat menghadangku menghalangiku dari tempat itu dan disetiap jalannya terdapat malaikat-malaikat penjaga.\" Fathimah berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda seraya memukulkan tongkat pendek beliau ke mimbar: \"Inilah Thaibah, inilah Thaibah, inilah Thaibah -maksud beliau Madinah. Ingat, apakah aku sudah menceritakannya pada kalian?\" mereka menjawab: Ya.\" Hadits Tamim membuatku heran, ceritanya sama seperti yang aku ceritakan pada kalian tentang Dajjal, Madinah dan Makkah. Ingat, sesungguhnya Dajjal ada dilautan Syam atau Yaman. Tidak, tapi dari arah timur. Ia tidak berada di arah timur, ia tidak berada di arah timur. Ia menunjukkan tangannya ke timur. Fathimah berkata: Aku menghafal ini dari Rasulullah Shallallahu 'alaihi wa Salam. Telah menceritakan kepada kami [Yahya bin Hubaib Al Haritsi] telah menceritakan kepada kami [Khalid bin Al Harits Al Hujaimi Abu Utsman] telah menceritakan kepada kami [Qurrah] telah menceritakan kepada kami [Sayyar Abu Al Hakam] telah menceritakan kepada kami [Asy Sya'bi] berkata: Kami memasuki kediaman [Fahtimah binti Qais]. Ia menyuguhkan kurma basah bernama kurma basah Ibnu Thab dan memberi kami minum tepung halus, lalu kami bertanya padanya tentang wanita yang ditalak tiga, dimanakah ia menunggu masa 'iddahnya? Ia menjawab: Suamiku menceraikanku talak tiga lalu nabi Shallallahu 'alaihi wa Salam mengizinkanku untuk menunggu masa 'iddahku bersama keluargaku. Ia berkata: Kemudian shalat jamaah diserukan. Aku pergi bersama orang-orang. Aku berada dishaf wanita terdepan, tepat berada dibelakang shaf terakhir kaum lelaki. Aku mendengar nabi Shallallahu 'alaihi wa Salam berkhutbah di atas mimbar, beliau bersabda: \"Sesungguhnya keturunan pamannya Tamim Ad Dari naik perahu, \" ia menyebut hadits dan ia menambahkan: Fathimah berkata: Sepertinya aku melihat nabi Shallallahu 'alaihi wa Salam menurunkan tongkat pendek beliau ke tanah, beliau bersabda: \"Inilah Thaibah\" maksud beliau Madinah. Telah menceritakan kepada kami [Al Hasan bin Ali Al Hulwani] dan [Ahmad bin Utsman An Naufali] keduanya berkata: Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] berkata: Aku mendengar [Ghailan bin Jarir] menceritakan dari [Asy Sya'bi] dari [Fathimah binti Qais] berkata: Tamim Ad Dari mendatangi Rasulullah Shallallahu 'alaihi wa Salam lalu memberitahukan kepada beliau bahwa ia naik perahu lalu perahunya menggombang-ambingkannya hingga ia terdampar disuatu pulau. Ia masuk ke pulau untuk mencari air, ia bertemu seseorang yang menjulurkan rambutnya, ia menceritakan hadits ini. Ia menuturkan: Dajjal berkata: Ingat, bila aku diizinkan keluar, aku akan melalui seluruh negeri selain Thaibah. Rasulullah Shallallahu 'alaihi wa Salam membawa Tamim keluar ke hadapan orang-orang lalu menyampaikan pada mereka, beliau bersabda: \"Ini adalah Thaibah dan itu adalah Dajjal.\" Telah menceritakan kepadaku [Abu Bakr bin Ishaq] telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Mughirah Al Hizami] dari [Abu Az Zinad] dari [Asy Sya'bi] dari [Fathimah binti Qais], Rasulullah Shallallahu 'alaihi wa Salam duduk di atas mimbar lalu bersabda: \"Wahai sekalian manusia, Tamim Ad Dari telah menceritakan kepadaku bahwa beberapa orang dari kaumnya berada di perahu milik mereka. Perahunya pecah lalu sebagaian dari mereka naik di atas salah satu lembaran kayu perahunya, mereka pergi menuju salah satu pulau dilautan.\" Lalu beliau menyebutkan hadits ini",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		}
	]
}