{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 894,
			"arabicnumber": "400.01",
			"text": "Telah menceritakan kepada kami [Ali bin Hujr as-Sa'di] telah menceritakan kepada kami [Ali bin Mushir] telah mengabarkan kepada kami [al-Mukhtar bin Fulful] dari [Anas bin Malik] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] sedangkan lafazh tersebut miliknya, telah menceritakan kepada kami [Ali bin Mushir] dari [al-Mukhtar] dari [Anas] dia berkata, \"Pada suatu hari ketika Rasulullah di antara kami, tiba-tiba beliau tertidur, kemudian mengangkat kepalanya dalam keadaan tersenyum, maka kami bertanya, 'Apa yang membuatmu tertawa wahai Rasulullah? ' Beliau menjawab, 'Baru saja diturunkan kepadaku suatu surat, lalu beliau membaca, 'Bismillahirrahmanirrahim, Inna A'thainaka al-Kautsar Fashalli Lirabbika Wanhar, Inna Syani'aka Huwa al-Abtar, ' kemudian beliau berkata, 'Apakah kalian tahu, apakah al-Kautsar itu? ' Kami menjawab, 'Allah dan RasulNya lebih tahu.' Beliau bersabda, 'Ia adalah sungai yang dijanjikan oleh Rabbku kepadaku. Padanya terdapat kebaikan yang banyak. Ia adalah telaga yang umatku menemuiku pada hari kiamat, wadahnya sebanyak jumlah bintang, lalu seorang hamba dari umatku terhalang darinya, maka aku berkata, 'Wahai Rabbku, sesungguhnya dia termasuk umatku', maka Allah berkata, 'Kamu tidak tahu sesuatu yang terjadi setelah (meninggalmu) '.\" Ibnu Hujr menambahkan dalam haditsnya, \"Di antara kami dalam masjid.\" Dan kalimat, \"Allah berfirman, 'Sesuatu yang terjadi setelah meninggalmu'.\" Telah menceritakan kepada kami [Abu Kuraib Muhammad bin al-'Ala] telah mengabarkan kepada kami [Ibnu Fudhail] dari [Mukhtar bin Fulful] dia berkata, \"Saya mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam tidur\", sebagaimana hadits Ibnu Mushir, hanya saja dia berkata, 'Sungai yang dijanjikan oleh Rabbku di surga, padanya terdapat telaga, ' dan dia tidak menyebutkan, 'Wadahnya sebanyak jumlah bintang",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 56
			}
		}
	]
}