{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 93,
			"arabicnumber": "8.01",
			"text": "Telah menceritakan kepadaku [Abu Khaitsamah Zuhair bin Harb] telah menceritakan kepada kami [Waki'] dari [Kahmas] dari [Abdullah bin Buraidah] dari [Yahya bin Ya'mar]. (dalam riwayat lain disebutkan) Dan telah menceritakan kepada kami [Ubaidullah bin Mu'adz al-'Anbari] dan ini haditsnya, telah menceritakan kepada kami [Bapakku] telah menceritakan kepada kami [Kahmas] dari [Ibnu Buraidah] dari [Yahya bin Ya'mar] dia berkata, \"Orang yang pertama kali membahas takdir di Bashrah adalah Ma'bad al-Juhani, maka aku dan Humaid bin Abdurrahman al-Himyari bertolak haji atau umrah, maka kami berkata, 'Seandainya kami bertemu dengan salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, maka kami akan bertanya kepadanya tentang sesuatu yang mereka katakan berkaitan dengan takdir.' Maka [Abdullah bin Umar] diberikan taufik (oleh Allah) untuk kami, sedangkan dia masuk masjid. Lalu aku dan temanku menghadangnya. Salah seorang dari kami di sebelah kanannya dan yang lain di sebelah kirinya. Lalu aku mengira bahwa temanku akan mewakilkan pembicaraan kepadaku, maka aku berkata, 'Wahai Abu Abdurrahman, sesungguhnya nampak di hadapan kami suatu kaum membaca al-Qur'an dan mencari ilmu lalu mengklaim bahwa tidak ada takdir, dan perkaranya adalah baru (tidak didahului oleh takdir dan ilmu Allah).' Maka [Abdullah bin Umar] menjawab, 'Apabila kamu bertemu orang-orang tersebut, maka kabarkanlah kepada mereka bahwa saya berlepas diri dari mereka, dan bahwa mereka berlepas diri dariku. Dan demi Dzat yang mana hamba Allah bersumpah dengan-Nya, kalau seandainya salah seorang dari kalian menafkahkan emas seperti gunung Uhud, niscaya sedekahnya tidak akan diterima hingga dia beriman kepada takdir baik dan buruk.' Dia berkata, 'Kemudian dia mulai menceritakan hadits seraya berkata, ['Umar bin al-Khaththab] berkata, 'Dahulu kami pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam, lalu datanglah seorang laki-laki yang bajunya sangat putih, rambutnya sangat hitam, tidak tampak padanya bekas-bekas perjalanan. Tidak seorang pun dari kami mengenalnya, hingga dia mendatangi Nabi Shallallahu 'Alaihi Wasalam lalu menyandarkan lututnya pada lutut Nabi Shallallahu 'Alaihi Wasalam, kemudian ia berkata, 'Wahai Muhammad, kabarkanlah kepadaku tentang Islam? ' Rasulullah Shallallahu 'Alaihi Wasalam menjawab: \"Kesaksian bahwa tidak ada tuhan (yang berhak disembah) selain Allah dan bahwa Muhammad adalah hamba dan utusan-Nya, mendirikan shalat, menunaikan zakat, dan puasa Ramadlan, serta haji ke Baitullah jika kamu mampu bepergian kepadanya.' Dia berkata, 'Kamu benar.' Umar berkata, 'Maka kami kaget terhadapnya karena dia menanyakannya dan membenarkannya.' Dia bertanya lagi, 'Kabarkanlah kepadaku tentang iman itu? ' Beliau menjawab: \"Kamu beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, para Rasul-Nya, hari akhir, dan takdir baik dan buruk.\" Dia berkata, 'Kamu benar.' Dia bertanya, 'Kabarkanlah kepadaku tentang ihsan itu? ' Beliau menjawab: \"Kamu menyembah Allah seakan-akan kamu melihat-Nya, maka jika kamu tidak melihat-Nya, maka sesungguhnya Dia melihatmu.\" Dia bertanya lagi, 'Kapankah hari akhir itu? ' Beliau menjawab: \"Tidaklah orang yang ditanya itu lebih mengetahui daripada orang yang bertanya.\" Dia bertanya, 'Lalu kabarkanlah kepadaku tentang tanda-tandanya? ' Beliau menjawab: \"Apabila seorang budak melahirkan (anak) tuan-Nya, dan kamu melihat orang yang tidak beralas kaki, telanjang, miskin, penggembala kambing, namun bermegah-megahan dalam membangun bangunan.\" Kemudian dia bertolak pergi. Maka aku tetap saja heran kemudian beliau berkata; \"Wahai Umar, apakah kamu tahu siapa penanya tersebut?\" Aku menjawab, 'Allah dan Rasul-Nya lebih tahu.' Beliau bersabda: \"Itulah jibril, dia mendatangi kalian untuk mengajarkan kepada kalian tentang pengetahuan agama kalian'.\" Telah menceritakan kepada kami [Muhammad bin Ubaid al-Ghubari] dan [Abu Kamil al-Jahdari] serta [Ahmad bin Abdah] mereka berkata, telah menceritakan kepada kami [Hammad bin Yazid] dari [Mathar al Warraq] dari [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dia berkata, 'Ketika Ma'bad berkata dengan sesuatu yang dia bicarakan tentang masalah takdir, maka kami mengingkari hal tersebut.' Dia berkata lagi, 'Lalu aku melakukan haji bersama Humaid bin Abdurrahman al-Himyari.' Lalu mereka menyebutkan hadits dengan makna hadits Kahmas. Di dalamnya terdapat sebagian tambahan dan kekurangan huruf.\" Dan telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id al Qaththan] telah menceritakan kepada kami [Utsman bin Ghiyats] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dan [Humaid bin Abdurrahman] keduanya berkata, \"Kami bertemu [Abdullah bin Umar], lalu kami menyebutkan tentang takdir dan pendapat mereka tentangnya, lalu dia mengisahkan hadits tersebut sebagaimana hadits mereka dari [Umar] radlialllahu 'anhuma dari Nabi shallallahu 'alaihi wasallam, dan di dalamnya terdapat suatu tambahan dan pengurangan.\" Dan telah menceritakan kepada kami [Hajjaj bin asy-Sya'ir] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [al-Mu'tamir] dari [Bapaknya] dari [Yahya bin Ya'mar] dari [Ibnu Umar] dari [Umar] dari Nabi shallallahu 'alaihi wasallam dengan semisal hadits mereka",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		}
	]
}