{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 936,
			"arabicnumber": "418.01",
			"text": "Telah menceritakan kepada kami [Ahmad bin Abdullah bin Yunus] telah menceritakan kepada kami [Zaidah] telah menceritakan kepada kami [Musa bin Abi Aisyah] dari [Ubaidullah bin Abdullah] dia berkata, \"Saya mengunjungi [Aisyah], lalu saya berkata kepadanya, 'Maukah kamu untuk menceritakan kepadaku tentang sakitnya Rasulullah Shallallahu'alaihiwasallam? ' Dia menjawab, 'Ya saya mau. Nabi shallallahu 'alaihi wasallam merasa payah (karena sakit) lalu beliau bersabda, 'Apakah orang-orang shalat berjamaah? ' Kami menjawab, 'Tidak, karena mereka menunggumu wahai Rasulullah.' Beliau bersabda, 'Letakkanlah air untukku di wadah.' Lalu kami melakukannya, maka beliau mandi kemudian mulai berdiri, lalu beliau pingsan kemudian sadar kembali, lalu beliau bertanya, 'Apakah manusia telah shalat berjamaah? ' Kami menjawab, 'Belum, mereka menunggumu wahai Rasulullah.' Beliau bersabda lagi, 'Letakkanlah air untukku di wadah tersebut.' Lalu kami melakukannya, maka beliau mandi, kemudian mulai bangkit, lalu beliau pingsan lagi, kemudian bangun tersadar. Lalu beliau bersabda, 'Apakah manusia telah shalat? ' Kami menjwab, 'Belum, mereka menunggumu wahai Rasulullah.' Beliau bersabda lagi, 'Letakkanlah air untukku di wadah tersebut.' Lalu kami melakukannya, maka beliau mandi, kemudian mulai bangkit, lalu beliau pingsan lagi, kemudian bangun tersadar.' Lalu beliau bersabda, 'Apakah manusia telah shalat? ' Kami menjawab, 'Belum, mereka menunggumu wahai Rasulullah.' Beliau bersabda lagi, 'Letakkanlah air untukku di wadah tersebut.' Lalu kami melakukannya, maka beliau mandi, kemudian mulai bangkit, lalu beliau pingsan lagi, kemudian bangun tersadar.\" Aisyah berkata, \"Orang-orang berkumpul menunggu Rasulullah shallallahu 'alaihi wasallam di masjid untuk shalat isya' yang akhir.\" Aisyah berkata lagi, \"Lalu Rasulullah mengirimkan utusan kepada Abu Bakar agar shalat mengimami orang-orang. Lalu orang tersebut mendatangi Abu Bakar seraya berkata, ' Rasulullah menyuruhmu untuk shalat mengimami manusia.' Maka Abu Bakar berkata -sedangkan dia seorang lelaki yang lemah (maksudnya sensitif), 'Wahai Umar, shalatlah mengimami manusia.' Aisyah berkata lagi, 'Umar pun berkata, 'Kamu lebih berhak dengan hal tersebut.\" Aisyah berkata, Lalu Abu Bakar shalat mengimami mereka pada hari itu, kemudian Rasulullah shallallahu 'alaihi wasallam mendapatkan rasa khawatir dalam dirinya, lalu beliau keluar dengan dipapah dua orang laki-laki, salah satunya adalah al-Abbas untuk shalat zhuhur sedangkan Abu Bakar dalam keadaan mengimami manusia. Tatkala Abu Bakar melihatnya, maka dia segera mundur. Lalu Nabi memberikan isyarat kepadanya agar tidak mundur. Dan Rasulullah berkata kepada dua orang yang memapahnya, 'Dudukkanlah aku di sampingnya'. Lalu keduanya mendudukkan beliau di samping Abu Bakar, ketika itu Abu Bakar shalat makmum pada Nabi shallallahu 'alaihi wasallam sedangkan orang-orang bermakmum pada shalat Abu Bakar, dan Nabi shallallahu 'alaihi wasallam shalat dalam keadaan duduk.\" [Ubaidullah] berkata, \"Aku menemui [Abdullah bin Abbas], lalu aku berkata kepadanya, \"Maukah aku paparkan kepadamu hadits yang diceritakan Aisyah kepadaku tentang sakitnya Rasulullah Shallallahu'alaihiwasallam.\" Maka dia berkata, \"Ceritakanlah kepadaku.\" Lalu aku memaparkan haditsnya kepadanya. Maka ternyata dia tidak mengingkari sedikit pun hadits Aisyah. Hanya saja dia bertanya, \"Apakah Aisyah menyebutkan nama laki-laki yang memapah Nabi bersama al-Abbas?\" Aku menjawab, \"Tidak.\" Dia berkata, \"Dia adalah Ali",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 98
			}
		}
	]
}