{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"14": "Witr Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "Narrated Ibn `Umar: Once a person asked Allah's Messenger (ﷺ) (ﷺ) about the night prayer. Allah's Apostle (ﷺ) replied, \"The night prayer is offered as two Rak`at followed by two Rak`at and so on and if anyone is afraid of the approaching dawn (Fajr prayer) he should pray one Rak`ah and this will be a Witr for all the Rak`at which he has prayed before",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "Nafi` told that `Abdullah bin `Umar used to say Taslim between (the first) two Rak`at and (the third) odd one in the Witr prayer, when he wanted to attend to a certain matter (during that interval between the Rak`at)",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "Narrated Ibn `Abbas:Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet (ﷺ) slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Messenger (ﷺ) went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet (ﷺ) put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunnah of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith 183)",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "Narrated `A'isha:Allah's Messenger (ﷺ) used to pray eleven rak`at at night and that was his night prayer and each of his prostrations lasted for a period enough for one of you to recite fifty verses before Allah's Messenger (ﷺ) raised his head. He also used to pray two rak`at (Sunnah) before the (compulsory) Fajr prayer and then lie down on his right side till the Mu'adh-dhin came to him for the prayer",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "Narrated Anas bin Seereen:I asked Ibn `Umar, \"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as to prolonging the recitation in them?\" He said, \"The Prophet (ﷺ) used to pray at night two rak`at followed by two and so on, and end the prayer by one rak`ah witr. He used to offer two rak`at before the Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he prayed) quickly",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) offered witr prayer at different nights at various hours extending (from the `Isha' prayer) up to the last hour of the night",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "Narrated `A'isha:The Prophet (ﷺ) used to offer his night prayer while I was sleeping across in his bed. Whenever he intended to offer the witr prayer, he used to wake me up and I would offer the witr prayer too",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) said, \"Make witr as your last prayer at night",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "Narrated Sa`id bin Yasar:I was going to Mecca in the company of `Abdullah bin `Umar and when I apprehended the approaching dawn, I dismounted and offered the witr prayer and then joined him. `Abdullah bin `Umar said, \"Where have you been?\" I replied, \"I apprehended the approaching dawn so I dismounted and prayed the witr prayer.\" `Abdullah said, \"Isn't it sufficient for you to follow the good example of Allah's Messenger (ﷺ)?\" I replied, \"Yes, by Allah.\" He said, \"Allah's Messenger (ﷺ) used to pray witr on the back of the camel (while on a journey)",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) used to offer (Nawafil) prayers on his Rahila (mount) facing its direction by signals, but not the compulsory prayer. He also used to pray witr on his (mount) Rahila",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "Narrated Muhammad bin Seereen:Anas was asked, \"Did the Prophet (ﷺ) recite Qunut in the Fajr prayer?\" Anas replied in the affirmative. He was further asked, \"Did he recite Qunut before bowing?\" Anas replied, \"He recited Qunut after bowing for some time (for one month)",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "Narrated `Asim:I asked Anas bin Malik about the Qunut. Anas replied, \"Definitely it was (recited)\". I asked, \"Before bowing or after it?\" Anas replied, \"Before bowing.\" I added, \"So and so has told me that you had informed him that it had been after bowing.\" Anas said, \"He told an untruth (i.e. \"was mistaken,\" according to the Hijazi dialect). Allah's Messenger (ﷺ) recited Qunut after bowing for a period of one month.\" Anas added, \"The Prophet (ﷺ) sent about seventy men (who knew the Qur'an by heart) towards the pagans (of Najd) who were less than they in number and there was a peace treaty between them and Allah's Messenger (ﷺ) (but the Pagans broke the treaty and killed the seventy men). So Allah's Messenger (ﷺ) recited Qunut for a period of one month asking Allah to punish them",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "Narrated Anas:The Qunut used to be recited in the Maghrib and the Fajr prayers",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		}
	]
}