{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"20": "Virtues of Prayer at Masjid Makkah and Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "Narrated Quza'a: I heard Abu Said saying four words. He said, \"I heard the Prophet (ﷺ) (saying the following narrative).\" He had participated in twelve holy battles with the Prophet",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Do not set out on a journey except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of Allah's Messenger (ﷺ) , and the Mosque of Al-Aqsa, (Mosque of Jerusalem)",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"One prayer in my Mosque is better than one thousand prayers in any other mosque excepting Al-Masjid-AI-Haram",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "Narrated `Abdullah bin Dinar:Ibn `Umar said, \"The Prophet (ﷺ) used to go to the Mosque of Quba every Saturday (sometimes) walking and (sometimes) riding.\" `Abdullah (Ibn `Umar) used to do the same",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) used to go to the Mosque of Quba (sometimes) walking and sometimes riding. Added Nafi` (in another narration), \"He then would offer two rak`at (in the Mosque of Quba)",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "Narrated `Abdullah bin Zaid Al-Mazini:Allah's Messenger (ﷺ) said, \"Between my house and the pulpit there is a garden of the gardens of Paradise",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Between my house and my pulpit there is a garden of the gardens of Paradise, and my pulpit is on my fountain tank (i.e. Al-Kauthar)",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "Narrated Qaza'a Maula:(freed slave of) Ziyad: I heard Abu Sa`id Al-khudri narrating four things from the Prophet (ﷺ) and I appreciated them very much. He said, conveying the words of the Prophet. (1) \"A woman should not go on a two day journey except with her husband or a Dhi-Mahram. (2) No fasting is permissible on two days: `Id-ul-Fitr and `Id-ul-Adha. (3) No prayer after two prayers, i.e. after the Fajr prayer till the sunrises and after the `Asr prayer till the sun sets. (4) Do not prepare yourself for a journey except to three Mosques, i.e. Al-Masjid-AI-Haram, the Mosque of Aqsa (Jerusalem) and my Mosque",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		}
	]
}