{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) sent Mu`adh to Yemen and said, \"Invite the people to testify that none has the right to be worshipped but Allah and I am Allah's Messenger (ﷺ), and if they obey you to do so, then teach them that Allah has enjoined on them five prayers in every day and night (in twenty-four hours), and if they obey you to do so, then teach them that Allah has made it obligatory for them to pay the Zakat from their property and it is to be taken from the wealthy among them and given to the poor",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "Narrated Abu Aiyub:A man said to the Prophet (ﷺ) \"Tell me of such a deed as will make me enter Paradise.\" The people said, \"What is the matter with him? What is the matter with him?\" The Prophet (ﷺ) said, \"He has something to ask. (What he needs greatly) The Prophet (ﷺ) said: (In order to enter Paradise) you should worship Allah and do not ascribe any partners to Him, offer prayer perfectly, pay the Zakat and keep good relations with your Kith and kin.\" (See Hadith No. 12, Vol 8)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "Narrated Abu Huraira:A Bedouin came to the Prophet (ﷺ) and said, \"Tell me of such a deed as will make me enter Paradise, if I do it.\" The Prophet (p.b.u.h) said, \"Worship Allah, and worship none along with Him, offer the (five) prescribed compulsory prayers perfectly, pay the compulsory Zakat, and fast the month of Ramadan.\" The Bedouin said, \"By Him, in Whose Hands my life is, I will not do more than this.\" When he (the Bedouin) left, the Prophet (ﷺ) said, \"Whoever likes to see a man of Paradise, then he may look at this man.\" Narrated Abu Zur'a: From the Prophet (ﷺ) the same as above",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "Narrated Ibn `Abbas:A delegation of the tribe of `Abdul Qais came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We are from the tribe of Rabi`a, and the infidels of the tribe of Mudar stands between us and you; so we cannot come to you except during the Sacred Months. Please order us to do something (religious deeds) which we may carry out and also invite to it our people whom we have left behind.\" The Prophet said, \"I order you to do four things and forbid you four others: (I order you) to have faith in Allah, and confess that none has the right to be worshipped but Allah, (and the Prophet (ﷺ) gestured with his hand like this (i.e. one knot) and to offer prayers perfectly and to pay the Zakat, and to pay onefifth of the booty in Allah's Cause. And I forbid you to use Dubba', Hantam, Naqir and Muzaffat (all these are the names of utensils used for preparing alcoholic drinks)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "Narrated Jarir bin `Abdullah:I gave the pledge of allegiance to the Prophet (ﷺ) for offering prayer perfectly, giving Zakat, and giving good advice to every Muslim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"(On the Day of Resurrection) camels will come to their owner in the best state of health they have ever had (in the world), and if he had not paid their Zakat (in the world) then they would tread him with their feet; and similarly, sheep will come to their owner in the best state of health they have ever had in the world, and if he had not paid their Zakat, then they would tread him with their hooves and would butt him with their horns.\" The Prophet (ﷺ) added, \"One of their rights is that they should be milked while water is kept in front of them.\" The Prophet (ﷺ) added, \"I do not want anyone of you to come to me on the Day of Resurrection, carrying over his neck a sheep that will be bleating. Such a person will (then) say, 'O Muhammad! (please intercede for me,) I will say to him. 'I can't help you, for I conveyed Allah's Message to you.' Similarly, I do not want anyone of you to come to me carrying over his neck a camel that will be grunting. Such a person (then) will say \"O Muhammad! (please intercede for me).\" I will say to him, \"I can't help you for I conveyed Allah's message to you",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Whoever is made wealthy by Allah and does not pay the Zakat of his wealth, then on the Day of Resurrection his wealth will be made like a baldheaded poisonous male snake with two black spots over the eyes. The snake will encircle his neck and bite his cheeks and say, 'I am your wealth, I am your treasure.' \" Then the Prophet (ﷺ) recited the holy verses:-- 'Let not those who withhold . . .' (to the end of the verse). (3.180)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "Narrated Khalid bin Aslam:We went out with 'Abdullah bin 'Umar and a bedouin said (to 'Abdullah), \"Tell me about Allah's saying: \"And those who hoard up gold and silver (Al-Kanz - money, gold, silver etc., the Zakat of which has not been paid) and spend it not in the Way of Allah (V.9:34).\" Ibn 'Umar said, \"Whoever hoarded them and did not pay the Zakat thereof, then woe to him. But these holy Verses were revealed before the Verses of Zakat. So when the Verses of Zakat were revealed, Allah made Zakat a purifier of the property",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "Narrated Abu Sa`id:Allah's Messenger (ﷺ) (p.b.u.h) said, \"No Zakat is due on property mounting to less than five Uqiyas (of silver), and no Zakat is due on less than five camels, and there is no Zakat on less than five Wasqs.\" (A Wasqs equals 60 Sa's) & (1 Sa=3 K gms App)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "Narrated Zaid bin Wahab:I passed by a place called Ar-Rabadha and by chance I met Abu Dhar and asked him, \"What has brought you to this place?\" He said, \"I was in Sham and differed with Muawiya on the meaning of (the following verses of the Qur'an): 'They who hoard up gold and silver and spend them not in the way of Allah.' (9.34). Muawiya said, 'This verse is revealed regarding the people of the scriptures.\" I said, It was revealed regarding us and also the people of the scriptures.\" So we had a quarrel and Mu'awiya sent a complaint against me to `Uthman. `Uthman wrote to me to come to Medina, and I came to Medina. Many people came to me as if they had not seen me before. So I told this to `Uthman who said to me, \"You may depart and live nearby if you wish.\" That was the reason for my being here for even if an Ethiopian had been nominated as my ruler, I would have obeyed him",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "Narrated Ibn Mas`ud:I heard the Prophet (ﷺ) saying, \"There is no envy except in two: a person whom Allah has given wealth and he spends it in the right way, and a person whom Allah has given wisdom (i.e. religious knowledge) and he gives his decisions accordingly and teaches it to the others",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"If one give in charity what equals one date-fruit from the honestly earned money and Allah accepts only the honestly earned money --Allah takes it in His right (hand) and then enlarges its reward for that person (who has given it), as anyone of you brings up his baby horse, so much s that it becomes as big as a mountain",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "Narrated Haritha bin Wahab:I heard the Prophet (ﷺ) saying, \"O people! Give in charity as a time will come upon you when a person will wander about with his object of charity and will not find anybody to accept it, and one (who will be requested to take it) will say, \"If you had brought it yesterday, would have taken it, but today I am not in need of it",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The Hour (Day of Judgment) will not be established till your wealth increases so much so that one will be worried, for no one will accept his Zakat and the person to whom he will give it will reply, 'I am not in need of it",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "Narrated `Adi bin Hatim:While I was sitting with Allah's Messenger (ﷺ) (p.b.u.h) two person came to him; one of them complained about his poverty and the other complained about the prevalence of robberies. Allah's Messenger (ﷺ) said, \"As regards stealing and robberies, there will shortly come a time when a caravan will go to Mecca (from Medina) without any guard. And regarding poverty, The Hour (Day of Judgment) will not be established till one of you wanders about with his object of charity and will not find anybody to accept it And (no doubt) each one of you will stand in front of Allah and there will be neither a curtain nor an interpreter between him and Allah, and Allah will ask him, 'Did not I give you wealth?' He will reply in the affirmative. Allah will further ask, 'Didn't send a messenger to you?' And again that person will reply in the affirmative Then he will look to his right and he will see nothing but Hell-fire, and then he will look to his left and will see nothing but Hell-fire. And so, any (each one) of you should save himself from the fire even by giving half of a date-fruit (in charity). And if you do not find a hall datefruit, then (you can do it through saying) a good pleasant word (to your brethren). (See Hadith No. 793 Vol. 4)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "Narrated Abu Musa:Thy Prophet (p.b.u.h) said, \"A time will come upon the people when a person will wander about with gold as Zakat and will not find anybody to accept it, and one man will be seen followed by forty women to be their guardian because of scarcity of men and great number of women",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "Narrated Abu Mas`ud:When the verses of charity were revealed, we used to work as porters. A man came and distributed objects of charity in abundance. And they (the people) said, \"He is showing off.\" And another man came and gave a Sa (a small measure of food grains); they said, \"Allah is not in need of this small amount of charity.\" And then the Divine Inspiration came: \"Those who criticize such of the believers who give in charity voluntarily and those who could not find to give in charity except what is available to them.\" (9.79)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "Narrated Abu Mas`ud Al-Ansari:Whenever Allah's Messenger (ﷺ) (p.b.u.h) ordered us to give in charity, we used to go to the market and work as porters and get a Mudd (a special measure of grain) and then give it in charity. (Those were the days of poverty) and today some of us have one hundred thousand",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "Narrated `Adi bin Hatim heard the Prophet (ﷺ) saying:\"Save yourself from Hell-fire even by giving half a date-fruit in charity",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "Narrated Aisha:A lady along with her two daughters came to me asking (for some alms), but she found nothing with me except one date which I gave to her and she divided it between her two daughters, and did not eat anything herself, and then she got up and went away. Then the Prophet (ﷺ) came in and I informed him about this story. He said, \"Whoever is put to trial by these daughters and he treats them generously (with benevolence) then these daughters will act as a shield for him from Hell-Fire.\" (See Hadith No. 24, Vol. 8)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "Narrated Abu Huraira:A man came to the Prophet (ﷺ) and asked, \"O Allah's Messenger (ﷺ)! Which charity is the most superior in reward?\" He replied, \"The charity which you practice while you are healthy, niggardly and afraid of poverty and wish to become wealthy. Do not delay it to the time of approaching death and then say, 'Give so much to such and such, and so much to such and such.' And it has already belonged to such and such (as it is too late)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "Narrated `Aisha:Some of the wives of the Prophet (ﷺ) asked him, \"Who amongst us will be the first to follow you (i.e. die after you)?\" He said, \"Whoever has the longest hand.\" So they started measuring their hands with a stick and Sauda's hand turned out to be the longest. (When Zainab bint Jahsh died first of all in the caliphate of `Umar), we came to know that the long hand was a symbol of practicing charity, so she was the first to follow the Prophet (ﷺ) and she used to love to practice charity. (Sauda died later in the caliphate of Muawiya)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) (p.b.u.h) said, \"A man said that he would give something in charity. He went out with his object of charity and unknowingly gave it to a thief. Next morning the people said that he had given his object of charity to a thief. (On hearing that) he said, \"O Allah! All the praises are for you. I will give alms again.\" And so he again went out with his alms and (unknowingly) gave it to an adulteress. Next morning the people said that he had given his alms to an adulteress last night. The man said, \"O Allah! All the praises are for you. (I gave my alms) to an adulteress. I will give alms again.\" So he went out with his alms again and (unknowingly) gave it to a rich person. (The people) next morning said that he had given his alms to a wealthy person. He said, \"O Allah! All the praises are for you. (I had given alms) to a thief, to an adulteress and to a wealthy man.\" Then someone came and said to him, \"The alms which you gave to the thief, might make him abstain from stealing, and that given to the adulteress might make her abstain from illegal sexual intercourse (adultery), and that given to the wealthy man might make him take a lesson from it and spend his wealth which Allah has given him, in Allah's cause",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "Narrated Ma'n bin Yazid:My grandfather, my father and I gave the pledge of allegiance to Allah's Messenger (ﷺ). The Prophet (ﷺ) got me engaged and then got me married. One day I went to the Prophet (ﷺ) with a complaint. My father Yazid had taken some gold coins for charity and kept them with a man in the mosque (to give them to the poor) But I went and took them and brought them to him (my father). My father said, \"By Allah! I did not intend to give them to you. \" I took (the case) to Allah's Messenger (ﷺ) . On that Allah's Messenger (ﷺ) said, \"O Yazid, you will be rewarded for what you intended. O Ma'n, whatever you have taken is yours",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "Narrated Abu Huraira:The Prophet (p.b.u.h) said, \"Seven people will be shaded by Allah under His shade on the day when there will be no shade except His. They are: (1) a just ruler; (2) a young man who has been brought up in the worship of Allah, (i.e. worship Allah (Alone) sincerely from his childhood), (3) a man whose heart is attached to the mosque (who offers the five compulsory congregational prayers in the mosque); (4) two persons who love each other only for Allah's sake and they meet and part in Allah's cause only; (5) a man who refuses the call of a charming woman of noble birth for an illegal sexual intercourse with her and says: I am afraid of Allah; (6) a person who practices charity so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity). (7) a person who remembers Allah in seclusion and his eyes get flooded with tears",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "Narrated Haritha bin Wahab Al-Khuza`i:I heard the Prophet (p.b.u.h) saying, \"(O people!) Give in charity (for Allah's cause) because a time will come when a person will carry his object of charity from place to place (and he will not find any person to take it) and any person whom he shall request to take it, I will reply, 'If you had brought it yesterday I would have taken it, but today I am not in need of it",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) said, \"When a woman gives in charity some of the foodstuff (which she has in her house) without spoiling it, she will receive the reward for what she has spent, and her husband will receive the reward because of his earning, and the storekeeper will also have a reward similar to it. The reward of one will not decrease the reward of the others",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "Narrated Abu Huraira:The Prophet (p.b.u.h) said, \"The best charity is that which is practiced by a wealthy person. And start giving first to your dependents",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "Narrated Ibn `Umar:I heard Allah's Messenger (ﷺ) (p.b.u.h) while he was on the pulpit speaking about charity, to abstain from asking others for some financial help and about begging others, saying, \"The upper hand is better than the lower hand. The upper hand is that of the giver and the lower (hand) is that of the beggar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "Narrated `Uqba bin Al-Harith:Once the Prophet (ﷺ) offered the `Asr prayer and then hurriedly went to his house and returned immediately. I (or somebody else) asked him (as to what was the matter) and he said, \"I left at home a piece of gold which was from the charity and I disliked to let it remain a night in my house, so I got it distributed",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) went out for the `Id prayer on the `Id day and offered a two rak`at prayer; and he neither offered a prayer before it or after it. Then he went towards the women along with Bilal. He preached them and ordered them to give in charity. And some (amongst the women) started giving their forearm bangles and earrings",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "Narrated Abu Burda bin Abu Musa:that his father said, \"Whenever a beggar came to Allah's Messenger (ﷺ) or he was asked for something, he used to say (to his companions), \"Help and recommend him and you will receive the reward for it; and Allah will bring about what He will through His Prophet's tongue",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "Narrated Asma:The Prophet (ﷺ) said to me, \"Do not withhold your money, (for if you did so) Allah would withhold His blessings from you.\" Narrated `Abda: The Prophet (ﷺ) said, \"Do not withhold your money by counting it (i.e. hoarding it), (for if you did so), Allah would also withhold His blessings from you",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "Narrated Asma' bint Abu Bakr:that she had gone to the Prophet (ﷺ) and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "Narrated Abu Wail:Hudhaifa said, \"`Umar said, 'Who amongst you remembers the statement of Allah's Messenger (ﷺ) (p.b.u.h) about afflictions'?' I said, 'I know it as the Prophet (ﷺ) had said it.' `Umar said, 'No doubt, you are bold. How did he say it?' I said, 'A man's afflictions (wrong deeds) concerning his wife, children and neighbors are expiated by (his) prayers, charity, and enjoining good.' (The sub-narrator Sulaiman added that he said, 'The prayer, charity, enjoining good and forbidding evil.') `Umar said, 'I did not mean that, but I ask about that affliction which will spread like the waves of the sea.' I said, 'O chief of the believers! You need not be afraid of it as there is a closed door between you and it.' He asked, 'Will the door be broken or opened?' I replied, 'No, it will be broken.' He said, 'Then, if it is broken, it will never be closed again?' I replied, 'Yes.' \" Then we were afraid to ask what that door was, so we asked Masruq to inquire, and he asked Hudhaifa regarding it. Hudhaifa said, \"The door was `Umar. \"We further asked Hudhaifa whether `Umar knew what that door meant. Hudhaifa replied in the affirmative and added, \"He knew it as one knows that there will be a night before the tomorrow morning",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "Narrated Hakim bin Hizam:I said to Allah's Messenger (ﷺ), \"Before embracing Islam I used to do good deeds like giving in charity, slave-manumitting, and the keeping of good relations with Kith and kin. Shall I be rewarded for those deeds?\" The Prophet (ﷺ) replied, \"You became Muslim with all those good deeds (Without losing their reward)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) said, \"When a woman gives in charity from her husband's meals without wasting the property of her husband, she will get a reward for it, and her husband too will get a reward for what he earned and the storekeeper will have the reward likewise",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "Narrated Abu Musa:The Prophet (ﷺ) said, \"An honest Muslim storekeeper who carries out the orders of his master and pays fully what he has been ordered to give with a good heart and pays to that person to whom he was ordered to pay, is regarded as one of the two charitable persons",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "Narrated 'Aishah:The Prophet (ﷺ) said, \"If a woman gives in charity from her husband's house ...\" (See next hadith)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "Narrate Aisha:The Prophet (ﷺ) said, \"If a woman gives in charity from her husband's house ..\" The Prophet (p.b.u.h) also said, \"If a lady gives meals (in charity) from her husband's house without spoiling her husband's property, she will get a reward and her husband will also get a reward likewise. The husband will get a reward because of his earnings and the woman because of her spending",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "Narrated `Aisha:The Prophet (ﷺ) said, \"When a woman gives in charity from her house meals in Allah's Cause without spoiling her husband's property, she will get a reward for it, and her husband will also get the reward for his earnings and the storekeeper will get a reward likewise",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every miser",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The example of a miser and an almsgiver is like the example of two persons wearing iron cloaks.\" Allah's Messenger (ﷺ) also said, \"The example of an almsgiver and a miser is like the example of two persons who have two iron cloaks on them from their breasts to their collar bones, and when the almsgiver wants to give in charity, the cloak becomes capacious till it covers his whole body to such an extent that it hides his fingertips and covers his footprints (obliterates his tracks). (1) And when the miser wants to spend, it (the iron cloak) sticks and every ring gets stuck to its place and he tries to widen it, but it did not become wide",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "See previous hadith",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "Narrated Abu Burda:from his father from his grandfather that the Prophet (ﷺ) said, \"Every Muslim has to give in charity.\" The people asked, \"O Allah's Prophet! If someone has nothing to give, what will he do?\" He said, \"He should work with his hands and benefit himself and also give in charity (from what he earns).\" The people further asked, \"If he cannot find even that?\" He replied, \"He should help the needy who appeal for help.\" Then the people asked, \"If he cannot do that?\" He replied, \"Then he should perform good deeds and keep away from evil deeds and this will be regarded as charitable deeds",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "Narrated Um 'Atiyya:A sheep was sent to me (Nusaiba Al-Ansariya) (in charity) and I sent some of it to `Aisha. The Prophet asked `Aisha for something to eat. `Aisha replied that there was nothing except what Nusaiba Al-Ansariya had sent of that sheep. The Prophet (ﷺ) said to her, \"Bring it as it has reached its place",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) said, \"There is no Zakat on less than five camels and also there is no Zakat on less than five Awaq (of silver). (5 Awaq = 22 Fransa Riyals of Yemen or 200 Dirhams.) And there is no Zakat on less than five Awsuq. (A special measure of food-grains, and one Wasq equals 60 Sa's.) (For gold 20, Dinars i.e. equal to 12 Guinea English. No Zakat for less than 12 Guinea (English) of gold or for silver less than 22 Fransa Riyals of Yemen.) Narrated Abi Sa`id Al-Khudri: I heard the Prophet (ﷺ) saying (as above)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "Narrated Anas:Abu Bakr wrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who had to pay one Bint Makhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had got Bint Labun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the collector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not a Bint Makhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he would not be paid anything",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "Narrated Ibn `Abbas:I am a witness that Allah's Messenger (ﷺ) offered the Id prayer before delivering the sermon and then he thought that the women would not be able to hear him (because of the distance), so he went to them along with Bilal who was spreading his garment. The Prophet (ﷺ) advised and ordered them to give in charity. So the women started giving their ornaments (in charity). (The sub-narrator Aiyub pointed towards his ears and neck meaning that they gave ornaments from those places such as earrings and necklaces)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "Narrated Anas:Abu Bakr wrote to me what was made compulsory by Allah's Messenger (ﷺ) and that was (regarding the payments of Zakat): Neither the property of different people may be taken together nor the joint property may be split for fear of (paying more, or receiving less) Zakat",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "Narrated Anas:Abu Bakr wrote to me what Allah's Messenger (ﷺ) has made compulsory (regarding Zakat) and this was mentioned in it: If a property is equally owned by two partners, they should pay the combined Zakat and it will be considered that both of them have paid their Zakat equally",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "Narrated Abu Sa`id Al-Khudri:A Bedouin asked Allah's Messenger (ﷺ) about the emigration. The Prophet (p.b.u.h) said, \"May Allah have mercy on you! The matter of emigration is very hard. Have you got camels? Do you pay their Zakat?\" The Bedouin said, \"Yes, I have camels and I pay their Zakat.\" The Prophet (ﷺ) said, Work beyond the seas and Allah will not decrease (waste) any of your good deeds.\" (See Hadith No. 260 Vol. 5)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "Narrated Anas:Abu Bakr , wrote to me about the Zakat which Allah had ordered His Apostle to observe: Whoever had to pay Jahda (Jahda means a four-year-old she-camel) as Zakat from his herd of camels and he had not got one, and he had Hiqqa (three-year-old she-camel), that Hiqqa should be accepted from him along with two sheep if they were available or twenty Dirhams (one Durham equals about 1/4 Saudi Riyal) and whoever had to pay Hiqqa as Zakat and he had no Hiqqa but had a Jadha, the Jadha should be accepted from him, and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Hiqqa as Zakat and he had not got one, but had a Bint Labun (two-year-old she-camel), it should be accepted from him along with two sheep or twenty Dirhams; and whoever had to pay Bint Labun and had a Hiqqa, that Hiqqa should be accepted from him and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Bint Labun and he had not got one but had a Bint Makhad (one-year-old she camel), that Bint Makhad should be accepted from him along with twenty Dirhams or two sheep",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "Narrated Anas:When Abu Bakr; sent me to (collect the Zakat from) Bahrain, he wrote to me the following:-- (In the name of Allah, the Beneficent, the Merciful). These are the orders for compulsory charity (Zakat) which Allah's Messenger (ﷺ) had made obligatory for every Muslim, and which Allah had ordered His Apostle to observe: Whoever amongst the Muslims is asked to pay Zakat accordingly, he should pay it (to the Zakat collector) and whoever is asked more than that (what is specified in this script) he should not pay it; for twenty-four camels or less, sheep are to be paid as Zakat; for every five camels one sheep is to be paid, and if there are between twenty-five to thirty-five camels, one Bint Makhad is to be paid; and if they are between thirty-six to forty-five (camels), one Bint Labun is to be paid; and if they are between forty-six to sixty (camels), one Hiqqa is to be paid; and if the number is between sixty-one to seventy-five (camels), one Jadha is to be paid; and if the number is between seventy-six to ninety (camels), two Bint Labuns are to be paid; and if they are from ninety-one to one-hundredand twenty (camels), two Hiqqas are to be paid; and if they are over one-hundred and-twenty (camels), for every forty (over one-hundred-and-twenty) one Bint Labun is to be paid, and for every fifty camels (over one-hundred-and-twenty) one Hiqqa is to be paid; and who ever has got only four camels, has to pay nothing as Zakat, but if the owner of these four camels wants to give something, he can. If the number of camels increases to five, the owner has to pay one sheep as Zakat. As regards the Zakat for the (flock) of sheep; if they are between forty and one-hundred-and-twenty sheep, one sheep is to be paid; and if they are between one-hundred-and-twenty to two hundred (sheep), two sheep are to be paid; and if they are between two-hundred to three-hundred (sheep), three sheep are to be paid; and for over three-hundred sheep, for every extra hundred sheep, one sheep is to be paid as Zakat. And if somebody has got less than forty sheep, no Zakat is required, but if he wants to give, he can. For silver the Zakat is one-fortieth of the lot (i.e. 2.5%), and if its value is less than two-hundred Dirhams, Zakat is not required, but if the owner wants to pay he can",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "Narrated Anas:Abu Bakr wrote to me what Allah had ordered His Apostle (about Zakat) which goes: Neither an old nor a defected animal, nor a male-goat may be taken as Zakat except if the Zakat collector wishes (to take it)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "Narrated Ibn `Abbas:When Allah's Messenger (ﷺ) (p.b.u.h) sent Mu`adh to Yemen, he said (to him), \"YOU are going to people of a (Divine) Book. First of all invite them to worship Allah (alone) and when they come to know Allah, inform them that Allah has enjoined on them, five prayers in every day and night; and if they start offering these prayers, inform them that Allah has enjoined on them, the Zakat. And it is to be taken from the rich amongst them and given to the poor amongst them; and if they obey you in that, take Zakat from them and avoid (don't take) the best property of the people as Zakat",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) said, \"No Zakat is imposed on less than five Awsuq of dates; no Zakat is imposed on less than five Awaq of silver, and no Zakat is imposed on less than five camels",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "Narrated Abu Dhar:Once I went to him (the Prophet (ﷺ) ) and he said, \"By Allah in Whose Hands my life is (or probably said, 'By Allah, except Whom none has the right to be worshipped) whoever had camels or cows or sheep and did not pay their Zakat, those animals will be brought on the Day of Resurrection far bigger and fatter than before and they will tread him under their hooves, and will butt him with their horns, and (those animals will come in circle): When the last does its turn, the first will start again, and this punishment will go on till Allah has finished the judgments amongst the people",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "Narrated 'Is-haq bin `Abdullah bin Al Talha:I heard Anas bin Malik saying, \"Abu Talha had more property of date-palm trees gardens than any other amongst the Ansar in Medina and the most beloved of them to him was Bairuha garden, and it was in front of the Mosque of the Prophet (ﷺ) . Allah's Messenger (ﷺ) used to go there and used to drink its nice water.\" Anas added, \"When these verses were revealed:--'By no means shall you Attain righteousness unless You spend (in charity) of that Which you love. ' (3.92) Abu Talha said to Allah's Messenger (ﷺ) 'O Allah's Messenger (ﷺ)! Allah, the Blessed, the Superior says: By no means shall you attain righteousness, unless you spend (in charity) of that which you love. And no doubt, Bairuha' garden is the most beloved of all my property to me. So I want to give it in charity in Allah's Cause. I expect its reward from Allah. O Allah's Messenger (ﷺ)! Spend it where Allah makes you think it feasible.' On that Allah's Apostle said, 'Bravo! It is useful property. I have heard what you have said (O Abu Talha), and I think it would be proper if you gave it to your Kith and kin.' Abu Talha said, I will do so, O Allah's Apostle.' Then Abu Talha distributed that garden amongst his relatives and his cousins",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "Narrated Abu Sa`id Al-Khudri:On `Id ul Fitr or `Id ul Adha Allah's Messenger (ﷺ) (p.b.u.h) went out to the Musalla. After finishing the prayer, he delivered the sermon and ordered the people to give alms. He said, \"O people! Give alms.\" Then he went towards the women and said. \"O women! Give alms, for I have seen that the majority of the dwellers of Hell-Fire were you (women).\" The women asked, \"O Allah's Messenger (ﷺ)! What is the reason for it?\" He replied, \"O women! You curse frequently, and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. O women, some of you can lead a cautious wise man astray.\" Then he left. And when he reached his house, Zainab, the wife of Ibn Mas`ud, came and asked permission to enter It was said, \"O Allah's Messenger (ﷺ)! It is Zainab.\" He asked, 'Which Zainab?\" The reply was that she was the wife of Ibn Mas'ub. He said, \"Yes, allow her to enter.\" And she was admitted. Then she said, \"O Prophet of Allah! Today you ordered people to give alms and I had an ornament and intended to give it as alms, but Ibn Mas`ud said that he and his children deserved it more than anybody else.\" The Prophet (ﷺ) replied, \"Ibn Mas`ud had spoken the truth. Your husband and your children had more right to it than anybody else",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"There is no Zakat either on a horse or a slave belonging to a Muslim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"There is no Zakat either on a slave or on a horse belonging to a Muslim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "Narrated Abu Sa`id Al-Khudri:Once the Prophet (ﷺ) sat on a pulpit and we sat around him. Then he said, \"The things I am afraid of most for your sake (concerning what will befall you after me) is the pleasures and splendors of the world and its beauties which will be disclosed to you.\" Somebody said, \"O Allah's Messenger (ﷺ)! Can the good bring forth evil?\" The Prophet (ﷺ) remained silent for a while. It was said to that person, \"What is wrong with you? You are talking to the Prophet (p.b.u.h) while he is not talking to you.\" Then we noticed that he was being inspired divinely. Then the Prophet (ﷺ) wiped off his sweat and said, \"Where is the questioner?\" It seemed as if the Prophet (ﷺ) liked his question. Then he said, \"Good never brings forth evil. Indeed it is like what grows on the banks of a water-stream which either kill or make the animals sick, except if an animal eats its fill the Khadira (a kind of vegetable) and then faces the sun, and then defecates and urinates and grazes again. No doubt this wealth is sweet and green. Blessed is the wealth of a Muslim from which he gives to the poor, the orphans and to needy travelers. (Or the Prophet said something similar to it) No doubt, whoever takes it illegally will be like the one who eats but is never satisfied, and his wealth will be a witness against him on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "Narrated `Amr bin Al-Harith:Zainab, the wife of `Abdullah said, \"I was in the Mosque and saw the Prophet (p.b.u.h) saying, 'O women ! Give alms even from your ornaments.' \" Zainab used to provide for `Abdullah and those orphans who were under her protection. So she said to `Abdullah, \"Will you ask Allah's Messenger (ﷺ) whether it will be sufficient for me to spend part of the Zakat on you and the orphans who are under my protection?\" He replied \"Will you yourself ask Allah's Messenger (ﷺ) ?\" (Zainab added): So I went to the Prophet and I saw there an Ansari woman who was standing at the door (of the Prophet (ﷺ) ) with a similar problem as mine. Bilal passed by us and we asked him, 'Ask the Prophet (ﷺ) whether it is permissible for me to spend (the Zakat) on my husband and the orphans under my protection.' And we requested Bilal not to inform the Prophet (ﷺ) about us. So Bilal went inside and asked the Prophet (ﷺ) regarding our problem. The Prophet (p.b.u.h) asked, \"Who are those two?\" Bilal replied that she was Zainab. The Prophet (ﷺ) said, \"Which Zainab?\" Bilal said, \"The wife of `Abdullah (bin Mas`ud).\" The Prophet said, \"Yes, (it is sufficient for her) and she will receive a double rewards (for that): One for helping relatives, and the other for giving Zakat",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "Narrated Zainab:(the daughter of Um Salama) My mother said, \"O Allah's Messenger (ﷺ)! Shall I receive a reward if I spend for the sustenance of Abu Salama's offspring, and in fact they are also my sons?\" The Prophet (ﷺ) replied, \"Spend on them and you will get a reward for what you spend on them",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) (p.b.u.h) ordered (a person) to collect Zakat, and that person returned and told him that Ibn Jamil, Khalid bin Al-Walid, and `Abbas bin `Abdul Muttalib had refused to give Zakat.\" The Prophet said, \"What made Ibn Jamil refuse to give Zakat though he was a poor man, and was made wealthy by Allah and His Apostle ? But you are unfair in asking Zakat from Khalid as he is keeping his armor for Allah's Cause (for Jihad). As for `Abbas bin `Abdul Muttalib, he is the uncle of Allah's Apostle (p.b.u.h) and Zakat is compulsory on him and he should pay it double",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "Narrated Abu Sa`id Al-Khudri:Some Ansari persons asked for (something) from Allah's Messenger (ﷺ) (p.b.u.h) and he gave them. They again asked him for (something) and he again gave them. And then they asked him and he gave them again till all that was with him finished. And then he said \"If I had anything. I would not keep it away from you. (Remember) Whoever abstains from asking others, Allah will make him contented, and whoever tries to make himself self-sufficient, Allah will make him self-sufficient. And whoever remains patient, Allah will make him patient. Nobody can be given a blessing better and greater than patience",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, it is better for anyone of you to take a rope and cut the wood (from the forest) and carry it over his back and sell it (as a means of earning his living) rather than to ask a person for something and that person may give him or not",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "Narrated Az-Zubair bin Al-`Awwam:The Prophet (p.b.u.h) said, \"It is better for anyone of you to take a rope (and cut) and bring a bundle of wood (from the forest) over his back and sell it and Allah will save his face (from the Hell-Fire) because of that, rather than to ask the people who may give him or not",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "Narrated `Urwa bin Az-Zubair and Sa`id bin Al-Musaiyab:Hakim bin Hizam said, \"(Once) I asked Allah's Messenger (ﷺ) (for something) and he gave it to me. Again I asked and he gave (it to me). Again I asked and he gave (it to me). And then he said, \"O Hakim! This property is like a sweet fresh fruit; whoever takes it without greediness, he is blessed in it, and whoever takes it with greediness, he is not blessed in it, and he is like a person who eats but is never satisfied; and the upper (giving) hand is better than the lower (receiving) hand.\" Hakim added, \"I said to Allah's Messenger (ﷺ) , 'By Him (Allah) Who sent you with the Truth, I shall never accept anything from anybody after you, till I leave this world.' \" Then Abu Bakr (during his caliphate) called Hakim to give him his share from the war booty (like the other companions of the Prophet (ﷺ) ), he refused to accept anything. Then `Umar (during his caliphate) called him to give him his share but he refused. On that `Umar said, \"O Muslims! I would like you to witness that I offered Hakim his share from this booty and he refused to take it.\" So Hakim never took anything from anybody after the Prophet (ﷺ) till he died",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "Narrated `Umar:Allah's Messenger (ﷺ) used to give me something but I would say to him, \"would you give it to a poorer and more needy one than l?\" The Prophet (p.b.u.h) said to me, \"Take it. If you are given something from this property, without asking for it or having greed for it take it; and if not given, do not run for it",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The poor person is not the one who asks a morsel or two (of meals) from the others, but the poor is the one who has nothing and is ashamed to beg from others",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "Narrated Ash-Shu`bi:The clerk of Al-Mughira bin Shu`ba narrated, \"Muawiya wrote to Al-Mughira bin Shu`ba: Write to me something which you have heard from the Prophet (p.b.u.h) .\" So Al-Mughira wrote: I heard the Prophet saying, \"Allah has hated for you three things: -1. Vain talks, (useless talk) that you talk too much or about others. -2. Wasting of wealth (by extravagance) -3. And asking too many questions (in disputed religious matters) or asking others for something (except in great need). (See Hadith No. 591, Vol. Ill)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "Narrated Sa`d (bin Abi Waqqas):Allah's Messenger (ﷺ) distributed something (from the resources of Zakat) amongst a group of people while I was sitting amongst them, but he left a man whom I considered the best of the lot. So, I went up to Allah's Messenger (ﷺ) and asked him secretly, \"Why have you left that person? By Allah! I consider him a believer.\" The Prophet (ﷺ) said, \"Or merely a Muslim (Who surrender to Allah).\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer. \" The Prophet (ﷺ) said, \"Or merely a Muslim.\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Messenger (ﷺ)! Why have you left that person? By Allah! I consider him a believer.\" The Prophet (ﷺ) said, \"Or merely a Muslim.\" Then Allah's Messenger (ﷺ) (p.b.u.h) said, \"I give to a person while another is dearer to me, for fear that he may be thrown in the Hell-fire on his face (by reneging from Islam)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The poor person is not the one who goes round the people and ask them for a mouthful or two (of meals) or a date or two but the poor is that who has not enough (money) to satisfy his needs and whose condition is not known to others, that others may give him something in charity, and who does not beg of people",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"No doubt, it is better for a person to take a rope and proceed in the morning to the mountains and cut the wood and then sell it, and eat from this income and give alms from it than to ask others for something",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "Narrated Salim bin `Abdullah from his father:The Prophet (ﷺ) said, \"On a land irrigated by rain water or by natural water channels or if the land is wet due to a near by water channel Ushr (i.e. one-tenth) is compulsory (as Zakat); and on the land irrigated by the well, half of an Ushr (i.e. one-twentieth) is compulsory (as Zakat on the yield of the land)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "Narrated Abu Sa`id Al-Khudri:The Prophet (ﷺ) said, \"There is no Zakat on less than five Awsuq (of dates), or on less than five camels, or on less than five Awaq of silver",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "Narrated Abu Huraira:Dates used to be brought to Allah's Messenger (ﷺ) immediately after being plucked. Different persons would bring their dates till a big heap collected (in front of the Prophet). Once Al-Hasan and Al-Husain were playing with these dates. One of them took a date and put it in his mouth. Allah's Messenger (ﷺ) looked at him and took it out from his mouth and said, \"Don't you know that Muhammad's offspring do not eat what is given in charity?",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) had forbidden the sale of dates till they were good (ripe), and when it was asked what it meant, the Prophet (ﷺ) said, \"Till there is no danger of blight",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) had forbidden the sale of fruits till they were ripe (free from blight)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) forbade the selling of fruits until they were ripe. The Prophet (p.b.u.h) added, \"It means that they become red",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab gave a horse in charity in Allah's Cause and later he saw it being sold in the market and intended to purchase it. Then he went to the Prophet (ﷺ) and asked his permission. The Prophet said, \"Do not take back what you have given in charity.\" For this reason, Ibn `Umar never purchased the things which he had given in charity, and in case he had purchased something (unknowingly) he would give it in charity again",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "Narrated `Umar:Once I gave a horse in Allah's Cause (in charity) but that person did not take care of it. I intended to buy it, as I thought he would sell it at a low price. So, I asked the Prophet (p.b.u.h) about it. He said, \"Neither buy, nor take back your alms which you have given, even if the seller were willing to sell it for one Dirham, for he who takes back his alms is like the one who swallows his own vomit",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "Narrated Abu Huraira:Al-Hasan bin `Ali took a date from the dates given in charity and put it in his mouth. The Prophet (ﷺ) said, \"Expel it from your mouth. Don't you know that we do not eat a thing which is given in charity?",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) saw a dead sheep which had been given in charity to a freed slave-girl of Maimuna, the wife of the Prophet (ﷺ) . The Prophet (ﷺ) said, \"Why don't you get the benefit of its hide?\" They said, \"It is dead.\" He replied, \"Only to eat (its meat) is illegal",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "Narrated Al-Aswad:`Aisha intended to buy Barira (a slave-girl) in order to manumit her and her masters intended to put the condition that her Al-wala would be for them. `Aisha mentioned that to the Prophet (ﷺ) who said to her, \"Buy her, as the \"Wala\" is for the manumitted.\" Once some meat was presented to the Prophet (ﷺ) and `Aisha said to him, \"This (meat) was given in charity to Barira.\" He said, \"It is an object of charity for Barira but a gift for us",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "Narrated Um 'Atiyya Al-Ansariya:The Prophet (ﷺ) went to `Aisha and asked her whether she had something (to eat). She replied that she had nothing except the mutton (piece) which Nusaiba (Um 'Atiyya) had sent to us (Barira) in charity.\" The Prophet (ﷺ) said, \"It has reached its place and now it is not a thing of charity but a gift for us",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "Narrated Anas:Some meat was presented to the Prophet (p.b.u.h) and it had been given to Barira (the freed slave-girl of Aisha) in charity. He said, \"This meat is a thing of charity for Barira but it is a gift for us",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "Narrated Abu Ma`bad:(the slave of Ibn `Abbas) Allah's Messenger (ﷺ) said to Mu`adh when he sent him to Yemen, \"You will go to the people of the Scripture. So, when you reach there, invite them to testify that none has the right to be worshipped but Allah, and that Muhammad is His Apostle. And if they obey you in that, tell them that Allah has enjoined on them five prayers in each day and night. And if they obey you in that tell them that Allah has made it obligatory on them to pay the Zakat which will be taken from the rich among them and given to the poor among them. If they obey you in that, then avoid taking the best of their possessions, and be afraid of the curse of an oppressed person because there is no screen between his invocation and Allah",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "Narrated 'Abdullah bin Abu Aufa : Whenever a person came to the Prophet (ﷺ) with his alms, the Prophet (ﷺ) would say, \"O Allah! Send your Blessings upon so and so.\" My father went to the Prophet (ﷺ) with his alms and the Prophet (ﷺ) said, \"O Allah! Send your blessings upon the offspring of Abu Aufa",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "Narrated Abu Huraira The Prophet (ﷺ) said, \"A man from Bani Israel asked someone from Bani Israel to give him a loan of one thousand Dinars and the later gave it to him. The debtor went on a voyage (when the time for the payment of the debt became due) but he did not find a boat, so he took a piece of wood and bored it and put 1000 diners in it and threw it into the sea. The creditor went out and took the piece of wood to his family to be used as fire-wood.\" (See Hadith No. 488 B, Vol. 3). And the Prophet (ﷺ) narrated the narration (and said), \"When he sawed the wood, he found his money",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"There is no compensation for one killed or wounded by an animal or by falling in a well, or because of working in mines; but Khumus is compulsory on Rikaz",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "Narrated Abu Humaid Al-Sa`idi:Allah's Messenger (ﷺ) (p.b.u.h) appointed a man called Ibn Al-Lutbiya, from the tribe of Al-Asd to collect Zakat from Bani Sulaim. When he returned, (after collecting the Zakat) the Prophet (ﷺ) checked the account with him",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "Narrated Anas:Some people from `Uraina tribe came to Medina and its climate did not suit them, so Allah's Messenger (ﷺ) (p.b.u.h) allowed them to go to the herd of camels (given as Zakat) and they drank their milk and urine (as medicine) but they killed the shepherd and drove away all the camels. So Allah's Messenger (ﷺ) sent (men) in their pursuit to catch them, and they were brought, and he had their hands and feet cut, and their eyes were branded with heated pieces of iron and they were left in the Harra (a stony place at Medina) biting the stones. (See Hadith No. 234, Vol. 1)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "Narrated Anas bin Malik:I took `Abdullah bin Abu Talha to Allah's Messenger (ﷺ) to perform Tahnik for him. (Tahnik was a custom among the Muslims that whenever a child was born they used to take it to the Prophet (ﷺ) who would chew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet (ﷺ) and he had an instrument for branding in his hands and was branding the camels of Zakat",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) enjoined the payment of one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr on every Muslim slave or free, male or female, young or old, and he ordered that it be paid before the people went out to offer the `Id prayer. (One Sa' = 3 Kilograms approx)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) made it incumbent on all the slave or free Muslims, male or female, to pay one Sa' of dates or barley as Zakat-ul-Fitr",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "Narrated Abu Sa`id:We used to give one Sa' of barley as Sadaqat-ul-Fitr (per head)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "Narrated Abu Sa`id Al-Khudri:We used to give one Sa' of meal or one Sa' of barley or one Sa' of dates, or one Sa' of cottage cheese or one Sa' of Raisins (dried grapes) as Zakat-ul-Fitr",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) ordered (Muslims) to give one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr. The people rewarded two Mudds of wheat as equal to that",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "Narrated Abu Sa`id Al-Khudri:In the lifetime of the Prophet (ﷺ) we used to give one Sa' of food or one Sa' of dates or one Sa' of barley or one Sa' of Raisins (dried grapes) as Sadaqat-ul-Fitr. And when Muawiya became the Caliph and the wheat was (available in abundance) he said, \"I think (observe) that one Mudd (of wheat) equals two Mudds (of any of the above mentioned things)",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) ordered the people to pay Zakat-ul-Fitr before going to the `Id prayer",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "Narrated Abu Sa`id Al-Khudri:In the lifetime of Allah's Messenger (ﷺ) , we used to give one Sa' of food (edible things) as Sadaqat-ul-Fitr (to the poor). Our food used to be either of barley, raisins (dried grapes), cottage cheese or dates",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "Narrated Nafi`:Ibn `Umar said, \"The Prophet (ﷺ) made incumbent on every male or female, free man or slave, the payment of one Sa' of dates or barley as Sadaqat-ul-Fitr (or said Sadaqa-Ramadan).\" The people then substituted half Sa' of wheat for that. Ibn `Umar used to give dates (as Sadaqat-ul-Fitr). Once there was scarcity of dates in Medina and Ibn `Umar gave barley. 'And Ibn `Umar used to give Sadaqat-ul- Fitr for every young and old person. He even used to give on behalf of my children. Ibn `Umar used to give Sadaqat-ul-Fitr to those who had been officially appointed for its collection. People used to give Sadaqat-ul-Fitr (even) a day or two before the `Id",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) has made Sadaqat-ul-Fitr obligatory, (and it was), either one Sa' of barley or one Sa' of dates (and its payment was obligatory) on young and old people, and on free men as well as on slaves",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 112
			}
		}
	]
}