{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"35": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2239,
			"arabicnumber": 2239,
			"text": "Narrated Ibn `Abbas:Allah's Messenger (ﷺ) came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet (ﷺ) said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": 2240,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) came to Medina and the people used to pay in advance the price of dates to be delivered within two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be delivered later should pay it for a specified measure at specified weight for a specified period",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": 2241,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) came (to Medina) and he told the people (regarding the payment of money in advance that they should pay it) for a known specified measure and a known specified weight and a known specified period",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2243,
			"arabicnumber": 2243,
			"text": "",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": 2244,
			"text": "Narrated Muhammad bin Al-Mujalid:`Abdullah bin Shaddad and Abu Burda sent me to `Abdullah bin Abi `Aufa and told me to ask `Abdullah whether the people in the lifetime of the Prophet (ﷺ) used to pay in advance for wheat (to be delivered later). `Abdullah replied, \"We used to pay in advance to the peasants of Sham for wheat, barley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \"Was the price paid (in advance) to those who had the things to be delivered later?\" `Abdullah bin `Aufa replied, \"We did not use to ask them about that.\" Then they sent me to `Abdur Rahman bin Abza and I asked him. He replied, \"The companions of the Prophet (ﷺ) used to practice Salam in the lifetime of the Prophet; and we did not use to ask them whether they had standing crops or not",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "Narrated Muhammad bin Abi Al-Mujalid:as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for oil.\" Narrated Ash-Shaibani: who said \"We used to pay in advance for wheat barley and dried grapes",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": 2246,
			"text": "Narrated Abu Bakhtari at-Tai:I asked Ibn `Abbas about Salam for (the fruits of) date-palms. He replied \"The Prophet (ﷺ) forbade the sale a dates on the trees till they became fit for eating and could be weighed.\" A man asked what to be weighed (as the dates were still on the trees). Another man sitting beside Ibn `Abbas replied, \"Till they are cut and stored.\" Narrated Abu Al-Bakhtari: I heard Ibn `Abbas (saying) that the Prophet (ﷺ) forbade ... etc. as above",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": 2248,
			"text": "",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": 2250,
			"text": "",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": 2251,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to him (the armor stands for a guarantor)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": 2252,
			"text": "Narrated Al-A`mash:We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet (ﷺ) bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet (ﷺ) said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": 2255,
			"text": "",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": 2256,
			"text": "Narrated `Abdullah:The people used to sell camels on the basis of Habal-al-Habala. The Prophet (ﷺ) forbade such sale. Nafi` explained Habal-al-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel gives birth",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 16
			}
		}
	]
}