{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"5": "Bathing (Ghusl)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 248,
			"arabicnumber": 248,
			"text": "Narrated `Aisha:Whenever the Prophet (ﷺ) took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": 249,
			"text": "Narrated Maimuna:(the wife of the Prophet) Allah's Messenger (ﷺ) performed ablution like that for the prayer but did not wash his feet. He washed off the discharge from his private parts and then poured water over his body. He withdrew his feet from that place (the place where he took the bath) and then washed them. And that was his way of taking the bath of Janaba",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": 250,
			"text": "Narrated `Aisha:The Prophet (ﷺ) and I used to take a bath from a single pot called 'Faraq",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": 251,
			"text": "Narrated Abu Salama:`Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at that time there was a screen between her and us",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": 252,
			"text": "Narrated Abu Ja`far:While I and my father were with Jabir bin `Abdullah, some people asked him about taking a bath. He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa` was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": 253,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) and Maimuna used to take a bath from a single pot",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 254,
			"arabicnumber": 254,
			"text": "Narrated Jubair bin Mut`im:Allah's Messenger (ﷺ) said, \"As for me, I pour water three times on my head.\" And he pointed with both his hands",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 255,
			"arabicnumber": 255,
			"text": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) used to pour water three times on his head",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 256,
			"arabicnumber": 256,
			"text": "Narrated Abu Ja`far:Jabir bin `Abdullah said to me, \"Your cousin (Hasan bin Muhammad bin Al-Hanafiya) came to me and asked about the bath of Janaba. I replied, 'The Prophet (ﷺ) uses to take three handfuls of water, pour them on his head and then pour more water over his body.' Al-Hasan said to me, 'I am a hairy man.' I replied, 'The Prophet (ﷺ) had more hair than you",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 257,
			"arabicnumber": 257,
			"text": "Narrated Maimuna:I placed water for the bath of the Prophet. He washed his hands twice or thrice and then poured water on his left hand and washed his private parts. He rubbed his hands over the earth (and cleaned them), rinsed his mouth, washed his nose by putting water in it and blowing it out, washed his face and both forearms and then poured water over his body. Then he withdrew from that place and washed his feet",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 258,
			"arabicnumber": 258,
			"text": "Narrated `Aisha:Whenever the Prophet (ﷺ) took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 259,
			"arabicnumber": 259,
			"text": "Narrated Maimuna:I placed water for the bath of the Prophet (ﷺ) and he poured water with his right hand on his left and washed them. Then he washed his private parts and rubbed his hands on the ground, washed them with water, rinsed his mouth and washed his nose by putting water in it and blowing it out, washed his face and poured water on his head. He withdrew from that place and washed his feet. A piece of cloth (towel) was given to him but he did not use it",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 260,
			"arabicnumber": 260,
			"text": "Narrated Maimuna:The Prophet (ﷺ) took the bath of Janaba. (sexual relation or wet dream). He first cleaned his private parts with his hand, and then rubbed it (that hand) on the wall (earth) and washed it. Then he performed ablution like that for the prayer, and after the bath he washed his feet",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 261,
			"arabicnumber": 261,
			"text": "Narrated Aisha:The Prophet (ﷺ) and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 262,
			"arabicnumber": 262,
			"text": "Narrated `Aisha:Whenever Allah's Messenger (ﷺ) took a bath of Janaba, he washed his hands first",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 263,
			"arabicnumber": 263,
			"text": "Narrated `Aisha:The Prophet (ﷺ) and I used to take a bath from a single pot of water after Janaba",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 264,
			"arabicnumber": 264,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) and one of his wives used to take a bath from a single pot of water. (Shu`ba added to Anas' Statement \"After the Janaba)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 265,
			"arabicnumber": 265,
			"text": "Narrated Maimuna:I placed water for the bath of Allah's Messenger (ﷺ) and he poured water over his hands and washed them twice or thrice; then he poured water with his right hand over his left and washed his private parts (with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by putting water in it and blowing it out. After that he washed his face, both fore arms and head thrice and then poured water over his body. He withdrew from that place and washed his feet",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 266,
			"arabicnumber": 266,
			"text": "Narrated Maimuna bint Al-Harith:I placed water for the bath of Allah's Messenger (ﷺ) and put a screen. He poured water over his hands, and washed them once or twice. (The sub-narrator added that he did not remember if she had said thrice or not). Then he poured water with his right hand over his left one and washed his private parts. He rubbed his hand over the earth or the wall and washed it. He rinsed his mouth and washed his nose by putting water in it and blowing it out. He washed his face, forearms and head. He poured water over his body and then withdrew from that place and washed his feet. I presented him a piece of cloth (towel) and he pointed with his hand (that he does not want it) and did not take it",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 267,
			"arabicnumber": 267,
			"text": "Narrated Muhammad bin Al-Muntathir:on the authority of his father that he had asked `Aisha (about the Hadith of Ibn `Umar). She said, \"May Allah be Merciful to Abu `Abdur-Rahman. I used to put scent on Allah's Messenger (ﷺ) and he used to go round his wives, and in the morning he assumed the Ihram, and the fragrance of scent was still coming out from his body",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 268,
			"arabicnumber": 268,
			"text": "Narrated Qatada:Anas bin Malik said, \"The Prophet (ﷺ) used to visit all his wives in a round, during the day and night and they were eleven in number.\" I asked Anas, \"Had the Prophet (ﷺ) the strength for it?\" Anas replied, \"We used to say that the Prophet (ﷺ) was given the strength of thirty (men).\" And Sa`id said on the authority of Qatada that Anas had told him about nine wives only (not eleven)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 269,
			"arabicnumber": 269,
			"text": "Narrated `Ali:I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet (ﷺ) I requested a man to ask him about it. So the man asked the Prophet (ﷺ) about it. The Prophet (ﷺ) replied, \"Perform ablution after washing your organ (penis)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 270,
			"arabicnumber": 270,
			"text": "Narrated Muhammad bin Al-Muntathir:on the authority of his father that he had asked `Aisha about the saying of Ibn `Umar (i.e. he did not like to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented Allah's Messenger (ﷺ) and he went round (had sexual intercourse with) all his wives, and in the morning he was Muhrim (after taking a bath)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 271,
			"arabicnumber": 271,
			"text": "Narrated `Aisha:It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was a Muhrim",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 273,
			"arabicnumber": 273,
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 274,
			"arabicnumber": 274,
			"text": "Narrated Maimuna:Water was placed for the ablution of Allah's Messenger (ﷺ) after Janaba. He poured water with his right hand over his left twice or thrice and then washed his private parts and rubbed his hand on the earth or on a wall twice or thrice and then rinsed his mouth, washed his nose by putting water in it and then blowing it out and then washed his face and forearms and poured water over his head and washed his body. Then he shifted from that place and washed his feet. I brought a piece of cloth, but he did not take it and removed the traces of water from his body with his hand",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 275,
			"arabicnumber": 275,
			"text": "Narrated Abu Huraira:Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Messenger (ﷺ) came out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us to stay at our places and went to take a bath and then returned with water dropping from his head. He said, \"Allahu-Akbar\", and we all offered the prayer with him",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 276,
			"arabicnumber": 276,
			"text": "Narrated Maimuna:I placed water for the bath of the Prophet (ﷺ) and screened him with a garment. He poured water over his hands and washed them. After that he poured water with his right hand over his left and washed his private parts, rubbed his hands with earth and washed them, rinsed his mouth, washed his nose by putting water in it and then blowing it out and then washed his face and forearms. He poured water over his head and body. He then shifted from that place and washed his feet. I gave him a piece of cloth but he did not take it and came out removing the water (from his body) with both his hands",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 277,
			"arabicnumber": 277,
			"text": "Narrated Aisha:Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 278,
			"arabicnumber": 278,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, 'The (people of) Bani Israel used to take bath naked (all together) looking at each other. The Prophet (ﷺ) Moses used to take a bath alone. They said, 'By Allah! Nothing prevents Moses from taking a bath with us except that he has a scrotal hernia.' So once Moses went out to take a bath and put his clothes over a stone and then that stone ran away with his clothes. Moses followed that stone saying, \"My clothes, O stone! My clothes, O stone! till the people of Bani Israel saw him and said, 'By Allah, Moses has got no defect in his body. Moses took his clothes and began to beat the stone.\" Abu Huraira added, \"By Allah! There are still six or seven marks present on the stone from that excessive beating",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 279,
			"arabicnumber": 279,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"When the Prophet (ﷺ) Job (Aiyub) was taking a bath naked, golden locusts began to fall on him. Job started collecting them in his clothes. His Lord addressed him, 'O Job! Haven't I given you enough so that you are not in need of them.' Job replied, 'Yes!' By Your Honor (power)! But I cannot dispense with Your Blessings",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 280,
			"arabicnumber": 280,
			"text": "Narrated Um Hani bint Abi Talib:I went to Allah's Messenger (ﷺ) in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet (ﷺ) asked, \"Who is it?\" I replied, \"I am Um-Hani",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 281,
			"arabicnumber": 281,
			"text": "Narrated Maimuna:I screened the Prophet (ﷺ) while he was taking a bath of Janaba. He washed his hands, poured water from his right hand over his left and washed his private parts. Then he rubbed his hand over a wall or the earth, and performed ablution similar to that for the prayer but did not wash his feet. Then he poured water over his body, shifted from that place, and washed his feet",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 282,
			"arabicnumber": 282,
			"text": "Narrated Um-Salama:(the mother of the believers) Um Sulaim, the wife of Abu Talha, came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Messenger (ﷺ) replied, \"Yes, if she notices a discharge",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 283,
			"arabicnumber": 283,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) came across me in one of the streets of Medina and at that time I was Junub. So I slipped away from him and went to take a bath. On my return the Prophet (ﷺ) said, \"O Abu Huraira! Where have you been?\" I replied, \"I was Junub, so I disliked to sit in your company.\" The Prophet (ﷺ) said, \"Subhan Allah! A believer never becomes impure",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 284,
			"arabicnumber": 284,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) used to visit all his wives in one night and he had nine wives at that time",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 285,
			"arabicnumber": 285,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) came across me and I was Junub. He took my hand and I went along with him till he sat down I slipped away, went home and took a bath. When I came back, he was still sitting there. He then said to me, \"O Abu Huraira! Where have you been?' I told him about it. The Prophet (ﷺ) said, \"Subhan Allah! O Abu Huraira! A believer never becomes impure",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 286,
			"arabicnumber": 286,
			"text": "Narrated Abu Salama:I asked `Aisha \"Did the Prophet (ﷺ) use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "Narrated `Umar bin Al-Khattab:I asked Allah's Messenger (ﷺ) \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution, he can sleep while he is Junub",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": 288,
			"text": "Narrated `Aisha:Whenever the Prophet (ﷺ) intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": 289,
			"text": "Narrated `Abdullah:`Umar asked the Prophet (ﷺ) \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": 290,
			"text": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab told Allah's Messenger (ﷺ), \"I became Junub at night.\" Allah's Messenger (ﷺ) replied, \"Perform ablution after washing your private parts and then sleep",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": 291,
			"text": "Narrated Hisham:as the following Hadith 290. Narrated Abu Huraira: The Prophet (ﷺ) said, \"When a man sits in between the four parts of a woman and did the sexual intercourse with her, bath becomes compulsory",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": 292,
			"text": "Narrated Zaid bin Khalid Al-Juhani:I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Messenger (ﷺ).\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and they gave the same reply. (Abu Aiyub said that he had heard that from Allah's Messenger (ﷺ) ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": 293,
			"text": "Narrated Ubai bin Ka`b:I asked Allah's Messenger (ﷺ) about a man who engages in sexual intercourse with his wife but does not discharge. He replied, \"He should wash the parts which comes in contact with the private parts of the woman, perform ablution and then pray.\" (Abu `Abdullah said, \"Taking a bath is safer and is the last order)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		}
	]
}