{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "Narrated `Abdullah bin Masud:I asked Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! What is the best deed?\" He replied, \"To offer the prayers at their early stated fixed times.\" I asked, \"What is next in goodness?\" He replied, \"To be good and dutiful to your parents.\" I further asked, what is next in goodness?\" He replied, \"To participate in Jihad in Allah's Cause.\" I did not ask Allah's Messenger (ﷺ) anymore and if I had asked him more, he would have told me more",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "Narrated Ibn `Abbas:Allah's Messenger (ﷺ) said, \"There is no Hijra (i.e. migration) (from Mecca to Medina) after the Conquest (of Mecca), but Jihad and good intention remain; and if you are called (by the Muslim ruler) for fighting, go forth immediately",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "Narrated `Aisha:(That she said), \"O Allah's Messenger (ﷺ)! We consider Jihad as the best deed. Should we not fight in Allah's Cause?\" He said, \"The best Jihad (for women) is Hajj-Mabrur (i.e. Hajj which is done according to the Prophet's tradition and is accepted by Allah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "Narrated Abu Huraira:A man came to Allah's Messenger (ﷺ) and said, \"Instruct me as to such a deed as equals Jihad (in reward).\" He replied, \"I do not find such a deed.\" Then he added, \"Can you, while the Muslim fighter is in the battle-field, enter your mosque to perform prayers without cease and fast and never break your fast?\" The man said, \"But who can do that?\" Abu- Huraira added, \"The Mujahid (i.e. Muslim fighter) is rewarded even for the footsteps of his horse while it wanders bout (for grazing) tied in a long rope",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "Narrated Abu Sa`id Al-Khudri:Somebody asked, \"O Allah's Messenger (ﷺ)! Who is the best among the people?\" Allah's Messenger (ﷺ) replied \"A believer who strives his utmost in Allah's Cause with his life and property.\" They asked, \"Who is next?\" He replied, \"A believer who stays in one of the mountain paths worshipping Allah and leaving the people secure from his mischief",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "Narrated Abu Huraira:I heard Allah's Messenger (ﷺ) saying, \"The example of a Mujahid in Allah's Cause-- and Allah knows better who really strives in His Cause----is like a person who fasts and prays continuously. Allah guarantees that He will admit the Mujahid in His Cause into Paradise if he is killed, otherwise He will return him to his home safely with rewards and war booty",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of Ubada bin As-Samit. Allah's Messenger (ﷺ), once visited her and she provided him with food and started looking for lice in his head. Then Allah's Messenger (ﷺ) slept, and afterwards woke up smiling. Umm Haram asked, \"What causes you to smile, O Allah's Messenger (ﷺ)?\" He said. \"Some of my followers who (in a dream) were presented before me as fighters in Allah's cause (on board a ship) amidst this sea caused me to smile; they were as kings on the thrones (or like kings on the thrones).\" (Ishaq, a sub-narrator is not sure as to which expression the Prophet (ﷺ) used.) Umm Haram said, \"O Allah's Messenger (ﷺ)! Invoke Allah that he makes me one of them. Allah's Messenger (ﷺ) invoked Allah for her and slept again and woke up smiling. Once again Umm Haram asked, \"What makes you smile, O Allah's Messenger (ﷺ)?\" He replied, \"Some of my followers were presented to me as fighters in Allah's Cause,\" repeating the same dream. Umm Haram said, \"O Allah's Messenger (ﷺ)! Invoke Allah that He makes me one of them.\" He said, \"You are amongst the first ones.\" It happened that she sailed on the sea during the Caliphate of Mu'awiya bin Abi Sufyan, and after she disembarked, she fell down from her riding animal and died",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Whoever believes in Allah and His Apostle, offer prayer perfectly and fasts the month of Ramadan, will rightfully be granted Paradise by Allah, no matter whether he fights in Allah's Cause or remains in the land where he is born.\" The people said, \"O Allah's Messenger (ﷺ) ! Shall we acquaint the people with the is good news?\" He said, \"Paradise has one-hundred grades which Allah has reserved for the Mujahidin who fight in His Cause, and the distance between each of two grades is like the distance between the Heaven and the Earth. So, when you ask Allah (for something), ask for Al-firdaus which is the best and highest part of Paradise.\" (i.e. The sub-narrator added, \"I think the Prophet also said, 'Above it (i.e. Al-Firdaus) is the Throne of Beneficent (i.e. Allah), and from it originate the rivers of Paradise",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "Narrated Samura:The Prophet (ﷺ) said, \"Last night two men came to me (in a dream) and made me ascend a tree and then admitted me into a better and superior house, better of which I have never seen. One of them said, 'This house is the house of martyrs",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"A single endeavor (of fighting) in Allah's Cause in the forenoon or in the afternoon is better than the world and whatever is in it",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"A place in Paradise as small as a bow is better than all that on which the sun rises and sets (i.e. all the world).\" He also said, \"A single endeavor in Allah's Cause in the afternoon or in the forenoon is better than all that on which the sun rises and sets",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "Narrated Sahl bin Sa`d:The Prophet (ﷺ) said, \"A single endeavor in Allah's Cause in the afternoon and in the forenoon is better than the world and whatever is in it",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "Narrated Anas bin Malik: The Prophet (ﷺ) said, \"Nobody who dies and finds good from Allah (in the Hereafter) would wish to come back to this world even if he were given the whole world and whatever is in it, except the martyr who, on seeing the superiority of martyrdom, would like to come back to the world and get killed again (in Allah's Cause)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "Narrated Anas:The Prophet (ﷺ) said, \"A single endeavor (of fighting) in Allah's Cause in the afternoon or in the forenoon is better than all the world and whatever is in it. A place in Paradise as small as the bow or lash of one of you is better than all the world and whatever is in it. And if a houri from Paradise appeared to the people of the earth, she would fill the space between Heaven and the Earth with light and pleasant scent and her head cover is better than the world and whatever is in it",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"By Him in Whose Hands my life is! Were it not for some men amongst the believers who dislike to be left behind me and whom I cannot provide with means of conveyance, I would certainly never remain behind any Sariya' (army-unit) setting out in Allah's Cause. By Him in Whose Hands my life is! I would love to be martyred in Allah's Cause and then get resurrected and then get martyred, and then get resurrected again and then get martyred and then get resurrected again and then get martyred",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) delivered a sermon and said, \"Zaid took the flag and was martyred, and then Ja`far took the flag and was martyred, and then `Abdullah bin Rawaha took the flag and was martyred too, and then Khalid bin Al-Walid took the flag though he was not appointed as a commander and Allah made him victorious.\" The Prophet (ﷺ) further added, \"It would not please us to have them with us.\" Aiyub, a sub-narrator, added, \"Or the Prophet, shedding tears, said, 'It would not please them to be with us",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "Narrated Anas bin Malik:Um Haram said, \"Once the Prophet (ﷺ) slept in my house near to me and got up smiling. I said, 'What makes you smile?' He replied, 'Some of my followers who (i.e. in a dream) were presented to me sailing on this green sea like kings on thrones.' I said, 'O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" So the Prophet (ﷺ) invoked Allah for her and went to sleep again. He did the same (i.e. got up and told his dream) and Um Haran repeated her question and he gave the same reply. She said, \"Invoke Allah to make me one of them.\" He said, \"You are among the first batch.\" Later on it happened that she went out in the company of her husband 'Ubada bin As-Samit who went for Jihad and it was the first time the Muslims undertook a naval expedition led by Mu awiya. When the expedition came to an end and they were returning to Sham, a riding animal was presented to her to ride, but the animal let her fall and thus she died",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "Narrated Anas:The Prophet (ﷺ) sent seventy men from the tribe of Bani Salim to the tribe of Bani Amir. When they reached there, my maternal uncle said to them, \"I will go ahead of you, and if they allow me to convey the message of Allah's Messenger (ﷺ) (it will be all right); otherwise you will remain close to me.\" So he went ahead of them and the pagans granted him security But while he was reporting the message of the Prophet (ﷺ) , they beckoned to one of their men who stabbed him to death. My maternal uncle said, \"Allah is Greater! By the Lord of the Ka`ba, I am successful.\" After that they attached the rest of the party and killed them all except a lame man who went up to the top of the mountain. (Hammam, a sub-narrator said, \"I think another man was saved along with him).\" Gabriel informed the Prophet (ﷺ) that they (i.e the martyrs) met their Lord, and He was pleased with them and made them pleased. We used to recite, \"Inform our people that we have met our Lord, He is pleased with us and He has made us pleased \" Later on this Qur'anic Verse was cancelled. The Prophet (ﷺ) invoked Allah for forty days to curse the murderers from the tribe of Ral, Dhakwan, Bani Lihyan and Bam Usaiya who disobeyed Allah and his Apostle",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "Narrated Jundab bin Sufyan:In one of the holy Battles a finger of Allah's Messenger (ﷺ) (got wounded and) bled. He said, \"You are just a finger that bled, and what you got is in Allah's Cause",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is! Whoever is wounded in Allah's Cause....and Allah knows well who gets wounded in His Cause....will come on the Day of Resurrection with his wound having the color of blood but the scent of musk",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "Narrated `Abdullah bin `Abbas:That Abu Sufyan told him that Heraclius said to him, \"I asked you about the outcome of your battles with him (i.e. the Prophet (ﷺ) ) and you told me that you fought each other with alternate success. So the Apostles are tested in this way but the ultimate victory is always theirs",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "Narrated Kharija bin Zaid:Zaid bin Thabit said, \"When the Qur'an was compiled from various written manuscripts, one of the Verses of Surat Al-Ahzab was missing which I used to hear Allah's Messenger (ﷺ) reciting. I could not find it except with Khuza`ima bin Thabjt Al-Ansari, whose witness Allah's Messenger (ﷺ) regarded as equal to the witness of two men. And the Verse was:-- \"Among the believers are men who have been true to what they covenanted with Allah.\" (33.23)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "Narrated Al-Bara:A man whose face was covered with an iron mask (i.e. clad in armor) came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Shall I fight or embrace Islam first? \"The Prophet (ﷺ) said, \"Embrace Islam first and then fight.\" So he embraced Islam, and was martyred. Allah's Messenger (ﷺ) said, A Little work, but a great reward. \"(He did very little (after embracing Islam), but he will be rewarded in abundance",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "Narrated Anas bin Malik:Um Ar-Rubai'bint Al-Bara', the mother of Hartha bin Suraqa came to the Prophet (ﷺ) and said, \"O Allah's Prophet! Will you tell me about Hartha?\" Hartha has been killed (i.e. martyred) on the day of Badr with an arrow thrown by an unidentified person. She added, \"If he is in Paradise, I will be patient; otherwise, I will weep bitterly for him.\" He said, \"O mother of Hartha! There are Gardens in Paradise and your son got the Firdausal-ala (i.e. the best place in Paradise)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "Narrated Abu Musa:A man came to the Prophet (ﷺ) and asked, \"A man fights for war booty; another fights for fame and a third fights for showing off; which of them fights in Allah's Cause?\" The Prophet (ﷺ) said, \"He who fights that Allah's Word (i.e. Islam) should be superior, fights in Allah's Cause",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "Narrated Abu `Abs:(who is `Abdur-Rahman bin Jabir) Allah's Messenger (ﷺ) said,\" Anyone whose both feet get covered with dust in Allah's Cause will not be touched by the (Hell) fire",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "Narrated `Ikrima:that Ibn `Abbas told him and `Ali bin `Abdullah to go to Abu Sa`id and listen to some of his narrations; So they both went (and saw) Abu Sa`id and his brother irrigating a garden belonging to them. When he saw them, he came up to them and sat down with his legs drawn up and wrapped in his garment and said, \"(During the construction of the mosque of the Prophet) we carried the adobe of the mosque, one brick at a time while `Ammar used to carry two at a time. The Prophet (ﷺ) passed by `Ammar and removed the dust off his head and said, \"May Allah be merciful to `Ammar. He will be killed by a rebellious aggressive group. `Ammar will invite them to (obey) Allah and they will invite him to the (Hell) fire",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "Narrated `Aisha:When Allah's Messenger (ﷺ) returned on the day (of the battle) of Al-Khandaq (i.e. Trench), he put down his arms and took a bath. Then Gabriel whose head was covered with dust, came to him saying, \"You have put down your arms! By Allah, I have not put down my arms yet.\" Allah's Messenger (ﷺ) said, \"Where (to go now)?\" Gabriel said, \"This way,\" pointing towards the tribe of Bani Quraiza. So Allah's Messenger (ﷺ) went out towards them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "Narrated Anas bin Malik:For thirty days Allah's Messenger (ﷺ) invoked Allah to curse those who had killed the companions of Bir- Mauna; he invoked evil upon the tribes of Ral, Dhakwan, and Usaiya who disobeyed Allah and His Apostle. There was reveled about those who were killed at Bir-Mauna a Qur'anic Verse we used to recite, but it was cancelled later on. The Verse was: \"Inform our people that we have met our Lord. He is pleased with us and He has made us pleased",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "Narrated Jabir bin `Abdullah:\"Some people drank alcohol in the morning of the day (of the battle) of Uhud and were martyred (on the same day).\" Sufyan was asked, \"(Were they martyred) in the last part of the day?)\" He replied, \"Such information does not occur in the narration",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "Narrated Jabir:My father's mutilated body was brought to the Prophet (ﷺ) and was placed in front of him. I went to uncover his face but my companions forbade me. Then mourning cries of a lady were heard, and it was said that she was either the daughter or the sister of `Amr. The Prophet (ﷺ) said, \"Why is she crying?\" Or said, \"Do not cry, for the angels are still shading him with their wings.\" (Al-Bukhari asked Sadqa, a sub-narrator, \"Does the narration include the expression: 'Till he was lifted?' \" The latter replied, \"Jabir may have said it)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "Narrated Anas bin Malik: The Prophet (ﷺ) said, \"Nobody who enters Paradise likes to go back to the world even if he got everything on the earth, except a Mujahid who wishes to return to the world so that he may be martyred ten times because of the dignity he receives (from Allah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "Narrated `Abdullah bin Abi `Aufa:Allah's Messenger (ﷺ) said, \"Know that Paradise is under the shades of swords",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Once Solomon, son of David said, '(By Allah) Tonight I will have sexual intercourse with one hundred (or ninety-nine) women each of whom will give birth to a knight who will fight in Allah's Cause.' On that a (i.e. if Allah wills) but he did not say, 'Allah willing.' Therefore only one of those women conceived and gave birth to a half-man. By Him in Whose Hands Muhammad's life is, if he had said, \"Allah willing', (he would have begotten sons) all of whom would have been knights striving in Allah's Cause",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "Narrated Anas:The Prophet (ﷺ) was the best, the bravest and the most generous of all the people. Once when the people of Medina got frightened, the Prophet (ﷺ) rode a horse and went ahead of them and said, \"We found this horse very fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "Narrated Muhammad bin Jubair:Jubair bin Mut`im told me that while he was in the company of Allah's Messenger (ﷺ) with the people returning from Hunain, some people (bedouins) caught hold of the Prophet (ﷺ) and started begging of him so much so that he had to stand under a (kind of thorny tree (i.e. Samurah) and his cloak was snatched away. The Prophet (ﷺ) stopped and said, \"Give me my cloak. If I had as many camels as these thorny trees, I would have distributed them amongst you and you will not find me a miser or a liar or a coward",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "Narrated `Amr bin Maimun Al-Audi:Sa`d used to teach his sons the following words as a teacher teaches his students the skill of writing and used to say that Allah's Messenger (ﷺ) used to seek Refuge with Allah from them (i.e. the evils) at the end of every prayer. The words are: 'O Allah! I seek refuge with You from cowardice, and seek refuge with You from being brought back to a bad stage of old life and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishments in the grave",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from helplessness, laziness, cowardice and feeble old age; I seek refuge with You from afflictions of life and death and seek refuge with You from the punishment in the grave",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "Narrated As-Sa'-ib bin Yazid:I was in the company of Talha bin 'Ubaidullah, Sa`d, Al-Miqdad bin Al-Aswad and `Abdur Rahman bin `Auf and I heard none of them narrating anything from Allah's Messenger (ﷺ) but Talha was talking about the day (of the battle) of Uhud",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "Narrated Ibn `Abbas:On the day of the Conquest (of Mecca) the Prophet (ﷺ) said, \"There is no emigration after the Conquest but Jihad and intentions. When you are called (by the Muslim ruler) for fighting, go forth immediately.\" (See Hadith No. 42)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Allah welcomes two men with a smile; one of whom kills the other and both of them enter Paradise. One fights in Allah's Cause and gets killed. Later on Allah forgives the 'killer who also get martyred (In Allah's Cause)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "Narrated Abu Huraira: I went to Allah's Messenger (ﷺ) while he was at Khaibar after it had fallen in the Muslims' hands. I said, \"O Allah's Messenger (ﷺ)! Give me a share (from the land of Khaibar).\" One of the sons of Sa'id bin Al-'As said, \"O Allah's Messenger (ﷺ)! Do not give him a share.\" I said, \"This is the murderer of Ibn Qauqal.\" The son of Said bin Al-As said, \"Strange! A Wabr (i.e. guinea pig) who has come down to us from the mountain of Qaduim (i.e. grazing place of sheep) blames me for killing a Muslim who was given superiority by Allah because of me, and Allah did not disgrace me at his hands (i.e. was not killed as an infidel).\" (The sub-narrator said \"I do not know whether the Prophet (ﷺ) gave him a share or not",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "Narrated Anas bin Malik:In the life-time of the Prophet, Abu Talha did not fast because of the Jihad, but after the Prophet (ﷺ) died I never saw him without fasting except on `Id-ul-Fitr and `Id-ul-Aclha",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Five are regarded as martyrs: They are those who die because of plague, Abdominal disease, drowning or a falling building etc., and the martyrs in Allah's Cause",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"Plague is the cause of martyrdom of every Muslim (who dies because of it)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "Narrated Al-Bara:When the Divine Inspiration: \"Those of the believers who sit (at home), was revealed the Prophet (ﷺ) sent for Zaid (bin Thabit) who came with a shoulder-blade and wrote on it. Ibn Um-Maktum complained about his blindness and on that the following revelation came: \"Not equal are those believers who sit (at home) except those who are disabled (by injury, or are blind or lame etc.) and those who strive hard and fight in the Way of Allah with their wealth and lives).\" (4.95)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "Narrated Sahl bin Sa`d As-Sa`idi:I saw Marwan bin Al-Hakam sitting in the Mosque. So I came forward and sat by his side. He told us that Zaid bin Thabit had told him that Allah's Messenger (ﷺ) had dictated to him the Divine Verse: \"Not equal are those believers who sit (at home) and those who strive hard and fight in the Cause of Allah with their wealth and lives.' (4.95) Zaid said, \"Ibn-Maktum came to the Prophet (ﷺ) while he was dictating to me that very Verse. On that Ibn Um Maktum said, \"O Allah's Messenger (ﷺ)! If I had power, I would surely take part in Jihad.\" He was a blind man. So Allah sent down revelation to His Apostle while his thigh was on mine and it became so heavy for me that I feared that my thigh would be broken. Then that state of the Prophet (ﷺ) was over after Allah revealed \"...except those who are disabled (by injury or are blind or lame etc.) (4.95)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "Narrated Salim Abu-An-Nadr:`Abdullah bin Abi `Aufa wrote and I read what he wrote that Allah's Messenger (ﷺ) said, \"When you face them ( i.e. your enemy) then be patient",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "Narrated Anas:Allah's Messenger (ﷺ) went towards the Khandaq (i.e. Trench) and saw the Emigrants and the Ansar digging in a very cold morning as they did not have slaves to do that for them. When he noticed their fatigue and hunger he said, \"O Allah! The real life is that of the Here-after, (so please) forgive the Ansar and the Emigrants.\" In its reply the Emigrants and the Ansar said, \"We are those who have given a pledge of allegiance to Muhammad that we will carry on Jihad as long as we live",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "Narrated Anas:The Emigrants and the Ansar started digging the trench around Medina carrying the earth on their backs and saying, \"We are those who have given a pledge of allegiance to Muhammad that we will I carry on Jihad as long as we live.\" The Prophet (ﷺ) kept on replying, \"O Allah, there is no good except the good of the Hereafter; so confer Your Blessings on the Ansar and the Emigrants",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "Narrated Al-Bara:The Prophet (ﷺ) went on carrying (i.e. the earth) and saying, \"Without You (O Allah!) we would have got no guidance",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "Narrated Al-Bara:On the day (of the battle) of Al-Ahzab (i.e. clans) I saw the Prophet (ﷺ) carrying earth, and the earth was covering the whiteness of his `Abdomen. And he was saying, \"Without You (O Allah!) we would have got no guidance, nor given in charity, nor prayed. So please bless us with tranquility and make firm our feet when we meet our enemies. Indeed (these) people have rebelled against (oppressed) us but never shall we yield if they try to bring affliction upon us",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "Narrated Anas:We returned from the Ghazwa of Tabuk along with the Prophet. (See Hadith No. 92 below)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "Narrated Anas:While the Prophet (ﷺ) was in a Ghazwa he said, \"Some people have remained behind us in Medina and we never crossed a mountain path or a valley, but they were with us (i.e. sharing the reward with us), as they have been held back by a (legal) excuse",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "Narrated Abu Sa`id:I heard the Prophet (ﷺ) saying, \"Indeed, anyone who fasts for one day for Allah's Pleasure, Allah will keep his face away from the (Hell) fire for (a distance covered by a journey of) seventy years",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Whoever spends two things in Allah's Cause, will be called by all the gate-keepers of Paradise who will be saying, 'O so-and-so! Come here.' \" Abu Bakr said, \"O Allah's Messenger (ﷺ)! Such persons will never be destroyed.\" The Prophet (ﷺ) said, \"I hope you will be one of them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) ascended the pulpit and said, \"Nothing worries me as to what will happen to you after me, except the temptation of worldly blessings which will be conferred on you.\" Then he mentioned the worldly pleasures. He started with the one (i.e. the blessings) and took up the other (i.e. the pleasures). A man got up saying, \"O Allah's Messenger (ﷺ)! Can the good bring about evil?\" The Prophet (ﷺ) remained silent and we thought that he was being inspired divinely, so all the people kept silent with awe. Then the Prophet (ﷺ) wiped the sweat off his face and asked, \"Where is the present questioner?\" \"Do you think wealth is good?\" he repeated thrice, adding, \"No doubt, good produces nothing but good. Indeed it is like what grows on the banks of a stream which either kills or nearly kills the grazing animals because of gluttony except the vegetation-eating animal which eats till both its flanks are full (i.e. till it gets satisfied) and then stands in the sun and defecates and urinates and again starts grazing. This worldly property is sweet vegetation. How excellent the wealth of the Muslim is, if it is collected through legal means and is spent in Allah's Cause and on orphans, poor people and travelers. But he who does not take it legally is like an eater who is never satisfied and his wealth will be a witness against him on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "Narrated Zaid bin Khalid:Allah's Messenger (ﷺ) said, \" He who pre pares a Ghazi going in Allah's Cause is given a reward equal to that of) a Ghazi; and he who looks after properly the dependents of a Ghazi going in Allah's Cause is (given a reward equal to that of) Ghazi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "Narrated Anas:The Prophet (ﷺ) used not to enter any house in Medina except the house of Um Sulaim besides those of his wives when he was asked why, he said, \"I take pity on her as her brother was killed in my company",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "Narrated Ibn `Aun:Once Musa bin Anas while describing the battle of Yamama, said, \"Anas bin Malik went to Thabit bin Qais, who had lifted his clothes from his thighs and was applying Hunut to his body. Anas asked, 'O Uncle! What is holding you back (from the battle)?' He replied, 'O my nephew! I am coming just now,' and went on perfuming himself with Hunut, then he came and sat (in the row). Anas then mentioned that the people fled from the battle-field. On that Thabit said, 'Clear the way for me to fight the enemy. We would never do so (i.e. flee) in the company of Allah's Messenger (ﷺ). How bad the habits you have acquired from your enemies",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "Narrated Jabir:The Prophet (ﷺ) said, \"Who will bring me the information about the enemy on the day (of the battle) of Al-Ahzab (i.e. Clans)?\" Az-Zubair said, \"I will.\" The Prophet (ﷺ) said again, \"Who will bring me the information about the enemy?\" Az-Zubair said again, \"I will.\" The Prophet (ﷺ) said, \"Every prophet had a disciple and my disciple is Az-Zubair",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "Narrated Jabir bin `Abdullah:When the Prophet (ﷺ) called the people (Sadqa, a sub-narrator, said, 'Most likely that happened on the day of Al-Khandaq) Az-Zubair responded to the call (i.e. to act as a scout). The Prophet) called the people again and Az-Zubair responded to the call. The Prophet (ﷺ) then said, \"Every prophet had a disciple and my disciple is Zubair bin Al-`Awwam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "Narrated Malik bin Al-Huwairith:On my departure from the Prophet (ﷺ) he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "Narrated Urwa bin Ja'd:The Prophet (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) (ﷺ) said, \"There is a blessing in the fore-heads of horses",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "Narrated `Urwa Al-Bariqi:The Prophet (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses (for Jihad) till the Day of Resurrection, for they bring about either a reward (in the Hereafter) or (war) booty (in this world)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"If somebody keeps a horse in Allah's Cause motivated by his faith in Allah and his belief in His Promise, then he will be rewarded on the Day of Resurrection for what the horse has eaten or drunk and for its dung and urine",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "Narrated `Abdullah bin Abi Qatada:(from his father) Abu Qatada went out (on a journey) with Allah's Messenger (ﷺ) but he was left behind with some of his companions who were in the state of Ihram. He himself was not in the state of Ihram. They saw an opener before he could see it. When they saw the opener, they did not speak anything till Abu Qatada saw it. So, he rode over his horse called Al-Jarada and requested them to give him his lash, but they refused. So, he himself took it and then attacked the opener and slaughtered it. He ate of its meat and his companions ate, too, but they regretted their eating. When they met the Prophet (they asked him about it) and he asked, \"Have you some of its meat (left) with you?\" Abu Qatada replied, \"Yes, we have its leg with us.\" So, the Prophet (ﷺ) took and ate it",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "Narrated Sahl:In our garden there was a horse belonging to the Prophet (ﷺ) called Al-Luhaif or Al-Lakhif",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "Narrated Mu`adh:I was a companion rider of the Prophet (ﷺ) on a donkey called 'Ufair. The Prophet (ﷺ) asked, \"O Mu`adh! Do you know what Allah's right on His slaves is, and what the right of His slaves on Him is?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on His slaves is that they should worship Him (Alone) and should not worship any besides Him. And slave's right on Allah is that He should not punish him who worships none besides Him.\" I said, \"O Allah's Messenger (ﷺ)! Should I not inform the people of this good news?\" He said, \"Do not inform them of it, lest they should depend on it (absolutely)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "Narrated Anas bin Malik:Once there was a feeling of fright in Medina, so the Prophet (ﷺ) borrowed a horse belonging to us called Mandub (and he rode away on it). (When the Prophet (ﷺ) returned) he said, \"I have not seen anything of fright and I found it (i.e. this horse) very fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "Narrated `Abdullah bin `Umar:I heard the Prophet (ﷺ) saying. \"Evil omen is in three things: The horse, the woman and the house",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "Narrated Sahl bin Sa`d Saidi:Allah's Messenger (ﷺ) said \"If there is any evil omen in anything, then it is in the woman, the horse and the house",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \" Horses are kept for one of three purposes; for some people they are a source of reward, for some others they are a means of shelter and for some others they are a source of sins. The one for whom they are a source of reward, is he who keeps a horse for Allah's Cause (i.e. Jihad) tying it with a long tether on a meadow or in a garden with the result that whatever it eats from the area of the meadow or the garden where it is tied will be counted as good deeds for his benefit, and if it should break its rope and jump over one or two hillocks then all its dung and its foot marks will be written as good deeds for him; and if it passes by a river and drinks water from it even though he had no intention of watering it, even then he will get the reward for its drinking. As for the man for whom horses are a source of sins, he is the one who keeps a horse for the sake of pride and pretense and showing enmity for Muslims: such a horse will be a source of sins for him. When Allah's Messenger (ﷺ) was asked about donkeys, he replied, \"Nothing has been revealed to me about them except this unique, comprehensive Verse: \"Then anyone who does an atom's (or a small ant's) weight of good shall see it; And anyone who does an atom's (or a small ant's) weight of evil, shall see it.' (101.7-8)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "Narrated Muslim from Abu `Aqil from Abu Al-Mutawakkil An-Naji:I called on Jabir bin `Abdullah Al-Ansari and said to him, \"Relate to me what you have heard from Allah's Messenger (ﷺ) .\" He said, \"I accompanied him on one of the journeys.\" (Abu `Aqil said, \"I do not know whether that journey was for the purpose of Jihad or `Umra.\") \"When we were returning,\" Jabir continued, \"the Prophet (ﷺ) said, 'Whoever wants to return earlier to his family, should hurry up.' We set off and I was on a black red tainted camel having no defect, and the people were behind me. While I was in that state the camel stopped suddenly (because of exhaustion). On that the Prophet (ﷺ) said to me, 'O Jabir, wait!' Then he hit it once with his lash and it started moving on a fast pace. He then said, 'Will you sell the camel?' I replied in the affirmative when we reached Medina, and the Prophet (ﷺ) went to the Mosque along with his companions. I, too, went to him after tying the camel on the pavement at the Mosque gate. Then I said to him, 'This is your camel.' He came out and started examining the camel and saying, 'The camel is ours.' Then the Prophet (ﷺ) sent some Awaq (i.e. an amount) of gold saying, 'Give it to Jabir.' Then he asked, 'Have you taken the full price (of the camel)?' I replied in the affirmative. He said, 'Both the price and the camel are for you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "Narrated Anas bin Malik:There was a feeling of fright in Medina, so the Prophet (ﷺ) borrowed a horse called Mandub belonging 'to Abu Talha and mounted it. (On his return), he said, \"I did not see anything of fright and I found this horse very fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) fixed two shares for the horse and one share for its rider (from the war booty)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "Narrated Abu 'Is-haq:Somebody asked Al-Bar-a bin `Azib, \"Did you flee deserting Allah's Messenger (ﷺ) during the battle of Hunain?\" Al-Bara replied, \"But Allah's Messenger (ﷺ) did not flee. The people of the Tribe of Hawazin were good archers. When we met them, we attacked them, and they fled. When the Muslims started collecting the war booty, the pagans faced us with arrows, but Allah's Messenger (ﷺ) did not flee. No doubt, I saw him on his white mule and Abu Sufyan was holding its reins and the Prophet (ﷺ) was saying, 'I am the Prophet (ﷺ) in truth: I am the son of `Abdul Muttalib",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "Narrated Ibn'`Umar:When the Prophet (ﷺ) put his feet in the stirrup and the she-camel got up carrying him he would start reciting Talbiya at the mosque of Dhul-Hulaifa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "Narrated Anas:The Prophet (ﷺ) met them (i.e. the people) while he was riding an unsaddled horse with his sword slung over his shoulder",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "Narrated Anas bin Malik:Once the people of Medina were frightened, so the Prophet (ﷺ) rode a horse belonging to Abu Talha and it ran slowly, or was of narrow paces. When he returned, he said, \"I found your (i.e. Abu Talha's) horse very fast. After that the horse could not be surpassed in running",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "Narrated (`Abdullah) bin `Umar:The Prophet (ﷺ) arranged for a horse race amongst the horses that had been made lean to take place between Al-Hafya'' and Thaniyat Al-Wada` (i.e. names of two places) and the horses which had not been mad.? lean from Ath-Thaniyat to the mosque of Bani Zuraiq. I was also amongst those who took part in that horse race. Sufyan, a sub-narrator, said, \"The distance between Al-Hafya and Thaniya Al- Wada` is five or six miles; and between Thaniya and the mosque of Bani Zuraiq is one mile",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "Narrated `Abdullah:The Prophet (ﷺ) arranged for a horse race of the horses which had not been made lean; the area of the race was from Ath-Thaniya to the mosque of Bani Zuraiq. (The sub-narrator said, \"`Abdullah bin `Umar was amongst those who participated in that horse race)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "Narrated Abu 'Is-haq from Musa bin `Uqba from Mafia from Ibn `Umar who said:\"Allah's Messenger (ﷺ) arranged a horse race amongst the horses that had been made lean, letting them start from Al-Hafya' and their limit (distance of running) was up to Thaniyat-al-Wada`. I asked Musa, 'What was the distance between the two places?' Musa replied, 'Six or seven miles. He arranged a race of the horses which had not been made lean sending them from Thaniyat-al-Wada`, and their limit was up to the mosque of Bani Zuraiq.' I asked, 'What was the distance between those two places?' He replied 'One mile or so.' Ibn `Umar was amongst those who participated in that horse race",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "Narrated Anas:The she camel of the Prophet (ﷺ) was called Al-Adba",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "Narrated Anas:The Prophet (ﷺ) had a she camel called Al Adba which could not be excelled in a race. (Humaid, a subnarrator said, \"Or could hardly be excelled.\") Once a bedouin came riding a camel below six years of age which surpasses it (i.e. Al-`Adba') in the race. The Muslims felt it so much that the Prophet (ﷺ) noticed their distress. He then said, \"It is Allah's Law that He brings down whatever rises high in the world",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "Narrated `Amr bin Al-Harith:The Prophet (ﷺ) did not leave anything behind him after his death except a white mule, his arms and a piece of land which he left to be given in charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "Narrated Al-Bara:that a man asked him. \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah, the Prophet (ﷺ) did not flee but the hasty people fled and the people of the Tribe of Hawazin attacked them with arrows, while the Prophet (ﷺ) was riding his white mule and Abu Sufyan bin Al-Harith was holding its reins, and the Prophet (ﷺ) was saying, 'I am the Prophet (ﷺ) in truth, I am the son of `Abdul Muttalib",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "Narrated `Aisha:the mother of the faithful believers, I requested the Prophet (ﷺ) permit me to participate in Jihad, but he said, \"Your Jihad is the performance of Hajj",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "Narrated `Aisha:the mother of the faithful believers: The Prophet (ﷺ) was asked by his wives about the Jihad and he replied, \"The best Jihad (for you) is (the performance of) Hajj",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "Narrated Anas:Allah's Messenger (ﷺ) went to the daughter of Milhan and reclined there (and slept) and then (woke up) smiling. She asked, \"O Allah's Messenger (ﷺ)! What makes you smile?\" He replied, (I dreamt that) some people amongst my followers were sailing on the green sea in Allah's Cause, resembling kings on thrones.\" She said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" He said, \"O Allah! Let her be one of them.\" Then he (slept again and woke up and) smiled. She asked him the same question and he gave the same reply. She said, \"Invoke Allah to make me one of them.\" He replied, ''You will be amongst the first group of them; you will not be amongst the last.\" Later on she married 'Ubada bin As-Samit and then she sailed on the sea with bint Qaraza, Mu'awiya's wife (for Jihad). On her return, she mounted her riding animal, which threw her down breaking her neck, and she died on falling down",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "Narrated `Aisha:Whenever the Prophet (ﷺ) intended to proceed on a journey, he used to draw lots amongst his wives and would take the one upon whom the lot fell. Once, before setting out for Jihad, he drew lots amongst us and the lot came to me; so I went with the Prophet; and that happened after the revelation of the Verse Hijab (i.e. veiling)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "Narrated Anas:On the day (of the battle) of Uhad when (some) people retreated and left the Prophet, I saw `Aisha bint Abu Bakr and Um Sulaim, with their robes tucked up so that the bangles around their ankles were visible hurrying with their water skins (in another narration it is said, \"carrying the water skins on their backs\"). Then they would pour the water in the mouths of the people, and return to fill the water skins again and came back again to pour water in the mouths of the people",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "Narrated Tha`laba bin Abi Malik:`Umar bin Al-Khattab distributed some garments amongst the women of Medina. One good garment remained, and one of those present with him said, \"O chief of the believers! Give this garment to your wife, the (grand) daughter of Allah's Messenger (ﷺ).\" They meant Um Kulthum, the daughter of `Ali. `Umar said, Um Salit has more right (to have it).\" Um Salit was amongst those Ansari women who had given the pledge of allegiance to Allah's Messenger (ﷺ).' `Umar said, \"She (i.e. Um Salit) used to carry the water skins for us on the day of Uhud",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "Narrated Ar-Rubayyi 'bint Mu'auwidh:We were in the company of the Prophet (ﷺ) providing the wounded with water and treating them and bringing the killed to Medina (from the battle field)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "Narrated Ar-Rabi'bint Mu'auwidh:We used to take part in holy battles with the Prophet (ﷺ) by providing the people with water and serving them and bringing the killed and the wounded back to Medina",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "Narrated Abu Musa:Abu 'Amir was hit with an arrow in his knee, so I went to him and he asked me to remove the arrow. When I removed it, the water started dribbling from it. Then I went to the Prophet (ﷺ) and told him about it. He said, \"O Allah! Forgive `Ubaid Abu 'Amir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "Narrated `Aisha:The Prophet (ﷺ) was vigilant one night and when he reached Medina, he said, \"Would that a pious man from my companions guard me tonight!\" Suddenly we heard the clatter of arms. He said, \"Who is that? \" He (The new comer) replied, \" I am Sa`d bin Abi Waqqas and have come to guard you.\" So, the Prophet (ﷺ) slept (that night)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "Narrated Abu Huraira: The Prophet (ﷺ) said, \"Let the slave of Dinar and Dirham of Quantify and Khamisa (i.e. money and luxurious clothes) perish for he is pleased if these things are given to him, and if not, he is displeased",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \" Let the slave of Dinar and Dirham, of Quantify and Khamisa perish as he is pleased if these things are given to him, and if not, he is displeased. Let such a person perish and relapse, and if he is pierced with a thorn, let him not find anyone to take it out for him. Paradise is for him who holds the reins of his horse to strive in Allah's Cause, with his hair unkempt and feet covered with dust: if he is appointed in the vanguard, he is perfectly satisfied with his post of guarding, and if he is appointed in the rearward, he accepts his post with satisfaction; (he is so simple and unambiguous that) if he asks for permission he is not permitted, and if he intercedes, his intercession is not accepted",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "Narrated Anas:I was in the company of Jabir bin `Abdullah on a journey and he used to serve me though he was older than I. Jarir said, \"I saw the Ansar doing a thing (i.e. showing great reverence to the Prophet (ﷺ) ) for which I have vowed that whenever I meet any of them, I will serve him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "Narrated Anas bin Malik:I went along with the Prophet (ﷺ) to Khaibar so as to serve him. (Later on) when the Prophet (ﷺ) returned he, on seeing the Uhud mountain, said, \"This is a mountain that loves us and is loved by us.\" Then he pointed to Medina with his hand saying, \"O Allah! I make the area which is in between Medina's two mountains a sanctuary, as Abraham made Mecca a sanctuary. O Allah! Bless us in our Sa` and Mudd (i.e. units of measuring)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "Narrated Anas:We were with the Prophet (on a journey) and the only shade one could have was the shade made by one's own garment. Those who fasted did not do any work and those who did not fast served the camels and brought the water on them and treated the sick and (wounded). So, the Prophet (ﷺ) said, \"Today, those who were not fasting took (all) the reward",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Charity is obligatory everyday on every joint of a human being. If one helps a person in matters concerning his riding animal by helping him to ride it or by lifting his luggage on to it, all this will be regarded charity. A good word, and every step one takes to offer the compulsory Congregational prayer, is regarded as charity; and guiding somebody on the road is regarded as charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "Narrated Sahl bin Sa`d As-Sa'di:Allah's Messenger (ﷺ) said, \"To guard Muslims from infidels in Allah's Cause for one day is better than the world and whatever is on its surface, and a place in Paradise as small as that occupied by the whip of one of you is better than the world and whatever is on its surface; and a morning's or an evening's journey which a slave (person) travels in Allah's Cause is better than the world and whatever is on its surface",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said to Abu Talha, \"Choose one of your boy servants to serve me in my expedition to Khaibar.\" So, Abu Talha took me letting me ride behind him while I was a boy nearing the age of puberty. I used to serve Allah's Messenger (ﷺ) when he stopped to rest. I heard him saying repeatedly, \"O Allah! I seek refuge with You from distress and sorrow, from helplessness and laziness, from miserliness and cowardice, from being heavily in debt and from being overcome by men.\" Then we reached Khaibar; and when Allah enabled him to conquer the Fort (of Khaibar), the beauty of Safiya bint Huyai bin Akhtab was described to him. Her husband had been killed while she was a bride. So Allah's Messenger (ﷺ) selected her for himself and took her along with him till we reached a place called Sa`d-AsSahba,' where her menses were over and he took her for his wife. Haris (a kind of dish) was served on a small leather sheet. Then Allah's Messenger (ﷺ) told me to call those who were around me. So, that was the marriage banquet of Allah's Messenger (ﷺ) and Safiya. Then we left for Medina. I saw Allah's Apostle folding a cloak round the hump of the camel so as to make a wide space for Safiya (to sit on behind him) He sat beside his camel letting his knees for Safiya to put her feet on so as to mount the camel. Then, we proceeded till we approached Medina; he looked at Uhud (mountain) and said, \"This is a mountain which loves us and is loved by us.\" Then he looked at Medina and said, \"O Allah! I make the area between its (i.e. Medina's) two mountains a sanctuary as Abraham made Mecca a sanctuary. O Allah! Bless them (i.e. the people of Medina) in their Mudd and Sa (i.e. measures)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "Narrated Anas bin Malik:Um Haram told me that the Prophet (ﷺ) one day took a midday nap in her house. Then he woke up smiling. Um Haram asked, \"O Allah's Messenger (ﷺ)! What makes you smile?\" He replied \"I was astonished to see (in my dream) some people amongst my followers on a sea-voyage looking like kings on the thrones.\" She said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" He replied, \"You are amongst them.\" He slept again and then woke up smiling and said the same as before twice or thrice. And she said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" And he said, \"You are amongst the first batch.\" 'Ubada bin As-Samit married her (i.e. Um Haram) and then he took her for Jihad. When she returned, an animal was presented to her to ride, but she fell down and her neck was broken",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "Narrated Mus`ab bin Sa`d:Once Sa`d (bin Abi Waqqas) thought that he was superior to those who were below him in rank. On that the Prophet (ﷺ) said, \"You gain no victory or livelihood except through (the blessings and invocations of) the poor amongst you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "Narrated Abu Sa`id Al-Khudri:The Prophet (ﷺ) said, \"A time will come when groups of people will go for Jihad and it will be asked, 'Is there anyone amongst you who has enjoyed the company of the Prophet?' The answer will be, 'Yes.' Then they will be given victory (by Allah) (because of him). Then a time will come when it will be asked. 'Is there anyone amongst you who has enjoyed the company of the companions of the Prophet?' It will be said, 'Yes,' and they will be given victory (by Allah). Then a time will come when it will be said. 'Is there anyone amongst you who has enjoyed the company of the companions of the companions of the Prophet?' It will be said, 'Yes,' and they will be given victory (by Allah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Narrated Sahl bin Sa`d As-Sa`idi:Allah's Messenger (ﷺ) and the pagans faced each other and started fighting. When Allah's Messenger (ﷺ) returned to his camp and when the pagans returned to their camp, somebody talked about a man amongst the companions of Allah's Messenger (ﷺ) who would follow and kill with his sword any pagan going alone. He said, \"Nobody did his job (i.e. fighting) so properly today as that man.\" Allah's Messenger (ﷺ) said, \"Indeed, he is amongst the people of the (Hell) Fire.\" A man amongst the people said, \"I shall accompany him (to watch what he does)\" Thus he accompanied him, and wherever he stood, he would stand with him, and wherever he ran, he would run with him. Then the (brave) man got wounded seriously and he decided to bring about his death quickly. He planted the blade of the sword in the ground directing its sharp end towards his chest between his two breasts. Then he leaned on the sword and killed himself. The other man came to Allah's Messenger (ﷺ) and said, \"I testify that you are Allah's Messenger (ﷺ).\" The Prophet (ﷺ) asked, \"What has happened?\" He replied, \"(It is about) the man whom you had described as one of the people of the (Hell) Fire. The people were greatly surprised at what you said, and I said, 'I will find out his reality for you.' So, I came out seeking him. He got severely wounded, and hastened to die by slanting the blade of his sword in the ground directing its sharp end towards his chest between his two breasts. Then he eased on his sword and killed himself.\" when Allah's Messenger (ﷺ) said, \"A man may seem to the people as if he were practising the deeds of the people of Paradise while in fact he is from the people of the Hell) Fire, another may seem to the people as if he were practicing the deeds of the people of Hell (Fire), while in fact he is from the people of Paradise",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "Narrated Salama bin Al-Akwa`:The Prophet (ﷺ) passed by some people of the tribe of Bani Aslam who were practicing archery. The Prophet said, \"O Bani Isma`il ! Practice archery as your father Isma`il was a great archer. Keep on throwing arrows and I am with Bani so-and-so.\" So one of the parties ceased throwing. Allah's Apostle said, \"Why do you not throw?\" They replied, \"How should we throw while you are with them (i.e. on their side)?\" On that the Prophet (ﷺ) said, \"Throw, and I am with all of you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "Narrated Abu Usaid:On the day (of the battle) of Badr when we stood in rows against (the army of) Quraish and they stood in rows against us, the Prophet (ﷺ) said, \"When they do come near you, throw arrows at them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "Narrated Abu Huraira:While some Ethiopians were playing in the presence of the Prophet, `Umar came in, picked up a stone and hit them with it. On that the Prophet (ﷺ) said, \"O `Umar! Allow them (to play).\" Ma`mar (the subnarrator) added that they were playing in the Mosque",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "Narrated Anas bin Malik:Abu Talha and the Prophet (ﷺ) used to shield themselves with one shield. Abu Talha was a good archer, and when he threw (his arrows) the Prophet (ﷺ) would look at the target of his arrows",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "Narrated Sahl:When the helmet of the Prophet (ﷺ) was smashed on his head and blood covered his face and one of his front teeth got broken, `Ali brought the water in his shield and Fatima the Prophet's daughter) washed him. But when she saw that the bleeding increased more by the water, she took a mat, burnt it, and placed the ashes on the wound of the Prophet (ﷺ) and so the blood stopped oozing out",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "Narrated `Umar:The properties of Bani An-Nadir which Allah had transferred to His Apostle as Fai Booty were not gained by the Muslims with their horses and camels. The properties therefore, belonged especially to Allah's Messenger (ﷺ) who used to give his family their yearly expenditure and spend what remained thereof on arms and horses to be used in Allah's Cause",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "Narrated `Ali:I never saw the Prophet (ﷺ) saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "Narrated Anas:The 'Prophet was the best and the bravest amongst the people. Once the people of Medina got terrified at night, so they went in the direction of the noise (that terrified them). The Prophet (ﷺ) met them (on his way back) after he had found out the truth. He was riding an unsaddled horse belonging to Abu Talha and a sword was hanging by his neck, and he was saying, \"Don't be afraid! Don't be afraid!\" He further said, \"I found it (i.e. the horse) very fast,\" or said, \"This horse is very fast.\" (Qastala-ni)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "Narrated Abu Umama:Some people conquered many countries and their swords were decorated neither with gold nor silver, but they were decorated with leather, lead and iron",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "Narrated Jabir bin `Abdullah:That he proceeded in the company of Allah's Messenger (ﷺ) towards Najd to participate in a Ghazwa. (Holybattle) When Allah's Messenger (ﷺ) returned, he too returned with him. Midday came upon them while they were in a valley having many thorny trees. Allah's Messenger (ﷺ) and the people dismounted and dispersed to rest in the shade of the trees. Allah's Messenger (ﷺ) rested under a tree and hung his sword on it. We all took a nap and suddenly we heard Allah's Messenger (ﷺ) calling us. (We woke up) to see a bedouin with him. The Prophet (ﷺ) said, \"This bedouin took out my sword while I was sleeping and when I woke up, I found the unsheathed sword in his hand and he challenged me saying, 'Who will save you from me?' I said thrice, 'Allah.' The Prophet (ﷺ) did not punish him but sat down",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "Narrated Sahl:That he was asked about the wound of the Prophet (ﷺ) on the day (of the battle) of Uhud. He said, \"The face of the Prophet (ﷺ) as wounded and one of his front teeth as broken and the helmet over his head was smashed. Fatima washed of the blood while `Ali held water. When she saw that bleeding was increasing continuously, she burnt a mat (of date-palm leaves) till it turned into ashes which she put over the wound and thus the bleeding ceased",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "Narrated `Amr bin Al-Harith:The Prophet (ﷺ) did not leave behind him after his death, anything except his arms, his white mule, and a piece of land at Khaibar which he left to be given in charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "Narrated Jabir:as above (Hadith No. 158). Narrated Jabir bin `Abdullah: That he participated in a Ghazwa (Holy-Battle) in the company of Allah's Messenger (ﷺ). Midday came upon them while they were in a valley having many thorny trees. The people dispersed to rest in the shade of the trees. The Prophet (ﷺ) rested under a tree, hung his sword on it, and then slept. Then he woke up to find near to him, a man whose presence he had not noticed before. The Prophet (ﷺ) said, \"This (man) took my sword (out of its scabbard) and said, 'Who will save you from me.' I replied, 'Allah.' So, he put the sword back into its scabbard, and you see him sitting here.\" Anyhow, the Prophet (ﷺ) did not punish him. (See Hadith No. 158)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "Narrated Abu Qatada:That he was in the company of Allah's Messenger (ﷺ) and when they had covered a portion of the road to Mecca, he and some of the companions lagged behind. The latter were in a state of Ihram, while he was not. He saw an onager and rode his horse and requested his companions to give him his lash but they refused. Then he asked them to give him his spear but they refused, so he took it himself, attacked the onager, and killed it. Some of the companions of the Prophet (ﷺ) ate of it while some others refused to eat. When they caught up with Allah's Messenger (ﷺ) they asked him about that, and he said, \"That was a meal Allah fed you with.\" (It is also said that Allah's Messenger (ﷺ) asked, \"Have you got something of its meat?",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) , while in a tent (on the day of the battle of Badr) said, \"O Allah! I ask you the fulfillment of Your Covenant and Promise. O Allah! If You wish (to destroy the believers) You will never be worshipped after today.\" Abu Bakr caught him by the hand and said, \"This is sufficient, O Allah's Apostle! You have asked Allah pressingly.\" The Prophet (ﷺ) was clad in his armor at that time. He went out, saying to me: \"There multitude will be put to flight and they will show their backs. Nay, but the Hour is their appointed time (for their full recompense) and that Hour will be more grievous and more bitter (than their worldly failure).\" (54.45-46) Khalid said that was on the day of the battle of Badr",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) died while his (iron) armor was mortgaged to a Jew for thirty Sas of barley",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The example of a miser and the one who gives in charity, is like the example of two men wearing iron cloaks so tightly that their arms are raised forcibly towards their collar-bones. So, whenever a charitable person wants to give in charity, his cloak spreads over his body so much so that it wipes out his traces, but whenever the miser wants to give in charity, the rings (of the iron cloak) come closer to each other and press over his body, and his hands gets connected to his collarbones. Abu Huraira heard the Prophet (ﷺ) saying. \"The miser then tries to widen it but in vain",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "Narrated Al-Mughira bin Shu`ba:Allah's Messenger (ﷺ) went out to answer the call of nature and on his return I brought some water to him. He performed the ablution while he was wearing a Sha'mi cloak. He rinsed his mouth and washed his nose by putting water in it and then blowing it out, and washed his face. Then he tried to take out his hands through his sleeves but they were tight, so he took them out from underneath, washed them and passed wet hands over his head and over his leather socks",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "Narrated Anas:The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair to wear silken shirts because they had a skin disease causing itching",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "Narrated Anas:As above. Narrated Anas: `Abdur Rahman bin `Auf and Az-Zubair complained to the Prophet, i.e. about the lice (that caused itching) so he allowed them to wear silken clothes. I saw them wearing such clothes in a holy battle",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "Narrated Anas:The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair bin Al-`Awwam to wear silk",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "Narrated Anas:(Wearing of silk) was allowed to them (i.e. `AbdurRahman and Az-Zubair) because of the itching they suffered from",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "Narrated Umaiya Ad-Damri:I saw the Prophet (ﷺ) eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer and he prayed without repeating his ablution. Narrated Az-Zuhri: as above (Hadith No. 173...) and added that the Prophet (ﷺ) put the knife down",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "Narrated Khalid bin Madan:That 'Umair bin Al-Aswad Al-Anasi told him that he went to 'Ubada bin As-Samit while he was staying in his house at the sea-shore of Hims with (his wife) Um Haram. 'Umair said. Um Haram informed us that she heard the Prophet (ﷺ) saying, \"Paradise is granted to the first batch of my followers who will undertake a naval expedition.\" Um Haram added, I said, 'O Allah's Messenger (ﷺ)! Will I be amongst them?' He replied, 'You are amongst them.' The Prophet (ﷺ) then said, 'The first army amongst' my followers who will invade Caesar's City will be forgiven their sins.' I asked, 'Will I be one of them, O Allah's Messenger (ﷺ)?' He replied in the negative",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"You (i.e. Muslims) will fight with the Jews until some of them will hide behind stones. The stones will (betray them) saying, 'O `Abdullah (i.e. slave of Allah)! There is a Jew hiding behind me; so kill him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "Narrated `Amr bin Taghlib:The Prophet (ﷺ) said, \"One of the portents of the Hour is that you will fight with people wearing shoes made of hair; and one of the portents of the Hour is that you will fight with broad-faced people whose faces will look like shields coated with leather",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Turks; people with small eyes, red faces, and flat noses. Their faces will look like shields coated with leather. The Hour will not be established till you fight with people whose shoes are made of hair",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The Hour will not be established till you fight with people wearing shoes made of hair. And the Hour will not be established till you fight with people whose faces look like shields coated with leather. \" (Abu Huraira added, \"They will be) small-eyed, flat nosed, and their faces will look like shields coated with leather",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "Narrated Abu 'Is-haq:A man asked Al-Bara', \"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah! Allah's Messenger (ﷺ) did not flee, but his young unarmed companions passed by the archers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw arrows at them hardly missing a shot. So the Muslims retreated towards the Prophet (ﷺ) while he was riding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul Muttalib. The Prophet (ﷺ) dismounted and invoked Allah for victory; then he said, 'I am the Prophet, without a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "Narrated `Ali:When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Messenger (ﷺ) said, \"O Allah! Fill their (i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the prayer (i.e. `Asr) till the sun set",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) used to recite the following invocations during Qunut: \"O Allah! Save Salama bin Hisham. O Allah! Save Al-Walid bin Al-Walid. O Allah! Save `Aiyash bin Rabi`a O Allah ! Save the weak Muslims. O Allah! Be very hard on Mudar tribe. O Allah! Afflict them with years (of famine) similar to the (famine) years of the time of Prophet Joseph",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "Narrated `Abdullah bin Abi `Aufa:Allah's Messenger (ﷺ) invoked evil upon the pagans on the ay (of the battle) of Al-Ahzab, saying, \"O Allah! The Revealer of the Holy Book, the Swift-Taker of Accounts, O Allah, defeat Al-Ahzab (i.e. the clans), O Allah, defeat them and shake them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "Narrated `Abdullah:Once the Prophet (ﷺ) was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet (ﷺ) Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "Narrated `Aisha:Once the Jews came to the Prophet (ﷺ) and said, \"Death be upon you.\" So I cursed them. The Prophet (ﷺ) said, \"What is the matter?\" I said, \"Have you not heard what they said?\" The Prophet (ﷺ) said, \"Have you not heard what I replied (to them)? (I said), ('The same is upon you)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "Narrated `Abdullah bin `Abbas:Allah's Messenger (ﷺ) wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the tillers (i.e. your people)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "Narrated Abu Huraira:Tufail bin `Amr Ad-Dausi and his companions came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The people of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The people said, \"The tribe of Daus is ruined.\" The Prophet (ﷺ) said, \"O Allah! Give guidance to the people of Daus, and let them embrace Islam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "Narrated Anas:When the Prophet (ﷺ) intended to write a letter to the ruler of the Byzantines, he was told that those people did not read any letter unless it was stamped with a seal. So, the Prophet (ﷺ) got a silver ring-- as if I were just looking at its white glitter on his hand ---- and stamped on it the expression \"Muhammad, Apostle of Allah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "Narrated `Abdullah bin `Abbas:Allah's Messenger (ﷺ) sent his letter to Khusrau and ordered his messenger to hand it over to the Governor of Bahrain who was to hand it over to Khusrau. So, when Khusrau read the letter he tore it. Sa`id bin Al- Musaiyab said, \"The Prophet (ﷺ) then invoked Allah to disperse them with full dispersion, (destroy them (i.e. Khusrau and his followers) severely",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "Narrated Sahl bin Sa`d:That he heard the Prophet (ﷺ) on the day (of the battle) of Khaibar saying, \"I will give the flag to a person at whose hands Allah will grant victory.\" So, the companions of the Prophet (ﷺ) got up, wishing eagerly to see to whom the flag will be given, and everyone of them wished to be given the flag. But the Prophet asked for `Ali. Someone informed him that he was suffering from eye-trouble. So, he ordered them to bring `Ali in front of him. Then the Prophet (ﷺ) spat in his eyes and his eyes were cured immediately as if he had never any eye-trouble. `Ali said, \"We will fight with them (i.e. infidels) till they become like us (i.e. Muslims).\" The Prophet (ﷺ) said, \"Be patient, till you face them and invite them to Islam and inform them of what Allah has enjoined upon them. By Allah! If a single person embraces Islam at your hands (i.e. through you), that will be better for you than the red camels",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "Narrated Anas:Whenever Allah's Messenger (ﷺ) attacked some people, he would never attack them till it was dawn. If he heard the Adhan (i.e. call for prayer) he would delay the fight, and if he did not hear the Adhan, he would attack them immediately after dawn. We reached Khaibar at night",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "Narrated Anas:as Hadith No. 193 above",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "Narrated Anas:The Prophet (ﷺ) set out for Khaibar and reached it at night. He used not to attack if he reached the people at night, till the day broke. So, when the day dawned, the Jews came out with their bags and spades. When they saw the Prophet; they said, \"Muhammad and his army!\" The Prophet (ﷺ) said, Allahu--Akbar! (Allah is Greater) and Khaibar is ruined, for whenever we approach a nation (i.e. enemy to fight) then it will be a miserable morning for those who have been warned",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "Narrated Abu Huraira:Allah 's Apostle said, \" I have been ordered to fight with the people till they say, 'None has the right to be worshipped but Allah,' and whoever says, 'None has the right to be worshipped but Allah,' his life and property will be saved by me except for Islamic law, and his accounts will be with Allah, (either to punish him or to forgive him)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "Narrated Ka`b bin Malik:Whenever Allah's Messenger (ﷺ) intended to lead a Ghazwa, he would use an equivocation from which one would understand that he was going to a different destination",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "Narrated Ka`b bin Malik:Whenever Allah's Messenger (ﷺ) intended to carry out a Ghazwa, he would use an equivocation to conceal his real destination till it was the Ghazwa of Tabuk which Allah's Messenger (ﷺ) carried out in very hot weather. As he was going to face a very long journey through a wasteland and was to meet and attack a large number of enemies. So, he made the situation clear to the Muslims so that they might prepare themselves accordingly and get ready to conquer their enemy. The Prophet (ﷺ) informed them of the destination he was heading for",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "Ka`b bin Malik used to say:\"Scarcely did Allah's Messenger (ﷺ) set out for a journey on a day other than Thursday",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "Narrated Ka`b bin Malik:The Prophet (ﷺ) set out on Thursday for the Ghazwa of Tabuk and he used to prefer to set out (i.e. travel) on Thursdays",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "Narrated Anas:The Prophet (ﷺ) offered a four-rak`at Zuhr prayer at Medina and then offered a two rak`at `Asr prayer at Dhul-Hulaifa and I heard the companions of the Prophet (ﷺ) reciting Talbiya aloud (for Hajj and `Umra) altogether",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "Narrated `Aisha:We set out in the company of Allah's Messenger (ﷺ) five days before the end of Dhul Qa'da intending to perform Hajj only. When we approached Mecca Allah's Messenger (ﷺ) ordered those who did not have the Hadi (i.e. an animal for sacrifice) with them, to perform the Tawaf around the Ka`ba, and between Safa and Marwa and then finish their Ihram. Beef was brought to us on the day of (i.e. the days of slaughtering) and I asked, \"What is this?\" Somebody said, Allah's Messenger (ﷺ) has slaughtered (a cow) on behalf of his wives",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "Narrated Ibn `Abbas:Once the Prophet (ﷺ) set out in the month of Ramadan. He observed fasting till he reached a place called Kadid where he broke his fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "Narrated Abu Hurairah (ra):Allah's Messenger (ﷺ) sent us on military expedition telling us, \"If you find such and such persons (he named two men from Quraish), burn them fire.\" Then we came to bid him farewell, when we wanted to set out, he said: \"Previously I ordered you to burn so-and-so and so-and-so with fire, but as punishment with fire is done by none except Allah, if you capture them, kill them, (instead)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "Narrated Ibn `Umar:The 'Prophet said, \"It is obligatory for one to listen to and obey (the ruler's orders) unless these orders involve one disobedience (to Allah); but if an act of disobedience (to Allah) is imposed, he should not listen to or obey it",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "Narrated Ibn `Umar:When we reached (Hudaibiya) in the next year (of the treaty of Hudaibiya), not even two men amongst us agreed unanimously as to which was the tree under which we had given the pledge of allegiance, and that was out of Allah's Mercy. (The sub narrator asked Naf'i, \"For what did the Prophet (ﷺ) take their pledge of allegiance, was it for death?\" Naf'i replied \"No, but he took their pledge of allegiance for patience",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "Narrated `Abdullah bin Zaid:that in the time (of the battle) of Al-Harra a person came to him and said, \"Ibn Hanzala is taking the pledge of allegiance from the people for death.\" He said, \"I will never give a pledge of allegiance for such a thing to anyone after Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "Narrated Yazid bin Ubaid:Salama said, \"I gave the Pledge of allegiance (Al-Ridwan) to Allah's Messenger (ﷺ) and then I moved to the shade of a tree. When the number of people around the Prophet (ﷺ) diminished, he said, 'O Ibn Al-Akwa` ! Will you not give to me the pledge of Allegiance?' I replied, 'O Allah's Messenger (ﷺ)! I have already given to you the pledge of Allegiance.' He said, 'Do it again.' So I gave the pledge of allegiance for the second time.\" I asked 'O Abu Muslim! For what did you give he pledge of Allegiance on that day?\" He replied, \"We gave the pledge of Allegiance for death",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "Narrated Anas:On the day (of the battle) of the Trench, the Ansar were saying, \"We are those who have sworn allegiance to Muhammad for Jihaid (for ever) as long as we live.\" The Prophet (ﷺ) replied to them, \"O Allah! There is no life except the life of the Hereafter. So honor the Ansar and emigrants with Your Generosity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "Narrated `Abdullah:Today a man came to me and asked me a question which I did not know how to answer. He said, \"Tell me, if a wealthy active man, well-equipped with arms, goes out on military expeditions with our chiefs, and orders us to do such things as we cannot do (should we obey him?)\" I replied, \"By Allah, I do not know what to reply you, except that we, were in the company of the Prophet (ﷺ) and he used to order us to do a thing once only till we finished it. And no doubt, everyone among you will remain in a good state as long as he obeys Allah. If one is in doubt as to the legality of something, he should ask somebody who would satisfy him, but soon will come a time when you will not find such a man. By Him, except Whom none has the right to be worshipped. I see that the example of what has passed of this life (to what remains thereof) is like a pond whose fresh water has been used up and nothing remains but muddy water",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "Narrated Jabir bin `Abdullah:I participated in a Ghazwa along with Allah's Messenger (ﷺ) The Prophet (ﷺ) met me (on the way) while I was riding a camel of ours used for irrigation and it had got so tired that it could hardly walk. The Prophet (ﷺ) asked me, \"What is wrong with the camel?\" I replied, \"It has got tired.\" So. Allah's Messenger (ﷺ) came from behind it and rebuked it and prayed for it so it started surpassing the other camels and going ahead of them. Then he asked me, \"How do you find your camel (now)?\" I replied, \"I find it quite well, now as it has received your blessings.\" He said, \"Will you sell it to me?\" I felt shy (to refuse his offer) though it was the only camel for irrigation we had. So, I said, \"Yes.\" He said, \"Sell it to me then.\" I sold it to him on the condition that I should keep on riding it till I reached Medina. Then I said, \"O Allah's Apostle! I am a bridegroom,\" and requested him to allow me to go home. He allowed me, and I set out for Medina before the people till I reached Medina, where I met my uncle, who asked me about the camel and I informed him all about it and he blamed me for that. When I took the permission of Allah's Messenger (ﷺ) he asked me whether I had married a virgin or a matron and I replied that I had married a matron. He said, \"Why hadn't you married a virgin who would have played with you, and you would have played with her?\" I replied, \"O Allah's Messenger (ﷺ)! My father died (or was martyred) and I have some young sisters, so I felt it not proper that I should marry a young girl like them who would neither teach them manners nor serve them. So, I have married a matron so that she may serve them and teach them manners.\" When Allah's Messenger (ﷺ) arrived in Medina, I took the camel to him the next morning and he gave me its price and gave me the camel itself as well",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "Narrated Anas bin Malik:Once there was a feeling of fright at Medina, so Allah's Messenger (ﷺ) rode a horse belonging to Abu Talha and (on his return) he said, \"We have not seen anything (fearful), but we found this horse very fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "Narrated Anas bin Malik:Once the people got frightened, so Allah's Messenger (ﷺ) rode a slow horse belonging to Abu Talha, and he set out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. On his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a very fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "Narrated `Umar bin Al-Khattab:I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet (ﷺ) whether I could buy it. He said, \"Don't buy it and don't take back your gift of charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "Narrated `Abdullah bin `Umar:`Umar gave a horse to be used in Allah's Cause, but later on he found it being sold. So, he intended to buy it and asked Allah's Messenger (ﷺ) who said, \"Don't buy it and don't take back your gift of charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Were it not for the fear that it would be difficult for my followers, I would not have remained behind any Sariya, (army-unit) but I don't have riding camels and have no other means of conveyance to carry them on, and it is hard for me that my companions should remain behind me. No doubt I wish I could fight in Allah's Cause and be martyred and come to life again to be martyred and come to life once more",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "Narrated Yali:I participated in the Ghazwa of Tabuk along with Allah's Messenger (ﷺ) and I gave a young camel to be ridden in Jihad and that was, to me, one of my best deeds. Then I employed a laborer who quarrelled with another person. One of them bit the hand of the other and the latter drew his hand from the mouth of the former pulling out his front tooth. Then the former instituted a suit against the latter before the Prophet who rejected that suit saying, \"Do you expect him to put out his hand for you to snap as a male camel snaps (vegetation)?",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "Narrated Tha`laba bin Abi Malik Al-Qurazi:When Qais bin Sa`d Al-Ansari, who used to carry the flag of the Prophet, intended to perform Hajj, he combed his hair",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "Narrated Salama bin Al-Akwa: Ali remained behind the Prophet (ﷺ) during the battle of Khaibar as he way suffering from some eye trouble but then he said, \"How should I stay behind Allah's Messenger (ﷺ)?\" So, he set out till he joined the Prophet. On the eve of the day of the conquest of Khaibar, Allah's Messenger (ﷺ) said, \"(No doubt) I will give the flag or, tomorrow, a man whom Allah and His Apostle love or who loves Allah and His apostle will take the flag. Allah will bestow victory upon him.\" Suddenly 'Ali joined us though we were not expecting him. The people said, \"Here is 'Ali. \"So, Allah's Messenger (ﷺ) gave the flag to him and Allah bestowed victory upon him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "Narrated Nafi bin Jubair: I heard Al Abbas telling Az-Zubair, \"The Prophet (ﷺ) ordered you to fix the flag here",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"I have been sent with the shortest expressions bearing the widest meanings, and I have been made victorious with awe (cast in the hearts of the enemy), and while I was sleeping, the keys of the treasures of the world were brought to me and put in my hand.\" Abu Huraira added: Allah's Messenger (ﷺ) has left the world and now you, people, are bringing out those treasures (i.e. the Prophet (ﷺ) did not benefit by them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "Narrated Ibn `Abbas:Abu Sufyan said, \"Heraclius sent for me when I was in 'llya' (i.e. Jerusalem). Then he asked for the letter of Allah's Messenger (ﷺ) and when he had finished its reading there was a great hue and cry around him and the voices grew louder and we were asked to quit the place. When we were turned out, I said to my companions, 'The cause of Ibn Abi Kabsha has become conspicuous as the King of Bani Al- Asfar is afraid of him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "Narrated Asma:I prepared the journey-food for Allah's Messenger (ﷺ) in Abu Bakr's house when he intended to emigrate to Medina. I could not find anything to tie the food-container and the water skin with. So, I said to Abu Bakr, \"By Allah, I do not find anything to tie (these things) with except my waist belt.\" He said, \"Cut it into two pieces and tie the water-skin with one piece and the food-container with the other (the subnarrator added, \"She did accordingly and that was the reason for calling her Dhatun-Nitaqain (i.e. twobelted woman)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "Narrated Jabir bin `Abdullah:During the life-time of the Prophet (ﷺ) we used to take the meat of sacrificed animals (as journey food) to Medina. (See Hadith No. 474 Vol. 7)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "Narrated Suwaid bin An-Nu`man:That he went out in the company o; the Prophet (ﷺ) during the year of Khaibar (campaign till they reached a place called As-Sahba', the lower part of Khaibar. They offered the `Asr prayer (there) and the Prophet asked for the food. Nothing but Sawiq was brought to the Prophet. So, they chewed it and ate it and drank water. After that the Prophet (ﷺ) got up, washed his mouth, and they too washed their mouths and then offered the prayer",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "Narrated Salama:Once the journey-food of the people ran short and they were in great need. So, they came to the Prophet to take his permission for slaughtering their camels, and he permitted them. Then `Umar met them and they informed him about it. He said, \"What will sustain you after your camels (are finished)?\" Then `Umar went to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! What will sustain them after their camels (are finished)?\" Allah's Messenger (ﷺ) said, \"Make an announcement amongst the people that they should bring all their remaining food (to me).\" (They brought it and) the Prophet (ﷺ) invoked Allah and asked for His Blessings for it. Then he asked them to bring their food utensils and the people started filling their food utensils with their hands till they were satisfied. Allah's Messenger (ﷺ) then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "Narrated Wahb bin Kaisan:Jabir bin `Abdullah said, \"We set out, and we were three-hundred men carrying our journey-food on our shoulders. Then we began to eat a single date each per day.\" A man asked (Jabir), \"O Abu `Abdullah! How could a person be satisfied with a single date?\" Jabir replied, \"We realized the value of that one date when we could not even have that much till we reached the sea-shore, when all of a sudden we saw a huge fish cast by the sea. So, we ate of it as much as we wished for eighteen days",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Narrated Aisha:That she said, \"O Allah's Messenger (ﷺ)! Your companions are returning with the reward of both Hajj and `Umra, while I am returning with (the reward of) Hajj only.\" He said to her, \"Go, and let `Abdur- Rahman (i.e. your brother) make you sit behind him (on the animal).\" So, he ordered `AbdurRahman to let her perform `Umra from Al-Tan`im. Then the Prophet (ﷺ) waited for her at the higher region of Mecca till she returned",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "Narrated `Abdur-Rahman bin Abi Bakr As-Siddiq:The Prophet (ﷺ) ordered me to let `Aisha sit behind me (on the animal) and to let her perform `Umra from at-Tan`im",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "Narrated Anas:I was riding behind Abu Talha (on the same) riding animal and (the Prophet's companions) were reciting Talbiya aloud for both Hajj and `Umra",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "Narrated `Urwa from Usama bin Zaid:Allah's Messenger (ﷺ) rode a donkey on which there was a saddle covered by a velvet sheet and let Usama ride behind him (on the donkey)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "Narrated Nafi` from `Abdullah:Allah's Messenger (ﷺ) came to Mecca through its higher region on the day of the Conquest (of Mecca) riding his she-camel on which Usama was riding behind him. Bilal and `Uthman bin Talha, one of the servants of the Ka`ba, were also accompanying him till he made his camel kneel in the mosque and ordered the latter to bring the key of the Ka`ba. He opened the door of the Ka`ba and Allah's Messenger (ﷺ) entered in the company of Usama, Bilal and `Uthman, and stayed in it for a long period. When he came out, the people rushed to it, and `Abdullah bin `Umar was the first to enter it and found Bilal standing behind the door. He asked Bilal, \"Where did the Prophet (ﷺ) offer his prayer?\" He pointed to the place where he had offered his prayer. `Abdullah said, \"I forgot to ask him how many rak`at he had performed",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"There is a (compulsory) Sadaqa (charity) to be given for every joint of the human body (as a sign of gratitude to Allah) everyday the sun rises. To judge justly between two persons is regarded as Sadaqa, and to help a man concerning his riding animal by helping him to ride it or by lifting his luggage on to it, is also regarded as Sadaqa, and (saying) a good word is also Sadaqa, and every step taken on one's way to offer the compulsory prayer (in the mosque) is also Sadaqa and to remove a harmful thing from the way is also Sadaqa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) forbade the people to travel to a hostile country carrying (copies of) the Qur'an",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "Narrated Anas:The Prophet (ﷺ) reached Khaibar in the morning, while the people were coming out carrying their spades over their shoulders. When they saw him they said, \"This is Muhammad and his army! Muhammad and his army!\" So, they took refuge in the fort. The Prophet (ﷺ) raised both his hands and said, \"Allahu Akbar, Khaibar is ruined, for when we approach a nation (i.e. enemy to fight) then miserable is the morning of the warned ones.\" Then we found some donkeys which we (killed and) cooked: The announcer of the Prophet (ﷺ) announced: \"Allah and His Apostle forbid you to eat donkey's meat.\" So, all the pots including their contents were turned upside down",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "Narrated Abu Musa Al-Ash`ari:We were in the company of Allah's Messenger (ﷺ) (during Hajj). Whenever we went up a high place we used to say: \"None has the right to be worshipped but Allah, and Allah is Greater,\" and our voices used to rise, so the Prophet (ﷺ) said, \"O people! Be merciful to yourselves (i.e. don't raise your voice), for you are not calling a deaf or an absent one, but One Who is with you, no doubt He is All-Hearer, ever Near (to all things)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "Narrated Jabir bin `Abdullah:Whenever we went up a place we would say, \"Allahu--Akbar (i.e. Allah is Greater)\", and whenever we went down a place we would say, \"Subhan Allah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "Narrated Jabir:Whenever we went up a place we would say Takbir, and whenever we went down we would say, \"Subhan Allah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "Narrated `Abdullah bin `Umar:Whenever the Prophet (ﷺ) returned from the Hajj or the `Umra or a Ghazwa, he would say Takbir thrice. Whenever he came upon a mountain path or wasteland, and then he would say, \"None has the right to be worshipped but Allah, Alone Who has no partner. All the Kingdom belongs to Him and all the praises are for Him and He is Omnipotent. We are returning with repentance, worshipping, prostrating ourselves and praising our Lord. Allah fulfilled His Promise, granted victory to His slave and He Alone defeated all the clans",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "Narrated Ibrahim Abu Isma`il As-Saksaki:I heard Abu Burda who accompanied Yazid bin Abi Kabsha on a journey. Yazid used to observe fasting on journeys. Abu Burda said to him, \"I heard Abu Musa several times saying that Allah's Apostle said, 'When a slave falls ill or travels, then he will get reward similar to that he gets for good deeds practiced at home when in good health",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "Narrated Jabir bin `Abdullah:On the day of the battle of the Trench, the Prophet (ﷺ) wanted somebody from amongst the people to volunteer to be a reconnoitre. Az-Zubair volunteered. He demanded the same again and Az-Zubair volunteered again. Then he repeated the same demand (thrice) and AzZubair volunteered once more. The Prophet (ﷺ) then said, \" Every prophet has a disciple and my disciple is Az-Zubair",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "Narrated Ibn' `Umar:from the Prophet (ﷺ) the following Hadith (No. 242). Narrated Ibn `Umar: The Prophet (ﷺ) said, \"If the people knew what I know about traveling alone, then nobody would travel alone at night",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "Narrated Hisham's father:Usama bin Zaid was asked at what pace the Prophet (ﷺ) rode during Hajjat-ul-Wada` \"He rode at a medium pace, but when he came upon an open way he would go at full pace",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "Narrated Aslam:While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the severe illness of Safiya bint Abi Ubaid (i.e. his wife), so he proceeded at greater speed, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I saw the Prophet (ﷺ) delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry on a journey",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Journey is a piece of torture, for it disturbs one's sleep, eating and drinking. So, when you fulfill your job, you should hurry up to your family",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab gave a horse to be ridden in Allah's Cause and then he found it being sold. He intended to purchase it. So, he consulted Allah's Messenger (ﷺ) who said, \"Don't buy it and don't take back your gift of charity",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "Narrated Aslam:I heard `Umar bin Al-Khattab saying, \"I gave a horse to be ridden in Allah's Cause and the person who got it intended to sell it or neglected it. So, I wanted to buy it as I thought he would sell it cheap. I consulted the Prophet (ﷺ) who said, \"Do not buy it even if for one Dirham, because he who takes back his gift is like a dog swallowing its vomit",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "Narrated `Abdullah bin `Amr:A man came to the Prophet (ﷺ) asking his permission to take part in Jihad. The Prophet (ﷺ) asked him, \"Are your parents alive?\" He replied in the affirmative. The Prophet (ﷺ) said to him, \"Then exert yourself in their service",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "Narrated Abu Bashir Al-Ansari:That he was in the company of Allah's Messenger (ﷺ) on some of his journeys. (The sub-narrator `Abdullah adds, \"I think that Abu Bashir also said, 'And the people were at their sleeping places.\") Allah's Apostle sent a messenger ordering: \"There shall not remain any necklace of string or any other kind of necklace round the necks of camels except it is cut off",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "Narrated Ibn `Abbas:That he heard the Prophet (ﷺ) saying, \"It is not permissible for a man to be alone with a woman, and no lady should travel except with a Muhram (i.e. her husband or a person whom she cannot marry in any case for ever; e.g. her father, brother, etc.).\" Then a man got up and said, \"O Allah's Messenger (ﷺ)! I have enlisted in the army for such-and-such Ghazwa and my wife is proceeding for Hajj.\" Allah's Messenger (ﷺ) said, \"Go, and perform the Hajj with your wife",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "Narrated 'Ubaidullah bin Abi Rafi`:I heard `Ali saying, \"Allah's Messenger (ﷺ) sent me, Az-Zubair and Al-Miqdad somewhere saying, 'Proceed till you reach Rawdat Khakh. There you will find a lady with a letter. Take the letter from her.' \" So, we set out and our horses ran at full pace till we got at Ar-Rawda where we found the lady and said (to her). \"Take out the letter.\" She replied, \"I have no letter with me.\" We said, \"Either you take out the letter or else we will take off your clothes.\" So, she took it out of her braid. We brought the letter to Allah's Messenger (ﷺ) and it contained a statement from Hatib bin Abi Balta a to some of the Meccan pagans informing them of some of the intentions of Allah's Messenger (ﷺ). Then Allah's Messenger (ﷺ) said, \"O Hatib! What is this?\" Hatib replied, \"O Allah's Messenger (ﷺ)! Don't hasten to give your judgment about me. I was a man closely connected with the Quraish, but I did not belong to this tribe, while the other emigrants with you, had their relatives in Mecca who would protect their dependents and property . So, I wanted to recompense for my lacking blood relation to them by doing them a favor so that they might protect my dependents. I did this neither because of disbelief not apostasy nor out of preferring Kufr (disbelief) to Islam.\" Allah's Messenger (ﷺ), said, \"Hatib has told you the truth.\" `Umar said, O Allah's Apostle! Allow me to chop off the head of this hypocrite.\" Allah's Messenger (ﷺ) said, \"Hatib participated in the battle of Badr, and who knows, perhaps Allah has already looked at the Badr warriors and said, 'Do whatever you like, for I have forgiven you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "Narrated Jabir bin `Abdullah:When it was the day (of the battle) of Badr, prisoners of war were brought including Al-Abbas who was undressed. The Prophet (ﷺ) looked for a shirt for him. It was found that the shirt of `Abdullah bin Ubai would do, so the Prophet (ﷺ) let him wear it. That was the reason why the Prophet (ﷺ) took off and gave his own shirt to `Abdullah. (The narrator adds, \"He had done the Prophet (ﷺ) some favor for which the Prophet liked to reward him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "Narrated Sahl:On the day (of the battle) of Khaibar the Prophet (ﷺ) said, \"Tomorrow I will give the flag to somebody who will be given victory (by Allah) and who loves Allah and His Apostle and is loved by Allah and His Apostle.\" So, the people wondered all that night as to who would receive the flag and in the morning everyone hoped that he would be that person. Allah's Messenger (ﷺ) asked, \"Where is `Ali?\" He was told that `Ali was suffering from eye-trouble, so he applied saliva to his eyes and invoked Allah to cure him. He at once got cured as if he had no ailment. The Prophet (ﷺ) gave him the flag. `Ali said, \"Should I fight them till they become like us (i.e. Muslim)?\" The Prophet (ﷺ) said, \"Go to them patiently and calmly till you enter the land. Then, invite them to Islam, and inform them what is enjoined upon them, for, by Allah, if Allah gives guidance to somebody through you, it is better for you than possessing red camels",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Allah wonders at those people who will enter Paradise in chains",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "Narrated Abu Burda's father:The Prophet (ﷺ) said, \"Three persons will get their reward twice. (One is) a person who has a slave girl and he educates her properly and teaches her good manners properly (without violence) and then manumits and marries her. Such a person will get a double reward. (Another is) a believer from the people of the scriptures who has been a true believer and then he believes in the Prophet (ﷺ) (Muhammad). Such a person will get a double reward. (The third is) a slave who observes Allah's Rights and Obligations and is sincere to his master",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "Narrated As-Sab bin Jaththama:The Prophet (ﷺ) passed by me at a place called Al-Abwa or Waddan, and was asked whether it was permissible to attack the pagan warriors at night with the probability of exposing their women and children to danger. The Prophet (ﷺ) replied, \"They (i.e. women and children) are from them (i.e. pagans).\" I also heard the Prophet (ﷺ) saying, \"The institution of Hima is invalid except for Allah and His Apostle",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "As above (hadith 3012)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "Narrated `Abdullah:During some of the Ghazawat of the Prophet (ﷺ) a woman was found killed. Allah's Messenger (ﷺ) disapproved the killing of women and children",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "Narrated Ibn `Umar:During some of the Ghazawat of Allah's Messenger (ﷺ) a woman was found killed, so Allah's Messenger (ﷺ) forbade the killing of women and children",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) sent us in a mission (i.e., an army-unit) and said, \"If you find so-and-so and so-and-so, burn both of them with fire.\" When we intended to depart, Allah's Messenger (ﷺ) said, \"I have ordered you to burn so-and-so and so-and-so, and it is none but Allah Who punishes with fire, so, if you find them, kill them (i.e., don't burn them)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "Narrated `Ikrima:`Ali burnt some people and this news reached Ibn `Abbas, who said, \"Had I been in his place I would not have burnt them, as the Prophet (ﷺ) said, 'Don't punish (anybody) with Allah's Punishment.' No doubt, I would have killed them, for the Prophet (ﷺ) said, 'If somebody (a Muslim) discards his religion, kill him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "Narrated Anas bin Malik:A group of eight men from the tribe of 'Ukil came to the Prophet (ﷺ) and then they found the climate of Medina unsuitable for them. So, they said, \"O Allah's Messenger (ﷺ)! Provide us with some milk.\" Allah's Apostle said, \"I recommend that you should join the herd of camels.\" So they went and drank the urine and the milk of the camels (as a medicine) till they became healthy and fat. Then they killed the shepherd and drove away the camels, and they became unbelievers after whey were Muslims. When the Prophet (ﷺ) was informed by a shouter for help, he sent some men in their pursuit, and before the sun rose high, they were brought, and he had their hands and feet cut off. Then he ordered for nails which were heated and passed over their eyes, and whey were left in the Harra (i.e. rocky land in Medina). They asked for water, and nobody provided them with water till they died (Abu Qilaba, a sub-narrator said, \"They committed murder and theft and fought against Allah and His Apostle, and spread evil in the land)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "Narrated Abu Hurairah (ra):I heard Allah's Messenger (ﷺ) saying, \"An ant bit a Prophet amongst the Prophets, and he ordered that the place of the ants be burnt. So, Allah inspired to him, 'It is because one ant bit you that you burnt a nation amongst the nations that glorify Allah?",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "Narrated Jarir:Allah's Messenger (ﷺ)s said to me, \"Will you relieve me from Dhul-Khalasa? Dhul-Khalasa was a house (of an idol) belonging to the tribe of Khath'am called Al-Ka`ba Al-Yama-niya. So, I proceeded with one hundred and fifty cavalry men from the tribe of Ahmas, who were excellent knights. It happened that I could not sit firm on horses, so the Prophet (ﷺ) , stroke me over my chest till I saw his finger-marks over my chest, he said, 'O Allah! Make him firm and make him a guiding and rightly guided man.' \" Jarir proceeded towards that house, and dismantled and burnt it. Then he sent a messenger to Allah's Apostle informing him of that. Jarir's messenger said, \"By Him Who has sent you with the Truth, I did not come to you till I had left it like an emancipated or gabby camel (i.e. completely marred and spoilt).\" Jarir added, \"The Prophet (ﷺ) asked for Allah's Blessings for the horses and the men of Ahmas five times",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) burnt the date-palms of Bani An-Nadir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "Narrated Al-Bara bin Azib:Allah's Messenger (ﷺ) sent a group of Ansari men to kill Abu-Rafi`. One of them set out and entered their (i.e. the enemies) fort. That man said, \"I hid myself in a stable for their animals. They closed the fort gate. Later they lost a donkey of theirs, so they went out in its search. I, too, went out along with them, pretending to look for it. They found the donkey and entered their fort. And I, too, entered along with them. They closed the gate of the fort at night, and kept its keys in a small window where I could see them. When those people slept, I took the keys and opened the gate of the fort and came upon Abu Rafi` and said, 'O Abu Rafi`. When he replied me, I proceeded towards the voice and hit him. He shouted and I came out to come back, pretending to be a helper. I said, 'O Abu Rafi`, changing the tone of my voice. He asked me, 'What do you want; woe to your mother?' I asked him, 'What has happened to you?' He said, 'I don't know who came to me and hit me.' Then I drove my sword into his belly and pushed it forcibly till it touched the bone. Then I came out, filled with puzzlement and went towards a ladder of theirs in order to get down but I fell down and sprained my foot. I came to my companions and said, 'I will not leave till I hear the wailing of the women.' So, I did not leave till I heard the women bewailing Abu Rafi`, the merchant pf Hijaz. Then I got up, feeling no ailment, (and we proceeded) till we came upon the Prophet (ﷺ) and informed him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "Narrated Al-Bara bin Azib:Allah's Messenger (ﷺ) sent a group of the Ansar to Abu Rafi`. `Abdullah bin Atik entered his house at night and killed him while he was sleeping",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "Narrated Abu Huraira: The Prophet (ﷺ) said: \"Do not wish to meet the enemy, but when you meet face) the enemy, be patient",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) called,: \"War is deceit",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) said, \"War is deceit",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) said, \"Who is ready to kill Ka`b bin Al-Ashraf who has really hurt Allah and His Apostle?\" Muhammad bin Maslama said, \"O Allah's Messenger (ﷺ)! Do you like me to kill him?\" He replied in the affirmative. So, Muhammad bin Maslama went to him (i.e. Ka`b) and said, \"This person (i.e. the Prophet) has put us to task and asked us for charity.\" Ka`b replied, \"By Allah, you will get tired of him.\" Muhammad said to him, \"We have followed him, so we dislike to leave him till we see the end of his affair.\" Muhammad bin Maslama went on talking to him in this way till he got the chance to kill him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "Narrated Jabir:The Prophet (ﷺ) said, \"Who is ready to kill Ka`b bin Ashraf (i.e. a Jew).\" Muhammad bin Maslama replied, \"Do you like me to kill him?\" The Prophet (ﷺ) replied in the affirmative. Muhammad bin Maslama said, \"Then allow me to say what I like.\" The Prophet (ﷺ) replied, \"I do (i.e. allow you)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "Narrated 'Abdullah bin Umar (ra):Once, Allah's Messenger (ﷺ) accompanied by Ubai bin Ka'b set out to Ibn Saiyyad. He was informed that Ibn Saiyyad was in a garden of date palms. When Allah's Messenger (ﷺ) entered the garden of date-palms, he started hiding himself behind the trunks of the palms while Ibn Saiyyad was covered with a velvet sheet with murmurs emanating from under it. Ibn Saiyyah's mother saw Allah's Messenger (ﷺ) and said, \"O Saf! This is Muhammad.\" So Ibn Saiyyad got up. Allah's Messenger (ﷺ) said, \"If she had left him (in his state), the truth would have been clear",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "Narrated Al-Bara:I saw Allah's Messenger (ﷺ) on the day (of the battle) of the Trench carrying earth till the hair of his chest were covered with dust and he was a hairy man. He was reciting the following verses of `Abdullah (bin Rawaha): \"O Allah, were it not for You, We would not have been guided, Nor would we have given in charity, nor prayed. So, bestow on us calmness, and when we meet the enemy. Then make our feet firm, for indeed, Yet if they want to put us in affliction, (i.e. want to fight against us) we would not (flee but withstand them).\" The Prophet (ﷺ) used to raise his voice while reciting these verses. (See Hadith No. 432, Vol. 5)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "Narrated Abu Hazim:The people asked Sahl bin Sa`d As-Sa' idi \"With what thing (medicine) was the wound of Allah's Apostle treated?\" He replied, \"There is none left (living) amongst the people who knows it better than. `Ali used to bring water in his shield and Fatima (i.e. the Prophet's daughter) used to wash the blood off his face. Then a mat (of palm leaves) was burnt and its ash was inserted in the wound of Allah's Apostle",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "Narrated Abu Burda:That his father said, \"The Prophet (ﷺ) sent Mu`adh and Abu Musa to Yemen telling them. 'Treat the people with ease and don't be hard on them; give them glad tidings and don't fill them with aversion; and love each other, and don't differ",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "Narrated Al-Bara bin Azib:The Prophet (ﷺ) appointed `Abdullah bin Jubair as the commander of the infantry men (archers) who were fifty on the day (of the battle) of Uhud. He instructed them, \"Stick to your place, and don't leave it even if you see birds snatching us, till I send for you; and if you see that we have defeated the infidels and made them flee, even then you should not leave your place till I send for you.\" Then the infidels were defeated. By Allah, I saw the women fleeing lifting up their clothes revealing their leg-bangles and their legs. So, the companions of `Abdullah bin Jubair said, \"The booty! O people, the booty ! Your companions have become victorious, what are you waiting for now?\" `Abdullah bin Jubair said, \"Have you forgotten what Allah's Messenger (ﷺ) said to you?\" They replied, \"By Allah! We will go to the people (i.e. the enemy) and collect our share from the war booty.\" But when they went to them, they were forced to turn back defeated. At that time Allah's Messenger (ﷺ) in their rear was calling them back. Only twelve men remained with the Prophet (ﷺ) and the infidels martyred seventy men from us. On the day (of the battle) of Badr, the Prophet (ﷺ) and his companions had caused the 'Pagans to lose 140 men, seventy of whom were captured and seventy were killed. Then Abu Sufyan asked thrice, \"Is Muhammad present amongst these people?\" The Prophet (ﷺ) ordered his companions not to answer him. Then he asked thrice, \"Is the son of Abu Quhafa present amongst these people?\" He asked again thrice, \"Is the son of Al-Khattab present amongst these people?\" He then returned to his companions and said, \"As for these (men), they have been killed.\" `Umar could not control himself and said (to Abu Sufyan), \"You told a lie, by Allah! O enemy of Allah! All those you have mentioned are alive, and the thing which will make you unhappy is still there.\" Abu Sufyan said, \"Our victory today is a counterbalance to yours in the battle of Badr, and in war (the victory) is always undecided and is shared in turns by the belligerents, and you will find some of your (killed) men mutilated, but I did not urge my men to do so, yet I do not feel sorry for their deed\" After that he started reciting cheerfully, \"O Hubal, be high! (1) On that the Prophet (ﷺ) said (to his companions), \"Why don't you answer him back?\" They said, \"O Allah's Messenger (ﷺ) What shall we say?\" He said, \"Say, Allah is Higher and more Sublime.\" (Then) Abu Sufyan said, \"We have the (idol) Al `Uzza, and you have no `Uzza.\" The Prophet said (to his companions), \"Why don't you answer him back?\" They asked, \"O Allah's Messenger (ﷺ)! What shall we say?\" He said, \"Says Allah is our Helper and you have no helper",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "Narrated Anas:Allah's Messenger (ﷺ) was the (most handsome), most generous and the bravest of all the people. Once the people of Medina got frightened having heard an uproar at night. So, the Prophet (ﷺ) met the people while he was riding an unsaddled horse belonging to Abu Talha and carrying his sword (slung over his shoulder). He said (to them), \"Don't get scared, don't get scared.\" Then he added, \"I found it (i.e the horse) very fast",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "Narrated Salama:I went out of Medina towards Al-Ghaba. When I reached the mountain path of Al-Ghaba, a slave of `Abdur-Rahman bin `Auf met me. I said to him, \"Woe to you! What brought you here?\" He replied, \"The she-camels of the Prophet (ﷺ) have been taken away.\" I said, \"Who took them?\" He said, \"Ghatafan and Fazara.\" So, I sent three cries, \"O Sabaha-h ! O Sabahah !\" so loudly that made the people in between its (i.e. Medina's) two mountains hear me. Then I rushed till I met them after they had taken the camels away. I started throwing arrows at them saying, \"I am the son of Al-Akwa`\"; and today perish the mean people!\" So, I saved the she-camels from them before they (i.e. the robbers) could drink water. When I returned driving the camels, the Prophet (ﷺ) met me, I said, \"O Allah's Messenger (ﷺ) Those people are thirsty and I have prevented them from drinking water, so send some people to chase them.\" The Prophet (ﷺ) said, \"O son of Al-Akwa`, you have gained power (over your enemy), so forgive (them). (Besides) those people are now being entertained by their folk",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "Narrated Abu 'Is-haq:A man asked Al-Bara \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" Al-Bara replied while I was listening, \"As for Allah's Messenger (ﷺ) he did not flee on that day. Abu Sufyan bin Al- Harith was holding the reins of his mule and when the pagans attacked him, he dismounted and started saying, 'I am the Prophet, and there is no lie about it; I am the son of `Abdul Muttalib.' On that day nobody was seen braver than the Prophet",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "Narrated Abu Sa`id Al-Khudri:When the tribe of Bani Quraiza was ready to accept Sa`d's judgment, Allah's Messenger (ﷺ) sent for Sa`d who was near to him. Sa`d came, riding a donkey and when he came near, Allah's Messenger (ﷺ) said (to the Ansar), \"Stand up for your leader.\" Then Sa`d came and sat beside Allah's Messenger (ﷺ) who said to him. \"These people are ready to accept your judgment.\" Sa`d said, \"I give the judgment that their warriors should be killed and their children and women should be taken as prisoners.\" The Prophet (ﷺ) then remarked, \"O Sa`d! You have judged amongst them with (or similar to) the judgment of the King Allah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "Narrated Anas bin Malik (ra):Allah's Messenger (ﷺ) entered (Makkah) in the year of the Conquest (of Makkah) wearing a helmet over his head. After he took it off, a man came and said, \"Ibn Khatal is clinging to the curtains of the Ka'bah.\" The Prophet (ﷺ) said, \"Kill him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) sent a Sariya of ten men as spies under the leadership of `Asim bin Thabit al-Ansari, the grandfather of `Asim bin `Umar Al-Khattab. They proceeded till they reached Hadaa, a place between 'Usfan, and Mecca, and their news reached a branch of the tribe of Hudhail called Bani Lihyan. About two-hundred men, who were all archers, hurried to follow their tracks till they found the place where they had eaten dates they had brought with them from Medina. They said, \"These are the dates of Yathrib (i.e. Medina), \"and continued following their tracks When `Asim and his companions saw their pursuers, they went up a high place and the infidels circled them. The infidels said to them, \"Come down and surrender, and we promise and guarantee you that we will not kill any one of you\" `Asim bin Thabit; the leader of the Sariya said, \"By Allah! I will not come down to be under the protection of infidels. O Allah! Convey our news to Your Prophet. Then the infidels threw arrows at them till they martyred `Asim along with six other men, and three men came down accepting their promise and convention, and they were Khubaib-al-Ansari and Ibn Dathina and another man So, when the infidels captured them, they undid the strings of their bows and tied them. Then the third (of the captives) said, \"This is the first betrayal. By Allah! I will not go with you. No doubt these, namely the martyred, have set a good example to us.\" So, they dragged him and tried to compel him to accompany them, but as he refused, they killed him. They took Khubaid and Ibn Dathina with them and sold them (as slaves) in Mecca (and all that took place) after the battle of Badr. Khubaib was bought by the sons of Al-Harith bin 'Amir bin Naufal bin `Abd Manaf. It was Khubaib who had killed Al-Harith bin 'Amir on the day (of the battle of) Badr. So, Khubaib remained a prisoner with those people. Narrated Az-Zuhri: 'Ubaidullah bin 'Iyyad said that the daughter of Al-Harith had told him, \"When those people gathered (to kill Khubaib) he borrowed a razor from me to shave his pubes and I gave it to him. Then he took a son of mine while I was unaware when he came upon him. I saw him placing my son on his thigh and the razor was in his hand. I got scared so much that Khubaib noticed the agitation on my face and said, 'Are you afraid that I will kill him? No, I will never do so.' By Allah, I never saw a prisoner better than Khubaib. By Allah, one day I saw him eating of a bunch of grapes in his hand while he was chained in irons, and there was no fruit at that time in Mecca.\" The daughter of Al-Harith used to say, \"It was a boon Allah bestowed upon Khubaib.\" When they took him out of the Sanctuary (of Mecca) to kill him outside its boundaries, Khubaib requested them to let him offer two rak`at (prayer). They allowed him and he offered Two rak`at and then said, \"Hadn't I been afraid that you would think that I was afraid (of being killed), I would have prolonged the prayer. O Allah, kill them all with no exception.\" (He then recited the poetic verse):-- \"I being martyred as a Muslim, Do not mind how I am killed in Allah's Cause, For my killing is for Allah's Sake, And if Allah wishes, He will bless the amputated parts of a torn body\" Then the son of Al Harith killed him. So, it was Khubaib who set the tradition for any Muslim sentenced to death in captivity, to offer a two-rak`at prayer (before being killed). Allah fulfilled the invocation of `Asim bin Thabit on that very day on which he was martyred. The Prophet (ﷺ) informed his companions of their news and what had happened to them. Later on when some infidels from Quraish were informed that `Asim had been killed, they sent some people to fetch a part of his body (i.e. his head) by which he would be recognized. (That was because) `Asim had killed one of their chiefs on the day (of the battle) of Badr. So, a swarm of wasps, resembling a shady cloud, were sent to hover over `Asim and protect him from their messenger and thus they could not cut off anything from his flesh",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "Narrated Abu Musa:The Prophet (ﷺ) said, \"Free the captives, feed the hungry and pay a visit to the sick",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "Narrated Abu Juhaifa:I asked `Ali, \"Do you have the knowledge of any Divine Inspiration besides what is in Allah's Book?\" `Ali replied, \"No, by Him Who splits the grain of corn and creates the soul. I don't think we have such knowledge, but we have the ability of understanding which Allah may endow a person with, so that he may understand the Qur'an, and we have what is written in this paper as well.\" I asked, \"What is written in this paper?\" He replied, \"(The regulations of) blood-money, the freeing of captives, and the judgment that no Muslim should be killed for killing an infidel",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "Narrated Anas bin Malik:Some Ansari men asked permission from Allah's Messenger (ﷺ) saying, \"O Allah's Messenger (ﷺ)! Allow us not to take the ransom of our nephew Al `Abbas. The Prophet (ﷺ) replied, \"Do not leave a single Dirham thereof",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "(In another narration) Anas said:\"Some wealth was brought to the Prophet (ﷺ) from Bahrain. Al `Abbas came to him and said, 'O Allah's Messenger (ﷺ)! Give me (some of it), as I have paid my and `Aqil's ransom.' The Prophet (ﷺ) said, 'Take,' and gave him in his garment",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "Narrated Jubair:(who was among the captives of the Battle of Badr) I heard the Prophet (ﷺ) reciting 'Surat-at-Tur' in the Maghrib prayer",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "Narrated Salama bin Al-Akwa`:\"An infidel spy came to the Prophet (ﷺ) while he was on a journey. The spy sat with the companions of the Prophet (ﷺ) and started talking and then went away. The Prophet (ﷺ) said (to his companions), 'Chase and kill him.' So, I killed him.\" The Prophet (ﷺ) then gave him the belongings of the killed spy (in addition to his share of the war booty)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "Narrated `Amr bin Maimun:`Umar (after he was stabbed), instructed (his would-be-successor) saying, \"I urge him (i.e. the new Caliph) to take care of those non-Muslims who are under the protection of Allah and His Apostle in that he should observe the convention agreed upon with them, and fight on their behalf (to secure their safety) and he should not over-tax them beyond their capability",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "Narrated Sa`id bin Jubair:Ibn `Abbas said, \"Thursday! What (great thing) took place on Thursday!\" Then he started weeping till his tears wetted the gravels of the ground . Then he said, \"On Thursday the illness of Allah's Messenger (ﷺ) was aggravated and he said, \"Fetch me writing materials so that I may have something written to you after which you will never go astray.\" The people (present there) differed in this matter and people should not differ before a prophet. They said, \"Allah's Messenger (ﷺ) is seriously sick.' The Prophet (ﷺ) said, \"Let me alone, as the state in which I am now, is better than what you are calling me for.\" The Prophet (ﷺ) on his death-bed, gave three orders saying, \"Expel the pagans from the Arabian Peninsula, respect and give gifts to the foreign delegates as you have seen me dealing with them.\" I forgot the third (order)\" (Ya'qub bin Muhammad said, \"I asked Al-Mughira bin `Abdur-Rahman about the Arabian Peninsula and he said, 'It comprises Mecca, Medina, Al-Yama-ma and Yemen.\" Ya'qub added, \"And Al-Arj, the beginning of Tihama)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "Narrated Ibn `Umar:`Umar saw a silken cloak being sold in the market and he brought it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Buy this cloak and adorn yourself with it on the `Id festivals and on meeting the delegations.\" Allah's Messenger (ﷺ) replied, \"This is the dress for the one who will have no share in the Hereafter (or, this is worn by one who will have no share in the Hereafter).\" After sometime had passed, Allah's Messenger (ﷺ) sent a silken cloak to `Umar. `Umar took it and brought it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You have said that this is the dress of that who will have no share in the Hereafter (or, this is worn by one who will have no share in the Hereafter), yet you have sent me this!\" The Prophet (ﷺ) said,\" I have sent it) so that you may sell it or fulfill with it some of your needs",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "Narrated Ibn 'Umar: Umar and a group of the companions of the Prophet (ﷺ) set out with the Prophet to Ibn Saiyad. He found him playing with some boys near the hillocks of Bani Maghala. Ibn Saiyad at that time was nearing his puberty. He did not notice (the Prophet's presence) till the Prophet (ﷺ) stroked him on the back with his hand and said, \"Ibn Saiyad! Do you testify that I am Allah's Messenger (ﷺ)?\" Ibn Saiyad looked at him and said, \"I testify that you are the Apostle of the illiterates.\" Then Ibn Saiyad asked the Prophet. \"Do you testify that I am the apostle of Allah?\" The Prophet (ﷺ) said to him, \"I believe in Allah and His Apostles.\" Then the Prophet (ﷺ) said (to Ibn Saiyad). \"What do you see?\" Ibn Saiyad replied, \"True people and false ones visit me.\" The Prophet said, \"Your mind is confused as to this matter.\" The Prophet (ﷺ) added, \" I have kept something (in my mind) for you.\" Ibn Saiyad said, \"It is Ad-Dukh.\" The Prophet (ﷺ) said (to him), \"Shame be on you! You cannot cross your limits.\" On that 'Umar said, \"O Allah's Messenger (ﷺ)! Allow me to chop his head off.\" The Prophet (ﷺ) said, \"If he should be him (i.e. Ad-Dajjal) then you cannot overpower him, and should he not be him, then you are not going to benefit by murdering him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "Narrated Usama bin Zaid:I asked the Prophet (ﷺ) during his Hajj, \"O Allah's Messenger (ﷺ)! Where will you stay tomorrow?\" He said, \"Has `Aqil left for us any house?\" He then added, \"Tomorrow we will stay at Khaif Bani Kinana, i.e. Al-Muhassab, where (the Pagans of) Quraish took an oath of Kufr (i.e. to be loyal to heathenism) in that Bani Kinana got allied with Quraish against Bani Hashim on the terms that they would not deal with the members of the is tribe or give them shelter.\" (Az-Zuhri said, \"Khaif means valley.\") (See Hadith No. 659, Vol. 2)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "Narrated Aslam:`Umar bin Al-Khattab appointed a freed slave of his, called Hunai, manager of the Hima (i.e. a pasture devoted for grazing the animals of the Zakat or other specified animals). He said to him, \"O Hunai! Don't oppress the Muslims and ward off their curse (invocations against you) for the invocation of the oppressed is responded to (by Allah); and allow the shepherd having a few camels and those having a few sheep (to graze their animals), and take care not to allow the livestock of `Abdur-Rahman bin `Auf and the livestock of (`Uthman) bin `Affan, for if their livestock should perish, then they have their farms and gardens, while those who own a few camels and those who own a few sheep, if their livestock should perish, would bring their dependents to me and appeal for help saying, 'O chief of the believers! O chief of the believers!' Would I then neglect them? (No, of course). So, I find it easier to let them have water and grass rather than to give them gold and silver (from the Muslims' treasury). By Allah, these people think that I have been unjust to them. This is their land, and during the prelslamic period, they fought for it and they embraced Islam (willingly) while it was in their possession. By Him in Whose Hand my life is! Were it not for the animals (in my custody) which I give to be ridden for striving in Allah's Cause, I would not have turned even a span of their land into a Hima",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "Narrated Hudhaifa:The Prophet (ﷺ) said (to us), \" List the names of those people who have announced that they are Muslims.\" So, we listed one thousand and five hundred men. Then we wondered, \"Should we be afraid (of infidels) although we are one thousand and five hundred in number?\" No doubt, we witnessed ourselves being afflicted with such bad trials that one would have to offer the prayer alone in fear. Narrated Al-A`mash: \"We (listed the Muslims and) found them five hundred.\" And Abu Muawiya said, \"Between six hundred to seven hundred",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "Narrated Ibn `Abbas:A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have enlisted in the army for such-andsuch Ghazwa, and my wife is leaving for Hajj.\" Allah's Messenger (ﷺ) said, \"Go back and perform Hajj with your wife",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "Narrated Az-Zuhri:as follows in Hadith 297. Narrated Abu Huraira: We were in the company of Allah's Messenger (ﷺ) in a Ghazwa, and he remarked about a man who claimed to be a Muslim, saying, \"This (man) is from the people of the (Hell) Fire.\" When the battle started, the man fought violently till he got wounded. Somebody said, \"O Allah's Messenger (ﷺ)! The man whom you described as being from the people of the (Hell) Fire fought violently today and died.\" The Prophet (ﷺ) said, \"He will go to the (Hell) Fire.\" Some people were on the point of doubting (the truth of what the Prophet had said) while they were in this state, suddenly someone said that he was still alive but severely wounded. When night fell, he lost patience and committed suicide. The Prophet (ﷺ) was informed of that, and he said, \"Allah is Greater! I testify that I am Allah's Slave and His Apostle.\" Then he ordered Bilal to announce amongst the people: 'None will enter Paradise but a Muslim, and Allah may support this religion (i.e. Islam) even with a disobedient man",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) delivered a sermon and said, \"Zaid received the flag and was martyred, then Ja`far took it and was martyred, then `Abdullah bin Rawaha took it and was martyred, and then Khalid bin Al-Walid took it without being appointed, and Allah gave him victory.\" The Prophet (ﷺ) added, \"I am not pleased (or they will not be pleased) that they should remain (alive) with us,\" while his eyes were shedding tears",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "Narrated Anas: The people of the tribes of Ril, Dhakwan, 'Usiya and Bani Lihyan came to the Prophet (ﷺ) and claimed that they had embraced Islam, and they requested him to support them with some men to fight their own people. The Prophet (ﷺ) supported them with seventy men from the Ansar whom we used to call Al-Qurra'(i.e. Scholars) who (out of piety) used to cut wood during the day and pray all the night. So, those people took the (seventy) men till they reached a place called Bi'r-Ma'ana where they betrayed and martyred them. So, the Prophet (ﷺ) invoked evil on the tribe of Ril, Dhakwan and Bani Lihyan for one month in the prayer. Narrated Qatada: Anas told us that they (i.e. Muslims) used to recite a Quranic Verse concerning those martyrs which was:-- \"O Allah! Let our people be informed on our behalf that we have met our Lord Who has got pleased with us and made us pleased.\" Then the Verse was cancelled",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "Narrated Abu Talha:Whenever the Prophet (ﷺ) conquered some people, he would stay in their town for three days",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "Narrated Anas:The Prophet (ﷺ) performed `Umra, setting out from Al-Jarana where he distributed the war booty of Hunain",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "Narrated Nafi' (ra):A horse of Ibn 'Umar fled and the enemy took it. Then the Muslims conquered the enemy and the horse was returned to him during the lifetime of Allah's Messenger (ﷺ). And also, once a slave of Ibn 'Umar (ra) fled and joined the Byzantines, and when the Muslims conquered them, Khalid bin Al-Walid returned the slave to him after the death of the Prophet (ﷺ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "Narrated Nafi`:Once a slave of Ibn `Umar fled and joined the Byzantine. Khalid bin Al-Walid got him back and returned him to `Abdullah (bin `Umar). Once a horse of Ibn `Umar also ran away and followed the Byzantines, and he (i.e. Khalid) got it back and returned it to `Abdullah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "Narrated Ibn `Umar:That he was riding a horse on the day, the Muslims fought (against the Byzantines), and the commander of the Muslim army was Khalid bin Al-Walid who had been appointed by Abu Bakr. The enemy took the horse away, and when the enemy was defeated, Khalid returned the horse to him",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "Narrated Jabir bin `Abdullah:I said, \"O Allah's Messenger (ﷺ)! We have slaughtered a young sheep of ours and have ground one Sa of barley. So, I invite you along with some persons.\" So, the Prophet (ﷺ) said in a loud voice, \"O the people of the Trench! Jabir had prepared \"Sur\" so come along",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "Narrated Um Khalid:(the daughter of Khalid bin Sa`id) I went to Allah's Messenger (ﷺ) with my father and I was Nearing a yellow shirt. Allah's Messenger (ﷺ) said, \"Sanah, Sanah!\" (`Abdullah, the narrator, said that 'Sanah' meant 'good' in the Ethiopian language). I then started playing with the seal of Prophethood (in between the Prophet's shoulders) and my father rebuked me harshly for that. Allah's Messenger (ﷺ) said. \"Leave her,\" and then Allah's Messenger (ﷺ) (invoked Allah to grant me a long life) by saying (thrice), \"Wear this dress till it is worn out and then wear it till it is worn out, and then wear it till it is worn out.\" (The narrator adds, \"It is said that she lived for a long period, wearing that (yellow) dress till its color became dark because of long wear",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "Narrated Abu Huraira:Al-Hasan bin 'All took a date from the dates of the Sadaqa and put it in his mouth. The Prophet (ﷺ) said (to him) in Persian, \"Kakh, kakh! (i.e. Don't you know that we do not eat the Sadaqa (i.e. what is given in charity) (charity is the dirt of the people)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) got up amongst us and mentioned Al Ghulul, emphasized its magnitude and declared that it was a great sin saying, \"Don't commit Ghulul for I should not like to see anyone amongst you on the Day of Ressurection, carrying over his neck a sheep that will be bleating, or carrying over his neck a horse that will be neighing. Such a man will be saying: 'O Allah's Messenger (ﷺ)! Intercede with Allah for me,' and I will reply, 'I can't help you, for I have conveyed Allah's Message to you Nor should I like to see a man carrying over his neck, a camel that will be grunting. Such a man will say, 'O Allah's Apostle! Intercede with Allah for me, and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying over his neck gold and silver and saying, 'O Allah's Messenger (ﷺ)! Intercede with Allah for me,' and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying clothes that will be fluttering, and the man will say, 'O Allah's Messenger (ﷺ)! Intercede with Allah for me.' And I will say, 'I can't help you, for I have conveyed Allah's Message to you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Narrated `Abdullah bin `Amr:There was a man who looked after the family and the belongings of the Prophet (ﷺ) and he was called Karkara. The man died and Allah's Messenger (ﷺ) said, \"He is in the '(Hell) Fire.\" The people then went to look at him and found in his place, a cloak he had stolen from the war booty",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "Narrated Abaya bin Rifaa:My grandfather, Rafi` said, \"We were in the company of the Prophet (ﷺ) at DhulHulaifa, and the people suffered from hunger. We got some camels and sheep (as booty) and the Prophet (ﷺ) was still behind the people. They hurried and put the cooking pots on the fire. (When he came) he ordered that the cooking pots should be upset and then he distributed the booty (amongst the people) regarding ten sheep as equal to one camel then a camel fled and the people chased it till they got tired, as they had a few horses (for chasing it). So a man threw an arrow at it and caused it to stop (with Allah's Permission). On that the Prophet (ﷺ) said, 'Some of these animals behave like wild beasts, so, if any animal flee from you, deal with it in the same way.\" My grandfather asked (the Prophet (ﷺ) ), \"We hope (or are afraid) that we may meet the enemy tomorrow and we have no knives. Can we slaughter our animals with canes?\" Allah's Messenger (ﷺ) replied, \"If the instrument used for killing causes the animal to bleed profusely and if Allah's Name is mentioned on killing it, then eat its meat (i.e. it is lawful) but won't use a tooth or a nail and I am telling you the reason: A tooth is a bone (and slaughtering with a bone is forbidden ), and a nail is the slaughtering instrument of the Ethiopians",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "Narrated Qais:Jarir bin `Abdullah said to me, \"Allah's Messenger (ﷺ) said to me, 'Won't you relieve me from Dhul- Khalasa?' Dhul-Khalasa was a house where the tribe of Khatham used to stay, and it used to be called Ka`bat-ul Yamaniya. So I proceeded with one hundred-and-fifty (men) from the tribe of Ahmas who were good cavalry. I informed the Prophet (ﷺ) that I could not sit firm on horses, so he stroke me on the chest with his hand and I noticed his finger marks on my chest. He invoked, 'O Allah! Make him firm and a guiding and rightly-guided man.\" Jarir set out towards that place, dismantled and burnt it, and then sent the good news to Allah's Messenger (ﷺ) . The messenger of Jarir said to Allah's Messenger (ﷺ). \"O Allah's Apostle! By Him Who has sent you with the Truth, I did not come to you till it (i.e. the house) had been turned (black) like a scabby camel (covered with tar).\" So the Prophet (ﷺ) invokes Allah to Bless the horses of the men of Ahmas five times",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, on the day of the Conquest of Mecca, \"There is no migration (after the Conquest), but Jihad and good intentions, and when you are called for Jihad, you should immediately respond to the call",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "Narrated `Ata':I and 'Ubai bin `Umar went to `Aisha while she was staying near Thabir (i.e. a mountain). She said, \"There is no Migration after Allah gave His Prophet victory over Mecca",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "Narrated Sa`d bin 'Ubaida:Abu `Abdur-Rahman who was one of the supporters of `Uthman said to Abu Talha who was one of the supporters of `Ali, \"I perfectly know what encouraged your leader (i.e. `Ali) to shed blood. I heard him saying: Once the Prophet (ﷺ) sent me and Az-Zubair saying, 'Proceed to such-and-such Ar-Roudah (place) where you will find a lady whom Hatib has given a letter. So when we arrived at Ar-Roudah, we requested the lady to hand over the letter to us. She said, 'Hatib has not given me any letter.' We said to her. 'Take out the letter or else we will strip off your clothes.' So she took it out of her braid. So the Prophet (ﷺ) sent for Hatib, (who came) and said, 'Don't hurry in judging me, for, by Allah, I have not become a disbeliever, and my love to Islam is increasing. (The reason for writing this letter was) that there is none of your companions but has relatives in Mecca who look after their families and property, while I have nobody there, so I wanted to do them some favor (so that they might look after my family and property).' The Prophet (ﷺ) believed him. `Umar said, 'Allow me to chop off his (i.e. Hatib's) neck as he has done hypocrisy.' The Prophet (ﷺ) said, (to `Umar), 'Who knows, perhaps Allah has looked at the warriors of Badr and said (to them), 'Do whatever you like, for I have forgiven you.' \" `Abdur-Rahman added, \"So this is what encouraged him (i.e. `Ali)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "Narrated Ibn Abi Mulaika:Ibn Az-Zubair said to Ibn Ja`far \"Do you remember when I, you and Ibn `Abbas went out to receive Allah's Messenger (ﷺ)?\" Ibn Ja`far replied in the affirmative. Ibn Az-Zubair added, \"And Allah's Messenger (ﷺ) made us (i.e. I and Ibn `Abbas) ride along with him and left you",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "Narrated As-Sa'ib bin Yazid:I along with some boys went out to receive Allah's Messenger (ﷺ) at Thaniyatal-Wada",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "Narrated `Abdullah:When the Prophet (ﷺ) returned (from Jihad), he would say Takbir thrice and add, \"We are returning, if Allah wishes, with repentance and worshipping and praising (our Lord) and prostrating ourselves before our Lord. Allah fulfilled His Promise and helped His Slave, and He Alone defeated the (infidel) clans",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "Narrated Anas bin Malik:We were in the company of the Prophet (ﷺ) while returning from 'Usfan, and Allah's Messenger (ﷺ) was riding his she-camel keeping Safiya bint Huyay riding behind him. His she-camel slipped and both of them fell down. Abu Talha jumped from his camel and said, \"O Allah's Messenger (ﷺ)! May Allah sacrifice me for you.\" The Prophet (ﷺ) said, \"Take care of the lady.\" So, Abu Talha covered his face with a garment and went to Safiya and covered her with it, and then he set right the condition of their shecamel so that both of them rode, and we were encircling Allah's Messenger (ﷺ) like a cover. When we approached Medina, the Prophet (ﷺ) said, \"We are returning with repentance and worshipping and praising our Lord.\" He kept on saying this till he entered Medina",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "Narrated Anas bin Malik:That he and Abu Talha came in the company of the Prophet (ﷺ) and Safiya was accompanying the Prophet, who let her ride behind him on his she-camel. During the journey, the she-camel slipped and both the Prophet (ﷺ) and (his) wife fell down. Abu Talha (the sub-narrator thinks that Anas said that Abu Talha jumped from his camel quickly) said, \"O Allah's Messenger (ﷺ)! May Allah sacrifice me for your sake! Did you get hurt?\" The Prophet (ﷺ) replied,\"No, but take care of the lady.\" Abu Talha covered his face with his garment and proceeded towards her and covered her with his garment, and she got up. He then set right the condition of their she-camel and both of them (i.e. the Prophet (ﷺ) and his wife) rode and proceeded till they approached Medina. The Prophet (ﷺ) said, \"We are returning with repentance and worshipping and praising our Lord.\" The Prophet (ﷺ) kept on saying this statement till he entered Medina",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "Narrated Jabir bin `Abdullah:I was on a journey in the company of the Prophet (ﷺ) and when we reached Medina, he said to me, \"Enter the Mosque and offer two rak`at",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "Narrated Ka`b:Whenever the Prophet (ﷺ) returned from a journey in the forenoon, he would enter the Mosque and offer two rak`at before sitting",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "Narrated Muharib bin Dithar:Jabir bin `Abdullah said, \"When Allah's Messenger (ﷺ) arrived at Medina, he slaughtered a camel or a cow.\" Jabir added, \"The Prophet (ﷺ) bought a camel from me for two Uqiyas (of gold) and one or two Dirhams. When he reached Sirar, he ordered that a cow be slaughtered and they ate its meat. When he arrived at Medina, he ordered me to go to the Mosque and offer two rak`at, and weighed (and gave) me the price of the camel",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "Narrated Jabir:Once I returned from a journey and the Prophet (ﷺ) said (to me) \"Offer two rak`at.\" (Sirar is a place near Medina)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 294
			}
		}
	]
}