{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"69": "Supporting the Family"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5351,
			"arabicnumber": 5351,
			"text": "Narrated Abu Mas`ud Al-Ansari:The Prophet (ﷺ) said, \"When a Muslim spends something on his family intending to receive Allah's reward it is regarded as Sadaqa for him",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5352,
			"arabicnumber": 5352,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Allah said, 'O son of Adam! Spend, and I shall spend on you",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5353,
			"arabicnumber": 5353,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who fights for Allah's Cause, or like him who performs prayers all the night and fasts all the day",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5354,
			"arabicnumber": 5354,
			"text": "Narrated Sa`d:The Prophet (ﷺ) visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all my property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of it?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors wealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for you, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, so that some people may benefit by you and others be harmed by you",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5355,
			"arabicnumber": 5355,
			"text": "Narrated Abu Huraira:\"The Prophet (ﷺ) said, 'The best alms is that which is given when one is rich, and a giving hand is better than a taking one, and you should start first to support your dependents.' A wife says, 'You should either provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son says, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that from Allah's Messenger (ﷺ) ?\" He said, \"No, it is from my own self",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5356,
			"arabicnumber": 5356,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The best alms is that which you give when you are rich, and you should start first to support your dependants",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5357,
			"arabicnumber": 5357,
			"text": "Narrated `Umar:The Prophet (ﷺ) used to sell the dates of the garden of Bani An-Nadir and store for his family so much food as would cover their needs for a whole year",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5358,
			"arabicnumber": 5358,
			"text": "Narrated Malik bin Aus bin Al-Hadathan:Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and `Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The group said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" `Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of Allah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used to do, and both of you knew all about it then.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5359,
			"arabicnumber": 5359,
			"text": "Narrated `Aisha:Hind bint `Utba came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser so is it sinful of me to feed our children from his property?\" Allah's Messenger (ﷺ) said, \"No except if you take for your needs what is just and reasonable",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5360,
			"arabicnumber": 5360,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"If the wife gives of her husband's property (something in charity) without his permission, he will get half the reward",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5361,
			"arabicnumber": 5361,
			"text": "Narrated `Ali:Fatima went to the Prophet (ﷺ) complaining about the bad effect of the stone hand-mill on her hand. She heard that the Prophet (ﷺ) had received a few slave girls. But (when she came there) she did not find him, so she mentioned her problem to `Aisha. When the Prophet (ﷺ) came, `Aisha informed him about that. `Ali added, \"So the Prophet (ﷺ) came to us when we had gone to bed. We wanted to get up (on his arrival) but he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of his feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have requested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three times, and Allahu Akbar' thirty four times, for that is better for you than a servant",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5362,
			"arabicnumber": 5362,
			"text": "Narrated `Ali bin Abi Talib:Fatima came to the Prophet (ﷺ) asking for a servant. He said, \"May I inform you of something better than that? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three times, and 'Allahu Akbar' thirty four times. `Ali added, 'I have never failed to recite it ever since.\" Somebody asked, \"Even on the night of the battle of Siffin?\" He said, \"Even on the night of the battle of Siffin",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5363,
			"arabicnumber": 5363,
			"text": "Narrated Al-Aswad bin Yazid:I asked `Aisha \"What did the Prophet (ﷺ) use to do at home?\" She said, \"He used to work for his family, and when he heard the Adhan (call for the prayer), he would go out",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5364,
			"arabicnumber": 5364,
			"text": "Narrated `Aisha:Hind bint `Utba said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser and he does not give me what is sufficient for me and my children. Can I take of his property without his knowledge?\" The Prophet (ﷺ) said, \"Take what is sufficient for you and your children, and the amount should be just and reasonable",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5365,
			"arabicnumber": 5365,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The best women among the camel riders, are the women of Quraish.\" (Another narrator said) The Prophet (ﷺ) said, \"The righteous among the women of Quraish are those who are kind to their young ones and who look after their husband's property",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5366,
			"arabicnumber": 5366,
			"text": "Narrated `Ali:The Prophet (ﷺ) gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and distributed it among my women-folk",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5367,
			"arabicnumber": 5367,
			"text": "Narrated Jabir bin `Abdullah:My father died and left seven or nine girls and I married a matron. Allah's Messenger (ﷺ) said to me, \"O Jabir! Have you married?\" I said, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"A matron.\" he said, \"Why not a virgin, so that you might play with her and she with you, and you might amuse her and she amuse you.\" I said, \" `Abdullah (my father) died and left girls, and I dislike to marry a girl like them, so I married a lady (matron) so that she may look after them.\" On that he said, \"May Allah bless you,\" or \"That is good",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5368,
			"arabicnumber": 5368,
			"text": "Narrated Abu Huraira:A man came to the Prophet (ﷺ) and said, \"I am ruined!\" The Prophet (ﷺ) said, \"Why?\" He said, \"I had sexual intercourse with my wife while fasting (in the month of Ramadan).\" The Prophet (ﷺ) said to him, \"Manumit a slave (as expiation).\" He replied, \"I cannot afford that.\" The Prophet (ﷺ) said, \"Then fast for two successive months.\" He said, \"I cannot.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\" He said, \"I have nothing to do that.\" In the meantime a basket full of dates was brought to the Prophet (ﷺ) . He said, \"Where is the questioner.\" The man said, \"I am here.\" The Prophet (ﷺ) said (to him), \"Give this (basket of dates) in charity (as expiation).\" He said, \"O Allah's Messenger (ﷺ)! Shall I give it to poorer people than us? By Him Who sent you with the Truth, there is no family between Medina's two mountains poorer than us.\" The Prophet (ﷺ) smiled till his pre-molar teeth became visible. He then said, \"Then take it",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5369,
			"arabicnumber": 5369,
			"text": "Narrated Um Salama:I said, \"O Allah's Messenger (ﷺ)! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5370,
			"arabicnumber": 5370,
			"text": "Narrated `Aisha:Hind (bint `Utba) said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I take of his property what will cover me and my children's needs?\" The Prophet (ﷺ) said, \"Take (according to your needs) in a reasonable manner",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5371,
			"arabicnumber": 5371,
			"text": "Narrated Abu Huraira:A dead man in debt used to be brought to Allah's Messenger (ﷺ) who would ask, \"Has he left anything to re pay his debts?\" If he was informed that he had left something to cover his debts the Prophet (ﷺ) would offer the funeral prayer for him; otherwise he would say to the Muslims present there), \"Offer the funeral prayer for your friend:\"but when Allah helped the Prophet (ﷺ) to gain victory (on his expeditions), he said, \"I am closer to the Believers than themselves, so. if one of the Believers dies in debt, I will repay it, but if he leaves wealth, it will be for his heirs",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5372,
			"arabicnumber": 5372,
			"text": "Narrated Um Habiba:(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Will you marry my sister, the daughter of Abu Sufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I said, \"Yes, for I am not your only wife, and the person I like most to share the good with me, is my sister.\" He said, \"That is not lawful for me.\" I said, \"O Allah's Messenger (ﷺ)! We have heard that you want to marry Durra, the daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she is unlawful for me, for she is my foster niece. Thuwaiba suckled me and Abu Salama. So you should not present to me your daughters and sisters.\" Narrated 'Urwa: Thuwaiba had been a slave girl whom Abu Lahab had emancipated",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 22
			}
		}
	]
}