{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5545,
			"arabicnumber": 5545,
			"text": "Narrated Al-Bara:The Prophet (ﷺ) said (on the day of Idal-Adha), \"The first thing we will do on this day of ours, is to offer the (`Id) prayer and then return to slaughter the sacrifice. Whoever does so, he acted according to our Sunna (tradition), and whoever slaughtered (the sacrifice) before the prayer, what he offered was just meat he presented to his family, and that will not be considered as Nusak (sacrifice).\" (On hearing that) Abu Burda bin Niyar got up, for he had slaughtered the sacrifice before the prayer, and said, \"I have got a six month old ram.\" The Prophet (ﷺ) said, 'Slaughter it (as a sacrifice) but it will not be sufficient for any-one else (as a sacrifice after you). Al-Bara' added: The Prophet (ﷺ) said, \"Whoever slaughtered (the sacrifice) after the prayer, he slaughtered it at the right time and followed the tradition of the Muslims",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5546,
			"arabicnumber": 5546,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the prayer, he just slaughtered it for himself, and whoever slaughtered it after the prayer, he slaughtered it at the right time and followed the tradition of the Muslims",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5547,
			"arabicnumber": 5547,
			"text": "Narrated `Uqba bin 'Amir Al-Juhani:that the Prophet (ﷺ) distributed among his companions some animals for sacrifice (to be slaughtered on `Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Messenger (ﷺ)! I get in my share of Jadha'a (a six month old ram).\" The Prophet (ﷺ) said, \"Slaughter it as a sacrifice",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5548,
			"arabicnumber": 5548,
			"text": "Narrated `Aisha:that the Prophet (ﷺ) entered upon her when she had her menses at Sarif before entering Mecca, and she was weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet (ﷺ) said, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the others, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef was brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Messenger (ﷺ) has slaughtered some cows as sacrifices on behalf of his wives",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5549,
			"arabicnumber": 5549,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should repeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Messenger (ﷺ)! This is a day on which meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is to me better than the meat of two sheep.\" The Prophet (ﷺ) allowed him to slaughter it as a sacrifice, but I do not know whether this permission was valid for other than that man or not. The Prophet (ﷺ) then went towards two rams and slaughtered them, and then the people went towards some sheep and distributed them among themselves",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5550,
			"arabicnumber": 5550,
			"text": "Narrated Abu Bakra:The Prophet (ﷺ) said, \"Time has come back to its original state which it had on the day Allah created the Heavens and the Earth. The year is twelve months, four of which are sacred, three of them are in succession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is between Juma'da (ath-thamj and Sha'ban. The Prophet (ﷺ) then asked, \"Which month is this?\" We said, \"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of Mecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor are as sacred to one another as this day of yours in this town of yours in this month of yours. You will meet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting the necks of each other. It is incumbent upon those who are present to convey this message to those who are absent, for some of those to whom it is conveyed may comprehend it better than some of those who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The Prophet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered Allah's message (to you)?",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5551,
			"arabicnumber": 5551,
			"text": "Narrated Nafi': 'Abdullah (bin 'Umar) used to slaughter his sacrifice at the slaughtering place (i.e the slaughtering place of the Prophet (ﷺ)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5552,
			"arabicnumber": 5552,
			"text": "Ibn 'Umar said, \"Allah's Messenger (ﷺ) used to slaughter (camels and sheep, etc.,) as sacrifices at the Musalla",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5553,
			"arabicnumber": 5553,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) used to offer two rams as sacrifices, and I also used to offer two rams",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5554,
			"arabicnumber": 5554,
			"text": "Narrated Anas:Allah's Messenger (ﷺ) came towards two horned rams having black and white colors and slaughtered them with his own hands",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5555,
			"arabicnumber": 5555,
			"text": "Narrated `Uqba bin 'Amir:that the Prophet (ﷺ) gave him some sheep to distribute among his companions to slaughter as sacrifices (`Id--al--Adha). A kid goat was left and he told the Prophet (ﷺ) of that whereupon he said to him, \"Slaughter it as a sacrifice (on your behalf)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5556,
			"arabicnumber": 5556,
			"text": "Narrated Al-Bara' bin `Azib:An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Messenger (ﷺ) said to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's Apostle! I have got a domestic kid goat.\" The Prophet (ﷺ) said, \"Slaughter it (as a sacrifice) but it will not be permissible for anybody other than you\" The Prophet (ﷺ) added, \"Whoever slaughtered his sacrifice before the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, he offered his sacrifice properly and followed the tradition of the Muslims",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5557,
			"arabicnumber": 5557,
			"text": "Narrated Al-Bara':Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet (ﷺ) said to him, \"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" (Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) The Prophet (ﷺ) said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient for anyone else after you",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5558,
			"arabicnumber": 5558,
			"text": "Narrated Anas:The Prophet (ﷺ) slaughtered two rams, black and white in color (as sacrifices), and I saw him putting his foot on their sides and mentioning Allah's Name and Takbir (Allahu Akbar). Then he slaughtered them with his own hands",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5559,
			"arabicnumber": 5559,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) entered upon me at Sarif while I was weeping (because I was afraid that I would not be able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I replied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform the ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" Allah's Messenger (ﷺ) slaughtered some cows as sacrifices on behalf of his wives",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5560,
			"arabicnumber": 5560,
			"text": "Narrated Al-Bara':I heard the Prophet (ﷺ) delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we will do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our sacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered his sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that was not a sacrifice.\" Abu Burda got up and said, \"O Allah's Messenger (ﷺ)! I slaughtered the sacrifice before the prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet (ﷺ) said, \"Slaughter it to make up for that, but it will not be sufficient for anybody else after you",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5561,
			"arabicnumber": 5561,
			"text": "Narrated Anas:The Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter another one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of his neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a which is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I do not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went towards two rams and slaughtered them, and the people went towards their sheep and slaughtered them",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5562,
			"arabicnumber": 5562,
			"text": "Narrated Jundab bin Sufyan Al-Bajali:I witnessed the Prophet (ﷺ) on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before offering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered their sacrifice yet, should slaughter now",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5563,
			"arabicnumber": 5563,
			"text": "Narrated Al-Bara':One day Allah's Messenger (ﷺ) offered the `Id prayer and said, \"Whoever offers our prayer and faces our Qibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up and said, \"O Allah's Messenger (ﷺ)! I have already done it. The Prophet (ﷺ) said, \"That is something you have done before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I slaughter it?\" The Prophet (ﷺ) said, \"Yes, but it will not be sufficient for anyone after you",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5564,
			"arabicnumber": 5564,
			"text": "Narrated Anas:The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his foot on their sides and slaughter them with his own hands",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5565,
			"arabicnumber": 5565,
			"text": "Narrated Anas:The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them with his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their sides",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5566,
			"arabicnumber": 5566,
			"text": "Narrated Masruq:that he came to `Aisha and said to her, \"O Mother of the Believers! There is a man who sends a Hadi to Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state of Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" (What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She said, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to Ka`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the people returned (from the Hajj)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5567,
			"arabicnumber": 5567,
			"text": "Narrated Jabir bin `Abdullah:During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to Medina. (The narrator often said. The meat of the Hadi)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5568,
			"arabicnumber": 5568,
			"text": "Narrated Abu Sa`id Al-Khudri:that once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented to him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall not taste it. (In his narration) Abu Sa`id added: I got up and went to my brother, Abu Qatada (who was his maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He Sa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and eaten later on)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5569,
			"arabicnumber": 5569,
			"text": "Narrated Salama bin Al-Aqua':The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5570,
			"arabicnumber": 5570,
			"text": "Narrated `Aisha:We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5571,
			"arabicnumber": 5571,
			"text": "Narrated Abu `Ubaid:the freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab. `Umar offered the `Id prayer before the sermon and then delivered the sermon before the people, saying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two 'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the meat of your sacrifices",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5572,
			"arabicnumber": 5572,
			"text": "Narrated Abu `Ubaid:(in continuation of above). Then I witnessed the `Id with `Uthman bin `Affan, and that was on a Friday. He offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) together, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua prayer, he may wait, and whoever would like to return (home) Is granted my permission to do so",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5573,
			"arabicnumber": 5573,
			"text": "Narrated Abu `Ubaid:(in continuation of above). Then I witnessed (the 'Its) with `Ali bin Abi Talib, and he too offered the `Id prayer before the sermon and then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat the meat of your sacrifices for more than three days",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5574,
			"arabicnumber": 5574,
			"text": "Narrated Salim:`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for three days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of the meat of Hadi (which is regarded as unlawful after the three days of the `Id)",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 30
			}
		}
	]
}