{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5640,
			"arabicnumber": 5640,
			"text": "Narrated `Aisha:(the wife of the Prophet) Allah's Messenger (ﷺ) said, \"No calamity befalls a Muslim but that Allah expiates some of his sins because of it, even though it were the prick he receives from a thorn",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": 5642,
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": 5643,
			"text": "Narrated Ka`b:The Prophet (ﷺ) said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt sometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine tree which keeps straight till once it is uprooted suddenly",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": 5644,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh tender plant; from whatever direction the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. Similarly, a believer is afflicted with calamities (but he remains patient till Allah removes his difficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah cuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": 5645,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"If Allah wants to do good to somebody, He afflicts him with trials",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5646,
			"arabicnumber": 5646,
			"text": "Narrated Aisha:I never saw anybody suffering so much from sickness as Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": 5647,
			"text": "Narrated `Abdullah:I visited the Prophet (ﷺ) during his ailments and he was suffering from a high fever. I said, \"You have a high fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is afflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": 5648,
			"text": "Narrated `Abdullah:I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I said, \"O Allah's Messenger (ﷺ)! You have a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you will have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it were the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": 5649,
			"text": "Narrated Abu Muisa Al-Ash`ari:The Prophet (ﷺ) said, \"Feed the hungry, visit the sick, and set free the captives",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": 5650,
			"text": "Narrated Al-Bara bin Azib:Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do seven other things. He forbade us to wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral processions, visit the sick and greet everybody. (See Hadith No. 104)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": 5651,
			"text": "Narrated Jabir bin `Abdullah:Once I fell ill. The Prophet (ﷺ) and Abu Bakr came walking to pay me a visit and found me unconscious. The Prophet (ﷺ) performed ablution and then poured the remaining water on me, and I came to my senses to see the Prophet. I said, \"O Allah's Messenger (ﷺ)! What shall I do with my property? How shall I dispose of (distribute) my property?\" He did not reply till the Verse of inheritance was revealed",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": 5652,
			"text": "Narrated 'Ata bin Abi Rabah:Ibn `Abbas said to me, \"Shall I show you a woman of the people of Paradise?\" I said, \"Yes.\" He said, \"This black lady came to the Prophet (ﷺ) and said, 'I get attacks of epilepsy and my body becomes uncovered; please invoke Allah for me.' The Prophet (ﷺ) said (to her), 'If you wish, be patient and you will have (enter) Paradise; and if you wish, I will invoke Allah to cure you.' She said, 'I will remain patient,' and added, 'but I become uncovered, so please invoke Allah for me that I may not become uncovered.' So he invoked Allah for her.\" Narrated 'Ata: That he had seen Um Zafar, the tall black lady, at (holding) the curtain of the Ka`ba",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": 5653,
			"text": "Narrated Anas bin Malik:I heard Allah's Messenger (ﷺ) saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his eyes) and he remains patient, I will let him enter Paradise in compensation for them",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": 5654,
			"text": "Narrated `Aisha:When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal got a fever. I entered upon them and asked, \"O my father! How are you? O Bilal! How are you?\" Whenever fever attacked Abu Bakr, he would recite the following poetic verses: 'Everybody is staying alive among his people, yet death is nearer to him than his shoe laces.\" And whenever the fever deserted Bilal, he would recite (two poetic lines): 'Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling grass). Would that one day I would drink of the water of Majinna and would that Shama and Tafil (two mountains at Mecca) would appear to me.' Then I came and informed Allah's Messenger (ﷺ) about that, whereupon he said, \"O Allah! Make us love Medina as much or more than we love Mecca. O Allah! Make it healthy and bless its Mudd and Sa for us, and take away its fever and put it in Al Juhfa",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": 5655,
			"text": "Narrated Abu `Uthman:Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet (ﷺ) a daughter of the Prophet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet (ﷺ) sent her his greetings and added \"It is for Allah what He takes, and what He gives; and everything before His sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again sent a message, beseeching him by Allah, to come. So the Prophet (ﷺ) got up. and so did we (and went there). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of the Prophet. Sa`d said to him, \"What is this, O Allah's Messenger (ﷺ)?\" He said. \"This Is Mercy which Allah has embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His Mercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": 5656,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) went to visit a sick bedouin. Whenever the Prophet (ﷺ) went to a patient, he used to say to him, \"Don't worry, if Allah will, it will be expiation (for your sins):\" The bedouin said, \"You say expiation? No, it is but a fever that is boiling or harassing an old man and will lead him to his grave without his will.\" The Prophet (ﷺ) said, \"Then, yes, it is so",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": 5657,
			"text": "Narrated Anas:A Jewish boy used to serve the Prophet (ﷺ) and became ill. The Prophet (ﷺ) went to pay him a visit and said to him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his deathbed, the Prophet (ﷺ) visited him",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": 5658,
			"text": "Narrated `Aisha:During the ailment of the Prophet (ﷺ) some people came to visits him. He led them in prayer while sitting. but they prayed standing, so he waved to them to sit down. When he had finished the prayer, he said, \"An Imam is to be followed, so when he bows, you should bow. and when he raises his head, you should raise yours, and if he prays sitting. you should pray sitting.\" Abu `Abdullah said Al-Humaidi said, (The order of ) \"This narration has been abrogated by the last action of the Prophet (ﷺ) as he led the prayer sitting, while the people prayed standing behind him",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": 5659,
			"text": "Narrated Sa`d:I became seriously ill at Mecca and the Prophet (ﷺ) came to visit me. I said, \"O Allah's Messenger (ﷺ)! I shall leave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my property to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I bequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" He said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his forehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his emigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": 5660,
			"text": "Narrated `Abdullah bin Mas`ud:I visited Allah's Messenger (ﷺ) while he was suffering from a high fever. I touched him with my hand and said, \"O Allah's Messenger (ﷺ)! You have a high fever.\" Allah's Messenger (ﷺ) said, \"Yes, I have as much fever as two men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Messenger (ﷺ) said, \"Yes, no Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will remove his sins for him as a tree sheds its leaves",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": 5661,
			"text": "Narrated `Abdullah:I visited the Prophet (ﷺ) during his illness and touched him while he was having a fever. I said to him, \"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is afflicted with any harm, but that his sins will be annulled as the leave of a tree fall down",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": 5662,
			"text": "Narrated Ibn `Abbas:Allah's Messenger (ﷺ) entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, (your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling within an old man and will send him to his grave.\" On that, the Prophet (ﷺ) said, \"Then yes, it is so",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "Narrated Usama bin Zaid:The Prophet (ﷺ) rode a donkey having a saddle with a Fadakiyya velvet covering. He mounted me behind him and went to visit Sa`d bin 'Ubada, and that had been before the battle of Badr. The Prophet (ﷺ) proceeded till he passed by a gathering in which `Abdullah bin Ubai bin Salul was present, and that had been before `Abdullah embraced Islam. The gathering comprised of Muslims, polytheists, i.e., isolators and Jews. `Abdullah bin Rawaha was also present in that gathering. When dust raised by the donkey covered the gathering, `Abdullah bin Ubai covered his nose with his upper garment and said, \"Do not trouble us with dust.\" The Prophet (ﷺ) greeted them, stopped and dismounted. Then he invited them to Allah (i.e., to embrace Islam) and recited to them some verses of the Holy Qur'an. On that, `Abdullah bin Ubai said, \"O man ! There is nothing better than what you say if it is true. Do not trouble us with it in our gathering, but return to your house, and if somebody comes to you, teach him there.\" On that `Abdullah bin Rawaha said, Yes, O Allah's Messenger (ﷺ)! Bring your teachings to our gathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing each other till they were about to fight. The Prophet (ﷺ) kept on quietening them till they became calm. Thereupon the Prophet mounted his animal and proceeded till he entered upon Sa`d bin Ubada. He said to him \"O Sa`d! Have you not heard what Abu Hubab (i.e., `Abdullah bin Ubai) said?\" Sa`d said, 'O Allah's Apostle! Excuse and forgive him, for Allah has given you what He has given you. The people of this town (Medina decided unanimously to crown him and make him their chief by placing a turban on his head, but when that was prevented by the Truth which Allah had given you he (`Abdullah bin Ubai) was grieved out of jealously, and that was the reason which caused him to behave in the way you have seen",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": 5664,
			"text": "Narrated Jabir:The Prophet (ﷺ) came to visit me (while I was sick) and he was riding neither a mule, nor a horse",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": 5665,
			"text": "Narrated Ka`b bin 'Ujara:The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of your head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make expiation for that",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": 5666,
			"text": "Narrated Al-Qasim bin Muhammad:`Aisha, (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had happened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah for you.\" Aisha said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, you would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I should say, 'Oh my head!' I felt like sending for Abu Bakr and his son, and appoint him as my successor lest some people claimed something or some others wished something, but then I said (to myself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": 5667,
			"text": "Narrated Ibn Mas`ud:I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high fever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double reward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other inconvenience, but that Allah will remove his sins as a tree sheds its leaves",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": 5668,
			"text": "Narrated Sa`d:Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- Wada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only daughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better than to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall get a reward for it, even for what you put in the mouth of your wife",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5669,
			"arabicnumber": 5669,
			"text": "Narrated Ibn `Abbas:When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom was `Umar bin Al-Khattab, the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you will not go astray.\" `Umar said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of Allah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near so that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others said as `Umar said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go away!\" Narrated 'Ubaidullah: Ibn `Abbas used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) was prevented from writing that statement for them because of their disagreement and noise",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5670,
			"arabicnumber": 5670,
			"text": "Narrated As-Sa'ib:My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": 5671,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he has to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let me die if death is better for me",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": 5672,
			"text": "Narrated Qais bin Abi Hazim:We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven places in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this world) without having their rewards reduced through enjoying the pleasures of this life, but we have got (so much) wealth that we find no way to spend It except on the construction of buildings Had the Prophet not forbidden us to wish for death, I would have wished for it.' We visited him for the second time while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he spends except for something that he spends on building",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": 5673,
			"text": "Narrated Abu Huraira:I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" (i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not even you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy on me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none of you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an evil doer, he may repent to Allah",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": 5674,
			"text": "Narrated `Aisha:I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your Mercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": 5675,
			"text": "Narrated `Aisha:Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke Allah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who cures. There is no cure but Yours, a cure that leaves no disease",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": 5676,
			"text": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me (or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or father to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": 5677,
			"text": "Narrated `Aisha:When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr and Bilal had a fever. I entered upon them and said, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr got the fever he used to say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" And when fever deserted Bilal, he would recite (two poetic verses): \"Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling grass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil (two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about that. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it healthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No 558)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 37
			}
		}
	]
}