{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6772,
			"arabicnumber": 6772,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time he is doing it; and when somebody drinks an alcoholic drink, then he is not believer at the time of drinking, and when a thief steals, he is not a believer at the time when he is stealing; and when a robber robs and the people look at him, then he is not a believer at the time of doing it.\" Abu Huraira in another narration, narrated the same from the Prophet (ﷺ) with the exclusion of robbery",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": 6773,
			"text": "Narrated Anas bin Malik:The Prophet (ﷺ) beat a drunk with palm-leaf stalks and shoes. And Abu Bakr gave (such a sinner) forty lashes",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": 6774,
			"text": "Narrated `Uqba bin Al-Harith:An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) on a charge of drunkenness. So the Prophet ordered all the men present in the house, to beat him. So all of them beat him, and I was also one of them who beat him with shoes",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6775,
			"arabicnumber": 6775,
			"text": "Narrated' `Uqba bin Al-Harith:An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) in a state of intoxication. The Prophet felt it hard (was angry) and ordered all those who were present in the house, to beat him. And they beat him, using palm-leaf stalks and shoes, and I was among those who beat him",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": 6776,
			"text": "Narrated Anas:The Prophet (ﷺ) lashed a drunk with dateleaf stalks and shoes. And Abu Bakr gave a drunk forty lashes",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": 6777,
			"text": "Narrated Abu Salama:Abu Huraira said, \"A man who drank wine was brought to the Prophet. The Prophet (ﷺ) said, 'Beat him!\" Abu Huraira added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet (ﷺ) said, 'Do not say so, for you are helping Satan to overpower him",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": 6778,
			"text": "Narrated `Ali bin Abi Talib:I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Messenger (ﷺ) for the drunk",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": 6779,
			"text": "Narrated As-Sa'ib bin Yazid:We used to strike the drunks with our hands, shoes, clothes (by twisting it into the shape of lashes) during the lifetime of the Prophet, Abu Bakr and the early part of `Umar's caliphate. But during the last period of `Umar's caliphate, he used to give the drunk forty lashes; and when drunks became mischievous and disobedient, he used to scourge them eighty lashes",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": 6780,
			"text": "Narrated `Umar bin Al-Khattab:During the lifetime of the Prophet (ﷺ) there was a man called `Abdullah whose nickname was Donkey, and he used to make Allah's Messenger (ﷺ) laugh. The Prophet (ﷺ) lashed him because of drinking (alcohol). And one-day he was brought to the Prophet (ﷺ) on the same charge and was lashed. On that, a man among the people said, \"O Allah, curse him ! How frequently he has been brought (to the Prophet (ﷺ) on such a charge)!\" The Prophet (ﷺ) said, \"Do not curse him, for by Allah, I know for he loves Allah and His Apostle",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": 6781,
			"text": "Narrated Abu Huraira:A drunk was brought to the Prophet (ﷺ) and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Messenger (ﷺ) said, \"Do not help Satan against your (Muslim) brother",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": 6782,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"When (a person) an adulterer commits illegal sexual intercourse then he is not a believer at the time he is doing it; and when somebody steals, then he is not a believer at the time he is stealing",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": 6783,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and gets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and they used to think that the rope may cost a few dirhams",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": 6784,
			"text": "Narrated 'Ubada bin As-Samit:We were with the Prophet (ﷺ) in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet (ﷺ) added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": 6785,
			"text": "Narrated `Abdullah:Allah Apostle said in Hajjat-al-Wada`, \"Which month (of the year) do you think is most sacred?\" The people said, \"This current month of ours (the month of Dhull-Hijja).\" He said, \"Which town (country) do you think is the most sacred?\" They said, \"This city of ours (Mecca).\" He said, \"Which day do you think is the most sacred?\" The people said, \"This day of ours.\" He then said, \"Allah, the Blessed, the Supreme, has made your blood, your property and your honor as sacred as this day of yours in this town of yours, in this month of yours (and such protection cannot be slighted) except rightfully.\" He then said thrice, \"Have I conveyed Allah's Message (to you)?\" The people answered him each time saying, 'Yes.\" The Prophet (ﷺ) added, 'May Allah be merciful to you (or, woe on you)! Do not revert to disbelief after me by cutting the necks of each other",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": 6786,
			"text": "Narrated Aisha:Whenever the Prophet (ﷺ) was given an option between two things, he used to select the easier of the tow as long as it was not sinful; but if it was sinful, he would remain far from it. By Allah, he never took revenge for himself concerning any matter that was presented to him, but when Allah's Limits were transgressed, he would take revenge for Allah's Sake",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": 6787,
			"text": "Narrated `Aisha:Usama approached the Prophet (ﷺ) on behalf of a woman (who had committed theft). The Prophet (ﷺ) said, \"The people before you were destroyed because they used to inflict the legal punishments on the poor and forgive the rich. By Him in Whose Hand my soul is! If Fatima (the daughter of the Prophet (ﷺ) ) did that (i.e. stole), I would cut off her hand",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": 6788,
			"text": "Narrated `Aisha:The Quraish people became very worried about the Makhzumiya lady who had committed theft. They said, \"Nobody can speak (in favor of the lady) to Allah's Messenger (ﷺ) and nobody dares do that except Usama who is the favorite of Allah's Messenger (ﷺ). \" When Usama spoke to Allah's Messenger (ﷺ) about that matter, Allah's Messenger (ﷺ) said, \"Do you intercede (with me) to violate one of the legal punishment of Allah?\" Then he got up and addressed the people, saying, \"O people! The nations before you went astray because if a noble person committed theft, they used to leave him, but if a weak person among them committed theft, they used to inflict the legal punishment on him. By Allah, if Fatima, the daughter of Muhammad committed theft, Muhammad will cut off her hand",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": 6789,
			"text": "Narrated `Aisha:The Prophet (ﷺ) said, \"The hand should be cut off for stealing something that is worth a quarter of a Dinar or more",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": 6790,
			"text": "Narrated `Aisha:The Prophet (ﷺ) said, \"The hand of a thief should be cut off for stealing a quarter of a Dinar",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": 6791,
			"text": "Narrated `Aisha:The Prophet (ﷺ) said, \"The hand should be cut off for stealing a quarter of a Dinar",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6792,
			"arabicnumber": 6792,
			"text": "Narrated `Aisha:The hand of a thief was not cut off during the lifetime of the Prophet (ﷺ) except for stealing something equal to a shield in value. A similar hadith is narrated from `Aisha through another chain",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": 6793,
			"text": "Narrated `Aisha:A thief's hand was not cut off for stealing something cheaper than a Hajafa or a Turs (two kinds of shields), each of which was worth a (respectable) price",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": 6794,
			"text": "Narrated `Aisha:A thief's hand was not cut off for stealing something worth less than the price of a shield, whether a Turs or Hajafa (two kinds of shields), each of which was worth a (respectable) price",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": 6795,
			"text": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": 6796,
			"text": "Narrated Ibn `Umar:The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": 6797,
			"text": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": 6798,
			"text": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) cutoff the hand of a thief for stealing a shield that was worth three Dirhams",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": 6799,
			"text": "Narrated Abu Huraira:Allah 's Apostle said, \"Allah curses the thief who steals an egg (or a helmet) for which his hand is to be cut off, or steals a rope, for which his hand is to be cut off",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": 6800,
			"text": "Narrated `Aisha:The Prophet (ﷺ) cut off the hand of a lady, and that lady used to come to me, and I used to convey her message to the Prophet (ﷺ) and she repented, and her repentance was sincere",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": 6801,
			"text": "Narrated Ubada bin As-Samit:I gave the pledge of allegiance to the Prophet (ﷺ) with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": 6802,
			"text": "Narrated Anas:Some people from the tribe of `Ukl came to the Prophet (ﷺ) and embraced Islam. The climate of Medina did not suit them, so the Prophet (ﷺ) ordered them to go to the (herd of milch) camels of charity and to drink, their milk and urine (as a medicine). They did so, and after they had recovered from their ailment (became healthy) they turned renegades (reverted from Islam) and killed the shepherd of the camels and took the camels away. The Prophet (ﷺ) sent (some people) in their pursuit and so they were (caught and) brought, and the Prophets ordered that their hands and legs should be cut off and that their eyes should be branded with heated pieces of iron, and that their cut hands and legs should not be cauterized, till they die",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": 6803,
			"text": "Narrated Anas:The Prophet (ﷺ) cut off the hands and feet of the men belonging to the tribe of `Uraina and did not cauterise (their bleeding limbs) till they died",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": 6804,
			"text": "Narrated Anas:A group of people from `Ukl (tribe) came to the Prophet (ﷺ) and they were living with the people of As- Suffa, but they became ill as the climate of Medina did not suit them, so they said, \"O Allah's Messenger (ﷺ)! Provide us with milk.\" The Prophet (ﷺ) said, I see no other way for you than to use the camels of Allah's Apostle.\" So they went and drank the milk and urine of the camels, (as medicine) and became healthy and fat. Then they killed the shepherd and took the camels away. When a help-seeker came to Allah's Apostle, he sent some men in their pursuit, and they were captured and brought before mid day. The Prophet ordered for some iron pieces to be made red hot, and their eyes were branded with them and their hands and feet were cut off and were not cauterized. Then they were put at a place called Al- Harra, and when they asked for water to drink they were not given till they died. (Abu Qilaba said, \"Those people committed theft and murder and fought against Allah and His Apostle)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6805,
			"arabicnumber": 6805,
			"text": "Narrated Anas bin Malik:A group of people from `Ukl (or `Uraina) tribe ----but I think he said that they were from `Ukl came to Medina and (they became ill, so) the Prophet (ﷺ) ordered them to go to the herd of (Milch) she-camels and told them to go out and drink the camels' urine and milk (as a medicine). So they went and drank it, and when they became healthy, they killed the shepherd and drove away the camels. This news reached the Prophet (ﷺ) early in the morning, so he sent (some) men in their pursuit and they were captured and brought to the Prophet (ﷺ) before midday. He ordered to cut off their hands and legs and their eyes to be branded with heated iron pieces and they were thrown at Al-Harra, and when they asked for water to drink, they were not given water. (Abu Qilaba said, \"Those were the people who committed theft and murder and reverted to disbelief after being believers (Muslims), and fought against Allah and His Apostle",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": 6806,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Seven (people) will be shaded by Allah by His Shade on the Day of Resurrection when there will be no shade except His Shade. (They will be), a just ruler, a young man who has been brought up in the worship of Allah, a man who remembers Allah in seclusion and his eyes are then flooded with tears, a man whose heart is attached to mosques (offers his compulsory congregational prayers in the mosque), two men who love each other for Allah's Sake, a man who is called by a charming lady of noble birth to commit illegal sexual intercourse with her, and he says, 'I am afraid of Allah,' and (finally), a man who gives in charity so secretly that his left hand does not know what his right hand has given",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": 6807,
			"text": "Narrated Sahl bin Sa`d:The Prophet (ﷺ) said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": 6808,
			"text": "Narrated Anas: I will narrate to you a narration which nobody will narrate to you after me. I heard that from the Prophet. I heard the Prophet (ﷺ) saying, \"The Hour will not be established\" or said: \"From among the portents of the Hour is that the religious knowledge will betaken away (by the death of religious Scholars) and general ignorance (of religion) will appear; and the drinking of alcoholic drinks will be very common, and (open) illegal sexual intercourse will prevail, and men will decrease in number while women will increase so much so that, for fifty women there will only be one man to look after them",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": 6809,
			"text": "Narrated 'Ikrima from Ibn 'Abbas: Allah's Messenger (ﷺ)s said, \"When a slave (of Allah) commits illegal sexual intercourse, he is not a believer at the time of committing it; and if he steals, he is not a believer at the time of stealing; and if he drinks an alcoholic drink, when he is not a believer at the time of drinking it; and he is not a believer when he commits a murder,\" 'Ikrima said: I asked Ibn Abbas, \"How is faith taken away from him?\" He said, Like this,\" by clasping his hands and then separating them, and added, \"But if he repents, faith returns to him like this, by clasping his hands again",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": 6810,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The one who commits an illegal sexual intercourse is not a believer at the time of committing illegal sexual intercourse and a thief is not a believer at the time of committing theft and a drinker of alcoholic drink is not a believer at the time of drinking. Yet, (the gate of) repentance is open thereafter",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": 6811,
			"text": "Narrated `Abdullah bin Mas`ud:I said, \"O Allah's Messenger (ﷺ)! Which is the biggest sin?\" He said, \"To set up rivals to Allah by worshipping others though He alone has created you.\" I asked, \"What is next?\" He said, \"To kill your child lest it should share your food.\" I asked, \"What is next?\" He said, \"To commit illegal sexual intercourse with the wife of your neighbor",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": 6812,
			"text": "Narrated Ash-Shu`bi:from `Ali when the latter stoned a lady to death on a Friday. `Ali said, \"I have stoned her according to the tradition of Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": 6813,
			"text": "Narrated Ash Shaibani:I asked `Abdullah bin Abi `Aufa, 'Did Allah's Messenger (ﷺ) carry out the Rajam penalty ( i.e., stoning to death)?' He said, \"Yes.\" I said, \"Before the revelation of Surat-an-Nur or after it?\" He replied, \"I don't Know",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": 6814,
			"text": "Narrated Jabir bin `Abdullah Al-Ansari:A man from the tribe of Bani Aslam came to Allah's Messenger (ﷺ) and Informed him that he had committed illegal sexual intercourse and bore witness four times against himself. Allah's Messenger (ﷺ) ordered him to be stoned to death as he was a married Person",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": 6816,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": 6817,
			"text": "Narrated `Aisha:Sa`d bin Abi Waqqas and `Abd bin Zam`a quarrelled with each other (regarding a child). The Prophet (ﷺ) said, \"The boy is for you, O `Abd bin Zam`a, for the boy is for (the owner) of the bed. O Sauda ! Screen yourself from the boy.\" The sub-narrator, Al-Laith added (that the Prophet (ﷺ) also said), \"And the stone is for the person who commits an illegal sexual intercourse",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": 6818,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The boy is for (the owner of) the bed and the stone is for the person who commits illegal sexual intercourse",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": 6819,
			"text": "Narrated Ibn `Umar:A Jew and a Jewess were brought to Allah's Messenger (ﷺ) on a charge of committing an illegal sexual intercourse. The Prophet (ﷺ) asked them. \"What is the legal punishment (for this sin) in your Book (Torah)?\" They replied, \"Our priests have innovated the punishment of blackening the faces with charcoal and Tajbiya.\" `Abdullah bin Salam said, \"O Allah's Messenger (ﷺ), tell them to bring the Torah.\" The Torah was brought, and then one of the Jews put his hand over the Divine Verse of the Rajam (stoning to death) and started reading what preceded and what followed it. On that, Ibn Salam said to the Jew, \"Lift up your hand.\" Behold! The Divine Verse of the Rajam was under his hand. So Allah's Apostle ordered that the two (sinners) be stoned to death, and so they were stoned. Ibn `Umar added: So both of them were stoned at the Balat and I saw the Jew sheltering the Jewess",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": 6820,
			"text": "Narrated Jabir:A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed that he had committed an illegal sexual intercourse. The Prophet (ﷺ) turned his face away from him till the man bore witness against himself four times. The Prophet (ﷺ) said to him, \"Are you mad?\" He said \"No.\" He said, \"Are you married?\" He said, \"Yes.\" Then the Prophet (ﷺ) ordered that he be stoned to death, and he was stoned to death at the Musalla. When the stones troubled him, he fled, but he was caught and was stoned till he died. The Prophet (ﷺ) spoke well of him and offered his funeral prayer",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": 6821,
			"text": "Narrated Abu Huraira: A person had sexual relation with his wife in the month of Ramadan (while he was fasting), and he came to Allah's Messenger (ﷺ) seeking his verdict concerning that action. The Prophet (ﷺ) said (to him), \"Can you afford to manumit a slave?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": 6822,
			"text": "Narrated 'Aisha: A man came to the Prophet (ﷺ) in the mosque and said, \"I am burnt (ruined)!\" The Prophet (ﷺ) asked him, \"With what (what have you done)?\" He said, \"I have had sexual relation with my wife in the month of Ramadan (while fasting).\" The Prophet (ﷺ) said to him, \"Give in charity.\" He said, \"I have nothing.\" The man sat down, and in the meantime there came a person driving a donkey carrying food to the Prophet (ﷺ) ..... (The sub-narrator, 'Abdur Rahman added: I do not know what kind of food it was). On that the Prophet (ﷺ) said, \"Where is the burnt person?\" The man said, \"Here I am.\" The Prophet (ﷺ) said to him, \"Take this (food) and give it in charity (to someone).\" The man said, \"To a poorer person than l? My family has nothing to eat.\" Then the Prophet (ﷺ) said to him, \"Then eat it yourselves",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": 6823,
			"text": "Narrated Anas bin Malik:While I was with the Prophet (ﷺ) a man came and said, \"O Allah's Messenger (ﷺ)! I have committed a legally punishable sin; please inflict the legal punishment on me'.' The Prophet (ﷺ) did not ask him what he had done. Then the time for the prayer became due and the man offered prayer along with the Prophet (ﷺ) , and when the Prophet (ﷺ) had finished his prayer, the man again got up and said, \"O Allah's Messenger (ﷺ)! I have committed a legally punishable sin; please inflict the punishment on me according to Allah's Laws.\" The Prophet (ﷺ) said, \"Haven't you prayed with us?' He said, \"Yes.\" The Prophet (ﷺ) said, \"Allah has forgiven your sin.\" or said, \"....your legally punishable sin",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": 6824,
			"text": "Narrated Ibn `Abbas:When Ma'iz bin Malik came to the Prophet (in order to confess), the Prophet (ﷺ) said to him, \"Probably you have only kissed (the lady), or winked, or looked at her?\" He said, \"No, O Allah's Messenger (ﷺ)!\" The Prophet said, using no euphemism, \"Did you have sexual intercourse with her?\" The narrator added: At that, (i.e. after his confession) the Prophet (ﷺ) ordered that he be stoned (to death)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": 6825,
			"text": "Narrated Abu Huraira:A man from among the people, came to Allah's Messenger (ﷺ) while Allah's Messenger (ﷺ) was sitting in the mosque, and addressed him, saying, \"O Allah's Messenger (ﷺ)! I have committed an illegal sexual intercourse.\" The Prophet (ﷺ) turned his face away from him. The man came to that side to which the Prophet had turned his face, and said, \"O Allah's Messenger (ﷺ)! I have committed an illegal intercourse.\" The Prophet (ﷺ) turned his face to the other side, and the man came to that side, and when he confessed four times, the Prophet (ﷺ) called him and said, \"Are you mad?\" He said, \"No, O Allah's Messenger (ﷺ)!\" The Prophet said, \"Are you married?\" He said, \"Yes, O Allah's Messenger (ﷺ).\" The Prophet (ﷺ) said (to the people), \"Take him away and stone him to death.\" Ibn Shihab added, \"I was told by one who heard Jabir, that Jabir said, 'I was among those who stoned the man, and we stoned him at the Musalla (`Id praying Place), and when the stones troubled him, he jumped quickly and ran away, but we overtook him at Al-Harra and stoned him to death (there)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": 6828,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": 6829,
			"text": "Narrated Ibn `Abbas:`Umar said, \"I am afraid that after a long time has passed, people may say, \"We do not find the Verses of the Rajam (stoning to death) in the Holy Book,\" and consequently they may go astray by leaving an obligation that Allah has revealed. Lo! I confirm that the penalty of Rajam be inflicted on him who commits illegal sexual intercourse, if he is already married and the crime is proved by witnesses or pregnancy or confession.\" Sufyan added, \"I have memorized this narration in this way.\" `Umar added, \"Surely Allah's Messenger (ﷺ) carried out the penalty of Rajam, and so did we after him",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": 6830,
			"text": "Narrated Ibn `Abbas:I used to teach (the Qur'an to) some people of the Muhajirln (emigrants), among whom there was `Abdur Rahman bin `Auf. While I was in his house at Mina, and he was with `Umar bin Al-Khattab during `Umar's last Hajj, `Abdur-Rahman came to me and said, \"Would that you had seen the man who came today to the Chief of the Believers (`Umar), saying, 'O Chief of the Believers! What do you think about so-and-so who says, 'If `Umar should die, I will give the pledge of allegiance to such-andsuch person, as by Allah, the pledge of allegiance to Abu Bakr was nothing but a prompt sudden action which got established afterwards.' `Umar became angry and then said, 'Allah willing, I will stand before the people tonight and warn them against those people who want to deprive the others of their rights (the question of rulership). `Abdur-Rahman said, \"I said, 'O Chief of the believers! Do not do that, for the season of Hajj gathers the riff-raff and the rubble, and it will be they who will gather around you when you stand to address the people. And I am afraid that you will get up and say something, and some people will spread your statement and may not say what you have actually said and may not understand its meaning, and may interpret it incorrectly, so you should wait till you reach Medina, as it is the place of emigration and the place of Prophet's Traditions, and there you can come in touch with the learned and noble people, and tell them your ideas with confidence; and the learned people will understand your statement and put it in its proper place.' On that, `Umar said, 'By Allah! Allah willing, I will do this in the first speech I will deliver before the people in Medina.\" Ibn `Abbas added: We reached Medina by the end of the month of Dhul-Hijja, and when it was Friday, we went quickly (to the mosque) as soon as the sun had declined, and I saw Sa`id bin Zaid bin `Amr bin Nufail sitting at the corner of the pulpit, and I too sat close to him so that my knee was touching his knee, and after a short while `Umar bin Al-Khattab came out, and when I saw him coming towards us, I said to Sa`id bin Zaid bin `Amr bin Nufail \"Today `Umar will say such a thing as he has never said since he was chosen as Caliph.\" Sa`id denied my statement with astonishment and said, \"What thing do you expect `Umar to say the like of which he has never said before?\" In the meantime, `Umar sat on the pulpit and when the callmakers for the prayer had finished their call, `Umar stood up, and having glorified and praised Allah as He deserved, he said, \"Now then, I am going to tell you something which (Allah) has written for me to say. I do not know; perhaps it portends my death, so whoever understands and remembers it, must narrate it to the others wherever his mount takes him, but if somebody is afraid that he does not understand it, then it is unlawful for him to tell lies about me. Allah sent Muhammad with the Truth and revealed the Holy Book to him, and among what Allah revealed, was the Verse of the Rajam (the stoning of married person (male & female) who commits illegal sexual intercourse, and we did recite this Verse and understood and memorized it. Allah's Messenger (ﷺ) did carry out the punishment of stoning and so did we after him. I am afraid that after a long time has passed, somebody will say, 'By Allah, we do not find the Verse of the Rajam in Allah's Book,' and thus they will go astray by leaving an obligation which Allah has revealed. And the punishment of the Rajam is to be inflicted to any married person (male & female), who commits illegal sexual intercourse, if the required evidence is available or there is conception or confession. And then we used to recite among the Verses in Allah's Book: 'O people! Do not claim to be the offspring of other than your fathers, as it is disbelief (unthankfulness) on your part that you claim to be the offspring of other than your real father.' Then Allah's Messenger (ﷺ) said, 'Do not praise me excessively as Jesus, son of Marry was praised, but call me Allah's Slave and His Apostles.' (O people!) I have been informed that a speaker amongst you says, 'By Allah, if `Umar should die, I will give the pledge of allegiance to such-and-such person.' One should not deceive oneself by saying that the pledge of allegiance given to Abu Bakr was given suddenly and it was successful. No doubt, it was like that, but Allah saved (the people) from its evil, and there is none among you who has the qualities of Abu Bakr. Remember that whoever gives the pledge of allegiance to anybody among you without consulting the other Muslims, neither that person, nor the person to whom the pledge of allegiance was given, are to be supported, lest they both should be killed. And no doubt after the death of the Prophet (ﷺ) we were informed that the Ansar disagreed with us and gathered in the shed of Bani Sa`da. `Ali and Zubair and whoever was with them, opposed us, while the emigrants gathered with Abu Bakr. I said to Abu Bakr, 'Let's go to these Ansari brothers of ours.' So we set out seeking them, and when we approached them, two pious men of theirs met us and informed us of the final decision of the Ansar, and said, 'O group of Muhajirin (emigrants) ! Where are you going?' We replied, 'We are going to these Ansari brothers of ours.' They said to us, 'You shouldn't go near them. Carry out whatever we have already decided.' I said, 'By Allah, we will go to them.' And so we proceeded until we reached them at the shed of Bani Sa`da. Behold! There was a man sitting amongst them and wrapped in something. I asked, 'Who is that man?' They said, 'He is Sa`d bin 'Ubada.' I asked, 'What is wrong with him?' They said, 'He is sick.' After we sat for a while, the Ansar's speaker said, 'None has the right to be worshipped but Allah,' and praising Allah as He deserved, he added, 'To proceed, we are Allah's Ansar (helpers) and the majority of the Muslim army, while you, the emigrants, are a small group and some people among you came with the intention of preventing us from practicing this matter (of caliphate) and depriving us of it.' When the speaker had finished, I intended to speak as I had prepared a speech which I liked and which I wanted to deliver in the presence of Abu Bakr, and I used to avoid provoking him. So, when I wanted to speak, Abu Bakr said, 'Wait a while.' I disliked to make him angry. So Abu Bakr himself gave a speech, and he was wiser and more patient than I. By Allah, he never missed a sentence that I liked in my own prepared speech, but he said the like of it or better than it spontaneously. After a pause he said, 'O Ansar! You deserve all (the qualities that you have attributed to yourselves, but this question (of Caliphate) is only for the Quraish as they are the best of the Arabs as regards descent and home, and I am pleased to suggest that you choose either of these two men, so take the oath of allegiance to either of them as you wish. And then Abu Bakr held my hand and Abu Ubaida bin al-Jarrah's hand who was sitting amongst us. I hated nothing of what he had said except that proposal, for by Allah, I would rather have my neck chopped off as expiator for a sin than become the ruler of a nation, one of whose members is Abu Bakr, unless at the time of my death my own-self suggests something I don't feel at present.' And then one of the Ansar said, 'I am the pillar on which the camel with a skin disease (eczema) rubs itself to satisfy the itching (i.e., I am a noble), and I am as a high class palm tree! O Quraish. There should be one ruler from us and one from you.' Then there was a hue and cry among the gathering and their voices rose so that I was afraid there might be great disagreement, so I said, 'O Abu Bakr! Hold your hand out.' He held his hand out and I pledged allegiance to him, and then all the emigrants gave the Pledge of allegiance and so did the Ansar afterwards. And so we became victorious over Sa`d bin Ubada (whom Al-Ansar wanted to make a ruler). One of the Ansar said, 'You have killed Sa`d bin Ubada.' I replied, 'Allah has killed Sa`d bin Ubada.' `Umar added, \"By Allah, apart from the great tragedy that had happened to us (i.e. the death of the Prophet), there was no greater problem than the allegiance pledged to Abu Bakr because we were afraid that if we left the people, they might give the Pledge of allegiance after us to one of their men, in which case we would have given them our consent for something against our real wish, or would have opposed them and caused great trouble. So if any person gives the Pledge of allegiance to somebody (to become a Caliph) without consulting the other Muslims, then the one he has selected should not be granted allegiance, lest both of them should be killed",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": 6832,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": 6833,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) judged that the unmarried person who was guilty of illegal sexual intercourse be exiled for one year and receive the legal punishment (i.e., be flogged with one-hundred stripes)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": 6834,
			"text": "Narrated Ibn `Abbas:The Prophet (ﷺ) cursed the effeminate men and those women who assume the similitude (manners) of men. He also said, \"Turn them out of your houses.\" He turned such-and-such person out, and `Umar also turned out such-and-such person",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": 6836,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": 6838,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": 6839,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"If a lady slave commits illegal sexual intercourse and she is proved guilty of illegal sexual intercourse, then she should be flogged (fifty stripes) but she should not be admonished; and if she commits illegal sexual intercourse again, then she should be flogged again but should not be admonished; and if she commits illegal sexual intercourse for the third time, then she should be sold even for a hair rope",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": 6840,
			"text": "Narrated Ash-Shaibani:I asked `Abdullah bin Abi `Aufa about the Rajam (stoning somebody to death for committing illegal sexual intercourse). He replied, \"The Prophet (ﷺ) carried out the penalty of Rajam,\" I asked, \"Was that before or after the revelation of Surat-an-Nur?\" He replied, \"I do not know",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": 6841,
			"text": "Narrated `Abdullah bin `Umar:The jews came to Allah's Messenger (ﷺ) and mentioned to him that a man and a lady among them had committed illegal sexual intercourse. Allah's Messenger (ﷺ) said to them, \"What do you find in the Torah regarding the Rajam?\" They replied, \"We only disgrace and flog them with stripes.\" `Abdullah bin Salam said to them, 'You have told a lie the penalty of Rajam is in the Torah.' They brought the Torah and opened it. One of them put his hand over the verse of the Rajam and read what was before and after it. `Abdullah bin Salam said to him, \"Lift up your hand.\" Where he lifted it there appeared the verse of the Rajam. So they said, \"O Muhammad! He has said the truth, the verse of the Rajam is in it (Torah).\" Then Allah's Messenger (ﷺ) ordered that the two persons (guilty of illegal sexual intercourse) be stoned to death, and so they were stoned, and I saw the man bending over the woman so as to protect her from the stones",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": 6843,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6844,
			"arabicnumber": 6844,
			"text": "Narrated `Aisha:Abu Bakr came to me while Allah's Messenger (ﷺ) was sleeping with his head on my thigh. Abu Bakr said (to me), \"You have detained Allah's Messenger (ﷺ) and the people, and there is no water in this place.\" So he admonished me and struck my flanks with his hand, and nothing could stop me from moving except the reclining of Allah's Messenger (ﷺ) (on my thigh), and then Allah revealed the Divine Verse of Tayammum",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6845,
			"arabicnumber": 6845,
			"text": "Narrated Aisha:Abu Bakr came to towards me and struck me violently with his fist and said, \"You have detained the people because of your necklace.\" But I remained motionless as if I was dead lest I should awake Allah's Messenger (ﷺ) although that hit was very painful",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": 6846,
			"text": "Narrated Al-Mughira:Sa`d bin Ubada said, \"If I found a man with my wife, I would kill him with the sharp side of my sword.\" When the Prophet (ﷺ) heard that he said, \"Do you wonder at Sa`d's sense of ghira (self-respect)? Verily, I have more sense of ghira than Sa`d, and Allah has more sense of ghira than I",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": 6847,
			"text": "Narrated Abu Huraira:A bedouin came to Allah's Messenger (ﷺ) and said, \"My wife has delivered a black child.\" The Prophet (ﷺ) said to him, \"Have you camels?\" He replied, \"Yes.\" The Prophet (ﷺ) said, \"What color are they?\" He replied, \"They are red.\" The Prophet (ﷺ) further asked, \"Are any of them gray in color?\" He replied, \"Yes.\" The Prophet asked him, \"Whence did that grayness come?\" He said, \"I thing it descended from the camel's ancestors.\" Then the Prophet (ﷺ) said (to him), \"Therefore, this child of yours has most probably inherited the color from his ancestors",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": 6848,
			"text": "Narrated Abu Burda:The Prophet (ﷺ) used to say, \"Nobody should be flogged more than ten stripes except if he is guilty of a crime, the legal punishment of which is assigned by Allah",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": 6849,
			"text": "Narrated `Abdur-Rahman bin Jabir:On the authority of others, that the Prophet (ﷺ) said, \"No Punishment exceeds the flogging of the ten stripes, except if one is guilty of a crime necessitating a legal punishment prescribed by Allah",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": 6850,
			"text": "Narrated Abu Burda Al-Ansari:I heard the Prophet (ﷺ) saying, \"Do not flog anyone more than ten stripes except if he is involved in a crime necessitating Allah's legal Punishment",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": 6851,
			"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) forbade Al-Wisal (fasting continuously for more than one day without taking any meals). A man from the Muslims said, \"But you do Al-Wisal, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) I said, \"Who among you is similar to me? I sleep and my Lord makes me eat and drink.\" When the people refused to give up Al-Wisal, the Prophet (ﷺ) fasted along with them for one day, and did not break his fast but continued his fast for another day, and when they saw the crescent, the Prophet (ﷺ) said, \"If the crescent had not appeared, I would have made you continue your fast (for a third day),\" as if he wanted to punish them for they had refused to give up Al-Wisal",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": 6852,
			"text": "Narrated `Abdullah bin `Umar:Those people who used to buy foodstuff at random (without weighing or measuring it) were beaten in the lifetime of Allah's Messenger (ﷺ) if they sold it at the very place where they had bought it, till they carried it to their dwelling places",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": 6853,
			"text": "Narrated `Aisha:Allah's Messenger (ﷺ) never took revenge for his own self in any matter presented to him till Allah's limits were exceeded, in which case he would take revenge for Allah's sake",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": 6854,
			"text": "Narrated Sahl bin Sa`d:I witnessed the case of Lian (the case of a man who charged his wife for committing illegal sexual intercourse when I was fifteen years old. The Prophet (ﷺ) ordered that they be divorced, and the husband said, \"If I kept her, I would be a liar.\" I remember that Az-Zubair also said, \"(It was said) that if that woman brought forth the child with such-and-such description, her husband would prove truthful, but if she brought it with such-and-such description looking like a Wahra (a red insect), he would prove untruthful.\" I heard Az-Zubair also saying, \"Finally she gave birth to a child of description which her husband disliked",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6855,
			"arabicnumber": 6855,
			"text": "Narrated Al-Qasim bin Muhammad:Ibn `Abbas mentioned the couple who had taken the oath of Lian. `Abdullah bin Shaddad said (to him), \"Was this woman about whom Allah's Messenger (ﷺ) said, 'If I were ever to stone to death any woman without witnesses. (I would have stoned that woman to death)?' Ibn `Abbas replied,\" No, that lady exposed herself (by her suspicious behavior)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6856,
			"arabicnumber": 6856,
			"text": "Narrated Ibn `Abbas:Lian was mentioned in the presence of the Prophet, `Asim bin Adi said a statement about it, and when he left, a man from his tribe came to him complaining that he had seen a man with his wife. `Asim said, \"I have been put to trial only because of my statement.\" So he took the man to the Prophet (ﷺ) and the man told him about the incident. The man (husband) was of yellow complexion, thin, and of lank hair, while the man whom he had accused of having been with his wife, was reddish brown with fat thick legs and fat body. The Prophet (ﷺ) said, \"O Allah! Reveal the truth.\" Later on the lady delivered a child resembling the man whom the husband had accused of having been with her. So the Prophet (ﷺ) made them take the oath of Lian. A man said to Ibn `Abbas in the gathering, \"Was that the same lady about whom the Prophet (ﷺ) said, \"If I were to stone any lady (for committing illegal sexual intercourse) to death without witnesses, I would have stoned that lade to death?\" Ibn `Abbas said, \"No, that was another lady who used to behave in such a suspicious way among the Muslims that one might accuse her of committing illegal sexual intercourse",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": 6857,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" They (the people!) asked, \"O Allah's Apostle! What are they?\" He said, \"To join partners in worship with Allah; to practice sorcery; to kill the life which Allah has forbidden except for a just cause (according to Islamic law); to eat up usury (Riba), to eat up the property of an orphan; to give one's back to the enemy and fleeing from the battle-field at the time of fighting and to accuse chaste women who never even think of anything touching chastity and are good believers",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": 6858,
			"text": "Narrated Abu Huraira:I heard Abu-l-Qasim (the Prophet) saying, \"If somebody slanders his slave and the slave is free from what he says, he will be flogged on the Day of Resurrection unless the slave is really as he has described him",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": 6860,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 81
			}
		}
	]
}