{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1163,
			"arabicnumber": "521.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১০৫০, আন্তর্জাতিক নাম্বারঃ ৫২১ ১০৫০-(৩/৫২১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির ইবনু আবদুল্লাহ আল আনসারী (রাযিঃ) থেকে বর্ণিত, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমাকে এমন পাঁচটি বিশেষ মর্যাদা ও বৈশিষ্ট্য দান করা হয়েছে যা অন্য কোন নবীকে দেয়া হয়নি। প্রত্যেক নবীকে শুধু তার কওমের জন্য পাঠানো হতো। কিন্তু আমাকে সাদা ও কালো সবার জন্য নবী করে পাঠানো হয়েছে। আমার জন্য গনীমাত বা যুদ্ধলব্ধ অর্থ-সম্পদ হালাল করে দেয়া হয়েছে। কিন্তু আমার পূর্বে আর কারো (কোন নবীর) জন্য তা হালাল ছিল না। আমার জন্য গোটা পৃথিবী পাক-পবিত্র ও মসজিদ করে দেয়া হয়েছে। সুতরাং সালাতের সময় হলে যে কোন লোক যে কোন স্থানে সালাত আদায় করে নিতে পারে। আমাকে একমাসের পথের দূরত্ব পর্যন্ত অত্যন্ত শান শাওকাত সহকারে (শত্রুও অন্তর ভীতি দ্বারা) সাহায্য করা হয়েছে। আর আমাকে শাফা'আতের সুযোগ দান করা হয়েছে। (ইসলামী ফাউন্ডেশন ১০৪৪ ইসলামীক সেন্টার ১০৫৪) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১- নিশ্চয় মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে কতকগুলি বৈশিষ্ট্য প্রদান করেছেন। উক্ত বৈশিষ্ট্যগুলির মধ্যে থেকে এখানে কয়েকটি বৈশিষ্ট্যের কথা উল্লেখ করা হলো: ক। ভীতিগ্রস্ত হওয়ার প্রভাব: ভয় লাগা, ডর করা, আশঙ্কা করা। সুতরাং মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর অনিষ্টকারীদের অন্তরে নিক্ষেপ করেন ভয় ভীতি। তাই আল্লাহর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর মধ্যে এবং তাঁর অনিষ্টকারীদের মধ্যে এক মাসের রাস্তা অতিক্রম করার দূরত্ব ও ব্যবধান থাকলেও তারা তাঁর ভয়ে ভীতিগ্রস্ত হয়ে পড়ে। এই বিষয়টি আল্লাহর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর মৃত্যুবরণ করার পর তাঁর অনুসারী উম্মতের জন্য নির্ধারিত রয়েছে। খ। মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে অন্য একটি বৈশিষ্ট্য প্রদান করেছেন। আর সেই বৈশিষ্ট্যটি হলো প্রকৃতপক্ষে সকল জাতির মানব সমাজের মধ্যে আল্লাহর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর মুসলিম উম্মতের জন্য। সুতরাং মুসলিম জাতির জন্য জমিনকে নামাজ পড়ার স্থান ও পবিত্রতার্জনের উপায় করা হয়েছে। তাই কোনো মুসলিম ব্যক্তির যখন নামাজ পড়ার সময় হয়ে যাবে, তখন সে পানি না পেলে তায়াম্মুম করে নিবে এবং যে স্থানে থাকবে সেই স্থানেই সে নামাজ পড়ে নিবে। কেননা সেই স্থানই তার নামাজ পড়ার জায়গা। তবে যে সব জায়গাতে নামাজ পড়া জায়েজ নয়, সেই সব জায়গাতে নামাজ পড়া চলবে না, যেমন:- অপবিত্র জায়গা, কবরস্থান, রাস্তা, আবর্জনা নিক্ষেপ করার স্থান, জীবজন্তু জবাই করার স্থান ইত্যাদি; কেননা এই সব জায়গাতে তো নামাজ পড়া নিষিদ্ধ করা হয়েছে। প্রকৃতপক্ষে নামাজ জামাআতের সহিত পড়ার বিধানটি নির্ধারিত রয়েছে। কিন্তু সফরের কারণে কিংবা অসুস্থতা বা বৃষ্টির কারণে অথবা অন্য কোনো বৈধ অজুহাতের কারণে মানুষ যে স্থানে থাকবে সেই স্থানেই নামাজ পড়ে নিবে। গ। মহান আল্লাহ মহা অনুগ্রহ করে মুসলিম জাতির জন্য ইসলামের শিক্ষা মোতাবেক গানীমাতের মাল (যুদ্ধলব্ধ সম্পদ) হালাল ও বৈধ করেছেন। ঘ। মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে সকল জাতির মানব সমাজের প্রতি প্রেরণ করেছেন। সুতরাং প্রকৃত ইসলামের একটি বৈশিষ্ট্য হলো এই যে, ইসলামের বার্তা সার্বজনীন বিশ্বধর্মের বার্তা; অতএব এই পৃথিবীর বুকে কেয়ামত বা মহা প্রলয় সংঘটিত হওয়া পর্যন্ত প্রকৃত ইসলামই হলো একটি আন্তর্জাতিক বিশ্বধর্ম। এবং এই ধর্ম সমস্ত প্রকারের মানুষের জন্য প্রযোজ্য আর সকল যুগের জন্য উপযোগী । তাই এই ধর্ম হলো একটি যুগোপযোগী ধর্ম। ঙ। পরকালে সমস্ত মানুষের মঙ্গলার্থে মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে ব্যাপকভাবে সুপারিশ করার বৈশিষ্ট্য প্রদান করেছেন। সেই কেয়ামতের দিনে হাশরের ময়দানে প্রথম থেকে শেষ পর্যন্ত সমস্ত মানুষকে মহান আল্লাহ একই স্থানে একত্রিত করবেন। সমস্ত মানুষ যখন সেই কঠিন ভয়ানক দিনে এবং ভীষণ সমস্যার স্থানে অত্যন্ত আতঙ্কিত হয়ে অশান্তির মধ্যে থাকবে, তখন আল্লাহর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] সকল মানুষের নিষ্পত্তি ও ফয়সালার জন্য মহান আল্লাহর কাছে মহা সুপারিশ করবেন। এবং যেই স্থানে আল্লাহর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] মহান আল্লাহর কাছে এই মহা সুপারিশ করবেন, সেই স্থানের নামটি হলো মাকাম মাহমূদ। এই পবিত্র মাকাম মাহমূদ স্থানের প্রতিশ্রুতি মহান আল্লাহ তাঁর রাসূল মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে প্রদান করেছেন। ২- বিশ্বনাবী মুহাম্মদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] কে এবং মুসলিম জাতিকে মহান আল্লাহ উল্লিখিত বৈশিষ্ট্যগুলি প্রদান করেছেন; তাই মুসলিম ব্যক্তির প্রতি একটি অপরিহার্য বিষয় হলো এই যে, সে যেন পরাক্রমশালী মহান আল্লাহর কৃতজ্ঞতা জ্ঞাপন করে।",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		}
	]
}