{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1173,
			"arabicnumber": "524.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১০৬০, আন্তর্জাতিক নাম্বারঃ ৫২৪ ১০৬০-(৯/৫২৪) ইয়াহইয়া ইবনু ইয়াহইয়া ও শায়বান ইবনু ফাররূখ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হিজরাত করে মদীনায় আগমন করলেন, মাদিনার উচ্চভূমিতে বানী 'আমর ইবনু আওফ গোত্রের এলাকায় অবতরণ করলেন, এবং সেখানে চৌদ্দ রাত অবস্থান করলেন। অতঃপর তিনি বানী নাজ্জার গোত্রের লোকজনকে ডেকে পাঠালেন তারা সবাই (খোলা) তরবারিসহ আগমন করলো। হাদীসের বর্ণনাকারী আনাস বলেন, আমি যেন রসূলল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তার সওয়ারী বা বাহনের উপর দেখতে পাচ্ছি। আবূ বাকর তার পিছনে বসে আছেন এবং বানী নাজারের লোকজন তাকে ঘিরে আছে। অবশেষে তিনি আবূ আইয়ুবের (আনসারী) বাড়ীর আঙ্গিনায় অবতরণ করলেন। বর্ণনাকারী আনাস বলেছেন, সালাতের সময় হলেই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করে নিতেন। এমনকি তিনি বকরীর খোয়াড়েও সালাত আদায় করতেন। পরে তিনি মসজিদ নির্মাণ করতে আদিষ্ট হলে বানী নাজ্জার গোত্রের নেতৃস্থানীয় লোকদের ডেকে পাঠালেন। তারা উপস্থিত হলে তিনি তাদেরকে লক্ষ্য করে বললেন, হে বানী নাজ্জার! তোমরা তোমাদের এ বাগানটি অর্থের বিনিময়ে আমার কাছে বিক্রি করো। তারা বললো না, আল্লাহর শপথ, আমরা আল্লাহর নিকট ছাড়া আপনার কাছে এর মূল্য দাবী করব না। আনাস বলেন, ঐ বাগানটিতে যা ছিল তা আমি বর্ণনা করছি, ঐ বাগানে ছিল খেজুর গাছ, মুশরিকদের কিছু কবর এবং কিছু ঘরবাড়ির ধ্বংসস্তুপ। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশে খেজুর গাছগুলো কেটে ফেলা হলো, মুশরিকদের কবরগুলো খুঁড়ে ফেলা হলো এবং ধ্বংসাবশেষগুলো মাটির সাথে মিশিয়ে দেয়া হলো। তারা (কর্তিত) খেজুর গাছের গুড়িসমূহ কিবলার দিকে সারি করে রাখল এবং দরজার দু'পাশে পাথর স্থাপন করল। আনাস ইবনু মালিক বর্ণনা করেছেন। এসব কাজ করার সময় তারা একসুরে কবিতা আবৃত্তি করছিল। আর তাদের সাথে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একস্থানে কবিতা আবৃত্তি করছিলেন। তারা বলছিল, \"হে আল্লাহ! আখিরাতের কল্যাণ ছাড়া প্রকৃত কোন কল্যাণ নেই। তুমি আনসার ও মুহাজিরদের সাহায্য করো।\" (ইসলামী ফাউন্ডেশন ১০৫৪, ইসলামীক সেন্টার ১০৬৩)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		}
	]
}