{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 124,
			"arabicnumber": "20",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩২, আন্তর্জাতিক নাম্বারঃ ২০ ৩২-(৩২/২০) কুতাইবাহ ইবনু সাঈদ (রহঃ) ... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর ইন্তিকালের পর আবূ বাকর (রাযিঃ) খলীফা নিযুক্ত হলেন। এ সময় আরবের একদল লোক (যাকাত অস্বীকার করে) মুরতাদ হয়ে গেল। [আবূ বাকর (রাযিঃ) তাদের বিরুদ্ধে যুদ্ধের সংকল্প করলেন] 'উমার (রাযিঃ) বললেন, আপনি কিরূপে লোকদের বিরুদ্ধে যুদ্ধ করবেন?[1] অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ \"আমি (আল্লাহর পক্ষ থেকে) লোকদের বিরুদ্ধে যুদ্ধ করতে আদিষ্ট হয়েছি যে পর্যন্ত না তারা বলে “লা-ইলা-হা ইল্লাল্লা-হ (আল্লাহ ছাড়া প্রকৃত কোন ইলাহ নেই) আর যে ব্যক্তি 'লা-ইলা-হা ইল্লাল্লা-হ' বললো, সে তার জান-মাল আমার হাত থেকে রক্ষা করলো। অবশ্য আইনের দাবী আলাদা। (অর্থাৎ ইসলামের বিধান অনুযায়ী দণ্ডনীয় কোন অপরাধ করলে তাকে অবশ্যই শাস্তি ভোগ করতে হবে)। তবে তার আসল বিচারের ভার আল্লাহর উপর ন্যস্ত। আবূ বাকর (রাযিঃ) বললেন, আল্লাহর কসম, যে ব্যক্তি সালাত ও যাকাতের মধ্যে পার্থক্য করবে আমি অবশ্যই তার বিরুদ্ধে যুদ্ধ করবো [2] কেননা যাকাত হচ্ছে মালের (উপর বঞ্চিতের) অধিকার। আল্লাহর কসম, যদি তারা আমাকে একখানা রশি প্রদানেও অস্বীকৃতি জানায় যা তারা (যাকাত বাবদ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে প্রদান করতো, তবে আমি এ অস্বীকৃতির কারণে তাদের বিরুদ্ধে যুদ্ধ করবো। এবার উমর ইবনুল খাত্তাব (রাযিঃ) বললেন, আল্লাহর কসম, ব্যাপারটা এ ছাড়া আর কিছুই নয় যে, আল্লাহ তা'আলা আবূ বাকরের হৃদয়কে যুদ্ধের জন্য প্রশস্ত করে দিয়েছিলেন। আমি স্পষ্টই উপলদ্ধি করলাম, এটাই (আবূ বকরের সিদ্ধান্তই) সঠিক এবং যথার্থ। (ইসলামিক ফাউন্ডেশনঃ ৩২, ইসলামিক সেন্টারঃ ৩২) 1. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর ইন্তিকালের পর আরাবের কিছু সংখ্যক লোক মুরতাদ হয়ে যায়, কিছু সংখ্যক লোক যাকাত দিতে অস্বীকার করে। উমার (রাযিঃ) এর জিজ্ঞাস্য ছিল, যারা যাকাত দিতে অস্বীকার করে অথচ 'লা-ইলা-হা ইল্লাল্লা-হ' বলে, তাদের বিরুদ্ধে জিহাদ করা কি উচিত? 2. যারা সালাত ফরয মনে করে অথচ যাকাত দেয়া ফরয মনে করে না।",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		}
	]
}