{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1254,
			"arabicnumber": "564.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১১৪১, আন্তর্জাতিক নাম্বারঃ ৫৬৪ ১১৪১-(৭৪/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে এ রসুন জাতীয় উদ্ভিদ খাবে- কোন কোন সময় আবার তিনি বলেছেনঃ যে ব্যক্তি পিয়াজ, রসুন বা মূলা খাবে সে যেন আমার মসজিদের কাছেও না আসে। কেননা মানুষ যেসব জিনিস দ্বারা কষ্ট পায় মালাকগণও সেসব জিনিস দ্বারা কষ্ট পায়। (ইসলামী ফাউন্ডেশন ১১৩৪, ইসলামীক সেন্টার ১১৪৩) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। মাসজিদে প্রবেশ করার পূর্বে যে ব্যক্তি কাঁচা পেঁয়াজ, কাঁচা রসুন, ইত্যাদি দুর্গন্ধ জাতীয় কিছু খাবে, সে ব্যক্তির জন্য মাসজিদে প্রবেশ করা কঠোরতার সহিত নিষিদ্ধ করা হয়েছে। যাতে সে তার দুর্গন্ধের দ্বারা অন্য মুসল্লিদেরকে কষ্ট না দেয়। কেননা যে ব্যক্তি নিজের দুর্গন্ধের দ্বারা মুসল্লিদেরকে কষ্ট দেয়, সে ব্যক্তি প্রকৃতপক্ষে ফেরেশতাগণকেই কষ্ট দিয়ে থাকে। ২। যে ব্যক্তির শরীরের দুর্গন্ধের দ্বারা মুসল্লিদের কষ্ট হবে, সে ব্যক্তির জন্য মাসজিদে প্রবেশ করা জায়েজ নয়। সুতরাং দৃষ্টান্তস্বরূপ বলা যেতে পারে যে, যে ব্যক্তির শরীরের মধ্যে ধুমপান অথবা বিড়ি, সিগারেট, তামাক ইত্যাদির দুর্গন্ধ থাকবে অথবা তার শরীরের পোশাক, জামাকাপড়, কিংবা পায়ের মোজা দুর্গন্ধযুক্ত হবে, সে ব্যক্তি মাসজিদে প্রবেশ করবে না। তাই মুসল্লি ব্যক্তি যেন মাসজিদে প্রবেশ করার পূর্বে নিজের শরীর, শরীরের পোশাক, জামাকাপড় ইত্যাদি ভালোভাবে দেখে নেয় বা পরিদর্শন নেয়। যাতে সে মাসজিদে প্রবেশ করে মুসল্লিদেরকে এবং ফেরেশতাগণকে কষ্ট না দেয়। আর পুণ্যের বদলে পাপকারী না হয়ে যায়। ৩। এই হাদীসটি মুসলিম ব্যক্তিকে এই বিষয়টির প্রতি উৎসাহ প্রদান করে যে, সে যেন মাসজিদের পবিত্রতা রক্ষা করার গুরুত্ব অনুভব করে এবং মাসজিদে উপস্থিত হওয়ার সময় এবং নামাজ পড়ার সময় সুসজ্জিত হয়ে মাসজিদে প্রবেশ করে। সুতরাং সে মাসজিদে যাওয়ার পূর্বে পবিত্রতার্জন করবে, বিশুদ্ধতা বজায় রাখবে, দরকারে যত্নসহকারে ওজু ও গোসল বা স্নান করবে, সুগন্ধি ব্যবহার করবে, প্রসাধন করবে এবং সুসজ্জিত হয়ে পরিষ্কার ও সুন্দর কাপড় পরিধান করবে। অতঃপর মাসজিদে প্রবেশ করবে।",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		}
	]
}