{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1338,
			"arabicnumber": "593.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১২২৫, আন্তর্জাতিক নাম্বারঃ ৫৯৩ ১২২৫-(১৩৭/৫৯৩) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মুগীরাহ ইবনু শুবাহ (রাযিঃ) কর্তৃক আযাদকৃত ক্রীতদাস ওয়াররাদ থেকে বর্ণিত। তিনি বলেছেন, মুগীরাহ বিন শুবাহ মু'আবিয়াহ (রাযিঃ)-কে লিখে পাঠান যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত শেষে সালাম ফিরিয়ে বলতেন– \"লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা- শারীকা লাহু লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুওয়া আলা- কুল্লি শাইয়িন কাদীর, আল্ল-হুম্মা লা- মা-নি’আ লিমা- আ ত্বয়তা ওয়ালা মুত্বিয়া লিমা- মানা'তা ওয়ালা- ইয়ানফাউ যাল জাদ্দি মিনকাল জাদ\" (অর্থাৎ- আল্লাহ ছাড়া প্রকৃত কোন ইলাহ নেই। তিনি এক ও শারীক বিহীন। সার্বভৌম ক্ষমতা তার জন্য নির্দিষ্ট। সব প্রশংসা তারই প্রাপ্য। তিনি সবকিছুর ওপর ক্ষমতাবান। হে আল্লাহ! তুমি যা দিতে চাও তাতে বাধা দেয়ার শক্তি কারো নেই। আর যা দিতে না চাও তার দেবার শক্তিও কারো নেই। আর কোন সম্পদশালীর সম্পদ তোমার নিকট থেকে রক্ষা করতে পারে না।)। (ইসলামী ফাউন্ডেশন ১২১৪, ইসলামীক সেন্টার ১২২৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] ফরজ নামাজ শেষ করার পর এই জিকিরটি পাঠ করতেন: \"لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، اَللَّهُمَّ! لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ\". ২। এই মহা জিকিরটির মধ্যে প্রকৃত ইসলাম ধর্মের মহা মতবাদ তাওহীদ ও একত্ববাদের ঘোষণা রয়েছে। সুতরাং মহান আল্লাহ তাঁর সত্তা, বৈশিষ্ট্যপূর্ণ অস্তিত্ব, নাম, গুণাবলী এবং কর্মের দিক দিয়ে এক এবং একক। নিশ্চয় তিনি সমস্ত উপাসনার সত্য অধিকারী। আর তিনিই কেবল সকল সৃষ্টি জগতের সার্বিক নিয়ন্ত্রণ ও পরিচালন ক্রিয়া সম্পাদন করেন। ৩। এই হাদীসটির মধ্যে এসেছে \"لاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ\". এর অর্থ হলো: হে আল্লাহ! আপনার কাছে প্রকৃত ইসলামের শিক্ষা মোতাবেক সৎকর্ম ছাড়া কোনো সম্পদশালীর সম্পদ উপকারে আসবে না। সুতরাং মানুষ যত বড়োই ধনবান হোক আর যত বড়োই পদাধিকারী হোক, সে সদা সর্বদা সমস্ত বিষয়ে মহান আল্লাহর মুখাপেক্ষী।",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 175
			}
		}
	]
}