{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1393,
			"arabicnumber": "614.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১২৮০, আন্তর্জাতিক নাম্বারঃ ৬১৪ ১২৮০-(১৭৮/৬১৪) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আবূ মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, জনৈক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে সালাতের সময় সম্পর্কে প্রশ্ন করলে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাকে জবাব দিলেন না তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কাজের মাধ্যমে তাকে দেখিয়ে দিতে চাচ্ছিলেন। বর্ণনাকার সাহাবী আবূ মূসা বলেন, উষার আগমনের সাথে সাথেই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের সালাত আদায় করলেন। তখনও অন্ধকার এতটা ছিল যে লোকজন একে অপরকে দেখে চিনতে পারছিল না। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আযান দিতে আদেশ করলেন এবং লোকজন বলাবলি করছিল যে, দুপুর হয়েছে। অথচ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এ বিষয়ে তাদের চেয়ে বেশী অবহিত। তারপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আসরের আযান দিতে আদেশ করলেন এবং এমন সময় আসরের সালাত আদায় করলেন যখন সূর্য আকাশের বেশ উপরের দিকে ছিল। অতঃপর তিনি মাগরিবের সালাতের আযান দিতে আদেশ করলেন এবং এমন সময় সালাত আদায় করলেন যখন সবেমাত্র সূর্যাস্ত হয়েছে। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ইশার সালাতের আযান দিতে আদেশ করলেন এবং এমন সময় ইশার সালাত আদায় করলেন যখন সান্ধ্যকালীন দিগন্ত লালিমা সবেমাত্র অস্তমিত হয়েছে। এর পরদিন সকালে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ফজরের সালাত দেরী করে আদায় করলেন। এতটা দেরী করে আদায় করলেন যে, যখন সালাত শেষ করলেন তখন লোকজন বলাবলি করছিল- সূর্যোদয় ঘটেছে বা সূর্যোদয়ের উপক্রম হয়েছে। এরপর যুহরের সালাত এতটা দেরী করে আদায় করলেন যে, গত দিনের আসরের সালাত যে সময় আদায় করেছিলেন প্রায় সে সময় এসে গেল। অতঃপর আসরের সালাতটাও এতটা দেরী করে আদায় করলেন যে, সালাত শেষ করলে লোকজন বলাবলি করতে লাগল- সূর্য রক্তিন বর্ণ ধারণ করেছে। তারপর মাগরিবের সালাতও দেরী করে আদায় করলেন। এতটা দেরী করলেন যে সান্ধ্যকালীন দিগন্ত লালিমা তখন অন্তর্নিহিত হয়ে যাচ্ছিল। এরপর ইশার সালাতও দেরী করে আদায় করলেন। এতটা দেরী করে আদায় করলেন যে রাতের প্রথম তৃতীয়াংশ অতিক্রান্ত হয়ে গেল এবং অতিক্রান্ত হওয়ার উপক্রম হলো। অতঃপর সকাল বেলা প্রশ্নকারীকে ডেকে বললেনঃ এ দু'টি সময়ের মধ্যবর্তী সময়টুকুই সালাতসমূহের সময় (অর্থাৎ- দু' দিনে আমি একই সময়ে সালাত আদায় না করে একই সালাতের সময়ের মধ্যে কিছু তারতম্য করে আদায় করলাম। এ উভয় সময়ের মধ্যকার সময়টুকুই প্রত্যেক ওয়াক্তের প্রকৃত সময়)। (ইসলামী ফাউন্ডেশন ১২৬৭, ইসলামীক সেন্টার ১২৮০)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 227
			}
		}
	]
}