{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৬২৪, আন্তর্জাতিক নাম্বারঃ ৭৪৬ ১৬২৪-(১৩৯/৭৪৬) মুহাম্মাদ ইবনুল মুসান্না আল আনাযী (রহঃ) ..... যুরারাহ (রহঃ) থেকে বর্ণিত। সা'দ ইবনু হিশাম ইবনু আমির (রহঃ) আল্লাহর পথে (আজীবন) লড়াই করার সিদ্ধান্ত গ্রহণ করলেন। তাই তিনি মদীনায় আগমন করলেন। তিনি চাচ্ছিলেন এ উদ্দেশে তিনি তার জমি-জমা বিক্রি করে তা দ্বারা অস্ত্রশস্ত্র ও যুদ্ধের ঘোড়া কিনবেন এবং রোমান অর্থাৎ খৃষ্টানদের বিরুদ্ধে আমৃত্যু জিহাদ করবেন। তাই মদীনায় এসে তিনি মদীনাহবাসী কিছু লোকের সাথে সাক্ষাৎ করলে তারা তাকে ঐরুপ করতে নিষেধ করলেন। তারা তাকে এ কথাও জানালেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জীবদ্দশায় ছয়জন লোকের একটি দল এ একই কাজ করতে চাইলে আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা করতে নিষেধ করেছিলেন; আমার জীবন ও কর্মে কি তোমাদের জন্য অনুসরণীয় আদর্শ নেই? তারা (মদীনাহবাসী) যখন তাকে এ কথাটি শুনালেন তখন তিনি তার স্ত্রীকে ফিরিয়ে নিলেন (রুজ’আত করলেন) এবং কিছু লোককে এ ব্যাপারে সাক্ষী রাখলেন। কেননা এ কাজের (জিহাদের) জন্য তিনি তার স্ত্রীকে তালাক দিয়েছিলেন। এরপর তিনি আবদুল্লাহ ইবনু আব্বাস এর কাছে এসে তাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিতর সালাত আদায় করা সম্পর্কে জিজ্ঞেস করলেন। আবদুল্লাহ ইবনু আব্বাস তাকে বললেনঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিতর সালাত সম্পর্কে পৃথিবীর অধিবাসীদের মধ্যে সবচেয়ে বেশী জানে আমি এমন একজন লোকের সন্ধান কি তোমাকে দিব না? তিনি (সাদ ইবনু হিশাম ইবনু আমির) বললেনঃ তিনি কে? আবদুল্লাহ ইবনু আব্বাস বললেনঃ তিনি হলেন আয়িশাহ (রাযিঃ)। তার কাছে গিয়ে তুমি জিজ্ঞেস করবে, তারপর তোমাকে দেয়া তার জবাব আমাকে এসে জানাবে। আমি তখন তার কাছে যাওয়ার জন্য রওয়ানা হলাম। প্রথমে আমি হাকীম ইবনু আফলাহ-র কাছে গেলাম। আমি তাকে আমার সাথে তার (আয়িশাহ) এ দু' দলের ব্যাপারে কোন কিছু বলতে নিষেধ করেছিলাম। কিন্তু তিনি তা না শুনে বরং একটি পক্ষাবলম্বন করেছিলেন। সা'দ ইবনু হিশাম ইবনু আমির বলেনঃ তখন আমি তাকে কসম দিয়ে যেতে বললাম। তাই তিনি যেতে রাজি হলেন। আমরা আয়িশাহ (রাযিঃ) এর কাছে গিয়ে তাকে অবহিত করলে তিনি আমাদেরকে অনুমতি দান করলেন। আমরা তার কাছে গেলে তিনি হাকীম আফলাহকে চিনতে পারলেন। তাই বললেনঃ আরে, এ যে হাকীম? তিনি (হাকীম ইবনু আফলাহ) বললেনঃ হ্যাঁ। তিনি জিজ্ঞেস করলেনঃ তোমার সাথে কে আছে? তিনি বললেনঃ সা'দ ইবনু হিশাম (ইবনু আমির)। তিনি প্রশ্ন করলেন। কোন হিশাম? হাকীম ইবনু আফলাহ বললেনঃ ‘আমিরের পুত্র হিশাম। এ কথা শুনে তিনি তার প্রতি খুব স্নেহপ্রবণ হলেন এবং তার ব্যাপারে ভাল মন্তব্য করলেন। কাতাদাহ্ বর্ণনা করলেনঃ আফলাহ উহুদের যুদ্ধে শাহীদ হয়েছিলেন। এরপর আমি বললামঃ হে উন্মুল মুমিনীন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আখলাক সম্পর্কে আমাকে কিছু অবহিত করুন। এ কথা শুনে তিনি আমাকে বললেনঃ তুমি কি কুরআন পড় না? আমি বললাম- হ্যাঁ, পড়ি। তিনি বললেন, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আখলাক তো ছিল কুরআন। সা'দ ইবনু হিশাম ইবনু আমির বলেছেন : আমি তখন মনে মনে সিদ্ধান্ত নিলাম উঠে চলে আসি এবং মৃত্যু পর্যন্ত এ ব্যাপারে আর কাউকে কিছু জিজ্ঞেস না করি। কিন্তু আমার মনে আবার একটি নতুন ধারণা জাগল। তাই আমি বললামঃ আমাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাতের ইবাদাত (কিয়ামুল লায়ল) সম্পর্কে কিছু অবহিত করুন। তিনি এবার আমাকে জিজ্ঞেস করলেনঃ তুমি কি সূরাহ \"ইয়া আইইয়্যুহাল মুয্‌যাম্‌মিল\" পড় না? আমি বললাম- হ্যাঁ পড়ি। তিনি বললেনঃ মহান ও পরাক্রমশালী আল্লাহ এ সূরার প্রথমভাগে “কিয়ামুল লাইল\" বা রাতের ইবাদাত বন্দেগী ফারয (ফরয) করে দিয়েছেন। তাই এক বছর পর্যন্ত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার সাহাবীগণ রাতের বেলা ইবাদাত করেছেন। মহান আল্লাহ বারো মাস পর্যন্ত এ সূরার শেষাংশ আসমানে ঠেকিয়ে রেখেছিলেন (অর্থাৎ বারো মাস পর্যন্ত এ সূরার শেষাংশ অবতীর্ণ করেননি)। অবশেষে (বারো মাস পরে) এ সূরার শেষে আল্লাহ তা'আলা রাতের ইবাদাতের হুকুম লঘু করে আয়াত অবতীর্ণ করলেন। আর এ কারণে রাত জেগে ইবাদাত যেখানে ফারয (ফরয) ছিল সেখানে তা নাফল বা ঐচ্ছিক হয়ে গেল। সা'দ ইবনু হিশাম বলেনঃ আমি বললাম, হে উন্মুল মু'মিনীন! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিতর সালাত সম্পর্কে আমাকে কিছু অবহিত করুন। তিনি বললেনঃ আমরা তার জন্য মিসওয়াক এবং ওযুর পানি প্রস্তুত করে রাখতাম। অতঃপর রাতের বেলা মহান আল্লাহ যখন চাইতেন তখন তাকে জাগিয়ে দিতেন। তিনি উঠে মিসওয়াক করতেন। ওযু করতেন এবং নয় রাকাআত (বিতর) সালাত আদায় করতেন। এতে অষ্টম রাকাআত ছাড়া বসতেন না। এ বৈঠকে তিনি আল্লাহকে স্মরণ করতেন, তার প্রশংসা করতেন এবং তার কাছে প্রার্থনা করতেন। অতঃপর এমনভাবে সালাম ফিরাতেন যে আমরা তা শুনতে পেতাম। এবার সালাম ফিরানোর পর ঘরে বসেই তিনি দু' রাকাআত সালাত আদায় করতেন। তারপর বললেনঃ হে বৎস! এ এগার রাকাআত সালাত তিনি রাতে আদায় করতেন। পরবর্তী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বয়স বেড়ে গিয়েছিল এবং শরীরও কিছুটা ভারী হয়ে গিয়েছিল তখন তিনি সাত রাকাআত বিতর আদায় করতেন। এক্ষেত্রেও তিনি শেষের দু রাকাআত সালাত পূর্বের মতো করেই আদায় করতেন। হে বৎস! এভাবে তিনি নয় রাকাআত সালাত আদায় করতেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন সালাত আদায় করলে তা সর্বদা নিয়মিত আদায় করা পছন্দ করতেন। যখন ঘুমের প্রাবল্য বা ব্যথা-বেদনার কারণে তিনি রাতে ইবাদাত (সালাত আদায়) করতে পারতেন না, তখন দিনের বেলা বারো রাকাআত সালাত আদায় করতেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক রাতে পুরো কুরআন মাজীদ তিলাওয়াত করেছেন বা সকাল পর্যন্ত সারা রাত আদায় করেছেন কিংবা রমযান মাস ছাড়া সারা মাস সিয়াম (রোযা) পালন করেছেন এমনটি আমি কখনো দেখিনি। সা'দ ইবনু হিশাম ইবনু আমির বর্ণনা করেছেন পরে আমি আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) এর কাছে এসে আয়িশাহ (রাযিঃ)-এর বর্ণিত হাদীসটি বর্ণনা করলে তিনি বললেনঃ তিনি সঠিক বলেছেন। আমি যদি তার কাছে থাকতাম বা তার কাছে যেতাম তাহলে নিজে তার মুখ থেকে হাদীসটি শুনতে পেতাম। সা'দ ইবনু হিশাম বললেনঃ আমার যদি জানা থাকত যে, আপনি তার কাছে যান না, তাহলে আপনাকে আমি তার কথা বলতাম না। (ইসলামী ফাউন্ডেশন ১৬০৯, ইসলামীক সেন্টার ১৬১৬)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		}
	]
}