{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1788,
			"arabicnumber": "763.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৬৭৩, আন্তর্জাতিক নাম্বারঃ ৭৬৩ ১৬৭৩-(১৮১/৭৬৩) ‘আবদুল্লাহ ইবনু হাশিম ইবনু হাইয়্যান আল আবদী (রহঃ) .... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি এক রাতে আমার খালা মায়মূনাহ এর (রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রীর) ঘরে কাটালাম। (আমি দেখলাম) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতের বেলা উঠলেন এবং প্রাকৃতিক প্রয়োজন সেরে এসে মুখমণ্ডল এবং দু' হাত ধুলেন। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ঘুমালেন। পরে পুনরায় উঠে মশকের পাশে গেলেন এবং এর বন্ধন খুলে ওযু করলেন। ওযুতে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মধ্যমপন্থা অবলম্বন করলেন (অর্থাৎ ওযু করতে খুব যত্নও নিলেন না আবার একেবারে খুব হালকাভাবেও ওযু করলেন না)। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বেশী পানি ব্যবহার করলেন না। তবে পূর্ণাঙ্গ ওযু করলেন। তারপর দাঁড়িয়ে সালাত আদায় করলেন। আমি সে সময় উঠলাম এবং তার কাজকর্ম দেখার জন্য জেগে ছিলাম বা সতর্কভাবে তা লক্ষ্য করছিলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এটা যেন না ভেবে বসেন তাই আড়মোড়া ভাঙ্গলাম। এবার আমি ওযু করলাম এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করতে দাঁড়ালেন, অতঃপর আমিও তার বাঁ পাশে দিয়ে দাঁড়ালাম। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে আমার হাত ধরে ঘুরিয়ে এনে তার ডান পাশে দাঁড় করিয়ে দিলেন। এভাবে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাতের সালাত তের রাকাআত শেষ হ’ল। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ঘুমিয়ে পড়লেন। এমনকি (ঘুমের মধ্যে তাঁর) নাক ডাকতে শুরু করল। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) স্বভাবতঃ যখনই ঘুমাতেন তখন নাক ডাকত। পরে বিলাল (রাযিঃ) তাকে সালাতের কথা বলে গেলেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ \"আল্ল-হুম্মাজ আল ফী ক্বলবী নূরাওঁ ওয়া ফী বাসারী নূরাও, ওয়া ফী সামঈ নূরাও ওয়া আই ইয়ামীনী নুরাওঁ, ওয়া আই ইয়াসা-রী নূরাওঁ, ওয়া ফাওকী নূরাওঁ, ওয়া তাহতী নূরাওঁ, ওয়া আমামী নূরাওঁ, ওয়া খালফী নূরাওঁ,ওয়া আয্‌যিমলী নূরাওঁ\" অর্থাৎ হে আল্লাহ! তুমি আমার হৃদয়ে আলো দান কর, আমার চোখে আলো দান কর, আমার কানে বা শ্রবণ শক্তিতে আলো দান কর। আমার ডান দিকে আলো দান কর, আমার বাঁ দিকে আলো দান কর, আমার উপর দিকে আলো দান কর, আমার নীচের দিকে আলো দান কর, আমার সামনে আলো দান কর, আমার পিছনে আলো দান কর এবং আমার আলোকে বিশাল করে দাও।)। বর্ণনাকারী কুরায়ব বলেছেনঃ তিনি এরূপ আরো সাতটি কথা বলেছিলেন যা আমি ভুলে গিয়েছি। হাদীসের বর্ণনাকারী সালামাহ ইবনু কুহায়ল বলেন- এরপর আমি আব্বাস (রাযিঃ) এর এক পুত্রের সাথে সাক্ষাৎ করলে তিনি ঐগুলো (অবশিষ্ট সাতটি) আমার কাছে বর্ণনা করলেন। তাতে তিনি উল্লেখ করলেনঃ আমার স্নায়ুতন্ত্ৰীসমূহে, আমার শরীরের গোশতে, আমার রক্তে, আমার চুলে এবং আমার গাত্রচর্মে আলো দান কর। এছাড়াও তিনি আরো দুটি বিষয় উল্লেখ করে বললেনঃ এ দু'টিতে তিনি আলো চেয়েছেন। (ইসলামী ফাউন্ডেশন ১৬৫৮, ইসলামীক সেন্টার ১৬৬৫)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 216
			}
		}
	]
}