{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৬৯৭, আন্তর্জাতিক নাম্বারঃ ৭৭১ ১৬৯৭-(২০১/৭৭১) মুহাম্মাদ ইবনু আবূ বাকর আল মুকাদ্দামী (রহঃ) ..... ‘আলী ইবনু আবূ তুলিব (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বর্ণনা করেছেন যে, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যখন সালাত আদায় করতে দাঁড়াতেন তখন এ বলে শুরু করতেনঃ \"ওয়াজ্জাহতু ওয়াজহিয়া লিল্লাযী ফাত্বারাস সামা-ওয়া-তি ওয়াল আরযা হানীফাওঁ ওয়ামা- আনা মিনাল মুশরিকীনা ইন্না সলা-তী ওয়া নুসুকী ওয়া মাহইয়া-ইয়া ওয়া মামা-তী লিল্লা-হি রব্বিল আ-লামীনা লা শারীকা লাহু ওয়াবি যা-লিকা উমিরতু ওয়া আনা- মিনাল মুসলিমীন, আল্ল-হুম্মা আনতাল মালিকু লা- ইলা-হা ইল্লা- আনতা আনতা রব্বী ওয়া আনা- আবদুকা যলামতু নাফসী ওয়া'তারাফতু বিযাম্বি ফাগফিরলী যুনুবী জামী'আন ইন্নাহু লা- ইয়াগকরুত্ব যুনুবা ইল্লা- আনতা ওয়াহদিনী লিআহসানিল আখলা-ক্বি লা- ইয়াহদী লিআহসানিহা- ইল্লা- আনতা ওয়াসরিফ আন্নী সাইয়্যিআহা- লা- ইয়াসরিফু 'আন্নী সাইয়্যিআহা- ইল্লা- আনতা লাব্বায়কা ওয়া সাদায়কা ওয়াল খয়রু কুল্লুহু কী ইয়াদায়কা ওয়াশ শুররু লায়সা ইলায়কা আনা- বিকা ওয়া ইলায়কা তাবা-রাকত ওয়াতা আ-লায়তা আস্তাগফিরুকা ওয়া আতুব ইলায়ক\" (অর্থাৎ- আমি একনিষ্ঠ হয়ে আমার মুখ সে মহান সত্তার দিকে ফিরিয়ে নিলাম যিনি আসমান ও জমিনকে সৃষ্টি করেছেন। আর আমি মুশরিকদের অন্তর্ভুক্ত নই। আমার সালাত, আমার কুরবানী, আমার জীবন ও মৃত্যু সবকিছুই আল্লাহর জন্য যিনি সারা বিশ্বজাহানের প্রতিপালক। তার কোন শারীক নেই। আমি এ জন্যই আদিষ্ট হয়েছি। আমি মুসলিম বা আত্মসমর্পণকারী। হে আল্লাহ! তুমিই সার্বভৌম বাদশাহ। তুমি ছাড়া আর কোন ইলাহ নেই। তুমি আমার প্রতিপালক, আর আমি তোমার বান্দা। আমি নিজে আমার প্রতি যুলুম করেছি। আমি আমার পাপ স্বীকার করছি। সুতরাং তুমি আমার সব পাপ ক্ষমা করে দাও। কেননা তুমি ছাড়া আর কেউ পাপ ক্ষমা করতে পারে না। আমাকে সর্বোত্তম আখলাক বা নৈতিকতার পথ দেখাও। তুমি ছাড়া এ পথ আর কেউ দেখাতে সক্ষম নয়। আর আখলাক বা নৈতিকতার মন্দ দিকগুলো আমার থেকে দূরে রাখ। তুমি ছাড়া আর কেউ মন্দগুলোকে দূরে রাখতে সক্ষম নয়। আমি তোমার সামনে হাজির আছি- তোমার আনুগত্য করতে প্রস্তুত আছি। সব রকম কল্যাণের মালিক তুমিই। অকল্যাণের দায়-দায়িত্ব তোমার নয়। আমার সব কামনা-বাসনা তোমার কাছেই কাম্য। আমার শক্তিসামর্থ্যও তোমারই দেয়া। তুমি কল্যাণময়, তুমি মহান। আমি তোমার কাছে ক্ষমা প্রার্থনা করছি এবং তোমার কাছেই তওবা করছি।)। আর রুকূ করার সময় বলতেনঃ “আল্ল-হুম্মা লাকা রাকা'তু ওয়াবিকা আ-মানতু ওয়ালাকা আসলামতু খশা'আ লাকা সামঈ ওয়া বাসার ওয়া মুখখী ওয়া আযমী ওয়া আসাবী\"- (অর্থাৎ- হে আল্লাহ! তোমার উদ্দেশেই আত্মসমর্পণ করলাম। আমার কান, চোখ, মগজ, হাড় এবং সব স্নায়ুতন্ত্রী তোমার কাছে নত ও বশীভূত হ’ল)। আর রুকূ’ থেকে উঠে বলতেনঃ “আল্ল-হুম্মা রব্বানা- লাকাল হামদু মিলআস সামা-ওয়াতি ওয়ামিল আল আরযি ওয়ামিলআ মা- বায়নাহুমা- ওয়ামিলআ মা- শি'তা মিন শাইয়িন বাদু”— (অর্থাৎ- হে আল্লাহ! হে আমার প্রতিপালক, সব প্রশংসা তোমারই প্রাপ্য। আসমান ভর্তি প্রশংসা একমাত্র তোমারই প্রাপ্য)। আর যখন সাজদায় যেতেন তখন বলতেনঃ \"আল্ল-হুম্মা লাকা সাজাদতু ওয়াবিকা আ-মানতু ওয়ালাকা আসলামৃত্যু সাজাদা ওয়াজহী লিল্লায়ী খলাকাহু ওয়াসাও ওয়ারাহু ওয়াশাক্বকা সাম'আহু ওয়া বাসারাহ্ তাবা-রাকাল্লা-হু আহসানুল খ-লিকীন”— (অর্থা- হে আল্লাহ! তোমারই উদ্দেশে আমি সিজদা করলাম। তোমারই প্রতি আমি ঈমান পোষণ করেছি। তোমারই উদ্দেশে আমি আত্মসমর্পণ করেছি। আমার মুখমণ্ডল সে মহান সত্তার উদ্দেশে সিজদা করল যিনি তাকে সৃষ্টি করেছেন এবং আকৃতি দান করেছেন আর কান ও চোখ ফুটিয়ে শোনা ও দেখার উপযোগী করে তৈরি করেছেন। মহা কল্যাণময় আল্লাহ, তিনি কতই না উত্তম সৃষ্টিকার)। অতঃপর সবশেষে তাশাহহুদ ও সালামের মধ্যবর্তী সময়ে তিনি বলতেনঃ “আল্ল-হুম্মাগফিরলী মা- ক্বদ্দামতু ওয়ামা- আখখারতু ওয়ামা আসসারতু ওয়ামা আ'লানতু ওয়ামা আসরাফতু ওয়ামা আনতা আ'লামু বিহী মিন্নী আনতাল মুকাদ্দিমু ওয়া আনতাল মুআখখিরু লা-ইলা-হা ইল্লা- আনতা\"- (অর্থাৎ- হে আল্লাহ! তুমি আমার পূর্বের ও পরের, গোপনে এবং প্রকাশ্যে কৃত গুনাহ ক্ষমা করে দাও। আর যে সব ব্যাপারে আমি বাড়াবাড়ি করেছি তাও ক্ষমা করে দাও। আমার কৃত যেসব পাপ সম্পর্কে তুমি আমার চাইতে বেশী জান তাও ক্ষমা করে দাও। তুমিই আদি এবং তুমিই অন্ত, তুমি ছাড়া আর কোন ইলাহ নেই।) (ইসলামী ফাউন্ডেশন ১৬৮২, ইসলামীক সেন্টার ১৬৮৯)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		}
	]
}