{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1933,
			"arabicnumber": "834",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮১৮, আন্তর্জাতিক নাম্বারঃ ৮৩৪ ১৮১৮-(২৯৭/৮৩৪) হারমালাহ ইবনু ইয়াহইয়া আত তুজীবী (রহঃ) ..... কুরায়ব (রহঃ) থেকে বর্ণিত। আবদুল্লাহ ইবনু আব্বাস, 'আবদুর রহমান ইবনু আযহার ও মিসওয়ার ইবনু মাখরামাহ (রাযিঃ) প্রমুখ তাকে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) এর নিকট পাঠালেন। তারা বললেন, তুমি তাকে [আয়িশাহ (রাযিঃ) কে আমাদের পক্ষ থেকে সালাম জানাবে এবং আসরের সালাতের পর দু' রাকাআত (নাফল) সালাত আদায় সম্পর্কে জিজ্ঞেস করবে এবং বলবে যে, আমাদের অবহিত করা হয়েছে যে, আপনি সে দু' রাকাআত আদায় করেন, অথচ আমরা জানতে পেরেছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা আদায় করতে নিষেধ করেছেন। ইবনু আব্বাস (রাযিঃ) বলেন, আমিও উমার ইবনুল খাত্ত্বাব (রাযিঃ)-এর সাথে লোকজনকে এ সালাত থেকে বিরত রাখতাম। আবূ কুরায়ব (রাযিঃ) বলেন, তারা আমাকে যে বিষয়সহ পাঠিয়েছিলেন, আমি তার ঘরে প্রবেশ করে তা তাকে পৌছে দিলাম। তিনি বলেন, উম্মু সালামাহ (রাযিঃ) কে জিজ্ঞেস কর। আমি বের হয়ে তাদের নিকট এসে আয়িশাহ (রাযিঃ) এর কথা তাদেরকে অবহিত করলাম। অতঃপর তারা আমাকে যে বিষয়সহ আয়িশাহ (রাযিঃ) এর নিকট পাঠিয়েছিলেন, সেই একই বিষয়সহ উম্মু সালামাহ (রাযিঃ)-এর নিকট পাঠালেন। উম্মু সালামাহ (রাযিঃ) বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সে সালাত আদায় করতে নিষেধ করতে শুনেছি, তা সত্ত্বেও পরে আমি তাকে তা আদায় করতে দেখেছি। তিনি যখন এ সালাত আদায় করেছেন তার বিবরণ এই যে, তিনি আসরের সালাত আদায় করলেন, অতঃপর আমার নিকট প্রবেশ করলেন, তখন আনসার সম্প্রদায়ভুক্ত বানু হারাম-এর কতক মহিলা আমার নিকট উপস্থিত ছিল। তিনি দু' রাকাআত সালাত আদায় করলেন। আমি এক দাসীকে তার নিকট পাঠিয়ে বললাম, তুমি গিয়ে তার এক পাশে দাঁড়াবে, তারপর তাকে বলবে, উম্মু সালামাহ (রাযিঃ) বলেছেন, হে আল্লাহর রসূল! এ দু' রাকাআত সালাত আদায় করতে আপনি নিষেধ করেছেন তা আমি শুনেছি, আর এখন দেখছি, আপনি তা আদায় করছেন। তিনি তার হাত দিয়ে ইশারা করলে সে তার জন্য অপেক্ষা করবে। বর্ণনাকারী বলেন, দাসী তাই করল। তিনি তার হাত দিয়ে ইশারা করলে সে তার জন্য অপেক্ষায় থাকে। তিনি সালাত থেকে অবসর হয়ে বলেনঃ হে আবূ উমাইয়্যাহ-এর কন্যা! তুমি আসরের সালাতের পর দু' রাকাআত সালাত সম্পর্কে জিজ্ঞেস করেছ। তার বিবরণ এই যে, আবদুল কায়স গোত্রের কতক লোক স্বগোত্রের পক্ষ থেকে ইসলাম ধর্ম গ্রহণের উদ্দেশে আমার নিকট আসে। (তাদের নিয়ে) ব্যস্ত থাকার কারণে আমি যুহরের সালাতের পরবর্তী দু' রাকাআত সালাত আদায় করতে পারিনি। এ হ'ল সে দু' রাকাআত। (ইসলামী ফাউন্ডেশন ১৮০৩, ইসলামীক সেন্টার, ১৮১০)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 361
			}
		}
	]
}