{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2102,
			"arabicnumber": "904.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯৮৭, আন্তর্জাতিক নাম্বারঃ ৯০৪ ১৯৮৭-(১০/...) আবূ বকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) [তাদের দু'জনের শব্দ প্রায় কাছাকাছি] ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় অর্থাৎ যেদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রিয় পুত্র ইবরাহীম মৃত্যুবরণ করেন, সূর্যগ্রহণ লেগেছিল। এতে লোকেরা বলতে লাগল ইবরাহীমের মৃত্যুর কারণে সূর্যগ্রহণ লেগেছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে গিয়ে উপস্থিত লোকদের নিয়ে ছয় রুকূ’ ও চার সাজদায় সালাত আদায় করলেন। সূচনাতে তাকবীর উচ্চারণ করলেন পরে কিরআত পাঠ করলেন এবং কিরআত বেশ লম্বা করলেন। অতঃপর রুকূ করলেন। রুকূ’তে কিয়ামের সমপরিমাণ সময় অবস্থান করলেন। অতঃপর রুকূ’ থেকে মাথা উঠালেন এবং কিয়ামে প্রথম কিরআত অপেক্ষা কিছু ছোট কিরআত পাঠ করলেন। অতঃপর কিয়ামের সমপরিমাণ সময় রুকূ’তে কাটালেন। তারপর রুকূ’ থেকে মাথা উঠিয়ে কিরআত পাঠ করলেন যা পূর্বের কিরআত অপেক্ষা ছোট ছিল। অতঃপর রুকূ’তে গিয়ে কিয়ামের পরিমাণ সময় অতিবাহিত করলেন। এরপর রুকূ’ থেকে মাথা উঠিয়ে সাজদায় গেলেন এবং দুটি সিজদা করলেন। তারপর দাঁড়িয়ে আরো তিনটি রুকূ করলেন যাতে কোন রাকাআত ছিল না। শেষের তিন রুকূ’ এরূপ ছিল যে, প্রত্যেক রুকূ’ পূর্ববর্তী রুকূ’ অপেক্ষা ছোট এবং পরবর্তী রুকূ’ অপেক্ষা দীর্ঘ ছিল। আর প্রতিটি রুকূর সময় সাজদার সমপরিমাণ ছিল। অতঃপর তিনি একটু পিছনে সরে আসলেন আর তার পিছনের সারিগুলোও পিছনে সরে গিয়ে আমরা পৌছে গেলাম। আবূ বকর বলেনঃ মহিলাদের কাতার পর্যন্ত পৌছে গেলেন। অতঃপর তিনি সামনে এগিয়ে গেলেন এবং তার সাথে সব লোক সামনে এগিয়ে গেল। অবশেষে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার নির্দিষ্ট স্থানে দাঁড়িয়ে সালাত শেষ করলেন। এদিকে সূর্য তার পূর্বের অবস্থায় ফিরে এল। সালাত শেষে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উপস্থিত লোকদেরকে সম্বোধন করে বললেন, হে লোক সকল! চন্দ্র ও সূর্য আল্লাহর নিদর্শনসমূহের মধ্যে দুটি নিদর্শন। আর এ দুটি কোন মানুষের মৃত্যুর কারণে গ্রাসপ্রাপ্ত হয় না। আবূ বাকর-এর বর্ণনায় (রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন), \"কোন মানুষের মৃত্যুর কারণে\" (এ দুটি গ্রহণ হয় না)। অতএব, তোমরা যখন এরূপ কিছু ঘটতে দেখ তখন সালাত আদায় কর যে পর্যন্ত সূর্য স্পষ্ট হয়ে না যায়। তোমাদের কাছে যে সব বিষয় সম্পর্কে ওয়াদা করা হয়েছে তার প্রতিটি আমি আমার সালাতের মধ্যে দেখতে পেয়েছি। আমার কাছে জাহান্নাম তুলে ধরা হয়েছে। আর এটা তখন যখন তোমরা আমাকে দেখেছ যে, আমি পিছনে সরে এসেছি এর লেলিহান শিখা আমাকে স্পর্শ করার ভয়ে। অবশেষে আমি জাহান্নামের মধ্যে লৌহশলাকাধারীকে (আমর ইবনু মালিক) দেখলাম, সে জাহান্নামের মধ্যে নিজের নাড়ীভুড়ি টানছে। এ ব্যক্তি নিজ লাঠি দ্বারা হাজ যাত্রীদের মালপত্র চুরি করত। এরপর যদি ধরা পড়ে যেত তখন বলত আহ! আমার শলাকার সাথে লেগে গেছে। আর কেউ অসাবধান থাকলে তা নিয়ে যেত। এছাড়া জাহান্নামের মধ্যে ঐ মহিলাকেও দেখতে পেলাম যে, একটি বিড়ালকে বেঁধে রেখেছিল। এরপর এটাকে আহারও দেয়নি, ছেড়েও দেয়নি, যাতে জমিনের পোকামাকড় খেয়ে জীবন ধারণ করতে পারত। শেষ পর্যন্ত বিড়ালটি ক্ষুধায় ছটফট করে মারা গেল। অতঃপর আমার সামনে জান্নাত তুলে ধরা হয়েছে। আর এটা তখন দৃষ্ট হয়েছে, যখন তোমরা আমাকে দেখতে পেয়েছ যে, আমি সামনে এগিয়ে গেছি এবং নিজস্থানে দাঁড়িয়েছি। আমি আমার হাত প্রসারিত করলাম এবং এর ফল তুলে নেবার ইচ্ছা করলাম যাতে তোমরা তা দেখতে পাও। অতঃপর এরূপ না করাই স্থিরকৃত হ'ল। যেসব বিষয় তোমাদের জানানো হয়েছিল তার প্রতিটি বিষয় আমি আমার এ সালাতে থাকাকালীন দেখতে পেয়েছি। (ইসলামী ফাউন্ডেশন ১৯৭১, ইসলামীক সেন্টার ১৯৭৮)",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		}
	]
}