{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৬, আন্তর্জাতিক নাম্বারঃ ৯৭৪ ২১৪৬-(১০৩/...) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... মুহাম্মাদ ইবনু কায়স (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে বলতে শুনেছি- তিনি বলেন, আমি কি তোমাদেরকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ও আমার তরফ থেকে হাদীস বর্ণনা করে শোনাব না? আমরা বললাম, অবশ্যই! ইমাম মুসলিম (রহঃ) হাজ্জাজ আল আ'ওয়ার (রহঃ) থেকে শুনেছেন ..... জনৈক কুরায়শী আবদুল্লাহ (রহঃ) থেকে মুহাম্মাদ ইবনু কায়স ইবনু মাখরামাহ ইবনুল মুত্ত্বালিব (রহঃ) একদিন আমাকে বলেন, আমি কি তোমাদেরকে আমার পক্ষ থেকে ও আমার আমার আম্মাজান থেকে হাদীস বর্ণনা করে শুনাব? রাবী আবদুল্লাহ বলেন, আমরা ধারণা করলাম তিনি তার জননী মাকে বুঝাচ্ছেন। এরপর তিনি বললেন, \"আয়িশাহ (রাযিঃ) বলেছেন, আমি কি তোমাদের আমার পক্ষ থেকে ও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করে শুনাব? আমরা বললাম, হ্যাঁ অবশ্যই। তিনি বলেন, যখন ঐ রাত আসত যে রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে থাকতেন। তিনি এসে তার চাদর রেখে দিতেন, জুতা খুলে পায়ের কাছে রাখতেন। পরে নিজ তহবন্দের (লুঙ্গি) একদিক বিছানায় বিছিয়ে কাত হয়ে শুয়ে পড়তেন। অতঃপর মাত্র কিছু সময় যতক্ষণে তিনি ধারণা করতেন যে, আমি ঘুমিয়ে পড়েছি, বিশ্রাম গ্রহণ করতেন। অতঃপর উঠে ধীরে ধীরে নিজ চাদর নিতেন এবং জুতা পরিধান করতেন। পরে আস্তে আস্তে দরজা খুলে বেরিয়ে পড়তেন। অতঃপর কিছু সময় নিজেকে আত্মগোপন করে রাখতেন। একদিন আমি আমার জামা মাথার উপর স্থাপন করে তা দিয়ে মাথাটা ঢেকে লুঙ্গি পরিধান করে, অতঃপর তার পেছনে রওয়ানা হলাম। যেতে যেতে তিনি বাকী’তে\" (কবরস্থানে) পৌছলেন। তথায় তিনি দীর্ঘ সময় দাঁড়িয়ে থাকলেন। অতঃপর তিনি তিনবার হাত উঠিয়ে দু'আ করলেন। এবার গৃহের দিকে ফিরে রওয়ানা করলে আমিও রওয়ানা হলাম। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) দ্রুত রওয়ানা করলে আমিও দ্রুত চলতে লাগলাম। তাকে আরও দ্রুত পদক্ষেপে এগিয়ে আসতে দেখে আমি আরও দ্রুত চলতে লাগলাম। এরপর আমরা দৌড়াতে আরম্ভ করলে আমি দৌড়ে তার আগেই ঘরে ঢুকে পড়লাম এবং বিলম্ব না করে শুয়ে পড়লাম। একটু পরে তিনি গৃহে প্রবেশ করে আমাকে জিজ্ঞেস করলেন, হে আয়িশাহ! তোমার কি হল? কেন হাপিয়ে পড়েছ? আয়িশাহ (রাযিঃ) বলেন, আমি জবাব দিলাম না, তেমন কিছু না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হয় তুমি নিজে আমাকে ব্যাপারটা খুলে বলবে নতুবা মহান আল্লাহ আমাকে তা জানিয়ে দিবেন। আমি বললাম, হে আল্লাহর রসূল! আপনার ওপর আমার মাতা-পিতা কুরবান হোক। এরপর তাকে ব্যাপারটা জানিয়ে দিলাম। তিনি বললেন, তুমিই সে কালো ছায়াটি যা আমি আমার সামনে দেখছিলাম। আমি বললামঃ জী হ্যাঁ। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমার বুকে একটা থাপ্পড় মারলেন যাতে আমি ব্যথা পেলাম। অতঃপর বললেন, তুমি কি ধারণা করেছ আল্লাহ ও তার রসূল তোমার ওপর অবিচার করবেন? আয়িশাহ (রাযিঃ) বলেন, যখনই মানুষ কোন কিছু গোপন করে, আল্লাহ তা অবশ্যই জানেন। হ্যাঁ অবশ্যই জানেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন তুমি আমাকে দেখেছ এ সময় আমার কাছে জিবরীল (আঃ) এসেছিলেন এবং আমাকে ডাকছিলেন। অবশ্য তা তোমার কাছে গোপন রাখা হয়েছে। আর আমিও তা গোপন রাখা বাঞ্ছনীয় মনে করে তোমার নিকট গোপন রেখেছি। যেহেতু তুমি তোমার কাপড় রেখে দিয়েছ, তাই তিনি তোমার কাছে আসেননি। আমি ভেবেছিলাম তুমি ঘুমিয়ে পড়েছ তাই তোমাকে জাগানো সমীচীন মনে করিনি। আর আমি আশঙ্কা করছিলাম যে, তুমি ভীত বিহ্বল হয়ে পড়বে। এরপর জিবরীল (আঃ) বললেন, আপনার প্রভু আপনার প্রতি আদেশ করছেন, বাকী'র কবরবাসীদের নিকট গিয়ে তাদের জন্য দু'আ ইসতিগফার করতে। আয়িশাহ (রাযিঃ) বলেন, আমি জিজ্ঞেস করলাম, হে আল্লাহর রসূল! আমি তাদের জন্য কীভাবে দু'আ করব? তিনি বললেনঃ তুমি বল, \"এ বাসস্থানের অধিবাসী ঈমানদার মুসলিমদের প্রতি সালাম বর্ষিত হোক। আমাদের মধ্য থেকে যারা আগে বিদায় গ্রহণ করেছে আর যারা পিছনে বিদায় নিয়েছে সবার প্রতি আল্লাহ দয়া করুন। আল্লাহ চাহে তো আমরাও তোমাদের সাথে মিলিত হব*। (ইসলামী ফাউন্ডেশন, ২১২৫, ইসলামীক সেন্টার ২১২৮) * বাকী হচ্ছে মদীনার নিকটবর্তী একটি কবরস্থান যেখানে অনেক সাহাবীর কবর রয়েছে। রয়েছে অনেক কাফরের ও সাধারণ মুসলিমের কবর। আমাদের দেশে এটি জান্নাতুল বাকী' নামে পরিচিত। কিন্তু আসলে এটি একটি ভুল কারণ, এটির আসল নাম হচ্ছে বাকী'উল গারকাদ। জান্নাতুল বাকী বলা ঠিক নয়।",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		}
	]
}