{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2304,
			"arabicnumber": "94.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৯৪, আন্তর্জাতিক নাম্বারঃ ৯৪ ২১৯৪-(৩২/৯৪) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ, ইবনু নুমায়র ও আবূ কুরায়ব (রহঃ) ..... আবূ যার (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা দুপুরের পর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে মদীনার কঙ্করময় মাঠ দিয়ে চলছিলাম এবং আমরা উহুদ পাহাড়ের দিকে তাকাচ্ছিলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ “যদি এ উহুদ পাহাড় আমার জন্য স্বর্ণে পরিণত হয় তাহলে তিনদিন অতিবাহিত হওয়ার পর ঋণ পরিশোধ করার পরিমাণ অর্থ ছাড়া অতিরিক্ত একটি দীনারও আমার কাছে অবশিষ্ট থাক তা আমি পছন্দ করি না। তা আমার হস্তগত হলে আমি আল্লাহর বান্দাদের মধ্যে এভাবে বণ্টন করে দিব। তিনি সামনের দিকে, ডানে এবং বামে হাতের ইঙ্গিতে এক এক ভরা মুঠ দেখালেন। বর্ণনাকারী বলেন, এরপর আমরা আবার অগ্রসর হলাম। তিনি আবার বললেন, হে আবূ যার! আমি বললাম, 'হে আল্লাহর রসূল! আমি হাজির আছি। তিনি বললেন, কিয়ামতের দিন অঢেল সম্পদের মালিকেরা কম সাওয়াব লাভ করবে। তবে যারা সৎপাত্রে যথোচিতভাবে এভাবে দান করবে তাদের সাওয়াব কোন অংশেই কম হবে না। তিনি মুষ্ঠিভরে পূর্বের ন্যায় ইঙ্গিত করে দেখালেন। বর্ণনাকারী বলেন, আমরা চলতে থাকলাম। কিছু দূর অগ্রসর হলে তিনি বললেন, হে আবূ যার! তুমি এখানে অপেক্ষা কর এবং আমার ফিরে না আসা পর্যন্ত কোথাও যাবে না। বর্ণনাকারী বলেন, তিনি চলে গেলেন এবং আমার দৃষ্টির আড়াল হয়ে গেলেন। তারপর আমি কিছু গোলমাল ও শব্দ শুনতে পেয়ে মনে করলাম, বোধ হয় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শত্রু দ্বারা আক্রান্ত হয়েছেন। আমি তাকে খোজার জন্য মনস্থ করলাম। কিন্তু সাথে সাথে এ স্থান ত্যাগ না করার জন্য তার নির্দেশ আমার মনে পড়ে গেল। তাই আমি অপেক্ষা করতে লাগলাম। অতঃপর তিনি ফিরে আসলে আমি যা কিছু শুনেছিলাম তা তাকে জানালাম। তিনি বললেন, তুমি যার শব্দ শুনেছো তিনি ছিলেন জিবরীল। তিনি আমার কাছে এসেছিলেন এবং আমাকে বলেছেন, “আপনার উম্মাতের মধ্যে যে ব্যক্তি আল্লাহর সাথে কোন প্রকার শির্ক না করা অবস্থায় মারা যাবে সে জান্নাতে প্রবেশ করবে। বর্ণনাকারী বলেন, আমি বললাম, যদি সে যিনা করে এবং চুরি করে (তবুও কি) তিনি বললেন, যদিও সে যিনা করে এবং চুরি করে তবুও। (ইসলামিক ফাউন্ডেশন ২১৭৩, ইসলামীক সেন্টার ২১৭৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		}
	]
}