{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": "1017.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২২৪১, আন্তর্জাতিক নাম্বারঃ ১০১৭ ২২৪১-(৬৯/১০১৭) মুহাম্মাদ ইবনুল মুসান্না আল আনাযী (রহঃ) ..... মুনযির ইবনু জারীর থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেছেন, আমরা ভোরের দিকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত ছিলাম। এ সময় তার কাছে পাদুকাবিহীন, বস্ত্রহীন, গলায় চামড়ার আবা পরিহিত এবং নিজেদের তরবারি ঝুলন্ত অবস্থায় একদল লোক আসল। এদের অধিকাংশ কিংবা সকলেই মুযার গোত্রের লোক ছিল। অভাব অনটনে তাদের এ করুণ অবস্থা দেখে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখমণ্ডল পরিবর্তিত ও বিষন্ন হয়ে গেল। তিনি ভিতরে প্রবেশ করলেন, অতঃপর বেরিয়ে আসলেন। তিনি বিলাল (রাযিঃ) কে আযান দিতে নির্দেশ দিলেন। বিলাল (রাযিঃ) আযান ও ইকামাত দিলেন। সালাত (সালাত/নামাজ/নামায) শেষ করে তিনি উপস্থিত মুসল্লীদের উদ্দেশে ভাষণ দিলেন এবং এ আয়াত পাঠ করলেনঃ “হে মানব জাতি! তোমরা নিজেদের প্রতিপালককে ভয় কর যিনি তোমাদেরকে একটি মাত্র ব্যক্তি থেকে আদম (আঃ) থেকে সৃষ্টি করেছেন। ..... নিশ্চয়ই আল্লাহ তা'আলা তোমাদের রক্ষণাবেক্ষণকারী\"- (সূরা আন নিসা ৪ঃ ১)। অতঃপর তিনি সূরা হাশরের শেষের দিকের এ আয়াত পাঠ করলেনঃ “হে ঈমানদারগণ! তোমরা আল্লাহকে ভয় কর। প্রত্যেক ব্যক্তি যেন ভবিষ্যতের জন্য কী সঞ্চয় করেছে সেদিকে লক্ষ্য করে\"- (সুরাহ আল হাশর ৫৯ঃ ১৮)। অতঃপর উপস্থিত লোকদের কেউ তার দীনার, কেউ দিরহাম, কেউ কাপড়, কেউ এক সা' আটা ও কেউ এক সা খেজুর দান করল। অবশেষে তিনি বললেন, অন্ততঃ এক টুকরা খেজুর হলেও নিয়ে আসো। বর্ণনাকারী বলেন, আনসার সম্পপ্রদায়ের এক ব্যক্তি একটি বিরাট থলি নিয়ে আসলেন। এর ভারে তার হাত অবসাদগ্ৰস্ত হয়ে যাচ্ছিল কিংবা অবশ হয়ে গেল। রাবী আরো বলেন, অতঃপর লোকেরা সারিবদ্ধভাবে একের পর এক দান করতে থাকল। ফলে খাদ্য ও কাপড়ের দু'টি স্তুপ হয়ে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চেহারা মুবারক খাটি সোনার ন্যায় উজ্জ্বল হয়ে হাসতে লাগল। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে ব্যক্তি ইসলামের মধ্যে কোন উত্তম প্রথা বা কাজের প্রচলন করে সে তার এক কাজের সাওয়াব পাবে এবং তার পরে যারা তার এ কাজ দেখে তা করবে সে এর বিনিময়েও সাওয়াব পাবে। তবে এতে তাদের সাওয়াব কোন অংশে কমানো হবে না। আর যে ব্যক্তি ইসলামের মধ্যে (ইসলামের পরিপন্থী) কোন খারাপ প্রথা বা কাজের প্রচলন করবে, তাকে তার এ কাজের বোঝা (গুনাহ এবং শাস্তি) বহন করতে হবে। তারপর যারা তাকে অনুসরণ করে এ কাজ করবে তাদের সমপরিমাণ বোঝাও তাকে বইতে হবে। তবে এতে তাদের অপরাধ ও শাস্তি কোন অংশেই কমবে না। (ইসলামিক ফাউন্ডেশন ২২২০, ইসলামীক সেন্টার ২২২১)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		}
	]
}