{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2436,
			"arabicnumber": "1059.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩২৬, আন্তর্জাতিক নাম্বারঃ ১০৫৯ ২৩২৬-(১৩২/১০৫৯) হারমালাহ ইবনু ইয়াহইয়া আত তুজীবী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। হুনায়নের দিনে আল্লাহ তা'আলা তার রসূলকে বিনা যুদ্ধে হাওয়াযিন গোত্রের ধন-সম্পদ থেকে যা (গনীমাত হিসেবে) দান করেছিলেন এ থেকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরায়শদের কয়েকজন লোককে একশ' উট প্রদান করলেন। আনসারদের মধ্যে কয়েক ব্যক্তি বলল, “আল্লাহ তার রসূলকে ক্ষমা করুন, তিনি আমাদের না দিয়ে কুরায়শদের দিচ্ছেন। অথচ আমাদের তরবারি থেকে এখনও তাদের রক্ত করছে।\" আনাস ইবনু মালিক (রাযিঃ) বলেন, এ খবর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পৌছলে তিনি আনসারদের ডেকে পাঠালেন। তিনি একটি চামড়ার তাঁবুতে তাদের একত্রিত করলেন। তারা জড়ো হলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে বললেন, তোমাদের পক্ষ থেকে আমার কাছে যে কথা পৌছেছে তার মানে কী? আনসারদের মধ্যে থেকে বুদ্ধিমান ব্যক্তিগণ বললেন, হে আল্লাহর রসূল! আমাদের মধ্যে যারা বুদ্ধিমান ও অভিজ্ঞ তারা তো কিছুই বলেনি। তবে আমাদের মধ্যে যারা কম বয়সী তারা বলেছেন- আল্লাহ তা'আলা তার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ক্ষমা করুন, তিনি আমাদের না দিয়ে কুরায়শদের দিচ্ছেন। অথচ এখনো আমাদের তরবারি থেকে তাদের রক্ত টপকে পড়ছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ \"আমি এমন লোকদের দিয়ে থাকি যারা সেদিনও কাফির ছিল যাতে তাদের মন সন্তুষ্ট (ও ইসলামের দিকে আকৃষ্ট) থাকে। তোমরা কি এতে সন্তুষ্ট নও যে, তারা (গনীমতের) মাল নিয়ে তাদের ঘরে চলে যাবে আর তোমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সাথে নিয়ে ঘরে যাবে? আল্লাহর শপথ! ওরা যা নিয়ে ঘরে ফিরবে তার চেয়ে উত্তম হচ্ছে তোমরা যা নিয়ে ঘরে ফিরবে। সাহাবীগণ বললেন, হে আল্লাহর রসূল! আমরা যা নিচ্ছি তাই উত্তম এবং আমরা সন্তুষ্ট আছি। পুনরায় তিনি বললেন, ভবিষ্যতেও এভাবে তোমাদের উপর অন্যদের (দানের ব্যাপারে) প্রাধান্য দেয়া হবে। তখন তোমরা আল্লাহ ও তার রসূলের সাথে সাক্ষাৎ করা পর্যন্ত ধৈর্য ধারণ করবে এবং হাওযে কাওসারের কাছে থাকবে। তারা বললেন, এখন থেকে আমরা ধৈর্য ধারণ করব। (ইসলামিক ফাউন্ডেশন ২৩০৪, ইসলামীক সেন্টার ২৩০৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 173
			}
		}
	]
}