{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2441,
			"arabicnumber": "1059.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৩১, আন্তর্জাতিক নাম্বারঃ ১০৫৯ ২৩৩১-(১৩৫/...) মুহাম্মাদ ইবনুল মুসান্না ও ইবরাহীম ইবনু মুহাম্মাদ ইবনু আর'আরাহ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, হুনায়নের যুদ্ধে হাওয়াযিন, গাতফান ও অন্যান্য গোত্রের লোকেরা তাদের সন্তান-সন্ততি ও গবাদি পশু নিয়ে এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশ হাজারের এক বিরাট বাহিনী এবং মক্কার (মক্কা) তুলাকাদের নিয়ে সম্মুখ যুদ্ধে অবতীর্ণ হলেন। তুমুল যুদ্ধের মুখে এরা সবাই পিছে হটে গেল এবং (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একা যুদ্ধ ক্ষেত্রে রয়ে গেলেন। সেদিন তিনি দু'টি ডাক দিলেন কিন্তু এর মাঝখানে কোন কথা বলেননি। প্রথমে তিনি ডান দিকে ফিরে ডাক দিয়ে বললেনঃ “হে আনসার সম্প্রদায়”! তারা তাকে সাড়া দিয়ে বললেন, হে আল্লাহর রসূল! আমরা আপনার সাথেই আছি- আপনি এ সুসংবাদ গ্রহণ করুন। অতঃপর তিনি বাম দিকে ফিরে পুনরায় ডেকে বললেনঃ হে আনসার সম্প্রদায়! তারা ডাকে সাড়া দিয়ে বললেনঃ হে আল্লাহর রসূল! আমরা আপনার সাথেই আছি, আপনি সুসংবাদ গ্রহণ করুন। বর্ণনাকারী বলেন, এ সময় তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সাদা বর্ণের একটি খচ্চরের পিঠে উপবিষ্ট ছিলেন। অতঃপর তিনি নীচে নেমে এসে বললেন, \"আমি আল্লাহর বান্দা ও তার রসূল! মুশরিকরা পরাজিত হলো, গনীমাতের অনেক মাল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হস্তগত হলো। তিনি এসব মাল মুহাজির ও তুলাকাদের মধ্যে বণ্টন করে দিলেন। তিনি আনসারদের এ থেকে কিছুই দিলেন না। এতে অসন্তুষ্ট হয়ে আনসারগণ বললেন, “বিপদের সময় আমাদের ডাকা হয়, আর গনীমাত বণ্টনের সময় মজা লুটে অন্যরা। তাদের এ উক্তি তার কানে গিয়ে পৌছল। তিনি তাদেরকে একটি তাবুর নীচে একত্র করে বললেন, হে আনসার সম্পদ্রায়! তোমাদের পক্ষ থেকে কী কথা আমার কাছে পৌছেছে? তারা সবাই নীরব হয়ে গেলেন। তিনি বলেন, হে আনসার সম্প্রদায়! তোমরা কি এতে খুশী নও যে, অন্যান্য লোক দুনিয়া নিয়ে ঘরে ফিরবে আর তোমরা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সঙ্গে নিয়ে ঘরে ফিরবে? তারা (উত্তরে) বললেন, হে আল্লাহর রসূল! আমরা এতে খুশী আছি। রাবী বলেন, অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, “যদি অন্য লোকেরা এক গিরিপথের দিকে যায় আর আনসারগণ অন্য গিরিপথে চলে তাহলে আমি আনসারদের পথই অনুসরণ করব। বর্ণনাকারী হিশাম বলেন, আমি আনসারকে জিজ্ঞেস করলাম, হে আবূ হামযাহ! আপনি কি তখন উপস্থিত ছিলেন। তিনি বললেন, আমি তাকে ছেড়ে কোথায় যাব?” (ইসলামিক ফাউন্ডেশন ২৩০৯, ইসলামীক সেন্টার ২৩১০)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 178
			}
		}
	]
}