{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2456,
			"arabicnumber": "1064.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৪৬, আন্তর্জাতিক নাম্বারঃ ১০৬৪ ২৩৪৬–(১৪৮/...) আবূ ত্বহির, হারমালাহ ইবনু ইয়াহইয়া ও আহমাদ ইবনু আবদুর রহমান আল ফিহরী (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত ছিলাম এবং তিনি কিছু জিনিস বণ্টন করছিলেন। এমন সময় বানী তামীম গোত্রের যুল-খুওয়াই সিরাও নামক এক ব্যক্তি এসে বলল, হে আল্লাহর রসূল! ইনসাফ করুন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হতভাগ্য, তোমার জন্য আফসোস! আমি যদি ইনসাফ না করি, তাহলে কে ইনসাফ করবে? আমি যদি ইনসাফ না করি তাহলে তুমি তো ক্ষতিগ্রস্ত ও বিফল হয়ে যাবে। অতঃপর উমর ইবনুল খাত্ত্বাব (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমাকে তার শিরোশ্ছেদ করার অনুমতি দিন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে ছেড়ে দাও, কেননা তার এমন কিছু সঙ্গী সাথি রয়েছে যাদের সালাত (সালাত/নামাজ/নামায) সিয়ামের তুলনায় তোমাদের সালাত (সালাত/নামাজ/নামায) সিয়াম (রোজা/রোযা) নিম্নমানের বলে মনে হয়। তারা কুরআন পাঠ করবে অথচ তা তাদের কণ্ঠনালী অতিক্রম করবে না। তীর যেভাবে শিকার ভেদ করে বেরিয়ে যায়। তারাও সেভাবে ইসলাম থেকে বেরিয়ে যাবে। অতঃপর সে (ধনুকধারী) তীরের ফলার মূলভাগ পরীক্ষা করে দেখে। এতেও সে কিছুই দেখতে পায় না, তারপর সে তীর পরীক্ষা করে দেখে এতেও সে দেখে না। অবশেষে সে তীরের পালক পরীক্ষা করে দেখে এতেও সে কিছু পায় না, তীর এত দ্রুত গতিতে বেরিয়ে যায় যে, রক্ত বা মলের দাগ এতে লাগতে পারে না। এ সম্প্রদায়কে চেনার উপায় হলো, এদের মধ্যে এমন এক ব্যক্তির আবির্ভাব হবে যার এক বাহুতে মহিলাদের স্তনের ন্যায় একটি অতিরিক্ত মাংসপেশী থাকবে এবং তা থলথল করতে থাকবে। এদের আবির্ভাব এমন সময় হবে যখন মানুষের মধ্যে বিরোধ দেখা দেবে। আবূ সাঈদ (রাযিঃ) বলেন, আমি সাক্ষ্য দিচ্ছি যে, এ কথা আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে শুনেছি এবং আমি আরো সাক্ষ্য দিচ্ছি যে, আলী ইবনু আবূ তলিব (রাযিঃ) তাদের সাথে যখন যুদ্ধ করেছিলেন, আমি স্বয়ং তার সাথে ছিলাম। অতঃপর তিনি উল্লেখিত ব্যক্তিকে খুঁজে বের করে আনার জন্য নির্দেশ দিলেন। তাকে খুঁজে পাওয়া গেল এবং ‘আলীর সামনে উপস্থিত করা হলো। আমি তাকে প্রত্যক্ষ করে দেখলাম তার মধ্যে সব চিহ্ন ও বৈশিষ্ট্য বিদ্যমান রয়েছে যা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সম্বন্ধে বলেছেন। (ইসলামিক ফাউন্ডেশন ২৩২৪, ইসলামীক সেন্টার ২৩২৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 193
			}
		}
	]
}