{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2467,
			"arabicnumber": "1066.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৫৭, আন্তর্জাতিক নাম্বারঃ ১০৬৬ ২৩৫৭-(১৫৬/...) আবদ ইবনু হুমায়দ (রহঃ) ..... যায়দ ইবনু ওয়াহব আল জুহানী থেকে বর্ণিত। যে সৈন্যদল আলী (রাযিঃ) এর সাথে খারিজীদের বিরুদ্ধে অভিযান চালিয়েছিল- তিনি তাদের সাথে উপস্থিত ছিলেন। আলী (রাযিঃ) বললেন, হে লোক সকল! আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ “আমার উম্মাতের মধ্যে এমন এক সম্প্রদায়ের আবির্ভাব ঘটবে যারা কুরআন পাঠ করবে। তোমাদের পাঠ তাদের পাঠের তুলনায় নিম্নমানের হবে। অনুরূপভবে তাদের সালাত ও সিয়ামের তুলনায় তোমাদের সালাত-সিয়াম (রোজা/রোযা) সামান্য বলে মনে হবে। কুরআন পাঠ করে তারা ধারণা করবে এতে তাদের খুব লাভ হচ্ছে। অথচ এটা তাদের জন্য ক্ষতির কারণই হবে। তাদের সালাত (সালাত/নামাজ/নামায) তাদের কণ্ঠনালী অতিক্রম করবে না। তারা ইসলাম থেকে এমনভাবে বেরিয়ে যাবে যেমনটি তীর বেরিয়ে যায় শিকার থেকে। আর যে সৈন্যদল তাদের বিরুদ্ধে অভিযান চালাবে তারা যদি তাদের নীরব মাধ্যমে কৃত ওয়াদা সম্পর্কে জানতে পারত তাহলে তারা এক কাজের (পুরস্কারের) উপরই ভরসা করে বসে থাকত। সে দলের চিহ্ন হলো- তাদের মধ্যে এমন এক লোক থাকবে যার বাহুর অগ্রভাবে স্ত্রী লোকের স্তনের বোটার ন্যায় একটি মাংসপেশী থাকবে। এর উপর সাদা পশম থাকবে। আলী (রাযিঃ) বলেন, অতএব তোমরা মু'আবিয়াহ ও সিরিয়ার অধিবাসীদের বিরুদ্ধে অভিযানে যাচ্ছো। অপরদিকে তোমরা নিজেদের সন্তান-সন্ততি ও ধন-সম্পদের পিছনে এদেরকে (খারিজী) রেখে যাচ্ছ। আল্লাহর শপথ! আমার বিশ্বাস এরাই হচ্ছে সেই সম্প্রদায় (যাদের বিরুদ্ধে অস্ত্র ধারণ করার ব্যাপারে তোমাদের নির্দেশ দেয়া হয়েছে)। কেননা এরা অবৈধভাবে রক্তপাত ঘটিয়েছে এবং মানুষের গবাদি পশু লুট করেছে। সুতরাং আল্লাহর নাম নিয়ে যাত্রা শুরু কর। সালামাহ্ ইবনু কুহায়ল বলেন, অতঃপর যায়দ ইবনু ওয়াহব (রাযিঃ) প্রতিটি মঞ্জিলের বর্ণনাই আমাকে দিয়েছেন। এমনকি তিনি বলেছেন, “আমরা একটি পুলের উপর দিয়ে অতিক্রম করে খারিজীদের মুখোমুখী হলাম। এ দিন আবদুল্লাহ ইবনু ওয়াহব আর রাসিবী খারিজীদের সেনাপতি ছিলেন। সে তাদেরকে বলল, তোমরা বল্লম ফেলে দিয়ে খাপ থেকে তরবারি বের কর। কেননা আমার আশঙ্কা হচ্ছে, তার হারূরার দিনের ন্যায় আজও তোমাদের উপর চরম আঘাত হানবে। সুতরাং তারা ফিরে গিয়ে বল্লম ফেলে দিয়ে তরবারি খাপ থেকে বের করে নিল। লোকজন বল্লম নিয়ে তাদের বিরুদ্ধে অবতীর্ণ হল। তারা একের পর এক নিহত হতে থাকল। সেদিন আলী (রাযিঃ) এর দল থেকে মাত্র দু'জন লোক নিহত হলো। অতঃপর ‘আলী (রাযিঃ) বললেন, তোমরা এদের মধ্যে থেকে সে বিকলাঙ্গ ব্যক্তিকে খুঁজে বের কর। অতঃপর তারা তাকে খুঁজে পেল না। তখন আলী (রাযিঃ) নিজেই দাঁড়ালেন এবং নিহতদের কাছে গিয়ে লাশগুলো সরাবার নির্দেশ দিলেন। তিনি তাকে জমিনের উপর পড়ে থাকা অবস্থায় দেখতে পেয়ে- “আল্লাহু আকবার\" বলে উঠলেন। অতঃপর তিনি পুনরায় বললেন, “আল্লাহ তা'আলা সত্য কথাই বলেছেন এবং তাঁর রসূল সঠিক সংবাদই পৌছিয়েছেন।” রাবী বলেন, এরপর আবীদাহ আস্ সালমানী তার কাছে দাঁড়িয়ে বললেন, হে আমীরুল মুমিনীন সে মহান আল্লাহর শপথ যিনি ছাড়া অন্য কোন মা'বূদ নেই। আমিও এ হাদীসটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে শুনেছি। এভাবে তিনি (‘আলী) তিনবার শপথ করে আবদাহ্ আস্ সালমানীকে একই কথার পুনরাবৃত্তি করলেন। (ইসলামিক ফাউন্ডেশন ২৩৩৫, ইসলামীক সেন্টার ২৩৩৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 204
			}
		}
	]
}