{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2919,
			"arabicnumber": "1211.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৮০৯, আন্তর্জাতিক নাম্বারঃ ১২১১ ২৮০৯-(১২০/...) সুলায়মান ইবনু উবায়দুল্লাহ আবূ আইয়্যুব আল গয়লানী (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা কেবল হাজের (হজ্জের/হজের) উদ্দেশে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে রওনা হলাম। আমরা যখন সারিফ নামক স্থানে পৌছলাম, আমার মাসিক ঋতু শুরু হয়ে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট এলেন এবং আমি তখন কাঁদছিলাম। তিনি বললেন, তুমি কাঁদছ কেন? আমি বললাম, আল্লাহর কসম! আমি যদি এ বছর হাজ্জ করতে না আসতাম। তিনি বললেন, কী হয়েছে তোমার? সম্ভবতঃ তুমি ঋতুবতী হয়েছো? আমি বললাম, হ্যাঁ। তিনি বললেন, আল্লাহ তা'আলা এটা আদম (আঃ) এর কন্যাদের জন্য নির্ধারণ করে দিয়েছেন। তুমি হাজ পালনকারীগণ যা করে, তাই কর কিন্তু পবিত্র না হওয়া পর্যন্ত বায়তুল্লাহ তওয়াফ করো না। আয়িশাহ (রাযিঃ) বলেন, আমি যখন মক্কায় (মক্কায়) পৌছলাম রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাহাবীগণের বললেন, তোমরা উমরার জন্য ইহরাম বাঁধ। যাদের সাথে হাদী বা কুরবানীর পশু ছিল, তারা ব্যতীত সকলে উমরার ইহরাম বাঁধল। আয়িশাহ (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবূ বাকর (রাযিঃ), 'উমার (রাযিঃ) ও অন্যান্য স্বচ্ছল লোকদের সাথে কুরবানীর পশু (হাদী) ছিল, তারা (ইতোপূর্বে যারা ইহরাম খুলে ফেলেছিল, মিনার দিকে) অগ্রসর হবার প্রাক্কালে পুনরায় (হাজ্জের (হজ্জের/হজের)) ইহরাম বাঁধল। তিনি বলেন, আমি কুরবানীর দিন পবিত্র হলাম এবং আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশে তওয়াফে ইফাযাহ্* করলাম। আমাদের জন্য গরুর গোশত পাঠানো হল। আমি জিজ্ঞেস করলাম, এগুলো কী? তারা বলল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সহধর্মিণীদের পক্ষ থেকে একটি গরু কুরবানী করেছেন। যখন হাসবার রাত এলো, আমি বললাম, হে আল্লাহর রসূল! লোকেরা হাজ্জ ও উমরাহ পালন করে প্রত্যাবর্তন করছে, আর আমি শুধু হজ্জ করে প্রত্যাবর্তন করছি। রাবী বলেন, তিনি বলেন, তিনি আবদুর রহমান ইবনু আবূ বাকর (রাযিঃ) কে নির্দেশ দিলেন এবং তদনুযায়ী তিনি আমাকে তার উটের পেছন দিকে বসিয়ে রওনা হলেন। আয়িশাহ (রাযিঃ) বলেন, আমি ছিলাম অল্প বয়স্কা এবং আমার মনে আছে যে, তন্দ্রাচ্ছন্ন হয়ে আমার মাথা বারবার পালানের খুঁটির সাথে আঘাত খাচ্ছিল। এভাবে আমরা তানঈম পৌছলাম। সেখান থেকে আমি আবার উমরার ইহরাম বাঁধলাম- যা লোকেরা ইতোপূর্বে আদায় করেছে। (ইসলামিক ফাউন্ডেশন ২৭৮৬, ইসলামীক সেন্টার ২৭৮৪) * ত্বওয়াফে যিয়ারাত, যা ১০ই অন্যথায় ১১ ও ১২ তারিখে আদায় করতে হয়। এটি ফারয (ফরয) ও হাজ্জের একটি রুকন।",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 128
			}
		}
	]
}