{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2982,
			"arabicnumber": "1227",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৮৭২, আন্তর্জাতিক নাম্বারঃ ১২২৭ ২৮৭২-(১৭৪/১২২৭) আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স (রহঃ) ..... 'আবদুল্লাহ ইবনু উমার (রাযিঃ) বলেন, বিদায় হাজ্জে (হজ্জে/হজে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তামাত্তু করেছেন, প্রথমে উমরাহ ও পরে হাজ্জ (হজ্জ/হজ) করেছেন এবং পশু কুরবানী করেছেন। তিনি যুল হুলায়ফাহ থেকে সাথে করে কুরবানীর পশু নিয়েছিলেন। এখান থেকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রথমে 'উমরার, অতঃপর হাজ্জের (হজ্জের/হজের) তালবিয়াহ্ পাঠ শুরু করেন। লোকেরাও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুসরণে হাজ্জের (হজ্জের/হজের) সাথে উমরাহ যুক্ত করে তামাত্তু করেছে। কতক লোকেরা কুরবানীর পশু সাথে নিয়েছিল, আর কতকের কুরবানীর পশু ছিল না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা (মক্কা)-তে উপনীত হয়ে লোকদের উদ্দেশে বললেন, তোমাদের মধ্যে যাদের সাথে কুরবানীর পশু আছে, হাজ্জ শেষ না করা পর্যন্ত তাদের জন্য (সাময়িকভাবে) নিষিদ্ধ কোন জিনিস হালাল হবে না। আর তোমাদের মধ্যে যাদের সাথে কুরবানীর পশু নেই- তারা যেন বায়তুল্লাহ-এর তাওয়াফ ও সাফা-মারওয়ার মাঝে সাঈ করে মাথার চুল খাটো করার পর ইহরাম খুলে ফেলে। অতঃপর তারা (৮ যিলহাজ্জ) পুনরায় হাজ্জের (হজ্জের/হজের) জন্য ইহরাম বাঁধবে এবং (নির্দিষ্ট দিনে) কুরবানী করবে। কোন ব্যক্তি কুরবানীর পশু না পেলে হাজ্জ চলাকালীন সময়ে তিনদিন এবং বাড়িতে ফেরার পর সাতদিন সওম পালন করবে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় (মক্কায়) পৌছে প্রথমে রুকনে (হাজারে আসওয়াদ) স্পর্শ করলেন, অতঃপর বায়তুল্লাহ এর তাওয়াফ করলেন- তিন চক্কর সামান্য দ্রুতগতিতে এবং চার চক্কর ধীরগতিতে। বায়তুল্লাহ-এর ত্বওয়াফ (তাওয়াফ/তওয়াফ) সমাপ্ত করে তিনি মাকামে ইবরাহীমের নিকট দু' রাকাআত সালাত (সালাত/নামাজ/নামায) আদায় করলেন। অতঃপর সালাম ফিরিয়ে সালাত (সালাত/নামাজ/নামায) শেষ করলেন। অতঃপর তিনি সাফা পাহাড়ে এলেন এবং সাফা-মারওয়াহ পাহাড়দ্বয়ের মাঝে সাতবার সাঈ করলেন। এরপর তিনি কোন জিনিস হালাল করেননি- যা হারাম হয়েছিল (ইহরামের কারণে অর্থাৎ তিনি ইহরামমুক্ত হননি) যে পর্যন্ত না হাজ্জ (হজ্জ/হজ) সমাপন করেন এবং কুরবানীর দিন নিজের পশু কুরবানী না করেন এবং কাবাহ ঘর-এর তাওয়াফ করেছেন। অতঃপর যে সব জিনিস হারাম ছিল, তা তার জন্য হালাল হয়ে গেল (অর্থাৎ তিনি ইহরাম খুললেন) আর যেসব লোক সাথে করে কুরবানীর পশু এনেছিল, তারাও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুরূপ করেছিল। (ইসলামিক ফাউন্ডেশন ২৮৪৮, ইসলামীক সেন্টার ২৮৪৭)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 190
			}
		}
	]
}