{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3237,
			"arabicnumber": "1330",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩১২৮, আন্তর্জাতিক নাম্বারঃ ১৩৩০ ৩১২৮-(৩৯৫/১৩৩০) ইসহাক ইবনু ইবরাহীম ও আবদ ইবনু হুমায়দ (রহিমাহুমাল্লাহ) ..... ইবনু জুরায়জ (রহঃ) বলেন, আমি আতা (রহঃ) কে জিজ্ঞেস করলাম- আপনি কি ইবনু আব্বাস (রাযিঃ) কে বলতে শুনেছেনঃ তোমাদেরকে কেবল ত্বওয়াফের নির্দেশ দেয়া হয়েছে, বায়তুল্লাহর অভ্যন্তরে প্রবেশের নির্দেশ দেয়া হয়নি?” ‘আতা বললেন, ইবনু আব্বাস (রাযিঃ) তো কাবার অভ্যন্তরে প্রবেশ নিষেধ করেননি, বরং আমি তাকে বলতে শুনেছিঃ উসামাহ্ ইবনু যায়দ (রাযিঃ) আমাকে অবহিত করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়তুল্লাহর অভ্যন্তরে প্রবেশ করে এর সকল পাশে দুআ করেছেন কিন্তু বের হওয়া পর্যন্ত কোন সালাত (সালাত/নামাজ/নামায) আদায় করেননি। তিনি বের হয়ে এসে বায়তুল্লাহর দিকে মুখ করে দুরাকাআত সালাত (সালাত/নামাজ/নামায) আদায় করেছেন এবং বলেছেন, এ হল কিবলাহ্। আমি তাকে জিজ্ঞেস করলাম, এর পার্শ্ব বলতে কী বুঝায়? তা দিয়ে কি কোণ বুঝানো হয়েছে? তিনি (আতা) আরও বললেন, এর সমস্ত পার্শ্ব ও কোণই কিবলাহ।* (ইসলামিক ফাউন্ডেশন ৩১০৩, ইসলামীক সেন্টার ৩১০০) * \"এটাই কিবলাহ\" অর্থাৎ কিয়ামাত পর্যন্ত এর দিকে মুখ করে সালাত (সালাত/নামাজ/নামায) আদায় করা হবে। এটা আর রহিত হবে যেরূপভাবে পূর্বে বায়তুল মুকাদ্দাস কিবলাহ ছিল পরে তা রহিত করা হয়। অথবা উদ্দেশ্য এটাও হতে পারে যে, কাবাহ ঘরে ইমাম কোথায় দাঁড়াবে এটা শিখানো। ইমাম যেন এ ঘরের অন্যান্য কোণ বা কিনারায় না দাঁড়ায়। প্রত্যেক দিকেই দাঁড়ায়ে সালাত (সালাত/নামাজ/নামায) আদায় বৈধ হলেও এ কাবাই কিবলাহ্ এর আশেপাশে নির্মিত অন্য কোন মাসজিদ নয়। উপযুক্ত বর্ণনাসমূহের মধ্যে মুহাদ্দিসগণ বিলাল (রাযিঃ) এর বর্ণনা গ্রহণ করেছেন, যে বর্ণনাতে কা'বার অভ্যন্তরে সালাত (সালাত/নামাজ/নামায) আদায়ের কথা বর্ণিত হয়েছে। উসামাহ্ (রাযিঃ) এর বর্ণনা গ্রহণ করেননি। কেননা বিলাল (রাযিঃ) এর বর্ণনায় একটি অতিরিক্ত বিষয় প্রমাণিত হয়। আর ঐ ধরনের ক্ষেত্রে ইতিবাচক বর্ণনা নেতিবাচক বর্ণনার উপর অগ্রাধিকার পায়। আর এখানে যে সালাতে রুকু’সিজদা বিদ্যমান তাই উদ্দেশ্য। এজন্যই ইবনু উমার (রাযিঃ) বলেন, তথায় কয় রাকাআত সালাত (সালাত/নামাজ/নামায) আদায় করা হয়েছিল তা জিজ্ঞেস করতে আমি ভুলে গেছি। আর উসামাহ (রাযিঃ) সালাত (সালাত/নামাজ/নামায) আদায় করতে না দেখার কারণ হতে পারে যে, তিনি দুআ যিকরে মত্ত ছিলেন এবং রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে দূরে অবস্থান করছিলেন। অন্যদিকে বিলাল (রাযিঃ) এর বিপরীত, কেননা স্বয়ং রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে ছিলেন, কা'বার দরজা বন্ধ করায় সেখানে আঁধার নেমেছিল এবং রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সে সালাত (সালাত/নামাজ/নামায) খুব হালকা ছিল। কাবাহ অভ্যন্তরে সালাত (সালাত/নামাজ/নামায) আদায় বিষয়ে আলিমদের মাঝে মতবিরোধ আছে। ইমাম শাফিঈ, সাওরী ও জমহুরের মতে এতে ফারয (ফরয), নাফল, বিতর সকল সালাত (সালাত/নামাজ/নামায)ই আদায় জায়িয আর এটাই শক্তিশালী কথা।",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 441
			}
		}
	]
}