{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3246,
			"arabicnumber": "1333.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩১৩৭, আন্তর্জাতিক নাম্বারঃ ১৩৩৩ ৩১৩৭-(৪০৩/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... হারিস ইবনু আবদুল্লাহ ইবনু আবূ রবী'আহ (রহঃ) থেকে বর্ণিত। ‘আবদুল্লাহ ইবনু উবায়দ বলেন, হারিস ইবনু আবদুল্লাহ প্রতিনিধি হিসেবে ‘আবদুল মালিক ইবনু মারওয়ানের রাজত্বকালে তার নিকট গিয়েছিলেন। আবদুল মালিক বললেন, আমি মনে করি না যে, আবূ যুবায়র অর্থাৎ ইবনু যুবায়র (রাযিঃ) আয়িশাহ (রাযিঃ) এর নিকট এমন কিছু শুনেছেন যার দাবি তিনি করে থাকেন। অর্থাৎ ইবরাহীম (আঃ) এর ভিতের উপর কা'বাহ ঘরের পুনর্নির্মাণের ব্যাপারে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অভিপ্রায় সম্পর্কিত কোন হাদীস তিনি আয়িশাহ (রাযিঃ) এর নিকট শুনেননি। হারিস বলেন, হ্যাঁ, আমি নিজেই তার নিকট এ হাদীস শুনেছি। আবদুল মালিক বললেন, আপনি তাকে কী বলতে শুনেছেন? হারিস বলেন, “আয়িশাহ (রাযিঃ) বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “তোমার কওমের লোকের কা'বাহ ঘরের ভিত (আয়তনে) ছোট করে ফেলেছে। অতীতে তারা শিরক পরিত্যাগ না করলে আমি তাদের পরিত্যক্ত অংশটুকু কা'বার অন্তর্ভুক্ত করে দিতাম। তোমার সম্প্রদায়ের লোকেরা যদি আমার পরে তা পুননির্মাণের পদক্ষেপ গ্রহণ করে, তবে এসো, আমি তোমাকে তাদের পরিত্যক্ত অংশটুকু দেখিয়ে দিই”- অতএব রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আয়িশাহ-কে (হাতীম সংলগ্ন) প্রায় সাত গজ স্থান দেখিয়ে দিলেন। এ হাদীস আবদুল্লাহ ইবনু উবায়দ কর্তৃক বর্ণিত। ওয়ালীদ ইবনু আত্বা এ বর্ণনার উপর আরো বৃদ্ধি করেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “আমি জমিনের সমতলে দুটি দরজাও নির্মাণ করতাম একটি পূর্বদিকে এবং অপরটি পশ্চিম দিকে। তুমি কি জান তোমার গোত্রের লোকেরা কাবার দরজা (ভূমি থেকে) উচুতে স্থাপন করেছে কেন?” আয়িশাহ (রাযিঃ) বলেন, আমি বললাম, না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “গর্ব ও অহংকারের বশবর্তী হয়ে (তারা এটা করেছে) যাতে কেবল সে ব্যক্তিই কা'বার অভ্যন্তরে প্রবেশ করতে পারে যাকে তারা অনুমতি দিবে। যখন কোন ব্যক্তি কা'বার অভ্যন্তরে প্রবেশের ইচ্ছা করত, তারা তাকে সিড়ি বেয়ে উপরে উঠতে দিত। এমনকি সে যখন তাতে প্রবেশ করত, তখন তারা তাকে টেনে নিচে ফেলে দিত।\" 'আবদুল মালিক হারিসকে জিজ্ঞেস করলেন, আপনি কি আয়িশাহ্ (রাযিঃ) কে এ কথা বলতে শুনেছেন? তিনি বললেন, হ্যাঁ। রাবী বলেন, কিছুক্ষণ তিনি হাতের ছড়ি দিয়ে মাটি খুঁড়তে লাগলেন, এরপর বললেনঃ আমি তার (ইবনু যুবায়র) কাজ স্ব অবস্থায় বহাল রাখার আকাঙ্ক্ষা করছি। (ইসলামিক ফাউন্ডেশন ৩১১২, ইসলামীক সেন্টার ৩১০৯)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 450
			}
		}
	]
}