{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3336,
			"arabicnumber": "1374.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩২২৭, আন্তর্জাতিক নাম্বারঃ ১৩৭৪ ৩২২৭-(৪৭৫/১৩৭৪) হাম্মাদ ইবনু ইসমাঈল ইবনু উলাইয়্যাহ্ (রহঃ) ..... আবূ সাঈদ মাওলা আল মাহরী (রহঃ) থেকে বর্ণিত। তারা মদীনায় কষ্ট ও দুঃখে পতিত হন। তিনি আবূ সাঈদ আল খুদরী (রাযিঃ) এর নিকট উপস্থিত হয়ে তাকে বললেন, আমার পরিবারের সদস্য সংখ্যা অনেক এবং আমরা দুঃখ দুর্দশার সম্মুখীন হয়েছি। তাই আমি আমার পরিবারকে কোন শস্য শ্যামল এলাকায় স্থানান্তরের মনস্থ করেছি। আবূ সাঈদ (রাযিঃ) বললেন, তা করো না বরং মদীনাকে আঁকড়ে থাক। কারণ, একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বের হলাম, আমার মনে হয়, তিনি এও বলেছেন যে এবং উসফান পর্যন্ত পৌছলেন। এখানে তিনি কয়েক রাত অবস্থান করলেন। লোকেরা বলল, আল্লাহর কসম আমরা এখানে অযথা সময় নষ্ট করছি। অথচ আমাদের পরিবার পরিজন আমাদের পশ্চাতে নিরাপত্তাহীন অবস্থায় রয়েছে এবং আমরা তাদের (নিরাপত্তার) ব্যাপারে নিশ্চিত হতে পারছি না। এ কথা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে পৌছলে তিনি বলেনঃ কী ব্যাপার, তোমাদের এ কথা আমার নিকটে পৌছেছে। রাবী বলেন, আবূ সাঈদ (রাযিঃ) কথাটা কিভাবে পুনর্ব্যক্ত করেছেন তা আমার হুবহু মনে নেই। সে সত্তার নামে শপথ অথবা সে সত্তার শপথ, যার হাতে আমার প্রাণ! অবশ্য আমি মনস্থ করেছি, অথবা যদি তোমরা চাও- রাবী বলেন, আবূ সাঈদ (রাযিঃ) কোনটি বলেছেন তা আমার সঠিক মনে নেই। তবে আমি নিশ্চিত আমার উষ্ট্রীকে অগ্রসর হবার নির্দেশ দিব এবং মদীনায় পৌছা পর্যন্ত তার একটি গিটও খুলব না। (যাত্রা বিরতি করব না)। অতঃপর তিনি বললেন, “হে আল্লাহ! নিশ্চয় ইবরাহীম (আঃ) মক্কা (মক্কা) কে হারাম ঘোষণা করেছেন এবং তা পবিত্র ও সম্মানিত হয়েছে। আর আমি মদীনাকে হারাম ঘোষণা করলাম- যা দু' পাহাড়ের (আয়র ও উহুদ) মধ্যস্থলে অবস্থিত। অতএব এখানে রক্তপাত করা যাবে না, এখানে যুদ্ধের উদ্দেশে অস্ত্রবহন করা যাবে না এবং পশু খাদ্য হিসেবে ব্যবহারের উদ্দেশ্য ব্যতীত গাছপালার পাতাও পাড়া যাবে না। হে আল্লাহ! আমাদের এ শহরে বারাকাত দান করুন, হে আল্লাহ আমাদের সা’-এ বারাকাত দান করুন, হে আল্লাহ আমাদের মুদ-এ বারাকাত দান করুন, হে আল্লাহ! বারাকাতের সাথে আমাদের আরো দুটি বারাকাত দান করুন।\" সে সত্তার শপথ যার হাতে আমার প্রাণ! মদীনার এমন কোন প্রবেশ পথ বা গিরি পথ, বা পাহাড়ের পথ নেই যেখানে তোমাদের মদীনায় ফিরে আসা পর্যন্ত দু'জন করে মালাক পাহারায় নিযুক্ত নেই। পুনরায় তিনি লোকদের উদ্দেশে বললেন, “তোমরা রওনা হও।\" অতএব আমরা রওনা হলাম এবং মদীনাহ এসে পৌছলাম। সে সত্তার শপথ যার নামে আমরা শপথ করি অথবা যার নামে শপথ করা হয়- হাম্মাদ তাঁর উধ্বতন রাবী কোনটি বলেছেন সে সম্বন্ধে সন্দেহে পড়েছেন। আমরা মদীনাহ প্রবেশ করে বাহনের পিঠের হাওদা তখনও খুলিনি ইত্যবসরে আবদুল্লাহ ইবনু গাতফান গোত্রের লোকেরা আমাদের উপর অতর্কিতে আক্রমণ করে, অথচ ইতোপূর্বে এরূপ কিছু করার দুঃসাহস তাদের হয়নি। (ইসলামিক ফাউন্ডেশন ৩২০২, ইসলামীক সেন্টার ৩১৯৯)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 540
			}
		}
	]
}