{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3415,
			"arabicnumber": "1405.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৩০৬, আন্তর্জাতিক নাম্বারঃ ১৪০৫ ৩৩০৬-(১৫/...) হাসান আল হুলওয়ানী (রহঃ) ..... আত্বা (রহঃ) বলেন, জাবির ইবনু আবদুল্লাহ (রাযিঃ) উমরাহ পালন করতে এলেন। তখন আমরা তার আবাসে তার নিকট গেলাম। লোকেরা তার নিকট বিভিন্ন বিষয়ে জিজ্ঞেস করল। অতঃপর তারা মুত‘আহ সম্পর্কে উল্লেখ করলে তিনি বলেন, হ্যাঁ, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এবং আবূ বাকর (রাযিঃ) ও উমার (রাযিঃ) এর যুগে মুত'আহ (বিবাহ) করেছি।*। (ইসলামিক ফাউন্ডেশন ৩২৮১, ইসলামীক সেন্টার ৩২৭৯) * পরিভাষায় একটি নির্দিষ্ট কালের জন্য মহরের বিনিময়ে কোন মহিলার সাথে বৈবাহিক সম্পর্ক স্থাপন করা। নির্দিষ্ট সময় পার হওয়ার সাথে সাথেই বিবাহের চুক্তি বাতিল গণ্য হয় এবং তলাক (তালাক) প্রদান ব্যতীতই স্ত্রী বিবাহ বন্ধন থেকে মুক্ত হয়ে যায়। ইসলাম আবির্ভাবের পূর্বে আরবদের মাঝে এ ধরনের বিবাহের ব্যাপক প্রচলন ছিল এবং ইসলামের প্রাথমিক অবস্থায় ইসলামী শারীআতেও এটা জায়িয ছিল। আরব সমাজে প্রতিষ্ঠিত অন্যান্য কুপ্রথার ন্যায় মুত'আহ বিবাহের মতো কুপ্রথাকেও রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ধীরে ধীরে বিলুপ্তি সাধন করেন। ৭ম হিজরীতে ১ম বার নিষিদ্ধ করেন, এরপর আওত্বাস যুদ্ধের সময় তিনদিনের জন্য অনুমতি দেন এবং পরে হারাম ঘোষণা করেন। অতঃপর বিদায় হাজ্জের (হজ্জের/হজের) সময় চিরকালের জন্য একে হারাম ঘোষণা করেন। অথচ এ হাদীসে দেখা যাচ্ছে, লোকেরা রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এবং আবূ বাকর (রাযিঃ) ও উমর (রাযিঃ) এর যুগে মুত’আহ বিবাহ করেছেন। এখানে উদ্দেশ্য হল যে সকল লোকদের কাছে রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুত'আহ বিবাহ রহিত হওয়ার ফরমান পৌঁছেনি তারা মুত'আহ বিবাহ করেছেন। অন্যথায় যাদের কাছে রহিত হওয়ার খবর পৌছেছিল তারা একে হারাম বিশ্বাস করতেন এবং এ থেকে পরহেয করতেন। সুতরাং না জানার কারণে মুত'আহ করা দলীল হতে পারে না, যদিও তারা জীবনের শেষ পর্যন্ত তা করুন না কেন। বরং তাদের কথা ও কাজ দলীল হিসেবে গ্রহীত হবে যাদের নিকট বিদায় হজ্জের সময়কার এ বিষয়ে নিষেধাজ্ঞা পৌছেছে। এরপর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চারমাস পর ইনতিকাল ফরমান এবং এ সময়ের মধ্যে তা বৈধ হওয়ার কথা বলেননি আর এ অবস্থায়ই তিনি পরপারে পাড়ি জমান। সুতরাং এর প্রতি প্রত্যাবর্তন এবং ‘আমল করা জরুরী।",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		}
	]
}