{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3429,
			"arabicnumber": "1406.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৩২০, আন্তর্জাতিক নাম্বারঃ ১৪০৬ ৩৩২০-(২৭/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ...... উরওয়াহ ইবনু যুবায়র (রহঃ) থেকে বর্ণিত যে, আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) মক্কায় (মক্কায়) (ভাষণ দিতে) দাঁড়িয়ে বললেন, কিছু লোক এমন আছে আল্লাহ তা'আলা যেমন তাদের চোখ অন্ধ করে দিয়েছেন তেমনি অন্তরকেও অন্ধ করে দিয়েছেন। তারা মুত'আর পক্ষে ফাতাওয়া দেয়। এ কথা বলে তিনি এক ব্যক্তির প্রতি ইঙ্গিত করলেন। সে ব্যক্তি ইবনু আব্বাস (রাযিঃ)। তাকে ডেকে বললেন, তুমি একটি অসভ্য ও কাণ্ডজ্ঞানহীন ব্যক্তি। আমার জীবনের শপথ! ইমামুল মুত্তাকীন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে মুত'আহ প্রচলিত ছিল। ইবনু যুবায়র (রাযিঃ) তাকে বললেন, আপনি নিজে একবার করে দেখুন। আল্লাহর শপথ আপনি যদি তা (মুত্'আহ) করেন তাহলে আপনার জন্য নির্ধারিত পাথর দিয়েই আপনাকে রজম (পাথর নিক্ষেপে হত্যা) করব। ইবনু শিহাব (রহঃ) বলেন, খালিদ ইবনুল মুহাজির ইবনু সাইফুল্লাহ (রহঃ) আমাকে জানিয়েছেন যে, তিনি এক ব্যক্তির নিকট বসা ছিলেন। এ সময় এক ব্যক্তি এসে তাকে মুত্'আহ সম্পর্কে ফাতাওয়া জিজ্ঞেস করে। তিনি তাকে মুত'আর অনুমতি দিলেন। ইবনু আবূ আমরাহ্ আল আনসারী (রাযিঃ) তাকে বললেন, থামুন। সে বলল, কেন? আল্লাহর শপথ ইমামুল মুত্তাকীন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তা করা হত। ইবনু আবূ আমারাহ (রাযিঃ) বললেন, ইসলামের প্রাথমিক যুগে নিরুপায় অবস্থায় তার অনুমতি ছিল (যেমন নিরুপায় অবস্থায়) মৃত জীব, রক্ত ও শূকরের (গোশত ভক্ষণের) ন্যায়। অতঃপর আল্লাহ তার দীনকে শক্তিশালী এবং সুদৃঢ় করলেন এবং তা নিষিদ্ধ করলেন। ইবনু শিহাব (রহঃ) বলেন, রাবী' ইবনু সাবরাহ আল জুহানী আমাকে জানিয়েছেন যে, তার পিতা বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমি দুটি লাল চাঁদরের বিনিময়ে আমির গোত্রের একটি স্ত্রীলোকের সাথে মুত্'আহ করেছিলাম। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মুত্'আহ করতে নিষেধ করেন। ইবনু শিহাব (রহঃ) আরও বলেন, আমি রাবী ইবনু সাবরাহকে উমর ইবনু আবদুল আষীয (রহঃ) এর নিকট তা বর্ণনা করতে শুনেছি, আমি তখন (সেখানে) বসা ছিলাম। (ইসলামিক ফাউন্ডেশন ৩২৯৫, ইসলামীক সেন্টার ৩২৯৩)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		}
	]
}