{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3500,
			"arabicnumber": "1365.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৩৯১, আন্তর্জাতিক নাম্বারঃ ১৩৬৫ ৩৩৯১-(৮৭/১৩৬৫) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, খায়বারের যুদ্ধে আমি আবূ তলহাহ্ (রাযিঃ) এর পিছনে সওয়ার ছিলাম। আমার পা তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কদম মুবারক স্পর্শ করছিল। বর্ণনাকারী বলেন, আমরা সূর্যোদয়ের সময় খায়বারবাসীদের নিকট পৌছলাম। তারা তখন চতুষ্পদ জন্তু, কোদাল, বস্তু ও রশি নিয়ে বের হচ্ছিল। তারা বলতে লাগলো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পঞ্চবাহিনী (পূর্ণ বাহিনী) নিয়ে এসে গেছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ খায়বার ধ্বংস হোক, আমরা যখন কোন শত্রু দলের আঙ্গিণায় অবতরণ করি তখন সতর্কীকৃত লোকদের প্রভাত হয় মন্দ। বর্ণনাকারী বলেন, (ঐ অভিযানে) আল্লাহ তাদের পরাজিত করেছেন। দিহইয়া (রাযিঃ) এর ভাগে পড়ে সুন্দরী দাসী। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাতজন দাসের বিনিময়ে সে দাসীকে খরিদ করে নেন। অতঃপর তিনি তাকে উম্মু সুলায়ম (রাযিঃ) এর হাওয়ালা করেন যাতে তিনি তাকে ঠিকঠাক করে প্রস্তুত করে দেন। বর্ণনাকারী বলেন, আমার মনে হয় রাবী এ কথাও বলেছেন, সে যেন তার ঘরে ইদ্দাত (ইদ্দত) পূর্ণ করে। তিনি ছিলেন হুয়াইর কন্যা সফিয়াহ। বর্ণনাকারী বলেন, রসূলুল্লাহ খেজুর, পানীয় ও ঘি দিয়ে তার ওয়ালীমাহ করলেন। এ উদ্দেশে জমিনের কিছু অংশ গর্ত আকারের করে তাতে চামড়ার বড় দস্তরখান বিছিয়ে দেয়া হয়। এতেই পানীয় ও ঘি রাখা হয়। সকলেই তা তৃপ্তির সাথে আহার করলেন। বর্ণনাকারী বলেন, লোকেরা বলতে লাগলঃ আমরা জানি না, তিনি তাকে বিবাহ করলেন, না উম্মু ওয়ালাদ (দাসী) রূপে গ্রহণ করলেন। আবার কয়েকজন বলতে লাগল, যদি তিনি তার পর্দার ব্যবস্থা না করেন তবে তিনি তার উম্মু ওয়ালাদ। তিনি যখন বাহনে সওয়ার হওয়ার ইচ্ছা করলেন, তখন তার জন্য পর্দার ব্যবস্থা করলেন। এরপর সফিয়্যাহ (রাযিঃ) উটের পিছনের দিকে বসলেন। তখন লোকেরা জানতে পারল যে, তিনি তাকে বিবাহ করেছেন। সাহাবীগণ যখন মদীনার নিকটবর্তী হলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দ্রুত অগ্রসর হতে থাকলেন এবং আমরাও দ্রুত চললাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আদবা নামক উষ্ট্রী হোচট খেলে তিনি উটের পিঠ থেকে জমিনে পড়ে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জমিনে পড়ে যান এবং সফিয়াহ (রাযিঃ)ও পড়ে যান। তিনি দাঁড়িয়ে সফিয়্যাহ (রাযিঃ) কে পর্দার দ্বারা আবৃত করে দেন। এ দেখে কতিপয় মহিলা বলতে লাগল, ইয়াহুদী মহিলাকে আল্লাহ তার রহমত থেকে বঞ্চিত করুন। বর্ণনাকারী বলেন, আমি বললাম, হে আবূ হামযাহ! সত্যিই কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উটনী থেকে জমিনে পড়ে গিয়েছিলেন? তিনি শপথ করে বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৩৩৬৫, ইসলামীক সেন্টার ৩৩৬৪)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 102
			}
		}
	]
}