{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 367,
			"arabicnumber": "143.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩, আন্তর্জাতিক নাম্বারঃ ১৪৩ ২৬৩-(২৩০/১৪৩) আবূ বকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... হুযাইফাহ (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে দুটি কথা বলেছিলেন, সে দুটির একটি তো আমি স্বচোখেই দেখেছি আর অপরটির অপেক্ষা করছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, মানব হৃদয়ের মূলে আমানাত নাযিল হয়*। তারপর কুরআন অবতীর্ণ হয়। অনন্তর তারা কুরআন শিখেছে এবং সুন্নাহর জ্ঞান লাভ করেছে। তারপর তিনি আমাদেরকে আমানাত উঠিয়ে নেয়ার বর্ণনা দিলেন। বললেন, মানুষ ঘুমাবে আর তখন তার অন্তর হতে আমানাত তুলে নেয়া হবে। ফলে তার চিহ্ন থেকে যাবে একটি নুকতার মত। এরপর আবার সে ঘুমায় তখন তার অন্তর থেকে আমানাত তুলে নেয়া হবে। ফলে তার চিহ্ন থেকে যাবে ফোস্কার মত; যেন একটি আগুনের ফুলকি যা তুমি তোমার পায়ে রগড়ে দিলে। তখন তাতে ফোস্কা পড়ে যায় এবং তুমি তা ফোলা দেখতে পাও অথচ তাতে (পুঁজ-পানি ব্যতীত) কিছু নেই। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কয়েকটি কাকর নিয়ে তার পায়ে ঘসলেন এবং বললেন, যখন এমন অবস্থা হয়ে যাবে তখন মানুষ বেচাকেনা করবে কিন্তু কেউ আমানত শোধ করবে না। এমন কি বলা হবে যে, অমুক বংশে একজন আমানাতদার আছেন। এমন অবস্থা হবে যে, কাউকে বলা হবে বড়ই বাহাদুর, হুশিয়ার ও বুদ্ধিমান অথচ তার অন্তরে দানা পরিমাণ ঈমান থাকবে না। হুযাইফাহ্ (রাযিঃ) বলেন, এমন এক যুগও গেছে যখন যে কারোর সাথে লেনদেন করতে দ্বিধা করতাম না। কারণ সে যদি মুসলিম হতো তবে তার দীনদারীই তাকে আমার হাক পরিশোধ করতে বাধ্য করত। আর যদি সে খৃষ্টান বা ইয়াহুদী হতো তবে তার প্রশাসক তা শোধ করতে তাকে বাধ্য করত। কিন্তু বর্তমানে আমি অমুক অমুক ব্যতীত কারে সাথে লেনদেন করতে রাজি না। ইবনু নুমায়র ও ইসহাক ইবনু ইবরাহীম (রহঃ) ... আমাশ (রহঃ) এর সূত্রে পূর্ব বর্ণিত সনদের অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ২৬৫, ২৬৬, ইসলামিক সেন্টারঃ ২৭৫, ২৭৬) (১)- হাসান বলেন, আমানাত অর্থ দীন ইসলাম, তার দীন সম্পূর্ণ আমানাত। আর আবূল আলিয়া বলেন, আমানাত অর্থ শারীআতের বিধি ও নিষেধ। মুকাতিল (রাযিঃ) বলেন, আমানাত অর্থ ইবাদাত। ইমাম ওয়াহিদী বলেন, অধিকাংশ মুফাসসিরীনদের কথা এটাই যে, আমানাত অর্থ ফরযসমূহ ও ইবাদাতসমূহ যা পালন করতে হবে। পালন না করলে আল্লাহর আযাব হবে। (সংক্ষিপ্ত নাবাবী)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 274
			}
		}
	]
}