{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3697,
			"arabicnumber": "1480.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৫৮৯, আন্তর্জাতিক নাম্বারঃ ১৪৮০ ৩৫৮৯-(৩৬/১৪৮০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ফাত্বিমাহ বিনতু কায়স (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবূ আমর ইবনু হাফস্ (রাযিঃ) (তার স্বামী) অনুপস্থিতিতে তাকে বায়িন ত্বলাক (তালাক) দেন। এরপর সামান্য পরিমাণ যবসহ উকীলকে তার কাছে পাঠিয়ে দেন। এতে তিনি ফাতিমাহ (রাযিঃ) তার উপর ভীষণভাবে অসন্তুষ্ট হন। সে (উকীল) বলল, আল্লাহর কসম! তোমাকে (খোরপোষরূপে) কোন কিছু দেয়া আমাদের দায়িত্ব নয়। তখন তিনি ফাতিমাহ বিনত কায়স (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত হয়ে তার নিকট সব খুলে বললেন। (তার কথা শুনে) তিনি বললেন, তোমার জন্য তার তোমার স্বামী আবূ আমর ইবনু হাফস্ (রাযিঃ) এর দায়িত্বে কোন খোরপোষ নেই। এরপর তিনি তাকে উম্মু শারীক এর ঘরে গিয়ে ইদ্দাত পালনের নির্দেশ দিলেন। অতঃপর তিনি এও বললেন, সে মহিলা (উম্মু শারীক) এমন একজন স্ত্রীলোক যার কাছে আমার সাহাবীগণ ভীড় করে থাকেন। তুমি বরং ইবনু উম্মু মাকতুম (রাযিঃ) এর বাড়িতে গিয়ে ইদ্দাত পালন করতে থাক। কেননা সে একজন অন্ধ মানুষ। সেখানে প্রয়োজনবোধে তুমি তোমার পরিধানের বস্তু খুলে রাখতে পারবে। ইদ্দাত পূর্ণ হলে তুমি আমাকে জানাবে। তিনি বলেন, যখন আমার ইদ্দাত পূর্ণ হল তখন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জানালাম যে, মু'আবিয়াহ ইবনু আবূ সুফইয়ান (রাযিঃ) ও আবূ জাহম (রাযিঃ) আমাকে বিবাহের পায়গাম পাঠিয়েছেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আবূ জাহম এমন লোক যে, তার কাঁধ থেকে লাঠি নামিয়ে রাখে না। আর মু'আবিয়াহ তো কপৰ্দকহীন গরীব মানুষ। তুমি উসামাহ ইবনু যায়দের সঙ্গে বিবাহ বন্ধনে আবদ্ধ হও। কিন্তু আমি তাকে পছন্দ করলাম না। পরে তিনি আবার বললেন, তুমি উসামাকে বিয়ে কর। তখন আমি তার সঙ্গে বিবাহ বন্ধনে আবদ্ধ হলাম। আল্লাহ এতে (তার ঘরে) আমাকে বিরাট কল্যাণ দান করলেন। আর আমি ঈর্ষার পাত্রে পরিণত হলাম। (ইসলামিক ফাউন্ডেশন ৩৫৫৯, ইসলামীক সেন্টার ৩৫৫৯) * যে তালাক প্রদানের পর ইদ্দাত চলাকালীন সময়ে নতুন বিবাহের মাধ্যমে স্ত্রীকে পুনরায় ফিরিয়ে আনা যায়, এমন তালাক কে বায়িন তালাক বলে।",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 45
			}
		}
	]
}