{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3755,
			"arabicnumber": "1495.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৬৪৭, আন্তর্জাতিক নাম্বারঃ ১৪৯৫ ৩৬৪৭-(১০/১৪৯৫) যুহায়র ইবনু হারব, উসমান ইবনু আবী শাইবাহ ও ইসহাক, ইবনু ইবরাহীম (রহঃ) ..... ‘আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন যে, আমি একবার জুমুআর রাতে মসজিদে ছিলাম। তখন একজন আনসারী সেখানে উপস্থিত হলেন। তিনি বললেনঃ যদি কোন ব্যক্তি তার স্ত্রীর সঙ্গে অন্য কোন পুরুষকে দেখতে পায়, সে যদি এ নিয়ে কথা বলে, তাহলে আপনারা তো তাকে (অপবাদদাতা হিসেবে) চাবুক লাগাবেন? অথবা সে যদি তাকে হত্যা করে ফেলে তাহলে তো আপনারা তাকে হত্যা করবেন (কিসাস হিসেবে)। যদি সে নীরব থাকে তাহলে তো তাকে সাংঘাতিক ক্রোধ (হযম) করে নীরব থাকতে হবে। আল্লাহর কসম! আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ বিষয়ে জিজ্ঞেস করবই। পরদিন সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে প্রশ্ন করল। সে বলল, যদি কোন ব্যক্তি তার স্ত্রীর সঙ্গে অন্য কোন পুরুষকে (ব্যভিচারে লিপ্ত) দেখতে পায় এবং সে এ নিয়ে কথা বলে তাহলে আপনারা তাকে হত্যা করে ফেলবেন। আর যদি নীরব থাকে তবে তো তাকে রাগ চেপে নীরব থাকতে হবে। (সুতরাং তার উপায় কী?) তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করলেন ইয়া আল্লাহ! তুমি এর ফয়সালা দাও এবং তিনি দুআ করতে লাগলেন। তখন লি'আনের আয়াত অবতীর্ণ হলো- \"আর যারা তাদের স্ত্রীদের উপর অপবাদ দেয় অথচ তারা নিজেরা ছাড়া তাদের কোন সাক্ষী নেই\"- এ আয়াতগুলো। (সূরা আন-নূর ৬-৯)। এরপর সে ব্যক্তি লোকজনের সামনে লি'আনের পরীক্ষার মুখোমুখি হলো। তারপর সে তার স্ত্রীসহ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এল এবং তারা উভয়ে লি'আন করল। লোকটি আল্লাহর নামে শপথ করে চারবার সাক্ষ্য দিল যে, সে সত্যবাদী। এরপর পঞ্চমবারে বলল, সে যদি মিথ্যাবাদী হয় তাহলে তার উপরে আল্লাহর অভিশাপ বর্ষিত হোক। এরপর মহিলাটি লি'আনের জন্য এগিয়ে এলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ থাম (যদি তোমার স্বামীর উক্তি সত্য হয়ে থাকে তাহলে তুমি তা স্বীকার করে নাও)। কিন্তু সে অস্বীকার করল এবং লি'আন করে ফেলল। যখন তারা দু'জন ফিরে যাচ্ছিল তখন তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ সম্ভবত এ মহিলা কালো কোঁকড়া চুলবিশিষ্ট সন্তান প্রসব করবে। অবশেষে তার গর্ভে একটি কালো কোকড়া চুলবিশিষ্ট সন্তানই জন্ম নিয়েছিল। (ইসলামিক ফাউন্ডেশন ৩৬১৩, ইসলামিক সেন্টার ৩৬১৩)",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		}
	]
}