{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4061,
			"arabicnumber": "1587.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৯৫৩, আন্তর্জাতিক নাম্বারঃ ১৫৮৭ ৩৯৫৩-(৮০/১৫৮৭) উবাইদুল্লাহ ইবনু উমার কাওয়ারীরী (রহঃ) ..... আবূ কিলাবাহ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি সিরিয়ায় এক মজলিসে উপস্থিত ছিলাম। তথায় মুসলিম ইবনু ইয়াসারও ছিলেন। এমন সময় আবূল আশ'আসের আগমন হলো। তারা বলল, আবূল আশ'আস, আমিও বললাম, আবূল আশ’আস (এসেছেন)। অতঃপর তিনি বসলেন। আমি তাকে বললাম, আমাদের ভাইদের কাছে উবাদাহ্ ইবনু সামিত (রাযিঃ) এর হাদীসটি শোনান। তিনি বললেন, আচ্ছা আমরা একবার এক যুদ্ধে অবতীর্ণ হই। মু'আবিয়াহ্ (রাযিঃ) ছিলেন সেনাপতি। প্রচুর পরিমাণ গনীমাত আমাদের হাতে আমাদের এ গনীমাতের মধ্যে রূপার একটা পাত্রও ছিল। মুআবিয়াহ (রাযিঃ) সেটা লোকদের বেতন-ভাতার বিনিময়ে বিক্রি করার জন্যে একজনকে আদেশ দান করেন। লোকেরা সবাই এ ব্যাপারে আগ্রহ প্রকাশ করল। উবাদাহ ইবনু সামিত (রাযিঃ)-এর নিকট এ সংবাদ পৌছলে তিনি দণ্ডায়মান হন এবং বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নিষেধ করতে শুনেছি- স্বর্ণের বিনিময়ে স্বর্ণ, রৌপ্যের বিনিময়ে রৌপ্য, গমের বিনিময়ে গম, যবের বিনিময়ে যব, খেজুরের বিনিময়ে খেজুর ও লবণের বিনিময়ে লবণ বিক্রি করতে, পরিমাণে সমান সমান ও নগদ নগদ ছাড়া। যে অতিরিক্ত দিবে বা অতিরিক্ত গ্রহণ করবে সে সুদের কাজ-কারবার করল। এরপর লোকজন যা কিছু নিয়েছিল তা ফেরত দিলো এবং মু'আবিয়াহ (রাযিঃ)-এর নিকট এ সংবাদ পৌছে দিলো। তিনি ভাষণ দিতে দাড়িয়ে গেলেন এবং বললেন, মানুষের একী অবস্থা হলো, তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এমন বহু হাদীস বর্ণনা করেন যা আমরা তার থেকে শুনিনি অথচ আমরা তার নিকট উপস্থিত থাকতাম এবং তারই নৈকট্য পেতাম। এরপর উবাদাহ (রাযিঃ) দাঁড়ালেন এবং বর্ণনার পুনরাবৃত্তি করে বললেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে যা কিছু শুনেছি তা অবশ্যই বর্ণনা করব, যদিও মু'আবিয়াহ (রাযিঃ) তা অপছন্দ করেন অথবা বলেছেন যে, যদিও মু'আবিয়াহ্ তাতে দুঃখিত হন। এতে আমার কিছু আসে যায় না, তার বাহিনীতে এক কালো রাত্র না থাকি। হাম্মাদ (রহঃ) বলেন, তিনি এ কথাই বলেছেন কিংবা এর অনুরূপ কিছু। (ইসলামিক ফাউন্ডেশন ৩৯১৬, ইসলামিক সেন্টার ৩৯১৫)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 100
			}
		}
	]
}