{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৯৯২, আন্তর্জাতিক নাম্বারঃ ৭১৫ ৩৯৯২-(১১০/...) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে জিহাদে যাই। আমি একটি ধীরগতির উটের পিঠে চলছিলাম, তিনি আমাকে বললেনঃ তোমার উটের কী হয়েছে? আমি বললাম, অসুখ হয়েছে। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পশ্চাতে গেলেন এবং উটকে ধমক দিলেন ও দুআ করলেন। এরপর তা সকল উটের আগে আগে চলতে থাকে। তিনি বললেন, এখন তোমার উটের অবস্থা কী? আমি বললাম, ভালই; আপনার বারাকাতের পরশ লেগেছে। তিনি বললেন, এটি আমার নিকট বেচে দিবে কি? আমি লজ্জিত হলাম। কারণ এটা ছাড়া আমাদের অন্য কোন পানি বহনকারী উট ছিল না। অবশেষে বললাম, হ্যাঁ। সুতরাং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এটা এ শর্তে বিক্রি করলাম যে, মদীনাহ পর্যন্ত তার উপর আরোহণ করা আমার অধিকারে থাকবে। তিনি বললেন, এরপর আমি আরয করলামঃ হে আল্লাহর রসূল! আমি সদ্য বিবাহিত। তাই আমি তার নিকট অনুমতি চাইলাম (তাড়াতাড়ি চলে আসার), তিনি আমাকে অনুমতি দিলেন। সুতরাং অন্যান্য লোকের আগেই আমি মদীনার দিকে রওয়ানা হলাম। যখন শেষ সীমায় পৌছলাম তখন আমার মামার সঙ্গে সাক্ষাৎ হলো। তিনি আমার কাছে উটের অবস্থা জিজ্ঞেস করলেন। আমি তাকে সে সব কথা জানালাম যা এ ব্যাপারে আমি করেছি। তিনি এজন্যে আমাকে তিরস্কার করলেন। জাবির (রাযিঃ) বললেন, আমি যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি প্রার্থনা করি তখন তিনি আমাকে জিজ্ঞেস করলেন তুমি কি কুমারী মেয়ে বিবাহ করেছো, না পূর্ব বিবাহিতাকে? বললাম, আমি পূর্ব বিবাহিতা নারীকে বিবাহ করেছি। তিনি বললেন, কেন কুমারী বিবাহ করেনি? যার সাথে তুমি আমোদ-প্রমোদ করতে আর সেও তোমার সাথে আমোদ-প্রমোদ করত। আমি বললাম, হে আল্লাহর রসূল! আমার কয়েকজন ছোট ছোট বোন রেখে আমার পিতা মারা যান অথবা (বলেন) শাহাদাত বরণ করেন। তাই আমি পছন্দ করিনি তাদের নিকট তাদেরই মত আর একজনকে বিবাহ করে আনতে যে তাদের সুশিক্ষা দিতে ও দায়িত্ব গ্রহণ করতে পারবে না। এ কারণে আমি পূর্ব বিবাহিতা নারীকে বিবাহ করেছি, যাতে সে তাদের দেখাশুনা করতে পারে ও সুশিক্ষা দিতে পারে। জাবির (রাযিঃ) বলেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় পৌছলেন, আমি ভোরে উটসহ তার নিকট হাযির হলাম। তিনি তার মূল্য আমাকে প্রদান করেন এবং উটও ফেরত দেন। (ইসলামিক ফাউন্ডেশন ৩৯৫৫, ইসলামিক সেন্টার ৩৯৫৪)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		}
	]
}