{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"25": "The Book of Wills"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4209,
			"arabicnumber": "1628.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০১, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০১-(৫/১৬২৮) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ...... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, বিদায় হজ্জের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন; এমন রোগের সময় যাতে আমি মৃত্যুর কাছাকাছি হয়ে পড়েছিলাম। আমি বললাম, হে আল্লাহর রসূল! রোগের কারণে আমার কী অবস্থা হয়েছে, আপনি তো দেখতেই পাচ্ছেন? আমি একজন সম্পদশালী ব্যক্তি, অথচ একটি মাত্র কন্যা সন্তান ব্যতীত আমার আর কোন ওয়ারিস নেই। সুতরাং আমি আমার সম্পদের দু-তৃতীয়াংশ দান করতে পারব কি? তিনি বললেন, না। আমি বললাম, তবে কি অর্ধেক মাল সদাকাহ করতে পারব? তিনি বললেন, না। বরং এক তৃতীয়াংশ এবং এক তৃতীয়াংশও বেশি হয়ে যায়। তোমার ওয়ারিসদের অভাবমুক্ত অবস্থায় রেখে যাওয়া তোমার জন্যে উত্তম, এমন অভাবগ্রস্ত অবস্থায় ছেড়ে সাওয়ার চেয়ে যে, তারা মানুষের নিকট হাত পাতবে। আর আল্লাহর সন্তুষ্টি লাভের জন্যে তুমি যা কিছুই খরচ কর তার উপর তোমাকে প্রতিদান দেয়া হবে। এমনকি, সে লোকমাটির বদৌলতেও যা তুমি তোমার স্ত্রীর মুখে তুলে দিবে। আমি বললাম, হে আল্লাহর রসূল! আমি তো আমার সাথীদের পর তাদের পিছনে রয়ে যাচ্ছি। তিনি বললেন, তুমি পেছনে রয়ে গেছো (জীবিত রয়ে গেছো), তাতে তুমি এমন আমল করে আল্লাহর সন্তুষ্টি লাভ করতে পার যাতে তোমার মর্যাদা বাড়বে ও উচু হবে। আর সম্ভবত তুমি পরবর্তীতেও থাকবে অর্থাৎ দীর্ঘায়ু লাভ করবে। এমনকি বহু সম্প্রদায় তোমার দ্বারা লাভবান হবে এবং বহু লোক তোমার দ্বারা ক্ষতিগ্রস্ত হবে। (নবীজী দুআ করলেন) ইয়া আল্লাহ! আমার সাথীদের হিজরাত অক্ষুণ্ণ রাখুন এবং তাদেরকে পশ্চাতে ফিরিয়ে দিবেন না। কিন্তু সা'দ ইবনু খাওলার জন্যে আফসোস! বর্ণনাকারী বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্যে দুঃখ প্রকাশ করেন। কারণ, তিনি মক্কায় মৃত্যুবরণ করেছিলেন। (ইসলামিক ফাউন্ডেশন ৪০৬৩, ইসলামিক সেন্টার ৪০৬২) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, নিজের স্ত্রী ও শিশু সন্তানসন্ততিদের খোরপোশ জোগানোর সুব্যবস্থা করার জন্য টাকাপয়সা ও ধনসম্পদ ব্যয় করার মধ্যে যে ব্যক্তি মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভের আশা পোষণ করবে না, সে ব্যক্তি মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভ করতে পারবে না। ২। এই হাদীসটির দ্বারা এটা প্রতিমান হয় যে, প্রকৃত ইসলামের শিক্ষা অনুযায়ী মহান আল্লাহর উপাসনার অর্থ হলো বৃহত্তর ও ব্যাপক বিষয়; তাই মানুষ যখন সাধারণ জায়েজ বস্তুগুলি নিজে উপভোগ করার জন্য ব্যবহার করবে এবং তার জরুরি বিষয়গুলি পালন করবে, তখন সে যদি তাতে মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভের আশা পোষণ করে, তাহলে সে নিশ্চয় তার সেই সাধারণ জায়েজ বস্তুগুলি এবং জরুরি বিষয়গুলি পালন করার মাধ্যমে মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভ করতে পারবে। ৩। স্বামী-স্ত্রীর মনের ইচ্ছা যৌন পূরণ করার জন্য তাদের মধ্যে যে সম্পর্ক স্থাপন হবে, তাতেও তারা মহান আল্লাহর সন্তুষ্টি ও অনেক পুণ্য লাভ করতে পারবে, যদি তারা তাদের সম্পর্ক স্থাপন করার মাধ্যমে মহান আল্লাহর নৈকট্য লাভ করার ইচ্ছা পোষণ করে।",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		}
	]
}