{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4428,
			"arabicnumber": "1694.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩২০, আন্তর্জাতিক নাম্বারঃ ১৬৯৪ ৪৩২০-(২০/১৬৯৪) মুহাম্মাদ ইবনু মুসান্না (রহঃ) ..... আবূ সাঈদ হতে বর্ণিত যে, আসলাম গোত্রের মাইয ইবনু মালিক নামক এক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, আমি তো এক গৰ্হিত কাজ করে ফেলেছি। অতএব এর জন্য আমার উপর শারীআতের বিধান প্রয়োগ করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এ স্বীকারোক্তি কয়েকবার প্রত্যাখ্যান করেন। বর্ণনাকারী বলেন, এরপর তিনি ঐ ব্যক্তির স্বগোত্রীয় লোকের কাছে তার সম্পর্কে জিজ্ঞাসাবাদ করলেন। তারা বলল, আমরা তো তার সম্বন্ধে কোন খারাপ জানি না। কিন্তু হঠাৎ করেই সে এমন অন্যায় কাজে লিপ্ত হয়ে পড়েছে। সে এখন ভাবছে যে, তার প্রতি হদ' حَد শারীআতের বিধান প্রয়োগ ব্যতীত তার আর কোন নিস্কৃতি নেই। বর্ণনাকারী বলেন যে, তখন সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ফিরে এল। তখন তিনি তাকে পাথর নিক্ষেপের জন্য আমাদের নির্দেশ দিলেন। বর্ণনাকারী বলেন, আমরা তখন তাকে 'বাকীউল গারকাদ' নামক স্থানে নিয়ে চললাম। আমরা তাকে বাঁধলাম না এবং মাটিতে পুতলামও না। এরপর আমরা তাকে হাড়, মৃত্তিকা, চিলা এবং ইট মারতে শুরু করলাম। হঠাৎ সে দৌড়ে পালাল, আমরাও তার পিছনে ছুটলাম। অবশেষে সে “হাররাহ” নামক স্থানে উপনীত হল। আমরা তথায় তাকে ধরলাম এবং পাথর নিক্ষেপ করলাম। পরিশেষে সে নিশ্চল হয়ে গেল অর্থাৎ- মরে গেল। বর্ণনাকারী বলেন, এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সন্ধ্যাবেলায় কিছু বলার উদ্দেশে দণ্ডায়মান হলেন এবং বললেন, আমরা যখনই আল্লাহর পথে কোন যুদ্ধে গমন করি তখন কোন না কোন ব্যক্তি আমাদের পরিবার-পরিজনদের মাঝে থেকে যায় এবং ছাগলের শব্দের ন্যায় আওয়াজ করে। আমার উপর কর্তব্য হল যদি এরূপ কোন ব্যক্তিকে আমার কাছে আনা হয়, তবে আমি তাকে দৃষ্টান্তমূলক শাস্তি প্রদান করবো। বর্ণনাকারী বলেন, এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার জন্য (আল্লাহর কাছে) ক্ষমা প্রার্থনা করেননি এবং কোন গালিও দেননি। (দুআ এজন্য করেননি যে, হয়ত এ আশায় কেউ আবার পাপাচারে লিপ্ত হয়ে যেতে পারে; মন্দ বলেননি এজন্য যে, তার পাপের প্রায়শ্চিত্ত হয়ে গেছে) (ইসলামিক ফাউন্ডেশন ৪২৭৯, ইসলামিক সেন্টার ৪২৮০)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 31
			}
		}
	]
}