{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4440,
			"arabicnumber": "1700.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৩২, আন্তর্জাতিক নাম্বারঃ ১৭০০ ৪৩৩২-(২৮/১৭০০) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ...... বারা ইবনু আযিব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখ দিয়ে একজন ইয়াহুদীকে কালি মাখা এবং বেত্ৰাঘাতকৃত অবস্থায় নিয়ে যাওয়া হচ্ছিল। তখন তিনি বলেন, তোমরা কি তোমাদের কিতাবে ব্যভিচারের শাস্তি এরূপই পেয়েছ? তারা বলল, হ্যাঁ। এরপর তিনি তাদের মধ্য হতে একজন আলিম (পাদরী) ব্যক্তিকে ডাকালেন এবং বললেন, তোমাকে সে আল্লাহর কসম দিয়ে বলছি, যিনি মূসা (আঃ) এর প্রতি তাওরাত কিতাব অবতীর্ণ করেছিলেন, এরূপই কি তোমরা তোমাদের কিতাবে ব্যভিচারীর শাস্তি পেয়েছ? তখন ইয়াহুদী আলিম ব্যক্তি বললেন, না। তিনি আরো বললেন, আপনি যদি আমাকে আল্লাহর কসম দিয়ে এভাবে না বলতেন তবে আমি আপনাকে জানাতাম না যে, এর প্রকৃত শাস্তি রজম (পাথর নিক্ষেপ করা)। কিন্তু আমাদের সমাজের সম্ভান্ত ব্যক্তিদের মাঝে এর ব্যাপক প্রচলন হয়ে গেছে। অতএব, আমরা যখন এতে কোন সম্ভান্ত লোককে পেতাম, তখন তাকে ছেড়ে দিতাম এবং যখন কোন নিঃস্ব ব্যক্তিকে পাকড়াও করতাম তখন তার উপর শারীআতের প্রকৃত শাস্তিحَد বাস্তবায়িত করতাম। পরিশেষে আমরা বললাম, তোমরা সকলেই এসো, আমরা সবাই মিলে এ ব্যাপারে একটি শাস্তি নির্ধারিত করে নেই, যা ভদ্র ও অভদ্র সকলের উপরই প্রযোজ্য হবে। সুতরাং আমরা ব্যভিচারের শাস্তি কালি লাগানো এবং বেত্ৰাঘাত করাকেই স্থির করে নিলাম, পাথর নিক্ষেপের পরিবর্তে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আল্লাহ! আমিই প্রথম ব্যক্তি, যে তোমার নির্দেশ رجم বাস্তবায়িত (পুনর্জীবিত) করলাম, যা তারা বাতিল করে ফেলেছিল। সুতরাং তিনি তা বাস্তবায়নের নির্দেশ দিলেন। অবশেষে ঐ ইয়াহুদীকে পাথর মারা হল। এরপর মহান আল্লাহ এ আয়াতঃ “হে রসূল! যারা কুফরী কাজে দ্রুতগামী তাদের কার্যকলাপ যেন আপনাকে চিন্তিত না করে। ... অতঃপর সেই বাণী পর্যন্ত যদি তোমরা তা প্রদত্ত হও, তবে তা ধারণ কর\"- (সূরা ময়িদাহ ৫ঃ ৪১) পর্যন্ত অবতীর্ণ করেন। তারা (ইয়াহুদীরা) বলতো যে, তোমরা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমন করো, যদি তিনি তোমাদেরকে এ ব্যাপারে- কালি লাগানো এবং বেত্ৰাঘাতের নির্দেশ প্রদান করেন, তবে তোমরা তা কার্যকর করবে; আর যদি তিনি রজমের নির্দেশ দেন তবে তা প্রত্যাখ্যান করবে। আল্লাহ তা'আলা (এ মর্মে) আয়াত অবতীর্ণ করেনঃ “যারা আল্লাহর নাযিলকৃত আয়াত মুতাবিক বিচারকার্য পরিচালনা করে না তারাই হলো কাফির (অস্বীকারকারী) সম্প্রদায়\"- (সূরা ময়িদাহ ৫ঃ ৪৪)। \"আর যারা আল্লাহর নাযিলকৃত আয়াত অনুসারে বিচার করে না তারাই হলো অত্যাচারী দল\"- (সূরা ময়িদাহ ৫ঃ ৪৫)। \"আর যারা আল্লাহর নাযিলকৃত আয়াত অনুযায়ী বিচার করে না তারাই হলো সীমালঙ্ঘনকারী দল\" (সূরা ময়িদাহ ৫ঃ ৪৭)। এ সবগুলো আয়াত কাফিরদের সম্পর্কেই অবতীর্ণ হয়। (ইসলামিক ফাউন্ডেশন ৪২৯১, ইসলামিক সেন্টার ৪২৯২)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 43
			}
		}
	]
}