{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 451,
			"arabicnumber": "182.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৪০, আন্তর্জাতিক নাম্বারঃ ১৮২ ৩৪০-(২৯৯/১৮২) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) বলেন যে, কয়েকজন সাহাবা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললেন, হে আল্লাহর রাসূল! কিয়ামত দিবসে আমরা কি আমাদের প্রতিপালককে দেখতে পাবো? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, পূর্ণিমার রাতে চাঁদ দেখতে কি তোমাদের পরস্পরের মাঝে কষ্ট হয়? সাহাবাগণ বললেন, না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মেঘমুক্ত আকাশে সূর্য দেখতে কি তোমাদের পরস্পরের কষ্টবোধ হয়? তারা বললেন, না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তদ্রুপ তোমরা তাকেও দেখবে। কিয়ামত দিবসে আল্লাহ সকল মানুষকে জমায়েত করে বলবেন, পৃথিবীতে তোমাদের যে যার ইবাদাত করেছিলে আজ তাকেই অনুসরণ কর। তখন যারা সূর্যের উপাসনা করতো, তারা সূর্যের সাথে থাকবে। যারা চন্দ্রের উপাসনা করতো, তারা চন্দ্রের সাথে থাকবে। আর যারা আল্লাহদ্রোহীদের (তাগুতের) উপাসনা করতো, তারা আল্লাহদ্রোহীদের সাথে জমায়েত হয়ে যাবে। কেবল এ উম্মত অবশিষ্ট থাকবে। তন্মধ্যে মুনাফিকরাও থাকবে। তখন আল্লাহ তা'আলা তাদের নিকট এমন আকৃতিতে উপস্থিত হবেন যা তারা চিনে না। তারপর (আল্লাহ তা'আলা) বলবেন, আমি তোমাদের প্রতিপালক (সুতরাং তোমরা আমার পিছনে চল)। তারা বলবে, নাউযুবিল্লাহ। আমাদের প্রভু না আসা পর্যন্ত আমরা এখানেই দাড়িয়ে থাকবো। আর তিনি যখন আসবেন, তখন আমরা তাকে চিনতে পারবো। এরপর আল্লাহ তা'আলা তাদের নিকট তাদের পরিচিত আকৃতিতে আসবেন, বলবেনঃ আমি তোমাদের প্রভু। তারা বলবে, হ্যাঁ, আপনি আমাদের প্রতু। এ বলে তারা তাকে অনুসরণ করবে। এমন সময়ে জাহান্নামের উপর দিয়ে সিরাত (সাকো) বসানো হবে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন আর আমি ও আমার উম্মতই হব প্রথম এ পথ অতিক্রমকারী। সেদিন রাসূলগণ ব্যতীত অন্য কেউ মুখ খোলারও সাহস করবে না। আর রাসূলগণও কেবল এ দু'আ করবেন। হে আল্লাহ! নিরাপত্তা দাও, নিরাপত্তা দাও। আর জাহান্নামে থাকবে সা'দান বৃক্ষের কাটার মত অনেক কাটাযুক্ত লৌহদণ্ড। তোমরা সাদান বৃক্ষটি দেখেছ কি? সাহাবাগণ বললেন, হ্যাঁ দেখেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেনঃ তা সাদান বৃক্ষের কাটার মতই, তবে সেটা যে কত বিরাট তা আল্লাহ ব্যতীত কেউ জানে না। পাপ কাজের জন্য কাটার আংটাগুলো ছোবল দিতে থাকবে। তাদের কেউ কেউ মু'মিন (যারা সাময়িক জাহান্নামী) তারা রক্ষা পাবে, আর কেউ তো শাস্তি ভোগ করে নাযাত পাবে। এরপর আল্লাহ বান্দাদের মধ্যে ফায়সালা হতে অবসর হলে স্বীয় রহমতে কিছু সংখ্যক জাহান্নামীদের (জাহান্নাম হতে) বের করতে দেয়ার ইচ্ছা করবেন তখন ফেরেশতাদেরকে নির্দেশ দিবেন যারা কালিমায় বিশ্বাসী ও শিরক করেনি যাদের উপর আল্লাহ তা'আলা রহম করতে চাইবেন যে, তাদেরকে জাহান্নাম থেকে বের করে নিয়ে আসো। আর যাদের উপর আল্লাহ তা'আলা দয়া করতে চেয়েছেন তারা ঐ সকল লোক যারা 'লা- ইলা-হা ইল্লাল্ল-হ' বলত। অতঃপর ফেরেশতাগণ তাদের সনাক্ত করবেন। তারা সিজদা চিহ্নের সাহায্যে তাদের চিনবেন। কারণ, অগ্নি মানুষের দেহের সবকিছু জ্বালিয়ে ফেললেও সাজদার স্থান অক্ষত থাকবে। আল্লাহ তা'আলা সাজদার চিহ্ন নষ্ট করা হারাম (নিষিদ্ধ) করে দিয়েছেন। মোটকথা, ফেরেশতাগণ এদেরকে জাহান্নাম থেকে বের করে আনবে এমন অবস্থায় যে, তাদের দেহ আগুনে দগ্ধ। তাদের উপর 'মাউল-হায়াত’ (সঞ্জীবনী পানি) ঢেলে দেয়া হবে। তখন তারা এতে এমনভাবে সতেজ হয়ে উঠবে যেমনভাবে শস্য অঙ্কুর পানিসিক্ত উর্বর জমিতে সতেজ হয়ে উঠে। তারপর আল্লাহ তা'আলা বান্দাদের বিচার সমাপ্ত করবেন। শেষে এক ব্যক্তি থেকে যাবে। তার মুখমণ্ডল হবে জাহান্নামের দিকে। এই হবে সর্বশেষ জান্নাতে প্রবেশকারী। সে বলবে, হে আমার প্রভু! (অনুগ্রহ করে) আমার মুখটি জাহান্নামের দিক থেকে ফিরিয়ে দিন। কারণ জাহান্নামের দুর্গন্ধ আমাকে অসহনীয় কষ্ট দিচ্ছে; এর লেলিহান অগ্নিশিখা আমাকে দগ্ধ করে দিচ্ছে। আল্লাহ যতদিন চান ততদিন পর্যন্ত সে তার নিকট দু'আ করতে থাকবে। পরে আল্লাহ বলবেন, তোমার এ দু'আ কবুল করলে তুমি কি আরো কিছু কামনা করবে? সে বিভিন্ন ধরনের ওয়াদা ও অঙ্গীকার করে বলবে যে, জাহান্নামের দিক থেকে ফিরিয়ে দিবেন। তার চেহারা যখন জান্নাতের দিকে ফিরিয়ে দেয়া হবে, আর সে জান্নাত দেখবে, তখন আল্লাহ যতদিন চান সে নীরব থাকবে। পরে আবার বলবে, হে আমার প্রতিপালক! কেবল জান্নাতের দরজা পর্যন্ত আমাকে পৌছে দিন। আল্লাহ তাকে বলবেন, তুমি না অঙ্গীকার দিয়েছিলে যে, আমি তোমাকে যা দিয়েছি তা ছাড়া আর কিছু চাইবে না। হে আদম সন্তান! তুমি হতভাগা ও তুমি সাংঘাতিক ওয়াদাভঙ্গকারী। তখন সে বলবে, হে আমার রব! এই বলে আল্লাহর কাছে দু'আ করতে থাকবে। আল্লাহ বলবেন, তুমি যা চাও তা যদি দিয়ে দেই তবে আর কিছু চাইবে না তো? সে বলবে, আপনার ইজ্জতের কসম! আর কিছু চাইব না। এভাবে সে তার অক্ষমতা (আল্লাহর কাছে) পেশ করতে থাকবে যতদিন আল্লাহর ইচ্ছা হয়। তারপর তাকে জান্নাতের দরজা পর্যন্ত এগিয়ে দেয়া হবে। এবার যখন সে জান্নাতের দরজায় দাঁড়াবে, তখন জান্নাত তার সামনে উদ্ভাসিত হয়ে উঠবে। সে জান্নাতের সমৃদ্ধি ও সুখ দেখতে থাকবে। সেখানে আল্লাহ যতক্ষণ চান সে ততক্ষণ চুপ করে থাকবে। পরে বলবে, হে আমার রব! আমাকে জান্নাতে প্রবেশ করিয়ে দিন। আল্লাহ বলবেন, তুমি না সকল ধরনের ওয়াদা ও অঙ্গীকার করে বলেছিলে, আমি যা দান করেছি এর চাইতে বেশি আর কিছু চাইবে না? হে হতভাগা আদম সন্তান! তুমি তো ভীষণ ওয়াদাভঙ্গকারী। সে বলবে, হে আমার রব। আমি যেন আপনার সৃষ্টির সবচেয়ে দুর্ভাগা না হই। সে বার বার দু'আ করতে থাকবে। পরিশেষে তার অবস্থা দেখে আল্লাহ তা'আলা হেসে ফেলবেন। আল্লাহ তা'আলা বলবেন, যাও জান্নাতে প্রবেশ কর। (জান্নাতে প্রবেশের পর) আল্লাহ তাকে বলবেন, (যা চাওয়ার) চাও। তখন সে তার সকল কামনা চেয়ে শেষ করবে। এরপর আল্লাহ নিজেই স্মরণ করায়ে বলবেন, অমুক অমুকটা চাও। এভাবে তার কামনা শেষ হয়ে গেলে আল্লাহ বলবেন, তোমাকে এ সব এবং এর সমপরিমাণ আরো দেয়া হল। আতা ইবনু ইয়াযীদ বলেন, এবং আবূ সাঈদ আল খুদরী (রাযিঃ) এ হাদীসটি আবূ হুরাইরাহ (রাযিঃ) এর অনুরূপ বর্ণনা করেছেন। তিনি আবূ হুরাইরাহ (রাযিঃ) বর্ণিত এ হাদীসের কোন কথাই রদ করেননি। তবে আবূ হুরাইরাহ (রাযিঃ) যখন এ কথা উল্লেখ করলেন, \"আল্লাহ তা'আলা ঐ ব্যক্তিকে বলবেন, তোমাকে এ সব এবং এর সমপরিমাণ আরো দেয়া হল\" তখন আবূ সাঈদ (রাযিঃ) বললেনঃ হে আবূ হুরাইরাহ! বরং তা সহ আরো দশগুণ দেয়া হবে। আবূ হুরাইরাহ (রাযিঃ) বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে \"এর সম-পরিমাণ\" এ শব্দ স্মরণ রেখেছি। আবূ সাঈদ (রাযিঃ) বললেন, আমি সাক্ষ্য দিচ্ছি, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে \"আরো দশগুণ\" এ শব্দ সংরক্ষিত রেখেছি। রাবী বলেন, আবূ হুরাইরাহ (রাযিঃ) পরিশেষে বলেন, এ ব্যক্তি হবে জান্নাতে সর্বশেষ প্রবেশকারী। (ইসলামিক ফাউন্ডেশনঃ ৩৪৮, ইসলামিক সেন্টারঃ ৩৫৯)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 356
			}
		}
	]
}