{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4522,
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪১৪, আন্তর্জাতিক নাম্বারঃ ১৭৩১ ৪৪১৪-(৩/...) আবদুল্লাহ ইবনু হাশিম (রহঃ) ..... সুলাইমান ইবনু বুরাইদাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন সেনাবাহিনী কিংবা সেনাদলের উপর আমীর নিযুক্ত করতেন তখন বিশেষতঃ তাকে আল্লাহ তা'আলাকে ভয় করে চলার উপদেশ দিতেন এবং তার সঙ্গী মুসলিমদের প্রতি আদেশ করতেন তারা যেন ভালভাবে চলে। আর (বিদায়লগ্নে) বলতেন, যুদ্ধ করো আল্লাহর নামে, আল্লাহর পথে। লড়াই করো তাদের বিরুদ্ধে যারা আল্লাহর সঙ্গে কুফুরী করেছে। যুদ্ধ চালিয়ে যাও, তবে গনীমাতের মালের খিয়ানাত করবে না, চুক্তি ভঙ্গ করবে না, শত্রু পক্ষের অঙ্গ বিকৃতি সাধন করবে না। শিশুদেরকে হত্যা করবে না। যখন তুমি মুশরিক শত্রুর সম্মুখীন হবে, তখন তাকে তিনটি বিষয় বা আচরণের প্রতি আহ্বান জানাবে। তারা এগুলোর মধ্য থেকে যেটিই গ্রহণ করে, তুমি তাদের পক্ষ থেকে তা মেনে নিবে এবং তাদের বিরুদ্ধে যুদ্ধ থেকে সরে দাঁড়াবে। প্রথমে তাদের ইসলামের দিকে দাওয়াত দিবে। যদি তারা তোমার এ আহবানে সাড়া দেয়, তবে তুমি তাদের পক্ষ থেকে তা মেনে নিবে এবং তাদের বিরুদ্ধে যুদ্ধ করা থেকে সরে দাঁড়াবে। এরপর তুমি তাদের বাড়ি-ঘর ছেড়ে মুহাজিরদের এলাকায় (মদীনায়) চলে যাওয়ার আহ্বান জানাবে। এবং তাদের জানিয়ে দিবে যে, যদি তারা তা কার্যকরী করে, তবে মুহাজিরদের জন্য যেসব উপকার ও দায়-দায়িত্ব রয়েছে, তা তাদের উপর কার্যকরী হবে। আর যদি তারা বাড়ি-ঘর ছেড়ে যেতে অস্বীকার করে, তবে তাদের জানিয়ে দেবে যে, তারা সাধারণ বেদুঈন মুসলিমদের মত গণ্য হবে। তাদের উপর আল্লাহর সে বিধান কার্যকরী হবে, যা মুমিনদের উপর কার্যকরী হয় এবং তারা গনীমাত ও ফাই* থেকে কিছুই পাবে না। অবশ্য মুসলিমের সঙ্গে শামিল হয়ে যুদ্ধ করলে তার অংশীদার হবে। আর যদি তারা ইসলাম গ্রহণ করতে অস্বীকার করে, তবে তাদের কাছে জিযয়াহ্ প্রদানের দাবী জানাবে। যদি তারা তা গ্রহণ করে নেয়, তবে তুমি তাদের পক্ষ থেকে তা মেনে নিবে এবং তাদের বিরুদ্ধে যুদ্ধ থেকে বিরত থাকবে। আর যদি তারা এ দাবী না মানে তবে আল্লাহর কাছে সাহায্য প্রার্থনা করবে এবং তাদের বিরুদ্ধে যুদ্ধে ঝাপিয়ে পড়বে। আর যদি তুমি কোন দুর্গবাসীকে অবরোধ করো এবং তারা যদি তোমার কাছে আল্লাহ ও তার রসূলের যিম্মাদারী চায়, তবে তুমি তাদের জন্য আল্লাহ ও তার রসূলের যিম্মাদারী মেনে নিবে না। বরং তাদেরকে তোমার এবং তোমার সাথীদের যিম্মাদারীতে রাখবে। কেননা তারা যদি তোমার ও তোমার সাথীদের যিম্মাদারী ভঙ্গ করে, তবে তা আল্লাহ ও তার রসূলের যিম্মাদারী ভঙ্গের চাইতে কম গুরুতর। আর যদি তোমরা কোন দুর্গের অধিবাসীদেরকে অবরোধ করো, তখন যদি তারা তোমাদের কাছে আল্লাহর নির্দেশ মুতাবিক নেমে আসতে চায়, তবে তোমরা তাদেরকে আল্লাহর হুকুমের উপর নেমে আসতে দিবে না, বরং তুমি তাদেরকে তোমার সিদ্ধান্তের উপর নেমে আসতে দেবে। কেননা তোমার জানা নেই যে, তুমি তাদের মাঝে আল্লাহর নির্দেশ বাস্তবায়িত করতে পারবে কি-না? আবদুর রহমান (রহঃ) এ হাদীস কিংবা এ হাদীসের অনুরূপ হাদীসটি বর্ণনা করেছেন। ইসহাক (রহঃ) তার বর্ণিত হাদীসের শেষাংশে ইয়াহইয়া ইবনু আদম (রহঃ) সূত্রে কিছু অতিরিক্ত বর্ণনা করেছেন। বর্ণনাকারী বলেন, আমি এ হাদীসটি মুকাতিল ইবনু হাইয়্যান (রহঃ) এর কাছে বর্ণনা করেছি। তখন তিনি ইয়াহইয়া (রহঃ) অর্থাৎ আলকামাহ্ (রহঃ) এর কথা উল্লেখ করে বলেন যে, তিনি তা বর্ণনা করেছেন ইবনু হাইয়্যানের উদ্দেশে। অতএব তিনি বলেন যে, মুসলিম ইবনু হায়সাম (রহঃ), নুমান ইবনু মুকাররিন (রহঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এর অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৪৩৭২, ইসলামিক সেন্টার ৪৩৭২) * যুদ্ধের ময়দানে যুদ্ধ ছাড়া শক্রবাহিনীর ফেলে যাওয়া মালকে মালে ফাই বলে।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}