{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৩৪৩, আন্তর্জাতিক নাম্বারঃ ১৮৩ ৩৪৩-(৩০২/১৮৩) সুওয়াইদ ইবনু সাঈদ (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর যুগে কতিপয় লোক তাকে জিজ্ঞেস করে বলল, হে আল্লাহর রাসূল! কিয়ামত দিবসে আমরা কি আমাদের প্রতিপালককে দেখতে পাব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হাঁ! তিনি আরো বললেনঃ দুপুরে মেঘমুক্ত আকাশে সূর্য দেখতে কি তোমাদের কষ্ট হয়? চন্দ্রের চৌদ্দ তারিখে মেঘমুক্ত অবস্থায় চন্দ্র দেখতে কি তোমাদের কষ্ট হয়? সকলে বললেন, হে আল্লাহর রাসূল! তা হয় না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ঠিক তদ্রুপ কিয়ামত দিবসে তোমাদের বারাকাতময় মহামহিম প্রতিপালককে দেখতে কোনই কষ্ট অনুভব হবে না যেমন চন্দ্র ও সূর্য দেখতে কষ্ট অনুভব কর না। সে দিন এক ঘোষণাকারী ঘোষণা দিবে, যে যার উপাসনা করতো সে আজ তার অনুসরণ করুক। তখন আল্লাহ ব্যতীত তারা অন্য দেব-দেবী ও মূর্তিপূজার বেদীর উপাসনা করত তাদের কেউ অবশিষ্ট থাকবে না; সকলেই জাহান্নামে নিক্ষিপ্ত হবে। সৎ হোক বা অসৎ যারা আল্লাহর ইবাদাত করত তারাই কেবল অবশিষ্ট থাকবে এবং কিতাবীদের (যারা দেব-দেবী ও বেদীর উপাসক ছিল না তারাও বাকী থাকবে)। এরপর ইয়াহুদীদেরকে ডেকে জিজ্ঞেস করা হবে, তোমরা কার ইবাদাত করতে? তারা বলবে, আল্লাহর পুত্র উযায়র-এর। তাদেরকে বলা হবে মিথ্যা বলছো। আল্লাহ কোন স্ত্রী বা সন্তান গ্রহণ করেননি। তোমরা কি চাও? তারা বলবে, হে আল্লাহ! আমাদের খুবই পিপাসা পেয়েছে। আমাদের পিপাসা নিবারণ করুন। প্রার্থনা শুনে তাদেরকে ইঙ্গিত করে মরীচিকাময় জাহান্নামের দিকে জমায়েত করা হবে। সেখানে আগুনের লেলিহান শিখা যেন পানির ঢেউ খেলবে। এর একাংশ আরেক অংশকে গ্রাস করতে থাকবে। তারা এতে ঝাপিয়ে পড়বে। এরপর খৃস্টানদেরকে ডাকা হবে, বলা হবে, তোমরা কার ইবাদাত করতে? তারা বলবে, আল্লাহর পুত্র মাসীহ এর (ঈসার) উপাসনা করতাম। বলা হবে, মিথ্যা বলছ। আল্লাহ কোন স্ত্রী বা সন্তান গ্রহণ করেননি। জিজ্ঞেস করা হবে, এখন কি চাও? তারা বলবে, হে আমাদের রব! আমাদের দারুন পিপাসা পেয়েছে, আমাদের পিপাসা নিবারণ করুন। তখন তাদেরকেও পানির ঘাটে যাবার ইঙ্গিত করে জাহান্নামের দিকে হাকিয়ে নিয়ে জমায়েত করা হবে। এটিকে মরীচিকার ন্যায় মনে হবে। সেখানে আগুনের লেলিহান শিখা যেন পানির ঢেউ খেলবে। এর একাংশ অপর অংশকে গ্রাস করে নিবে। তারা তখন জাহান্নামে ঝাপিয়ে পড়তে থাকবে। শেষে সৎ হোক বা অসৎ এক আল্লাহর উপাসক ব্যতীত আর কেউ (ময়দানে) অবশিষ্ট থাকবে না। তখন আল্লাহ তা'আলা পরিচিত আকৃতিতে তাদের নিকট আসবেন। বলবেন, সবই তাদের স্ব স্ব উপাস্যের অনুসরণ করে চলে গেছে, আর তোমরা কার অপেক্ষা করছ? তারা বলবে, হে আমাদের প্রভু! যেখানে আমরা বেশী মুখাপেক্ষী ছিলাম সে দুনিয়াতেই আমরা অপরাপর মানুষ থেকে পৃথক থেকেছি এবং তাদের সঙ্গী হইনি। তখন আল্লাহ বলবেন, আমিই তো তোমাদের প্রতু। মু'মিনরা বলবে, \"আমরা তোমার থেকে আল্লাহর নিকট আশ্রয় প্রার্থনা করছি\" আল্লাহর সঙ্গে আমরা কিছুই শারীক করি না। এ কথা তারা দুই বা তিনবার বলবে। এমন কি কেউ কেউ অবাধ্যতা প্রদর্শনেও অবতীর্ণ হয়ে যাবে। আল্লাহ বলবেন, আচ্ছা, তোমাদের নিকট এমন কোন নিদর্শন আছে যদ্বারা তাকে তোমরা চিনতে পার? তারা বলবে অবশ্যই আছে। এরপর পায়ের সাক' (গোছা) উন্মোচিত হবে। তখন পৃথিবীতে যারা স্বতঃপ্রণোদিত হয়ে আল্লাহর উদ্দেশে সিজদা করত, সে মুহুর্তে তাদেরকে আল্লাহ সিজদা করতে অনুমতি দিবেন এবং তারা সবাই সিজদাবনত হয়ে পড়বে। আর যে কারো ভয়-ভীতি কিংবা লোক দেখানোর জন্য সিজদা করতো তার মেরুদণ্ড শক্ত ও অনমনীয় করে দেয়া হবে। যখনই তারা সিজদা করতে ইচ্ছা করবে তখনই তারা চিত হয়ে পড়ে যাবে। অতঃপর তারা তাদের মাথা উঠাবে এবং তিনি তার আসলরূপে আবির্ভূত হবেন। অতঃপর বলবেন, আমি তোমাদের রব, তারা বলবে, হ্যাঁ! আপনি আমাদের রব। তারপর জাহান্নামের উপর \"জাসর\" (পুল) স্থাপন করা হবে। শাফাআতেরও অনুমতি দেয়া হবে। মানুষ বলতে থাকবে, হে আল্লাহ! আমাদের নিরাপত্তা দিন, আমাদের নিরাপত্তা দিন। জিজ্ঞেস করা হল, হে আল্লাহর রাসূল! \"জাসর\" কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেনঃ এটি এমন স্থান যেখানে পা পিছলে যায়। সেখানে আছে নানা প্রকারের লৌহ শলাকা ও কাটা, দেখতে নাজদের সা'দান বৃক্ষের কাটার ন্যায়। মুমিনগণের কেউ তো এ পথ চোখের পলকের গতিতে, কেউ বিদ্যুৎ গতিতে, কেউ বায়ুর গতিতে, কেউ উত্তম অশ্ব গতিতে, কেউ উষ্ট্রের গতিতে অতিক্রম করবে। কেউ তো অক্ষত অবস্থায় নাযাত পাবে, আর কেউ তো হবে ক্ষতবিক্ষত অবস্থায় নাযাতপ্রাপ্ত। আর কতককে কাটাবিদ্ধ অবস্থায় জাহান্নামে নিক্ষেপ করা হবে। অবশেষে মুমিনগণ জাহান্নাম থেকে মুক্তি লাভ করবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ সে সত্তার কসম! যার হাতে আমার প্রাণ, ঐ দিন মু'মিনগণ তাদের ঐ সব ভাইদের স্বার্থে আল্লাহর সাথে এত অধিক বিতর্কে লিপ্ত হবে যারা জাহান্নামে রয়ে গেছে যে, তোমাদের পার্থিব অধিকারের ক্ষেত্রেও এমন বিতর্কে লিপ্ত হয় না। তারা বলবে, হে রব! এরা তো আমাদের সাথেই সিয়াম, সালাত আদায় করত, হজ্জ করত। তখন তাদেরকে নির্দেশ দেয়া হবে যে, যাও, তোমাদের পরিচিতদের উদ্ধার করে আন। উল্লেখ্য এরা জাহান্নামে পতিত হলেও মুখমণ্ডল আযাব থেকে রক্ষিত থাকবে। (তাই তাদেরকে চিনতে কোন অসুবিধা হবে না।) মুমিনগণ জাহান্নাম হতে এক বিরাট দলকে উদ্ধার করে আনবে। এদের অবস্থা এমন হবে যে, কারোর তো পায়ের নলা পর্যন্ত, আবার কারো হাটু পর্যন্ত দেহ আগুন ছাই করে দিবে। উদ্ধার শেষ করে মুমিনগণ বলবে, হে রব যাদের সম্পর্কে আপনি নির্দেশ প্রদান করেছিলেন, তাদের মাঝে আর কেউ অবশিষ্ট নেই। আল্লাহ বলবেন, পুনরায় যাও, যার অন্তরে এক দীনার পরিমাণও ঈমান অবশিষ্ট পাবে তাকেও উদ্ধার করে আন। তখন তারা আরো একদলকে উদ্ধার করে এনে তারা বলবে, হে রব! অনুমতিপ্রাপ্তদের কাউকেও রেখে আসিনি। আল্লাহ বলবেনঃ আবার যাও, যার অন্তরে অর্ধ দীনার পরিমাণও ঈমান অবশিষ্ট পাবে তাকেও বের করে আন। তখন আবার এক বিরাট দলকে উদ্ধার করে এনে তারা বলবে, হে রব! যাদের আপনি উদ্ধার করতে বলেছিলেন তাদের কাউকে ছেড়ে আসিনি। আল্লাহ বলবেনঃ আবার যাও, যার অন্তরে অণু পরিমাণও ঈমান বিদ্যমান, তাকেও উদ্ধার করে আন। তখন আবারও এক বিরাট দলকে উদ্ধার করে এনে তারা বলবে, হে রব! যাদের কথা বলেছিলেন তাদের কাউকেও রেখে আসিনি। সাহাবা আবূ সাঈদ আল খুদরী (রাযিঃ) বলেন, তোমরা যদি এ হাদীসের ব্যাপারে আমাকে সত্যবাদী মনে না কর তবে এর সমর্থনে নিম্নোক্ত আয়াতটি যদি চাও তবে তিলাওয়াত করতে পারঃ \"আল্লাহ অণু পরিমাণও যুলম করেন না এবং অণু পরিমাণ নেক কাজ হলেও আল্লাহ তা দ্বিগুণ করে দেন এবং তার নিকট হতে মহাপুরস্কার প্রদান করেন\"- (সূরাহ আন নিসা ৪ঃ ৪০)। এরপর আল্লাহ তা'আলা বলবেনঃ ফেরেশতারা সুপারিশ করলেন, নবীগণও সুপারিশ করলেন এবং মুমিনরাও সুপারিশ করেছে, কেবলমাত্র আরহামুর রাহিমীন পরম দয়াময়ই রয়ে গেছেন। এরপর তিনি জাহান্নাম থেকে এক মুঠো তুলে আনবেন, ফলে এমন একদল লোক মুক্তি পাবে যারা কখনো কোন সৎকর্ম করেনি এবং আগুনে জ্বলে লাল হয়ে গেছে। পরে তাদেরকে জান্নাতের প্রবেশ মুখের নাহরুল হায়াতে ফেলে দেয়া হবে। তারা এতে এমনভাবে সতেজ হয়ে উঠবে, যেমনভাবে শস্য অঙ্কুর স্রোতবাহিত পানি ভেজা উর্বর জমিতে সতেজ হয়ে উঠে। (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ) তোমরা কি কোন বৃক্ষ কিংবা পাথরের আড়াল কোন শস্যদানা অঙ্কুরিত হতে দেখনি? যেগুলো সূর্য কিরণের মাঝে থেকে সেগুলো হলদে ও সবুজ রূপ ধারণ করে আর যেগুলো ছায়াযুক্ত স্থানে থাকে সেগুলো সাদা হয়ে যায়। সাহাবাগণ বললেন, হে আল্লাহর রাসূল! মনে হয় আপনি যেন গ্রামাঞ্চলে পশু চরিয়েছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এরপর তারা নহর থেকে মুক্তার ন্যায় ঝকঝকে অবস্থায় ওঠে আসবে এবং তাদের গ্রীবাদেশে মোহরাঙ্কিত থাকবে যা দেখে জান্নাতীগণ তাদের চিনতে পারবেন। এরা হর ‘উতাকাউল্লাহ-আল্লাহর পক্ষ থেকে মুক্তিপ্রাপ্ত। আল্লাহ তা'আলা সৎ আমল ব্যতীতই তাদেরকে জান্নাতে দাখিল করবেন। এরপর আল্লাহ তাদেরকে লক্ষ্য করে বলবেনঃ যাও, জান্নাতে প্রবেশ কর। আর যা কিছু দেখছ সব কিছু তোমাদেরই। তারা বলবে, হে রব! আপনি আমাদেরকে এত দিয়েছেন যা সৃষ্টজগতের কাউকে দেননি। আল্লাহ বলবেনঃ তোমাদের জন্য আমার নিকট এর চেয়েও উত্তম বস্তু আছে। তারা বলবে, কি সে উত্তম বস্তু? আল্লাহ বলবেনঃ সে হল আমার সন্তুষ্টি। এরপর আর কখনো তোমাদের উপর অসন্তুষ্ট হবো না। ইমাম মুসলিম (রহঃ) বলেন : শাফা'আত সম্পৰ্কীয় এ হাদীসটি আমি ঈসা ইবনু হাম্মাদ যুগবাতুর মিসরী এর নিকট পাঠ করতে বললাম, আপনি লায়স ইবনু সা'দ থেকে নিজে এ হাদীসটি শুনেছেন? আমি কি আপনার পক্ষ থেকে এ হাদীসটি বর্ণনা করতে পারি? তিনি উত্তর করলেন, হ্যাঁ! এরপর আমি ঈসা ইবনু হাম্মাদকে হাদীসটি এ সূত্রে শুনিয়েছি যে, ঈসা ইবনু হাম্মদ (রহঃ) আবূ সাঈদ আল খুদরী (রাযিঃ) এর সূত্রে বর্ণনা করেছেন। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললাম, হে আল্লাহর রাসূল! আমরা কি আমাদের প্রভুকে দেখতে পাবো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তর করলেনঃ মেঘমুক্ত আকাশে সূর্য দেখতে ভীড়ের কারণে তোমাদের কি কোন অসুবিধা হয়? আমরা বললাম, না ...। এভাবে হাদীসটির শেষ পর্যন্ত তুলে ধরলাম। এ হাদীসটি হাফিয ইবনু মাইসারাহ বর্ণিত হাদিসেরই অনুরুপ। তিনিبِغَيْرِ عَمَلٍ عَمِلُوهُ وَلاَ قَدَمٍ قَدَّمُوهُ এ অংশটুকুর পর فَيُقَالُ لَهُمْ لَكُمْ مَا رَأَيْتُمْ অর্থাৎ তাদের বলা হবেঃ তোমাদের জন্য রয়েছে যা তোমরা দেখছ। আবূ সাঈদ আল খুদরী (রাযিঃ) বলেন, আমার কাছে রিওয়ায়াতে পৌছেছে যে, জাসর (পুল) চুল অপেক্ষা অধিক সূক্ষ্ম ও তরবারি অপেক্ষা অধিক তীক্ষ। তাছাড়া লায়সের হাদিসে فَيَقُولُونَ رَبَّنَا أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنَ الْعَالَمِينَ বাক্যটির পরবর্তী অংশগুলো উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৩৫১, ইসলামিক সেন্টারঃ ৩৬২)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		}
	]
}