{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৬০, আন্তর্জাতিক নাম্বারঃ ১৭৫১ ৪৪৬০-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী, কুতাইবাহ ইবনু সাঈদ ও আবূ তাহির (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, হুনায়নের যুদ্ধের সময় আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বের হলাম। আমরা যখন শত্রুদের মুখোমুখি হলাম তখন মুসলিমদের মধ্যে ছুটাছুটি আরম্ভ হলো। এ সময় আমি একজন মুশরিককে দেখতে পেলাম যে, সে একজন মুসলিমের উপর চড়াও করছে। তখন আমি একটু ঘুরে এসে তার পিছন দিক দিয়ে তার কাঁধের উপর আঘাত করলাম। তখন সে আমার দিকে অগ্রসর হয়ে আমাকে এমনভাবে চেপে ধরল যে, আমি এতে মৃত্যুর গন্ধ পেলাম। এরপর সে মৃত্যুমুখে চলে পড়ল এবং আমাকে ছেড়ে দিলো। এরপর আমি 'উমার ইবনু খাত্তাব (রাযিঃ)-এর সঙ্গে একত্রিত হলাম। তিনি বললেন, লোকদের কী হয়েছে? আমি বললাম, এ আল্লাহর ব্যাপার (ইচ্ছা)। তারপর (পলায়নপর) লোকেরা ফিরে এলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন (যুদ্ধ ক্ষেত্রে) বসেছিলেন। তিনি বললেন, যে মুসলিম সৈন্য অপর কোন শত্রু সৈন্যকে হত্যা করেছে এবং এতে তার প্রমাণ আছে, তাহলে তার সম্পদ তারই (হত্যাকারী মুজাহিদেরই প্রাপ্য)। বর্ণনাকারী বলেন, তখন আমি দাঁড়ালাম এবং বললাম, আমার জন্যে কেউ সাক্ষ্য দেবে? তারপর আমি বসে পড়লাম। তিনি আবারও সেরূপ কথা বললেন, আমি দাঁড়ালাম এবং বললাম কেউ আমার জন্যে সাক্ষ্য দেবে? এবং আমি বসে পড়লাম। তিনি তৃতীয়বারও ঐরূপ বললেন। তা শুনে আমি (আবার) দণ্ডায়মান হলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার কী হয়েছে, হে আবূ কাতাদাহ! আমি তার কাছে সমস্ত ঘটনা খুলে বললাম। তখন এক ব্যক্তি বলল, হে আল্লাহর রসূল! তিনি (আবূ কাতাদাহ) সত্য বলেছেন। ঐ নিহত ব্যক্তির (পরিত্যক্ত) সম্পদ আমার কাছে রক্ষিত আছে। আপনি তার হক আমাকে দেয়ার ব্যাপারে তাকে রাজি করিয়ে দেন। তখন আবূ বাকর সিদীক (রাযিঃ) বললেন, না, আল্লাহর কসম! তা হতে পারে না। আল্লাহর সিংহসমূহের মধ্য হতে কোন এক সিংহ (যোদ্ধা) যিনি আল্লাহ ও তার রসূলের পক্ষে যুদ্ধ করেছেন, আর তার প্রাপ্য সম্পদ যিনি তোমাকে প্রদান করবেন এমন হতে পারে না। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ (আবূ বাকর) ঠিকই বলেছেন। সুতরাং তিনি তাকে (আবূ কাতাদাকেই) তা প্রদানের নির্দেশ দিলেন এবং তিনি তা আমাকেই দিলেন। আবূ কাতাদাহ (রাযিঃ) বলেন, আমি তা থেকে লৌহ বর্মটি বিক্রি করলাম এবং তা দিয়ে বানী সালামার মহল্লায় একটি ফলের বাগান খরিদ করলাম। এ ছিল আমার ইসলামী জীবনের প্রথম অর্জিত সম্পদ। লায়স (রহঃ) এর বর্ণিত হাদীসে উল্লেখ আছে যে, আবূ বাকর (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর সিংহসমূহের মধ্য থেকে কোন এক সিংহকে বাদ দিয়ে তা কুরায়শের কোন শৃগালকে (কাপুরুষকে) প্রদান করেন না লায়স (রহঃ) এর বর্ণনায় রয়েছে এটিই আমার প্রথম সম্পদ যা আমি সংগ্রহ করেছি। (ইসলামিক ফাউন্ডেশন ৪৪১৬, ইসলামিক সেন্টার ৪৪১৮)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		}
	]
}