{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4573,
			"arabicnumber": "1755",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৬৫, আন্তর্জাতিক নাম্বারঃ ১৭৫৫ ৪৪৬৫-(৪৬/১৭৫৫) যুহায়র ইবনু হারব (রহঃ) ..... সালামাহ্ (রাযিঃ) বলেন, আমরা ফাযারাহ গোত্রের সাথে যুদ্ধ করেছিলাম। আবূ বাকর (রাযিঃ) ছিলেন আমাদের আমীর। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আমাদের আমীর নিযুক্ত করেছিলেন। যখন আমাদের এবং পানির স্থানের মাঝে একঘণ্টা সময়ের ব্যবধান ছিল, তখন আবূ বাকর (রাযিঃ) আমাদেরকে (রাতের শেষের দিকে সেখানে অবতরণের) নির্দেশ দিলেন। সুতরাং আমরা রাতের শেষাংশেই সেখানে অবতরণ করলাম। এরপর বিভিন্ন দিক দিয়ে অতর্কিত আক্রমণ চালিয়ে পানির নিকট পৌছলেন। আর যাদেরকে তার বিরুদ্ধে পেলেন হত্যা এবং বন্দী করলেন। আমি লোকদের একটি দলকে দেখতে পাচ্ছি যাদের মধ্যে শিশু ও নারী রয়েছে। আমি আশংকা করছিলাম যে, তারা হয়তোবা আমার আগেই পাহাড়ে পৌছে যাবে। অতএব আমি তাদের ও পাহাড়ের মাঝে তীর নিক্ষেপ করলাম। তারা তখন তীর দেখতে পেয়ে থেমে গেল। তখন আমি তাদের হাঁকিয়ে নিয়ে এলাম। তাদের মাঝে চামড়ার পোশাক পরিহিত বানী ফাযারার একজন মহিলাও ছিল এবং (রাবী বলেন) তার সঙ্গে তার এক কন্যা ছিল। সে ছিল আরবের সবচেয়ে সুন্দরী। আমি সকলকেই হাকিয়ে আবূ বাকর (রাযিঃ) এর কাছে নিয়ে এলাম। আবূ বকর (রাযিঃ) মহিলার কন্যাটি আমাকে নফল হিসেবে প্রদান করলেন। এরপর আমি মদীনায় ফিরে এলাম। আমি তখনও তার বস্তু উঠাইনি। পরে বাজারে আমার সাথে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাক্ষাৎ হলে তিনি বললেন, হে সালামাহ্ তুমি মহিলাটি আমাকে দিয়ে দাও। তখন আমি বললাম, হে আল্লাহর রসূল! আল্লাহ তা'আলার কসম, তাকে আমার অত্যধিক পছন্দ হয়েছে এবং এখনও আমি তার বস্ত্র উঠাইনি। পরের দিন আবারও বাজারে আমার সাথে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাক্ষাৎ হলো। তখন তিনি বললেন, হে সালামাহ! তুমি মহিলাটি আমাকে দিয়ে দাও। “আল্লাহ তোমার পিতার কল্যাণ করুন।” তখন আমি বললাম, হে আল্লাহর রসূল আল্লাহর কসম! সে আপনার জন্যই। আমি তার বস্ত্র উন্মোচন করিনি। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ কন্যাটিকে মক্কায় পাঠিয়ে দিয়ে তার বিনিময়ে কয়েকজন মুসলিম বন্দীকে মুক্ত করে আনলেন, যারা মক্কায় ইতোপূর্বে বন্দী ছিল। (ইসলামিক ফাউন্ডেশন ৪৪২১, ইসলামিক সেন্টার ৪৪২৩)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 54
			}
		}
	]
}