{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4603,
			"arabicnumber": "1771.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৯৪, আন্তর্জাতিক নাম্বারঃ ১৭৭১ ৪৪৯৪-(৭০/১৭৭১) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন মুহাজিরগণ মক্কাহ্ থেকে মদীনায় প্রবেশ করেন তখন কোন কিছুই তাদের হাতে ছিল না। (তারা ছিলেন তখন সম্পূর্ণ নিঃস্ব) আর আনসারগণ ছিলেন জমা-জমির স্বত্বাধিকারী। তখন আনসারগণ মুহাজিরদেরকে তাদের খেজুর বাগানের অর্ধেক এ শর্তে ভাগ করে দেন যে, প্রতি বছর বাগানে মুহাজিরগণ পরিশ্রম ও পরিচর্যা করে উৎপাদিত ফসলের অর্ধেক তাদেরকে দেবেন। আনাস ইবনু মালিক (রাযিঃ) এর মাতা উম্মু সুলায়ম, তিনি আবদুল্লাহ ইবনু আবূ তালহার মাতা ছিলেন। আর আবদুল্লাহ ছিলেন আনাসের বৈপিত্রেয় ভাই। আনাসের মাতা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তার একটি খেজুর গাছ দান করেন এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটা দিলেন তার আযাদকৃত দাসী উম্মু আইমানকে যিনি উসামাহ ইবনু যায়দের মাতা ছিলেন। ইবনু শিহাব (রাযিঃ) বলেন, আমাকে আনাস ইবনু মালিক (রাযিঃ) খবর দিয়েছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খাইবারের যুদ্ধ শেষে মদীনায় প্রত্যাবর্তন করলেন তখন মুহাজিরগণ আনসারদেরকে তাদের দানকৃত ফলের বাগানসমূহ ফিরিয়ে দেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও আমার মাতাকে তার দানকৃত বাগান ফেরত দেন এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু আইমানকে তার পরিবর্তে নিজের বাগানের এক অংশ প্রদান করেন। ইবনু শিহাব (রহঃ) বলেন যে, উম্মু আইমান-যিনি উসামাহ ইবনু যায়দের মাতা ছিলেন, তিনি আবদুল্লাহ ইবনু আবদুল মুক্তালিবের দাসী ছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিতার ইন্তিকালের পর আমিনাহর গর্ভ হতে যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভূমিষ্ট হন তখন উম্মু আইমান তাকে বড় হওয়া পর্যন্ত লালন-পালন করেন। এরপর তিনি তাকে আযাদ করে দেন। পরবর্তীতে যায়দ ইবনু হারিসাহর সঙ্গে তাকে বিয়ে দিয়ে দেন। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকালের পাঁচ মাস পর ইন্তিকাল করেন। (ইসলামিক ফাউন্ডেশন ৪৪৫১, ইসলামিক সেন্টার ৪৪৫৩)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 84
			}
		}
	]
}