{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫০৪, আন্তর্জাতিক নাম্বারঃ ১৭৭৫ ৪৫০৪-(৭৬/১৭৭৫) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ (রহঃ) ..... 'আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি হুনায়নের যুদ্ধের দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। আমি এবং আবূ সুফইয়ান ইবনু হারিস ইবনু আবদুল মুত্তালিব রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একেবারে সঙ্গেই ছিলাম। আমরা কখনও তার থেকে আলাদা হইনি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি সাদা বর্ণের খচ্চরের উপর আরোহণ করেছিলেন। সে খচ্চরটি ফারওয়াহ ইবনু নুফাসাহ হুযামী তাকে হাদইয়্যাহ্ স্বরূপ দিয়েছিলেন। (তাকে দুলদুল নামে ডাকা হতো।) যখন মুসলিম এবং কাফির পরস্পর সম্মুখ যুদ্ধে লিপ্ত হলো তখন মুসলিমগণ (যুদ্ধের এক পর্যায়ে) পেছনের দিকে পলায়ন করতে লাগলেন। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় পায়ের গোড়ালি দিয়ে নিজের খচ্চরকে আঘাত করে কাফিরদের দিকে ধাবিত করছিলেন। আব্বাস (রাযিঃ) বলেন, আমি তার খাচ্চরের লাগাম ধরে রেখেছিলাম এবং একে থামিয়ে রাখার চেষ্টা করছিলাম যেন দ্রুত গতিতে অগ্রসর হতে না পারে। আর আবূ সুফইয়ান (রাযিঃ) তার খচ্চরের রেকাব' (হাউদাজের বন্ধনের পট্টি) ধরে রেখেছিলেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে “আব্বাস! আসহাবে সামুরাকে আহবান করো। আব্বাস (রাযিঃ) বলেন- আর তিনি ছিলেন উচ্চ আওয়াজের অধিকারী ব্যক্তি- তখন আমি উচ্চস্বরে আওয়াজ দিয়ে বললাম, হে আসহাবে সামুরাহ! তোমরা কোথায় যাচ্ছ? তিনি বলেন,আল্লাহর কসম! তা শুনামাত্র তারা এমনভাবে প্রত্যাবর্তন করতে শুরু করলেন যেমনভাবে গাভী তার বাচ্চার আওয়াজ শুনে দ্রুত দৌড়ে আসে এবং তারা বলতে লাগলো, আমরা আপনার নিকট হাযির, আমরা আপনার নিকট হাযির। রাবী বলেন, এরপর তারা কাফিরদের সাথে পুনরায় যুদ্ধে লিপ্ত হন। তিনি আনসারদেরকেও এমনিভাবে আহ্বান করলেন যে, হে আনসারগণ! রাবী বলেন, এরপর আহ্বান সমাপ্ত করা হলো বানী হারিস ইবনু খাযরাজের মাধ্যমে। (তারা আহ্বান করলেন, হে বানী হারিস ইবনুল খাযরাজ।) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় খচ্চরের উপর আরোহিত অবস্থায় আপন ঘাড় উচু করে তাদের যুদ্ধের অবস্থা দেখেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটাই হলো যুদ্ধের উত্তেজনাপূর্ণ চরম মুহূর্ত। রাবী বলেন, এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কয়েকটি পাথরের টুকরা হাতে নিলেন এবং এগুলো তিনি বিধর্মীদের মুখের উপর ছুড়ে মারলেন। এরপর বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রবের কসম! তারা পরাজিত হয়েছে। আব্বাস (রাযিঃ) বলেন, আমি যুদ্ধক্ষেত্রে যুদ্ধের অবস্থান পরিদর্শন করতে গিয়ে দেখলাম যে, যথারীতি যুদ্ধ চলছে। এমন সময় তিনি পাথরের টুকরোগুলো নিক্ষেপ করলেন। আল্লাহর শপথ। তখন হঠাৎ দেখি যে, কাফিরদের শক্তি নিস্তেজ হয়ে গেল এবং তাদের যুদ্ধের মোড় ঘুরে গেল। (ইসলামিক ফাউন্ডেশন ৪৪৬১, ইসলামিক সেন্টার ৪৪৬৩)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		}
	]
}