{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4633,
			"arabicnumber": "1785.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫২৫, আন্তর্জাতিক নাম্বারঃ ১৭৮৫ ৪৫২৫-(৯৪/১৭৮৫) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... আবূল ওয়ায়িল (রাযিঃ) হতে বর্ণিত। তিনি বলেন, সাহল ইবনু হুনায়ফ (রাযিঃ) সিফফীন দিবসে উঠে দাঁড়ালেন এবং বললেন, \"হে লোক সকল! তোমরা নিজেদের অভিযুক্ত মনে করবে। আমরা হুদাইবিয়ার দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। আমরা এটিকে যুদ্ধ মনে করলে সেদিন অবশ্যই আমরা যুদ্ধ করতাম। এটি হচ্ছে সেই সন্ধির কথা যা রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং মুশরিকদের মধ্যে হয়েছিল। তখন উমার ইবনুল খাত্তাব (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললেন, \"হে আল্লাহর রসূল! আমরা কি সত্যের উপর নই, আর তারা বাতিলের উপর নয়\" তিনি বললেনঃ “হ্যাঁ, তাই।” তিনি আবার জিজ্ঞেস করলেন, আমাদের নিহতরা কি জান্নাতী এবং তাদের নিহতরা কি জাহান্নামী নয়?” তিনি বললেনঃ হ্যাঁ। তখন তিনি বললেন, তাহলে কী কারণে আমরা দীনের ব্যাপারে লাঞ্ছনা মেনে নিয়ে ফিরে যাবো, অথচ এখনো এ ব্যাপারে তাদের ও আমাদের মধ্যে আল্লাহর কোন ফায়সালা আসেনি? তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে খাত্তাব পুত্র! নিঃসন্দেহে আমি আল্লাহর রসূল। আর তিনি অবশ্যই কখনো আমাকে ধ্বংস করবেন না। রাবী বলেন, তখন উমর (রাযিঃ) চলে গেলেন। তিনি ক্রোধে ধৈর্যধারণ করতে পারছিলেন না। তাই তিনি আবূ বাকরের কাছে এলেন এবং তাকে বললেন, হে আবূ বাকর! আমরা কি হকের উপর এবং তারা কি বাতিলের উপর নয়? তিনি বললেন, অবশ্যই। আবার তিনি বললেন, “আমাদের নিহতরা কি জান্নাতী এবং তাদের নিহতরা কি জাহান্নামী নয়? তিনি বললেন, নিশ্চয়ই। তখন তিনি বললেন, \"তাহলে কী কারণে আমরা আমাদের দীনের ব্যাপারে লাঞ্ছনা নিয়ে ফিরে যাবো, অথচ এখনো এ ব্যাপারে আমাদের এবং তাদের মধ্যে আল্লাহ কোন ফায়সালা দেননি? তখন তিনি বললেন, হে খাত্তাব তনয়! নিশ্চয়ই তিনি আল্লাহর রসূল আল্লাহ কখনও তার বিনাশ করবেন না। রাবী বলেন, এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি বিজয়ের সুসংবাদ নিয়ে কুরআন অবতীর্ণ হলো। তখন তিনি উমারকে ডেকে পাঠালেন এবং তার সম্মুখে তা পাঠ করলে তখন তিনি বললেন, “হে আল্লাহর রসূল! এ কি বিজয়?\" তিনি বললেন, হ্যাঁ। তখন তার অন্তর শান্ত হলো এবং তিনি ফিরে গেলেন। (ইসলামিক ফাউন্ডেশন ৪৪৮২, ইসলামিক সেন্টার ৪৪৮৪)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 115
			}
		}
	]
}