{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4640,
			"arabicnumber": "1788",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৩২, আন্তর্জাতিক নাম্বারঃ ১৭৮৮ ৪৫৩২-(৯৯/১৭৮৮) যুহায়র ইবনু হারব ও ইসহাক ইবনু ইবরাহীম, ইবরাহীম তাইমীর পিতা থেকে বর্ণনা করেন। তিনি বলেন যে, আমরা হুযাইফাহ্ (রাযিঃ) এর কাছে ছিলাম। তখন এক ব্যক্তি বলে উঠলো, “হায়, আমি যদি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে পেতাম, তবে তার সঙ্গে মিলে একত্রে যুদ্ধ করতাম এবং তাতে কোনরূপ পিছপা হতাম না।\" হুযাইফাহ্(রাযিঃ) বললেন, হয়তো তা তুমি করতে, কিন্তু আমি তো আহযাবের রাতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম (সে রাতে) প্রচণ্ড বায়ু ও তীব্র শীত আমাদের কাবু করে ফেলেছিল। এমনি সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোষণা করলেন, \"ওহে! এমন কেউ আছে কি যে আমাকে শত্রুর খবর এনে দেবে, আল্লাহ তা'আলা তাকে কিয়ামতের দিন আমার সঙ্গে (মর্যাদার আসনে) রাখবেন?” আমরা তখন চুপ করে রইলাম এবং আমাদের মধ্যে কেউ তার সে আহ্বানে সাড়া দেয়নি। তিনি আবার বললেন, \"ওহে! এমন কোন ব্যক্তি আছে কি যে আমাকে শত্রুপক্ষের খবর এনে দেবে, আল্লাহ তা'আলা তাকে কিয়ামতের দিন আমার সঙ্গে রাখবেন?\" এবারও আমরা চুপ রইলাম আর আমাদের মধ্যে কেউ তার আহানে সাড়া দেয়নি। তিনি আবার ঘোষণা করলেন, \"ওহে! এমন কেউ আছে কি যে আমাকে শত্রুপক্ষের খবর এনে দেবে, আল্লাহ তা'আলা কিয়ামতের দিন তাকে আমার সঙ্গে রাখবেন? এবারও আমরা চুপ করে রইলাম এবং আমাদের কেউ তার আহ্বানে সাড়া দেয়নি। এবার তিনি বললেনঃ হে হুযাইফাহ্ ওঠো এবং তুমি শক্ৰদের খবরাদি আমাদেরকে এনে দাও। রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন এবার আমার নাম ধরেই ডাক দিলেন, তাই উঠা ছাড়া আমার আর কোন উপায় ছিল না। এবার তিনি বললেনঃ “শত্রুপক্ষের খবর আমাকে এনে দাও, কিন্তু সাবধান, তাদের আমার বিরুদ্ধে উত্তেজিত করো না। তারপর আমি যখন তার নিকট থেকে প্রস্থান করলাম, তখন মনে হচ্ছিল আমি যেন উষ্ণ আবহাওয়ার মধ্য দিয়ে চলেছি। এভাবে আমি তাদের (শত্রুপক্ষের) নিকটে পৌছে গেলাম। তখন আমি লক্ষ্য করলাম, আবূ সুফইয়ান আগুনের দ্বারা তার পিঠে ছেক দিচ্ছে। আমি তখন একটি তীর তুলে ধনুকে সংযোজন করলাম এবং তা নিক্ষেপ করতে মনস্থ করলাম। এমন সময় আমার মনে পড়ে গেল যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলে দিয়েছেন, \"তাদেরকে আমার বিরুদ্ধে ক্ষেপিয়ে তুলো না।\" আমি যদি তখন তীর নিক্ষেপ করতাম তবে তীর নিরঘাৎ লক্ষ্যভেদ করতো, অগত্যা আমি ফিরে আসলাম এবং ফিরে আসার সময়ও উষ্ণতার মধ্য দিয়ে অতিক্রমের মতো উষ্ণতা অনুভব করলাম। তারপর যখন ফিরে এলাম, তখন প্রতিপক্ষের খবর তাকে প্রদান করলাম। আমার দায়িত্ব পালন করে অবসর হতেই আবার আমি শীতের তীব্রতা অনুভব করলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার অতিরিক্ত একটি কম্বল দিয়ে আমাকে আবৃত করে দিলেন, যা তিনি সাধারণতঃ সালাত আদায়ের সময় গায়ে দিতেন। তারপর আমি ভোর পর্যন্ত একটানা নিদ্রায় বিভোর রইলাম। যখন ভোর হল তখন তিনি বললেনঃ “হে গভীর নিদ্রামগ্ন। এখন উঠে পড়ো।\" (ইসলামিক ফাউন্ডেশন ৪৪৮৯, ইসলামিক সেন্টার ৪৪৯১)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 122
			}
		}
	]
}