{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৬১, আন্তর্জাতিক নাম্বারঃ ১৮০২ ৪৫৬১-(১২৪/...) আবূ তাহির (রহঃ) ..... সালামাহ্ ইবনু আকওয়া (রাযিঃ) হতে বর্ণিত। তিনি বলেন, খাইবারের যুদ্ধের দিন আমার ভাই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে থেকে বীরত্বের সাথে যুদ্ধ করেন। তার তরবারি ফিরে এসে স্বয়ং তাকেই নিহত করে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ তার ব্যাপারে নানা মন্তব্য করতে থাকেন এবং তার শাহাদাতের ব্যাপারে সন্দেহ করেন। তারা বলাবলি করেন যে, সে এমন লোক যে তার নিজ অস্ত্রের আঘাতে মারা গেছে। আর তারা তার কোন কোন ব্যাপারেও সন্দেহ করেন। সালামাহ্ বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাইবার থেকে ফিরলে আমি বললাম, \"হে আল্লাহর রসূল! আপনি আমাকে অনুমতি দিন, আমি তার কবিতার কয়েকটি পংক্তি আবূত্তি করি।\" রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে অনুমতি দিলেন। উমার ইবনুল খাত্তাব (রাযিঃ) তখন বলে উঠলেন, আমি জানি, তুমি কী বলবে। রাবী বলেন, তারপর আমি আবূত্তি করলামঃ “হে আল্লাহ! আপনি না করলে, আমরা হিদায়াত পেতাম না, আমরা সদাকাহ্ দিতাম না এবং সালাত আদায় করতাম না।” তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি যথার্থই বলেছো। তখন আমি আবূত্তি করে চললামঃ “আমাদের প্রশান্তি দান করুন এবং শত্রুর সম্মুখীন হলে আমাদের পা অটল রাখুন। মুশরিকরা আমাদের প্রতি বিদ্রোহী হল।\" যখন আমি আমার কবিতা আবূত্তি শেষ করলাম, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ কবিতাটি কে রচনা করেছে? আমি বললাম, আমার ভাই। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তার প্রতি সদয় হোন। তখন আমি বললাম, হে আল্লাহর রসূল! কিছু লোক তার প্রতি আল্লাহর রহমত বর্ষণে দ্বিধাগ্রস্ত! তারা বলেন, সে এমন লোক যে তার নিজ অস্ত্রের আঘাতে মারা গেছে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে জিহাদ করতে করতে মুজাহিদের মত মরেছে। রাবী ইবনু শিহাব (রহঃ) বলেন, তারপর আমি সালামার এক পুত্রকে প্রশ্ন করলে তিনি আমাকে তার পিতার সূত্রে অনুরূপ হাদীস বর্ণনা করেন। তবে ব্যতিক্রম এতটুকু যে, তিনি বলেন, আমি যখন বললাম, কিছু কিছু লোক তার প্রতি দু'আ করতে দ্বিধাগ্রস্ত, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তারা মিথ্যা বলেছে। সে জিহাদ করতে করতে মুজাহিদের মত মারা গেছে। তার দুটি পুরস্কার এজন্যে নির্ধারিত রয়েছে। এবং তিনি তখন তার দু'টি অঙ্গুলি দ্বারা ইশারা করলেন। (ইসলামিক ফাউন্ডেশন ৪৫১৮, ইসলামিক সেন্টার ৪৫২০)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		}
	]
}