{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4915,
			"arabicnumber": "1901",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮০৯, আন্তর্জাতিক নাম্বারঃ ১৯০১ ৪৮০৯-(১৪৫/১৯০১) আবূ বাকর ইবনু নাযর ইবনু আবূ নাযর, হারূন ইবনু আবদুল্লাহ, মুহাম্মাদ ইবনু রাফি’ ও ‘আবদ ইবনু হুমায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বুসায়সা (রাযিঃ) কে আবূ সুফইয়ানের বাণিজ্যিক কাফিলার গতিবিধি লক্ষ্য করার জন্যে পাঠান। তারপর তিনি ফিরে আসলেন। তখন আমি ও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাড়া ঘরে আর কেউই ছিল না। রাবী বলেন, আমি স্মরণ করতে পারছি না, তিনি (আনাস) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন সহধর্মিণীর কথাও বলেছেন কি-না। এরপর তিনি সমুদয় ঘটনা বর্ণনা করলেন। অতঃপর বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলেন এবং (লোকজনকে লক্ষ্য করে) তিনি বললেন, আমি দুশমনের খোজে বের হচ্ছি। যার সওয়ারী মওজুদ আছে সে যেন আমাদের সঙ্গে সওয়ার হয়ে যায়। তখন কিছুলোক মদীনার উপরাঞ্চল থেকে তাদের সওয়ারী নিয়ে আসার অনুমতি চাইলেন। তখন তিনি বললেন, না; কেবল যাদের সওয়ারী প্রস্তুত আছে তারাই যাবে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তার সাহাবীগণ রওনা করলেন এবং মুশরিকদের পূর্বেই বদরে গিয়ে পৌছলেন। এর পরপরই মুশরিকরা এসে পৌছলো। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের কেউ যেন কোন ব্যাপারে আমার অগ্রবর্তী না হয়, যতক্ষণ না আমি তার সামনে থাকি। এরপর মুশরিকরা নিকটবর্তী হলো। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা জান্নাতের দিকে অগ্রসর হও যার প্রশস্ততা আসমান ও যমীনের প্রশস্ততার মত। রাবী বলেন, উমায়র ইবনু হুমাম আনসারী (রাযিঃ) জিজ্ঞেস করলেন, হে আল্লাহর রসূল! জান্নাতের প্রশস্ততা কি আসমান ও যমীনের প্রশস্ততার ন্যায়? তিনি বললেন, হ্যাঁ। উমায়র বলে উঠলেন, বাহ, বাহ, কী চমৎকার! তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, বাহ, বাহ্, বলতে তোমাকে কিসে উদ্বুদ্ধ করলো হে! তিনি বললেন, হে আল্লাহর রসূল! বরং আল্লাহর কসম! আমি তার অধিবাসী হওয়ার আশায়ই এরূপ বলেছি। তখন তিনি বললেন, তুমি নিশ্চয়ই তার অধিবাসী (হবে)। রাবী বলেন, তারপর তিনি তার তৃণ থেকে কয়েকটি খেজুর বের করলেন এবং তা খেতে লাগলেন। তারপর বললেন, আমি যদি এ খেজুরগুলো খেয়ে শেষ করা পর্যন্ত বেঁচে থাকি তবে তাও হবে এক দীর্ঘ জীবন। রাবী বলেন, তারপর তিনি তার কাছে রক্ষিত খেজুরগুলো ছুড়ে ফেলে দিলেন তারপর জিহাদে প্রবৃত্ত হলেন এমনকি শেষ পর্যন্ত শহীদ হলেন। (ইসলামিক ফাউন্ডেশন ৪৭৬২, ইসলামিক সেন্টার ৪৭৬৩)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 210
			}
		}
	]
}