{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4934,
			"arabicnumber": "1912.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮২৮, আন্তর্জাতিক নাম্বারঃ ১৯১২ ৪৮২৮-(১৬০/১৯১২) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু হারাম বিনতু মিলহান (রাযিঃ) এর ঘরে যেতেন। তিনি তাকে আপ্যায়ন করতেন। উম্মু হারাম (রাযিঃ) ছিলেন, উবাদাহ ইবনু সামিত (রাযিঃ) এর স্ত্রী। একদা তিনি তার ঘরে গেলেন এবং তিনি তাকে (চিরাচরিত অভ্যাস অনুযায়ী) আপ্যায়ন করলেন। তারপর তিনি তার (রসূলাল্লাহর) মাথার উকুন দেখতে বসলেন এবং এ অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুমিয়ে পড়লেন। তারপর তিনি যখন জাগ্রত হলেন তখন তিনি হাসছিলেন। উম্মু হারাম (রাযিঃ) বলেন, আমি তখন বললাম, হে আল্লাহর রসূল! আপনার হাসির কারণ কী? তিনি বললেন, আমার উম্মাতের এমন কিছু সংখ্যক লোককে আমার সম্মুখে পেশ করা হলো, যারা আল্লাহর পথের যোদ্ধারূপে রাজা-বাদশাহের ন্যায় সাগর পৃষ্ঠে সিংহাসনে আসীন হবেন। অথবা বলেছেন, রাজা-বাদশাহর মতো সিংহাসনে আসীন হবেন। রাবী সন্দেহ পোষণ করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন বাক্যটি বলেছেন। উম্মু হারাম (রাযিঃ) বলেন, তখন আমি বললাম, হে আল্লাহর রসূল! আপনি আল্লাহর কাছে দু'আ করুন যেন তিনি আমাকেও তাদের সঙ্গে শামিল করেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্যে দু'আ করলেন। এরপর তিনি মাথা রেখে ঘুমিয়ে পড়লেন। আবার জেগে হাসতে লাগলেন। আমি জিজ্ঞেস করলাম, হে আল্লাহর রসূল! আপনাকে কিসে হাসাচ্ছে? তিনি বললেন, আমার উম্মাতের কিছু সংখ্যক লোককে আমার সম্মুখে পেশ করা হয়, আল্লাহর পথের যোদ্ধারূপে... পূর্বের বাক্যের অনুরূপ। তখন আমি বললাম, হে আল্লাহর রসূল! আপনি আল্লাহর কাছে দু'আ করুন! তিনি যেন আমাকেও তাদের সঙ্গে শামিল করেন। তিনি বললেন, তুমি হবে তাদের প্রথম সারির একজন। তারপর উম্মু হারাম বিনতু মিলহান মু'আবিয়াহ (রাযিঃ) এর আমলে (সত্যিসত্যি) সমুদ্রপৃষ্ঠে (সাইপ্রাসের যুদ্ধ উপলক্ষে) আরোহণ করেন এবং সমুদ্র থেকে বের হওয়ার কালে সওয়ার থেকে পড়ে গিয়ে মৃত্যুবরণ করেন। (ইসলামিক ফাউন্ডেশন ৪৭৮১, ইসলামিক সেন্টার ৪৭৮২)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 229
			}
		}
	]
}