{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১১, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১১-(১৪২/২০৪০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (একদা) আবূ তালহাহ (রাযিঃ) উম্মু সুলায়ম (রাযিঃ) কে বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দুর্বল শব্দ শ্রবণ করে বুঝতে পেরেছি যে, তিনি ক্ষুধার্ত। তাই তোমার কাছে কিছু আছে কি? তিনি বললেন, হ্যাঁ। তিনি যবের কয়েক খন্ড রুটি বের করলেন। তারপর তার ওড়না নিলেন এবং এটির একাংশ দিয়ে রুটিগুলো পেচিয়ে আমার কাপড়ের তলায় গুজে দিলেন এবং অপর অংশ আমার দেহে জড়িয়ে দিলেন। অতঃপর আমাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে প্রেরণ করলেন। তিনি (আনাস) বলেন, আমি এগুলো নিয়ে এসে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখতে পেলাম তিনি মসজিদে বসে আছেন। তার সাথে আরো মানুষ ছিলেন। আমি তাদের নিকট গিয়ে দাঁড়ালাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাকে আবূ তালহাহ প্রেরণ করেছে? আমি বললাম, হ্যাঁ। তিনি বললেন, খাওয়ার ব্যাপারে? আমি বললাম, হ্যাঁ। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথীদের বললেন, সবাই চলো। আনাস (রাযিঃ) বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গেলেন। আর আমি তাদের সামনে চলতে লাগলাম। পরিশেষে আমি আবূ তালহাহ্ (রাযিঃ)-এর কাছে এসে তাকে (ঘটনা) খবর দিলাম। তখন আবূ তালহাহ (রাযিঃ) বললেন, হে উম্মু সুলায়ম (রাযিঃ)! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তো লোকদের নিয়ে আসছেন, অথচ আমাদের কাছে সে পরিমাণ খাদ্য নেই যা দিয়ে তাদের আপ্যায়ন করতে পারি। উম্মু সুলায়ম (রাযিঃ) বললেন, (তুমি উদ্বিগ্ন হয়ে না) আল্লাহ এবং তার রসূলই ভাল জানেন। আনাস (রাযিঃ) বলেন, তারপর আবূ তালহাহ্ (রাযিঃ) যেয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে দেখা করলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে এসে (উভয়ে) ঘরে ঢুকলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু সুলায়ম (রাযিঃ)-কে লক্ষ্য করে বললেন, হে উম্মু সুলায়ম! তোমার কাছে যা আছে নিয়ে আসো। তিনি সে রুটিগুলো তার সাথে করে নিয়ে আসলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দান করলে সেগুলো টুকরা টুকরা করা হলো। আর উম্মু সুলায়ম (রাযিঃ) চামড়া দ্বারা তৈরি ঘি-এর পাত্রটি চিপে সেটি সালুন হিসেবে দিলেন। আর এর ভিতরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর ইচ্ছানুযায়ী কিছু পড়লেন। অতঃপর বললেন, দশজনকে আসতে বলো। তাদের ডাকা হলে তারা এসে তৃপ্তির সাথে খাবার খেয়ে বেরিয়ে গেলেন। অতঃপর তিনি বললেন, আরো দশজনকে আসতে বলে। তাদের ডাকা হলে তারা পেট ভরে খেয়ে চলে গেলেন। পুনরায় তিনি বললেন, দশজনকে ডাক। এভাবে দলের সকলে পেটপুরে খাবার খেলেন। সত্তর কিংবা আশিজন লোক তাদের দলে ছিল। (ইসলামিক ফাউন্ডেশন ৫১৪৩, ইসলামিক সেন্টার ৫১৫৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		}
	]
}