{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 539,
			"arabicnumber": "226.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৭, আন্তর্জাতিক নাম্বারঃ ২২৬ ৪২৭-(৪/...) যুহায়র ইবনু হারব (রহঃ) ..... উসমান এর আযাদকৃত গোলাম হুমরান (রহঃ) থেকে বর্ণিত। তিনি উসমান ইবনু আফফানকে দেখেছেন তিনি ওযুর জন্যে এক পাত্র পানি আনিয়ে দু'হাতের উপর ঢেলে তিনবার ধুলেন। তারপর ডানহাত পানির পাত্রে প্রবেশ করিয়ে কুলি করলেন এবং নাকে পানি দিলেন, এরপর তিনবার মুখমণ্ডল এবং তিনবার দু'হাতের কনুই পর্যন্ত ধুইলেন। তারপর মাথা মাসাহ করলেন। অতঃপর উভয় পা (গোড়ালি পর্যন্ত) তিনবার ধুয়ে বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি আমার এ ওযুর ন্যায় ওযু করার পর এমনভাবে দুরাকাআত সালাত আদায় করবে যাতে তা অন্তরে কোন কল্পনার উদয় হয়নি; তবে তার পিছনের সকল গুনাহ মাফ করে দেয়া হবে। (ইসলামিক ফাউন্ডেশনঃ ৪৩০, ইসলামিক সেন্টারঃ ৪৪৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এটি একটি মহা হাদীস, এর মধ্যে সন্নিবেশিত হয়েছে প্রকৃত ইসলাম ধর্মে ওজু করার মৌলিক বিবরণ। তাই সমস্ত মুসলিম ব্যক্তির উচিত, তারা যেন ওজু করার এই মৌলিক বিবরণটির জ্ঞান লাভ করে ও যত্ন করে। তবে জেনে রাখা দরকার যে, একবার মাত্র মাথা মাসাহ করার সাথে সাথে দুই কানেরও মাসাহ করতে হবে। কেননা কান দুইটি তো হলো মাথারই অংশ। ২। ওজু এবং নামাজ হলো মহান আল্লাহর ক্ষমা ও জান্নাত লাভের মাধ্যম। তাই যে ব্যক্তি ওজু করবে, তার উচিত যে, সে যেন ওজু করার পর দুই রাকাআত নামাজ পড়ে। ৩। মুসলিম ব্যক্তির উচিত যে, সে যেন ওজু করার শেষে এই দোয়াটি পাঠ করে। \"أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنََّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ\". অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত। যেহেতু আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেছেন: \"তোমাদের মধ্যে থেকে যখন কোনো ব্যক্তি যত্নসহকারে সম্পূর্ণরূপে অথবা উত্তম রূপে ওজু করবে এবং বলবে: \"أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنََّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ\". (অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত।) তার জন্য জান্নাতের আটটি দরজা খুলে দেওয়া হবে, সে যে দরজা দিয়ে ইচ্ছে করবে, সেই দরজা দিয়ে জান্নাতে প্রবেশ করতে পারবে”। [দেখতে পারা যায় সহীহ মুসলিম, হাদীস নং ১৭ – (২২৪) ]।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 6
			}
		}
	]
}