{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5703,
			"arabicnumber": "2189.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৬, আন্তর্জাতিক নাম্বারঃ ২১৮৯ ৫৫৯৬-(৪৩/২১৮৯) আবূ কুরায়ব (রহঃ) ...... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, লাবীদ ইবনু আসাম নামে বানু যুৱায়ক সম্প্রদায়ের এক ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যাদু করল। তিনি বলেন, এ যাদুর কারণে এমনও হত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্মরণ হত যে কোন (পার্থিব) কাজ তিনি করছেন, অথচ (প্রকৃতভাবে) তিনি তা করছেন না। পরিশেষে একদিনে কিংবা এক রাত্রে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করলেন; আবার দুআ করলেন, আবার দুআ করলেন। অতঃপর বললেনঃ হে আয়িশাহ! তুমি কি অনুধাবন করতে পেরেছে যে, আল্লাহ আমাকে সে ব্যাপারে সমাধান দিয়েছেন, যে ব্যাপারে আমি তার নিকট সমাধান চেয়েছিলাম? (তা এভাবে যে) (দু’জন ফেরেশতা) দু’লোক (মানুষের বেশ ধরে) আমার নিকট আসলো। তাদের একজন আমার মস্তকের নিকট এবং অপরজন আমার পায়ের নিকট বসল। অতঃপর আমার মাথার নিকটের লোক পায়ের নিকটের লোককে অথবা আমার পায়ের নিকটের লোকটি আমার মাথার নিকটের লোকটিকে বলল, লোকটির ব্যাধি কি? (অপরজন) বলল, যাদুগ্রস্ত। (প্রথম জন) বলল, কে তাকে যাদু করেছে? (দ্বিতীয় জন) বলল- লাবীদ ইবনু আসাম। (প্রথমজন) বলল, কোন জিনিসে? (দ্বিতীয় জন) বলল- চিরুনি, (আঁচড়ানোর সময় চিরুনির সঙ্গে) উঠা চুল, (আরও) বলল, পুরুষ খেজুরের ফুলের বেষ্টনীতে। (প্রথমজন) বলল, তা কোথায়? (দ্বিতীয় জন) বলল- যা আরওয়ান কুয়ায়। তিনি [আয়িশাহ্ (রাযিঃ)] বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কতিপয় সাহাবীকে সাথে নিয়ে সেথায় আসলেন। তারপর (ফিরে এসে) বললেন, হে আয়িশাহ্! আল্লাহর কসম, সে (কূপের) পানি যেন মেহেদীপাতা ভিজানো (পানি) এবং সেখানকার খেজুর গাছ যেন শাইতানের মস্তিষ্ক। তিনি বলেন, তখন আমি বললাম, হে আল্লাহর রসূল! তাহলে আপনি তা (জনসমক্ষে) পুড়ে ফেললেন না কেন? তিনি বললেন, না, (আমি তা উচিত মনে করেনি)। কেননা, আল্লাহ আমাকে তো রোগমুক্ত করেছেন-আর লোকদেরকে কোন অকল্যাণে উত্তেজিত করা অপছন্দ করছি। আমি সে ব্যাপারে নির্দেশ দিলাম। ফলে মাটিতে পুঁতে ফেলা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫১৫, ইসলামিক সেন্টার ৫৫৪০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 57
			}
		}
	]
}