{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5791,
			"arabicnumber": "2221.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৪, আন্তর্জাতিক নাম্বারঃ ২২২১ ৫৬৮৪-(১০৪/২২২১) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... আবূ সালামাহ্ ইবনু আব্দুর রহমান ইবনু আওফ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ (এর অস্তিত্ব) নেই। তিনি আরও বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ব্যাধিযুক্ত উটপালের মালিক (অসুস্থ উটগুলোকে) সুস্থ উটপালের মালিকের (উটের) ধারে কাছে আনবে না। (ইসলামিক ফাউন্ডেশন ৫৫৯৭, ইসলামিক সেন্টার ৫৬২৬) আবূ সালামাহ্ (রহঃ) বলেন, আবূ হুরাইরাহ (রাযিঃ) এ দুটি হাদীসই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করতেন। অতঃপর আবূ হুরাইরাহ (রাযিঃ) তার (প্রথম হাদীসের) সংক্রমণ নেই বলা হতে চুপ থাকেন এবং অসুস্থ উটপালের মালিক সুস্থ উটপালের মালিকের নিকট আনবে না- এ বর্ণনায় অটল থাকেন। বর্ণনাকারী বলেন, (একদিন) আল হারিস ইবনু আবূ যুবাব (রহঃ) তিনি আবূ হুরাইরাহ (রাযিঃ) এর চাচাত ভাই বললেন, হে আবূ হুরাইরাহ্! আমি তো আপনাকে বলতে শুনতাম, আপনি এ হাদীসের সঙ্গে আরও একটি হাদীস আমাদের নিকট বর্ণনা করতেন, যা বর্ণনায় আপনি এখন নিচুপ রয়েছেন। আপনি বলতেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ নেই’। তখন আবূ হুরাইরাহ (রাযিঃ) অস্বীকার করলেন এবং বললেন, অসুস্থ পালের মালিক সুস্থ পালের মালিকের নিকট নিয়ে যাবে না। তখন হারিস (রহঃ) এ নিয়ে তার সাথে তর্কে লিপ্ত হলেন। ফলে আবূ হুরাইরাহ (রাযিঃ) গোস্বা হয়ে হাবশী ভাষায় কিছু একটা বললেন। তিনি হারিস (রহঃ) কে বললেন, তুমি কি বুঝতে পেরেছো আমি কি বলেছি? তিনি বললেন, না। আবূ হুরাইরাহ (রাযিঃ) বললেন, আমি বলেছি, আমি অস্বীকার করছি। আবূ সালামাহ্ (রহঃ) বলেন, আমার জীবনের কসম! আবূ হুরাইরাহ (রাযিঃ) নিশ্চয়ই আমাদের নিকট হাদীস রিওয়ায়াত করতেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন 'সংক্রমণ নেই'। এখন আমি জানি না যে, আবূ হুরাইরাহ (রাযিঃ) ভুলে গেলেন, নাকি একটি দ্বারা অপরটিকে রহিত করে দিয়েছেন।* (ইসলামিক ফাউন্ডেশন, ৫৫৯৭, ইসলামিক সেন্টার ৫৬২৬) * لاَ عَدْوَى মূলতঃ কথা হলো যে, সংক্রমণ বলতে কিছু নেই। এটাই বাস্তব সত্য ও ইসলামী আকীদাহ। তবে অসুস্থ উটপালকে সুস্থ উটপালের নিকট নিয়ে যাওয়ার নির্দেশটি সংক্রমণের প্রতি বিশ্বাস করে নয়; বরং সতর্কতা ও পরিচ্ছন্নতার প্রতি লক্ষ্য করে এ নির্দেশ দেয়া হয়েছে।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 143
			}
		}
	]
}