{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5839,
			"arabicnumber": "2236.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩২, আন্তর্জাতিক নাম্বারঃ ২২৩৬ ৫৭৩২-(১৩৯/২২৩৬) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ্ (রহঃ) ..... হিশাম ইবনু যুহরাহ (রহঃ) এর মুক্ত গোলাম আবূ সায়িব (রহঃ) হতে বর্ণিত যে, তিনি আবূ সাঈদ খুদরী (রাযিঃ) এর নিকট তার গৃহে ঢুকলেন। তিনি বলেন, সে সময় আমি তাকে সালাতরত অবস্থায় পেলাম এবং তার সালাত (সালাত/নামাজ/নামায) শেষ করা পর্যন্ত তার অপেক্ষায় বসে থাকলাম। সে সময় গৃহের কোণে রেখে দেয়া খেজুর ডালের স্তুপের মাঝে কিছু একটার নড়াচড়ার শব্দ শুনতে পেলাম। আমরা দেখতে পেলাম যে, এটি একটি সাপ। আমি সেটিকে হত্যা করার জন্য লাফ দেয়ার জন্য প্রস্তুত হলাম। তখন তিনি (সালাতে থেকেই) ইঙ্গিত করলেন যে, বসে থাকো। সালাত সমাপ্ত করে গৃহের একটি ঘরের দিকে ইশারা করে বললেন, এ ঘরটি কি তুমি দেখতে পাচ্ছ? আমি বললাম, হ্যাঁ! তিনি বললেন, সেখানে নববিবাহিত আমাদের এক যুবক থাকত। বর্ণনাকারী বলেন, অতঃপর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে খন্দক যুদ্ধে বের হলাম। ঐ যুবক মধ্যাহ্নের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি চেয়ে নিত এবং তার পরিবারের নিকট ফিরে যেত। একদিন সে (যথারীতি) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি কামনা করলে তিনি তাকে বললেন, তোমার যুদ্ধাস্ত্র তোমার সঙ্গে নিয়ে যাও। কারণ, আমি তোমার উপরে বানু কুরাইযাহ (ইয়াহুদীদের আক্রমণ) এর সংশয় করছি। ব্যক্তিটি তার অস্ত্র নিয়ে (গৃহে) প্রত্যাবর্তন করল। সেখানে সে তার (সদ্য বিবাহিতা) স্ত্রীকে দু’দরজার মাঝে দণ্ডায়মান অবস্থায় লক্ষ্য করল এবং (তার প্রতি সন্দিহান হয়ে) তাকে বল্লম দিয়ে আঘাত হানার উদ্দেশে তা তার দিকে স্থির করে ধরল। আত্মসম্মানবোধ তাকে পেয়ে বসেছিল। তখন সে (স্ত্রী) বলল, তোমার বল্লমটি নিজের নিকট সংযত রাখো এবং ঘরে প্রবেশ করো। তুমি যাতে তা দেখতে পারো, যা আমাকে বের হতে বাধ্য করেছে। সে গৃহে ঢুকেই দেখতে পেল যে, এক বিশালাকার সাপ বিছানার উপরে কুণ্ডলী পাকিয়ে রয়েছে। সে এর প্রতি বল্লম স্থির করে তার মাধ্যমে এটিকে গেঁথে ফেলল। অতঃপর বের হয়ে তা (বল্পমটি) বাড়ীর মধ্যেই পুঁতে রাখল। সে সময় তা নড়ে চড়ে তাকে ছোবল মারলো এবং (ক্ষণিকের মধ্যে) সাপ কিংবা যুবক এ দু'জনের কে বেশি দ্রুত মৃত্যুবরণকারী ছিল তা আঁচ করা গেল না। বর্ণনাকারী আবূ সাঈদ (রাযিঃ) বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে যেয়ে ঘটনাটি বিবরণ দিয়ে তাকে বললাম, আপনি আল্লাহর নিকট দু'আ করুন, তিনি যেন আমাদের মাঝে তাকে আবার তাজা করে দেন। সে সময় তিনি বললেন, তোমরা তোমাদের সঙ্গীর জন্য ক্ষমা প্রার্থনা করো। তারপর বললেন, মদীনায় কিছু জিন রয়েছে, যারা ইসলাম গ্রহণ করেছে। তাই, (সাপ ইত্যাদিরূপে) তাদের কিয়দংশ তোমরা লক্ষ্য করলে তাকে তিন দিন সাবধান সংকেত দিবে; তারপরে তোমাদের সম্মুখে (তা) প্রকাশ পেলে তাকে হত্যা করবে। কারণ, সে একটি (অবাধ্য) শাইতান, (অর্থাৎ, সে মুসলিম নয়)। (ইসলামিক ফাউন্ডেশন ৫৬৪৪, ইসলামিক সেন্টার ৫৬৭৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 190
			}
		}
	]
}