{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6121,
			"arabicnumber": "2359.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৫, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৫-(১৩৬/...) হারমালাহ্ ইবনু ইয়াহইয়া ইবনু ‘আবদুল্লাহ ইবনু হারমালাহ্ ইবনু ‘ইমরান তুজীবী (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য ঢলে যাওয়ার পর বের হলেন এবং লোকদের নিয়ে যুহরের সালাত (সালাত/নামাজ/নামায) আদায় করলেন। যখন সালাম ফিরালেন তখন মিম্বারে দাঁড়িয়ে কিয়ামতের আলোচনা করে বর্ণনা করলেন যে, এর পূর্বে বহু বড় বড় বিষয় ঘটবে। তারপর বললেনঃ তোমাদের মাঝে যে লোক আমাকে কোন ব্যাপারে জিজ্ঞেস করতে চায় সে যেন ঐ সম্বন্ধে আমাকে জিজ্ঞেস করে। আল্লাহর শপথ! যতক্ষণ পর্যন্ত আমি এ স্থানে রয়েছি ততক্ষণ তোমরা আমাকে যে বিষয়েই জিজ্ঞেস করবে আমি তা বলে দিব। আনাস ইবনু মালিক (রাযিঃ) বলেন, এ কথা শুনে লোকেরা অনেক চিৎকার আরম্ভ করে দিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারবার বলতে থাকলেন, আমাকে জিজ্ঞেস করো। তখন আবদুল্লাহ ইবনু হুযাফাহ (রাযিঃ) দাঁড়িয়ে বললেন, আমার পিতা কে? হে আল্লাহর রসূল! তিনি বললেন; তোমার পিতা হুযাফাহ। তারপর যখন রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারবার বলতে থাকলেন, আমাকে জিজ্ঞেস করো। তখন উমার (রাযিঃ) হাঁটু গেড়ে বসে বললেন, সন্তুষ্টচিত্তে আমরা আল্লাহকে রব, ইসলামকে দীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রসূল হিসেবে মেনে নিয়েছি। আনাস ইবনু মালিক (রাযিঃ) বলেন, যখন উমার (রাযিঃ) এ কথা বললেন, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেমে গেলেন। বর্ণনাকারী বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বিপদ সন্নিকটবর্তী। মুহাম্মাদের জীবন যার হাতে তার শপথ! এ দেয়ালটির পাশে এখনই আমার সামনে জান্নাত ও জাহান্নাম দেখানো হয়েছে। অতএব, আজকের মতো ভাল এবং খারাবী আমি আর দেখিনি। ইবনু শিহাব (রহঃ) বলেন, উবাইদুল্লাহ ইবনু আবদুল্লাহ ইবনু উতবাহ আমাকে বলেছেন, তিনি বলেন, আবদুল্লাহ ইবনু হুযাফার মা আবদুল্লাহ ইবনু হুযাফাহকে বলেছেন, তোর চাইতে অধিক অবাধ্য কোন সন্তানের ব্যাপারে আমি শুনিনি। তুই কি এ কথা হতে নিশ্চিন্ত ছিলি যে, তোর মাও হয়ত এমন কোন পাপ করে বসেছে যা জাহিলী যুগের নারীরা করত, আর তুই তোর মাকে লোকদের সম্মুখে অপমান করতিস? আবদুল্লাহ ইবনু হুযাফাহ (রাযিঃ) জবাবে বললেন, আল্লাহর শপথ আমাকে যদি একটা কালো হাবশীর সঙ্গেও সম্পর্কিত করতেন তাহলে আমি তা মেনে নিতাম। (ইসলামিক ফাউন্ডেশন ৫৯০৯, ইসলামিক সেন্টার ৫৯৪৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 179
			}
		}
	]
}