{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 616,
			"arabicnumber": "268.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪, আন্তর্জাতিক নাম্বারঃ ২৬৮ ৫০৪-(৬৬/২৬৮) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওযু গোসলের পবিত্রতা অর্জন করতে, চুল আঁচড়ানোর সময় এবং জুতা পরার সময় ডান দিক থেকে শুরু করতে ভালবাসতেন। (ইসলামিক ফাউন্ডেশনঃ ৫০৭, ইসলামিক সেন্টারঃ ৫২৩) প্রাসঙ্গিক আলোচনা ডান দিক যে কোনো ভালো কাজের জন্য ব্যবহার করা সুন্নাতসম্মত। ইমাম সানাআনী বলেন, আল্লাহ ও তাঁর রাসুল কর্তৃক কোনো কিছু পছন্দ করার বিষয়টি বর্ণিত হলে সেটি নিদেনপক্ষে বৈধ হওয়া সাব্যস্ত করে; কারণ তা হয় ওয়াজিব হবে না হয় মুস্তাহাব হবে। ইমাম ইবন তাইমিয়্যাহ রাহিমাহুল্লাহ বলেন, ডান দিক ব্যবহারের এ নিয়ম থেকে বাথরুমে প্রবেশ করা, মসজিদ থেকে বের হওয়া ইত্যাদি কর্মকাণ্ডগুলো ব্যতিক্রম ধরা হবে। * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত ইসলাম ধর্মের একটি স্থায়ী বিধান হলো এই যে, সম্মানিত ও সমাদৃত কাজে অথবা যে বিষয়টির দ্বারা সম্মান ও মর্যাদাদান করা হয়: যেমন জামাকাপড়, পাজামা, মোজা পরিধান করা। এবং মাসজিদে প্রবেশ, মেসওয়াক বা দাঁতন ব্যবহার করা, চোখে কাজল বা সুরমা লাগানো, নখ কাটা, মোচ ছাঁটা, চিরনির দ্বারা মাথার চুল আঁচড়াবার সময়, বগলের চুল উপড়ানো বা তুলে ফেলার সময়, মাথার চুল মুণ্ডন এবং নামাজ শেষে সালাম ফেরানো, পবিত্রতার্জন করার সময়, দেহের অঙ্গগুলি ধৌত করার সময় ডান দিক থেকে শুরু করা উত্তম। অনুরূপভাবে শৌচাগার বা টয়লেট থেকে বের হওয়ার সময়, পানাহার ও মুসাফাহা করার সময় এবং হাজরে আসওয়াদ ‍স্পর্শ করার সময় এবং আরো ইত্যাদি সেই সমস্ত কাজে ডান হাত কিংবা দিক থেকে আরম্ভ করা উত্তম বা মুস্তাহাব যে সমস্ত কাজে সম্মান ও মর্যাদাদান করা হয় । ২। তবে যে সমস্ত কাজে সম্মান ও মর্যাদা দান করা হয় না যেমন, শৌচাগার বা টয়লেটে প্রবেশ করা, মাসজিদ থেকে বের হওয়া, নাক পরিষ্কার করা, মলত্যাগের পর মলদ্বার ইত্যাদি পরিষ্কার করা, জামাকাপড়, পাজামা, মোজা ইত্যাদি খোলার কাজগুলি বাম দিক থেকে সম্পাদন করা উত্তম বা মুস্তাহাব। আর এই বিধানটির উদ্দেশ্য হলো ডান দিকের সম্মান ও মর্যাদা দান করা। ৩। প্রত্যেক মুসলিম ব্যক্তির একটি অপরিহার্য বিষয় হলো এই যে, তারা যেন প্রকৃত ইসলাম ধর্মের কার্য সম্পাদনের ক্ষেত্রে আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর সঠিক পন্থায় অনুসরণ করে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		}
	]
}