{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6322,
			"arabicnumber": "2144.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২১৬, আন্তর্জাতিক নাম্বারঃ ২১৪৪ ৬২১৬-(১০৭/২১৪৪) মুহাম্মাদ ইবনু হাতিম ইবনু মাইমুন (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ তালহার ঔরসজাত উম্মু সুলায়মের একটি ছেলে মৃত্যুবরণ করল। তখন উম্মু সুলায়ম (রাযিঃ) তার পরিবার-পরিজনের ব্যক্তিদের বলল, আবূ তালহাকে তাঁর পুত্রের সংবাদ দিও না, যতক্ষণ আমি না বলি। আবূ তালহাহ্ (রাযিঃ) আসলেন। উম্মু সুলায়ম (রাযিঃ) রাতের খানা সম্মুখে নিয়ে আসলে তিনি খাবার খেলেন। এরপর উম্মু সুলায়ম আগের চাইতে ভাল মতো সাজগোজ করলেন। আবূ তালহাহ্ (রাযিঃ) তাঁর সঙ্গে মিলিত হলেন। যখন উম্মু সুলায়ম (রাযিঃ) দেখলেন যে, তিনি মিলনে পরিতৃপ্ত। তখন তাকে বললেন, হে আবূ তালহাহ! কেউ যদি কারো কোন জিনিস রাখতে দেয়, তারপর তা নিয়ে নেয় তবে কি সে তা ফিরাতে পারে? আবূ তালহাহ (রাযিঃ) বললেন, না। উম্মু সুলায়ম (রাযিঃ) বললেন, তাহলে তোমার ছেলের ব্যাপারে মনে কর (আল্লাহ তাকে নিয়ে নিয়েছেন)। আবূ তালুহাহ (রাযিঃ) রেগে গিয়ে বললেন, তুমি আমাকে আগে বলেনি, এখন আমি অপবিত্র, এখন ছেলের সংবাদটা দিলে। অতঃপর তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গিয়ে ছেলের যা ঘটেছে সব জানালেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের গত রাতটিতে আল্লাহ তা'আলা বারাকাত দিন। উম্মু সুলায়ম গর্ভবতী হলেন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সফরে ছিলেন, উম্মু সুলায়মও এ সফরে তার সাথে ছিলেন। রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন সফর হতে প্রত্যাবর্তন করতেন তখন রাতের বেলা মদীনায় ঢুকতেন না। যখন লোকেরা মদীনার কাছাকাছি পৌছলো তখন উম্মু সুলায়মের প্রসব বেদনা আরম্ভ হলো। আবূ তালহাহ (রাযিঃ) তার নিকট থেকে গেলেন এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চলে গেলেন। আবূ তালহাহ্ (রাযিঃ) বললেন, হে প্রতিপালক! তুমি তো জানো যে, আমার ভাল লাগে তোমার রসূলের সঙ্গে বের হতে যখন তিনি বের হন এবং তার সাথে প্রবেশ করত তখন তিনি প্রবেশ করেন। কিন্তু তুমি জানো, কেন আমি থেমে গেছি। উম্মু সুলায়ম (রাযিঃ) বললেন, হে আবূ তালহাহ! আগের মতো যাতনা আমার নেই। চলুন আমরা চলে যাই। স্বামী-স্ত্রী মদীনায় পৌছলে উম্মু সুলায়মের ব্যথা আবার আরম্ভ হলো। আর তিনি একটি শিশু ছেলে প্রসব করলেন। আমার মা বললেন, হে আনাস! শিশুটিকে যেন কেউ দুধ না খাওয়ায়, যতক্ষণ তুমি তাকে ভোরবেলা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে না যাও। সকাল হলে আমি সন্তানটিকে নিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গেলাম। আমি লক্ষ্য করলাম, তার হাতে উট দাগানোর যন্ত্র। আমাকে যখন তিনি দেখলেন, বললেন, হয়তো উম্মু সুলায়ম এ পুত্রটি প্রসব করেছে। আমি বললাম, হ্যাঁ। তিনি সে যন্ত্রটি হাত থেকে রেখে দিলেন। আমি শিশুটিকে নিয়ে তার কোলে রাখলাম। তিনি মদীনার আজওয়া খেজুর আনালেন এবং নিজের মুখে দিয়ে চিবুলেন। যখন খেজুর গলে গেল, তখন শিশুটির মুখে দিলেন। শিশুটি তা চুষতে লাগল। আনাস (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, দেখো আনসারদের খেজুর-প্রীতি। অবশেষে তিনি শিশুর মুখে হাত বুলিয়ে তার নাম 'আবদুল্লাহ' রাখলেন। (ইসলামিক ফাউন্ডেশন ৬১০০, ইসলামিক সেন্টার ৬১৪১)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 152
			}
		}
	]
}