{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6362,
			"arabicnumber": "2474",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৫৬, আন্তর্জাতিক নাম্বারঃ ২৪৭৪ ৬২৫৬-(১৩৩/২৪৭৪) ইবরাহীম ইবনু মুহাম্মাদ ইবনু আর'আরাহ সামী ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন আবূ যার (রাযিঃ) এর নিকট সংবাদ আসলো যে, মক্কায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আবির্ভাব হয়েছে, তখন তিনি তার ভাইকে বললেন, তুমি সওয়ারীতে চড়ে সে (মক্কাহ) উপত্যকায় যাও এবং সে লোকের ব্যাপারে আমাকে অবহিত কর, যিনি মনে করেন যে, আসমান থেকে তার নিকট ওয়াহী আসে। তার কথা ভাল করে শুনবে এবং এরপর তুমি আমার নিকট আসবে। তখন অপর লোক (তার ভাই) রওনা হয়ে মক্কায় আসলো এবং তার কথা শুনল। এরপর সে আবূ যার (রাযিঃ) এর নিকট প্রত্যাবর্তন করল এবং সে বলল, আমি তাকে দেখেছি যে, তিনি উত্তম চরিত্রের আদেশ দেন এবং এমন বাণী শুনান, যা কবিতার সাদৃশ্য নয়। তখন তিনি আবূ যার (রাযিঃ) বললেন, আমি যা চেয়েছি তা তুমি পূরণ করতে পারনি। এরপর তিনি পাথেয় ব্যবস্থা করলেন এবং একটি পানি ভর্তি মশক নিলেন। পরিশেষে মক্কায় পৌছে তিনি মসজিদে আসলেন। আর। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সন্ধান করলেন। কিন্তু তিনি তাকে চিনতে পারলেন না। আর তার ব্যাপারে (কারও নিকট) প্রশ্ন করাও পছন্দ করলেন না। পরিশেষে রাত হয়ে গেল। তিনি ঘুমিয়ে পড়লেন। তখন আলী (রাযিঃ) তাকে দেখলেন এবং তিনি বুঝতে পারলেন যে, ইনি একজন আগন্তুক, তখন তিনি তাকে দেখে তার অনুকরণ করলেন; কিন্তু কেউ কারও নিকট কিছু প্রশ্ন করলেন না। এমনকি (এভাবে) সকাল হয়ে গেল। এরপর তিনি [আবূ যার (রাযিঃ)] তার আসবাবপত্র ও মশক মসজিদে রাখলেন এবং সেদিনটি সেখানে অতিবাহিত করলেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সাক্ষাৎ পেলেন না, এমনকি সন্ধ্যা হয়ে গেল। এরপর তিনি তার ঘুমানোর স্থানে ফিরে এলেন। আলী (রাযিঃ) তার নিকট এলেন এবং বললেন, এখনও সময় আসেনি, যাতে সে লোকটির গন্তব্য সম্বন্ধে জানা যায়। তারপর তিনি তাকে দাঁড় করালেন এবং তাকে সাথে নিয়ে চললেন। তবে কেউ কারোর নিকট কোন বিষয়ে প্রশ্ন করলেন না। এমনকি তৃতীয় দিন এসে গেল। এদিনও তেমনটি করলেন। তারপর আলী (রাযিঃ) তার সাথে তাকে দাঁড় করিয়ে বললেন, আপনি কি আমাকে জানাবেন, কিসে আপনাকে এ শহরে এনেছে? তিনি [আবূ যার (রাযিঃ)] বললেন, আপনি যদি আমাকে পথ দেখানোর ওয়াদাবদ্ধ হন তাহলে আমি আপনার নিকট বলব। তিনি (ওয়াদা) করলেন। তখন তিনি আবূ যার (রাযিঃ) তাকে সব জানালেন। তারপর ‘আলী (রাযিঃ) বললেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হক এবং তিনি আল্লাহর রসূল। সকাল হলে আপনি আমাকে অনুকরণ করবেন। যদি আমি এমন কিছু দেখতে পাই যাতে আপনার ভয় আছে, তখন আমি দাঁড়িয়ে যাব, যেন আমি প্রস্রাব করছি। পুনরায় যখন আমি চলতে শুরু করব তখন আমাকে অনুসরণ করবেন। পরিশেষে আমার প্রবেশ দ্বারে আপনি প্রবেশ করবেন। তিনি তা-ই করলেন। তিনি তার পশ্চাতে চললেন, শেষ অবধি তিনি [আলী (রাযিঃ)] রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত হলেন আর আবূ যার (রাযিঃ)ও তার সাথে উপস্থিত হলেন। অতঃরপর তিনি তার (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর) কথা শুনলেন এবং সেখানেই ইসলাম গ্রহণ করলেন। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তুমি তোমার সম্প্রদায়ের নিকট ফিরে যাও এবং তাদের নিকট (দীনের) সংবাদ পৌছে দাও। আমার আদেশ তোমার নিকট পৌছা পর্যন্ত (এ কাজ করতে থাক)। তারপর তিনি [আবূ যার (রাযিঃ)] বললেন, সে মহান সত্তার শপথ! যার হাতে আমার প্রাণ, আমি তা মক্কাবাসীদের মধ্যে চীৎকার করে প্রচার করব। এরপর তিনি বেরিয়ে পড়লেন এবং মসজিদে ঢুকলেন। এরপর উচ্চস্বরে প্রচার করলেনঃأَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ \"আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোন ইলাহ নেই এবং আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রসূল।\" এতে ব্যক্তিরা ঝাপিয়ে পড়ল এবং তাকে আঘাত করে ধরাশায়ী করে ফেলল। আব্বাস (রাযিঃ) সেখানে এলেন এবং তার দিকে ঝুঁকে পড়লেন। তারপর তিনি ['আব্বাস (রাযিঃ)] বললেন, তোমাদের জন্য আফসোস! তোমাদের কি অজানা যে, তিনি গিফার সম্প্রদায়ের ব্যক্তি? তোমাদের সিরিয়া দেশে বাণিজ্যের যোগাযোগ ব্যবস্থা তাদের এলাকা দিয়ে। এরপর তিনি তাকে তাদের নিকট হতে ছাড়িয়ে আনলেন। পরের দিন তিনি আবার আগের দিনের মতোই করলেন। ব্যক্তিরা তার উপর ঝাপিয়ে পড়ল এবং তাকে বেদম প্রহার করল। আব্বাস (রাযিঃ) তার দিকে ঝুঁকে পড়লেন এবং তাকে তিনি মুক্ত করলেন। (ইসলামিক ফাউন্ডেশন ৬১৩৮, ইসলামিক সেন্টার ৬১৮১)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 192
			}
		}
	]
}