{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6383,
			"arabicnumber": "2484.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৭৭, আন্তর্জাতিক নাম্বারঃ ২৪৮৪ ৬২৭৭-(১৫০/...) কুতাইবাহ ইবনু সাঈদ ও ইসহাক ইবনু ইবরাহীম (রাযিঃ) ..... খারাশাহ ইবনু হুর (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি মদীনার মসজিদে একটি সমাবেশে উপবিষ্ট ছিলাম। তিনি বলেন, সে মাজলিসে বসা ছিলেন সুন্দর চেহারার অধিকারী একজন বৃদ্ধ লোক। তিনিই ছিলেন আবদুল্লাহ ইবনু সালাম (রাযিঃ)। তিনি (বর্ণনাকারী) বলেন, তিনি তাদের সম্মুখে ভাল ভাল কথা বলছিলেন। তিনি (বর্ণনাকারী) বলেন, যখন তিনি সমাবেশ হতে উঠছিলেন সে সময় ব্যক্তিরা বলল, কোন লোক যদি জান্নাতীকে দেখে আনন্দিত হতে চায় তবে যেন সে ঐ লোকটির দিকে দৃষ্টিপাত করে। তিনি খারাশাহ্ (রাযিঃ) বলেন, আমি বললাম, আল্লাহর শপথ! নিশ্চয়ই আমি তার অনুসরণ করব, যাতে আমি তার আবাসস্থল জানতে পারি। তিনি (বর্ণনাকারী) বললেন, এরপর আমি তাকে অনুসরণ করলাম। তিনি রওনা হলেন এবং মদীনাহ শহর থেকে বেরিয়ে যাওয়ার সন্নিকটবর্তী জায়গায় পৌছে নিজ ঘরে ঢুকলেন। তিনি (বর্ণনাকারী) বলেন, আমিও তার নিকট প্রবেশের অনুমতি চাইলাম। তিনি আমাকে অনুমতি দিলেন। অতঃপর বললেন, হে ভ্রাতুষ্পপুত্র! তুমি কি চাও? রাবী বলেন, আমি তাকে বললাম, আপনি যখন সমাবেশ থেকে উঠে আসছিলেন তখন আমি আপনার ব্যাপারে ব্যক্তিদের বলতে শুনেছি, যে লোক একজন জান্নাতীকে দেখে আনন্দ পেতে চায়, সে যেন এ লোকের দিকে তাকায়। তখন আমার মনে আপনার সঙ্গ লাভের আগ্রহ জাগে। তিনি বললেন, জান্নাতীদের ব্যাপারে আল্লাহই অধিক জ্ঞাত। কিন্তু ব্যক্তিদের এ কথা বলার কারণ আমি তোমার নিকট উল্লেখ করছি। একবার আমি ঘুমে অচেতন ছিলাম। স্বপ্নে দেখলাম যে, জনৈক লোক আমার নিকট এসেছে। সে আমাকে বলল, দাঁড়িয়ে যাও। অতঃপর সে আমার হাত আঁকড়ে ধরল। আমি তার সাথে রওনা করলাম। আমি আমার বামপাশে কয়েকটি পথ দেখতে পেলাম এবং আমি সে পথ ধরে চলতে চাইলাম। সে আমাকে বলল, ওদিকে যেয়ে না। কারণ, এটা হলো বামপন্থীদের (কাফিরদের) পথ। তিনি বলেন, এরপর আমি আমার ডানপাশে কয়েকটি আলোক সরল পথ দেখতে পেলাম। এরপর সে বলল, এ রাস্তায় চলো। তিনি বলেন, অতঃপর সে আমাকে একটি পাহাড়ের চূড়ায় নিয়ে আসলো। অতঃপর আমাকে পাহাড়ে উঠতে বলল। আমি পাহাড়ে উঠতে চেষ্টারত ছিলাম। কিন্তু পাছায় হোচট খেয়ে পড়ে গেলাম। তিনি বলেন, আমি বেশ কয়েকবার এরূপ চেষ্টা করতে লাগলাম। তিনি বলেন, এরপর সে আমাকে নিয়ে রওনা হলো এবং একটি খুঁটির নিকট পৌছল, যার মাথা ছিল আকাশে এবং তার নিম্নভাগ ভূ-পৃষ্ঠের নীচে ছিল। খুঁটির চূড়ায় একটি কড়া ছিল। সে বলল, এর উপরে উঠো। তিনি বলেন, আমি বললাম, এতে কিভাবে চড়ব? এর মাথা তো আকাশের উপরিভাগে। তিনি বলেন, এরপর সে আমার হাত ধরল এবং আমাকে উপরে ঠেলে দিল। অকস্মাৎ আমি দেখলাম যে, আমি কড়ার সাথে ঝুলে আছি। তিনি বলেন, এরপর সে খুঁটির উপর করাঘাত করল এবং তা পড়ে গেল। তিনি বলেন, আর আমি কড়ার সাথে ঝুলে গেলাম। এভাবে আমার সকাল হলো। তিনি বলেন, এরপর আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে স্বপ্নের কথা সবিস্তারে বিবরণ দিলাম। তিনি বললেনঃ তুমি তোমার বামপাশে যে পথগুলো দেখেছ, তা হচ্ছে বামপন্থীদের রাস্তা এবং তোমার ডানপাশে যেসব রাস্তা দেখেছ, তা হচ্ছে আসহাবুল ইয়ামীন বা জান্নাতীগণের রাস্তা। তুমি যে পাহাড়টি দেখেছিলে তা হচ্ছে শাহীদগণের আবাসস্থল আর তা তুমি পাবে না। তুমি যে খুঁটিটি দেখেছিলে সেটা হচ্ছে ইসলামের খুঁটি। যে কড়াটি তুমি দেখেছিলে সেটা হচ্ছে ইসলামের কড়া। আর তুমি আমৃত্যু ইসলামের উপর সুপ্রতিষ্ঠিত থাকবে। (ইসলামিক ফাউন্ডেশন ৬১৫৯, ইসলামিক সেন্টার ৬২০২)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 213
			}
		}
	]
}