{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৯৫, আন্তর্জাতিক নাম্বারঃ ২৪৯৪ ৬২৯৫-(১৬১/২৪৯৪) আবূ বাকর ইবনু আবূ শাইবাহ ..... আলী (রাযিঃ) এর কাতিব উবাইদুল্লাহ ইবনু আবূ রাফি (রহঃ) রিওয়ায়াত করেন যে, তিনি আলী (রাযিঃ) কে বলতে শুনেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে যুবায়র ও মিকদাদ (রাযিঃ) কে (বিশেষ কাজে) প্রেরণ করে বললেনঃ তোমরা দ্রুত 'রাওযায়ে খাখ' (মদীনার সন্নিকটবর্তী একটি জায়গার নাম) যাও। সেখানে উষ্ট্রারোহিণী এক নারী রয়েছে তার কাছে একটি গোপনীয় পত্র রয়েছে। তোমরা তার নিকট হতে সেটা নিয়ে এসো। আমরা ঘোড়ার পৃষ্ঠে আরোহিত হয়ে ছুটে চললাম। সেখানে আমরা জনৈক নারীকে দেখতে পেলাম। আমরা তাকে বললাম, পত্র বের করে দাও। সে বলল, আমার নিকট কোন পত্র নেই। আমরা বললাম, তোমাকে পত্র বের করতেই হবে, আর না হলে গায়ের বস্ত্র খুলতে বাধ্য হব। তারপর সে তার চুলের বেণীর মাঝখান থেকে পত্র বের করে দিল। তখন আমরা তা নিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলাম। পত্র খুলে দেখা গেল যে, তা হাতিব ইবনু আবূ বালতা (রাযিঃ) এর পক্ষ হতে মক্কার কতিপয় মুশরিকের প্রতি লিখিত একটি চিঠি ছিল। তিনি এ চিঠিতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কতক গুরুত্বপূর্ণ কাজের লুকানো তথ্য প্রকাশ করে দিয়েছিলেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে হাতিব! তুমি এমন কাজ কেন করলে? সে বলল, হে আল্লাহর রসূল! আমার ব্যাপারে অনুগ্রহ করে দ্রুত রায় ঘোষণা করবেন না। আমি এমন একজন লোক, কুরায়শদের সঙ্গে যার সম্পর্ক রয়েছে (কিন্তু আমি তাদের বংশের কেউ নেই)। সুফইয়ান (রহঃ) বলেন, তিনি তাদের মিত্র ছিলেন, কিন্তু তাদের (বংশোদ্ভূত) গোত্রভুক্ত ছিলেন না। আর আপনার মুহাজির সাহাবীদের অনেকের আত্মীয়-স্বজন সেখানে আছে, যাদের মাধ্যমে তাদের পরিবার-পরিজনের নিরাপত্তা নিশ্চিত হচ্ছে। তাই আমি স্থির করলাম যে, কুরায়শদের সাথে যখন আমার কোন আত্মীয়তার সম্পর্ক নেই তখন এমন কোন কাজ করি যার দ্বারা আমার পরিবার-পরিজন মুক্তি পেতে পারে। আমি এ কাজটি এজন্য করিনি যে, আমি কাফির হয়ে গেছি অথবা মুরতাদ হয়েছি দীন থেকে। আর আমি ইসলাম কবুলের পরে কুফরের প্রতি আসক্ত হইনি। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে সত্যই বলেছে। উমার (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমাকে অনুমতি দিন, আমি এ মুনাফিকের গর্দান কেটে দিব। তখন তিনি বললেন, সে তো বদর যুদ্ধে শারীক হয়েছিল এবং তুমি কি জান না যে, আল্লাহ বাদরী সাহাবীদের সম্পর্কে অধিক অবহিত আছেন। তিনি বলেছেনঃ “তোমরা যা খুশী করতে পারো, আমি তোমাদের ক্ষমা করে দিয়েছি।” এরপর আল্লাহ তা'আলা এ আয়াত অবতীর্ণ করেন- “হে মু’মিনগণ! আমার ও তোমাদের শত্রুকে বন্ধুরূপে গ্রহণ করে না”— (সূরাহ আল মুমতাহিনাহ্ ৬০ঃ ১)। আবূ বকর ও যুহায়র বর্ণিত হাদীসে আয়াতের বর্ণনা নেই। আর ইসহাক তার বর্ণনায় আয়াতটিকে সুফইয়ানের তিলাওয়াত হিসেবে উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৬১৭৬, ইসলামিক সেন্টার ৬২২০)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		}
	]
}