{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6466,
			"arabicnumber": "2531",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৬০, আন্তর্জাতিক নাম্বারঃ ২৫৩১ ৬৩৬০-(২০৭/২৫৩১) আবূ বাকর ইবনু আবূ শাইবাহ্, ইসহাক ইবনু ইবরাহীম ও আবদুল্লাহ ইবনু আমর ইবনু আবান (রহঃ) ..... আবূ বুরদাহ (রাযিঃ) এর পিতার সানাদে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে মাগরিবের সালাত (সালাত/নামাজ/নামায) আদায় করলাম। তারপর আমরা বললাম, আমরা যদি তার সাথে ইশার সালাত (সালাত/নামাজ/নামায) আদায় করা পর্যন্ত উপবিষ্ট হতে পারতাম (তাহলে কতই না ভাল হত)। রাবী বলেন, আমরা বসে থাকলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট আসলেন। তারপর তিনি বললেনঃ তোমরা এখনো পর্যন্ত এখানে উপবিষ্ট আছ? আমরা বললাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমরা আপনার সাথে মাগরিবের সালাত (সালাত/নামাজ/নামায) আদায় করেছি। তারপর আমরা বললাম যে, ইশার সালাত (সালাত/নামাজ/নামায) আপনার সাথে আদায় করার জন্যে বসে অপেক্ষা করি। তিনি বললেনঃ তোমরা অনেক ভাল করেছ কিংবা তোমরা ঠিকই করেছ। তিনি (রাবী) বলেন, তারপর তিনি আকাশের দিকে মাথা তুললেন এবং তিনি অধিকাংশ সময়ই আকাশের পানে তার মাথা তুলতেন। অতঃপর তিনি বললেন, তারকারাজি অবস্থানের কারণেই আকাশ স্থিতিশীল রয়েছে। তারকারাজি যখন বিক্ষিপ্ত হয়ে পড়বে তখন আকাশের জন্য ওয়াদাকৃত বিপদ আসন্ন হবে (অর্থাৎ- কিয়ামত এসে যাবে এবং আসমান ফেটে চৌচির হয়ে যাবে)। আর আমি আমার সহাবাদের জন্য শান্তি ও নিরাপত্তা স্বরূপ। আমি যখন বিদায় নিব তখন আমার সহাবাদের উপর ওয়াদাকৃত সময় এসে সমুপস্থিত হয়ে যাবে (অর্থাৎ- ফিতনা-ফাসাদ ও দ্বন্দ্ব-সংঘাত লেগে যাবে)। আর আমার সহাবাগণ সকল উম্মাতের জন্য রক্ষাকবচ স্বরূপ। আমার সাহাবীগণ যখন বিদায় হয়ে যাবে তখন আমার উম্মাতের উপর ওয়াদাকৃত বিষয় উপস্থিত হবে*। (ইসলামিক ফাউন্ডেশন ৬২৩৬ ইসলামিক সেন্টার ৬২৮৪) ** অর্থাৎ- শির্ক, বিদ’আত ছড়িয়ে পড়বে, ফিতনাহ্-ফাসাদের আবির্ভাব হবে, শাইতানের শিং উদয় হবে, নাসারাদের রাজত্ব কায়িম হবে, মক্ক ও মদীনার অবমাননা করা হবে, বিশৃঙ্খলা ছড়িয়ে পড়বে ইত্যাদি। (ইমাম নবাবী)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 295
			}
		}
	]
}