{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6508,
			"arabicnumber": "2550.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪০২, আন্তর্জাতিক নাম্বারঃ ২৫৫০ ৬৪০২-(৭/২৫৫০) শাইবান ইবনু ফাররূখ (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, জুরায়জ (বনী ইসরাঈলের একজন আবিদ ব্যক্তি) তার ইবাদাতখানায় ইবাদাতে নিমগ্ন থাকতেন। (একবার) তার মাতা তার কাছে আসলেন। হুমায়দ (রহঃ) বলেন, আমাদের কাছে আবু রাফি এমন ভঙ্গিতে ব্যক্ত করেন, যেমনভাবে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মায়ের ডাকের ভঙ্গিতে আবু হুরাইরাহ (রাযিঃ) এর কাছে ব্যক্ত করেছেন। কিভাবে তার হাত তাঁর ভ্রুর উপর রাখছিলেন। এরপর তার দিকে মাথা উঁচু করে তাকে ডাকছিলেন। বললেন, হে জুরায়জ! আমি তোমার মা, আমার সাথে কথা বলো। এ কথা এমন অবস্থায় বলছিলেন, যখন জুরায়জ সালাতে নিমগ্ন ছিলেন। তখন তিনি মনে মনে বলতে লাগলেন, “হে আল্লাহ! (একদিকে) আমার মা আর (অপরদিকে) আমার সালাত (আমি কী করি?)\"। রাবী বলেন, অবশেষে তিনি তার সালাতকে অগ্রাধিকার দিলেন এবং তার মা ফিরে গেলেন। পরে তিনি দ্বিতীয়বার আসলেন এবং বললেন, হে জুরায়জ। আমি তোমার মা, তুমি আমার সঙ্গে কথা বলো। তিনি বললেন, ইয়া আল্লাহ! আমার মা, আমার সালাত। তখন তিনি তার সালাতে ব্যস্ত রইলেন। তখন তার মা বললেন, “হে আল্লাহ! এ জুরায়জ আমারই ছেলে। আমি তার সঙ্গে কথা বলতে চাচ্ছিলাম। সে আমার সাথে কথা বলতে অস্বীকার করল। হে আল্লাহ তার মৃত্যু দিয়ো না, যে পর্যন্ত তাকে ব্যভিচারিণীর মুখ না দেখাও।” তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, যদি তার মাতা তার বিরুদ্ধে অন্য কোন বিপদের জন্য বদদু’আ করতেন তাহলে অবশ্যই সে, বিপদে পতিত হত। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, এক মেষ রাখাল জুরায়জ এর ইবাদাতখানার নিকটেই (মাঝে মাঝে) আশ্রয় নিত। তিনি বলেন, এরপর গ্রাম থেকে এক মহিলা বের হয়ে এলে উক্ত রাখাল তার সাথে ব্যভিচারে লিপ্ত হয়। এতে মহিলাটি গর্ভবতী হয়ে পড়ে এবং একটি পুত্র সন্তান জন্ম দেয়। তখন লোকেরা তাকে জিজ্ঞেস করল, এ (সন্তান) কোথা থেকে? সে উত্তর দিল, এ ইবাদাতখানায় যে বাস করে, তার থেকে। তিনি বলেন, এরপর তারা শাবল কোদাল ইত্যাদি নিয়ে এলো এবং চীৎকার করে ডাক দিল। তখন জুরায়জ সালাতে মশগুল ছিলেন। কাজেই তিনি তাদের সাথে কথা বললেন না। তিনি বলেন, এরপর তারা তার ইবাদাতখানা ধ্বংস করতে লাগল। তিনি এ অবস্থা দেখে নীচে নেমে এলেন। এরপর তারা বলল, এ মহিলাকে জিজ্ঞেস করো (সে কী বলছে)। তিনি বলেন, তখন জুরায়জ মুচকি হেসে শিশুটির মাথায় হাত বুলিয়ে বললেন, তোমার পিতা কে? তখন শিশুটি বলল, আমার পিতা সে মেষ রাখাল। যখন তারা সে শিশুটির মুখে এ কথা শুনতে পেল তখন তারা বলল, (হে দরবেশ) আমরা তোমার ইবাদাতখানার (গীর্জার) যতটুকু ভেঙ্গে ফেলেছি তা সোনা-রূপা দিয়ে পুনঃনির্মাণ করে দেব। তিনি বললেন, না; বরং তোমরা মাটি দ্বারাই পূর্বের ন্যায় তা নির্মাণ করে দাও। এরপর তিনি তার ইবাদাতগাহে উঠে বসলেন। (ইসলামিক ফাউন্ডেশন ৬২৭৭, ইসলামিক সেন্টার ৬৩২৬)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		}
	]
}