{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 656,
			"arabicnumber": "282.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৩, আন্তর্জাতিক নাম্বারঃ ২৮২ ৫৪৩-(৯৫/২৮২) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যেন জমা পানিতে প্রস্রাব করে তা দিয়ে যেন গোসল না করে। (ইসলামিক ফাউন্ডেশনঃ ৫৪৭, ইসলামিক সেন্টারঃ ৫৬৩) প্রাসঙ্গিক আলোচনা পানি ও তার প্রকারভেদ যা প্রবাহমান নয় এমন পানি হলো, টাঙ্কির পানি, ছোট জলাধারের পানি ইত্যাদি। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এগুলোতে ময়লা ফেলতে নিষেধ করেছেন যাতে করে তা দূষিত হয়ে না পড়ে। কারণ, এর মাধ্যমে ভাইরাস ছড়িয়ে পড়তে পারে। মারাত্মক রোগ ব্যাধির প্রাদুর্ভাব ঘটতে পারে। মানুষের মধ্যে এ জাতীয় পানি ব্যবহারে ঘৃণার জন্ম হতে পারে। পানি বিশুদ্ধ ও পরিচ্ছন্ন রাখা, নষ্ট ও দূষিত না করা ঈমানের দাবি। পানি তিন প্রকার ১. পবিত্র পানিঃ আর তা হলো পানি তার সৃষ্টিগত স্বাভাবিক অবস্থায় বিদ্যমান থাকা। আর তা হলো- যে পানি দ্বারা অপবিত্রতা ও শরীরের পবিত্র অঙ্গের আপতিত নাজাসাত দূর করা হয়েছে। আল্লাহ তাআলা বলেছেন, “এবং আকাশ থেকে তোমাদের উপর বৃষ্টি বর্ষণ করেন, আর যাতে এর মাধ্যমে তিনি তোমাদেরকে পবিত্র করেন।” [সূরা আল ১১] ২. পবিত্র পানিঃ যে পানি নাজাসাত ছাড়াই রঙ বা স্বাদ বা গন্ধ পরিবর্তন হয়ে গেছে। এ ধরনের পানি নিজে পবিত্র; তবে এর যে কোনো একটি গুণ পরিবর্তন হওয়ার কারণে এর দ্বারা অপবিত্রতা দূর করা যাবে না। ৩. অপবিত্র পানি: যে পানি অল্প বা বেশি নাজাসাতের কারণে এর ৩টি গুণের যেকোনো একটি গুণ পরিবর্তন হয়ে গেছে। অপবিত্র পানি পবিত্র হয়ে যাবে, তার পরিবর্তনের কারণ নিজে নিজে দূর হলে বা উক্ত পানি শুকিয়ে ফেললে অথবা এর সাথে এতটুকু পরিমাণ পানি মিশানো; যাতে পরিবর্তনের কারণ দূরীভূত হয়ে যায়। যখন কোনো মুসলিম পানির অপবিত্রতা বা পবিত্রতার ব্যাপারে সন্দেহ পোষণ করবে তখন সে তার নিশ্চিত ধারণার ওপর ভিত্তি করে পবিত্রতা অর্জন করবে। আর তা হলো, পবিত্র বস্তুসমূহের আসল হচ্ছে পবিত্র থাকা। যখন কোনো পানি, যা দ্বারা পবিত্রতা অর্জন করা যায় আর যা দ্বারা পবিত্রতা অর্জন করা যায় না এমন কোন পানির সাথে সন্দেহে নিপতিত করবে তখন তা বাদ দিয়ে তায়াম্মুম করবে। যখন কোনো পবিত্র কাপড়, অপবিত্র বা হারাম কাপড়ের সাথে একাকার হওয়ার কারণে সন্দেহে নিপতিত করবে, তখন ইয়াকীনের ওপর ভিত্তি করবে এবং সে কাপড় দ্বারা কেবল একটি সালাত আদায় করবে। হাদিস থেকে শিক্ষা ১. বদ্ধ পানিতে পেশাব করা হারাম, পায়খানা করা আরো বড় হারাম। ২. এ নিষেধাজ্ঞা দ্বারা কি হারাম বুঝানো হয়েছে নাকি মাকরূহে তাহরীমী বুঝানো হয়েছে এ ব্যাপারে দু'টি মত রয়েছে: মালেকীরা বলেন, তা মাকরূহ, আর হাম্বলী ও যাহেরীরা বলেন, তা হারাম বুঝাবে। কোনো কোনো আলেম বলেন, অল্প পানির জন্য তা হারাম, আর বেশি পানির জন্য তা মাকরূহ। তবে হারাম হওয়াই অধিক যুক্তিযুক্ত। ৩. যদি পানিতে পেশাব করা হয় তবে তা কি নাপাক হয়ে যাবে? এ ব্যাপারে সবাই একমত যে, যদি পেশাব দ্বারা সে পানি পরিবর্তিত হয়ে যায় তবে তা অপবিত্র হয়ে যাবে। পানি কম হোক কিংবা বেশি। আর যদি পানি এত বেশি হয় যে, তাতে পেশাব তেমন পরিবর্তন করতে পারেনি, তবে সকলের ঐকমত্যে তা পবিত্র। কিন্তু যদি অল্প পানি থাকে আর তা পেশাব বা পায়খানা দ্বারা পরিবর্তন না করে থাকে, তবে এ ব্যাপারে দু'টি মত রয়েছে- ইমাম মালিক, বুখারী ও দাউদ এর মতে তা পবিত্র থেকে যাবে। অন্য দিকে ইমাম আবু হানীফা, শাফোয়ী, আহমাদের মতে তা অপবিত্র হয়ে যাবে। যদিও ইমাম মালিকের মতটি অনেক সত্যনিষ্ঠ আলেম, যেমন শাইখুল ইসলাম ইবন তাইমিয়্যাহ প্রমুখের মতে বেশি শক্তিশালী। ৪. এ হাদীস থেকে আরো বুঝা যায় যে, অপবিত্র অবস্থা থেকে মুক্ত হওয়ার জন্য বদ্ধ পানি অর্থাৎ টাঙ্কি বা পানির ছোট হাউজে ডুব দিয়ে গোসল করা একেবারেই নিষেধ; যদিও তাতে পেশাব না করা হয়। নিয়ম হচ্ছে সেখান থেকে হাত বা কোনো কিছু দিয়ে পানি নিয়ে পবিত্র হওয়া। ৫. সর্বাবস্থায় কষ্টদায়ক যাবতীয় কাজ ও সীমালঙ্ঘনকারী কোনো কিছু করা নিষেধ হওয়া।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		}
	]
}