{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 677,
			"arabicnumber": "292.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪, আন্তর্জাতিক নাম্বারঃ ২৯২ ৫৬৪-(১১১/২৯২) আবূ সাঈদ আল আশাজ্জ (রহঃ), আবূ কুরায়ব মুহাম্মাদ ইবনুল 'আলা (রহঃ) ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি কবরের পাশ দিয়ে যাচ্ছিলেন। এমন সময় তিনি বললেন, (জেনে রাখ) এ দু' কবরবাসীকে আযাব দেয়া হচ্ছে। তবে কোন কঠিন (কাজের) দরুন তাদেরকে আযাব দেয়া হচ্ছে না। তাদের একজন চোগলখোরী করত। আর অপরজন তার প্রস্রাব থেকে সতর্কতা অবলম্বন করত না। তিনি [ইবনু আব্বাস (রাযিঃ)] বলেনঃ অতঃপর তিনি খেজুরের একটি কাঁচা ডাল আনিয়ে দু’টুকরো করলেন। তারপর প্রত্যেক কবরের ওপর একটি করে গেড়ে দিলেন। আর বললেনঃ সম্ভাবনা আছে, আযাব কিছুটা হালকা করা হবে যতদিন পর্যন্ত এ দুটি না শুকিয়ে যাবে। (ইসলামিক ফাউন্ডেশনঃ ৫৬৮, ইসলামিক সেন্টারঃ ৫৮৪) প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ \"আলাইহি ওয়াসাল্লাম বলেছেন, 'আশা করা যায় যতক্ষণ এ দু'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এ দু'জনের নাম বর্ণনা করেননি।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		}
	]
}