{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7,
			"text": "হাদিস একাডেমি নাম্বারঃ ৫, আন্তর্জাতিক নাম্বারঃ ৫ (৫/...) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... হাফস ইবনু আসিম (রাযিঃ) থেকে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ কোন ব্যক্তির মিথ্যাবাদী সাব্যস্ত হওয়ার জন্য এতটুকুই যথেষ্ট যে, সে যা শুনে তাই বলে বেড়ায়। মুহাম্মাদ ইবনু আল মুসান্না (রহঃ)-এর সূত্রেও হাদীসটি বর্ণিত হয়েছে। (.../...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে অনুরূপ বর্ণিত হয়েছে। (.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ উসমান আন নাহদী (রহঃ) থেকে বর্ণনা করেন যে, উমার ইবনুল খাত্তাব (রাযিঃ) বলেছেন, কোন ব্যক্তি মিথ্যাবাদী হওয়ার জন্য এতটুকুই যথেষ্ট যে, সে যা শুনে তা বলে বেড়ায়। (.../...) আবূ তাহির আহমাদ ইবনু আমর (রহঃ) ..... ইবনু ওয়াহব (রহঃ) থেকে বর্ণনা করেন যে, তিনি বলেন, মালিক (রহঃ) আমাকে বলেছেন, জেনে রাখ, যদি কোন ব্যক্তি যা শোনে তা বলে বেড়ায় তবে সে (মিথ্যা হতে) নিরাপদ নয়। আর যে ব্যক্তি যা শোনে তা বলে বেড়ায় সে কখনো ইমাম হবে না। (../...) ইবনু আল মুসান্না (রহঃ) ..... আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কোন ব্যক্তি মিথ্যাবাদী হওয়ার জন্য এতটুকুই যথেষ্ট যে, সে যা শুনে তা বলে বেড়ায়। (.../...) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) বর্ণনা করেন যে, তিনি আবদুর রহমান ইবনু মাহদী (রাযিঃ)-কে (যিনি হাদীসের একজন বড় ইমাম) বলতে শুনেছেনঃ কোন ব্যক্তি অনুসরণযোগ্য ইমাম হতে পারবে না, যে পর্যন্ত সে শোনা কথা কতক (মিথ্যা হওয়ার সম্ভাবনা) বর্ণনা করা থেকে বিরত না থাকবে। (.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সুফইয়ান ইবনু হুসায়ন (রহঃ) হতে বর্ণিত। ইয়াস ইবনু মুআবিয়াহ্ (রহঃ) আমাকে বললেন, অবশ্যই আমি দেখছি যে, তুমি কুরআন সম্পৰ্কীয় ইলম হাসিলে (ইলমে তাফসীর) বেশ পরিশ্রম করেছে। তুমি আমাকে একটি সূরাহ পড়ে শোনাও এবং তার তাফসীর কর। যাতে আমি দেখতে পারি, তোমার ইলম কতটুকু হলো। সুফইয়ান (রহঃ) বলেন, আমি তাই করলাম। অতঃপর ইয়াস (রহঃ) আমাকে বললেন, আমি তোমাকে যা বলছি তা স্মরণ রাখবে। তুমি দোষ-ত্রুটি সম্পন্ন হাদীস বর্ণনা থেকে বেঁচে থাকবে। কেননা, যে এ কাজ করে সে নিজেকে লাঞ্ছিত করেছে এবং হাদীস বর্ণনায় সে মিথ্যাবাদী বলে প্রতিপন্ন হয়েছে। (.../...) আবূ তাহির এবং হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন তুমি কোন সম্প্রদায়ের কাছে এমন কোন হাদীস বর্ণনা করবে, যা তাদের বুঝে আসে না তখন তা তাদের কারো কারো পক্ষে ফিতনাহ হয়ে দাঁড়াবে। তাই প্রত্যেককে তার জ্ঞানের পরিধি অনুযায়ী কথা শুনানো উচিত।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 7
			}
		}
	]
}