{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7065,
			"arabicnumber": "2797",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৮, আন্তর্জাতিক নাম্বারঃ ২৭৯৭ ৬৯৫৮-(৩৮/২৭৯৭) উবাইদুল্লাহ ইবনু মুআয (রহঃ) এবং মুহাম্মাদ ইবনু আবদুল আ’লা আল কায়সী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবু জাহল বলেছিল, মুহাম্মদ কি তোমাদের মাঝে তার মুখমণ্ডল জমিনের উপর রাখে? লোকেরা বলল, হ্যাঁ রাখে। তখন সে বলল, আমি লাত এবং উয্যার শপথ করে বলছি, আমি যদি তাকে এমন করতে দেখি তবে নিশ্চয়ই আমি তার ঘাড় পদদলিত করব, অথবা তার মুখমণ্ডল আমি মাটিতে মেখে দিব। (নাউযুবিল্লাহ) তারপর একদা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায়ে রত ছিলেন। এমন সময় আবূ জাহল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গর্দানকে পদদলিত করার উদ্দেশে তার কাছে আসলো। একটু অগ্রসর হয়ে অকস্মাৎ সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে মুখ ফিরিয়ে দ্রুত পিছনে সরে আসল এবং দু' হাত দিয়ে নিজেকে বাঁচাতে লাগল। এ দেখে তাকে প্রশ্ন করা হলো, তোমার কি হয়েছে? উত্তরে সে বলল, আমি দেখেছি যে, আমার এবং তার মধ্যে আগুনের একটি প্রকাণ্ড খাদক, ভয়াবহ অবস্থা এবং কতগুলো ডানা। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সে যদি আমার নিকটে আসত, তবে ফেরেশতাগণ তার অঙ্গ-প্রত্যঙ্গকে ছিন্নবিচ্ছিন্ন করে ফেলতো। রাবী বলেন, অতঃপর আল্লাহ তা’আলা অবতীর্ণ করলেন। রাবী (আবু হাযিম) বলেন, আবু হুরাইরাহ (রাযিঃ) এর হাদীসের মধ্যে এ অবতীর্ণ আয়াতটি আছে, না এ মর্মে তার কাছে কোন খবর পৌছেছে, তা আমাদের জানা নেই। “কক্ষনো ঠিক নয়, মানুষ তো সীমালঙ্ঘন করেই থাকে, কেননা সে নিজেকে স্বয়ংসম্পূর্ণ মনে করছে। আপনার প্রতিপালকের কাছে ফিরে যেতে হবে এটা সুনিশ্চিত। আপনি বলুন তো সে ব্যক্তি সম্পর্কে যে বাধা দেয় এক বান্দাকে যখন সে সালাত আদায় করে। আপনি বলুন তো যদিও সে সালাত আদায়কারী ব্যক্তিটি সৎপথে থাকে এবং তাকওয়ার আদেশ করে এমন ব্যক্তিকে কি বাধা দেয়া ব্যক্তি তবে সে কি জানে না যে, আল্লাহ প্রত্যক্ষ করেন? সাবধান, সে যদি বিরত না হয়, তবে আমি অবশ্যই তাকে হেঁচড়িয়ে নিয়ে যাব মস্তকের অগ্রভাগের কেশগুচ্ছ ধরে, সেটি মিথ্যাচারী পাপিষ্ঠের কেশগুচ্ছ। অতএব সে তার নাসিয়াহ অর্থাৎ- তার সম্প্রদায়কে আহবান করুক। আমি যবনিয়াকে (সম্প্রদায়কে) আহবান করব। কক্ষনো তুমি তার অনুকরণ করো না”— (সূরা আল ‘আলাক ৯৬ঃ ৬-১৯)। উবাইদুল্লাহ তার হাদীসে এতটুকু বাড়িয়েছেনঃ রাবী আবু হুরাইরাহ (রাযিঃ) বলেন, তার (রসূল) আদেশ আল্লাহর নির্দেশ অনুযায়ী (প্রযোজ্য)। ইবনু আবদুল আ’লা বৃদ্ধি করেছেন فَلْيَدْعُ نَادِيَهُ অর্থাৎقَوْمَهُ ও তার সম্প্রদায়কে ডাকুক। (ইসলামিক ফাউন্ডেশন ৬৮০৮, ইসলামিক সেন্টার ৬৮৬২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		}
	]
}