{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 716,
			"arabicnumber": "315.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩, আন্তর্জাতিক নাম্বারঃ ৩১৫ ৬০৩-(৩৪/৩১৫) আল হাসান ইবনু আলী আল হুলওয়ানী (রহঃ) ..... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুক্তিপ্রাপ্ত গোলাম সাওবান (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে দাঁড়িয়েছিলাম। ইতোমধ্যেই ইয়াহুদীদের এক আলিম এসে বলল, আসসালামু 'আলাইকা ইয়া মুহাম্মাদ! এরপর আমি তাকে এমন এক ধাক্কা মারলাম যে, সে প্রায় পড়ে যাওয়ার উপক্রম হলো! সে বলল, তুমি আমাকে ধাক্কা মারলে কেন? আমি বললাম, ইয়া রাসূলাল্লাহ! বলতে পার না। ইয়াহুদী বলল, আমরা তাকে তার পরিবার-পরিজন যে নাম রেখেছে সে নামেই ডাকি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমার নাম মুহাম্মাদ। আমার পরিবারের লোকই আমার এ নাম রেখেছে। এরপর ইয়াহুদী বলল, আমি আপনাকে (কয়েকটি কথা) জিজ্ঞেস করতে এসেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তাকে বললেন, তোমার কী লাভ হবে, যদি আমি তোমাকে কিছু বলি? সে বলল, আমি আমার কান পেতে শুনব। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তার কাছে যে খড়িটি ছিল তা দিয়ে মাটিতে আঁকাঝোকা দাগ কাটতে ছিলেন। তারপর বললেন, জিজ্ঞেস কর। ইয়াহুদী বলল, যেদিন এ জমিন ও আকাশমণ্ডলী পাল্টে গিয়ে অন্য জমিন ও আকাশমণ্ডলীতে পরিণত হবে (অর্থাৎ কিয়ামত হবে) সেদিন লোকজন কোথায় থাকবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তারা সেদিন পুলসিরাতের কাছে অন্ধকারে থাকবে। সে বলল, কে সর্বপ্রথম (তা পার হবার) অনুমতি লাভ করবে? তিনি বললেন, দরিদ্র মুহাজিরগণ! ইয়াহুদী বলল, জান্নাতে যখন তারা প্রবেশ করবে তখন তাদের তোহফা কি হবে? তিনি বললেন, মাছের কলিজার টুকরা। সে বলল, এরপর তাদের দুপুরের খাদ্য কি হবে? তিনি বললেন, তাদের জন্য জান্নাতের ষাঁড় যাবাহ করা হবে যা জান্নাতের আশেপাশে চড়ে বেড়ায়। সে বলল, এরপরে তাদের পানীয় কি হবে? তিনি বললেন, সেখানকার একটি ঝর্ণার পানি যার নাম সালসাবীল। সে বলল, আপনি ঠিক বলেছেন। সে আরো বলল যে, আমি আপনার কাছে এমন একটি বিষয় সম্পর্কে জিজ্ঞেস করতে এসেছি যা নবী ছাড়া পৃথিবীর কোন অধিবাসী জানে না অথবা একজন কি দু'জন লোক ছাড়া। তিনি বললেন, আমি যদি তোমাকে তা বলে দেই তবে তোমার কি কোন উপকার হবে? সে বলল, আমি আমার কান পেতে শুনব। সে বলল, আমি আপনাকে সন্তান সম্পর্কে জিজ্ঞেস করতে এসেছি। তিনি বললেন, পুরুষের বীর্য সাদা এবং মেয়েলোকের বীর্য হলুদ। যখন উভয়টি একত্রিত হয়ে যায় এবং পুরুষের বীর্য মেয়েলোকের বীর্যের উপর প্রাধান্য লাভ করে তখন আল্লাহর হুকুমে পুত্র সন্তান হয়। আর যখন মেয়েলোকের বীর্য পুরুষের বীর্যের ওপর প্রধান্য লাভ করে তখন আল্লাহর হুকুমে কন্যা সন্তান হয়। ইয়াহুদী বলল, আপনি ঠিকই বলেছেন এবং নিশ্চয়ই আপনি নবী। এরপর সে চলে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, এ লোক আমার কাছে যা জিজ্ঞেস করেছে, ইতোপূর্বে আমার সে সম্পর্কে কোন জ্ঞানই ছিল না। আল্লাহ তা'আলা এক্ষণে আমাকে তা জানিয়ে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৬০৭, ইসলামিক সেন্টারঃ ৬২৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		}
	]
}