{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7281,
			"arabicnumber": "2899.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৭৩, আন্তর্জাতিক নাম্বারঃ ২৮৯৯ ৭১৭৩-(৩৭/২৮৯৯) আবু বকর ইবনু আবু শাইবাহ ও ‘আলী ইবনু হুজর (রহঃ) ..... ইউসায়র ইবনু জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার কুফা নগরীতে লাল ঝঞ্ঝা বিশিষ্ট বায়ু প্রবাহিত হলো। এমন সময় জনৈক লোক কুফায় এসে বলল যে, হে আবদুল্লাহ ইবনু মাসউদ সতর্ক হও, কিয়ামত এসে গেছে। (আবদুল্লাহ ইবনু মাসউদ) তিনি বসে রইলেন যেমন তিনি বসে ছিলেন, বললেন কিয়ামত সংঘটিত হবে না, যতক্ষণ না উত্তরাধিকার সম্পদ অবণ্টিত থাকবে এবং যতক্ষণ না মানুষেরা গনীমাতের বিষয়ে আনন্দ প্রকাশ না করবে। তারপর তিনি নিজ হাত দ্বারা সিরিয়ার প্রতি ইশারা করে বললেন, আল্লাহর শত্রুরা একত্রিত হবে মুসলিমদের সঙ্গে যুদ্ধ করার জন্য এবং মুসলিমগণও তাদের সাথে যুদ্ধ করার জন্য একত্রিত হবে। এ কথা শ্রবণে আমি বললাম, আল্লাহর শত্রু বলে আপনাদের উদ্দেশ্য হলো রোমীয় (খ্ৰীষ্টান) সম্প্রদায়। তিনি বললেন, হ্যাঁ! এবং তখন ভয়াবহ যুদ্ধ সংঘটিত হবে। তখন মুসলিম জাতি একটি দল অগ্রে প্রেরণ করবে, তারা মৃত্যুর জন্য সম্মুখে এগিয়ে যাবে। বিজয় অর্জন করা ছাড়া তারা প্রত্যাবর্তন করবে না। এরপর পরস্পর তাদের মধ্যে যুদ্ধ হবে। যুদ্ধ করতে করতে রাত্রি অতিবাহিত হয়ে যাবে। তারপর দু’ পক্ষের সৈন্য জয়লাভ করা ছাড়াই ফিরে চলে যাবে। যুদ্ধের জন্য মুসলিমদের যে দলটি এগিয়ে গিয়েছিল তারা প্রত্যেকেই মৃত্যুবরণ করবে। অতঃপর পরবর্তী দিন মুসলিমগণ মৃত্যুর জন্য অপর একটি দল সামনে পাঠাবে। তারা সবাই মৃত্যুবরণ করবে। অতঃপর পরবর্তী দিন মুসলিমগণ মৃত্যুর জন্য অপর একটি দল সামনে পাঠাবে। তারা বিজয়ী না হয়ে ফিরবে না। এদিনও পরস্পরের মধ্যে মারাত্মক যুদ্ধ হবে। পরিশেষে সন্ধ্যা হয়ে যাবে। উভয় বাহিনী বিজয়লাভ করা ছাড়াই স্বীয় শিবিরে প্রত্যাবর্তন করবে। যে দলটি সামনে ছিল তারা সরে যাবে। অতঃপর তৃতীয় দিন আবার মুসলিমগণ মৃত্যু বা বিজয়ের উদ্দেশে অপর একটি বাহিনী পাঠাবে। এ যুদ্ধ সন্ধ্যা পর্যন্ত চলতে থাকবে। পরিশেষে বিজয়লাভ করা ছাড়াই উভয় বাহিনী প্রত্যাবর্তন করবে। তবে মুসলিম বাহিনীর সামনের সেনাদলটি শাহীদ হয়ে যাবে। তারপর যুদ্ধের চতুর্থ দিনে অবশিষ্ট মুসলিমগণ সকলেই যুদ্ধের জন্য সামনে এগিয়ে যাবে। সেদিন কাফিরদের উপর আল্লাহ তা’আলা অকল্যাণ চক্র চাপিয়ে দিবেন। তারপর এমন যুদ্ধ হবে যা জীবনে কেউ দেখবে না অথবা যা জীবনে কেউ দেখেনি। পরিশেষে তাদের শরীরের উপর পাখী উড়তে থাকবে। পাখী তাদেরকে অতিক্রম করবে না; এমতাবস্থায় তা মাটিতে পড়ে নিহত হবে। একশ’ মানুষ বিশিষ্ট একটি গোত্রে, মাত্র এক লোক বেঁচে থাকবে। এমন সময় কেমন করে গনীমাতের সম্পদ নিয়ে লোকেরা আনন্দোৎসব করবে এবং কেমন করে উত্তরাধিকার সম্পদ ভাগ করা হবে। এমতাবস্থায় মুসলিমগণ আরেকটি ভয়ানক বিপদের খবর শুনতে পাবে এবং এ মর্মে একটি শব্দ তাদের কাছে পৌছবে যে, দাজ্জাল তাদের পেছনে তাদের পরিবার-পরিজনের মধ্যে চলে এসেছে। এ সংবাদ শুনতেই তারা হাতের সমস্ত কিছু ফেলে দিয়ে রওনা হয়ে যাবে এবং দশজন অশ্বারোহী ব্যক্তিকে সংবাদ সংগ্রাহক দল হিসেবে প্রেরণ করবে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, দাজ্জালের খবর সংগ্রাহক দলের প্রতিটি লোকের নাম, তাদের বাপ-দাদার নাম এবং তাদের ঘোড়ার রং সম্পর্কেও আমি জ্ঞাত আছি। এ পৃথিবীর সর্বোত্তম অশ্বারোহী দল সেদিন তারাই হবে। ইবনু আবূ শাইবাহ্ (রহঃ) তার রিওয়ায়াতের মধ্যেস্থলেউল্লেখ করেছেন। অর্থাৎ জাবির এর ছেলের নাম ইউসায়র-এর স্থলে উসায়র বলেছেন। (ইসলামিক ফাউন্ডেশন ৭০১৭, ইসলামিক সেন্টার ৭০৭৪)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 47
			}
		}
	]
}