{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7350,
			"arabicnumber": "2927.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭২৪০, আন্তর্জাতিক নাম্বারঃ ২৯২৭ ৭২৪০-(৯১/…) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবু সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার আমরা হাজ্জ বা উমরার উদ্দেশে রওয়ানা হলাম। আমাদের সঙ্গে ইবনু সায়িদ ছিল। তারপর কোন এক মঞ্জিলে আমরা অবতরণ করলাম। লোকেরা এদিক-সেদিক ছড়িয়ে পড়ল। কেবল আমি এবং সে থেকে গেলাম। লোকেরা ইবনু সাইয়্যাদ এর ব্যাপারে যে কথা কথোপকথন করছে, এ কারণে আমি তার প্রতি অত্যধিক ভীত ও ঘাবড়িয়ে গিয়েছিলাম। তিনি বলেন, ইবনু সাইয়্যাদ তার দ্রব্য-সামগ্ৰী আমার সাথে এনে রাখল। আমি বললাম, গরম খুব বেশী মনে হচ্ছে। তুমি যদি তোমার দ্রব্য-সামগ্ৰী ঐ গাছের নীচে রাখতে তবে ভালো হতো। এ কথা শুনে সে তা-ই করল। তারপর আমাদের জন্য কতগুলো বকরী নিয়ে আসা হলো। এ দেখে ইবনু সাইয়্যাদ সেখানে গেল এবং এক পাত্র দুধ নিয়ে এলো। এরপর সে আমাকে বলল, হে আবু সাঈদ! তুমি দুধ পান করে নাও। আমি বললাম, গরম খুব বেশী। দুধও গরম। আবু সাঈদ আল খুদরী (রাযিঃ) বলেন, তার হাতে দুধ পান করা বা তার হাত হতে দুধ গ্রহণ করা আমি পছন্দ করিনি। এ দেখে ইবনু সাইয়্যাদ বলল, হে আবু সাঈদ! লোকেরা আমার ব্যাপারে যে সব কথাবার্তা বলছে, এখন আমার ইচ্ছা হয় যে, আমি একটি রশি নিয়ে সেটা গাছে লটকিয়ে ফাঁসি দিয়ে মরে যাই এবং তাথেকে পরিত্রাণ লাভ করি। তারপর সে বলল, হে আবু সাঈদ! তোমাদের আনসার সম্প্রদায়ের চেয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীস আর কারো কাছে অজানা নেই? তুমি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীস সম্বন্ধে সবচেয়ে বেশী জ্ঞাত নও? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি বলেননি যে, সে ব্যক্তি (দাজ্জাল) কাফির হবে? অথচ আমি মুসলিম। তিনি কি বলেননি যে, দাজ্জাল নিঃসন্তান? আর তার কোন সন্তান হবে না? অথচ মদীনায় আমি আমার সন্তান রেখে এসেছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি বলেননি যে, দাজ্জাল মক্কাহ-মদীনাহ প্রবেশ করতে পারবে না? অথচ আমি মদীনাহ থেকে এসেছি এবং মক্কাহ যাবার ইচ্ছা করছি। আবূ সাঈদ আল খুদরী (রাযিঃ) বলেন, তার কথায় আমি তাকে বিশ্বাস করার কাছাকাছি পৌছে গিয়েছিলাম। অতঃপর ইবনু সাইয়্যাদ বললঃ আল্লাহর শপথ আমি তাকে (দাজ্জালকে) চিনি, তার জন্মস্থান চিনি এবং এখন সে কোথায় অবস্থান করছে, তাও আমি জানি। এ কথা শুনে আমি বললাম, তোমার সারাটা দিন ধ্বংস হোক, অকল্যাণকর হোক। (ইসলামিক ফাউন্ডেশন ৭০৮৬, ইসলামিক সেন্টার ৭১৪০)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 114
			}
		}
	]
}