{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭২৭৬, আন্তর্জাতিক নাম্বারঃ ২৯৪২ ৭২৭৬-(১১৯/২৯৪২) আবদুল ওয়ারিস ইবনু আবদুস্ সামাদ ইবনু ‘আবদুল ওয়ারিস ও হাজ্জাজ ইবনু শাইর (রহঃ) ..... আমির ইবনু শারাহীল শা’বী (রহঃ) থেকে বর্ণিত। তিনি যাহহাক ইবনু কায়স এর বোন ফাতিমাহ বিনতু কায়স (রাযিঃ) কে প্রশ্ন করলেন। যে সকল মহিলাগণ প্রথমে হিজরত করেছিলেন, তিনি তাদের মধ্যে অন্যতম। তিনি বলেন, আপনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে যে হাদীস শুনেছেন, অন্যের দিকে সম্বোধন করা ছাড়া, এমন একটি হাদীস আপনি আমার কাছে পেশ করুন। তিনি বললেন, তবে তুমি যদি শুনতে চাও, অবশ্যই আমি তা বর্ণনা করব। সে বলল, হ্যাঁ, আপনি বর্ণনা করুন। তিনি বললেন, আমি ইবনু মুগীরাকে বিয়ে করেছিলাম। তিনি কুরাইশী যুবকদের উত্তম ব্যক্তি ছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে প্রথম যুদ্ধে অংশগ্রহণ করেই তিনি শাহীদ হয়ে যান। আমি বিধবা হয়ে যাবার পর আবদুর রহমান ইবনু আওফ (রাযিঃ) আমার কাছে বিয়ের প্রস্তাব পাঠান। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আরো কতিপয় সহাবারাও প্রস্তাব পাঠান। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেও তার আযাদকৃত গোলাম উসামাহ্ ইবনু যায়দ এর জন্য প্রস্তাব পাঠান। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ হাদীসটি আমি আগেই শুনেছিলাম যে, তিনি বলেছেন, যে লোক আমাকে ভালবাসে সে যেন উসামাকেও ভালবাসে। ফাতিমাহ (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ সম্পর্কে আমার সাথে আলোচনা করার পর আমি তাকে বললাম, আমার বিষয়টি আপনার ইচ্ছামাফিক ছেড়ে দিলাম। আপনি যার সঙ্গে ইচ্ছা আমাকে বিবাহ দিয়ে দিন। তারপর তিনি বললেন, তুমি উম্মু শারীক এর কাছে চলে যাও। উম্মু শারীক একজন আনসার ধনবান মহিলা, আল্লাহর রাস্তায় সে বেশি খরচ করে এবং তার কাছে অনেক অতিথি আসে। এ কথা শুনে আমি বললাম, আমি তা-ই করব। তখন তিনি বললেন, তুমি উম্মু শারীকের নিকট যেয়ো না। কেননা উম্মু শারীক আপ্যায়নপ্রিয় মহিলা এবং আমি এটাও পছন্দ করি না যে, তোমার উড়না পড়ে যাক বা তোমার পায়ের গোছা বস্ত্রহীন হয়ে যাক আর লোকেরা তোমার শরীরের এমন স্থান দেখে নিক যা তুমি কক্ষনো পছন্দ করো না। তবে তুমি তোমার চাচাতো ভাই আবদুল্লাহ ইবনু উম্মু মাকতুম এর নিকট চলে যাও। তিনি বানী ফিহর এর এক ব্যক্তি। ফিহর কুরাইশেরই একটি শাখা গোত্র। ফাতিমাহ যে খান্দানের লোক তিনিও সে খান্দানেরই লোক। আমি তার কাছে চলে গেলাম। তারপর আমার ইদ্দত শেষ হলে আমি এক আহ্বানকারীর আওয়াজ শুনতে পেলাম। বস্তুতঃ তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক নির্ধারিত আহ্বানকারী ছিলেন। তিনি এ মর্মে আহবান করছিলেন যে, সালাতের উদ্দেশে তোমরা সমবেত হয়ে যাও। এরপর আমি মসজিদের দিকে অগ্রসর হলাম এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে সালাত আদায় করলাম। তিনি বলেন, সম্প্রদায়ের পেছনে যে কাতারে মহিলাগণ ছিলেন আমি সে কাতারেই ছিলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায়ন্তে হাস্যোজ্জ্বল অবস্থায় মিম্বারে বসে গেলেন। অতঃপর বললেন, প্রত্যেকেই আপন আপন স্থানে বসে যাও। তারপর তিনি বললেন, তোমরা কি জান, আমি কি জন্য তোমাদেরকে সমবেত করেছি? সহাবায়ে কিরাম বললেন, আল্লাহ ও তার রসূলই অধিক জ্ঞাত। তিনি বললেন, আল্লাহর শপথ আমি তোমাদেরকে কোন আশা বা ভয়-ভীতির জন্য জমায়েত করিনি। তবে আমি তোমাদেরকে কেবল এজন্য জমায়েত করেছি যে, তামীম আদ দারী (রাযিঃ) প্রথমে খ্রীস্টান ছিল। সে আমার কাছে এসে বাই’আত গ্রহণ করেছে এবং ইসলাম ধর্ম গ্রহণ করেছে। সে আমার নিকট এমন একটি কাহিনী বর্ণনা করেছে যদ্বারা আমার সে বর্ণনার সত্যায়ন হয়ে যায়, যা আমি দাজ্জালের ব্যাপারে তোমাদের নিকট বর্ণনা করেছিলাম। সে আমাকে বলেছে যে, একবার সে লাখ্‌ম ও জুযাম গোত্রের ত্রিশজন লোকসহ একটি সামুদ্রিক জাহাজে আরোহণ করেছিল। সামুদ্রিক ঝড় এক মাস পর্যন্ত তাদেরকে নিয়ে খেলা করতে থাকে। অতঃপর সূর্যাস্তের সময় তারা সমুদ্রের এক দ্বীপে আশ্রয় গ্রহণ করে। তারপর তারা ছোট ছোট নৌকায় বসে ঐ দ্বীপে প্রবেশ করে। দ্বীপে নামতেই জন্তুর ন্যায় একটি জিনিস তাদের দেখতে পায়। তার পূর্ণ দেহ পশমে ভরা ছিল। পশমের কারণে তার আগা-পাছা চেনার উপায় ছিল না। লোকেরা তাকে বলল, হতভাগা, তুই কে? সে বলল, আমি জাস্‌সা-সাহ। লোকেরা বলল, “জাস্‌সা-সাহ! আবার কি? সে বললঃ ঐ যে গীর্জা দেখা যায়, সেখানে চলো। সেখানে এক লোক গভীর আগ্রহে তোমাদের অপেক্ষা করছে। তামীম আদ দারী (রাযিঃ) বলেন, তার মুখে এক লোকের কথা শুনে আমরা ভয়ে শঙ্কিত হলাম যে, সে আবার শাইতান (শয়তান) তো নয়! আমরা দ্রুত পদব্রজে গীর্জায় প্রবেশ করতেই এক দীর্ঘাকৃতির এক লোককে দেখতে পেলাম। যা ইতোপূর্বে এমন আমরা আর কক্ষনো দেখিনি। লোহার শিকলে বাঁধা অবস্থায় দু' হাটুর মধ্য দিয়ে তার উভয় হাত ঘাড়ের সাথে মিলানো। আমরা তাকে বললাম, তোর সর্বনাশ হোক, তুই কে? সে বলল, তোমরা আমার সন্ধান কিছু না কিছু পেয়েই গেছ। এখন তোমরা বলো, তোমাদের পরিচয় কি? তারা বলল, আমরা আরবের বাসিন্দা। আমরা সমুদ্রে নৌকায় চড়ে ভ্রমণ করছিলাম। আমরা সমুদ্রকে উত্তাল তরঙ্গে উদ্বেলিত অবস্থায় পেয়েছি। এক মাস পর্যন্ত ঝড়ের কবলে থেকে অবশেষে আমরা তোমার এ দ্বীপে এসে পৌছেছি। অতঃপর ছোট ছোট নৌকায় আরোহণ করে এ দ্বীপে আমরা প্রবেশ করেছি। এখানে আমরা একটি সর্বাঙ্গ পশমে আবৃত জন্তুকে দেখতে পেয়েছি। পশমের মাত্রাতিরিক্তের কারণে আমরা তার আগা-পাছা চিনতে পারছি না। আমরা তাকে বলেছি, তোর সর্বনাশ হোক! তুই কে? সে বলেছে, সে নাকি জাসসা-সাহ। আমরা বললাম, জাসসা-সাহ! আবার কি? তখন সে বলেছে, ঐ যে গীর্জা দেখা যায়, তোমরা সেখানে চলো। সেখানে এক লোক গভীর আগ্রহে তোমাদের অপেক্ষায় আছে। তাই আমরা দ্রুত তোর কাছে এসে গেছি। আমরা তার কথায় আতঙ্কিত হয়ে পড়েছি না জানি এ আবার কোন জিন ভূত কিনা? অতঃপর সে বলল, তোমরা আমাকে বাইসানের খেজুর বাগানের সংবাদ বলো। আমরা বললাম, এর কোন বিষয়টি সম্পর্কে তুই সংবাদ জানতে চাচ্ছিস? সে বলল, বাইসানের খেজুর বাগানে ফল আসে কি না, এ সম্পর্কে আমি তোমাদেরকে জিজ্ঞেস করছি। তাকে আমরা বললাম, হ্যাঁ, আছে। সে বলল, সেদিন নিকটেই যেদিন এগুলোতে কোন ফল ধরবে না। তারপর সে বলল, আচ্ছা, তিবরিয়্যা সমুদ্রের ব্যাপারে আমাকে অবগত করো। আমরা বললাম, এর কোন বিষয় সম্পর্কে তুই আমাদের থেকে জানতে চাচ্ছিস? সে বলল, এর মধ্যে পানি আছে কি? তারা বলল, হ্যাঁ, সেখানে বহু পানি আছে। অতঃপর সে বলল, সেদিন বেশি দূরে নয়, যখন এ সাগরে পানি থাকবে না। সে আবার বলল, ‘যুগার’ এর ঝর্ণার ব্যাপারে তোমরা আমাকে অবহিত করো। তারা বলল, তুই এর কি সম্পর্কে আমাদের নিকট জানতে চাচ্ছিস? সে বলল, এর ঝর্ণাতে পানি আছে কি? আর এ জনপদের লোকেরা তাদের ক্ষেত্রে এ ঝর্ণার পানি দেয় কি? আমরা বললাম, হ্যাঁ, এতে অনেক পানি আছে এবং এ জনপদের লোকেরা এ পানির মাধ্যমেই তাদের ক্ষেত আবাদ করে। সে আবার বলল, তোমরা আমাকে উম্মীদের নবীর ব্যাপারে খবর দাও। সে এখন কি করছে? তারা বলল, তিনি মক্কাহ থেকে হিজরত করে মদীনায় চলে এসেছেন। সে জিজ্ঞেস করল, আরবের লোকেরা তার সাথে যুদ্ধ করেছে কি? আমরা বললাম, হ্যাঁ, করেছে। সে বলল, সে তাদের সঙ্গে কিরূপ আচরণ করেছে। আমরা তাকে খবর দিলাম যে, তিনি আরবের পার্শ্ববর্তী এলাকায় জয়ী হয়েছেন এবং তারা তার বশ্যতা স্বীকার করে নিয়েছে। সে বলল, এ কি হয়েই গেছে? আমরা বললাম, হ্যাঁ। সে বলল, বশ্যতা স্বীকার করে নেয়াই জনগণের জন্য কল্যাণকর ছিল। এখন আমি নিজের ব্যাপারে তোমাদেরকে বলছি, আমিই মাসীহ দাজ্জাল। অতি সত্ত্বরই আমি এখান থেকে বাইরে যাবার অনুমতি পেয়ে যাব। বাইরে যেয়ে আমি সমগ্র ভূ-পৃষ্ঠ প্রদক্ষিণ করব। চল্লিশ দিনের ভেতর এমন কোন জনপদ থাকবে না, যেখানে আমি প্রবেশ না করব। তবে মক্কাহ্ ও তাইবাহ এ দুটি স্থানে আমার প্রবেশ নিষিদ্ধ। যখন আমি এ দু’টির কোন স্থানে প্রবেশের ইচ্ছা করব, তখন এক ফেরেশতা উন্মুক্ত তরবারি হাতে সম্মুখে এসে আমাকে বাধা দিবে। এ দুটি স্থানের সকল রাস্তায় ফেরেশতাদের পাহারা থাকবে। বর্ণনাকারী বলেন, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ছড়ি দ্বারা মিম্বারে আঘাত করে বললেন, এ হচ্ছে তাইবাহ, এ হচ্ছে তাইবাহ, এ হচ্ছে তাইবাহ। অর্থাৎ- তাইবাহ অর্থ এ মদীনাই। সাবধান! আমি কি এ কথাটি ইতোপূর্বে তোমাদেরকে বলিনি? তখন লোকেরা বলল, হ্যাঁ, আপনি বলেছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তামীম আদ দারীর কথাটি আমার খুবই ভালো লেগেছে। যেহেতু তা সামঞ্জস্যপূর্ণ আমার ঐ বর্ণনার, যা আমি তোমাদেরকে দাজ্জাল, মদীনাহ ও মক্কাহ বিষয়ে ইতোপূর্বে বলেছি। জেনে রেখ। উল্লেখিত দ্বীপ সিরিয়া সাগরে অথবা ইয়ামান সাগরের পার্শ্বস্থ সাগরের মাঝে অবস্থিত। যা পৃথিবীর পূর্বদিকে অবস্থিত, পৃথিবীর পূর্বদিকে অবস্থিত, পৃথিবীর পূর্বদিকে অবস্থিত। এ সময় তিনি নিজ হাত দ্বারা পূর্ব দিকে ইশারাও করলেন। বর্ণনাকারী ফাতিমাহ বিনতু কায়স (রাযিঃ) বলেন, এ হাদীস আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে সংরক্ষণ করেছি। (ইসলামিক ফাউন্ডেশন ৭১১৯, ইসলামিক সেন্টার ৭১৭২)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		}
	]
}