{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৩২১, আন্তর্জাতিক নাম্বারঃ ২৯৬৪ ৭৩২১-(১০/২৯৬৪) শাইবান ইবনু ফাররূখ (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ কথা বলতে শুনেছেন যে, বনী ইসরাঈলের মাঝে তিন লোক ছিল। একজন ছিল কুষ্ঠরোগী, দ্বিতীয়জন টাক মাথা বিশিষ্ট এবং তৃতীয়জন অন্ধ। আল্লাহ তা’আলা এ তিনজনকে পরীক্ষা করার ইচ্ছা করলেন। তাই তিনি তাদের কাছে একজন ফেরেশতা পাঠালেন। ফেরেশতা প্রথমে কুষ্ঠরোগীর নিকট এসে বললেন, তোমার কাছে সবচেয়ে বেশী প্রিয় জিনিস কি? সে বলল, উত্তম (গায়ের) রং, ভালো চামড়া এবং আমার থেকে যেন এ রোগ নিরাময় হয়ে যায়, যার কারণে লোকেরা আমাকে ঘৃণা করে। অতঃপর ফেরেশতা তার শরীরে হাত বুলালেন। এতে তার এ কুৎসিত ব্যাধি ভালো হলো এবং তাকে সুন্দর রং ও সুন্দর চর্ম দান করা হলো। ফেরেশতা আবার তাকে প্রশ্ন করলেন, তোমার কাছে প্রিয় মাল কোনটি? সে বলল, উট বা গাভী। বর্ণনাকারী ইসহাক সন্দেহ পোষণ করেছেন। তবে কুষ্ঠরোগী বা টাক মাথাওয়ালা তাদের একজন বলল, উট আর অপরজন বলল গাভী। অতঃপর তাকে গর্ভবতী উষ্ট্রী প্রদান করা হলো এবং বললেন, আল্লাহ তোমাকে এতে বারাকাত দান করুন। এরপর ফেরেশতা টাক মাথা লোকের কাছে এসে তাকে প্রশ্ন করলেন, তোমার নিকট সবচেয়ে বেশী প্রিয় জিনিস কি? সে বলল, সুন্দর চুল এবং আমার থেকে যেন এ ব্যাধি নিরাময় হয়ে যায় যার কারণে লোকেরা আমাকে অভক্তি করছে। ফেরেশতা তার শরীরে হাত বুলালে তার ব্যাধি ভালো হয়ে যায়। এরপর তাকে দান করা হয় সুন্দর চুল। পুনরায় ফেরেশতা তাকে প্রশ্ন করলেন যে, কোন মাল তোমার কাছে সবচেয়ে বেশী প্রিয়? সে বলল, গাভী। তারপর তাকে গর্ভবতী একটি গাভী দান করা হলো এবং ফেরেশতা বললেন, আল্লাহ তোমাকে এতে বারাকাত দান করুন। এরপর ফেরেশতা অন্ধ ব্যক্তি আসলেন এবং বললেন, তোমার নিকট কোন্‌ জিনিস সবচেয়ে প্রিয়? সে বলল, আল্লাহ তা’আলা আমাকে দৃষ্টিশক্তি ফিরিয়ে দিক যাতে আমি লোকজন দেখতে পারি। অতঃপর ফেরেশতা তার চোখের উপর হাত বুলালে আল্লাহ তার দৃষ্টিশক্তি ফিরিয়ে দেন। এরপর ফেরেশতা আবার তাকে প্রশ্ন করলেন, কোন সম্পদ তোমার কাছে বেশী প্রিয়? সে বলল, বকরী। তাকে গর্ভবতী বকরী দান করা হলো। অতঃপর উষ্ট্রী, গাভী এবং বকরী সবই বাচ্চা দিল। ফলে তার এক মাঠ উট, তার এক মাঠ গাভী এবং তার এক মাঠ বকরী হয়ে গেল। অতঃপর ফেরেশতা অনতিকাল পরে তার পূর্ববৎ আকৃতিতে কুষ্ঠরোগীর কাছে এসে বলল, আমি একজন মিসকীন ও নিঃস্ব ব্যক্তি, সফরে আমার সকল অবলম্বন নিঃশেষ হয়ে গেছে। আল্লাহর, অতঃপর তোমার সহযোগিতা ছাড়া বাড়ী পৌছাও আমার পক্ষে সম্ভব নয়। সুতরাং যে আল্লাহ তোমাকে উত্তম রং, সুন্দর চামড়া এবং অনেক সম্পদ প্রদান করেছেন তার নামে আমি তোমার কাছে একটি উট সাহায্য চাচ্ছি, যেন এ সফরে আমি তাতে আরোহণ করে বাড়ী পৌছতে পারি। এ কথা শুনে সে বলল, দায়-দায়িত্ব অনেক বেশী, তাই দেয়া সম্ভব নয়। তখন ফেরেশতা বললেন, আমি তোমাকে চিনি বলে মনে হচ্ছে। তুমি কি নিঃস্ব, কুষ্ঠরোগী ছিলে না? এরপর আল্লাহ তোমাকে অনেক সম্পদ প্রদান করেছেন। সে বলল, বাহ আমি তো বাপ-দাদা হতেই বংশপরম্পরায় এ সম্পদের উত্তরাধিকার হয়েছি। অতঃপর ফেরেশতা বললেন, যদি তুমি মিথ্যাবাদী হও, তবে আল্লাহ তা’আলা যেন তোমাকে আগের অবস্থায় ফিরিয়ে দেন। এবার ফেরেশতা তার আগের আকৃতিতে টাক মাথা লোকের কাছে এসে ঐ লোকের ন্যায় তাকেও বললেন এবং সে-ও প্রথম লোকের মতোই জবাব দিল। অতঃপর তিনি বললেন, যদি তুমি মিথ্যাবাদী হও তবে যেন আল্লাহ তা’আলা তোমাকে তোমার আগের অবস্থায় ফিরিয়ে দেন। এরপর ফেরেশতা তার আগের আকৃতিতে অন্ধ লোকের কাছে এসে বলল, আমি একজন নিঃস্ব, মুসাফির ব্যক্তি। আমার সফরের যাবতীয় সম্বল নিঃশেষ হয়ে গেছে। আল্লাহ তা’আলা এবং পরে তোমার সহযোগিতা ছাড়া আজ বাড়ী পৌছা আমার পক্ষে অসম্ভব। যে আল্লাহ তোমাকে দৃষ্টিশক্তি ফিরিয়ে দিয়েছেন তার নামে তোমার কাছে আমি একটি বকরী চাই যেন আমি সফর শেষে বাড়ী পৌছতে পারি। এ কথা শুনে লোকটি বলল, হ্যাঁ, আমি অন্ধ ছিলাম, আল্লাহ আমার দৃষ্টিশক্তি আবার ফিরিয়ে দিয়েছেন। আপনার ইচ্ছামত আপনি নিয়ে যান এবং যা মনে চায় রেখে যান। আল্লাহর শপথ! আজ আল্লাহর নামে আপনি যা নিবেন এ বিষয়ে আমি আপনাকে বাধা দিব না। অতঃপর ফেরেশতা বললেন, তুমি তোমার সম্পদ রেখে দাও। তোমাদের তিনজনের পরীক্ষা হলো। আল্লাহ তোমার প্রতি সন্তুষ্ট এবং তোমার অপর দু’ সাথীদ্বয়ের প্রতি অসম্ভষ্ট হয়েছেন। (ইসলামিক ফাউন্ডেশন ৭১৬২, ইসলামিক সেন্টার ৭২১৫)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		}
	]
}