{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7438,
			"arabicnumber": "2968",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৩২৮, আন্তর্জাতিক নাম্বারঃ ২৯৬৮ ৭৩২৮-(১৬/২৯৬৮) মুহাম্মদ ইবনু আবূ উমর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, সহাবাগণ জিজ্ঞেস করলেন, হে আল্লাহর রসূল! কিয়ামতের দিন আমরা কি আমাদের রবকে দেখতে পাব? জবাবে তিনি বললেন, আকাশে মেঘ না থাকাবস্থায় দুপুরের সময় সূর্য দেখতে তোমাদের কোন কষ্ট হয় কি? সহাবাগণ বললেন, জী না। অতঃপর তিনি বললেন, আকাশে মেঘ না থাকাবস্থায় পূর্ণিমার চাঁদ দেখতে তোমাদের কোন কষ্ট হয় কি? সহাবাগণ বললেন, জী না। তারপর তিনি বললেন, ঐ সত্তার কসম! যার হাতে আমার জীবন! চন্দ্ৰ-সূৰ্য কোন একটি দেখতে তোমাদের যেরূপ কষ্ট হয় না, তোমাদের রবকেও দেখতে তোমাদের ঠিক তদ্রুপ কষ্ট হবে না। আল্লাহর সাথে বান্দার সাক্ষাৎ হবে। তখন তিনি বললেন, হে অমুক! আমি কি তোমাকে সম্মান দান করিনি, কর্তৃত্ব দান করিনি, জোড়া মিলিয়ে দেইনি, ঘোড়া-উট তোমার কাজে লাগিয়ে দেইনি এবং সুখ-স্বাচ্ছদের মাঝে তোমার পানাহারের ব্যবস্থা করিনি? জবাবে বান্দা বলবে, হ্যাঁ, হে আমার রব। তারপর তিনি বলবেন, তুমি কি মনে করতে যে, তুমি আমার মুখোমুখী হবে? সে বলবে, না, তা মনে করতাম না। তিনি বললেন, তুমি যেরূপভাবে আমাকে ভুলে গিয়েছিলে তদ্রুপভাবে আমিও তোমাকে ভুলে যাচ্ছি। অতঃপর দ্বিতীয় অপর এক ব্যক্তির আল্লাহর সাথে সাক্ষাৎ হবে। তখন তিনি তাকেও বলবেন, হে অমুক! আমি কি তোমাকে সম্মান দান করিনি, নেতৃত্ব দেইনি, তোমার পরিবার (জোড়া মিলিয়ে) দেইনি, উট-ঘোড়া তোমার কাজে লাগিয়ে দেইনি এবং সুখ-স্বাচ্ছন্দ্যে পানাহারের জন্য তোমাকে কি সুবিধা করে দেইনি? সে বলবে, হ্যাঁ করেছেন। হে আমার পালনকর্তা! তারপর তিনি বললেন, আমার সাথে তোমার সাক্ষাৎ হবে এ কথা তুমি মনে করতে? সে বলবে, না। তখন আল্লাহ তা’আলা বলবেন, তুমি যেমন আমাকে ভুলে গিয়েছিলে অনুরূপভাবে আমিও তোমাদেরকে ভুলে যাব। তারপর তৃতীয় অপর এক ব্যক্তির আল্লাহর সাথে দেখা হবে। এরপর তিনি আগের মতো অবিকল বলবেন। তখন লোকটি বলবে, হে আমার প্রতিপালক! আমি আপনার প্রতি এবং কিতাব ও রসূলগণের প্রতি ঈমান এনেছি। আমি সালাত আদায় করেছি, সাওম পালন করেছি এবং সদাকাহ করেছি। এমনিভাবে সে যথাসাধ্য নিজের প্রশংসা করবে। এমতাবস্থায় আল্লাহ তা’আলা বলবেন, এখনই তোমার মিথ্যা প্রকাশিত হয়ে যাবে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারপর তাকে বলা হবে, এখনই আমি তোমার উপর আমার সাক্ষী উপস্থিত করব। তখন বান্দা মনে মনে চিন্তা করতে থাকবে যে, কে তার বিপক্ষে সাক্ষী দিবে? তখন তার জবান বন্ধ করে দেয়া হবে এবং তার উরু, গোশত ও হাড়কে বলা হবে, তোমরা কথা বলো। ফলে তার উরু, গোশত ও হাড় তার আমলের ব্যাপারে বলতে থাকবে। এ ব্যবস্থা এজন্য করা হবে যেন, আত্মপক্ষ সমর্থন করার কোন সুযোগ তার অবশিষ্ট না থাকে। এ ব্যক্তি হচ্ছে মুনাফিক যার প্রতি আল্লাহ তা’আলা অসন্তুষ্ট। (ইসলামিক ফাউন্ডেশন ৭১৬৯, ইসলামিক সেন্টার ৭২২২)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 22
			}
		}
	]
}