{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7485,
			"arabicnumber": "2990",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৩৭৫, আন্তর্জাতিক নাম্বারঃ ২৯৯০ ৭৩৭৫-(৫২/২৯৯০) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনু হাতিম ও আবদ ইবনু হুমায়দ (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছি যে, নিজের অপরাধ প্রকাশকারী ছাড়া আমার সমস্ত উম্মাতের গুনাহ মাফ করে দেয়া হবে। নিজের দোষ-ত্রুটি প্রকাশ করার মানে হচ্ছে এই যে, মানুষ রাতে কোন ধরনের অপরাধজনিত কাজ করে, তারপর সকাল হয় আর তার পালনকর্তা সেটা লুক্কায়িত রাখেন। এতদসত্ত্বেও সে বলে, হে অমুক! গত রাত্রে আমি এ কাজ করেছি। অথচ রাতে তার পালনকর্তা সেটাকে গোপন রেখেছেন এবং অবিরত তার পালনকর্তা সেটাকে গোপন রাখছিলেন আর সে রাত অতিবাহিত করছিল। কিন্তু সকালে সে তার পালনকর্তার গোপনীয় বিষয়টিকে উন্মোচন করে দেয়। রাবী যুহায়র (রহঃ)الإِجْهَارِ এর পরিবর্তে الْهِجَارِ শব্দটি উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৭২১৫, ইসলামিক সেন্টার ৭২৬৭) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। মহান আল্লাহ অনুগ্রহ করে মুসলিম ব্যক্তির অনেক পাপ লুকিয়ে রাখেন। তাই প্রকৃত ইসলাম ধর্মের শিক্ষা হলো এই যে, মুসলিম ব্যক্তি যেন তার পাপগুলিকে সর্বদা গোপন রাখে মহান আল্লাহর গোপন রাখার সাথে সাথে। এবং সে যেন মহান আল্লাহর কৃতজ্ঞতার সহিত প্রশংসা করে; এই জন্য যে তিনি তাকে সুস্থতা এবং নিরাপত্তা প্রদান করেছেন। আর সে যেন মহান আল্লাহর কাছে অনুতপ্ত হয়ে ভবিষ্যতে পাপ না করার জন্য প্রতিজ্ঞা করে তওবা করে। কেননা যে ব্যক্তি আন্তরিকতার সহিত তওবা করবে, মহান আল্লাহ তার তওবা গ্রহণ করবেন এবং ইহকালে ও পরকালে তাকে ক্ষমা করবেন। ২। যে কোনো মুসলিম ব্যক্তির উচিত কাজ হলো এই যে, সে যেন নিজের পাপগুলিকে লুকিয়ে রাখে এবং অন্য কোনো লোকের কাছে বা কোনো শাসকের কাছে অথবা কোনো আদালতের বিচারক কিংবা বিচারপতির কাছে তার কোনো পাপের কথা স্বীকার না করে। কিন্তু সে নিজের অন্তরের মধ্যে সমস্ত পাপকে ঘৃণা করে আল্লাহর কাছে অনুতপ্ত হয়ে ভবিষ্যতে পাপ না করার জন্য দৃঢ়ভাবে সত্য প্রতিজ্ঞা করে তওবা করবে এবং তাতে অটল থাকবে। আর পাপের কথা স্বীকার না করে এটাই পন্থা অবলম্বন করবে। কেননা, এটাই পন্থা অবলম্বন করা তার জন্য বেশি ভালো। যেহেতু সত্য পন্থায় অনুতপ্ত হয়ে ভবিষ্যতে পাপ না করার জন্য মহান আল্লাহর কাছে নিষ্ঠাবান হয়ে তওবা করলে তিনি অবশ্যই তওবা কবুল করবেন। ৩। মহান আল্লাহ যে ব্যক্তিকে সুস্থতা এবং নিরাপত্তা প্রদান করেছেন, সেই ব্যক্তি অমঙ্গল থেকে রক্ষা পাবে এবং সুখময় জীবন লাভ করবে। আর প্রকাশ্যভাবে পাপাচারী ব্যক্তি তাকেই বলা যেতে পারে, যে ব্যক্তি নিজের পাপগুলিকে নিজেই প্রকাশ করে এবং লোকের সামনে গর্বের সহিত তার বিবরণ পেশ করে। আর মহান আল্লাহর শ্রেষ্ঠত্ব ও মহিমাকে নিয়ে বিদ্রুপ করে ও উপহাস করে। তাই জেনে রাখা দরকার যে, যে ব্যক্তি প্রকাশ্যভাবে পাপ কাজ করে, সে ব্যক্তি প্রকৃতপক্ষে মহান আল্লাহ ও তদীয় রাসূলকে অবজ্ঞা করে এবং তুচ্ছজ্ঞান করে। কিন্তু সে জানেনা যে, তার নিজের পাপগুলিকে লুকিয়ে রাখলে সে অমঙ্গল থেকে রক্ষা পাবে এবং নিরাপত্তা লাভ করবে।",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 68
			}
		}
	]
}