{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7495,
			"arabicnumber": "2996",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৩৮৫, আন্তর্জাতিক নাম্বারঃ ২৯৯৬ ৭৩৮৫-(৬০/২৯৯৬) মুহাম্মাদ ইবনু রাফি’ ও ‘আব্‌দ ইবনু হুমায়দ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ফেরেশতাদেরকে নূর দ্বারা সৃষ্টি করা হয়েছে আর জিন জাতিকে সৃষ্টি করা হয়েছে নির্ধুম অগ্নিশিখা হতে এবং আদম (আঃ) কে সৃষ্টি করা হয়েছে ঐ বস্তু হতে যে সম্পর্কে তোমাদেরকে বর্ণনা করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৭২২৫, ইসলামিক সেন্টার ৭২৭৭) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা সাব্যস্ত হয় যে, ফেরেশতাদেরকে সৃষ্টি করার মধ্যে এবং জিনদেরকে সৃষ্টি করার মধ্যে পার্থক্য রয়েছে। সুতরাং ফেরেশতাদেরকে সৃষ্টি করা হয়েছে জ্যোতির দ্বারা। আর জ্যোতির অর্থ হলো: কিরণ, কিরণের দ্বারা আলোক ছড়িয়ে পড়ে এবং বিভিন্ন দিক জ্যোতির্ময় হয় আর উজ্জ্বল হয়। আর জিনদেরকে সৃষ্টি করা হয়েছে আগুনের তীব্র শিখা দ্বারা। অর্থাৎ জিনদের প্রথম পিতা ইবলীসকে সৃষ্টি করা হয়েছে আগুনের তীব্র শিখা দ্বারা। কিন্ত এই বিষয়ে অন্য উক্তিও রয়েছে। ২। আমাদের উপর জিন ও শয়তানের অস্তিত্বের প্রতি বিশ্বাস স্থাপন করা অপরিহার্য। তারা হলো মহান আল্লাহর সৃষ্টি জগতের অন্তর্ভুক্ত। তারা মৃত্যুবরণ করে থাকে যেমন সমস্ত মানুষও মৃত্যুবরণ করে। ৩। ঈমানের ছয়টি মূল ভিত্তি রয়েছে, সেই ছয়টি মূল ভিত্তির মধ্যে রয়েছে ফেরেশতাদের প্রতি ঈমান স্থাপন করা। ফেরেশতাগণ মহান আল্লাহর সৃষ্টি জগতের অন্তর্ভুক্ত একটি অতি সম্মানিত সৃষ্টি জগৎ। তাদেরকে সৃষ্টি করা হয়েছে জ্যোতি থেকে। ফেরেশতাগণ সদাসর্বদা দিবানিশি মহান আল্লাহর পবিত্রতা বর্ণনা করেন। আর প্রকৃত ইসলামের শিক্ষা মোতাবেক মানবজাতির প্রথম ব্যক্তি হলেন আদম [আলাইহিস্সালাম]। উনাকে মহান আল্লাহ সৃষ্টি করেছেন কাদামাটি বা প্যাঁক হতে। তবে মহান আল্লাহ উনাকে শুধু মাত্র কাদামাটি বা প্যাঁক হতেই সৃষ্টি করেছেন তা নয়। বরং তিনি তাঁকে সৃষ্টি করেছেন জীবন্ত সত্তা হিসেবে। সুতরাং তাঁর মধ্যে রয়েছে আত্মা, বুদ্ধি, শিরা, স্নায়ু, মাংস, হাড় এবং রক্ত ইত্যাদি।",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 78
			}
		}
	]
}