{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7512,
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৪০২, আন্তর্জাতিক নাম্বারঃ ৩০০৬ ৭৪০২-(৭৪/৩০০৬) হারূন ইবনু মা’রূফ ও মুহাম্মাদ ইবনু আব্বাদ (রহঃ) ..... উবাদাহ ইবনু ওয়ালীদ ইবনু উবাদাহ ইবনু সামিত (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদিন আমি এবং আমার পিতা আনসারী সহাবাগণের ইন্তিকালের পূর্বে আনসারী সহাবাদের এ এলাকায় ইলমে দীন শিক্ষা করার উদ্দেশে বের হলাম। প্রথমে আমাদের যার সাথে দেখা হলো, তিনি হলেন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহাবা আবুল ইয়াসার (রাযিঃ)। এক বোঝা কিতাব নিয়ে তার সাথে ছিলেন এক গোলাম। তখন আবুল ইয়াসার (রাযিঃ) এর শরীরে ছিল একটি চাদর এবং একটি মু’আফিরী কাপড়। অনুরূপভাবে তার গোলামের গায়েও একটি চাদর এবং একটি মু’আফিরী কাপড় বিদ্যমান ছিল। অতঃপর আমার আব্বা তাকে বললেন, হে চাচাজান! আপনার চেহারায় যে ক্রোধের নিদর্শন লক্ষ্য করছি। তিনি বললেন, হ্যাঁ; কারণ, বানী হারাম গোত্রের অমুকের পুত্র অমুকের কাছে আমি মাল পাওনা আছি। তাগাদার উদ্দেশে আমি তার বাড়ীতে গেছি। অতঃপর আমি সালাম দিয়ে বললাম, অমুক কোথায়, সে বাড়ী আছে কি? গৃহের ভিতর হতে তারা বলল, সে গৃহে নেই। এমতাবস্থায় তার এক শিশু ছেলে বাইরে আমার কাছে এলো। আমি তাকে বললাম, তোমার বাবা কোথায়? সে বলল, আপনার আওয়াজ শুনে আমার আম্মার খাটের ভেতর পালিয়ে রয়েছে। আমি তাকে বললাম, আমার কাছে এসো। অবশ্যই আমি জানি তুমি কোথায় রয়েছে। অতঃপর সে বেরিয়ে আসলো। আমি তাকে বললাম, আমার থেকে আত্মগোপন করার বিষয়ে কিসে তোমাকে অনুপ্রাণিত করেছে। সে বলল, আল্লাহর শপথ আমি আপনাকে যা বলব, তা মিথ্যা বলব না। আল্লাহর শপথ, আপনি তো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহাবা, তাই এ বিষয়টিকে আমি ভয়ানক মনে করেছি যে, আমি আপনার সঙ্গে মিথ্যা কথা বলব অথবা প্রতিশ্রুতি করে প্রতিশ্রুতি ভঙ্গ করব। আল্লাহর শপথ! আমি একজন অভাবগ্রস্ত লোক। আমি বললাম, আল্লাহর শপথ করে বলছো? সে বলল, হ্যাঁ, আল্লাহর শপথ করে বলছি। আমি আবারো বললাম, আল্লাহর শপথ করে বলছ? সে বলল, হ্যাঁ, আল্লাহর শপথ করে বলছি। অতঃপর এতদসংশ্লিষ্ট দলীল আনা হলো এবং আবুল ইয়াসার স্বীয় হাতে সেটা মুছে দিলেন। তারপর তিনি বললেন, আমার ঋণ পরিশোধ করার টাকা যদি তোমার হস্তগত হয় তবে তুমি তা পরিশোধ করবে। অন্যথায় তুমি আমার পক্ষ থেকে এ ঋণ হতে মুক্ত। অতঃপর আবুল ইয়াসার (রাযিঃ) দু'টি আঙ্গুল তার চক্ষুদ্বয়ের উপর রেখে বললেন, আমার উভয় চোখের দৃষ্টি প্রত্যক্ষ করেছে, আমার উভয় কান শ্রবণ করেছে এবং হৃদয় ধমণীর প্রতি ইঙ্গিত করে তিনি বললেন, আমার অন্তর তা সংরক্ষণ করেছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি কোন অভাবগ্রস্তকে সুযোগ দেয় বা ক্ষমা করে দেয় আল্লাহ তা’আলা তাকে তার স্বীয় ছায়ার নীচে আশ্রয় দিবেন। (ইসলামিক ফাউন্ডেশন ৭২৪০, ইসলামিক সেন্টার ৭২৯৪)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}