{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7521,
			"arabicnumber": "2009.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৪১১, আন্তর্জাতিক নাম্বারঃ ৩০০৯ ৭৪১১-(৭৫/৩০০৯) সালামাহ্ ইবনু শাবীব (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা আবু বাকর সিদ্দীক (রাযিঃ) আমার পিতার কাছে আসলেন এবং তার থেকে একটি সওয়ারী ক্রয় করলেন। তারপর তিনি আমার পিতা আযিবকে বললেন, তুমি তোমার ছেলেকে আমার সঙ্গে পাঠাও, সে তা আমার সাথে বহন করে আমার বাড়ী পর্যন্ত পৌছিয়ে দিয়ে আসবে। আমার পিতা আমাকে বললেন, তুমি তা উঠিয়ে নাও। আমি সেটা উঠিয়ে নিলাম। অতঃপর মূল্য আদায়ের জন্য আমার পিতাও তার সঙ্গে বের হলেন। পথিমধ্যে আমার পিতা তাকে জিজ্ঞেস করলেন, হে আবু বাকর যে রাতে আপনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফর করেছিলেন তখন আপনারা কি করেছিলেন, তা আমার কাছে আপনি খুলে বলুন। জবাবে তিনি বললেন, তা হলে শোন, আমরা পুরো রাত সফর করেছি। পরিশেষে যখন দিন হলো, ঠিক দুপুরের সময় হলে রাস্তা সম্পূর্ণ শূন্য হয়ে গেল এবং কোন লোকজন আর রাস্তা অতিক্রম করছে না, তখন আমরা একটি বৃহদাকায় পাথর দেখতে পেলাম। এর ছায়া মাটিতে পড়ছিল এবং তখন পর্যন্ত সেখানে রৌদ্র আসেনি। তাই আমরা সেখানে গেলাম এবং আমি নিজে পাথরটির নিকট গিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘুমানোর জন্য একটু স্থান সমান্তরাল করলাম। এরপর আমি একটি কম্বল তাতে বিছিয়ে দিলাম। অতঃপর আমি বললাম, হে আল্লাহর রসূল! আপনি ঘুমিয়ে পড়ুন, আমি এলাকাটা একটু পর্যবেক্ষণ করে আসি। তিনি ঘুমিয়ে পড়লেন। আর আমি তার পার্শ্ববর্তী স্থানসমূহে অনুসন্ধান চালাচ্ছি। হঠাৎ একজন বকরীর রাখালকে দেখতে পেলাম। সেও আমাদের মতো একই উদ্দেশে পাথরটির দিকে এগিয়ে আসছে। আমি তার সঙ্গে দেখা করলাম এবং তাকে প্রশ্ন করলাম, হে! তুমি কার গোলাম? সে বলল, আমি শহরবাসী এক লোকের গোলাম। আমি বললাম, তোমার বকরীতে দুধ আছে কি? সে বলল, হ্যাঁ, আছে। আমি বললাম, তাহলে আমার জন্য দুধ দোহন করবে কি? সে বলল, হ্যাঁ, করব। তারপর সে একটি বকরী নিয়ে এলো। তখন আমি তাকে বললাম, প্রথমে পশম, মাটি এবং খড়কুটা হতে স্তনটি একবার ঝেড়ে নাও। রাবী বলেন, এ সময় আমি বারা ইবনু আযিবকে এক হাত অন্য হাতের উপর মেরে ঝাড়তে দেখেছি। অতঃপর সে কাষ্ঠের একটি পেয়ালাতে আমার জন্য অল্প দুধ দোহন করল। আবু বাকর (রাযিঃ) বলেন, আমার কাছে একটি পাত্র ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পান করা ও ওযু করার জন্য তাতে আমি পানি রাখতাম। তারপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলাম। কিন্তু তাকে ঘুম থেকে জাগাতে আমার ইচ্ছা হল না। তবে তার প্রতি আমি চেয়ে দেখি যে, তিনি নিজে নিজেই জেগে গেছেন। তারপর দুধের মাঝে আমি পানি মিশালাম। ফলে তা ঠাণ্ডা হয়ে গেল। অতঃপর আমি বললাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! এ থেকে একটু দুধ পান করে নিন। তিনি দুধ পান করলেন, তাতে অত্যন্ত খুশী হলাম। অতঃপর তিনি বললেন, এখনো কি যাত্রার সময় হয়নি? আমি বললাম, হ্যাঁ, হয়েছে। সূর্য পশ্চিম দিকে হেলে পড়লে আমরা পুনরায় যাত্রা শুরু করলাম। এদিকে সুরাকাহ ইবনু মালিক আমাদের পিছু ধাওয়া করল। আমরা তখন এক শক্ত ভূমিতে অবস্থান করছিলাম। আমি বললাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমাদেরকে তো ধরে ফেলা হলো। তিনি বললেন, চিন্তান্বিত হয়ে না, আল্লাহ আমাদের সঙ্গে আছেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার উপর বদদুআ করলেন। এতে তার ঘোড়া পেট পর্যন্ত জমিনে ধ্বসে গেল। আমি তা দেখতে পাচ্ছিলাম। তারপর সে বলল, আমি জানি, তোমরা আমার জন্য বদ-দু’আ করেছ। আমি আল্লাহর শপথ করে বলছি, আমি তো তোমাদের সন্ধানে বের হয়েছিলাম, এখন আমি তোমাদের সন্ধানকারীকে ফিরিয়ে দিবো। সুতরাং তোমরা আমার জন্য দুআ করো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর কাছে দু’আ করলেন। এতে সে মুক্ত হয়ে গেল। অতঃপর সে ফিরে গেল এবং যে কোন কাফিরের সাথে সাক্ষাৎ হলে সে বলত, এদিকে আমি সব দেখে এসেছি। এদিকে কোন কিছুই নেই। মোটকথা, যার সাথেই তার দেখা হত সে তাকে ফিরিয়ে দিত। আবু বকর সিদ্দীক (রাযিঃ) বলেন, সুরাকাহ্ তার ওয়াদা পুরো করেছে। (ইসলামিক ফাউন্ডেশন ৭২৪১, ইসলামিক সেন্টার ৭২৯৫)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 95
			}
		}
	]
}