{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7522,
			"arabicnumber": "2009.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৪১২, আন্তর্জাতিক নাম্বারঃ ৩০০৯ ৭৪১২-(.../...) যুহায়র ইবনু হারব, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... বারা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবু বাকর সিদ্দীক (রাযিঃ) আমার পিতার কাছ থেকে তের দিরহামের বিনিময়ে একটি হাওদা কিনেছিলে। তারপর তিনি যুহায়র এর সানাদে ইসহাক (রহঃ) হতে বর্ণিত হাদীসের অবিকল বর্ণনা করেছেন। তবে ইসরাঈল উসমান ইবনু উমর (রহঃ) এর সানাদে বর্ণিত হাদীসের মধ্যে বর্ণনা করেছেন যে, সে কাছাকাছি হলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য বদ্‌-দুআ করলেন। এতে পেট পর্যন্ত তার ঘোড়ার পা জমিনে গেড়ে যায়। সুরাকাহ সেখান হতেই লাফিয়ে পড়ল এবং (রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে উদ্দেশ্য করে) বলল, হে মুহাম্মাদ! আমি জানি, এটা তোমারই কাজ। আমি যে বিপদে আছি এ থেকে যেন আল্লাহ আমাকে মুক্তি দেন, এ বিষয়ে তুমি আমার জন্য আল্লাহর কাছে দুআ করো। আমি তোমাকে প্রতিশ্রুতি দিচ্ছি যে, আমার পেছনে যারাই তোমার সন্ধানে থাকবে আমি তাদের থেকে তোমার অবস্থান লুক্কায়িত করব এবং এ হচ্ছে আমার তীরদানী, এ থেকে তুমি একটি তীর নিয়ে যাও। কিছু দূর যেতেই অমুক স্থানে তুমি আমার উট ও গোলামদেরকে দেখতে পাবে, সেখান থেকে তুমি তোমার প্রয়োজন অনুযায়ী নিয়ে যাবে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার উটের আমার কোন দরকার নেই। আবূ বাকর (রাযিঃ) বলেন, রাতে আমরা মদীনায় পৌঁছলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কার গৃহে অবস্থান করবেন, এ নিয়ে লোকেদের মধ্যে বাক-বিতণ্ডা শুরু হলো। তখন তিনি বললেন, আমি আবদুল মুত্তালিবের মামার বংশ বানু নাজ্জারে অবস্থান করব এবং তাদের প্রতি সম্মান প্রদর্শন করব। অতঃপর পুরুষ লোকেরা ও মহিলাগণ নিজ নিজ গৃহের ছাদে এবং বালক ও ক্রীতদাসগণ পথে পথে বিক্ষিপ্ত হয়ে ছড়িয়ে পড়ল। সকলে অভ্যর্থনা জানিয়ে উচ্চঃস্বরে বলতে লাগল যে, হে মুহাম্মাদ! হে আল্লাহর রসূল! হে মুহাম্মাদ! হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! (ইসলামিক ফাউন্ডেশন ৭২৪১, ইসলামিক সেন্টার ৭২৯৬)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 96
			}
		}
	]
}