{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"56": "The Book of Commentary on the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7528,
			"arabicnumber": "3018.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৪১৮, আন্তর্জাতিক নাম্বারঃ ৩০১৮ ৭৪১৮-(৬/৩০১৮) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ ও হারমালাহ ইবনু ইয়াহইয়া আত তুজীবী (রহঃ) ..... উরওয়াহ ইবনু যুবায়র (রাযিঃ) থেকে বর্ণিত। তিনি আয়িশাহ (রাযিঃ) কে মহান আল্লাহর বাণী সম্পর্কে প্রশ্ন করলেনঃ “তোমরা যদি ভয় করো যে, ইয়াতীমদের মেয়েদের প্রতি সুবিচার করতে পারবে না, তবে বিয়ে করবে স্ত্রীলোকেদের মধ্যে যাকে তোমাদের পছন্দ হয়। (সূরা আন নিসার) দু’, তিন অথবা চার\" এর ব্যাখ্যা জিজ্ঞেস করলে তিনি বললেন, হে ভাগ্নে! যেসব ইয়াতীম মেয়েরা তাদের তত্ত্বাবধানকারী অভিভাবকদের সম্পদের অংশীদার হত তার সম্পদের লালসা ও রূপ-যৌবনের সৌন্দর্যের প্রতি উক্ত অভিভাবক তাকে অন্যরা যে পরিমাণ মুহরানা দিয়ে বিয়ে করতে প্রস্তুত ইনসাফের নীতি অনুযায়ী উক্ত পরিমাণ মুহরানা দিয়ে বিয়ে করতে চাইতো না। এ আয়াতে তাদেরকে ঐসব ইয়াতীমদের বিয়ে করতে বারণ করা হয়েছে। তবে তাদের মুহরানা প্রদানের ব্যাপারে সর্বোত্তম রীতি-নীতি অনুসরণ করলে তা স্বতন্ত্র কথা। অন্যথায় তাদের পছন্দমত অন্য মেয়েদের বিয়ে করতে নির্দেশ দেয়া হয়েছে। উরওয়াহ বলেন, আয়িশাহ (রাযিঃ) বলেছেন, এ আয়াত অবতীর্ণ হওয়ার পর কতিপয় লোক বিষয়টি সম্পর্কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিজ্ঞেস করলে আল্লাহ তা’আলা ইরশাদ করেনঃ \"এবং লোকেরা আপনার কাছে নারীদের বিষয়ে ব্যবস্থা জানতে চায়। বলুন, আল্লাহ তোমাদেরকে তাদের বিষয়ে ব্যবস্থা জানাচ্ছেন এবং ইয়াতীম নারী সম্পর্কে যাদের প্রাপ্য তোমরা প্রদান করো না অথচ তোমরা তাদেরকে বিবাহ করতে চাও ও নিপীড়িত শিশুদের বিষয়ে এবং ইয়াতীমদের প্রতি তোমাদের ন্যায়বিচার সম্পর্কে যা কিতাবে তোমাদেরকে শুনানো হয়, তাও পরিষ্কারভাবে জানিয়ে দেন। আর যে সৎকাজ তোমরা করো আল্লাহ তা সবিশেষ অবহিত\"- (সূরা আন নিসা ৪ঃ ১২৭)। আয়িশাহ (রাযিঃ) বলেন, আল্লাহর বাণী- এর দ্বারা প্রথম আয়াতটিকে বুঝানো হয়েছে, যার মধ্যে আল্লাহ তা’আলা বলেছেন, তোমরা যদি আশঙ্কা করো যে ইয়াতীম মেয়েদের প্রতি সুবিচার করতে পারবে না তবে বিবাহ করবে নারীদের মধ্যে যাকে তোমাদের ভাল লাগে দু’, তিন অথবা চার। আয়িশাহ (রাযিঃ) বলেন, আল্লাহর বাণী এর মানে হচ্ছে, অর্থ-সম্পদ ও রূপযৌবন কম থাকার কারণে তোমাদের কেউ ইয়াতীম মেয়েদেরকে বিবাহ করতে অপছন্দ করলে-তাদেরকে অর্থ সম্পদ ও রূপ যৌবনবতী ইয়াতীম স্ত্রীলোককে পছন্দ হলেও বিয়ে করতে বারণ করা হয়েছে। তবে অর্থ-সম্পদ ও রূপ-যৌবন না থাকার কারণে পছন্দনীয় না হলেও যদি ইনসাফের ভিত্তিতে মুহরানা পরিশোধ করে তবে বিয়ে করার অনুমতি দেয়া হয়েছে। (ইসলামিক ফাউন্ডেশন ৭২৪৭, ইসলামিক সেন্টার ৭৩০২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		}
	]
}