{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 904,
			"arabicnumber": "404.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭৯০, আন্তর্জাতিক নাম্বারঃ ৪০৪ ৭৯০-(৬২/৪০৪) সাঈদ ইবনু মানসূর, কুতাইবাহ ইবনু সাঈদ, আবূ কামিল আল জাহদারী ও মুহাম্মাদ ইবনু আবদুল মালিক আল উমাবী (রহঃ) ... হিত্‌তান ইবনু আবদুল্লাহ আর রাকাশী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ মূসা আশ'আরী (রাযিঃ) এর সাথে সালাত আদায় করলাম। তিনি যখন তাশাহ্‌হুদে বসলেন, জামা'আতের মধ্য হতে এক ব্যক্তি বলে উঠল, সালাত পুণ্য ও যাকাতের সাথে ফরয করা হয়েছে। রাবী বলেন, আবূ মূসা (রাযিঃ) সালাত শেষ করে সালাম ফিরানোর পর বললেন, তোমাদের মধ্যে কে এরূপ বলেছে? লোকেরা নীরব থাকল। তিনি পুনরায় জিজ্ঞেস করলেন, তোমাদের মধ্যে কে এরূপ এরূপ বলেছে? এবারও লোকেরা নীরব থাকল। অতঃপর তিনি বললেন, হে হিততান সম্ভবত তুমিই এটা বলেছ। তিনি (হিত্তান) বললেন, আমি তা বলিনি। অবশ্য আমার ভয় হচ্ছিল যে আপনি আমার উপর এজন্য রেগে যান কি-না! এমন সময় লোকেদের মধ্যে হতে এক ব্যক্তি বলল, আমি এরূপ বলেছি। আমি এর মাধ্যমে কল্যাণই আশা করেছিলাম। আবূ মূসা (রাযিঃ) বললেন, নিজেদের সালাতের মধ্যে কী বলতে হবে তা কি তোমরা জান না? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে ভাষণ দিলেন, তিনি আমাদেরকে নিয়মকানুন স্পষ্ট করে বলে দিয়েছেন এবং আমাদেরকে সালাত আদায় করার শিক্ষা দিয়েছেন। তা হচ্ছেঃ তোমরা যখন সালাত আদায় করবে, তোমাদের লাইনগুলো ঠিক করে নিবে। অতঃপর তোমাদের কেউ তোমাদের ইমামতি করবে। সে যখন তাকবীর বলবে, তোমরাও তাকবীর বলবে। সে যখন “গাইরিল মাগযুবি 'আলাইহিম ওয়ালায যোল্লীন\" বলবে তোমরা তখন আমীন বলবে। আল্লাহ তোমাদের ডাকে সাড়া দিবেন। সে যখন তাকবীর বলে রুকু’তে যাবে, তোমরাও তাকবীর বলে রুকু’তে যাবে। কেননা, ইমাম তোমাদের আগে রুকু’তে যাবে এবং তোমাদের আগে রুকু থেকে উঠবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ এটা ওটার বিনিময়ে, তথা ইমাম যেমন রুকু সাজদার আগে যাবে, তেমনি আগে উঠবে। সে যখন \"সামি'আল্লাহু লিমান হামিদাহ\" বলবে, তোমরা তখন \"আল্লাহুম্মা রব্বানা- লাকাল হামদ\" বলবে, আল্লাহ তোমাদের এ কথা শুনবেন। কেননা আল্লাহ তা'আলা তার নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর ভাষায় বলছেনঃ \"সামি'আল্লাহু লিমান হামিদাহ\" (আল্লাহ তার প্রশংসাকারীর প্রশংসা শুনেন)। সে যখন তাকবীর বলবে এবং সাজদায় যাবে, তোমরাও তার পরপর তাকবীর বলে সাজদায় যাবে। কেননা, ইমাম তোমাদের আগে সাজদায় যাবে এবং তোমাদের আগে সিজদা থেকে উঠবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ তোমাদের তাকবীর ও সিজদা ইমামের পরে হবে। যখন তোমরা বৈঠকে বসবে, তোমাদের পাঠ হবেঃ আত্তাহিয়াতুত তাইয়্যিবা-তুস্ সালাওয়া-তু লিল্লা-হি আসসালা-মু 'আলাইকা আইয়ুহান নবীয়্যু ওয়া রহমাতুল্লা-হি ওয়া বারাকা-তুহ আসসালামু 'আলাইনা- ওয়া'আলা- ইবা-দিল্লা-হিস্ সলিহীন, আশহাদু আল লা-ইলা-হা ইল্লাল্ল-হু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রসূলুহ।\" অর্থাৎ- সকল প্রকার পবিত্র ও একান্ত মৌখিক, শারীরিক ও আর্থিক ইবাদাতসমূহ আল্লাহরই জন্য। হে নবী! আপনার উপর আল্লাহর পক্ষ হতে শান্তি, রহমত ও বারাকাত নাযিল হোক এবং আমাদের উপর ও আল্লাহর নেককার বান্দাদের উপরও শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া আর কেউ ইবাদাতের যোগ্য নয় এবং আমি এও সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ আল্লাহর দাস ও তাঁর দূত।\" (ইসলামিক ফাউন্ডেশনঃ ৭৮৭, ইসলামিক সেন্টারঃ ৭৯৯)",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 66
			}
		}
	]
}