{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2123,
			"arabicnumber": "916.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০০৮, আন্তর্জাতিক নাম্বারঃ ৯১৬ ২০০৮-(১/৯১৬) আবূ কামিল জাহদারী ফুযায়ল ইবনু হুসায়ন ও উসমান ইবনু আবূ শায়বাহ্ (রহঃ) .... ইয়াহইয়া ইবনু উমারাহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবূ সাঈদ আল খুদরী (রাযিঃ) কে বলতে শুনেছি, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা মুমূর্ষ ব্যক্তিকে “লা-ইলা-হা ইল্লাল্ল-হ\" (আল্লাহ ছাড়া কোন মা'বূদ নেই) তালকীন দাও (পড়াও)। (ইসলামী ফাউন্ডেশন ১৯৯২, ইসলামীক সেন্টার ১৯৯৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": "916.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০০৯, আন্তর্জাতিক নাম্বারঃ ৯১৬ ২০০৯-(.../...) কুতায়বাহ ইবনু সাঈদ, আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... সুলায়মান ইবনু বিলাল (রহঃ) সকলে ঐ সানাদে বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ১৯৯৩, ইসলামীক সেন্টার ২০০০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": "917",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১০, আন্তর্জাতিক নাম্বারঃ ৯১৭ ২০১০-(২/৯১৭) আবূ শায়বাহ-এর পুত্রদ্বয় উসমান ও আবূ বাকর, আমর আন নাকিদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, তোমরা মুমূর্য ব্যক্তিকে “লা-ইলা-হা ইল্লাল্ল-হ” (আল্লাহ ছাড়া কোন মা'বূদ নেই) তালকীন করো। (ইসলামী ফাউন্ডেশন ১৯৯৪, ইসলামীক সেন্টার ২০০১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": "918.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১১, আন্তর্জাতিক নাম্বারঃ ৯১৮ ২০১১-(৩/৯১৮) ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ও ইবনু হুজর (রহঃ) ..... উম্মু সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ কোন মুসলিমের ওপর মুসীবাত আসলে যদি সে বলেঃ আল্লাহ যা হুকুম করেছেন- \"ইন্না- লিল্লা-হি ওয়া ইন্না- ইলায়হি র-জিউন” (অর্থাৎ- আমরা আল্লাহরই জন্যে এবং তারই কাছে ফিরে যাব) বলে এবং এ দু'আ পাঠ করে- “আল্ল-হুম্মা' জুৱনী ফী মুসীবাতী ওয়া আখলিফ লী খয়রাম মিনহা- ইল্লা- আখলাফাল্ল-হু লাহ খয়রাম মিনহা-” (অর্থাৎ- হে আল্লাহ! আমাকে আমার মুসীবাতে সাওয়াব দান কর এবং এর বিনিময়ে এর চেয়ে উত্তম বস্তু দান কর, তবে মহান আল্লাহ তাকে এর চেয়ে উত্তম বস্তু দান করে থাকেন।)। উম্মু সালামাহ্ (রাযিঃ) বলেন, এরপর যখন আবূ সালামাহ ইনতিকাল করেন, আমি মনে মনে ভাবলাম, কোন মুসলিম আবূ সালামাহ থেকে উত্তম? তিনি সর্বপ্রথম ব্যক্তি, যিনি হিজরাত করে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট পৌছে গেছেন। এতদসত্ত্বেও আমি এ দু'আগুলো পাঠ করলাম। এরপর মহান আল্লাহ আবূ সালামার স্থলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মতো স্বামী দান করেছেন। উম্মু সালামাহ (রাযিঃ) বলেন, আমার নিকট রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিয়ের পয়গাম পৌছাবার উদ্দেশে হাতিব ইবনু আবূ বালতা'আহ-কে পাঠালেন। আমি বললাম, আমার একটা কন্যা আছে আর আমার জিদ বেশী। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তার কন্যা সম্পর্কে আমি আল্লাহর কাছে দুআ করব যাতে তিনি তাকে তার কন্যার দুশ্চিন্তা থেকে মুক্তি দেন। আর (তার সম্পর্কে) দু'আ করব যেন আল্লাহ তার জিদ দূর করে দেন। (ইসলামী ফাউন্ডেশন ১৯৯৫, ইসলামীক সেন্টার ২০০২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": "918.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১২, আন্তর্জাতিক নাম্বারঃ ৯১৮ ২০১২-(৪/...) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী উম্মু সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ কোন বান্দার ওপর মুসীবাত আসলে যদি সে বলে \"ইন্না- লিল্লা-হি ওয়া ইন্না- ইলায়হি র-জাউন, আল্ল-হুম্মা' জুরনী ফী মুসীবাতী ওয়া আখলিফ লী খয়রাম মিনহা ইল্লা- আজারাহুল্ল-হু ফী মুসীবাতিহী ওয়া আখলাফা লাহ্‌ খয়রাম মিনহা-” (অর্থাৎ- আমরা আল্লাহর জন্যে এবং আমরা তারই কাছে ফিরে যাব। হে আল্লাহ! আমাকে এ মুসীবাতের বিনিময় দান কর এবং এর চেয়ে উত্তম বস্তু দান কর। তবে আল্লাহ তাকে তার মুসীবাতের বিনিময় দান করবেন এবং তাকে এর চেয়ে উত্তম বস্তু দান করবেন।)। উম্মু সালানাহ (রাযিঃ) বলেন, এরপর যখন আবূ সালামাহ ইনতিকাল করলেন, আমি ঐরূপ দুআ করলাম যেরূপ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আদেশ করেছেন। অতঃপর মহান আল্লাহ আমাকে তার চেয়েও উত্তম নি'আমাত অর্থাৎ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে স্বামীরূপে দান করলেন। (ইসলামী ফাউন্ডেশন ১৯৯৬, ইসলামীক সেন্টার ২০০৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": "918.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৩, আন্তর্জাতিক নাম্বারঃ ৯১৮ ২০১৩-(৫/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী উম্মু সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, ..... পরবর্তী বর্ণনা উসামাহ এর হাদীস সদৃশ। তবে এ কথাটুকু বাড়িয়েছেনঃ উম্মু সালামাহ (রাযিঃ) বলেন, এরপর যখন আবূ সালামাহ (রাযিঃ) ইনতিকাল করলেন, আমি মনে মনে বললামঃ আবূ সালামাহ (রাযিঃ) এর চেয়ে উত্তম মানুষ কে আছেন যিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিশিষ্ট সাহাবী? অতঃপর আল্লাহ তা'আলা আমাকে দৃঢ়তা দান করলেন এবং আমি ঐরূপ দুআ করলাম। উম্মু সালামাহ (রাযিঃ) বলেন, এরপর আমার বিয়ে হ’ল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে। (ইসলামী ফাউন্ডেশন ১৯৯৭, ইসলামীক সেন্টার ২০০৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": "919",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৪, আন্তর্জাতিক নাম্বারঃ ৯১৯ ২০১৪-(৬/৯১৯) আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা পীড়িত ব্যক্তি অথবা মৃত ব্যক্তির নিকট হাজির হও তখন তার সম্পর্কে ভাল মন্তব্য কর। কেননা তোমরা যেরূপ বল তার ওপর মালাকগণ (ফেরেশতামণ্ডলী) আমীন বলেন। উম্মু সালামাহ্ (রাযিঃ) বলেন, এরপর যখন আবূ সালামাহ ইনতিকাল করলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললামঃ হে আল্লাহর রসূল! আবূ সালামাহ্ (রাযিঃ) ইনতিকাল করেছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, \"তুমি বল, হে আল্লাহ আমাকে ও তাকে ক্ষমা কর এবং তার পরে আমাকে উত্তম পরিণাম দান কর\" উম্মু সালামাহ (রাযিঃ) বলেন, অতঃপর আমি তা বললাম। আল্লাহ আমাকে তার (আবূ সালামাহ-এর) চেয়ে উত্তম প্রতিদান হিসেবে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দান করলেন। (ইসলামী ফাউন্ডেশন ১৯৯৮, ইসলামীক সেন্টার ২০০৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": "920.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৫, আন্তর্জাতিক নাম্বারঃ ৯২০ ২০১৫-(৭/৯২০) যুহায়র ইবনু হারব (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবূ সালামাহকে দেখতে এলেন, তখন চোখ খোলা ছিল। তিনি তার চোখ বন্ধ করে দিলেন এবং বললেন, যখন রূহ কবয করা হয়, তখন চোখ তার অনুসরণ করে। আবূ সালামাহ এর পরিবারের লোকেরা কান্না শুরু করে দিল। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তোমরা তোমাদের নিজেদের ব্যাপারে ভাল কথা ছাড়া কোন খারাপ কিছু বলাবলি করো না। কেননা, তোমরা যা কিছু বল তার স্বপক্ষে মালায়িকাহ আমীন' বলে থাক। এরপর তিনি এভাবে দু'আ করলেন, “হে আল্লাহ আবূ সালামাহ কে ক্ষমা কর এবং হিদায়াতপ্রাপ্তদের মধ্যে তার মর্যাদাকে উচু করে দাও, তুমি তার বংশধরদের অভিভাবক হয়ে যাও। হে রাব্বুল আলামীন তাকে ও আমাদেরকে ক্ষমা করে দাও। তার কবরকে প্রশস্ত কর এবং তা জ্যোতির্ময় করে দাও।\" (ইসলামী ফাউন্ডেশন ১৯৯৯, ইসলামীক সেন্টার ২০০৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": "920.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৬, আন্তর্জাতিক নাম্বারঃ ৯২০ ২০১৬-(৮/...) মুহাম্মাদ ইবনু মূসা আল কাত্ত্বান আল ওয়াসিতী (রহঃ) ..... খালিদ আল হাযযা (রহঃ) একই সানাদে অনুরূপ বর্ণনা করেছেন। ব্যতিক্রম এই যে, এ সূত্রে বলেছেন, \"তার পরিবার পরিজনদের অভিভাবক হও।\" এছাড়া বলেছেন, তার কবরকে প্রশস্ত করে দাও কিন্তু \"আফসিহ\" শব্দটি এ বর্ণনায় নেই। খালিদ আল হাযযা এ কথাটুকুও বর্ণনা করেছেন, সপ্তম অন্য আরেকটি দু'আ আছে যা আমি ভুলে গেছি। (ইসলামী ফাউন্ডেশন ২০০০, ইসলামীক সেন্টার ২০০৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": "921.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৭, আন্তর্জাতিক নাম্বারঃ ৯২১ ২০১৭-(৯/৯২১) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা কি দেখ না, মানুষ যখন মারা যায় তার চোখ খোলা থেকে যায়? লোকেরা বলল, হ্যাঁ দেখেছি। তিনি বলেনঃ যখন তার চোখ তার রূহকে অনুসরণ করে তখন এ অবস্থা হয়। (ইসলামী ফাউন্ডেশন ২০০১, ইসলামীক সেন্টার ২০০৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": "921.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৮, আন্তর্জাতিক নাম্বারঃ ৯২১ ২০১৮-(.../...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... 'আলা (রহঃ) থেকে একই সূত্রে বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০০২, ইসলামীক সেন্টার ২০০৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": "922",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০১৯, আন্তর্জাতিক নাম্বারঃ ৯২২ ২০১৯-(১০/৯২২) আবূ বাকর ইবনু আবূ শায়বাহ, ইবনু নুমায়র ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উম্মু সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন আবূ সালামাহ (রাযিঃ) ইনতিকাল করলেন আমি (আক্ষেপ করলাম) বললাম, আহ! নির্বাসিত ব্যক্তি! আহ! বিদেশ ভূমিতে মারা গেল! আমি তার জন্য এমনভাবে (বুক ফাটিয়ে) কান্নাকাটি করব যা মানুষের মাঝে চর্চা হতে থাকবে। আমি কান্নার জন্যে প্রস্তুতি নিচ্ছিলাম, এমন সময় একজন মহিলা আমাকে সঙ্গ দেয়ার মনোভাব নিয়ে মদীনায় উঁচু এলাকা থেকে আসলেন এমন সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সামনে এগিয়ে এসে বললেনঃ আরে! তুমি কি শাইতানকে ঐ ঘরে ঢুকাতে চাচ্ছ যেখান থেকে মহান আল্লাহ তাকে দু’বার তাড়িয়ে দিয়েছেন? (উম্মু সালামাহ বলেন) এ কথা শুনামাত্র আমি কান্না বন্ধ করলাম এবং আর কাঁদলাম না। (ইসলামী ফাউন্ডেশন ২০০৩, ইসলামীক সেন্টার ২০১০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": "923.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২০, আন্তর্জাতিক নাম্বারঃ ৯২৩ ২০২০-(১১/৯২৩) আবূ কামিল আল জাহদারী (রহঃ) ..... উসামাহ ইবনু যায়দ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে ছিলাম। এমন সময় তার এক কন্যা তার কাছে সংবাদ পাঠালেন যে, তার একটা শিশু অথবা ছেলে মুমূর্ষ অবস্থায় আছে, তিনি যেন এখানে আসেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সংবাদ বাহককে বললেন, তুমি গিয়ে তাকে বল, আল্লাহ যা নিয়ে গেছেন তা তারই আর যা দান করেছেন তাও তারই। আর প্রত্যেক বস্তুর জন্য তার কাছে একটা নির্দিষ্ট মেয়াদ আছে। তাকে বলে দাও যেন সে সবর করে এবং আল্লাহর কাছে প্রতিদানের আশা করে। সংবাদদাতা ফিরে এসে বলল, হে আল্লাহর রসূল! তিনি আল্লাহর কসম দিয়ে বলেছেন, যাতে আপনি একটু আসেন। উসামাহ (রাযিঃ) বলেন, এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে রওয়ানা হলেন। সা'দ ইবনু উবাদাহ (রাযিঃ) ও মুআয ইবনু জাবাল (রাযিঃ) তার সাথে গেলেন আমিও তাদের সাথে গেলাম। সেখানে পৌছলে শিশুটিকে তার কাছে উঠিয়ে আনা হ’ল। বাচ্চাটির রূহ এমনভাবে ধড়ফড় করছে যেন পুরাতন মশকের মধ্যে ঝনঝন শব্দ হচ্ছে। এ করুণ অবস্থা দেখে তার চোখ দিয়ে অশ্রু গড়িয়ে পড়ল। সা'দ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন, একি হে আল্লাহর রসূল? তিনি উত্তরে বললেন, এ হচ্ছে দয়া, যা আল্লাহ তা'আলা তার বান্দাদের অন্তঃকরণে সৃষ্টি করে রেখেছেন। আর নিশ্চয়ই আল্লাহ তার বান্দাদের মধ্যে দয়ালু ও স্নেহপরায়ণদের প্রতি দয়া করেন। (ইসলামী ফাউন্ডেশন ২০০৪, ইসলামীক সেন্টার ২০১১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": "923.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২১, আন্তর্জাতিক নাম্বারঃ ৯২৩ ২০২১-(.../...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... সকলেই 'আসিম আল আহওয়াল (রহঃ) থেকে একই সানাদে অনুরূপ বর্ণনা করেছেন। তবে হাম্মাদের বর্ণিত হাদীসটি অপেক্ষাকৃত পূর্ণাঙ্গ ও লম্বা। (ইসলামী ফাউন্ডেশন ২০০৫, ইসলামীক সেন্টার ২০১২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": "924",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২২, আন্তর্জাতিক নাম্বারঃ ৯২৪ ২০২২-(১২/৯২৪) ইউনুস ইবনু আবদুল আ'লা আস্ সদাফী ও আমর ইবনু সুওওয়াদ আল আমিরী (রহঃ) ..... 'আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, সা'দ ইবনু উবাদাহ (রাযিঃ) কঠিন পীড়ায় আক্রান্ত হলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রহমান ইবনু আওফ, সা'দ ইবনু আবূ ওয়াক্কাস ও আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) কে সঙ্গে নিয়ে তাকে দেখতে গেলেন। তিনি সেখানে পৌছে তাকে সংজ্ঞাহীন অবস্থায় পেলেন। তিনি জিজ্ঞেস করলেন, অবস্থা কি শেষ? লোকেরা বলল, না হে আল্লাহর রসূল! অবস্থা দেখে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাঁদতে লাগলেন। উপস্থিত লোকেরা তার কান্না দেখে কাঁদতে শুরু করল। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা কি শোননি যে, আল্লাহ তা'আলা চোখের অশ্রুর কারণে ও হৃদয়ের অস্থিরতার জন্যে বান্দাকে শাস্তি দিবেন না? বরং তিনি এ কারণে আযাব করবেন বা করুণা প্রদর্শন করবেন, তিনি জিহবার দিকে ইঙ্গিত করলেন। (ইসলামী ফাউন্ডেশন ২০০৬, ইসলামীক সেন্টার ২০১৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": "925",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৩, আন্তর্জাতিক নাম্বারঃ ৯২৫ ২০২৩-(১৩/৯২৫) মুহাম্মাদ ইবনুল মুসান্না আল আনায়ী (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসা ছিলাম। এমন সময় আনসারদের জনৈক ব্যক্তি তার নিকট এসে তাকে সালাম করল। অতঃপর সে ফিরে যাচ্ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আনসারদের ভাই! আমার ভাই সা'দ ইবনু উবাদাহ কেমন আছে? সে বলল, ভাল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তোমাদের মধ্যে কে কে তাকে দেখতে যাবে? এই বলে তিনি উঠলেন। আমরাও তার সাথে উঠে রওয়ানা হলাম। আমাদের সংখ্যা দশের অধিক ছিল। আমাদের পায়ে জুতা-মোজাও ছিল না। গায়ে জামাও ছিল না। মাথায় টুপিও ছিল না। আমরা পায়ে হেঁটে কঙ্করময় পথ অতিক্রম করে সেখানে গিয়ে পৌছলাম। তার পাশে উপস্থিত লোকেরা সরে গেল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার সাথী সাহাবীগণ সা'দ-এর কাছে গেলেন। (ইসলামী ফাউন্ডেশন ২০০৭, ইসলামীক সেন্টার ২০১৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": "926.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৪, আন্তর্জাতিক নাম্বারঃ ৯২৬ ২০২৪-(১৪/৯২৬) মুহাম্মাদ ইবনু বাশশার আল আবদী (রহঃ) ..... সাবিত (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আনাস ইবনু মালিক (রাযিঃ) কে বলতে শুনেছি, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রথম আঘাতেই ধৈর্য ধারণ করা হচ্ছে প্রকৃত ধৈর্য। (ইসলামী ফাউন্ডেশন ২০০৮, ইসলামীক সেন্টার ২০১৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": "926.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৫, আন্তর্জাতিক নাম্বারঃ ৯২৬ ২০২৫-(১৫/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মহিলার পাশ দিয়ে যাচ্ছিলেন। সে তার পুত্রের মৃত্যু শোকে কাঁদছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, আল্লাহকে ভয় কর এবং ধৈর্য ধারণ কর। স্ত্রীলোকটি বলল, আপনি তো আমার মতো মুসীবাতে পড়েননি। যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চলে গেলেন, কেউ তাকে বলল, ইনিই তো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। এ কথা শুনে মহিলার অবস্থা মৃতবৎ হয়ে গেল। সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরজায় এসে দেখল তার দরজায় কোন দ্বাররক্ষী নেই। সে বলল, হে আল্লাহর রসূল! আমি আপনাকে চিনতে পারিনি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, প্রকৃত সবর হচ্ছে প্রথম আঘাতের সময় ধৈর্য ধারণ করা অথবা বলেছেন, বিপদের প্রথম লগ্নে। (ইসলামী ফাউন্ডেশন ২০০৯, ইসলামীক সেন্টার ২০১৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": "926.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৬, আন্তর্জাতিক নাম্বারঃ ৯২৬ ২০২৬-(.../...) ইয়াহইয়া ইবনু হাবীব আল হারিসী, উকবাহ ইবনু মুকরিম আল আম্মী, আহমাদ ইবনু ইবরাহীম আদ দাওরাকী (রহঃ) ... সকলে শুবাহ (রহঃ) থেকে এ সূত্রে উসমান ইবনু উমর (রহঃ)-এর হাদীসের অনুরূপ বর্ণিত হয়েছে। আবদুস সামাদ এর হাদীসে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরের নিকট ক্ৰন্দনরত এক মহিলার কাছ দিয়ে যাচ্ছিলেন। (ইসলামী ফাউন্ডেশন ২০১০, ইসলামীক সেন্টার ২০১৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": "927.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৭, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০২৭-(১৬/৯২৭) আবূ বাকর ইবনু আবূ শায়বাহ্‌ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। হাফসাহ (রাযিঃ) উমারের জন্য (ঘাতক কর্তৃক আহত হলে) কাঁদছিলেন। তখন উমর (রাযিঃ) বললেন, হে স্নেহের কন্যা! তুমি কি জান না রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মৃত ব্যক্তিকে তার স্বজনদের কান্নাকাটির দরুন শাস্তি দেয়া হয়। (ইসলামী ফাউন্ডেশন ২০১১, ইসলামীক সেন্টার ২০১৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": "927.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৮, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০২৮-(১৭/...) মুহাম্মাদ ইবনু বাশশার (বহঃ) ..... উমর (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিকে তার প্রতি অধিক কান্নাকাটি করার দরুন কবরে 'আযাব দেয়া হয়। (ইসলামী ফাউন্ডেশন ২০১২, ইসলামীক সেন্টার, ২০১৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": "927.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০২৯, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০২৯-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... উমর (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিকে তার প্রতি অধিক কান্নাকাটি করার দরুন কবরে আযাব দেয়া হয়। (ইসলামী ফাউন্ডেশন, নেই, ইসলামীক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": "927.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৩০, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০৩০-(১৮/...) ‘আলী ইবনু হুজুর আস সা’দী (রহঃ) ... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন উমর (রাযিঃ) (আততায়ীর আঘাতে) আহত হন এবং সংজ্ঞা হারিয়ে ফেলেন। লোকেরা চিৎকার করে কান্নাকাটি শুরু করল। যখন তার জ্ঞান ফিরে এল, তিনি বললেন, তোমরা কি জান না রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন মৃত ব্যক্তিকে জীবিতদের কান্নার দরুন শাস্তি দেয়া হয়? (ইসলামী ফাউন্ডেশন ২০১৩ ইসলামীক সেন্টার, ২০২০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": "927.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৩১, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০৩১-(১৯/...) আলী ইবনু হুজর (রহঃ) ..... আবদুল্লাহ ইবনু কায়স (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন উমর (রাযিঃ) গুরুতরভাবে আহত হন, সুহায়ব (রাযিঃ) আক্ষেপ করে বলতে লাগলেন, আহ! ভাই উমার! উমর (রাযিঃ) তাকে বললেন, হে সুহায়ব! তোমার কি মনে নেই, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিকে জীবিততদের কান্নাকাটির দরুন শাস্তি দেয় হয়? (ইসলামী ফাউন্ডেশন ২০১৪, ইসলামীক সেন্টার ২০২১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": "927.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৩২, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০৩২-(২০/...) ‘আলী ইবনু হুজুর (রহঃ) ...... আবূ মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন উমার (রাযিঃ) গুরুতরভাবে আহত হন, সুহায়ব (রাযিঃ) তার গৃহ থেকে রওয়ানা হয়ে উমারের কাছে এলেন এবং তার সামনে দাড়িয়ে কাঁদতে লাগলেন। উমর (রাযিঃ) তাকে জিজ্ঞেস করলেন, তুমি কেন কাঁদছ, আমার জন্য কাঁদছ? তিনি বললেন, কসম আল্লাহর। হে আমীরুল মু'মিনীন। হ্যাঁ, আপনার জন্যই কাঁদছি। 'উমার (রাযিঃ) বললেন, আল্লাহর কসম! তুমি তো অবশ্যই জান রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার জন্য কান্নাকাটি করা হবে তাকে শাস্তি দেয়া হবে। (ইসলামী ফাউন্ডেশন ২০১৫, ইসলামীক সেন্টার ২০২২) তিনি [আবূ মূসা (রাযিঃ)] বলেন, এরপর আমি এ কথাটি মূসা ইবনু তলহার কাছে বললাম। তিনি বললেন, আয়িশাহ্ (রাযিঃ) বলতেন, যাদের আযাবের কথা বলা হয়েছে, তারা ছিল ইয়াহুদী সম্প্রদায়।",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": "927.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৩৩, আন্তর্জাতিক নাম্বারঃ ৯২৭ ২০৩৩-(২১/...) 'আমর আন নাকিদ (রহঃ) ... আনাস (রাযিঃ) থেকে বর্ণিত। উমার ইবনুল খাত্ত্বাব (রাযিঃ) যখন আহত হলেন, হাফসাহ (রাযিঃ) সশব্দে কাঁদতে লাগলেন। তখন উমর (রাযিঃ) বললেন, ওগো হাফসাহু তুমি কি শোননি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যার জন্য উচ্চস্বরে ক্ৰন্দন করা হয় তাকে শাস্তি দেয়া হবে? তার প্রতি সুহায়ব (রাযিঃ)-ও কাঁদতে থাকলে উমর (রাযিঃ) তাকেও বললেন, হে সুহায়ব! তুমি কি জান না যার জন্য চিৎকার করে বান্নাকাটি করা হয় তাকে আযাব দেয়া হবে? (ইসলামী ফাউন্ডেশন ২০১৬, ইসলামীক সেন্টার ২০২৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": "929.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪০, আন্তর্জাতিক নাম্বারঃ ৯২৯ ২০৪০-(.../...) আবদুর রহমান ইবনু বিশর (রহঃ) ..... ইবনু আবূ মুলায়কাহ (রহঃ) থেকে বর্ণিত। আমরা উম্মু আবান বিনতু উসমান (রাযিঃ) এর যামানায় উপস্থিত হলাম। অবশিষ্ট বর্ণনা উপরের হাদীসের অনুরূপ তবে তিনি এ হাদীস ইবনু উমার-এর সূত্রে সরাসরি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত হওয়ার কথা উল্লেখ করেননি। কিন্তু আইয়ুব ও ইবনু জুরায়জ এটাকে মারফু' হিসেবে উল্লেখ করেছেন। তাদের বর্ণনা আমর-এর বর্ণনার চেয়ে পূর্ণাঙ্গ। (ইসলামী ফাউন্ডেশন ২০১৯, ইসলামীক সেন্টার ২০২৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": "930",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪১, আন্তর্জাতিক নাম্বারঃ ৯৩০ ২০৪১-(২৪/৯৩০) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিকে তার বংশধরের কান্নাকাটির দরুন আযাব দেয়া হয়। (ইসলামী ফাউন্ডেশন ২০২০, ইসলামীক সেন্টার ২০২৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": "931",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪২, আন্তর্জাতিক নাম্বারঃ ৯৩১ ২০৪২-(২৫/৯৩১) খালাফ ইবনু হিশাম ও আবুর রাবী' আয যাহরানী (রহঃ) ..... উরওয়াহ ইবনু যুবায়র (রহঃ) থেকে বর্ণিত। তিনি বলেন, 'আয়িশাহ (রাযিঃ) এর কাছে ইবনু উমারের বক্তব্য \"মৃত ব্যক্তিকে তার স্বজনদের কান্নাকাটির দরুন আযাব দেয়া হয়\" উল্লেখ করা হ'ল। তিনি বললেন, আল্লাহ আবূ আবদুর রহমানের (ইবনু উমর) প্রতি রহমত করুন। তিনি একটা কথা শুনেছেন, তবে স্মরণ রাখতে পারেননি। প্রকৃত ব্যাপার হচ্ছেঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে দিয়ে এক ইয়াহুদীর জানাযাহ যাচ্ছিল। তখন তার আত্মীয় স্বজনরা কাঁদছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা কাঁদছ? অথচ তাকে এজন্য আযাব দেয়া হচ্ছে। (ইসলামী ফাউন্ডেশন ২০২১, ইসলামীক সেন্টার ২০২৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": "932.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৩, আন্তর্জাতিক নাম্বারঃ ৯৩২ ২০৪৩-(২৬/৯৩২) আবূ কুরায়ব (রহঃ) ..... হিশাম তার পিতা [উরওয়াহ ইবনু যুবায়র (রহঃ)] থেকে বর্ণিত। তিনি বলেন, 'আয়িশাহ (রাযিঃ)-এর নিকট উল্লেখ করা হ'ল, ইবনু উমর (রাযিঃ) সরাসরি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উদ্ধৃতি দিয়ে বর্ণনা করেন, \"মৃত ব্যক্তিকে তার কবরে তার স্বজনদের কান্নাকাটির দরুন শাস্তি দেয়া হয়।\" তিনি বললেন, ইবনু উমার (রাযিঃ) ভুলে গেছেন। আসলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে কথা বলেছেন তা হচ্ছে এইঃ মৃত ব্যক্তিকে তার পাপের দরুন কবরে শাস্তি দেয়া হয়। আর তার পরিবার-পরিজনেরা তার জন্য কান্নাকাটি করছে। আর এটা হচ্ছে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বদরের একটা কুপের পাশে দাঁড়িয়ে যাতে বদরের দিন নিহত কাফিরদের লাশ নিক্ষিপ্ত হয়েছিল- তাদেরকে সম্বোধন করে যেরূপ বলেছিলেন। তিনি তাদের সম্পর্কে বলেছিলেন, তারা অবশ্যই আমি যা কিছু বলছি তা শুনতে পাচ্ছে অথচ তিনি (ইবনু উমার) এ কথার অর্থ ভুল বুঝেছে। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যা বলেছেন তার সঠিক তাৎপর্য হচ্ছে এইঃ আমি যা কিছু তাদেরকে তাদের জীবদ্দশায় বলেছিলাম, তারা এখন ভালভাবে তা অনুধাবন করেছে যে, তা সম্পূর্ণ ন্যায়সঙ্গত ও সত্য। অতঃপর তিনি (আয়িশাহ) এ দু'টি আয়াত তিলাওয়াত করলেনঃ \"আপনি অবশ্যই মৃত ব্যক্তিদেরকে শুনাতে সক্ষম নন\"- (সূরাহ আন নামল ২৭ঃ ৭০, সূরাহ রুম ৩০ঃ ৫২)। এবং \"আপনি কবরের অধিবাসীদেরকেও শুনাতে সক্ষম নন\"- (সূরাহ ফা-ত্বির ৩৫ঃ ২২২)। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথাটা তখন বলেছিলেন তখন তারা জাহান্নামে নিজ ঠিকানায় পৌছে গেছে। (ইসলামী ফাউন্ডেশন ২০২২, ইসলামীক সেন্টার ২০২৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": "932.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৪, আন্তর্জাতিক নাম্বারঃ ৯৩২ ২০৪৪-(.../...) আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... হিশাম ইবনু উরওয়াহ (রহঃ) থেকে একই সূত্রে আবূ উসামাহ এর হাদীসের সমর্থনে হাদীস বর্ণনা করেছেন। আবূ উসামাহ এর বর্ণিত হাদীসই পূর্ণাঙ্গ। (ইসলামী ফাউন্ডেশন ২০২৩, ইসলামীক সেন্টার ২০৩০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": "932.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৫, আন্তর্জাতিক নাম্বারঃ ৯৩২ ২০৪৫-(২৭/...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ... আমরাহ বিনতু আবদুর রহমান (রহঃ) থেকে বর্ণিত। আয়িশাহ (রাযিঃ) এর কাছে শুনেছেন যখন তার কাছে উল্লেখ করা হ'ল যে, আবদুল্লাহ ইবনু উমার (রাযিঃ) বলছেন, মৃত ব্যক্তিকে তার বংশধরদের কান্নাকাটির দরুন শাস্তি দেয়া হয়। আয়িশাহ (রাযিঃ) বললেন, আল্লাহ আবূ আবদুর রহমানকে (ইবনু উমার) ক্ষমা করুন, কথাটা ঠিক নয়। তবে তিনি মিথ্যা বলেননি। বরং তিনি (প্রকৃত কথাটা) ভুলে গেছেন অথবা ভুল বুঝেছেন। প্রকৃত ব্যাপার হচ্ছেঃ একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ইয়াহুদী নারীর করের কাছ দিয়ে যাওয়ার সময় দেখলেন তার জন্য কান্নাকাটি করা হচ্ছে। তিনি বললেন, তারা এর জন্য কান্নাকাটি করছে আর এ নারীকে তার কবরে শাস্তি দেয়া হচ্ছে। (ইসলামী ফাউন্ডেশন ২০২৪, ইসলামীক সেন্টার ২০৩১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": "933.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৬, আন্তর্জাতিক নাম্বারঃ ৯৩৩ ২০৪৬-(২৮/৯৩৩) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... আলী ইবনু রবী'আহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, সর্বপ্রথম যে ব্যক্তির প্রতি বিলাপ করা হয়েছে, সে হচ্ছে কুফা নগরীর কারাযাহ ইবনু কা'ব। মুগীরাহ ইবনু শুবাহ (রাযিঃ) বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যার জন্য বিলাপ করে কান্না হয়, কিয়ামতের দিন তাকে এর জন্য আযাব দেয়া হবে। (ইসলামী ফাউন্ডেশন ২০২৫, ইসলামীক সেন্টার ২০৩২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": "933.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৭, আন্তর্জাতিক নাম্বারঃ ৯৩৩ ২০৪৭-(.../...) আলী ইবনু হুজর আস সা’দী (রহঃ) ..... মুগীরাহ ইবনু শুবাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০২৬, ইসলামীক সেন্টার ২০৩৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": "933.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৮, আন্তর্জাতিক নাম্বারঃ ৯৩৩ ২০৪৮-(.../...) ইবনু আবূ উমর (রহঃ) ..... মুগীরাহ ইবনু শুবাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০২৭, ইসলামীক সেন্টার ২০৩৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": "934",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৪৯, আন্তর্জাতিক নাম্বারঃ ৯৩৪ ২০৪৯-(২৯/৯৩৪) আবূ বাকর ইবনু আবূ শায়বাহ, ইসহাক ইবনু মানসূর (রহঃ) [শব্দাবলী তার] ..... আবূ মালিক আল আশ'আর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমার উন্মাতের মধ্যে জাহিলী যুগের চারটি কু-প্রথা রয়ে গেছে যা লোকেরা পরিত্যাগ করতে চাইবে না। (১) বংশের গৌরব, (২) অন্যকে বংশের খোটা দেয়া, (৩) নক্ষত্রের মাধ্যমে বৃষ্টির জন্য প্রার্থনা করা, (৪) মৃতের জন্য বিলাপ করে কান্নাকাটি করা। তিনি আরও বলেন, বিলাপকারী যদি মৃত্যুর পূর্বে তওবা না করে তাহলে কিয়ামতের দিন তাকে এভাবে উঠানো হবে যে, তার গায়ে আলকাতরার (চাদর) খসখসে চামড়ার ওড়না থাকবে। (ইসলামী ফাউন্ডেশন ২০২৮, ইসলামীক সেন্টার ২০৩৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": "935.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫০, আন্তর্জাতিক নাম্বারঃ ৯৩৫ ২০৫০-(৩০/৯৩৫) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু আবূ উমর (রহঃ) ..... আমরাহ (রহঃ) থেকে বর্ণিত। তিনি 'আয়িশাহ (রাযিঃ)-কে বলতে শুনেছেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট যায়দ ইবনু হারিসাহ (রাযিঃ) জাফর ইবনু আবূত তলিব (রাযিঃ) ও ‘আবদুল্লাহ ইবনু রওয়াহাহ (রাযিঃ) এর শাহাদাতের খবর পৌছল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিমর্ষচিত্তে বসে পড়লেন। তার চেহারায় শোকের ছাপ ফুটে উঠল। আয়িশাহ (রাযিঃ) বলেন, আমি দরজার ফাঁক দিয়ে তাকিয়ে তাদের লাশ দেখছিলাম। এমন সময় জনৈক ব্যক্তি এসে বলল, হে আল্লাহর রসূল! জাফার এর স্ত্রীগণ অথবা তার পরিবারের মহিলার কান্নাকাটি করছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে গিয়ে তাদেরকে কাঁদতে নিষেধ করার জন্য আদেশ করলেন। লোকটি গিয়ে ফিরে এসে জানাল যে, তারা তার কথা শুনছে না। তখন দ্বিতীয়বার তাকে আদেশ করলেন যেন গিয়ে তাদেরকে নিষেধ করে। লোকটি গিয়ে আবার ফিরে এসে বলল, আল্লাহর কসম, হে আল্লাহর রসূল! তারা আমাদের ওপর প্রাধান্য লাভ করেছে। আয়িশাহ (রাযিঃ) বলেন, আমার মনে হয় এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এবার গিয়ে তাদের মুখে কিছু মাটি ঢেলে দাও। আয়িশাহ (রাযিঃ) বলেন, তখন আমি বললাম, আল্লাহ তোমার নাককে ভূলুষ্ঠিত করুক। আল্লাহর কসম রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে যে আদেশ করেছেন, তা তুমি পালন করছ না বা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বিরক্ত করা থেকেও রেহাই দিচ্ছ না। (ইসলামী ফাউন্ডেশন ২০২৯, ইসলামীক সেন্টার ২০৩৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": "935.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫১, আন্তর্জাতিক নাম্বারঃ ৯৩৫ ২০৫১-(.../...) আবূ বকর ইবনু আবূ শায়বাহ, আবূত তাহির, আহমাদ ইবনু ইবরাহীম আদ দাওরাকী (রহঃ) ..... সকলেই ইয়াহইয়া ইবনু সাঈদ (রহঃ) থেকে একই সানাদে অনুরূপ বর্ণনা করেছেন। আবদুল আযীয (রহঃ) বর্ণিত হাদীসে এরূপ বর্ণিত হয়েছেঃ তুমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে পরিশ্রান্ত করা থেকে বিরত থাকছ না। (ইসলামী ফাউন্ডেশন ২০৩০, ইসলামীক সেন্টার ২০৩৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": "936.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫২, আন্তর্জাতিক নাম্বারঃ ৯৩৬ ২০৫২-(৩১/৯৩৬) আবূর রাবী' আয যাহরানী (রহঃ) ..... উম্মু আত্বিয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বায়'আতের সঙ্গে এ ওয়াদাও নিয়েছেন যে, আমরা যেন মৃতের জন্যে বিলাপ করে কান্নাকাটি না করি। কিন্তু পরে মাত্র পাঁচজন মহিলা ছাড়া আমাদের কোন মহিলাই তা পালন করেনি। তারা হচ্ছেন- উম্মু সুলায়ম, উন্মুল 'আলা, আবূ সাবুরাহ-এর কন্যা ও মু'আয-এর স্ত্রী প্রমুখ। (ইসলামী ফাউন্ডেশন ২০৩১, ইসলামীক সেন্টার ২০৩৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": "936.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৩, আন্তর্জাতিক নাম্বারঃ ৯৩৬ ২০৫৩-(৩২/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উম্মু 'আতিয়্যিাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়আতের সময় আমাদের নিকট থেকে এ ওয়াদা নিয়েছেন- যেন আমরা বিলাপ করে কান্নাকাটি না করি। কিন্তু আমাদের মধ্যে পাঁচজন মহিলা ব্যতীত আর কেউই এ ওয়া'দা পালন করতে পারেনি। উম্মু সুলায়ম (রাযিঃ) এদের অন্যতম। (ইসলামী ফাউন্ডেশন ২০৩২, ইসলামীক সেন্টার ২০৩৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": "937",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৪, আন্তর্জাতিক নাম্বারঃ ৯৩৭ ২০৫৪-(৩৩/৯৩৭) আবূ বাকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উম্মু আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন এ আয়াত অবতীর্ণ হ'ল- \"সে মহিলারা আপনার নিকট এ কথার ওপর বাইয়াত করছে যে, আল্লাহর সাথে কোন কিছুকে শারীক করবে না এবং কোন ভাল কাজে তারা নাফরমানী করবে না- (সূরাহ আল মুমতাহিনাহ ৬০ঃ ১২)\" উম্মু আতিয়্যাহ বলেন, মৃতের জন্য বিলাপ করে কান্নাও অন্তর্ভুক্ত ছিল। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! তবে অমুকের পরিবার, তারা জাহিলী যুগে আমার সহায়তা করেছিল অতএব আমার ওপর তাদের সহায়তা করা জরুরী। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তাকে অনুমতি দিয়ে) বললেন, আচ্ছা! অমুকের পরিবার ছাড়া। (ইসলামী ফাউন্ডেশন ২০৩৩, ইসলামীক সেন্টার ২০৩৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": "938.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৫, আন্তর্জাতিক নাম্বারঃ ৯৩৮ ২০৫৫-(৩৪/৯৩৮) ইয়াহইয়া ইবনু আইয়ূব (রহঃ) ..... উম্মু আত্বিয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমাদেরকে (মহিলাদেরকে) জানাযার অনুসরণ করতে (পিছনে যেতে) নিষেধ করা হত। কিন্তু আমাদেরকে কঠোরভাবে নিষেধ করা হত না। (ইসলামী ফাউন্ডেশন ২০৩৪, ইসলামীক সেন্টার ২০৪০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": "938.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৬, আন্তর্জাতিক নাম্বারঃ ৯৩৮ ২০৫৬-(৩৫/...) আবূ বকর ইবনু আবূ শায়বাহ, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উম্মু 'আতিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমাকে জানাযায় অনুগমনে নিষেধ করা হয়েছে। তবে আমাদেরকে কঠোরতা আরোপ করা হয়নি। (ইসলামী ফাউন্ডেশন ২০৩৫, ইসলামীক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": "939.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৭, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৫৭-(৩৬/৯৩৯) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মু আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা (যায়নাব)-কে গোসল দেয়ার সময় তিনি আমাদের কাছে এসে বললেন, \"তাকে তিনবার, পাঁচবার অথবা প্রয়োজনবোধে এর চেয়ে অধিক বড়ইপাতা মিশ্রিত পানি দিয়ে গোসল করাও এবং শেষে কিছুটা কর্পূর দিয়ে দাও।\" তোমরা গোসল শেষ করলে আমাকে খবর দিও। আমরা গোসল শেষ করে তাকে খবর দিলাম। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার নিজ লুঙ্গি আমাদের কাছে দিয়ে বললেন, এ কাপড় তার গায়ে জড়িয়ে দাও। (ইসলামী ফাউন্ডেশন ২০৩৬, ইসলামীক সেন্টার ২০৪১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": "939.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৮, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৫৮-(৩৭/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মু 'আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। আমরা তার (যায়নাব) মাথার চুল আঁচড়িয়ে তিনভাগে ভাগ করে দিয়েছি। (ইসলামী ফাউন্ডেশন ২০৩৭, ইসলামীক সেন্টার ২০৪২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": "939.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৫৯, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৫৯-(৩৮/...) কুতায়বাহ ইবনু সাঈদ, আবূর রাবী' আয যাহরানী, ইয়াহইয়া ইবনু আইয়ূব (রহঃ) ..... উম্মু 'আতিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন কন্যা ইনতিকাল করেন। ইবনু উলাইয়্যাহ এর বর্ণনায় আছে। উম্মু আতিয়্যাহ (রাযিঃ) বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যাকে গোসল দেয়ার সময় তিনি আমাদের নিকট আসলেন। মালিক এর হাদীসে এভাবে বর্ণিত হয়েছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা ইনতিকাল করলে তিনি আমাদের কাছে আসলেন, অনুরূপ ইয়াযীদ ইবনু যুরাই (রহঃ) এর হাদীস যা ..... উম্মু আতিয়্যাহ সূত্রে বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০৩৮, ইসলামীক সেন্টার ২০৪৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": "939.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬০, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬০-(৩৯/...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... উম্মু আতিয়াহ (রাযিঃ) থেকে অনুরূপ বর্ণিত হয়েছে, কেবল ব্যতিক্রম এই যে, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ তিনবার, পাঁচবার, সাতবার বা এর চেয়েও অধিকবার গোসল দেয়া যদি তোমরা প্রয়োজনবোধ কর তাই করবে। এরপর হাফসাহ (রাযিঃ) উম্মু আতিয়্যাহ সূত্রে বলেন, আমরা তার মাথার চুলকে তিন গোছায় ভাগ করে দিয়েছি। (ইসলামী ফাউন্ডেশন ২০৩৯, ইসলামীক সেন্টার ২০৪৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": "939.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬১, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬১-(.../...) ইয়াহইয়া ইবনু আইয়ূব (রহঃ) ..... উম্মু আতিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ তাকে (যায়নাবকে) বেজোড় সংখ্যায় গোসল দাও তিনবার, পাঁচবার বা সাতবার। আর উম্মু আতিয়াহ (রাযিঃ) বলেছেন, আমরা তার চুলকে তিন গোছায় বিভক্ত করে আঁচড়ে দিয়েছি। (ইসলামী ফাউন্ডেশন ২০৪০, ইসলামীক সেন্টার ২০৪৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": "939.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬২, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬২-(৪০/...) আবূ বকর ইবনু আবূ শায়বাহ ও আমর আন নাকিদ (রহঃ) ..... উম্মু 'আতিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা যায়নাব (রাযিঃ) যখন ইনতিকাল করেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বললেন, তাকে বেজোড় সংখ্যায় গোসল দাও, তিনবার বা পাঁচবার। আর পঞ্চমবারের সাথে কর্পূর দাও অথবা বলেছেন কিছু কর্পূর দাও গোসল শেষ করে আমাকে খবর দিও। উম্মু আতিয়্যাহ (রাযিঃ) বলেন, গোসল শেষ করে আমরা তাকে খবর দিলাম। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের কাছে তার লুঙ্গি দিয়ে বললেন, এটা কাফনের ভিতরে তার গায়ে জড়িয়ে দাও। (ইসলামী ফাউন্ডেশন ২০৪১, ইসলামীক সেন্টার ২০৪৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": "939.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৩, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬৩-(৪১/...) 'আমুর আন নাকিদ (রহঃ) ..... উম্মু আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছে আসলেন। তখন আমরা তার এক মৃত কন্যাকে গোসল দিচ্ছিলাম। তিনি বললেন, তাকে বেজোড় সংখ্যায় পাঁচবার বা তার চেয়ে অধিকবার গোসল দাও। অবশিষ্ট বর্ণনায় আইয়ুব ও আসিম-এর বর্ণনার অনুরূপ। আর হাদীস বর্ণনাকালে উম্মু 'আতিয়্যিাহ (রাযিঃ) বললেন, এরপর আমরা তার চুলকে তিন গোছায় ভাগ করে দু' কানের দু' দিকে ও কপালের দিকে ঝুলিয়ে দিলাম। (ইসলামী ফাউন্ডেশন ২০৪২, ইসলামীক সেন্টার ২০৪৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": "939.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৪, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬৪-(৪২/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মু 'আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তাকে তাঁর (রসূলের) মৃত কন্যাকে গোসল দেয়ার আদেশ করলেন, তাকে বললেন, তার ডানদিক থেকে আরম্ভ কর এবং তার ওযুর অঙ্গগুলো আগে ধৌত করো। (ইসলামী ফাউন্ডেশন ২০৪৩, ইসলামীক সেন্টার ২০৪৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": "939.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৫, আন্তর্জাতিক নাম্বারঃ ৯৩৯ ২০৬৫-(৪৩/...) ইয়াহইয়া ইবনু আইয়ুব, আবূ বকর ইবনু আবূ শায়বাহ ও আমর আন নাকিদ (রহঃ) ..... উম্মু আতিয়্যাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কন্যার গোসল দেয়ার সময় তাদেরকে বলে দিলেনঃ তোমরা তার ডান দিক থেকে আরম্ভ কর এবং তার ওযুর অঙ্গগুলো আগে ধুয়ে নাও। (ইসলামী ফাউন্ডেশন ২০৪৪, ইসলামীক সেন্টার ২০৪৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": "940.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৬, আন্তর্জাতিক নাম্বারঃ ৯৪০ ২০৬৬-(৪৪/৯৪০) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী, আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনু 'আবদুল্লাহ ইবনু নুমায়র ও আবূ কুরায়ব (রহঃ) [শব্দগুলো ইয়াহইয়া-এর] ..... খাব্বাব ইবনুল আরাত (রাযিঃ) থেকে বর্ণিত। আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আল্লাহর রাস্তায় আল্লাহর সন্তুষ্টি লাভের উদ্দেশে হিজরাত করলাম। অতএব, আল্লাহর কাছে আমাদের পুরস্কার পাওয়া অনিবার্য হয়েছে। আমাদের মধ্যে কেউ কেউ এভাবে দুনিয়া থেকে চলে গেলেন যে, তার পুরস্কারের কোন কিছুই তিনি ভোগ করেননি। মুসআব ইবনু উমায়র (রাযিঃ) তাদের অন্যতম। তিনি উহুদ যুদ্ধের দিন শাহাদাত বরণ করেন। তাকে কাফন দেয়ার মতো একটি চাদর ছাড়া আর কিছুই পাওয়া যায়নি। আমরা যখন তা দিয়ে তার মাথা ঢাকলাম পা বেরিয়ে আসল। আর যখন পায়ের উপর রাখলাম, মাথা বেরিয়ে আসল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “তোমরা চাদরটি এভাবে পরাও যাতে তা মাথা জড়িয়ে থাকে আর তার পা ইযখির নামক (এক প্রকার) শুকনো ঘাস দিয়ে ঢেকে দাও।” এছাড়া আমাদের মধ্যে কারো কারো ফল পেকে গেছে, যা তারা আহরণ করছে। (ইসলামী ফাউন্ডেশন ২০৪৫, ইসলামীক সেন্টার ২০৫০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": "940.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৭, আন্তর্জাতিক নাম্বারঃ ৯৪০ ২০৬৭-(.../...) উসমান ইবনু আবূ শায়বাহ, ইসহাক ইবনু ইবরাহীম, মিনজাব ইবনু হারিস আত তামিমী, ইসহাক ইবনু ইবরাহীম (রহঃ) ... আমাশ (রহঃ) থেকে একই সূত্রে অনুরূপ বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ২০৪৬, ইসলামীক সেন্টার ২০৫১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": "941.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৮, আন্তর্জাতিক নাম্বারঃ ৯৪১ ২০৬৮-(৪৫/৯৪১) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) [শব্দগুলো ইয়াহইয়ার] ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে (সিরিয়ার) সাহুল নগরীর তৈরি সাদা তিন কাপড় দ্বারা কাফন দেয়া হয়। তন্মধ্যে জামা ও পাগড়ি ছিল না। (তার নিকট সংরক্ষিত) \"জোড়া কাপড় সম্পর্কে মানুষের মধ্যে দ্বিধা-দ্বন্দ্ব ছিল যে, তা কাফনের উদ্দেশে খরিদ করা হয়েছে কিনা? তাই তা রেখে দেয়া হ’ল এবং সাহুল নগরীর তৈরি সাদা তিন কাপড়েই কাফন দেয়া হ'ল। এদিকে আবদুল্লাহ ইবনু আবূ বাকর (রাযিঃ) জোড়াটা নিয়ে বললেন, আমি অবশ্যই তা সংরক্ষণ করব এবং আমি নিজেকে এর দ্বারা কাফন দিব। তিনি পুনরায় বললেন, আল্লাহ যদি এটা তার নবীর জন্য পছন্দ করতেন, তবে অবশ্যই তিনি তা দিয়ে কাফনের ব্যবস্থা করতেন। অতঃপর তা বিক্রি করে তিনি তার মূল্য সদাকাহ করে দিলেন। (ইসলামী ফাউন্ডেশন ২০৪৭, ইসলামীক সেন্টার ২০৫২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": "941.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৬৯, আন্তর্জাতিক নাম্বারঃ ৯৪১ ২০৬৯-(৪৬/...) আলী ইবনু হুজুর আস সা’দী (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রথমে ইয়ামানী জোড়া কাপড়ে রাখা হয়েছিল, যা ছিল 'আবদুল্লাহ ইবনু আবূ বাকর এর। অতঃপর তা তার থেকে খুলে ফেলা হ’ল এবং ইয়ামান দেশের সাহল নগরের তৈরি কাপড়ের তিন কাপড় দ্বারা কাফন দেয়া হ'ল। এতে পাগড়ী ও কামিজ ছিল না। অতঃপর আবদুল্লাহ জোড়া চাদরটা তুলে বললেনঃ এ কাপড়ে আমার কাফন দেয়া হবে। একটু পর আবার বললেন, যে কাপড় দিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কাফন দেয়া হয়নি তা দিয়ে আমার কাফন দেয়া হবে? অতঃপর তিনি তা সদাকাহ করে দিলেন। (ইসলামী ফাউন্ডেশন ২০৪৮, ইসলামীক সেন্টার ২০৫৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": "941.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭০, আন্তর্জাতিক নাম্বারঃ ৯৪১ ২০৭০-(.../...) আবূ বকর ইবনু আবূ শায়বাহ, ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সকলে হিশাম (রহঃ) থেকে উক্ত সানাদে বর্ণনা করেছেন। তবে তাদের হাদীসে আবদুল্লাহ ইবনু আবূ বাকর-এর ঘটনা উল্লেখ নেই। (ইসলামী ফাউন্ডেশন ২০৪৯, ইসলামীক সেন্টার ২০৫৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": "941.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭১, আন্তর্জাতিক নাম্বারঃ ৯৪১ ২০৭১-(৪৭/...) ইবনু আবূ উমর (রহঃ) ..... আবূ সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) কে জিজ্ঞেস করলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কয়টি কাপড়ে কাফন দেয়া হয়েছিল? তিনি বললেন, তিন কাপড়ে যা সাহুল অঞ্চলের তৈরি ছিল (ইসলামী ফাউন্ডেশন ২০৫০, ইসলামীক সেন্টার ২০৫৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": "942.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭২, আন্তর্জাতিক নাম্বারঃ ৯৪২ ২০৭২-(৪৮/৯৪২) যুহায়র ইবনু হারব, হাসান আল হুলওয়ানী ও আবদ ইবনু হুমায়দ (রহঃ) ..... উম্মুল মুমিনীন 'আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইনতিকাল করলে তাকে ইয়ামানী চাদর দিয়ে ঢেকে দেয়া হয়। (ইসলামী ফাউন্ডেশন ২০৫১, ইসলামীক সেন্টার ২০৫৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": "942.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৩, আন্তর্জাতিক নাম্বারঃ ৯৪২ ২০৭৩-(.../...) ইসহাক ইবনু ইবরাহীম, আবদ ইবনু হুমায়দ, আবদুল্লাহ ইবনু আবদুর রহমান আদ দারিমী (রহঃ) ..... যুহরী (রহঃ) থেকে একই সূত্রে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০৫২, ইসলামীক সেন্টার ২০৫৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": "943",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৪, আন্তর্জাতিক নাম্বারঃ ৯৪৩ ২০৭৪-(৪৯/৯৪৩) হারূন ইবনু 'আবদুল্লাহ ও হাজ্জাজ ইবনুশ শাইর (রহঃ) ..... আবুয যুবায়র (রহঃ) থেকে বর্ণিত। তিনি জাবির ইবনু আবদুল্লাহ (রাযিঃ)-কে বলতে শুনেছেন। একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবাহ দিতে গিয়ে তার সাহাবীগণের মধ্যে জনৈক ব্যক্তির কথা উল্লেখ করলেন। তিনি মারা গেলে তাকে অপর্যাপ্ত কাপড়ে কাফন দেয়া হয় এবং তাকে রাত্রিবেলা কবর দেয়া হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এই বলে তিরস্কার করলেন যে, কেন তাকে রাত্রিবেলা দাফন করা হ'ল। অথচ তিনি তার জানাযাহ পড়তে পারলেন না, কোন মানুষ নিরুপায় না হলে এরূপ করা ঠিক নয়। এ প্রসঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন তোমাদের কেউ তার মুসলিম ভাইকে কাফন দিবে সে যেন ভাল কাপড় দিয়ে কাফনের ব্যবস্থা করে। (ইসলামী ফাউন্ডেশন ২০৫৩, ইসলামীক সেন্টার ২০৫৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": "944.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৫, আন্তর্জাতিক নাম্বারঃ ৯৪৪ ২০৭৫-(৫০/৯৪৪) আবূ বকর ইবনু আবূ শায়বাহ ও যুহারর ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা জানাযার সালাত যথাসম্ভব তাড়াতাড়ি আদায় কর। যদি নেক্কার লোকের জানাযাহ হয়ে থাকে তবে তো কল্যাণকর, কল্যাণের দিকে তাকে আগে বাড়িয়ে দিবে। আর যদি অন্য কিছু হয়, তবে তা অকল্যাণ। এ অকল্যাণ অশুভকে তোমাদের গর্দান থেকে দ্রুত সরিয়ে দিবে। (ইসলামী ফাউন্ডেশন ২০৫৪, ইসলামীক সেন্টার ২০৫৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": "944.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৬, আন্তর্জাতিক নাম্বারঃ ৯৪৪ ২০৭৬-(.../...) মুহাম্মাদ ইবনু রাফি' ও 'আবূদ ইবনু হুমায়দ, ইয়াহইয়া ইবনু হাবীব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তবে মা'মার এর বর্ণনায় হাদীসে উল্লেখ আছে, তিনি বলেন, আমি এ হাদীসটা মারফু হওয়া সম্পর্কে নিশ্চিতভাবে জানি। (ইসলামী ফাউন্ডেশন ২০৫৫, ইসলামীক সেন্টার ২০৬০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": "944.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৭, আন্তর্জাতিক নাম্বারঃ ৯৪৪ ২০৭৭-(৫১/...) আবুত তহির, হারমালাহ ইবনু ইয়াহইয়া ও হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ তোমরা জানাযাহ যথাসম্ভব শীর্ঘ আদায় কর। কেননা, যদি তা নেককার লোকের জানাযাহ হয়ে থাকে, তবে তোমরা তাকে দ্রত কল্যাণের নিকটবর্তী করে দাও। আর যদি এর বিপরীত হয়, তা হবে অকল্যাণকর, যা তোমরা নিজেদের গর্দান থেকে দ্রুত নামিয়ে দাও। (ইসলামী ফাউন্ডেশন ২০৫৬, ইসলামীক সেন্টার ২০৬১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": "945.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৮, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৭৮-(৫২/৯৪৫) আবূত তহির, হারমালাহ ইবনু ইয়াহইয়া ও হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জানাযার সালাত আদায় করা পর্যন্ত লাশের সাথে থাকে, তাকে এক কীরাত সাওয়াব দেয়া হবে। আর যে ব্যক্তি দাফন করা পর্যন্ত লাশের সাথে উপস্থিত থাকে, তাকে দু' কীরাত সাওয়াব দান করা হবে। কেউ জিজ্ঞেস করল, দু কীরাত বলতে কি পরিমাণ বুঝায়? তিনি বললেন, দুটি বিরাট পাহাড় সমতুল্য। আবূত তহির বর্ণিত হাদীস এ পর্যন্ত শেষ হল। বাকী দু'জন বর্ণনাকারী আরো বর্ণনা করেছেন যে, ইবনু শিহাব বলেন, সালিম ইবনু আবদুল্লাহ বলেছেন এবং ইবনু উমর (রাযিঃ) জানাযার সালাত আদায় করতে চলে যেতেন। যখন তার নিকট আবূ হুরায়রাহ (রাযিঃ) বর্ণিত হাদীস পৌছল তখন তিনি বললেন, আমরা তো বহু কীরাত বরবাদ করে দিয়েছি। (ইসলামী ফাউন্ডেশন ২০৫৭, ইসলামীক সেন্টার ২০৬২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": "945.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৭৯, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৭৯-(.../...) আবূ বকর ইবনু আবূ শায়বাহ, ইবনু রাফি ও আবদ ইবনু হুমায়দ (রহঃ) ..... আবৃ হুরাররাহ (রাযিঃ) থেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা \"বিরাট দু' পাহাড় সমতুল্য পর্যন্ত\" বর্ণিত হয়েছে। 'আবদুল আ'লা ও আবদুর রাযযাক উভয়ে হাদীসের পরবর্তী অংশ উল্লেখ করেননি। আবদুল আ'লা এর হাদীসে \"শেষ না হওয়া পর্যন্ত\" এবং আবদুর রাযযাক এর হাদীসে “কবরে না রাখা পর্যন্ত\" বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০৫৮, ইসলামীক সেন্টার ২০৬৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": "945.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮০, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৮০-(.../...) আবদুল মালিক ইবনু শু'আরব ইবনুল লায়স (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে এবং তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে মামার এর হাদীসের অনুরূপ বর্ণনা করেছেন। এ বর্ণনায় বলেছেন, যে ব্যক্তি দাফন করা পর্যন্ত জানাযার অনুসরণ করে। (ইসলামী ফাউন্ডেশন ২০৫৯, ইসলামীক সেন্টার ২০৬৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": "945.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮১, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৮১-(৫৩/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জানাযার সালাত আদায় করে এবং লাশের অনুসরণ করে না তার জন্য রয়েছে এক কীরাত সাওয়াব। আর যে ব্যক্তি লাশের অনুসরণ করে তার জন্য রয়েছে দু' কীরাত। কেউ জিজ্ঞেস করল \"দু কীরাত\" বলতে কি পরিমাণ বুঝায়? তিনি বললেন, এর ছোটটি উহুদ পাহাড় সমতুল্য। (ইসলামী ফাউন্ডেশন ২০৬০, ইসলামীক সেন্টার ২০৬৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": "945.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৩, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৮৩-(৫৫/...) শায়বান ইবনু ফাররূখ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনছিঃ যে ব্যক্তি জানাযার অনুসরণ করে তার জন্য রয়েছে এক কীরাত সাওয়াব। এটা শুনে ইবনু উমর (রাযিঃ) বললেন, আবূ হুরায়রাহ (রাযিঃ) আমাদের কাছে অতিরঞ্জিত করেছে। এরপর তিনি আয়িশাহ (রাযিঃ) এর নিকট লোক পাঠিয়ে তাকে এর সত্যতা সম্পর্কে জিজ্ঞেস করলেন। আয়িশাহ (রাযিঃ) আবূ হুরায়রাহ (রাবিঃ) এর কথাটি সত্যায়িত করলেন। এরপর ইবনু উমর (রাযিঃ) বললেন, আমরা তো বহু সংখ্যক কীরাত থেকে বঞ্চিত হলাম। (ইসলামী ফাউন্ডেশন ২০৬২, ইসলামীক সেন্টার ২০৬৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": "945.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮২, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৮২-(৫৪/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জানাযার সালাত আদায় করে তার জন্য এক কীরাত সাওয়াব, আর যে ব্যক্তি মৃতকে কবরে রাখা পর্যন্ত এর অনুসরণ করে, তার জন্য রয়েছে দু' কীরাত সাওয়াব। আবূ হাযিম বলেন, আমি আবূ হুরায়রাহ (রাযিঃ) কে জিজ্ঞেস করলাম কীরাতে পরিমাণ কতটুকু? তিনি বললেন, উহুদ পাহাড়ের সমতুল্য। (ইসলামী ফাউন্ডেশন ২০৬১, ইসলামীক সেন্টার ২০৬৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": "945.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৪, আন্তর্জাতিক নাম্বারঃ ৯৪৫ ২০৮৪-(৫৬/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... সা'দ ইবনু ওয়াক্কাস (রাযিঃ) থেকে বর্ণিত। তিনি আবদুল্লাহ ইবনু উমর (রাযিঃ) এর নিকট বসা ছিলেন। এমন সময় খাব্বাব (রাযিঃ) (মাকসুরাহ ওয়ালা) এসে উপস্থিত হলেন এবং বললেন, হে আবদুল্লাহ ইবনু উমার! আপনি কি আবূ হুরায়রাহ (রাযিঃ) এর কথা শুনছেন না? তিনি বললেন, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ যে ব্যক্তি জানাযার সাথে ঘর থেকে বের হয় এবং জানাযার সালাত আদায় করে, অতঃপর দাফন করা পর্যন্ত জানাযার সাথে থাকে, তাকে দু' কীরাত সাওয়াব দান করা হবে। প্রতিটি কীরাত্ব উহুদ পাহাড় সমতুল্য সাওয়াব লাভ করবে। ইবনু উমর (রাযিঃ) এ কথা যাচাই করার জন্য খাব্বাবকে আয়িশাহ (রাযিঃ)-এর নিকট পাঠিয়ে দিলেন। খাব্বাব (রাযিঃ) চলে গেলে ইবনু উমার (রাযিঃ) মসজিদের কাকর থেকে এক মুষ্ঠি কাকর হাতে নিলেন এবং খাব্বাব ফিরে না আসা পর্যন্ত তা হাতে নিয়ে নড়াচড়া করছিলেন। খাবাব ফিরে এসে বললেন, 'আয়িশাহ (রাযিঃ) বলেছেন, আবূ হুরায়রাহ (রাযিঃ) ঠিকই বলেছেন। ইবনু উমর (রাযিঃ) তার কঙ্কর জমিনের উপর ছুড়ে মেরে বললেন, আমরা অবশ্যই বহু সংখ্যক কীরাত বরবাদ করে দিয়েছি। (ইসলামী ফাউন্ডেশন ২০৬৩, ইসলামীক সেন্টার ২০৬৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": "946.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৫, আন্তর্জাতিক নাম্বারঃ ৯৪৬ ২০৮৫-(৫৭/৯৪৬) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গোলাম সাওবান (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জানাযার সালাত আদায় করে তাকে এক কীরাত সাওয়াব দান করা হয়। আর সে যদি দাফন কার্যেও শারীক থাকে, তবে দু' কীরাত সাওয়াব লাভ করবে। এক কীরাত্ব উহুদ সমতুল্য। (ইসলামী ফাউন্ডেশন ২০৬৪, ইসলামীক সেন্টার ২০৭৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": "946.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৬, আন্তর্জাতিক নাম্বারঃ ৯৪৬ ২০৮৬-(.../...) (হাম্মদ) ইবনু বাশশার, ইবনুল মুসান্না, যুহারর ইবনু হারব (রহঃ) ..... সকলে কতাদাহ (রহঃ) থেকে একই সূত্রে অনুরূপ বর্ণনা করেছেন। সাঈদ ও হিশাম এর বর্ণিত হাদীসে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কীরাত সম্পর্কে জিজ্ঞেস করা হলে তিনি বললেন, তা উহুদ পাহাড় সমতুল্য। (ইসলামী ফাউন্ডেশন ২০৬৫, ইসলামীক সেন্টার ২০৭০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": "947",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৭, আন্তর্জাতিক নাম্বারঃ ৯৪৭ ২০৮৭-(৫৮/৯৪৭) হাসান ইবনু ঈসা (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মৃত ব্যক্তির ওপর যখন একদল মুসলিম যাদের একশ হবে জানাযার সালাত আদায় করে এবং সবাই তার জন্য আল্লাহর কাছে সুপারিশ করে, তবে তার জন্য এ সুপারিশ কবুল করা হবে। তিনি (সাল্লাম ইবনু আবূ মুত্বী\") বলেন, আমি এ হাদীসটি শু'আয়ব ইবনু হাবহাব এর কাছে বর্ণনা করলে তিনি বললেন, আমাকে এ হাদীস আনাস ইবনু মালিক (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সূত্রে বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ২০৬৬, ইসলামীক সেন্টার ২০৭১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": "948",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৮, আন্তর্জাতিক নাম্বারঃ ৯৪৮ ২০৮৮-(৫৯/৯৪৮) হারূন ইবনু মা’রূফ, হারূন ইবনু সাঈদ আল আয়লী ও ওয়ালীদ ইবনু শুজা আস্ সাকূনী (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। কুদায়দ' অথবা উসকান নামক স্থানে তার একটি পুত্র সন্তান মারা গেল। তিনি আমাকে বললেন, হে কুরায়ব! দেখ কিছু লোক একত্রিত হয়েছে কিনা? আমি বের হয়ে দেখলাম কিছু একত্রিত হয়েছে। আমি তাকে খবর দিলাম। তিনি জিজ্ঞেস করলেন, বল তাদের সংখ্যা কি চল্লিশ হবে? বললাম, হ্যাঁ। তিনি বললেন, তাহলে লাশ বের করে নাও। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ কোন মুসলিম মারা গেলে, তার জানাযায় যদি এমন চল্লিশজন দাঁড়িয়ে যায় যারা আল্লাহর সাথে কোন কিছুকে শারীক করে না তবে মহান আল্লাহ তার অনুকূলে তাদের প্রার্থনা কবুল করেন। (ইসলামী ফাউন্ডেশন ২০৬৭, ইসলামীক সেন্টার ২০৭২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": "949.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৮৯, আন্তর্জাতিক নাম্বারঃ ৯৪৯ ২০৮৯-(৬০/৯৪৯) ইয়াহইয়া ইবনু আইয়ুব, আবূ বাকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব ও আলী ইবনু হুজুর (রহঃ) [শব্দগুলো ইয়াহইয়া-এর] ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একটি জানাযাহ বয়ে নিয়ে যাওয়া হচ্ছিল। লোকেরা প্রশংসা করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ওয়াজিব হয়েছে, ওয়াজিব হয়েছে, ওয়াজিব হয়েছে। (আরেকবার) একটা জানাযাহ বয়ে নিয়ে যাওয়া হচ্ছিল কিন্তু লোকেরা তার দুর্নাম করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সম্পর্কে ওয়াজিব হয়েছে, ওয়াজিব হয়েছে, ওয়াজিব হয়েছে (তিনবার) বললেন। তখন উমর (রাযিঃ) বললেন, হে আল্লাহর রসূল! আপনার ওপর আমার মা-বাপ উৎসর্গ হোক! একটা জানাযাহ অতিক্রম করলে তার প্রতি ভাল মন্তব্য করা হলে আপনি ওয়াজিব হয়েছে, ওয়াজিব হয়েছে, ওয়াজিব হয়েছে- বললেন! আর একটা জানাযাহ অতিক্রমকালে তার প্রতি খারাপ মন্তব্য করা হলে আপনি ওয়াজিব হয়েছে, ওয়াজিব হয়েছে, ওয়াজিব হয়েছে- বললেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তরে বললেনঃ তোমরা যার সম্পর্কে ভাল মন্তব্য করেছ তার জন্য জান্নাত ওয়াজিব হয়ে গেছে। আর তোমরা যার সম্পর্কে খারাপ মন্তব্য করেছ তার জন্য জাহান্নাম ওয়াজিব হয়ে গেছে। তোমরা জমিনের বুকে আল্লাহর সাক্ষী, তোমরা জমিনের বুকে আল্লাহর সাক্ষী, তোমর জমিনের বুকে আল্লাহর সাক্ষী। (ইসলামী ফাউন্ডেশন ২০৬৮, ইসলামীক সেন্টার ২০৭৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": "949.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯০, আন্তর্জাতিক নাম্বারঃ ৯৪৯ ২০৯০-(.../...) আবূর রাবী' আয যাহরানী, ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছ দিয়ে একটা জানাযাহ অতিক্রম করল। হাদীসের অবশিষ্ট অংশ আনাস এর সূত্রে 'আবদুল আযীয এর হাদীসের অনুরূপ বর্ণনা করা হয়েছে। তবে 'আবদুল আযীয এর হাদীসটি পূর্ণাঙ্গ। (ইসলামী ফাউন্ডেশন ২০৬৯, ইসলামীক সেন্টার ২০৭৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": "950.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯১, আন্তর্জাতিক নাম্বারঃ ৯৫০ ২০৯১-(৬১/৯৫০) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ কতাদাহ ইবনু রিবাঈ (রাযিঃ) থেকে বর্ণিত। একবার রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছ দিয়ে একটা জানাযাহ বয়ে নিয়ে যাওয়া হলে তিনি বলেন, \"মুসতারীহুন\" ও “ওয়া মুসতারাহুন মিনহু” (অর্থাৎ- সে শান্তিলাভকারী এবং তার প্রস্থানে শান্তি লাভ হয়)। সাহাবীগণ জিজ্ঞেস করলেন, হে আল্লাহর রসূল! \"মুসতারীহুন” ও “ওয়া মুসতারাহুন মিনহু” এর মানে কি? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ঈমানদার বান্দা হলে এ ব্যক্তি দুনিয়ার কষ্ট মুসীবাত থেকে নিস্কৃতি লাভ করবে। আর পাপীষ্ট বান্দা হলে এ ব্যক্তি থেকে আল্লাহর বান্দারা, অত্র অঞ্চল, বৃক্ষরাজি ও পশু-পাখি সবাই পরিত্রাণ লাভ করবে। (ইসলামী ফাউন্ডেশন ২০৭০, ইসলামীক সেন্টার ২০৭৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": "950.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯২, আন্তর্জাতিক নাম্বারঃ ৯৫০ ২০৯২-(.../...) মুহাম্মাদ ইবনুল মুসান্না, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। ইয়াহইয়া ইবনু সাঈদ এর বর্ণিত হাদীসে আছে, সে ব্যক্তি দুনিয়ার ক্লেশ থেকে মুক্তি পেয়ে আল্লাহর রহমত লাভ করবে। (ইসলামী ফাউন্ডেশন ২০৭১, ইসলামীক সেন্টার ২০৭৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": "951.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৩, আন্তর্জাতিক নাম্বারঃ ৯৫১ ২০৯৩-(৬২/৯৫১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জনসাধারণকে নাজাশীর ইনতিকালের সংবাদ শুনালেন, যেদিন তিনি ইনতিকাল করেন। অতঃপর তিনি তাদেরকে নিয়ে সালাতের স্থানে গিয়ে চার তাকবীরে সালাতুল জানাযাহ আদায় করেন। (ইসলামী ফাউন্ডেশন ২০৭২, ইসলামীক সেন্টার ২০৭৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": "951.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৪, আন্তর্জাতিক নাম্বারঃ ৯৫১ ২০৯৪-(৬৩/...) 'আবদুল মালিক ইবনু শু'আয়ব ইবনুল লায়স (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবিসিনিয়ার অধিপতি নাজাশীর যে দিন মৃত্যু হয় সে দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে তার মৃত্যুর খবর দিলেন। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের ভাইয়ের জন্য ক্ষমা প্রার্থনা কর। ইবনু শিহাব (রহঃ) বলেন, সাঈদ ইবনু মুসাইয়্যিব (রহঃ) আমাকে বলেছেন যে, আবূ হুরায়রাহ (রাযিঃ) তার কাছে হাদীস বর্ণনা করেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিয়ে সালাতের স্থান কাতার করলেন। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সালাত আদায় করলেন এবং এতে (অতিরিক্ত) চার তাকবীর বললেন। (ইসলামী ফাউন্ডেশন ২০৭৩, ইসলামীক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": "951.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৫, আন্তর্জাতিক নাম্বারঃ ৯৫১ ২০৯৫-(.../...) 'আমর আন নাকিদ, হাসান আল হুলওয়ানী ও আবদ ইবনু হুমায়দ (রহঃ) ..... উভয় সূত্রেই ইবনু শিহাব (রহঃ) থেকে উকায়ল (রহঃ) এর অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০৭৪, ইসলামীক সেন্টার ২০৭৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": "952.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৬, আন্তর্জাতিক নাম্বারঃ ৯৫২ ২০৯৬-(৬৪/৯৫২) আবূ বকর ইবনু আবূ শায়বাহ (রহ) ...... জবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাজাশীর জন্য গায়েবানা জানাযাহ আদায় করেছেন এবং চার তাকবীরে সালাতুল জানাযাহ আদায় করেন। (ইসলামী ফাউন্ডেশন ২০৭৫, ইসলামীক সেন্টার ২০৭৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": "952.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৭, আন্তর্জাতিক নাম্বারঃ ৯৫২ ২০৯৭-(৬৫/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) …. জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত তিনি বলেন, (নাজাশী ইনতিকাল করলে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আজ আল্লাহর এক নেক্কার বান্দাহ ইনতিকাল করেছেন। এরপর তিনি উঠে গিয়ে আমাদের সামনে ইমাম হয়ে তার জন্য সালাতুল জানাযাহ আদায় করলেন। (ইসলামী ফাউন্ডেশন ২০৭৬, ইসলামীক সেন্টার ২০৮০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": "952.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৮, আন্তর্জাতিক নাম্বারঃ ৯৫২ ২০৯৮-(৬৬/...) মুহাম্মাদ ইবনু উবায়দ আল গুবারী, ইয়াহইয়া ইবনু আইয়ূব (রহঃ) [শব্দাবলী তার] ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নাজাশী ইনতিকাল করলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের এক ভাই ইনতিকাল করেছেন। অতএব তোমরা উঠ এবং তার জন্য সালাত আদায় কর। জাবির (রাযিঃ) বলেন, আমরা উঠে গিয়ে দু'টি সারি বাঁধলাম। (ইসলামী ফাউন্ডেশন ২০৭৭, ইসলামীক সেন্টার ২০৮১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": "953",
			"text": "হাদিস একাডেমি নাম্বারঃ ২০৯৯, আন্তর্জাতিক নাম্বারঃ ৯৫৩ ২০৯৯-(৬৭/৯৫৩) যুহায়র ইবনু হারব, আলী ইবনু হুজর, ইয়াহইয়া ইবনু আইয়ূব (রহঃ) ..... ইমরান ইবনু হুসায়ন (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ তোমাদের এক ভাই (নাজাশী) ইনতিকাল করেছেন। অতএব তোমরা উঠে তার জন্য সালাত আদায় কর। যুহায়রের বর্ণনায় \"তোমাদের ভাই\" বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২০৭৮, ইসলামীক সেন্টার ২০৮২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": "954.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০০, আন্তর্জাতিক নাম্বারঃ ৯৫৪ ২১০০-(৬৮/৯৫৪) হাসান ইবনুর রাবী' ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... শাবী' (রহঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃতকে দাফন করার পর একটা কবরের উপর জানাযার সালাত আদায় করেছেন এবং চার তাকবীর উচ্চারণ করেছেন। শায়বানী বলেন, আমি শা'বীকে জিজ্ঞেস করলাম, এটা আপনার কাছে কে বর্ণনা করেছেন? তিনি বললেন, নির্ভরযোগ্য ব্যক্তি আবদুল্লাহ ইবনু আব্বাস (রাযিঃ)। এটি হাসান এর বর্ণিত হাদীসের শব্দ। আর ইবনু নুমায়র এর বর্ণনাতে রয়েছে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটা তাজা কবরের নিকট পৌছে এর উপর সালাত আরম্ভ করলে সবাই তার পিছনে সারিবদ্ধ হ'ল। তিনি চার তাকবীর উচ্চারণ করলেন। আমি আমিরকে জিজ্ঞেস করলাম, আপনার কাছে কে বর্ণনা করেছেন? তিনি বললেন, নির্ভরযোগ্য ব্যক্তি যার কাছে ইবনু আব্বাস (রাযিঃ) এসেছিলেন। (ইসলামী ফাউন্ডেশন ২০৭৯, ইসলামীক সেন্টার ২০৮৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": "954.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০১, আন্তর্জাতিক নাম্বারঃ ৯৫৪ ২১০১-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, হাসান ইবনুর রাবী' ও আবূ কামিল, ইসহাক ইবনু ইবরাহীম, মুহাম্মাদ ইবনু হাতিম, 'উবায়দুল্লাহ ইবনু মু'আয, মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। তাদের কারো হাদীসে এ কথা উল্লেখ নেই যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জানাযায় চার তাকবীর উচ্চারণ করেছেন। (ইসলামী ফাউন্ডেশন ২০৮০, ইসলামীক সেন্টার ২০৮৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": "954.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০২, আন্তর্জাতিক নাম্বারঃ ৯৫৪ ২১০২-(৬৯/...) ইসহাক ইবনু ইবরাহীম, হারূন ইবনু আবদুল্লাহ ও আবূ গাসসান মুহাম্মাদ ইবনু আমর আর রায়ী (রহঃ) ..... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে এরং তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে কবরের উপর তার জানাযার সালাত সম্পর্কে শায়বানীর হাদীসের অনুরূপ বর্ণনা করেছেন। তাদের হাদীসে চার তাকবীরের কথা বর্ণিত হয়নি। (ইসলামী ফাউন্ডেশন ২০৮১, ইসলামীক সেন্টার ২০৮৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": "955",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৩, আন্তর্জাতিক নাম্বারঃ ৯৫৫ ২১০৩-(৭০/৯৫৫) ইবরাহীম ইবনু মুহাম্মাদ ইবনু আর'আরাহ্ আস্ সামী (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরের উপর জানাযার সালাত আদায় করেছেন। (ইসলামী ফাউন্ডেশন ২০৮২, ইসলামীক সেন্টার ২০৮৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": "956",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৪, আন্তর্জাতিক নাম্বারঃ ৯৫৬ ২১০৪-(৭১/৯৫৬) আবূর রাবী' আয যাহরানী ও আবূ কামিল ফুযায়ল ইবনু হুসায়ন আল জাহদারী (রহঃ) [শব্দগুলো আবূ কামিল এর] ... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। একটি কৃষ্ণাঙ্গ মহিলা অথবা যুবক মসজিদে নবাবীতে ঝাড়ু দিত। কিছুদিন তাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম না দেখে তার সম্বন্ধে জিজ্ঞেস করলেন। সাহাবীগণ বললেন, সে তো মারা গেছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা আমাকে খবর দিলে না কেন? বর্ণনাকারী বলেন, খুব সম্ভব তারা বিষয়টিকে গুরুত্বহীন মনে করেছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমাকে তার কবর দেখিয়ে দাও। তারা তাকে কবর দেখিয়ে দিলে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার কবরের উপর সালাতুল জানাযাহ আদায় করলেন। অতঃপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ এসব কবর অন্ধকারে পরিপূর্ণ হয়ে আছে। মহান আল্লাহ আমার সালাতের দরুন তা আলোকিত করে দিন। (ইসলামী ফাউন্ডেশন ২০৮৩, ইসলামীক সেন্টার ২০৮৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": "957",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৫, আন্তর্জাতিক নাম্বারঃ ৯৫৭ ২১০৫-(৭২/৯৫৭) আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... 'আবদুর রহমান ইবনু আবূ লায়লা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যায়দ (রাযিঃ) আমাদের জানাযাহসমূহে চারটি তাকবীর উচ্চারণ করতেন। আর তিনি কোন জানাযায় পাঁচ তাকবীরও দিয়েছেন। আমি তাকে জিজ্ঞেস করলে তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ (পাঁচবার) তাকবীর দিতেন। (ইসলামী ফাউন্ডেশন ২০৮৪, ইসলামীক সেন্টার ২০৮৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": "958.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৬, আন্তর্জাতিক নাম্বারঃ ৯৫৮ ২১০৬-(৭৩/৯৫৮) আবূ বকর ইবনু আবূ শায়বাহ, আমর আন নাকিদ, যুহায়র ইবনু হারব ও ইবনু নুমায়র (রহঃ) ..... আমির ইবনু রবী'আহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা জানাযাহ নিয়ে যেতে দেখ তখন দাঁড়িয়ে যাও। যে পর্যন্ত তা তোমাদেরকে পশ্চাতে ফেলে না যায় অথবা তা মাটিতে রেখে দেয়া না হয় (ততক্ষণ দাঁড়িয়ে থাক)। (ইসলামী ফাউন্ডেশন ২০৮৫, ইসলামীক সেন্টার ২০৮৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": "958.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৭, আন্তর্জাতিক নাম্বারঃ ৯৫৮ ২১০৭-(৭৪/...) কুতায়বাহ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমূহ, হারমালাহ্ (রহঃ) ..... সকলেই ইবনু শিহাব (রহঃ) থেকে একই সানাদে বর্ণনা করেছেন এবং ইউনুস বর্ণিত হাদীসে এরূপ বর্ণিত হয়েছে যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন- কুতায়বাহ ইবনু সাঈদ, ইবনু রুমহ (রহঃ) ..... আমর ইবনু রবী'আহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা জানাযাহ দেখতে পাও এবং তার সাথে যদি না যাও, তবে জানাযাহ এগিয়ে না যাওয়া অথবা মাটিতে না রাখা পর্যন্ত দাঁড়িয়ে থেকো। (ইসলামী ফাউন্ডেশন ২০৮৬, ইসলামীক সেন্টার ২০৯১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": "958.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৮, আন্তর্জাতিক নাম্বারঃ ৯৫৮ ২১০৮-(৭৫/...) আবূ কামিল, ইয়াকুব ইবনু ইবরাহীম, ইবনুল মুসান্না, মুহাম্মাদ ইবনু রাফি (রহঃ) ..... সকলেই নাফি (রহঃ) থেকে এ সূত্রে লায়স ইবনু সাদ এর হাদীসের অনুরূপ বর্ণনা করেছেন। ব্যতিক্রম এই যে, ইবনু জুরায়জ এর হাদীসের বর্ণনা নিম্নরূপঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন তোমাদের কেউ জানাযাহ দেখতে পায়, তখন তার দাঁড়িয়ে যাওয়া উচিত। আর সে জানাযার অনুসরণ না করে তবে তা অগ্রসর হয়ে তাকে পিছনে ফেলে যাওয়া পর্যন্ত দাঁড়িয়ে থাকা উচিত। (ইসলামী ফাউন্ডেশন ২০৮৭, ইসলামীক সেন্টার ২০৯২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": "959.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১০৯, আন্তর্জাতিক নাম্বারঃ ৯৫৯ ২১০৯-(৭৬/৯৫৯) উসমান ইবনু আবূ শায়বাহ্ (রহঃ) ..... আবূ সাঈদ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা জানাযার অনুগামী হও তখন জানাযাহ মাটিতে না রাখা পর্যন্ত বসবে না। (ইসলামী ফাউন্ডেশন ২০৮৮, ইসলামীক সেন্টার ২০৯৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": "959.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১১০, আন্তর্জাতিক নাম্বারঃ ৯৫৯ ২১১০-(৭৭/...) সুরায়জ ইবনু ইউনুস, আলী ইবনু হুজর, মুহাম্মাদ ইবনুল মুসান্না (রহঃ) [শব্দগুলো তার] ...... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা জানাযার পিছনে পিছনে চল, তখন তা মাটিতে রাখা পর্যন্ত বসে না। (ইসলামী ফাউন্ডেশন ২০৮৯, ইসলামীক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": "960.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১১১, আন্তর্জাতিক নাম্বারঃ ৯৬০ ২১১১-(৭৮/৯৬০) সুরায়জ ইবনু ইউনুস ও আলী ইবনু হুজুর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেনঃ একবার একটি লাশ নিয়ে যেতে দেখে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে গেলেন। আমরাও তার সাথে দাঁড়িয়ে গেলাম। আমরা বললাম, হে আল্লাহর রসূল! এতো এক ইয়াহুদী মেয়েলোকের লাশ। তিনি বললেন মৃত্যু একটা ভয়াবহ জিনিস। অতএব যখন তোমরা জানাযাহ (লাশ) দেখ, দাঁড়িয়ে যাও। (ইসলামী ফাউন্ডেশন ২০৯০, ইসলামীক সেন্টার ২০৯৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": "960.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১১২, আন্তর্জাতিক নাম্বারঃ ৯৬০ ২১১২-(৭৯/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ যুবায়র (রহঃ) থেকে আরও বর্ণিত হয়েছে যে, তিনি জাবির (রাযিঃ) কে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার সাহাবীগণ এক ইয়াহুদীর লাশ যেতে দেখে এবং তা চোখের আড়াল না হওয়া পর্যন্ত দাঁড়িয়ে থাকলেন। (ইসলামী ফাউন্ডেশন ২০৯২, ইসলামীক সেন্টার ২০৯৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": "960.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১১৩, আন্তর্জাতিক নাম্বারঃ ৯৬০ ২১১৩-(৮০/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবুয যুবায়র (রহঃ) থেকে আরও বর্ণিত হয়েছে যে, তিনি জাবির (রাযিঃ) কে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার সাহাবীগণ এক ইয়াহুদীর লাশ যেতে দেখে এবং তা চোখের আড়াল না হওয়া পর্যন্ত দাঁড়িয়ে থাকলেন। (ইসলামী ফাউন্ডেশন ২০৯২, ইসলামীক সেন্টার ২০৯৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": "961.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": "962.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১১৬, আন্তর্জাতিক নাম্বারঃ ৯৬২ ২১১৬-(৮২/৯৬২) কুতায়বাহ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমূহ ইবনুল মুহাজির [শব্দগুলো তার] (রহঃ) ...... ওয়াকিদ ইবনু আমর ইবনু মুআয (রহঃ) থেকে বর্ণিত। আমরা এক জানাযায় দাঁড়িয়ে ছিলাম। এমন সময় নাফি ইবনু জুবায়র আমাকে দেখতে পেলেন। তিনি তখন লাশ নীচে রাখার জন্য বসে বসে অপেক্ষা করছিলেন। তিনি আমাকে জিজ্ঞেস করলেন, তুমি এখানে দাঁড়িয়ে আছ কেন? আমি উত্তর দিলাম। লাশটি রাখার অপেক্ষায় দাঁড়িয়ে আছি। কেননা আবূ সাঈদ আল খুদরী (রাযিঃ) এর সম্পর্কে বর্ণনা করেছেন। নাফি' (রাযিঃ) এ কথা শুনে বললেন, মাসউদ ইবনু হাকাম (রহঃ) আলী ইবনু আবূ তলিব (রাযিঃ) এর সূত্রে আমাকে জানিয়েছেন। তিনি বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রথমে দাঁড়িয়েছেন পরে বসে গেছেন (এ অভ্যাস পরিত্যাগ করেছেন)। (ইসলামী ফাউন্ডেশন ২০৯৫, ইসলামীক সেন্টার ২০৯৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": "962.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": "962.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": "962.04",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": "962.05",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": "963.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৩, আন্তর্জাতিক নাম্বারঃ ৯৬৩ ২১২৩-(।../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মুআবিয়াহ ইবনু সালিহ (রহঃ) হতে উভয় সানাদে ইবনু ওয়াহব এর হাদীসের অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ২১০২, ইসলামীক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": "963.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৪, আন্তর্জাতিক নাম্বারঃ ৯৬৩ ২১২৪-(৮৬/...) নাসর ইবনু আলী আল জাহযামী ও ইসহাক ইবনু ইবরাহীম, আবুত তহির ও হারূন ইবনু সাঈদ আল আয়লী (রহঃ) [শব্দগুলো আবূ তহির-এর] ... আওফ ইবনু মালিক আল আশজাঈ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জানাযার সালাতে এভাবে দু'আ করতে শুনেছিঃ “আল্ল-হুমমাগফিরলাহু ওয়ারহামহু ওয়াফু আনহু ওয়া-আ-ফিহী ওয়া আকরিম নুযুলাহ্‌ ওয়াসসি' মুদখালাহ্‌ ওয়াগসিলহু বিমা-য়িন ওয়াসালজিন ওয়াবারাদিন ওয়ানাক্কীহী মিনাল খাতা-ইয়া- কামা- ইউনাক্কাস সাওবুল আবইরায়ু মিনাদদানাস ওয়া আবদিলহু দা-রান খায়রাম মিন দা-রিহী ওয়া আহলান খায়রাম মিন আহলিহী ওয়া যাওজান খায়রাম মিন যাওজিহী ওয়াক্বিহী ফিতনাতিল কবরি ওয়া'আযা-বিন না-র” (অর্থাৎ- \"হে আল্লাহ! তাকে ক্ষমা করে দাও ও তার প্রতি দয়া কর। তার ক্রটি মার্জন কর ও তাকে বিপদ মুক্ত কর। তার উত্তম আপ্যায়নের ব্যবস্থা কর ও তার আশ্রয়স্থলকে প্রশস্ত করে দাও। তাকে পানি, বরফ ও বৃষ্টি দিয়ে ধুয়ে মুছে দাও। তাকে পাপরাশ থেকে এভাবে পরিষ্কার করে দাও যেভাবে সাদা কাপড়কে ময়লা থেকে পরিষ্কার করা হয়। তাকে তার বর্তমান ঘরের পরিবর্তে আরও উত্তম ঘর দান কর, তার পরিবার থেকে উত্তম পরিবার দান কর, বর্তমান স্ত্রী অপেক্ষা উত্তম স্ত্রী দান কর এবং তাকে কবর আযাব ও জাহান্নামের আযাব থেকে বাচাও )। আওফ ইবনু মালিক (রাযিঃ) বলেন, ঐ মৃত ব্যক্তির প্রতি রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এরূপ দু’আ দেখে মনে আকাঙ্ক্ষা জাগল যে, আমি যদি এ মৃত ব্যক্তি হতাম। (ইসলামী ফাউন্ডেশন ২১০৩, ইসলামীক সেন্টার, ২১০৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": "964.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৫, আন্তর্জাতিক নাম্বারঃ ৯৬৪ ২১২৫-(৮৭/৯৬৪) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামিমী (রহঃ) ..... সামুরাহ ইবনু জুনদুব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে জানাযার সালাত আদায় করতাম। তিনি উম্মু কাব এর জানাযাহ আদায় করছিলেন। তিনি নিফাস অবস্থায় মারা গিয়েছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জানাযাহ আদায়কালে তার মাঝ বরাবার দাঁড়িয়েছিলেন। (ইসলামী ফাউন্ডেশন ২১০৪, ইসলামীক সেন্টার ২১০৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": "964.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৬, আন্তর্জাতিক নাম্বারঃ ৯৬৪ ২১২৬-(.../...) আবৃ বাকর ইবনু শায়বাহ, ‘আলী ইবনু হুজুর (রহঃ) ..... সকলেই হুসায়ন (রহঃ) থেকে একই সূত্রে বর্ণনা করেছেন। অবশ্য তারা উম্মু কা'ব এর কথা উল্লেখ করেননি। (ইসলামী ফাউন্ডেশন ২১০৫, ইসলামীক সেন্টার ২১০৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": "964.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৭, আন্তর্জাতিক নাম্বারঃ ৯৬৪ ২১২৭-(৮৮/...) মুহাম্মাদ ইবনুল মুসান্না ও উকবাহ ইবনু মুকরাম আল আম্মী (রহঃ) ... সামুরাহ ইবনু জুনদুব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় তরুণ বালক ছিলাম। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা মনে রাখতে পারতাম। তবে একমাত্র এ কারণে আলোচনা করতে আমার বিবেক আমাকে বাধা দিত যে, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আমার চেয়ে বয়োঃজ্যেষ্ঠ লোক উপস্থিত থাকত। আমি তার পিছনে এক মহিলার জানাযাহ আদায় করলাম। সে নিফাস অবস্থায় মারা গিয়েছিল। তার জানাযাহ আদায়কালে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দেহের মাঝ বরাবর দাঁড়িয়েছেন। ইবনুল মুসান্না-এর রিওয়ায়াতে এরূপ বর্ণিত হয়েছেঃ আমাকে আবদুল্লাহ ইবনু বুরায়দাহ (রাযিঃ) শুনিয়েছেন এবং বলেছেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার সালাত আদায়কালে তার দেহের মাঝ বরাবর দাঁড়িয়েছিলেন। (ইসলামী ফাউন্ডেশন ২১০৬, ইসলামীক সেন্টার ২১০৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": "965.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৮, আন্তর্জাতিক নাম্বারঃ ৯৬৫ ২১২৮-(৮৯/৯৬৫) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) শব্দগুলো ইয়াহইয়ার ...... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট রশিবিহীন একটি ঘোড়া হাজির করা হ'ল। তিনি ইবনু দাহদাহ এর জানাযাহ শেষ করে এর পিঠে আরোহণ করলেন। আর আমরা তার চার পাশে হেঁটে চলছিলাম। (ইসলামী ফাউন্ডেশন ২১০৭, ইসলামীক সেন্টার ২১১০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": "965.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১২৯, আন্তর্জাতিক নাম্বারঃ ৯৬৫ ২১২৯-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) [শব্দগুলো ইবনুল মুসান্না-এর] ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ইবনু দাহদাহ (মারা গেলে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জানাযাহ আদায় করলেন। এরপর তার কাছে একটা লাগামবিহীন ঘোড়া হাজির করা হল। জনৈক ব্যক্তি তা রশি দিয়ে বাঁধল। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এর পিঠে আরোহণ করলেন। ঘোড়াটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নিয়ে লাফিয়ে চলতে লাগল। আর আমরা তার পিছনে দৌড়িয়ে অনুসরণ করলাম। জাবির বলেন, অতঃপর কাফিলার মধ্যে জনৈক ব্যক্তি বলল, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বহু সংখ্যক খেজুরের ছড়া ইবনু দাহদাহ এর জন্য জান্নাতে ঝুলে রয়েছে। শু'বাহ-এর বর্ণনায় 'আবূ দাহদাহ' উল্লেখ আছে। (ইসলামী ফাউন্ডেশন ২১০৮, ইসলামীক সেন্টার ২১১১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": "966",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩০, আন্তর্জাতিক নাম্বারঃ ৯৬৬ ২১৩০-(৯০/৯৬৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আমির ইবনু সা’দ ইবনু আবূ ওয়াক্কাস (রহঃ) থেকে বর্ণিত। সা'দ ইবনু আবূ ওয়াক্কাস (রাঃ) তার মৃত্যুকালীন পীড়ার সময় বলেছেন, তোমরা আমার জন্য একটা কবর ঠিক করে রাখ এবং আমার কবরের উপর এভাবে ইট স্থাপন কর যেভাবে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কবরে করা হয়েছে। (ইসলামী ফাউন্ডেশন ২১০৯, ইসলামীক সেন্টার ২১১২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": "967",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩১, আন্তর্জাতিক নাম্বারঃ ৯৬৭ ২১৩১-(৯১/৯৬৭) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনুল মুসান্না (রহঃ) শব্দাবলী তার ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কবরের লাল বর্ণের একটা চাদর বিছিয়ে দেয়া হয়েছে। ইমাম মুসলিম বলেন, আবূ জামারাহ-এর নাম হচ্ছে নাসর ইবনু ইমরান ও আবূ তায়ইয়্যাহ এর প্রকৃত নাম ইয়ায়ীদ ইবনু হুমায়দ উভয়ে 'সারাখ্‌স' এ ইনতিকাল করেছেন। (ইসলামী ফাউন্ডেশন ২১১০, ইসলামীক সেন্টার ২১১৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": "968",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩২, আন্তর্জাতিক নাম্বারঃ ৯৬৮ ২১৩২-(৯২/৯৬৮) আবুত তহির আহমাদ ইবনু আমর ও হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... সুমামাহ ইবনু শুফাই (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমরা একবার রোম সাম্রাজ্যের রূদিস নামক উপদ্বীপে ফুযালাহ ইবনু উবায়দ এর সঙ্গে ছিলাম। আমাদের একজন সঙ্গী মারা গেলে ফুযালাহ তাকে কবরস্থ করতে আদেশ দিলেন। অতঃপর তার কবরকে সমান করে তৈরি করা হল। অতঃপর তিনি বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কবরকে সমতল করে তৈরি করতে আদেশ করেছেন। (ইসলামী ফাউন্ডেশন ২১১১, ইসলামীক সেন্টার ২১১৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": "969.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": "970.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩৫, আন্তর্জাতিক নাম্বারঃ ৯৭০ ২১৩৫-(৯৪/৯৭০) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবর পাকা করতে, কবরের উপর বসতে ও কবরের উপর গৃহ নিৰ্মাণ করতে নিষেধ করেছেন। (ইসলামী ফাউন্ডেশন ২১১৪, ইসলামীক সেন্টার ২১১৭) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, কবরকে পাকা করা, তার উপরে প্রাসাদ প্রস্তুত করা অথবা গুম্বজ বা মিনার ও কক্ষ কিংবা মসজিদ ইত্যাদি নির্মাণ করা হারাম ও অবৈধ। কেননা মৃত ব্যক্তি এই সব জিনিসের দ্বারা উপকৃত হবে না এবং এই সব জিনিসের তার কোনো প্রয়োজনও নেই। ২। এই হাদীসটির মধ্যে পাকা প্রাসাদ বা বাড়ি এবং ঘর নির্মাণ করার উপকরণের দ্বারা কবর পাকা করার কথাটি উল্লিখিত হয়েছে। যাকে (اَلْجَصُّ) বলা হয়। এর দ্বারা ঘর প্রাসাদ বা বাড়ি ও পাথর সুন্দর করা হয়। তাই কবরকে এই সব জিনিসের দ্বারা সুন্দর করলে, সাধারণ মানুষের জন্য এই ধরণের পাকা কবর আকর্ষণীয় স্থানে পরিণত হবে। এবং সাধারণ লোকজন মনে করবে যে, এই ধরণের কবরগুলির কোনো আলাদা বৈশিষ্ট্য রয়েছে; সুতরাং এই ধরণের কবরগুলিকে নিয়ে তারা অতিরঞ্জিত করবে অথবা সেখানে এমন কতকগুলি কাজ করবে, যেই কাজগুলি করা প্রকৃত ইসলাম ধর্মে জায়েজ নয়। আবার এটাও জেনে রাখা দরকার যে, কবরকে পাকা করা, তার উপরে প্রাসাদ প্রস্তুত করা অথবা গুম্বজ বা মিনার ও কক্ষ কিংবা মসজিদ ইত্যাদি নির্মাণ করার কারণে কবরের কাছে প্রকৃত ইসলামের বিপরীত ও সীমালঙ্ঘনের কাজ হয়। এবং মহান আল্লাহর সাথে অংশীদার স্থাপন করার উপাদান নির্ধারণ করা হয়। তাই এই হাদীসে কবরকে পাকা করতে নিষেধ করা হয়েছে। ৩। এই হাদীসটির দ্বারা এটা প্রতিমান হয় যে, কবরের উপরে বসা, হেলান দেওয়া এবং ভর দেওয়া একটি হারাম কাজ। কেননা এর দ্বারা সমাহিত বা দাফনকৃত ব্যক্তির সম্মান নষ্ট করা হয়। তাই যেমন সমাহিত ব্যক্তির সম্মান রক্ষা করা উচিত, তেমনি তার কবরেরও সম্মান রক্ষা করা উচিত।",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": "970.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩৬, আন্তর্জাতিক নাম্বারঃ ৯৭০ ২১৩৬-(.../...) হারূন ইবনু আবদুল্লাহ, মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ যুবায়র (রহঃ) জানিয়েছেন যে, তিনি জাবির ইবনু আবদুল্লাহকে বলতে শুনেছেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি ... উপরের হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ২১১৫, ইসলামীক সেন্টার ২১১৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": "970.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩৭, আন্তর্জাতিক নাম্বারঃ ৯৭০ ২১৩৭-(৯৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবর পাকা করতে নিষেধ করেছেন। (ইসলামী ফাউন্ডেশন ২১১৬, ইসলামীক সেন্টার ২১১৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": "971.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩৮, আন্তর্জাতিক নাম্বারঃ ৯৭১ ২১৩৮-(৯৬/৯৭১) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো জলন্ত অঙ্গারের উপর বসে থাকা এবং তাতে তার কাপড় পুড়ে গিয়ে শরীরের চামড়া দগ্ধীভূত হওয়া কবরের উপর বসার চেয়ে উত্তম। (ইসলামী ফাউন্ডেশন ২১১৭, ইসলামীক সেন্টার ২১২০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": "971.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৩৯, আন্তর্জাতিক নাম্বারঃ ৯৭১ ২১৩৯-(.../...) কুতায়বাহ ইবনু সাঈদ, আমর আন নাকিদ (রহঃ) ..... উভয়েই সুহায়ল (রহঃ) থেকে একই সানাদে অনুরূপ বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ২১১৮, ইসলামীক সেন্টার ২১২১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": "972.01",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": "972.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": "973.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪২, আন্তর্জাতিক নাম্বারঃ ৯৭৩ ২১৪২-(৯৯/৯৭৩) আলী ইবনু হুজুর আস সা'দী ও ইসহাক ইবনু ইবরাহীম আল হান্‌যালী (রহঃ) [শব্দাবলী ইসহাক-এর] ..... আব্বাস ইবনু আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) থেকে বর্ণিত। ‘আয়িশাহ (রাযিঃ) সা'দ ইবনু আবূ ওয়াক্কাস এর লাশ মসজিদে নিয়ে আসতে ও মসজিদের ভিতরে জানাযার সালাত আদায় করতে নির্দেশ দিলেন। উপস্থিত লোকেরা তার আদেশ পালনে অসম্মতি প্রকাশ করল। তিনি বললেন, লোকেরা এত তাড়াতাড়ি ভুলে গেল! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সুহায়ল ইবনু বায়যা এর জানাযার সালাত মসজিদেই আদায় করেছিলেন। (ইসলামী ফাউন্ডেশন ২১২১, ইসলামীক সেন্টার ২১২৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": "973.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৩, আন্তর্জাতিক নাম্বারঃ ৯৭৩ ২১৪৩-(১০০/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। যখন সা'দ ইবনু আব ওয়াক্কাস (রাযিঃ) ইনতিকাল করলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রীগণ তার লাশ মসজিদে নিয়ে আসার জন্য বলে পাঠালেন যাতে তারাও তার জানাযাহ আদায় করতে পারেন। উপস্থিত লোকেরা তাই করল। তাকে উম্মাহাতুল মু'মিনীনদের ঘরের সামনে রাখা হল এবং তারা তার জানাযার সালাত আদায় করলেন। অতঃপর তাকে বাবুল জানায়িয (জানাযাহ বের করার দরজা) দিয়ে যা মাকাইদ এর দিকে ছিল, বের করা হল। লোকেরা এ খবর জানতে পেয়ে বলল, কি ব্যাপার! জানাযাহ মসজিদে ঢুকানো হয়েছে? আয়িশাহ (রাযিঃ) এর নিকট এ সংবাদ পৌছলে তিনি বললেন, লোকেরা কেন এত শীঘ্র সমালোচনায় প্রবৃত্ত হল, যে সম্পর্কে তাদের কোন জ্ঞান নেই? মসজিদে জানাযাহ নিয়ে যাওয়ার ব্যাপারে লোকেরা সমালোচনা করল, অথচ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সুহায়ল ইবনু বায়যা এর সালাতে জানাযাহ মসজিদের ভিতরেই আদায় করেছেন। ইমাম মুসলিম বলেন, সুহায়ল বিন ওয়াদা বায়যা এর পুত্র। তার মায়ের নাম বায়যা। (ইসলামী ফাউন্ডেশন ২১২২, ইসলামীক সেন্টার ২১২৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": "973.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৪, আন্তর্জাতিক নাম্বারঃ ৯৭৩ ২১৪৪-(১০১/...) হারূন ইবনু আবদুল্লাহ ও মুহাম্মাদ ইবনু রাফি' (রহঃ) [শব্দগুলো রাফি'] ..... আবু সালামাহ ইবনু আবদুর রহমান (রহঃ) থেকে বর্ণিত। যখন সা'দ ইবনু আবূ ওয়াক্কাস ইনতিকাল করলেন আয়িশাহ (রাযিঃ) বললেন, তোমরা তার লাশ নিয়ে মসজিদে প্রবেশ কর। আমি তার জানাযাহ পড়ব। তখন লোকেরা অস্বীকৃতি জানালে তিনি বললেন, আল্লাহর কসম! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়যা এর দু' ছেলে সুহায়ল ও তার ভাইয়ের (সাহল এর) জানাযার সালাত মসজিদেই আদায় করেছেন। (ইসলামী ফাউন্ডেশন ২১২৩, ইসলামীক সেন্টার ২১২৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": "974.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৫, আন্তর্জাতিক নাম্বারঃ ৯৭৪ ২১৪৫-(১০২/৯৭৪) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামিমী, ইয়াহইয়া ইবনু আইয়ুব ও কুতায়বাহ ইবনু সাঈদ (রহঃ) .... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অভ্যাস ছিল, যেদিন তার কাছে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রাত্রি যাপনের পালা আসত, তিনি শেষ রাত্রে উঠে (বাকী কবরস্থানে) চলে যেতেন এবং এভাবে দু'আ করতেনঃ \"আসসালা-মু আলায়কুম দা-রা কাওমিন মু'মিনীনা ওয়া আতা-কুম মা ত'আদূনা গদান মুআজজালুনা ওয়া ইন্না- ইনশা-আল্ল-হু বিকুম লা-হিকূন আল্ল-হুমমাগফিরলি আহলি বাকীউল গরকাদ” (অর্থাৎ- তোমাদের ওপর সালাম ও শান্তি বর্ষিত হোক, ওহে ঈমানদার কবরবাসীগণ! তোমাদের কাছে পরকালে নির্ধারিত যেসব বিষয়ের প্রতিশ্রুতি দেয়া হয়েছিল তা তোমাদের নিকট এসে গেছে। আল্লাহর ইচ্ছায় আমরাও তোমাদের সাথে মিলিত হব। হে আল্লাহ! বাকী গারকদি কবরবাসীদেরকে ক্ষমা করে দাও।)। কিন্তু কুতায়বাহ-এর বর্ণনায় \"তোমাদেরকে দেয়া হয়েছে\" কথাটি নেই। (ইসলামী ফাউন্ডেশন ২১২৪, ইসলামীক সেন্টার ২১২৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৬, আন্তর্জাতিক নাম্বারঃ ৯৭৪ ২১৪৬-(১০৩/...) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... মুহাম্মাদ ইবনু কায়স (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে বলতে শুনেছি- তিনি বলেন, আমি কি তোমাদেরকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ও আমার তরফ থেকে হাদীস বর্ণনা করে শোনাব না? আমরা বললাম, অবশ্যই! ইমাম মুসলিম (রহঃ) হাজ্জাজ আল আ'ওয়ার (রহঃ) থেকে শুনেছেন ..... জনৈক কুরায়শী আবদুল্লাহ (রহঃ) থেকে মুহাম্মাদ ইবনু কায়স ইবনু মাখরামাহ ইবনুল মুত্ত্বালিব (রহঃ) একদিন আমাকে বলেন, আমি কি তোমাদেরকে আমার পক্ষ থেকে ও আমার আমার আম্মাজান থেকে হাদীস বর্ণনা করে শুনাব? রাবী আবদুল্লাহ বলেন, আমরা ধারণা করলাম তিনি তার জননী মাকে বুঝাচ্ছেন। এরপর তিনি বললেন, \"আয়িশাহ (রাযিঃ) বলেছেন, আমি কি তোমাদের আমার পক্ষ থেকে ও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণনা করে শুনাব? আমরা বললাম, হ্যাঁ অবশ্যই। তিনি বলেন, যখন ঐ রাত আসত যে রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে থাকতেন। তিনি এসে তার চাদর রেখে দিতেন, জুতা খুলে পায়ের কাছে রাখতেন। পরে নিজ তহবন্দের (লুঙ্গি) একদিক বিছানায় বিছিয়ে কাত হয়ে শুয়ে পড়তেন। অতঃপর মাত্র কিছু সময় যতক্ষণে তিনি ধারণা করতেন যে, আমি ঘুমিয়ে পড়েছি, বিশ্রাম গ্রহণ করতেন। অতঃপর উঠে ধীরে ধীরে নিজ চাদর নিতেন এবং জুতা পরিধান করতেন। পরে আস্তে আস্তে দরজা খুলে বেরিয়ে পড়তেন। অতঃপর কিছু সময় নিজেকে আত্মগোপন করে রাখতেন। একদিন আমি আমার জামা মাথার উপর স্থাপন করে তা দিয়ে মাথাটা ঢেকে লুঙ্গি পরিধান করে, অতঃপর তার পেছনে রওয়ানা হলাম। যেতে যেতে তিনি বাকী’তে\" (কবরস্থানে) পৌছলেন। তথায় তিনি দীর্ঘ সময় দাঁড়িয়ে থাকলেন। অতঃপর তিনি তিনবার হাত উঠিয়ে দু'আ করলেন। এবার গৃহের দিকে ফিরে রওয়ানা করলে আমিও রওয়ানা হলাম। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) দ্রুত রওয়ানা করলে আমিও দ্রুত চলতে লাগলাম। তাকে আরও দ্রুত পদক্ষেপে এগিয়ে আসতে দেখে আমি আরও দ্রুত চলতে লাগলাম। এরপর আমরা দৌড়াতে আরম্ভ করলে আমি দৌড়ে তার আগেই ঘরে ঢুকে পড়লাম এবং বিলম্ব না করে শুয়ে পড়লাম। একটু পরে তিনি গৃহে প্রবেশ করে আমাকে জিজ্ঞেস করলেন, হে আয়িশাহ! তোমার কি হল? কেন হাপিয়ে পড়েছ? আয়িশাহ (রাযিঃ) বলেন, আমি জবাব দিলাম না, তেমন কিছু না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হয় তুমি নিজে আমাকে ব্যাপারটা খুলে বলবে নতুবা মহান আল্লাহ আমাকে তা জানিয়ে দিবেন। আমি বললাম, হে আল্লাহর রসূল! আপনার ওপর আমার মাতা-পিতা কুরবান হোক। এরপর তাকে ব্যাপারটা জানিয়ে দিলাম। তিনি বললেন, তুমিই সে কালো ছায়াটি যা আমি আমার সামনে দেখছিলাম। আমি বললামঃ জী হ্যাঁ। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমার বুকে একটা থাপ্পড় মারলেন যাতে আমি ব্যথা পেলাম। অতঃপর বললেন, তুমি কি ধারণা করেছ আল্লাহ ও তার রসূল তোমার ওপর অবিচার করবেন? আয়িশাহ (রাযিঃ) বলেন, যখনই মানুষ কোন কিছু গোপন করে, আল্লাহ তা অবশ্যই জানেন। হ্যাঁ অবশ্যই জানেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন তুমি আমাকে দেখেছ এ সময় আমার কাছে জিবরীল (আঃ) এসেছিলেন এবং আমাকে ডাকছিলেন। অবশ্য তা তোমার কাছে গোপন রাখা হয়েছে। আর আমিও তা গোপন রাখা বাঞ্ছনীয় মনে করে তোমার নিকট গোপন রেখেছি। যেহেতু তুমি তোমার কাপড় রেখে দিয়েছ, তাই তিনি তোমার কাছে আসেননি। আমি ভেবেছিলাম তুমি ঘুমিয়ে পড়েছ তাই তোমাকে জাগানো সমীচীন মনে করিনি। আর আমি আশঙ্কা করছিলাম যে, তুমি ভীত বিহ্বল হয়ে পড়বে। এরপর জিবরীল (আঃ) বললেন, আপনার প্রভু আপনার প্রতি আদেশ করছেন, বাকী'র কবরবাসীদের নিকট গিয়ে তাদের জন্য দু'আ ইসতিগফার করতে। আয়িশাহ (রাযিঃ) বলেন, আমি জিজ্ঞেস করলাম, হে আল্লাহর রসূল! আমি তাদের জন্য কীভাবে দু'আ করব? তিনি বললেনঃ তুমি বল, \"এ বাসস্থানের অধিবাসী ঈমানদার মুসলিমদের প্রতি সালাম বর্ষিত হোক। আমাদের মধ্য থেকে যারা আগে বিদায় গ্রহণ করেছে আর যারা পিছনে বিদায় নিয়েছে সবার প্রতি আল্লাহ দয়া করুন। আল্লাহ চাহে তো আমরাও তোমাদের সাথে মিলিত হব*। (ইসলামী ফাউন্ডেশন, ২১২৫, ইসলামীক সেন্টার ২১২৮) * বাকী হচ্ছে মদীনার নিকটবর্তী একটি কবরস্থান যেখানে অনেক সাহাবীর কবর রয়েছে। রয়েছে অনেক কাফরের ও সাধারণ মুসলিমের কবর। আমাদের দেশে এটি জান্নাতুল বাকী' নামে পরিচিত। কিন্তু আসলে এটি একটি ভুল কারণ, এটির আসল নাম হচ্ছে বাকী'উল গারকাদ। জান্নাতুল বাকী বলা ঠিক নয়।",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": "975",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৭, আন্তর্জাতিক নাম্বারঃ ৯৭৫ ২১৪৭-(১০৪/৯৭৫) আবূ বকর ইবনু আবূ শায়বাহ ও যুবায়র ইবনু হারব (রহঃ) ..... সুলায়মান ইবনু বুরায়দাহ (রহঃ) তার পিতা [বুরায়দাহ ইবনু হুসায়ব ইবনু আবদুল্লাহ (রাযিঃ)] থেকে বর্ণনা করেন। তিনি বলেন, তারা যখন কবরস্থানে যেতেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে দু'আ শিখিয়ে দিতেন। অতঃপর তাদের মধ্যে কোন ব্যক্তি আবূ বাকর এর বর্ণনানুযায়ী বলত \"আসসালা-মু আলা- আহলিদ দিয়া-র” (অর্থাৎ- কবরবাসীদের প্রতি আল্লাহর শান্তি বর্ষিত হোক।)। আর যুহায়র-এর বর্ণনায় আছেঃ \"আসসালা-মু আলায়কুম আহলাদ দিয়া-র মিনাল মুমিনীনা ওয়াল মুসলিমীনা ওয়া ইন্না- ইনশা-আল্ল-হু লালা-হিকূনা আসআলুল্ল-হা লানা- ওয়ালাকুমুল আ-ফিয়াহু\" (অর্থাৎ- হে কবরবাসী ঈমানদার মুসলিমগণ! তোমাদের প্রতি সালাম। আল্লাহ চাহে তো আমরাও তোমাদের সাথে মিলিত হব। আমি আমাদের ও তোমাদের জন্য আল্লাহর নিকট নিরাপত্তার আবেদন জানাচ্ছি।)। (ইসলামী ফাউন্ডেশন ২১২৬, ইসলামীক সেন্টার ২১২৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": "976.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৮, আন্তর্জাতিক নাম্বারঃ ৯৭৬ ২১৪৮-(১০৫/৯৭৬) ইয়াহইয়া ইবনু আইয়ূব ও মুহাম্মাদ ইবনু আব্বাদ (রহঃ) [শব্দাবলী ইয়াহইয়া-এর] ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি আমার প্রভুর নিকট আমার মায়ের জন্য ইস্তিগফার (ক্ষমা প্রার্থনা) করার অনুমতি চাইলে আমার প্রভু আমাকে অনুমতি দান করেননি। আর তার কবর যিয়ারাত করার অনুমতি চাইলে তিনি আমাকে অনুমতি দিলেন। (ইসলামী ফাউন্ডেশন ২১২৭, ইসলামীক সেন্টার ২১৩০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": "976.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৪৯, আন্তর্জাতিক নাম্বারঃ ৯৭৬ ২১৪৯-(১০৮/...) আবূ বকর ইবনু আবূ শায়বাহ ও যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মায়ের কবর যিয়ারাত করতে গেলেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কাঁদলেন এবং আশেপাশের সবাইকে কাঁদালেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, আমি আমার প্রভুর নিকট মায়ের জন্য ইস্তিগফারের অনুমতি চাইলাম। কিন্তু আমাকে অনুমতি দেয়া হল না। আমি তার কবর যিয়ারাত করার জন্য অনুমতি চাইলে আমাকে অনুমতি দেয়া হ'ল। অতএব তোমরা কবর যিয়ারাত কর। কেননা কবর যিয়ারাত তোমাদেরকে মৃত্যুর কথা স্মরণ করিয়ে দেয়। (ইসলামী ফাউন্ডেশন ২১২৮, ইসলামীক সেন্টার ২১৩১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": "977.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৫০, আন্তর্জাতিক নাম্বারঃ ৯৭৭ ২১৫০-(১০৬/৯৭৭) আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) [শব্দগুলোর আবূ বাকর ও ইবনু নুমায়র এর] ... ইবনু বুরায়দাহ (রহঃ) তার পিতা থেকে বর্ণনা করেন। তিনি বুরায়দাহ ইবনু হুসায়ব ইবনু আবদুল্লাহ (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি তোমাদেরকে কবর বিয়ারাত করতে নিষেধ করতাম। (এখন অনুমতি দিচ্ছি) তোমরা কবর যিয়ারাত করতে পার। আমি ইতোপূর্বে তিনদিনের বেশী কুরবানী গোশত রাখার ব্যাপারে তোমাদেরকে নিষেধ করতাম। এখন তোমাদের যতদিন ইচ্ছা রাখতে পার। এছাড়া আমি তোমাদেরকে পানির পাত্রে নবীয তৈরি করতে নিষেধ করেছিলাম, এখন তোমরা যে কোন পানির পাত্রে তা তৈরি করতে পার। তবে নেশার বস্তু (মাদকদ্রব্য) পান করো না। (ইসলামী ফাউন্ডেশন ২১২৯, ইসলামীক সেন্টার ২১৩২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": "977.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৫১, আন্তর্জাতিক নাম্বারঃ ৯৭৭ ২১৫১-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ, ইবনু আবু উমার, মুহাম্মাদ রাফি ও আবদ ইবনু হুমায়দ (রহঃ) ..... 'আবদুল্লাহ ইবনু বুরায়দাহ (রহঃ) তার পিতা থেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে বর্ণনা করেছেন। তারা সবাই এ হাদীস আবূ সিনান এর বর্ণিত হাদীসের অনুরূপ অর্থে বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ২১৩০, ইসলামীক সেন্টার, ২১৩৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": "978",
			"text": "হাদিস একাডেমি নাম্বারঃ ২১৫২, আন্তর্জাতিক নাম্বারঃ ৯৭৮ ২১৫২-(১০৭/৯৭৮) আওন ইবনু সাল্লাম আল কূফী (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট জনৈক ব্যক্তির লাশ উপস্থিত করা হল। সে চ্যাপ্টা তীরের আঘাতে আত্মহত্যা করেছে। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জানাযার সালাত আদায় করেননি। (ইসলামী ফাউন্ডেশন ২১৩১, ইসলামীক সেন্টার ২১৩৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		}
	]
}