{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2495,
			"arabicnumber": "1079.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৮৫, আন্তর্জাতিক নাম্বারঃ ১০৭৯ ২৩৮৫-(১/১০৭৯) ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ও ইবনু হুজুর (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযান মাস আসলে জান্নাতের দরজাসমূহ উন্মুক্ত করে দেয়া হয়। জাহান্নামের দরজাসমূহ বন্ধ করে দেয়া হয় এবং শাইতানগুলোকে শিকলে বন্দী করা হয়। (ইসলামিক ফাউন্ডেশন ২৩৬২, ইসলামীক সেন্টার ২৩৬৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": "1079.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৮৬, আন্তর্জাতিক নাম্বারঃ ১০৭৯ ২৩৮৬-(২/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযান মাস উপস্থিত হলে রহমতের দরজাসমূহ উন্মুক্ত করে দেয়া হয়, জাহান্নামের দরজাসমূহ বন্ধ করে দেয়া হয় এবং শাইতানগুলোকে শিকলে আবদ্ধ করা হয়। (ইসলামিক ফাউন্ডেশন ২৩৬৩, ইসলামীক সেন্টার ২৩৬৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": "1079.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৮৭, আন্তর্জাতিক নাম্বারঃ ১০৭৯ ২৩৮৭-(.../...) মুহাম্মাদ ইবনু হাতিম ও আল হুলওয়ানী (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন রমযান মাস আসে ..... এরপর তিনি অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৩৬৪, ইসলামীক সেন্টার ২৩৬৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": "1080.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৮৮, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৮৮-(৩/১০৮০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাস প্রসঙ্গে আলোচনা করলেন। তিনি বললেন, তোমরা (রমাযানের) চাঁদ না দেখে রোযা শুরু করবে না এবং চাঁদ (শাওওয়াল মাসের চাঁদ) না দেখা পর্যন্ত ইফতারও করো না। আর আকাশ মেঘাচ্ছন্ন থাকলে ত্রিশদিন পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৬৫, ইসলামীক সেন্টার ২৩৬৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": "1080.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৮৯, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৮৯-(৪/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান সম্পর্কে আলোচনা করলেন। তিনি এক হাতের উপর অন্য হাত মেরে (ইঙ্গিত করে) বললেন, মাস এ রকম, এ রকম এবং তৃতীয়বারে বুড়ো আঙ্গুলটি বন্ধ করে হাত মারলেন (অর্থাৎ মাস উনত্রিশ দিনে)। তিনি পুনরায় বললেন, তোমরা চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন কর এবং চাঁদ দেখে ইফত্বার কর (অর্থাৎ ঈদ কর)। আর যদি আকাশ মেঘে ঢাকা থাকে তাহলে মাসের ত্রিশ দিন পূর্ণ কর।* (ইসলামিক ফাউন্ডেশন ২৩৬৬, ইসলামীক সেন্টার ২৩৬৭) * অর্থাৎ ২৯ শে শাবান ঝড় বৃষ্টির কারণে চাঁদ না দেখা যায় তবে শা'বান মাস ত্রিশ পূর্ণ করে পরের দিন থেকে সওম পালন শুরু করবে। অনুরূপভাবে ২৯শে রমযানে আকাশ মেঘলা থাকার ফলে চন্দ্র না দৃষ্টিগোচর হয় তবে রমযান ৩০ পূর্ণ করে পরের দিন ঈদুল ফিতর উদযাপন করবে। অধিকাংশ মুহাদ্দিস এ হাদীসের এই অর্থ করেছেন এবং অন্যান্য হাদীস ও বর্ণনা এ অর্থের পৃষ্ঠপোষকতা করে।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": "1080.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯০, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯০-(৫/...) ইবনু নুমায়র (রহঃ) ... উবায়দুল্লাহ থেকে এ সূত্রেও আবূ উসামাহ বর্ণিত হাদীসের অনুরূপ বর্ণিত হয়েছে। এতে আছেঃ মাস এরূপ, এরূপ এবং এরূপ। তিনি আরো বলেন, যদি আকাশ মেঘাচ্ছন্ন থাকে তাহলে ত্রিশদিন পূর্ণ কর। হাদীসটি আবূ উসামাহ্ কর্তৃক বর্ণিত হাদীসের অনুরূপ। (ইসলামিক ফাউন্ডেশন ২৩৬৭, ইসলামীক সেন্টার ২৩৬৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": "1080.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯১, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯১-(.../...) উবায়দুল্লাহ ইবনু সাঈদ (রহঃ) ..... উবায়দুল্লাহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযান মাসের কথা আলোচনা করে বললেন, মাস উনত্রিশ দিনেও হয়। এ সময় তিনি তার হস্তদ্বয়ের আঙ্গুল দ্বারা ইঙ্গিত করে বললেন, মাস এতো দিনে হয়, মাস এতো দিনে হয়। তারপর বললেন, তোমরা পূর্ণ কর। কিন্তু ত্রিশ দিনের কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৩৬৮, ইসলামীক সেন্টার ২৩৬৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": "1080.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯২, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯২-(৬/...) যুহায়র ইবনু হারব (রহঃ) ..... উবায়দুল্লাহ (রহঃ) থেকে এ সূত্রেও উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাস সম্পর্কে আলোচনা প্রসঙ্গে বলেনঃ মাস (কোন কোন সময়) উনত্রিশ দিনেও হয়ে থাকে। মাস এরূপ, এরূপ এবং এরূপ। তিনি পুনরায় বলেন, মাস গণনা কর। কিন্তু তিনি ত্রিশ দিনের কথা বলেননি। (ইসলামিক ফাউন্ডেশন ২৩৬৯, ইসলামীক সেন্টার ২৩৭০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": "1080.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৩, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৩-(৭/...) হুমায়দ ইবনু মাস আদাহ্ আল বাহিলী (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাধারণত মাস উনত্রিশ দিনে হয়ে থাকে। তাই (রমাযানের) চাঁদ না দেখে সিয়াম (রোজা/রোযা) পালন করো না এবং ইফতারও করো না। আর আকাশ মেঘে ঢাকা থাকলে মাসের ত্রিশদিন পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৭০, ইসলামীক সেন্টার ২৩৭১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": "1080.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৪, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৪-(৮/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাস উনত্রিশ দিনে হয়ে থাকে। তাই তোমরা নতুন চাঁদ দেখে সিয়াম (রোজা/রোযা) রাখা শুরু কর এবং নতুন চাঁদ (শাওয়ালের চাঁদ) দেখে ইফত্বার কর (ঈদ কর)। আর আকাশ মেঘে ঢাকা থাকলে মাসের ত্রিশ দিন পূর্ণ কর।” (ইসলামিক ফাউন্ডেশন ২৩৭১, ইসলামীক সেন্টার ২৩৭২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": "1080.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৫, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৫-(৯/...) ইয়াহইয়া ইবনু ইয়াহইয়া, ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ইবনু সাঈদ ও ইবনু হুজুর (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তোমরা চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন কর (রাখা শুরু কর) এবং চাঁদ দেখে ইফত্বার কর। আর যদি আকাশ মেঘাচ্ছন্ন থাকে তাহলে ত্রিশ দিনে মাস পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৭২, ইসলামীক সেন্টার ২৩৭৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": "1080.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৬, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৬-(১০/...) হারূন ইবনু আবদুল্লাহ (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ এত দিনে, এত দিনে এবং এত দিনে মাস হয়। তৃতীয়বার তিনি তার বৃদ্ধাঙ্গুলটি বন্ধ করে রাখলেন। (ইসলামিক ফাউন্ডেশন ২৩৭৩, ইসলামীক সেন্টার ২৩৭৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": "1080.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৭, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৭-(১১/...) হাজ্জাজ ইবনু শাইর (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, উনত্রিশ দিনেও মাস (পূর্ণ) হয়। (ইসলামিক ফাউন্ডেশন ২৩৭৪, ইসলামীক সেন্টার ২৩৭৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": "1080.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৮, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৮-(১২/...) সাহল ইবনু উসমান (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, মাস এত দিনে, এত দিনে ও এত দিনে হয়ে থাকে। এ সময় তিনি প্রথমে দশ আঙ্গুলে, দ্বিতীয়বার দশ আঙ্গুলে এবং তৃতীয়বার নয় আঙ্গুল দ্বারা ইশারা করলেন। (ইসলামিক ফাউন্ডেশন ২৩৭৫, ইসলামীক সেন্টার ২৩৭৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": "1080.12",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৩৯৯, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৩৯৯-(১৩/...) উবায়দুল্লাহ ইবনু মুআয (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এত এত এবং এত দিনেও মাস হয়। তিনি দু'বার হাত মেরে তার সব আঙ্গুলগুলো খুলে ধরলেন এবং তৃতীয়বার তিনি বাম অথবা ডান হাতের বৃদ্ধাঙ্গুলটি বন্ধ করে রাখলেন (অর্থাৎ ইঙ্গিত করে দেখালেন, কোন কোন মাস উনত্রিশ দিনে হয়)। (ইসলামিক ফাউন্ডেশন ২৩৭৬, ইসলামীক সেন্টার ২৩৭৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": "1080.13",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০০, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৪০০-(১৪/...) মুহাম্মাদ ইবনুল মুসন্না (রহঃ) ..... উকবাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে বলতে শুনেছি, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উনত্রিশ দিনেও মাস হয়। শু'বাহ এ হাদীস বর্ণনা করার সময় তার দু হাত তিনবার বন্ধ করে দেখালেন এবং তৃতীয়বার তার বুড়ো আঙ্গুলটি বাঁকা (নীচু) করে রাখলেন। উকবাহ (রাযিঃ) বলেন, আমার মনে হয় তিনি বলেছিলেন, মাস ত্রিশ দিনেও হয় এবং দু' হাত তিনবার বন্ধ করেছিলেন। (ইসলামিক ফাউন্ডেশন ২৩৭৭, ইসলামীক সেন্টার ২৩৭৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": "1080.14",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০১, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৪০১-(১৫/...) আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনুল মুসান্না, ইবনু বাশশার (রহঃ) ..... সাঈদ ইবনু আমর ইবনু সাঈদ (রাযিঃ) থেকে বর্ণিত। তিনি ইবনু উমারকে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা উম্মী (নিরক্ষর) জাতি। আমরা লেখিনা এবং হিসাবও করি না। মাসে দিনের সংখ্যা এত, এত এবং এত। তৃতীয়বারে তিনি নিজ হাতের বুড়ো আঙ্গুলটি বন্ধ করে দু' হাত দিয়ে ইঙ্গিত করলেন (অর্থাৎ তিনবার ইঙ্গিতে উনত্রিশ দিন প্রমাণ করলেন)। আর কোন কোন মাস এত, এত এবং এত দিনেও হয় (অর্থাৎ পূর্ণ ত্রিশ দিন হয়ে থাকে)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": "1080.15",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০২, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৪০২-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আসওয়াদ ইবনু কায়স থেকে এ সূত্রে হাদীসের অনুরূপ বর্ণিত হয়েছে। কিন্তু এ সূত্রে “দ্বিতীয় মাসের ত্রিশদিন” এ কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৩৭৯, ইসলামীক সেন্টার ২৩৮০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": "1080.16",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৩, আন্তর্জাতিক নাম্বারঃ ১০৮০ ২৪০৩-(১৬/...) আবূ কামিল আল জাহদারী (রহঃ) ..... সা'দ ইবনু উবায়দাহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, ইবনু উমর (রাযিঃ) এক ব্যক্তিকে বলতে শুনলেন, “আজ রাতে মাসের অর্ধেক হয়ে গেছে\"। অতঃপর ইবনু উমার (রাযিঃ) তাকে জিজ্ঞেস করলেন, তুমি কবে জানলে আজ রাতে মাসের অর্ধেক হয়ে গেছে? অথচ আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দশটি আঙ্গুলের মাধ্যমে ইঙ্গিত করে দু’বার বলতে শুনেছিঃ “মাস এত দিনে ও এত দিনে হয়। তিনি দু'বার আঙ্গুল দিয়ে ইশারা করলেন। তৃতীয়বারও তিনি তাই করলেন এবং সবগুলো আঙ্গুল দিয়ে ইশারা করলেন এবং বুড়ো আঙ্গুলটি বন্ধ রাখলেন অথবা নীচু করে রাখলেন। (অর্থাৎ মাস কখনো উনত্রিশ দিনে আবার কখনো ত্রিশ দিনে হয়। কাজেই মাস শেষ না হলে নির্দিষ্ট করে বলা যায় না যে মাসের মধ্যরাত কোনটি)। (ইসলামিক ফাউন্ডেশন ২৩৮০, ইসলামীক সেন্টার ২৩৮১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": "1081.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৪, আন্তর্জাতিক নাম্বারঃ ১০৮১ ২৪০৪-(১৭/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা চাঁদ দেখবে তখন সওম আরম্ভ করবে এবং যখন চাঁদ দেখবে তখন ইফতার করবে। যদি আকাশ মেঘাচ্ছন্ন থাকে তবে ত্রিশদিন সিয়াম (রোজা/রোযা) পালন করবে। (ইসলামিক ফাউন্ডেশন ২৩৮১, ইসলামীক সেন্টার ২৩৮২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": "1081.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৫, আন্তর্জাতিক নাম্বারঃ ১০৮১ ২৪০৫-(১৮/...) আবদুর রহমান ইবনু সাল্লাম আল জুমাহী (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (রমাযানের) চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন শুরু কর এবং (শাওয়ালের) চাঁদ দেখে ইফত্বার (অর্থাৎ ঈদ) কর। আর যদি (নতুন চাঁদ উদয়ের দিন) আকাশ মেঘাচ্ছন্ন থাকে তাহলে ত্রিশ দিন পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৮২, ইসলামীক সেন্টার ২৩৮৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": "1081.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৬, আন্তর্জাতিক নাম্বারঃ ১০৮১ ২৪০৬-(১৯/...) উবায়দুল্লাহ ইবনু মুআয (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন কর এবং চাঁদ দেখে ইফত্বার কর। আর আকাশ মেঘাচ্ছন্ন থাকলে দিনের সংখ্যা (ত্রিশ দিন) পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৮৩, ইসলামীক সেন্টার ২৩৮৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2517,
			"arabicnumber": "1081.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৭, আন্তর্জাতিক নাম্বারঃ ১০৮১ ২৪০৭-(২০/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন কর এবং চাঁদ দেখে ইফত্বার কর (অর্থাৎ সিয়াম (রোজা/রোযা) সমাপ্ত কর)। আর আকাশ মেঘাচ্ছন্ন থাকার কারণে তোমরা যদি মাসের আরম্ভ বা শেষ সম্পর্কে সন্দিহান হও তাহলে ঐ মাসের ত্রিশ দিন পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৮৪, ইসলামীক সেন্টার ২৩৮৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": "1082.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৮, আন্তর্জাতিক নাম্বারঃ ১০৮২ ২৪০৮-(২১/১০৮২) আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযানের একদিন কিংবা দু'দিন পূর্বে তোমরা (নাফল) সওম পালন করো না, তবে যে পূর্ব থেকেই এ সময়ের রোযায় অভ্যস্ত সে সওম পালন করতে পারে। (ইসলামিক ফাউন্ডেশন ২৩৮৫, ইসলামীক সেন্টার ২৩৮৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": "1082.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪০৯, আন্তর্জাতিক নাম্বারঃ ১০৮২ ২৪০৯-(.../...) ইয়াহইয়া ইবনু বিশর আল হারীরী, ইবনুল মুসান্না ও আবূ উমার এবং যুহায়র ইবনু হারব, (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা রমযান মাস শুরু হওয়ার একদিন বা দু' দিন পূর্ব থেকে সিয়াম (রোজা/রোযা) পালন করো না। কিন্তু যে ব্যক্তি নির্দিষ্ট একদিনে সর্বদাই সিয়াম (রোজা/রোযা) পালন করে থাকে, আর ঐ নির্দিষ্ট দিনটি যদি চাঁদ উঠার দিন (বা তার আগের দিন) হয় তাহলে সে ঐ দিন সিয়াম (রোজা/রোযা) পালন করতে পারে। (ইসলামিক ফাউন্ডেশন ২৩৮৬, ইসলামীক সেন্টার ২৩৮৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": "1083",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১০, আন্তর্জাতিক নাম্বারঃ ১০৮৩ ২৪১০-(২২/১০৮৩) আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) এক মাসের জন্য তার স্ত্রীদের কাছ থেকে দূরে থাকার শপথ করলেন। যুহরী বলেন, উরওয়াহ আমাকে এটা আয়িশাহ (রাযিঃ) এর সূত্রে অবহিত করেছেন। তিনি বলেন, শপথের পর আমি দিন গণনা করছিলাম, উনত্রিশ রাত অতিবাহিত হওয়ার পর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বপ্রথম আমার কাছে আসলেন। আমি বললাম, হে আল্লাহর রসূল! আপনি তো একমাস আমাদের সান্নিধ্য থেকে দূরে থাকার শপথ করেছেন, অথচ আপনি উনত্রিশ দিন অতিবাহিত করে এসেছেন। আমি তো দিনগুলোর পূর্ণ হিসাব রেখেছি। (অর্থাৎ একমাসের একদিন বাকী আছে) তিনি বললেনঃ মাস তো উনত্রিশ দিনেও হয়ে থাকে। (ইসলামিক ফাউন্ডেশন ২৩৮৭, ইসলামীক সেন্টার ২৩৮৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": "1084.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১১, আন্তর্জাতিক নাম্বারঃ ১০৮৪ ২৪১১-(২৩/১০৮৪) মুহাম্মাদ ইবনু রুমূহ ও কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মাসের জন্য তার স্ত্রীদের সন্নিধ্য ত্যাগ করেছিলেন। তিনি উনত্রিশতম দিনে আমাদের কাছে আসলেন। আমরা বললাম, আজ তো উনত্রিশ দিন? তখন তিনি বললেনঃ উনত্রিশ দিনেও মাস হয়। তিনি তার উভয় হাত তিনবার একত্রে মিলিয়ে ইঙ্গিত করে বুঝিয়ে দিলেন। তৃতীয়বার তিনি একটি আঙ্গুল বন্ধ রাখলেন। (ইসলামিক ফাউন্ডেশন ২৩৮৮, ইসলামীক সেন্টার ২৩৮৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": "1084.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১২, আন্তর্জাতিক নাম্বারঃ ১০৮৪ ২৪১২-(২৪/...) হারূন ইবনু আবদুল্লাহ ও হাজ্জাজ ইবনু শাইর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্ত্রীদের থেকে একমাস বিচ্ছিন্ন থাকলেন। অতঃপর তিনি উনত্রিশতম দিনের সকালে আমাদের কাছে আসলেন। উপস্থিত লোকদের কেউ কেউ বললেন, হে আল্লাহর রসূল! আজ তো আমরা উনত্রিশতম দিনের সকালে উপনীত হয়েছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মাস তো উনত্রিশ দিনেও হয়। এরপর তিনি তিনবার উভয় হাত মিলালেন। প্রথম দু’বার উভয় হাতের সব আঙ্গুলগুলো একত্রে মিলালেন এবং তৃতীয়বার নয়টি আঙ্গুল একত্রে মিলালেন ও ইঙ্গিতে উনত্রিশ দিনে মাস বললেন। (ইসলামিক ফাউন্ডেশন ২৩৮৯, ইসলামীক সেন্টার ২৩৯০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2523,
			"arabicnumber": "1085.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৩, আন্তর্জাতিক নাম্বারঃ ১০৮৫ ২৪১৩-(২৫/১০৮৫) হারূন ইবনু আবদুল্লাহ (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তার স্ত্রীদের সান্নিধ্য থেকে একমাস দূরে থাকার শপথ করলেন। অতঃপর উনত্রিশ দিন অতিবাহিত হলে তিনি সকালে অথবা বিকালে তাদের কাছে আসলেন। তাকে বলা হলো, হে আল্লাহর নবী! আপনি এক মাস আমাদের কাছে না আসার শপথ করেছেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, উনত্রিশ দিনেও মাস হয়। (ইসলামী ফাউন্ডেশন ২৩৯০, ইসলামীক সেন্টার ২৩৯১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": "1085.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৪, আন্তর্জাতিক নাম্বারঃ ১০৮৫ ২৪১৪-(.../...) ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ইবনু জুরায়জ (রহঃ) থেকে বর্ণিত। ..... এ সূত্রেও উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৩৯১, ইসলামীক সেন্টার ২৩৯২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": "1086.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৫, আন্তর্জাতিক নাম্বারঃ ১০৮৬ ২৪১৫-(২৬/১০৮৬) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... সাদ ইবনু ওয়াক্কাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এক হাত দিয়ে অপর হাতের উপর আঘাত করলেন। অতঃপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, মাস এভাবে এবং এভাবে। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তৃতীয়বারে একটি আঙ্গুল নীচু করে রাখলেন। (ইসলামিক ফাউন্ডেশন ২৩৯২, ইসলামীক সেন্টার ২৩৯৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": "1086.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৬, আন্তর্জাতিক নাম্বারঃ ১০৮৬ ২৪১৬-(২৭/...) কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... মুহাম্মাদ ইবনু সা'দ থেকে তার পিতার সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মাস এরূপ, এরূপ এবং এরূপ অর্থাৎ দশ দিন এবং নয় দিন। (ইসলামিক ফাউন্ডেশন ২৩৯৩, ইসলামীক সেন্টার ২৩৯৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": "1086.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৭, আন্তর্জাতিক নাম্বারঃ ১০৮৬ ২৪১৭-(.../...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু কুহযায (রহঃ) ..... ইসমাঈল ইবনু আবূ খালিদ (রহঃ) থেকে এ সানাদে উপরোক্ত দু'টি হাদীসের অনুরূপ বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৩৯৪, ইসলামীক সেন্টার ২৩৯৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": "1087",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৮, আন্তর্জাতিক নাম্বারঃ ১০৮৭ ২৪১৮-(২৮/১০৮৭) ইয়াহইয়া ইবনু ইয়াহইয়া, ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ও ইবনু হুজুর (রহঃ) ...... কুরায়ব (রহঃ) থেকে বর্ণিত। হারিসের কন্যা উম্মুল ফাযল তাকে সিরিয়ায় মুআবিয়াহ (রাযিঃ) এর নিকট পাঠালেন। কুরায়ব বলেন, অতঃপর আমি সিরিয়া পৌছে তার প্রয়োজনীয় কাজ সমাপন করলাম। আমি সিরিয়ায় থাকতেই রমযান এসে গেল। আমি জুমুআর রাতে রমযানের চাঁদ দেখতে পেলাম। অতঃপর মাসের শেষদিকে আমি মদীনায় ফিরে এলাম। আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) সিয়াম (রোজা/রোযা) সম্পর্কে আলোচনা প্রসঙ্গে আমাদের জিজ্ঞেস করলেন, তুমি কখন চাঁদ দেখেছ? আমি বললাম, আমি তো জুমুআর রাতেই চাঁদ দেখেছি। তিনি পুনরায় জিজ্ঞেস করলেন, তুমি নিজেই কি তা দেখেছ? আমি বললাম, হ্যাঁ, অন্যান্য লোকেরাও দেখেছে এবং তারা সিয়াম (রোজা/রোযা) পালন করেছে। এমনকি মু'আবিয়াহ্ (রাযিঃ)-ও সিয়াম (রোজা/রোযা) পালন করছেন। তিনি বলেন, আমরা তো শনিবার রাতে চাঁদ দেখেছি, আমরা পূর্ণ ত্রিশটি রোযা রাখব অথবা এর আগে যদি চাঁদ দেখতে পাই তাহলে তখন ইফত্বার করব। আমি বললাম, আপনি কি মু'আবিয়াহ (রাযিঃ) এর চাঁদ দেখা ও সিয়াম (রোজা/রোযা) পালন করাকে (রমাযান মাস শুরু হওয়ার জন্য) যথেষ্ট মনে করেন না? তিনি বললেনঃ না, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের এভাবেই (চাঁদ দেখে সিয়াম (রোজা/রোযা) পালন করা ও ইফতার করার জন্য) নির্দেশ দিয়েছেন। (ইসলামিক ফাউন্ডেশন ২৩৯৫, ইসলামীক সেন্টার ২৩৯৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": "1088.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪১৯, আন্তর্জাতিক নাম্বারঃ ১০৮৮ ২৪১৯-(২৯/১০৮৮) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... আবূল বাখতারী (রহঃ) থেকে বর্ণিত। তিনি বলেন, একবার আমরা উমরাহ করার জন্য বের হলাম। যখন আমরা (মক্কাহ (মক্কা) ও ত্বায়িফের মাঝামাঝি অবস্থিত) “বাত্বনে নাখলাহ\" নামক স্থানে অবতরণ করলাম সকলে মিলে চাঁদ দেখতে লাগলাম। লোকেদের মধ্যে কেউ কেউ বলল, এ তো তিনদিনের চাঁদ, আবার কেউ বলল দু'দিনের। বর্ণনাকারী বলেন, পরে আমরা ইবনু “আব্বাস (রাযিঃ) এর সাথে সাক্ষাৎ করে বললাম, আমরা চাঁদ দেখেছি। কিন্তু লোকেদের মধ্যে কেউ কেউ বলেছে, এতো দু'দিনের চাঁদ আবার কেউ কেউ বলেছে এতো তিন দিনের চাঁদ। তিনি জিজ্ঞেস করলেন, তোমরা কোন রাতে চাঁদ দেখেছে? আমরা বললাম, অমুক দিন, অমুক রাতে। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেদিন রাতে চাঁদ দেখতেন ঐ দিনেরই তারিখ ধরতেন। সুতরাং চাঁদ সে রাতেই উঠেছে যে রাতে তোমরা দেখেছো। (ইসলামিক ফাউন্ডেশন ২৩৯৬, ইসলামীক সেন্টার ২৩৯৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": "1088.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২০, আন্তর্জাতিক নাম্বারঃ ১০৮৮ ২৪২০-(৩০/...) আবূ বাকর ইবনু আবূ শায়বাহ, ইবনুল মুসান্না ও ইবনুল বাশশার (রহঃ) ...... আবূল বাখতারী (রহঃ) থেকে বর্ণিত। তিনি বলেন, “আমরা যখন যাতু ইরক নামক স্থানে অবস্থান করছিলাম তখন রমযানের চাঁদ দেখতে পেলাম। অতঃপর আমরা এক ব্যক্তিকে ইবনু আব্বাস (রাযিঃ) এর কাছে এ সম্পর্কে জিজ্ঞেস করার জন্য পাঠালাম। ইবনু আব্বাস (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা চাঁদ দেখার সাথে মাস নির্ধারণ করেছেন, যদি তোমাদের নিকট অপ্রকাশিত থাকে (মেঘের কারণে) তাহলে তোমরা (ত্রিশ দিনে) মাস পূর্ণ কর। (ইসলামিক ফাউন্ডেশন ২৩৯৭, ইসলামীক সেন্টার ২৩৯৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": "1089.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২১, আন্তর্জাতিক নাম্বারঃ ১০৮৯ ২৪২১-(৩১/১০৮৯) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুর রহমান ইবনু আবূ বাকরাহ তার পিতা (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঈদের দু'মাস অসম্পূর্ণ হয় না। সে মাস দুটি হলো- রমযান ও যিলহাজ্জ।* (ইসলামিক ফাউন্ডেশন ২৩৯৮, ইসলামীক সেন্টার ২৩৯৮[ক]) * সহীহ ও গ্রহণযোগ্য কথা হলো, এ উভয় মাসের সাওয়াব কোন অবস্থায় ঘাটতি পড়বে না ত্রিশ দিনে হোক বা উনত্রিশ দিনে। ফলকথা এই যে, একদিন কম হওয়ার কারণে যে, সাওয়াবও কম হবে তা নয়; আবার কেউ বলেছেন, একই বছরে উভয় মাস উনত্রিশ দিনে হয় না। যদি এক মাস উনত্রিশ দিনে হয় তবে অন্য মাস ত্রিশ দিনে। আবার কেউ বলেছেন, সাওয়াবের দিক দিয়ে উভয় মাস সমান অর্থাৎ রমাযানে সওম পালন আছে অন্য দিকে যিলহাজ্জ মাসে আছে হাজ্জ (হজ্জ/হজ) পালন। কিন্তু এ সকল অভিমত সঠিক নয় দুর্বল। বরং সঠিক কথা তাই যা প্রথমে বলা হয়েছে।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": "1089.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২২, আন্তর্জাতিক নাম্বারঃ ১০৮৯ ২৪২২-(৩২/...) আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... আবূ বাকরাহ (রাযিঃ) তার পিতা থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ঈদের দু'মাস অসম্পূর্ণ হয় না। খালিদের বর্ণিত হাদীসে আছেঃ ঈদের দু' মাস হচ্ছে রমযান এবং যিলহাজ্জ। (ইসলামিক ফাউন্ডেশন ২৩৯৯, ইসলামীক সেন্টার ২৩৯৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": "1090",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২৩, আন্তর্জাতিক নাম্বারঃ ১০৯০ ২৪২৩-(৩৩/১০৯০) আবূ বকর ইবনু আবূ শয়বাহ (রহঃ) ... আদী ইবনু হাতিম (রাযিঃ) থেকে বর্ণিত। যখন এ আয়াতحَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ পানাহার কর যতক্ষণ তোমাদের সামনে কালো রেখা থেকে সাদা রেখা সুস্পষ্ট হয়ে না উঠে\"- (সূরা আল বাকারাহ ২ঃ ১৮৭) নাযিল হলো, তখন আদী (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমি আমার বালিশের নীচে একটি কালো ও একটি সাদা রংয়ের রশি রেখে দিয়েছি। এগুলোর দ্বারা আমি রাত ও দিনের মধ্যে পার্থক্য নির্ণয় করে থাকি। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (হাসি-ঠাট্টাচ্ছলে) বললেন, তোমার বালিশ তো খুবই চওড়া। জেনে রাখো, এ-তো রাতের অন্ধকার ও দিনের শুভ্রতা। (ইসলামিক ফাউন্ডেশন ২৪০০, ইসলামীক সেন্টার ২৪০০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": "1091.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২৪, আন্তর্জাতিক নাম্বারঃ ১০৯১ ২৪২৪-(৩৪/১০৯১) উবায়দুল্লাহ ইবনু উমার আল কাওয়ারীরী (রহঃ) ... সাহল ইবনু সা'দ (রাযিঃ) থেকে বর্ণিতও। তিনি বলেন, পানাহার কর যতক্ষণ তোমাদের সামনে কালো রেখা থেকে সাদা রেখা সুস্পষ্ট হয়ে না উঠে”— (সূরা আল বাকারাহ ২ঃ ১৮৭) নাযিল হল, তখন লোকেরা একটি কালো এবং একটি সাদা রশি রাখত। তারা উভয় রশি সুস্পষ্টভাবে প্রতিভাত না হওয়া পর্যন্ত খেতে থাকত। এরপর মহাপরাক্রমশালী আল্লাহ তা'আলা (ফজরের) কথাটি নাযিল করে বিষয়টির অস্পষ্টতা ও জটিলতা দূরীভূত হলো। (ইসলামিক ফাউন্ডেশন ২৪০১, ইসলামীক সেন্টার ২৪০১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": "1091.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২৫, আন্তর্জাতিক নাম্বারঃ ১০৯১ ২৪২৫-(৩৫/...) মুহাম্মদ ইবনু সাহল আত তামীমী ও আবূ বকর ইবনু ইসহাক (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) থেকে বর্ণিতও। তিনি বলেন, যখন এ আয়াত وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ \"তোমরা সাদা রেখা স্পষ্ট না হওয়া পর্যন্ত পানাহার কর\" অবতীর্ণ হলো- কোন ব্যক্তি সিয়াম (রোজা/রোযা) পালন করার ইচ্ছা করত এবং নিজের উভয় পায়ে সাদা ও কালো দুটি সূতা বেঁধে নিত। অতঃপর সাদা ও কালো বর্ণ স্পষ্ট না হওয়া পর্যন্ত পানাহার করতে থাকত। অতঃপর আল্লাহ তা'আলা “ফজরের\" কথাটি অবতীর্ণ করলেন। তখন তারা সকলেই জানতে পারল যে, সাদা ও কালো রেখার অর্থ হলো রাত (রাতের অন্ধকার) ও দিন (দিনের আলো)। (ইসলামিক ফাউন্ডেশন ২৪০২, ইসলামীক সেন্টার ২৪০২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": "1092.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২৬, আন্তর্জাতিক নাম্বারঃ ১০৯২ ২৪২৬-(৩৬/১০৯২) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রুমূহ ও কুতায়বাহ ইবনু সাঈদ (রহঃ) .... আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ \"বিলাল রাত থাকতে আযান দেয়। তাই তোমরা ইবনু মাকতুমের আযান শুনতে না পাওয়া পর্যন্ত পানাহার করতে থাক।\" (ইসলামিক ফাউন্ডেশন ২৪০৩, ইসলামীক সেন্টার ২৪০৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": "1092.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": "1092.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪২৮, আন্তর্জাতিক নাম্বারঃ ১০৯২ ২৪২৮-(৩৮/...) ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু'জন মুয়াযযিন ছিলেন, তারা হলেন, বিলাল (রাযিঃ) ও উম্মু মাকতুমের অন্ধ ছেলে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ বিলাল (রাযিঃ) রাতেই আযান দেয়। অতএব ইবনু উম্মু মাকতুম আযান না দেয়া পর্যন্ত তোমরা পানাহার কর। বর্ণনাকারী বলেনঃ দু'জনের আযানের ব্যবধান ছিল যে, একজন আযান দিয়ে নামত অপরজন আযান দিতে আরোহণ করত। (ইসলামিক ফাউন্ডেশন ২৪০৫, ইসলামীক সেন্টার ২৪০৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": "1092.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": "1092.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": "1093.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩১, আন্তর্জাতিক নাম্বারঃ ১০৯৩ ২৪৩১-(৩৯/১০৯৩) ইবনু মাসউদ (রাযি.) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কাউকেই যেন বিলালের আযান অবশ্যই তার সাহরী খাওয়া হতে বিরত না রাখে। কেননা সে রাতেই আযান দেয়, যাতে তোমাদের কিয়ামকারীগণ সাহরী খেতে শুরু করে এবং ঘুমন্ত ব্যক্তি সাহরী খাওয়ার জন্য জাগে। তিনি তার হাতে আঙ্গুল ফাঁকা করে দু'জনের আযানের সময়ের ব্যবধান বুঝালেন। (ইসলামিক ফাউন্ডেশন ২৪০৮, ইসলামীক সেন্টার ২৪০৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": "1093.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩২, আন্তর্জাতিক নাম্বারঃ ১০৯৩ ২৪৩২-(.../...) ইবনু নুমায়র (রহঃ) ..... সুলায়মান আত তায়মী (রহঃ) এ সানাদে হাদীস বর্ণনা করেছেন, তবে তিনি বলেছেনঃ এটাকে ফাজর (ফজর) বলে না- এ বলে তিনি তার আঙ্গুলগুলো একত্র করলেন অতঃপর তা মাটির (পৃথিবীর) দিকে উল্টালেন। বরং ফাজর (ফজর) এটাকে বলে- এ বলে তিনি তাসবীহ পাঠের আঙ্গুলের উপর আরেক তাসবীহ পাঠের আঙ্গুল স্থাপন করে তার দু'হাত সম্প্রসারণ করলেন। (ইসলামিক ফাউন্ডেশন ২৪০৯, ইসলামীক সেন্টার ২৪০৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": "1093.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩৩, আন্তর্জাতিক নাম্বারঃ ১০৯৩ ২৪৩৩-(৪০/...) আবূ বাকর ইবনু শায়বাহ, ইসহাক ইবনু ইবরাহীম, জারীর ও মু'তামির উভয়েই সুলায়মান আত তায়মী (রহঃ) এর বরাতে অত্র সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। মু'তামির এর হাদীস এ পর্যন্ত শেষ হয়েছে “তোমাদের ঘুমন্ত ব্যক্তিকে জাগিয়ে দেন বরং কিয়ামকারীদেরকে ফিরিয়ে দেন। জারীরের হাদীসে এ কথাও আছে যে, লম্বা রেখাকে ফাজর (ফজর) বলে না বরং ফাজর (ফজর) বলে প্রশস্ত আলোকে।\" (ইসলামিক ফাউন্ডেশন ২৪১০, ইসলামীক সেন্টার ২৪১০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": "1094.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩৪, আন্তর্জাতিক নাম্বারঃ ১০৯৪ ২৪৩৪-(৪১/১০৯৪) শায়বান ইবনু ফাবরূখ (রহঃ) ..... সামুরাহ ইবনু জুনদুব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুনেছি, তিনি বলেছেন, বিলালের আহ্বান যেন তোমাদেরকে সাহরী খাওয়া থেকে ধোকায় না ফেলে এবং এ শুভ্র রেখাও; যতক্ষণ পর্যন্ত না তা বিস্তৃত হয়ে প্রতিভাত হয়। (ইসলামিক ফাউন্ডেশন ২৪১৫, ইসলামীক সেন্টার ২৪১১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": "1094.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": "1094.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩৬, আন্তর্জাতিক নাম্বারঃ ১০৯৪ ২৪৩৬-(৪৩/...) আবূ রবী আয যাহরনী (রহ) ... সামুৱাহ ইবনু জুনদুব (রযিঃ) থেকে বর্ণিত তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিলালের আযান এবং আকাশ প্রান্তে এ লম্বা রেখা যেন তোমাদেরকে সাহরী খাওয়ার ব্যাপারে ধোকায় না ফেলে যতক্ষণ পর্যন্ত না এ শুভ্র রেখা পূর্বকাশে এভাবে বিস্তৃত হয়। হাম্মদ (রহঃ) বলেন, এ সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার উভয় হাত দ্বারা আড়াআড়ি হওয়ার প্রতি ইঙ্গিত করেছেন। (ইসলামিক ফাউন্ডেশন, ২৪১৩, ইসলামীক সেন্টার ২৪১৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": "1094.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩৭, আন্তর্জাতিক নাম্বারঃ ১০৯৪ ২৪৩৭-(৪৪/...) উবায়দুল্লাহ ইবনু মুআয (রহঃ) ..... সামুরাহ ইবনু জুনদুব (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ বিলালের আযান এবং এ শুভ্র রেখা যেন তোমাদেরকে ধোকায় না ফেলে যতক্ষণ পর্যন্ত না সুবহে সাদিক সুস্পষ্টরূপে প্রতিভাত হয়। (ইসলামিক ফাউন্ডেশন ২৪১৪, ইসলামীক সেন্টার ২৪১৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": "1094.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": "1095",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৩৯, আন্তর্জাতিক নাম্বারঃ ১০৯৫ ২৪৩৯-(৪৫/১০৯৫) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব ও কুতায়বাহ ইবনু সাঈদ (রহঃ) .... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সাহরী খাও, সাহরীতে বারাকাত রয়েছে। (ইসলামিক ফাউন্ডেশন ২৪১৬, ইসলামীক সেন্টার ২৪১৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": "1096.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪০, আন্তর্জাতিক নাম্বারঃ ১০৯৬ ২৪৪০-(৪৬/১০৯৬) কুতায়বাহ ইবনু সাঈদ (রহঃ) ...... আমর ইবনু আস (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমাদের ও কিতাবীদের সিয়ামের মধ্যে পার্থক্য হল সাহরী খাওয়া। (ইসলামিক ফাউন্ডেশন ২৪১৭, ইসলামীক সেন্টার ২৪১৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": "1096.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪১, আন্তর্জাতিক নাম্বারঃ ১০৯৬ ২৪৪১-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ তাহির (রহঃ) ..... মূসা ইবনু উলাইয়্যা (রহঃ) এর সূত্রে এ সানাদে হাদীস বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ২৪১৮, ইসলামীক সেন্টার ২৪১৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": "1097.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪২, আন্তর্জাতিক নাম্বারঃ ১০৯৭ ২৪৪২-(৪৭/১০৯৭) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ...... যায়দ ইবনু সাবিত (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সাহরী খেয়ে সালাতে দাঁড়ালাম। রাবী আনাস (রাযিঃ) বলেন আমি যায়দ ইবনু সাবিত (রাযিঃ) কে জিজ্ঞেস করলাম, সাহরী ও আযানের মধ্যে কত সময়ের ব্যবধান ছিল? তিনি বললেন, পঞ্চাশ আয়াত পড়ার মতো সময়ের। (ইসলামিক ফাউন্ডেশন ২৪১৯, ইসলামীক সেন্টার ২৪১৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": "1097.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৩, আন্তর্জাতিক নাম্বারঃ ১০৯৭ ২৪৪৩-(.../...) 'আমর আন নাকিদ ও ইবনুল মুসান্না (রহঃ) ..... কতাদাহ্ (রহঃ) এর এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪২০, ইসলামীক সেন্টার ২৪১৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": "1098.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৪, আন্তর্জাতিক নাম্বারঃ ১০৯৮ ২৪৪৪-(৪৮/১০৯৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যতদিন মানুষ বিলম্ব না করে ইফত্বার করবে, ততদিন তারা কল্যাণের উপর থাকবে। (ইসলামী ফাউন্ডেশন ২৪২১, ইসলামীক সেন্টার ২৪২০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": "1098.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৫, আন্তর্জাতিক নাম্বারঃ ১০৯৮ ২৪৪৫-(.../...) কুতায়বাহ ও যুহায়র ইবনু হারব (রহঃ) ...... সাহল ইবনু সা'দ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪২২, ইসলামীক সেন্টার ২৪২১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": "1099.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৬, আন্তর্জাতিক নাম্বারঃ ১০৯৯ ২৪৪৬-(৪৯/১০৯৯) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ কুরায়ব মুহাম্মাদ ইবনুল আলা (রহঃ) ..... আবূ আতিয়্যাহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ও মাসরুক (রহঃ) আয়িশাহ্ (রাযিঃ) এর নিকট গেলাম এবং তঁকে বললাম, হে উম্মুল মু'মিনীন মুহাম্মাদ এর সাহাবীবৃন্দের দু' ব্যক্তির মধ্যে এক ব্যক্তি ইফত্বার ও সালাত (সালাত/নামাজ/নামায) ত্বরান্বিত করে এবং অন্য এক ব্যক্তি ইফতার ও সালাত (সালাত/নামাজ/নামায) বিলম্ব করে। তিনি জিজ্ঞেস করলেন, সে কোন ব্যক্তি যে ইফত্বার ও সালাত তরাস্থিত করে? আমরা বললাম, আবদুল্লাহ ইবনু মাসউদ (রাযিঃ)। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপই করতেন। আবূ কুরায়ব বলেন, অপরজন হলেন, আবূ মূসা (রাযিঃ)। (ইসলামিক ফাউন্ডেশন ২৪২৩, ইসলামীক সেন্টার ২৪২২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": "1099.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৭, আন্তর্জাতিক নাম্বারঃ ১০৯৯ ২৪৪৭-(৫০/...) আবূ কুরায়ব (রহঃ) ... আবূ আতিয়াহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ও মাসরুক আয়িশাহ্ (রাযিঃ) এর নিকট গেলাম। এরপর মাসরুক তাকে বললেন, মুহাম্মাদসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্যে দু' ব্যক্তি যারা কল্যাণজনক কাজে কোন প্রকার অবহেলা প্রদর্শন করেন না, তাদের একজন মাগরিব এবং ইফত্বারের মধ্যে ত্বরা করেন। আর অপরজন মাগরিব ও ইফত্বারে বিলম্ব করেন। তিনি বললেন যে, কোন ব্যক্তি সে মাগরিব ও ইফত্বারে ত্বরা করেন? তিনি বললেন, তিনি আবদুল্লাহ। তখন আয়িশাহ্ (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপই করতেন। (ইসলামিক ফাউন্ডেশন ২৪২৪, ইসলামীক সেন্টার ২৪২৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": "1100",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৮, আন্তর্জাতিক নাম্বারঃ ১১০০ ২৪৪৮-(৫১/১১০০) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ কুরায়ব ও ইবনু নুমায়র (রহঃ) ... উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন রাত আসে, দিন চলে যায় এবং সূর্য অদৃশ্য হয়ে যায়, তখন সিয়াম (রোজা/রোযা) পালনকারী ইফতার করবে।* ইবনু নুমায়র (রহঃ) فَقَدْ শব্দটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৪২৫, ইসলামীক সেন্টার ২৪২৪) * অর্থাৎ সূর্যাস্তের পর আর দেরী করবে না, যেমন কত কত সন্দেহ পোষণকারী বলে যে, আর কিছু দেরী করলে কী হবে এত বেখবর কেন। অথচ তারা এটা জানে না যে, প্রথম সূর্যাস্তের সময়েই ইফত্বার করা সুন্নাত। আর সূর্যস্ত যাওয়া, রাতের আগমন ও দিনের প্রস্থান এ তিনটি একই সময়ে সংঘটিত হয়। বরং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিষয়টাকে পরিস্কার করার জন্য তিনটিকে এভাবে উল্লেখ করেছেন। হ্যাঁ, যে স্থানে সূর্যস্ত বুঝা যায় না, তথায় একটু আঁধার করে ইফত্বার করা যায়।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": "1101.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৪৯, আন্তর্জাতিক নাম্বারঃ ১১০১ ২৪৪৯-(৫২/১১০১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু আওফা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমযান মাসে কোন এক সফরে আমরা রসূলুল্লাহ এর সঙ্গী ছিলাম। সূর্য ডুবে গেলে তিনি বললেন, হে অমুক! অবতরণ কর এবং আমাদের জন্য ছাতু গুলিয়ে আনো। সে বলল, ইয়া রসূলাল্লাহ! এখনো দিন রয়ে গেছে। পুনরায় তিনি বললেন, অবতরণ কর এবং আমাদের জন্য ছাতু গুলে আনো। তখন সে অবতরণ করল এবং ছাতু গুলে তার নিকট পেশ করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পান করলেন এবং হাত দ্বারা ইঙ্গিত করে বললেন, সূর্য এদিক থেকে অদৃশ্য হয়ে যায় এবং রাত্র যখন এদিক থেকে ঘনিয়ে আসবে, তখন সিয়াম (রোজা/রোযা) পালনকারী ইফত্বার করবে। (ইসলামিক ফাউন্ডেশন ২৪২৬, ইসলামীক সেন্টার ২৪২৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": "1101.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫০, আন্তর্জাতিক নাম্বারঃ ১১০১ ২৪৫০-(৫৩/...) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... ইবনু আবূ আওফা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক সফরে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। যখন সূর্য অদৃশ্য হয়ে গেল তখন তিনি এক ব্যক্তিকে বললেন, অবতরণ কর এবং আমাদের জন্য ছাতু গুলে আনো। সে বলল, ইয়া রসূলাল্লাহ! সন্ধ্যা হতে দিন। পুনরায় তিনি বললেন, অবতরণ কর এবং আমাদের জন্য ছাতু গুলে আনো। সে বলল, দিন আমাদের আরো বাকী রয়েছে। এরপর সে অবতরণ করে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য ছাতু গুলে আনলো। তিনি পান করলেন এবং হাত দ্বারা পূর্বদিকে ইঙ্গিত করে বললেন, যখন তোমরা দেখবে যে, এদিক থেকে রাত্র ঘনিয়ে আসছে, তখন সিয়াম (রোজা/রোযা) পালনকারীর ইফতারের সময় হবে। (ইসলামিক ফাউন্ডেশন ২৪২৭, ইসলামীক সেন্টার ২৪২৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": "1101.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫১, আন্তর্জাতিক নাম্বারঃ ১১০১ ২৪৫১-(.../...) আবূ কামিল (রহঃ) ...... আবদুল্লাহ ইবনু আবূ আওফা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ভ্রমণ করলাম। এ সময় তিনি সওমরত ছিলেন। যখন সূর্য অদৃশ্য হয়ে গেল তখন তিনি বললেন, হে অমুক! তুমি অবতরণ কর এবং আমাদের জন্য ছাতু গুলে আনো। এরপর তিনি ইবনু মুসহির এবং আব্বাস ইবনু আওওয়াম এর অনুরূপ হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন, ২৪২৮, ইসলামীক সেন্টার ২৪২৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": "1101.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫২, আন্তর্জাতিক নাম্বারঃ ১১০১ ২৪৫২-(৫৪/...) ইবনু আবূ উমার, ইসহাক, উবায়দুল্লাহ ইবনু মুআয ও ইবনুল মুসান্না (রহঃ) ..... ইবনু আবূ আওফা (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ইবনু মুসহির, আব্বাস ও আবদুল ওয়াহিদ (রহঃ) এর অনুরূপ হাদীস বর্ণনা করেছেন। তবে তাদের কারো হাদীসের মধ্যে রমযান মাসের কথা উল্লেখ নেই। অনুরূপভাবে হুশায়ম ব্যতীত তাদের বর্ণনায় “এবং যখন রাত্র এদিক থেকে ঘনিয়ে আসে” এ কথাটিও উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৪২৯, ইসলামীক সেন্টার ২৪২৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": "1102.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৩, আন্তর্জাতিক নাম্বারঃ ১১০২ ২৪৫৩-(৫৫/১১০২) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমে বিসাল করতে নিষেধ করেছেন। এতে সাহাবীগণ বললেন, আপনি তো সওমে বিসাল করে থাকেন। তিনি বললেন, আমার অবস্থা তোমাদের মতো নয়। আমাকে খাওয়ানো ও পান করানো হয় (ইসলামিক ফাউন্ডেশন ২৪৩০, ইসলামীক সেন্টার ২৪২৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": "1102.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৪, আন্তর্জাতিক নাম্বারঃ ১১০২ ২৪৫৪-(৫৬/...) আবূ বাকর ইবনু আবূ শায়বাহ ও ইবনু নুমায়র (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান সাসে সওমে বিসাল আরম্ভ করলেন। তা দেখে সাহাবীগণও সওমে বিসাল আরম্ভ করলেন। এরপর তিনি তাদেরকে সওমে বিসাল করতে নিষেধ করলেন। এতে তাকে প্রশ্ন করা হল, আপনি তো সওমে বিসাল করছেন। উত্তরে তিনি বললেন, আমি তোমাদের মতো নই। আমাকে তো খাওয়ানো হয় এবং পান করানো হয়। (ইসলামিক ফাউন্ডেশন ২৪৩১, ইসলামীক সেন্টার ২৪৩০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": "1102.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৫, আন্তর্জাতিক নাম্বারঃ ১১০২ ২৪৫৫-(.../...) আবদুল ওয়ারিস ইবনু আবদুস সমাদ (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। তবে এতে রমযান মাসের কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৪৩২, ইসলামীক সেন্টার ২৪৩১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": "1103.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৬, আন্তর্জাতিক নাম্বারঃ ১১০৩ ২৪৫৬-(৫৭/১১০৩) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ...... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমে বিসাল করতে নিষেধ করেছেন। তখন মুসলিমদের এক ব্যক্তি বললেন, হে আল্লাহর রসূল! আপনি তো সওমে বিসাল করে থাকেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের মধ্যে আমার মতো কে আছে? আমি রাত্রি যাপন করি এমতাবস্থায় যে, আমার প্রতিপালক আমাকে খাওয়ান এবং আমাকে পান করান। সাহাবীগণ সওমে বিসাল থেকে বিরত থাকতে অস্বীকার করলে তিনি তাদের সাথে একদিন এবং পরে আরেক দিন সওমে বিসাল করলেন। এরপর তারা চাঁদ দেখলেন, তখন তিনি বললেন, চাঁদ আরো দেরীতে দেখা দিলে আমিও সওমে বিসাল দীর্ঘায়িত করতাম। তারা সওমে বিসাল থেকে বিরত থাকতে অস্বীকার করলে তিনি শাস্তি স্বরূপ এ ব্যবস্থা গ্রহণ করেন। (ইসলামিক ফাউন্ডেশন ২৪৩৩, ইসলামীক সেন্টার ২৪৩২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": "1103.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৭, আন্তর্জাতিক নাম্বারঃ ১১০৩ ২৪৫৭-(৫৮/...) যুহায়র ইবনু হারব ও ইসহাক (রহঃ) ... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সওমে বিসাল থেকে বিরত থাক। সাহাবীগণ বললেন, হে আল্লাহর রসূল! আপনি তো সওমে বিসাল করে থাকেন? তিনি বললেন, এ ব্যাপারে তোমরা তো আমার মতো নও। আমি এমতাবস্থায় রাত্রি যাপন করি যে, আমার প্রতিপালক আমাকে পানাহার করান। তাই তোমরা তোমাদের সামথ্যে যতটুকু কুলায়, ততটুকু আমল কর। (ইসলামিক ফাউন্ডেশন ২৪৩৪, ইসলামীক সেন্টার ২৪৩৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": "1103.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৮, আন্তর্জাতিক নাম্বারঃ ১১০৩ ২৪৫৮-(.../...) কুতায়বাহ ইবনু সাঈদ (রহঃ) .... আবূ হুরায়রাহ (রাযিঃ) এর সূত্রে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণনা করেছেন। (হাদীসের শেষে কয়েকটি শব্দ পরিবর্তন হলেও অর্থ একই)। (ইসলামিক ফাউন্ডেশন ২৪৩৫, ইসলামীক সেন্টার ২৪৩৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": "1103.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৫৯, আন্তর্জাতিক নাম্বারঃ ১১০৩ ২৪৫৯-(.../...) ইবনু নুমায়র (রহঃ) ...... আবূ হুরায়রাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি সওমে বিসাল করতে নিষেধ করেছেন। এরপর বর্ণনাকারী আবূ যুর'আহ (রহঃ) থেকে বর্ণিত হাদীসের অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৩৬, ইসলামীক সেন্টার ২৪৩৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": "1104.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬০, আন্তর্জাতিক নাম্বারঃ ১১০৪ ২৪৬০-(৫৯/১১০৪) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমাযান মাসে একদা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করছিলেন। আমি তার পাশে এসে দাঁড়ালাম। এরপর অন্য এক ব্যক্তি এসেও তার পাশে দাঁড়ালেন। এভাবে আমরা এক দল লোক হয়ে গেলাম। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বুঝতে পারলেন যে, আমরা তার পেছনে আছি, তখন তিনি সালাত সংক্ষেপ করে ফেললেন। তারপর তিনি আপন গৃহে চলে গেলেন এবং এমন (দীর্ঘ) সালাত আদায় করলেন যে, এভাবে তিনি আমাদের সাথে সালাত আদায় করতেন না। সকালে আমরা তাকে বললাম, রাত্রে আপনি আমাদের সম্পর্কে বুঝতে পেরেছিলেন কি? তিনি বললেন, হ্যাঁ, তাই তো আমাকে অনুপ্রাণিত করেছে ঐ কাজের, যা আমি করেছি। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযানের শেষভাগে আবার সওমে বিসাল করতে আরম্ভ করলেন। এ দেখে কতিপয় সাহাবীও সওমে বিসাল শুরু করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, লোকদের কী হল, তারা যে সওমে বিসাল আরম্ভ করেছে! তোমরা আমার মত নও। আল্লাহর শপথ! যদি মাস দীর্ঘায়িত হতো, তবে আমি এমনভাবে সওমে বিসাল করতাম যার ফলে সীমালঙ্ঘনকারীগণ সওমে বিসাল করা ছেড়ে দিত। (ইসলামিক ফাউন্ডেশন ২৪৩৭, ইসলামীক সেন্টার ২৪৩৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": "1104.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬১, আন্তর্জাতিক নাম্বারঃ ১১০৪ ২৪৬১-(৬০/...) আসিম ইবনু নাযর আত তায়মী (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমযান মাসের প্রথমাংশে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমে বিসাল আরম্ভ করলেন। এ দেখে মুসলিমদের কতিপয় লোক সওমে বিসাল আরম্ভ করে দিলেন। এ সংবাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট পৌছার পর তিনি বললেন, যদি আমাদের জন্য মাস দীর্ঘায়িত করে দেয়া হতো তবে আমি এমনভাবে সওমে বিসাল করতাম যাতে সীমালঙ্ঘনকারীরা সীমালংঘন করা ছেড়ে দিত। এরপর তিনি বললেন, তোমরা তো আমার মতো নও অথবা বললেন, আমি তো তোমাদের মতো নই। কারণ আমার প্রতিপালক তো আমাকে পানাহার করান। (ইসলামিক ফাউন্ডেশন ২৪৩৮, ইসলামীক সেন্টার ২৪৩৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": "1105",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬২, আন্তর্জাতিক নাম্বারঃ ১১০৫ ২৪৬২-(৬১/১১০৫) ইসহাক ইবনু ইবরাহীম ও উসমান ইবনু আবূ শায়বাহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দয়াবশতঃ সবাইকে সওমে বিসাল করতে নিষেধ করেছেন। সাহাবীগণ বললেন, আপনি তো সওমে বিসাল করেন। তিনি বললেন, আমি তো তোমাদের মতো নই। আমাকে তো আমার প্রতিপালক পানাহার করান। (ইসলামিক ফাউন্ডেশন ২৪৩৯, ইসলামীক সেন্টার ২৪৩৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": "1106.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৩, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৩-(৬২/১১০৬) আলী ইবনু হুজুর (রহঃ) ... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় তার কোন কোন স্ত্রীকে চুমু দিতেন। তারপর তিনি হেসে দিলেন। (ইসলামিক ফাউন্ডেশন ২৪৪০, ইসলামীক সেন্টার ২৪৩৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": "1106.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৪, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৪-(৬৩/...) আলী ইবনু হুজুর আস্ সাদী ও ইবনু আবূ উমর (রহঃ) ..... সুফইয়ান (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবদুর রহমান ইবনুল কাসিম (রহঃ) কে জিজ্ঞেস করলাম, তুমি কি তোমার আব্বাকে আয়িশাহ (রাযিঃ) থেকে এ কথা বর্ণনা করতে শুনেছ যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় তাকে চুমু দিতেন? তিনি কিছুক্ষণ নীরব থেকে বললেন, হ্যাঁ, শুনেছি। (ইসলামিক ফাউন্ডেশন ২৪৪১, ইসলামীক সেন্টার ২৪৪০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": "1106.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৫, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৫-(৬৪/...) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় আমাকে চুমু দিতেন। তোমাদের মধ্যে কে এমন আছে যে, নিজের কামোদ্দীপনাকে আয়ত্বে রাখতে পারে, যেমন আয়ত্বে রাখতে সক্ষম ছিলেন রাসুলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইসলামিক ফাউন্ডেশন ২৪৪২, ইসলামীক সেন্টার ২৪৪১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": "1106.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৬, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৬-(৬৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ, আবূ কুরায়ব ও শুজা ইবনু মাখলাদ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় (স্ত্রীদেরকে) চুম্বন ও স্পর্শ করতেন। তবে প্রবৃত্তিকে নিয়ন্ত্রণ রাখায় তোমাদের সবার চেয়ে তিনি অধিকতর শক্তিশালী ছিলেন। (ইসলামিক ফাউন্ডেশন ২৪৪৩, ইসলামীক সেন্টার ২৪৪২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": "1106.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৭, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৭-(৬৬/...) আলী ইবনু হুজুর ও যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় চুমু দিতেন। তিনি তার প্রবৃত্তিকে নিয়ন্ত্রণ রাখতে তোমাদের সকলের চেয়ে অধিকতর ক্ষমতাবান ছিলেন। (ইসলামিক ফাউন্ডেশন ২৪৪৪, ইসলামীক সেন্টার ২৪৪৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": "1106.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৮, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৮-(৬৭/...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় (স্ত্রীদেরকে) স্পর্শ করতেন। (ইসলামিক ফাউন্ডেশন ২৪৪৫, ইসলামীক সেন্টার ২৪৪৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": "1106.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৬৯, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৬৯-(৬৮/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আসওয়াদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ও মাসরুক (রহঃ) আয়িশাহ (রাযিঃ) এর নিকট গেলাম এবং তাকে জিজ্ঞেস করলাম যে, সওমের অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি তার স্ত্রীদেরকে স্পর্শ করতেন? তিনি বললেন, হ্যাঁ, করতেন। তবে তিনি তার প্রবৃত্তিকে নিয়ন্ত্রণে রাখার ব্যাপারে তোমাদের সকলের চেয়ে অধিক ক্ষমতাসম্পন্ন ছিলেন অথবা বললেন, তোমাদের মধ্যে কে এমন আছে, যে তার প্রবৃত্তিকে নিয়ন্ত্রণ করতে সক্ষম? এ ব্যাপারে আবূ আসিম সন্দেহ প্রকাশ করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৪৬, ইসলামীক সেন্টার ২৪৪৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": "1106.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭০, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭০-(.../...) ইয়াকুব আদ দাওরাকী (রহঃ) ..... আসওয়াদ এবং মাসরুক (রহঃ) থেকে বর্ণিত। একদা তারা দু'জন এ বিষয়ে জিজ্ঞেস করার জন্য ‘আয়িশাহ (রাযিঃ) এর নিকট গমন করলেন। এরপর অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৪৭, ইসলামীক সেন্টার ২৪৪৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": "1106.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭১, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭১-(৬৯/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... উম্মুল মুমিনীন আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় তাঁকে চুমু দিতেন। (ইসলামিক ফাউন্ডেশন ২৪৪৮, ইসলামীক সেন্টার ২৪৪৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": "1106.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭২, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭২-(.../...) ইয়াহইয়া ইবনু বিশর আল হারীরী (রহঃ) ..... ইয়াহইয়া ইবনু কাসীর (রহঃ) এর সূত্রে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৪৯, ইসলামীক সেন্টার ২৪৪৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": "1106.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৩, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭৩-(৭০/...) ইয়াহইয়া ইবনু ইয়াহইয়া, কুতায়বাহ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিয়ামের মাসেও (স্ত্রীদেরকে) চুমু দিতেন। (ইসলামিক ফাউন্ডেশন ২৪৫০, ইসলামীক সেন্টার ২৪৪৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": "1106.12",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৪, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭৪-(৭১/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমাযান মাসে সওমের অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্ত্রীদেরকে চুমু দিতেন। (ইসলামিক ফাউন্ডেশন ২৪৫১, ইসলামীক সেন্টার ২৪৫০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": "1106.13",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৫, আন্তর্জাতিক নাম্বারঃ ১১০৬ ২৪৭৫-(৭২/...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় (স্ত্রীদেরকে) চুমু দিতেন। (ইসলামিক ফাউন্ডেশন ২৪৫২, ইসলামীক সেন্টার ২৪৫১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": "1107.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৬, আন্তর্জাতিক নাম্বারঃ ১১০৭ ২৪৭৬-(৭৩/...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) .... হাফসাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় চুমু দিতেন। (ইসলামিক ফাউন্ডেশন ২৪৫৩, ইসলামীক সেন্টার ২৪৫২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": "1107.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৭, আন্তর্জাতিক নাম্বারঃ ১১০৭ ২৪৭৭-(.../...) আবূ রবী আয যাহরানী, আবূ বাকর ইবনু আবূ শায়বাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) .... হাফসাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৫৪, ইসলামীক সেন্টার ২৪৫৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": "1108",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৮, আন্তর্জাতিক নাম্বারঃ ১১০৮ ২৪৭৮-(৭৪/...) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... 'উমার ইবনু আবূ সালামাহ্ (রাযিঃ) থেকে বর্ণিত। একদা তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন, সওম পালনকারী ব্যক্তি চুম্বন করতে পারে কি? তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, কথাটি উম্মু সালামাকে জিজ্ঞেস কর। (তাকে জিজ্ঞেস করার পর) তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ করেন। এরপর তিনি বললেন, হে আল্লাহর রসূল! আল্লাহ তো আপনার পূর্বাপর সমুদয় গুনাহ ক্ষমা করে দিয়েছেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, শোন, আল্লাহর শপথ আমি আল্লাহ তা'আলাকে তোমাদের সকলের চেয়ে অধিক ভয় করি। (ইসলামিক ফাউন্ডেশন ২৪৫৫, ইসলামীক সেন্টার ২৪৫৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": "1109.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৭৯, আন্তর্জাতিক নাম্বারঃ ১১০৯ ২৪৭৯-(৭৫/১১০৯) মুহাম্মাদ ইবনু হাতিম ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ বাকর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবূ হুরায়রাহ (রাযিঃ) তার আলোচনায় বললেন, জানাবাত অবস্থায় কারো ভোর হলে তার সওম হবে না। এরপর এ কথাটি আমি আবদুর রহমান ইবনু হারিস (রাযিঃ) এর নিকট বর্ণনা করলাম। কিন্তু তিনি তা অস্বীকার করলেন। তারপর আবদুর রহমান চললেন। আমিও তার সাথে সাথে চললাম। আমরা আয়িশাহ এবং উম্মু সালামাহ্ (রাযিঃ) এর নিকট গেলাম। এরপর আবদুর রহমান তাদের উভয়কে এ সম্বন্ধে জিজ্ঞেস করলেন। তারা বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহতিলাম ব্যতিরেকে ও জানাবাতের অবস্থায় ভোর করতেন এবং সওম পালন করতেন। তারপর আমরা মারওয়ানের নিকট আসলাম এবং আবদুর রহমান তার সাথে এ নিয়ে আলোচনা করলেন। এরপর মারওয়ান বললেন, আমি তোমাকে কসম দিয়ে বলছি, তুমি আবূ হুরায়রার নিকট যাও এবং তার কথাটি রদ করে দাও। এরপর আমি আবূ হুরায়রার নিকট গেলাম। এ সময় আবূ বাকর (রাযিঃ) 'আবদুর রহমানের সাথে ছিলেন। আবদুর রহমান এ নিয়ে আবূ হুরায়রার সঙ্গে আলোচনা করলেন। আবূ হুরায়রাহ (রাযিঃ) বললেন, তোমার নিকট তারা উভয়েই কি এ কথা বলেছেন? তিনি বললেন, হ্যাঁ, তারা উভয়েই এ কথা বলেছেন। তখন আবূ হুরায়রাহ (রাযিঃ) বললেন, বস্তুত তারাই সর্বাধিক অবগত। তারপর আবূ হুরায়রাহ (রাযিঃ) তার এ কথাটিকে ফাযল ইবনু আব্বাসের প্রতি সম্পর্কিত করে বললেন, আমি এ কথাটি ফাযলের (ইবনু আব্বাস) থেকে শুনেছিলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনিনি। রাবী বলেন, এরপর আবূ হুরায়রাহ্ (রাযিঃ) এ বিষয়ে তার মত পরিবর্তন করেন। বর্ণনাকারী বলেন, আমি আবদুল মালিককে জিজ্ঞেস করলাম, তারা রমযানের কথা বলেছে কি? তিনি বললেন, হ্যাঁ অনুরূপই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহতিলাম ব্যতিরেকেও জানাবাত অবস্থায় ভোর করতেন। এরপর সওম পালন করতেন। (ইসলামিক ফাউন্ডেশন ২৪৫৬, ইসলামীক সেন্টার ২৪৫৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": "1109.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮০, আন্তর্জাতিক নাম্বারঃ ১১০৯ ২৪৮০-(৭৬/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সমধর্মিণী আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমযান মাসে ইহতিলাম ছাড়াই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জানাবাত অবস্থায় ফজরের সালাতের সময় হয়ে যেত। তখন তিনি গোসল করতেন এবং সওম পালন করতেন। (ইসলামিক ফাউন্ডেশন ২৪৫৭, ইসলামীক সেন্টার ২৪৫৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": "1109.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮১, আন্তর্জাতিক নাম্বারঃ ১১০৯ ২৪৮১-(৭৭/...) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... আবূ বাকর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা মারওয়ান তাকে উম্মু সালামাহ্ (রাযিঃ) এর নিকট পাঠালেন ঐ ব্যক্তি সম্পর্কে জিজ্ঞেস করার জন্য যার জানাবাতের অবস্থায় ভোর হলো, সে সওম পালন করতে পারবে কি? তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইহতিলাম ব্যতিরেকে স্ত্রী সহবাসের কারণে গোসল ফরয হওয়া অবস্থায় ভোর হতো। এরপর তিনি সওম ভঙ্গও করতেন না এবং সওমের কাযাও করতেন না। (ইসলামিক ফাউন্ডেশন ২৪৫৮, ইসলামীক সেন্টার ২৪৫৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": "1109.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮২, আন্তর্জাতিক নাম্বারঃ ১১০৯ ২৪৮২-(৭৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশাহ এবং উম্মু সালামাহ্ (রাযিঃ) থেকে বর্ণিত। তারা উভয়ই বলেন, রমাযান মাসে ইহতিলাম ছাড়াই স্ত্রী সহবাসের কারণে জানাবাতের অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ভোর হতো, এরপর তিনি সওম পালন করতেন। (ইসলামিক ফাউন্ডেশন ২৪৫৯, ইসলামীক সেন্টার ২৪৫৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": "1110",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৩, আন্তর্জাতিক নাম্বারঃ ১১১০ ২৪৮৩-(৭৯/১১১০) ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ও ইবনু হুজুর (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ফাতাওয়া জিজ্ঞেস করার জন্য এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলো। এ সময় তিনি দরজার পেছন থেকে কথাগুলো শুনছিলেন। লোকটি বলল, ইয়া রসূলাল্লাহ! জানাবাতের অবস্থায় আমার ফজরের সময় হয়ে যায়, এমতাবস্থায় আমি সওম পালন করতে পারি কি? উত্তরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, জানাবাতের অবস্থায় আমারও ফজরের সালাতের সময় হয়ে যায়, আমি তো সওম পালন করি। এরপর লোকটি বলল, হে আল্লাহর রসূল! আপনি তো আমাদের মতো নন। আল্লাহ তা'আলা আপনার পূর্বাপর সমুদয় গুনাহ ক্ষমা করে দিয়েছেন। তখন তিনি বললেন, আল্লাহর শপথ! আমার আশা, আমি আল্লাহকে তোমাদের চেয়ে সর্বাধিক ভয় করি এবং আমি সর্বাধিক অবগত ঐ বিষয় সম্পর্কে, যা থেকে আমার বিরত থাকা আবশ্যক। (ইসলামিক ফাউন্ডেশন ২৪৬০, ইসলামীক সেন্টার ২৪৫৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": "1109.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৪, আন্তর্জাতিক নাম্বারঃ ১১০৯ ২৪৮৪-(৮০/১১০৯) আহমাদ ইবনু উসমান আন্‌ নাওফালী (রহঃ) ..... সুলায়মান ইবনু ইয়াসার (রাযিঃ) থেকে বর্ণিত। তিনি উম্মু সালামাহ্ (রাযিঃ) কে প্রশ্ন করলেন, জানাবাতের অবস্থায় যার ভোর হয়, সে সওম পালন করবে কি? তিনি বললেন, ইহতিলাম ছাড়াই জানাবাতের অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ভোর হতো এবং তিনি সওম পালন করতেন। (ইসলামিক ফাউন্ডেশন ২৪৬১, ইসলামীক সেন্টার ২৪৬০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": "1111.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৫, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৮৫-(৮১/১১১১) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব ও ইবনু নুমায়র (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললেন, হে আল্লাহর রসূল! আমি ধ্বংস হয়ে গিয়েছি। তিনি বললেন, কিসে তোমাকে ধ্বংস করেছে? সে বলল, আমি রমাযানে সওমরত অবস্থায় আমার স্ত্রীর সাথে সহবাস করেছি। তিনি বললেন, তোমার কোন ক্রীতদাস আছে কি যাকে তুমি আযাদ করে দিতে পার? সে বলল, না। তিনি আবার জিজ্ঞেস করলেন, তুমি কি ক্রমাগত দু' মাস সওম পালন করতে পারবে? সে বলল, না। পুনরায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি ষাটজন মিসকীনকে খাওয়াতে পারবে কি? সে বলল, না। তারপর সে বসে গেল। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এক টুকরি খেজুর আনা হল। তিনি লোকটিকে বললেন, এগুলো সদকাহ করে দাও। তখন সে বলল, আমার চেয়েও অভাবী লোককে সদকাহ করে দিব? (মদীনার) দুটি কংকরময় ভূমির মধ্যস্থিত স্থানে আমার পরিবারের চেয়ে অভাবী পরিবার আর একটিও নেই। এ কথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেসে দিলেন। এমনকি তার সামনের দাঁতগুলো প্রকাশ হয়ে পড়ল। তখন তিনি বললেন, তাহলে যাও এবং তোমার পরিবারকে খেতে দাও। (ইসলামিক ফাউন্ডেশন ২৪৬২, ইসলামীক সেন্টার ২৪৬১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": "1111.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৬, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৮৬-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মুহাম্মদ ইবনু মুসলিম আয যুহরী এর সনদে ইবনু উয়ায়নাহ্ (রহঃ) এর অনুরূপ বর্ণনা করেছেন। তবে এ হাদীসের মধ্যে بِعَرَقٍ فِيهِ تَمْرٌ এরপর وَهُوَ الزِّنْبِيلُ শব্দটি উল্লেখ রয়েছে এবং এতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাসির কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৪৬৩, ইসলামীক সেন্টার ২৪৬২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": "1111.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৭, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৮৭-(৮২/...) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রুমূহ ও কুতায়বাহ্ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। এক ব্যক্তি রমযান মাসে তার স্ত্রীর সাথে সহবাস করে এ সম্পর্কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্রশ্ন করল। তখন তিনি বললেন, তোমার কোন ক্রীতদাস আছে কি? সে বলল, না। তিনি আবার বললেন, তুমি দু’ মাস সওম পালন করতে পারবে কি? সে বলল, না। তখন তিনি বললেন, তাহলে ষাটজন মিসকীনকে আহার করাও। (ইসলামিক ফাউন্ডেশন ২৪৬৪, ইসলামীক সেন্টার ২৪৬৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": "1111.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৮, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৮৮-(৮৩/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ... যুহরী থেকে এ সানাদে বর্ণনা করেন যে, এক ব্যক্তি রমাযানের সওম ভেঙ্গে ফেলার কারণে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এর কাফফারাহ হিসেবে একটি গোলাম আযাদ করার নির্দেশ দিলেন। অতঃপর তিনি ইবনু উয়ায়নার অনুরূপ হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ২৪৬৫, ইসলামীক সেন্টার ২৪৬৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": "1111.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৮৯, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৮৯-(৮৪/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রমযানের সওম ভেঙ্গে ফেলার কারণে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে নির্দেশ দিলেন, হয় তো সে একটি গোলাম আযাদ করবে অথবা দু'মাস সওম পালন করবে অথবা ষাটজন মিসকীনকে খানা খাওয়াবে। (ইসলামিক ফাউন্ডেশন ২৪৬৬, ইসলামীক সেন্টার ২৪৬৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": "1111.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯০, আন্তর্জাতিক নাম্বারঃ ১১১১ ২৪৯০-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) থেকে এ সানাদে ইবনু উয়ায়নার অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৬৭, ইসলামীক সেন্টার ২৪৬৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": "1112.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯১, আন্তর্জাতিক নাম্বারঃ ১১১২ ২৪৯১-(৮৫/১১১২) মুহাম্মাদ ইবনু রুমূহ ইবনুল মুহাজির (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, আমি জ্বলে গিয়েছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, কেন? সে বলল, রমযানের দিনে আমি আমার স্ত্রীর সাথে সহবাস করেছি। তিনি বললেন, তাহলে সদাকাহ দাও, সদাকাহ দাও। সে বলল, আমার নিকট কিছুই নেই। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বসার জন্য নির্দেশ দিলেন। এমতাবস্থায় দু' টুকরি ভর্তি খাদ্য আসল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এগুলো সদাকাহ করে দেয়ার জন্য নির্দেশ দিলেন। (ইসলামিক ফাউন্ডেশন ২৪৬৮, ইসলামীক সেন্টার ২৪৬৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": "1112.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯২, আন্তর্জাতিক নাম্বারঃ ১১১২ ২৪৯২-(৮৬/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলেন। অতঃপর বর্ণনাকারী হাদীসটি বর্ণনা করলেন। তবে এ হাদীসের প্রথমে “সদাকাহ করো, সদাকাহ করো\" শব্দ দু’টো উল্লেখ নেই এবং এতে “দিনের বেলায়” কথাটিও উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৪৬৯, ইসলামীক সেন্টার ২৪৬৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": "1112.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৩, আন্তর্জাতিক নাম্বারঃ ১১১২ ২৪৯৩-(৮৭/...) আবূ ত্বাহির (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রমযান মাসে মসজিদের মধ্যে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, হে আল্লাহর রসূল! আমি তো জ্বলে গিয়েছি, আমি তো জ্বলে গিয়েছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞেস করলেন, কি ব্যাপার, কী হয়েছে তার? সে বলল, আমি আমার স্ত্রীর সাথে সহবাস করেছি। তিনি বললেন, তাহলে সদাকাহ কর। সে বলল, আল্লাহর শপথ! হে আল্লাহর নবী আমার কিছুই নেই এবং এ ব্যাপারে আমি সক্ষম নই তিনি বললেন, বসো। সে বসল, লোকটি বসা থাকতেই এক ব্যক্তি গাধা হাকিয়ে আসল। এর উপর ছিল খাদ্য। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ঐ অগ্নিদগ্ধ লোকটি কোথায়, যে কিছুক্ষণ পূর্বে এসেছিল? লোকটি দাঁড়াল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এগুলো সদাকাহ করে দাও। সে বলল, হে আল্লাহর রসূল! আমাদের ছাড়া অন্য লোকদেরকে সদাকাহ করে দিব? আল্লাহর শপথ আমরা অত্যন্ত ক্ষুধার্ত, আমাদের কিছুই নেই। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাহলে এগুলো তোমরা খেয়ে ফেল। (ইসলামিক ফাউন্ডেশন ২৪৭০, ইসলামীক সেন্টার ২৪৬৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": "1113.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৪, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৪-(৮৮/১১১৩) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রুমূহ ও কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, (মক্কা) বিজয়ের বছর রমযান মাসে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমরত অবস্থায় সফরে বের হলেন। অতঃপর কাদীদ নামক স্থানে পৌঁছাবার পর তিনি সওম ভেঙ্গে ফেললেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে যখনই কোন নতুন বিষয় প্রকাশ পেত, তার সাহাবীগণ তা অনুসরণ করতেন।” (ইসলামিক ফাউন্ডেশন ২৪৭১, ইসলামীক সেন্টার ২৪৭০) * রমযান মাসে সফর তথা ভ্রমণ করা অবস্থায় সওম পালন করা বিষয়ে বিভিন্নভাবে রিওয়ায়াতে আছে এবং ইমামদের মাঝেও মতবিরোধ আছে। তবে সঠিক কথা হলো- কোন অসুবিধার আশংকা না থাকলে সওম পালন উত্তম এবং সমস্যা হলে সওম না রাখাই উত্তম। কেননা সওম পালনের দ্বারা বান্দার উপর যে দায়িত্বের বোঝা চেপেছিল তা দূর হয়ে যায়।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": "1113.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৫, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৫-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ, আমর আন নাকিদ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ... যুহরী থেকে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। ইয়াহইয়া বলেন, সুফইয়ান (রহঃ) বলেছেন যে, আমি জানি না এ কার কথা অর্থাৎ তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শেষোক্ত কথাটি গ্রহণ করতেন। (ইসলামিক ফাউন্ডেশন ২৪৭২, ইসলামীক সেন্টার ২৪৭১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": "1113.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৬, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৬-(.../...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... যুহরী (রহঃ) থেকে এ সানাদের সাথে বর্ণনা করেছেন। যুহরী (রহঃ) বলেন, সওম পালন না করা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সর্বশেষ কাজ। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শেষোক্ত কাজকেই গ্রহণ করা হতো। তিনি বলেন, রমযানের তের দিন অতিবাহিত হবার পর ভোরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কাহ (মক্কা) প্রবেশ করেন। (ইসলামিক ফাউন্ডেশন ২৪৭৩, ইসলামীক সেন্টার ২৪৭২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": "1113.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৭, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৭-(.../...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু শিহাব (রহঃ) থেকে এ সানাদে লায়স এর হাদীসের অনুরূপ বর্ণনা করেছেন। ইবনু শিহাব (রহঃ) বলেন, সাহাবীগণ প্রত্যেক নতুন বিষয়ের অনুসরণ করতেন। যে বিষয়টি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছ থেকে পেতেন সাহাবীগণ একে রহিতকারী ও অধিকতর বলিষ্ঠ মনে করতেন। (ইসলামিক ফাউন্ডেশন ২৪৭৪, ইসলামীক সেন্টার ২৪৭৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": "1113.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৮, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৮-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক সময় রমযান মাসে সওমরত অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে বের হলেন। যখন তিনি উসফান নামক স্থানে পৌছলেন তখন তিনি পানি ভর্তি পাত্র আনার জন্য বললেন এবং লোকদেরকে দেখাবার জন্য দিনেই তা পান করে সওম ভেঙ্গে ফেললেন এবং এ অবস্থায় তিনি মক্কাহ (মক্কা) প্রবেশ করলেন। ইবনু আব্বাস (রাযিঃ) বলেন, যেহেতু রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সফরে কখনো) সওম পালন করেছেন আবার কখনো ইফতার করেছেন, তাই কেউ ইচ্ছা করলে সওম পালন করতে পারে আবার কেউ ইচ্ছা করলে সওম পালন ছেড়ে দিতে পারে। (ইসলামিক ফাউন্ডেশন ২৪৭৫, ইসলামীক সেন্টার ২৪৭৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": "1113.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৪৯৯, আন্তর্জাতিক নাম্বারঃ ১১১৩ ২৪৯৯-(৮৯/...) আবূ কুরায়ব (রহঃ) ... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যে ব্যক্তি সওম পালন করে তার প্রতি দোষারোপ করো না এবং তার প্রতিও না যে সওম ছেড়ে দেয়। কেননা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরের অবস্থায় (কখনো) সিয়াম (রোজা/রোযা) পালন করেছেন (আবার কখনও) সওম ছেড়ে দিয়েছেন। (ইসলামী ফাউন্ডেশন ২৪৭৬, ইসলামীক সেন্টার ২৪৭৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": "1114.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০০, আন্তর্জাতিক নাম্বারঃ ১১১৪ ২৫০০-(৯০/১১১৪) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। মক্কাহ (মক্কা) বিজয়ের বছর রমযান মাসে সওমরত অবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার (মক্কা) উদ্দেশে বের হলেন। এরপর যখন তিনি “কুরা'উল গামীম” নামক স্থান পৌছলেন, তখন লোকেরাও সওমরত ছিল। এরপর তিনি একটি পানির পাত্র চাইলেন। এমনকি লোকেরা তার দিকে তাকাতে লাগল। এরপর তিনি পানি পান করলেন। তখন তাকে বলা হল, কতিপয় লোক সওমরত রয়েছে। তিনি বললেন, তারা অবাধ্য, তারা অবাধ্য। (ইসলামিক ফাউন্ডেশন ২৪৭৭, ইসলামীক সেন্টার ২৪৭৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": "1114.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০১, আন্তর্জাতিক নাম্বারঃ ১১১৪ ২৫০১-(৯১/...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... জাফার (রহঃ) থেকে এ সানাদে হাদীস বর্ণনা করেছেন। তবে তিনি অতিরিক্ত বর্ণনা করেছেন যে, অতঃপর তাকে বলা হল, মানুষের জন্য সওম পালন করা কষ্টাতীত হয়ে পড়েছে। আপনি কী করেন, তারা সেদিকে তাকিয়ে আছে। এ কথা শুনে তিনি ‘আসরের পর এক পাত্র পানি চাইলেন। (ইসলামিক ফাউন্ডেশন ২৪৭৮, ইসলামীক সেন্টার ২৪৭৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": "1115.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০২, আন্তর্জাতিক নাম্বারঃ ১১১৫ ২৫০২-(৯২/১১১৫) আবূ বাকর ইবনু আবূ শায়বাহ, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক সফরে ছিলেন। এ সময় তিনি এক ব্যক্তিকে দেখতে পেলেন, লোকেরা তার কাছে জটলা করে আছে এবং তাকে ছায়া করে আছে। তিনি জিজ্ঞেস করলেন, তার কী হয়েছে? তারা বললেন, লোকটি সিয়াম (রোজা/রোযা) পালনকারী। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সফরে তোমাদের সওম পালন করা কোন নেকীর কাজ নয়। (ইসলামিক ফাউন্ডেশন ২৪৭৯, ইসলামীক সেন্টার ২৪৭৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": "1115.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৩, আন্তর্জাতিক নাম্বারঃ ১১১৫ ২৫০৩-(.../...) উবায়দুল্লাহ ইবনু মুআয (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে দেখলেন। এরপর তিনি অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৪৮০, ইসলামীক সেন্টার ২৪৭৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": "1115.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৪, আন্তর্জাতিক নাম্বারঃ ১১১৫ ২৫০৪-(.../...) আহমাদ ইবনু উসমান আন্‌ নাওফালী (রহঃ) ..... শু'বাহ্ (রহঃ) থেকে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। শু'বাহ বলেন, এ সানাদে ইয়াহইয়া ইবনু আবূ কাসীরের মাধ্যমে অতিরিক্ত এ কথাও আমার নিকট পৌছেছে যে, তিনি বলেছেন, আল্লাহ তা'আলা তোমাদেরকে যে সুবিধা দিয়েছেন তা গ্রহণ করা তোমাদের জন্য অপরিহার্য। আমি যখন তাকে জিজ্ঞেস করলাম, তখন সে মুখস্থ বলতে পারেনি। (ইসলামিক ফাউন্ডেশন ২৪৮১, ইসলামীক সেন্টার ২৪৮০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2615,
			"arabicnumber": "1116.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৫, আন্তর্জাতিক নাম্বারঃ ১১১৬ ২৫০৫-(৯৩/১১১৬) হাদ্দাব ইবনু খালিদ (রহঃ) ... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমযানের ষোল দিন অতিবাহিত হবার পর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যুদ্ধে অংশগ্রহণ করেছিলাম। এ সময় আমাদের কেউ সিয়াম (রোজা/রোযা) পালন করছিলেন, আবার কেউ তা ছেড়ে দিচ্ছিলেন। কিন্তু এতে সওম পালনকারী সওম ভঙ্গকারীকে কোন দোষারোপ করেনি এবং সওম ভঙ্গকারীও সওম পালনকারীকে কোন প্রকার দোষারোপ করেনি। (ইসলামিক ফাউন্ডেশন ২৪৮২, ইসলামীক সেন্টার ২৪৮১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": "1116.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৬, আন্তর্জাতিক নাম্বারঃ ১১১৬ ২৫০৬-(৯৪/...) মুহাম্মাদ ইবনু আবূ বাকর আল মুকুদ্দামী, মুহাম্মাদ ইবনুল মুসান্না ও আবূ বকর ইবনু আবূ শায়বাহ্ (রহঃ) ... কাতাদাহ্ (রহঃ) থেকে এ সানাদে হাম্মামের হাদীসের অনুরূপ বর্ণনা করেছেন। তবে আত তায়মী, উমার ইবনু আমির ও হিশামের বর্ণনায় রমযানের আঠার দিন অতিবাহিত হয়েছে কথাটি বর্ণিত আছে। সাঈদের বর্ণনায় বারোই রমযান এবং শু'বার বর্ণনায় সতের অথবা উনিশ রমাযানের কথা উল্লেখ রয়েছে। (ইসলামিক ফাউন্ডেশন ২৪৮৩, ইসলামীক সেন্টার ২৪৮২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": "1116.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৭, আন্তর্জাতিক নাম্বারঃ ১১১৬ ২৫০৭-(৯৫/...) নাসর ইবনু আলী আল জাহযামী (রহঃ) ..... আবূ সাঈদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে রমযান মাসে সফর করতাম কিন্তু সওম পালনকারীকে তার সওমের কারণে দোষারোপ করা হতো না এবং সওম ভঙ্গকারীকেও তার সওম ভঙ্গের কারণে দোষারোপ করা হতো না। (ইসলামিক ফাউন্ডেশন ২৪৮৪, ইসলামীক সেন্টার ২৪৮৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": "1116.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৮, আন্তর্জাতিক নাম্বারঃ ১১১৬ ২৫০৮-(৯৬/...) আমর আন নাকিদ (রহঃ) ..... আবূ সাঈদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমাযান মাসে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যুদ্ধে অংশগ্রহণ করতাম। এ সময় আমাদের কেউ সওম পালন করেছেন, আবার কেউ সওম ছেড়েও দিয়েছেন। কিন্তু সওম পালনকারী সওম ভঙ্গকারীকে খারাপ মনে করতেন না এবং সওম ভঙ্গকারীও সওম পালনকারীকে খারাপ মনে করতেন না। তারা মনে করতেন, যার সামথ্য আছে সে-ই সওম পালন করছে, এটাই তার জন্য উত্তম। আর যে দুর্বল সে সওম ছেড়ে দিয়েছে, এটাও তার জন্য উত্তম। (ইসলামিক ফাউন্ডেশন ২৪৮৫, ইসলামীক সেন্টার ২৪৮৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2619,
			"arabicnumber": "1117",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫০৯, আন্তর্জাতিক নাম্বারঃ ১১১৭ ২৫০৯-(৯৭/১১১৭) সাঈদ ইবনু আমর আশ'আসী, সাহল ইবনু উসমান, সুওয়াইদ ইবনু সাঈদ ও হুসায়ন ইবনু হুরায়স (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) ও জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তারা উভয়ই বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফর করেছি। এমতাবস্থায় সওম পালনকারী সওম পালন করেছেন এবং সওম যারা ছাড়তে চেয়েছেন, তারা ছেড়ে দিয়েছেন কিন্তু এতে কেউ একে অন্যের প্রতি দোষারোপ করেননি। (ইসলামিক ফাউন্ডেশন ২৪৮৬, ইসলামীক সেন্টার ২৪৮৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2620,
			"arabicnumber": "1118.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১০, আন্তর্জাতিক নাম্বারঃ ১১১৮ ২৫১০-(৯৮/১১১৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... হুমায়দ (রহঃ) থেকে বর্ণিত। তিনি বলেন, রমাযান মাসে সফরকালে সওমের বিধান কী? এ সম্বন্ধে আনাস (রাযিঃ) কে জিজ্ঞেস করার পর তিনি বললেন, রমযান মাসে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফর করেছি। এ সময় সওম পালনকারী ব্যক্তি সওম ভঙ্গকারী ব্যক্তির কোন নিন্দা করেনি এবং সওম ভঙ্গকারী ব্যক্তিও সওম পালনকারীর কোন নিন্দা করেনি। (ইসলামিক ফাউন্ডেশন ২৪৮৭, ইসলামীক সেন্টার ২৪৮৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা এটা প্রমাণিত হয় যে, রমাজান মাসে সফরে রোজা পালন করা এবং রোজা ভঙ্গ করা বৈধ। ২। এই হাদীসটির দ্বারা এটা প্রমাণিত হয় যে, প্রকৃত ইসলাম উদারপন্থা ও নমনীয়তার ধর্ম। তাই রমাজান মাসে সফরের অবস্থায় রোজা পালন করার বিষয়ে কাঠিন্য বা কঠোরতা অবলম্বন করা হয় নি। সুতরাং যে ব্যক্তি রমাজান মাসে সফরের অবস্থায় থাকবে, সে ব্যক্তি ইচ্ছা করলে রোজা পালন করবে, ইচ্ছা করলে রোজা ভঙ্গ করে অন্য সময় রোজা পালন করে নিবে।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2621,
			"arabicnumber": "1118.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১১, আন্তর্জাতিক নাম্বারঃ ১১১৮ ২৫১১-(৯৯/...) আবূ বকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... হুমায়দ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি সফরের উদ্দেশে বের হলাম এবং সিয়াম (রোজা/রোযা) পালন করলাম। লোকেরা আমাকে বলল, তুমি পুনরায় সওম পালন কর। তখন আমি বললাম, আনাস (রাযিঃ) আমাকে বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ সফরকালে সওম পালনকারী সওম ভঙ্গকারীকে কোন দোষারোপ করেনি। অনুরূপভাবে সওম ভঙ্গকারীও সওম পালনকারীকে কোন প্রকার দোষারোপ করেনি। অতঃপর আমি ইবনু আবূ মুলায়কাহ্ (রহঃ) এর সাথে সাক্ষাৎ করলাম। তিনি আয়িশাহ্ (রাযিঃ) থেকে আমাকে অনুরূপ হাদীস শুনালেন। (ইসলামিক ফাউন্ডেশন ২৪৮৮, ইসলামীক সেন্টার ২৪৮৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2622,
			"arabicnumber": "1119.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১২, আন্তর্জাতিক নাম্বারঃ ১১১৯ ২৫১২-(১০০/১১১৯) আবূ বকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে আমরা সফরে ছিলাম। আমাদের কেউ সওম পালন করেছেন, আবার কেউ ছেড়ে দিয়েছেন। এরপর প্রচণ্ড গরমের সময় আমরা এক প্রান্তরে অবতরণ করলাম। চাঁদর বিশিষ্ট লোকেরাই আমাদের মধ্যে সর্বাধিক ছায়া লাভ করতে সক্ষম হয়েছে। আমাদের কেউ কেউ নিজ হাত দ্বারা সূর্যের কিরণ থেকে নিজেকে রক্ষা করছিলেন। অবশেষে সওম পালনকারীরা ক্লান্ত হয়ে পড়ল এবং সওম ত্যাগকারীরা সুস্থ থাকল। এরপর তারা তাঁবু খাটালো এবং উটকে পানি পান করালো তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আজ সওম পরিত্যাগকারীরা সাওয়াব অর্জন করে নিল। (ইসলামিক ফাউন্ডেশন ২৪৮৯, ইসলামীক সেন্টার ২৪৮৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2623,
			"arabicnumber": "1119.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৩, আন্তর্জাতিক নাম্বারঃ ১১১৯ ২৫১৩-(১০১/...) আবূ কুরায়ব (রহঃ) ... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক সফরে ছিলেন। তখন কেউ কেউ সওম পালন করলেন, আবার কেউ কেউ সওম ছেড়ে দিলেন। এরপর যারা সওম ছেড়ে দিয়েছিলেন তারা শক্তিমত্তার সাথে কাজ করলেন এবং সওম পালনকারী ব্যক্তিগণ কাজে দুর্বল হয়ে পড়লেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আজ সওম পরিত্যাগকারীরা নেকী অর্জন করে নিল। (ইসলামিক ফাউন্ডেশন ২৪৯০, ইসলামীক সেন্টার ২৪৮৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2624,
			"arabicnumber": "1120",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৪, আন্তর্জাতিক নাম্বারঃ ১১২০ ২৫১৪-(১০২/১১২০) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... কাযা'আহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, একদা আমি আবূ সাঈদ আল খুদরী (রাযিঃ) এর নিকট গেলাম। তার নিকট মানুষের খুব ভীড় ছিল। যখন লোকজন পৃথক হয়ে এদিক ওদিক চলে গেল, তখন আমি বললাম, আমি আপনার নিকট ঐসব কথা জিজ্ঞেস করব না যা লোকেরা জিজ্ঞেস করেছে। আমি তাকে সফরের অবস্থায় সওম পালন করা সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সওমরত অবস্থায় মক্কার (মক্কা) দিকে রওনা করলাম। এরপর একস্থানে আমরা অবতরণ করলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এখন তোমরা শত্রুদের নিকটবর্তী হয়ে গিয়েছে। এখন সওম ভঙ্গ করাই তোমাদের জন্য শক্তিশালী থাকার উপায় এবং এটা তোমাদের জন্য বিশেষ এক অবকাশ। তখন আমাদের কতক লোক সওম পালন করল, আবার কতক লোক ইফতার করল। এরপর আমরা অন্য এক স্থানে অবতরণ করলাম। তখন তিনি বললেন, ভোরেই তোমরা শত্রুর মুকাবিলা করবে। সুতরাং ইফত্বারই তোমাদের জন্য শক্তি বর্ধক। তাই তোমরা ইফত্বার কর। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ নির্দেশ অবশ্য পালনীয় ছিল। তাই আমরা সকলেই সওম ভঙ্গ করলাম। এরপর আমরা দেখেছি, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফরের অবস্থায় সওম পালন করতাম। (ইসলামিক ফাউন্ডেশন ২৪৯১, ইসলামীক সেন্টার ২৪৯০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2625,
			"arabicnumber": "1121.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৫, আন্তর্জাতিক নাম্বারঃ ১১২১ ২৫১৫-(১০৩/১১২১) কুতায়বাহ ইবনু সাঈদ (রহঃ) .... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, হামযাহ ইবনু আমর আল আসলামী (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সফরের অবস্থায় সওম পালন করা সম্পর্কে জিজ্ঞেস করলে তিনি বললেন, যদি তোমার ইচ্ছা হয় তবে সওম পালন কর, আর যদি ইচ্ছা হয় তবে সওম ছেড়ে দাও। (ইসলামিক ফাউন্ডেশন ২৪৯২, ইসলামীক সেন্টার ২৪৯১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2626,
			"arabicnumber": "1121.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৬, আন্তর্জাতিক নাম্বারঃ ১১২১ ২৫১৬-(১০৪/...) আবূ রবী' আয্‌ যাহরানী (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, হামযাহ ইবনু আমর আল আসলামী (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন, ইয়া রসূলাল্লাহ! আমি তো অনবরত সওম পালন করি। সফরের অবস্থায়ও সওম পালন করব কি? তিনি বললেন, যদি তোমার ইচ্ছা হয়, তবে সওম পালন কর আর যদি ইচ্ছা হয়, তবে ছেড়ে দাও। (ইসলামিক ফাউন্ডেশন ২৪৯৩, ইসলামীক সেন্টার ২৪৯২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2627,
			"arabicnumber": "1121.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৭, আন্তর্জাতিক নাম্বারঃ ১১২১ ২৫১৭-(১০৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ... হিশাম (রহঃ) থেকে এ সানাদে হাম্মাদ ইবনু যায়দের অনুরূপ হাদীস বর্ণনা করেছেন, (তিনি বলেন) আমি সর্বদা সওম পালন করি। (ইসলামিক ফাউন্ডেশন ২৪৯৪, ইসলামীক সেন্টার ২৪৯৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2628,
			"arabicnumber": "1121.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৮, আন্তর্জাতিক নাম্বারঃ ১১২১ ২৫১৮-(১০৬/...) আবূ বকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... হিশাম (রহঃ) থেকে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। হামযাহ (রাযি.) বলেন, আমি সর্বদা সওম পালন করি। সুতরাং সফরে আমি কি সওম পালন করব? (ইসলামিক ফাউন্ডেশন ২৪৯৫, ইসলামীক সেন্টার ২৪৯৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2629,
			"arabicnumber": "1121.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫১৯, আন্তর্জাতিক নাম্বারঃ ১১২১ ২৫১৯-(১০৭/১১২১) আবূ ত্বহির ও হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ... হামযাহ ইবনু আমর আল আসলামী (রাযিঃ) থেকে বর্ণিত। তিনি বললেন, ইয়া রসূলাল্লাহ! সফরের অবস্থায় সিয়াম (রোজা/রোযা) পালনের ক্ষমতা আমার রয়েছে। এ সময় সিয়াম (রোজা/রোযা) পালন করলে আমার কোন গুনাহ হবে কি? তিনি বললেন, এটা আল্লাহর পক্ষ হতে এক বিশেষ অবকাশ, যে তা গ্রহণ করবে, তা তার জন্য উত্তম। আর যদি কেউ সিয়াম (রোজা/রোযা) পালন করতে চায়, তবে তার কোন গুনাহ হবে না। হারুন তার হাদীসের মধ্যে هِيَ رُخْصَةٌ (এটা ছাড়) কথাটি উল্লেখ করেছেন। কিন্তু। مِنَ اللَّهِ (আল্লাহর পক্ষ থেকে) কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৪৯৬, ইসলামীক সেন্টার ২৪৯৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2630,
			"arabicnumber": "1122.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২০, আন্তর্জাতিক নাম্বারঃ ১১২২ ২৫২০-(১০৮/১১২২) দাউদ ইবনু রুশায়দ (রহঃ) ..... আবূ দারদা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক প্রচণ্ড গরমের দিনে রমযান মাসে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফরে বের হলাম। গরম এত প্রচণ্ড ছিল যে, আমাদের প্রত্যেকেই নিজ নিজ হাত মাথার উপর তুলে ধরেছিল। আর মাত্র রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবদুল্লাহ ইবনু রওয়াহাহ্ (রাযিঃ) ব্যতীত আমাদের মাঝে কেউই সওম পালনকারী ছিল না। (ইসলামিক ফাউন্ডেশন ২৪৯৭, ইসলামীক সেন্টার ২৪৯৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2631,
			"arabicnumber": "1122.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২১, আন্তর্জাতিক নাম্বারঃ ১১২২ ২৫২১-(১০৯/...) আবদুল্লাহ ইবনু মাসলামাহ আল কা'নবী (রহঃ) ... উম্মু দারদা (রাযিঃ) থেকে বর্ণিত। আবূ দারদা (রাযিঃ) বলেছেন যে, প্রচণ্ড গরমের দিনে কোন এক সফরে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। গরম এতো প্রচণ্ড ছিল যে, লোকেরা নিজ নিজ হাত মাথার উপরে রেখে দিয়েছিল। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও 'আবদুল্লাহ ইবনু রওয়াহাহ (রাযিঃ) ব্যতীত আমাদের মাঝে কেউই সওম পালনকারী ছিল না। (ইসলামী ফাউন্ডেশন ২৪৯৮, ইসলামীক সেন্টার ২৪৯৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2632,
			"arabicnumber": "1123.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২২, আন্তর্জাতিক নাম্বারঃ ১১২৩ ২৫২২-(১১০/১১২৩) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মুল ফাযল বিনতু হারিস (রাযিঃ) থেকে বর্ণিত যে, লোকেরা আরাফার দিন তার নিকট রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সিয়াম (রোজা/রোযা) পালন (করা না করা) সম্পর্কে আলোচনা করছিল। তাদের কেউ কেউ বলল, তিনি সওমরত নন। এরপর আমি তার নিকট এক পেয়ালা দুধ পাঠালাম, তিনি আরাফাতে উটের উপর বসা অবস্থায় ছিলেন। দুধটুকু তিনি তখনি পান করে নিলেন। (ইসলামিক ফাউন্ডেশন ২৪৯৯, ইসলামীক সেন্টার ২৪৯৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2633,
			"arabicnumber": "1123.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৩, আন্তর্জাতিক নাম্বারঃ ১১২৩ ২৫২৩-(.../...) ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমার (রহঃ) ..... আবূ নাযর থেকে এ সানাদে বর্ণনা করেছেন। তবে তিনি وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ (অর্থাৎ তিনি উটের উপর বসা অবস্থায় ছিলেন) বাক্যটি উল্লেখ করেননি। অধিকন্তু এতে তিনি উম্মুল ফাযলের আযাদকৃত গোলাম উমায়র থেকে বর্ণিত বলে উল্লেখ করেন। (ইসলামিক ফাউন্ডেশন ২৫০০, ইসলামীক সেন্টার ২৪৯৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2634,
			"arabicnumber": "1123.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৪, আন্তর্জাতিক নাম্বারঃ ১১২৩ ২৫২৪-(.../...) যুহায়র ইবনু হারব (রহঃ) ... সলিম আবূ আন নাযর থেকে এ সানাদে ইবনু উয়ায়নার অনুরূপ হাদীস বর্ণনা করেছেন। এখানেও উম্মুল ফাযুলের আযাদকৃত গোলাম 'উমায়র থেকে বর্ণিত। (ইসলামী ফাউন্ডেশন ২৫০১, ইসলামীক সেন্টার ২৫০০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2635,
			"arabicnumber": "1123.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৫, আন্তর্জাতিক নাম্বারঃ ১১২৩ ২৫২৫-(১১১/...) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... উম্মুল ফাযল (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কতিপয় সাহাবী আরাফার দিন তার সিয়াম (রোজা/রোযা) পালনের ব্যাপারে সন্দেহ প্রকাশ করলেন। [উম্মুল ফাযল (রাযিঃ) বলেন] আমরাও সেখানে রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। এ সময়ে আমি তার নিকট এক পেয়ালা দুধ পাঠিয়ে দিলাম। তখন তিনি আরাফার ময়দানে ছিলেন। এরপর তিনি তা পান করে নিলেন। (ইসলামিক ফাউন্ডেশন ২৫০২, ইসলামীক সেন্টার ২৫০১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2636,
			"arabicnumber": "1124",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৬, আন্তর্জাতিক নাম্বারঃ ১১২৪ ২৫২৬-(১১২/১১২৪) হারূন ইবনু সাঈদ আল আয়লী (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী মায়মুনাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, লোকেরা আরাফার দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সওম পালন করার ব্যাপারে সন্দেহ প্রকাশ করলেন। এরপর মায়মূনাহ (রাযিঃ) তার নিকট এক পেয়ালা দুধ পাঠিয়ে দিলেন, এ সময় তিনি \"মাওকাফ\" এর মধ্যে অবস্থান করছিলেন। তখন তিনি তা পান করে নিলেন। আর লোকেরা তার দিকে তাকিয়ে রইল। (ইসলামিক ফাউন্ডেশন ২৫০৩, ইসলামীক সেন্টার ২৫০২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2637,
			"arabicnumber": "1125.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৭, আন্তর্জাতিক নাম্বারঃ ১১২৫ ২৫২৭-(১১৩/১১২৫) যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযি.) থেকে বর্ণিত। তিনি বলেন, কুরায়শরা জাহিলী যুগে 'আশুরার দিন সিয়াম (রোজা/রোযা) পালন করত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও এ দিন সওম পালন করতেন। এরপর যখন তিনি মদীনায় হিজরত করলেন, তখনও তিনি আশুরার সওম পালন করেছেন এবং লোকদেরকেও তা পালন করার নির্দেশ দিয়েছেন। এরপর যখন রমযানের সিয়াম (রোজা/রোযা) কে ফারয (ফরয) করা হলো, তখন যার ইচ্ছা, সে আশুরা সওম পালন করত আর যার ইচ্ছা, সে তা ছেড়ে দিত। (ইসলামিক ফাউন্ডেশন ২৫০৪, ইসলামীক সেন্টার ২৫০৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": "1125.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৮, আন্তর্জাতিক নাম্বারঃ ১১২৫ ২৫২৮-(১১৪/...) আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... হিশাম (রহঃ) থেকে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। তবে এ হাদীসে প্রথমাংশে \"রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও এ সওম পালন করতেন\" এ কথাটির উল্লেখ করেন। অবশ্য এ হাদীসে শেষাংশে রয়েছে, “এরপর আশূরার দিন সওম পালন করা ছেড়ে দেয়া হল” সুতরাং যার ইচ্ছা সে এ দিন সওম পালন করত এবং যার ইচ্ছা সে তা ছেড়ে দিত এবং বর্ণনাকারী জারীরের বর্ণনামতে এ কথাটিকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণীর অন্তর্ভুক্ত করেননি। (ইসলামিক ফাউন্ডেশন ২৫০৫, ইসলামীক সেন্টার ২৫০৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": "1125.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫২৯, আন্তর্জাতিক নাম্বারঃ ১১২৫ ২৫২৯-(.../...) আমর আন নাকিদ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত যে, জাহিলী যুগে আশূরার দিন সওম পালন করা হত। এরপর যখন ইসলামের আবির্ভাব হল, তখন যার ইচ্ছা সে এদিন সওম পালন করত, আর যার ইচ্ছা সে তা ছেড়ে দিত। (ইসলামিক ফাউন্ডেশন ২৫০৬, ইসলামীক সেন্টার ২৫০৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": "1125.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩০, আন্তর্জাতিক নাম্বারঃ ১১২৫ ২৫৩০-(১১৫/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হওয়ার পূর্বে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশুরার দিনে সিয়াম (রোজা/রোযা) পালন করার নির্দেশ দিতেন। যখন রমযানের সিয়াম (রোজা/রোযা) ফরয করা হল তখন যার ইচ্ছা সে আশূরার দিনে সওম পালন করত, আর যার ইচ্ছা সে তা ছেড়ে দিত। (ইসলামিক ফাউন্ডেশন ২৫০৭, ইসলামীক সেন্টার ২৫০৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": "1125.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩১, আন্তর্জাতিক নাম্বারঃ ১১২৫ ২৫৩১-(১১৬/...) কুতায়বাহ্ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমূহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, কুরায়শরা জাহিলী যুগে 'আশুরার দিন সওম পালন করত। রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হওয়ার পূর্বে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যার ইচ্ছা সে এদিন সওম পালন করবে, আর যার ইচ্ছা, সে তা ছেড়ে দিবে। (ইসলামিক ফাউন্ডেশন ২৫০৮, ইসলামীক সেন্টার ২৫০৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": "1126.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩২, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩২-(১১৭/১১২৬) আবূ বাকর ইবনু আবূ শায়বাহ ও ইবনু নুমায়র (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত যে, জাহিলী যুগে লোকেরা আশূরার দিন সিয়াম (রোজা/রোযা) পালন করত। রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হওয়ার পূর্বে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও এদিন সিয়াম (রোজা/রোযা) পালন করেছেন এবং মুসলিমগণও। যখন রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হল তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আশূরার দিন আল্লাহর দিনসমূহের একটি দিন। সুতরাং যার ইচ্ছা সে এ দিন সিয়াম (রোজা/রোযা) পালন করবে, আর যার ইচ্ছা সে তা ছেড়ে দিবে। (ইসলামিক ফাউন্ডেশন ২৫০৯, ইসলামীক সেন্টার ২৫০৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": "1126.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৩, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩৩-(.../...) মুহাম্মাদ ইবনুল মুসান্না, যুহায়র ইবনু হারব ও আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... উবায়দুল্লাহ থেকে এ সানাদে হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৫১০, ইসলামীক সেন্টার ২৫০৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": "1126.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৪, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩৪-(১১৮/...) কুতায়বাহ ইবনু সাঈদ ও ইবনু রুমূহ (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত যে, আশুরার দিন সম্পর্কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আলোচনা করা হলে তিনি বললেন, এ দিনে জাহিলী যুগে লোকেরা সিয়াম (রোজা/রোযা) পালন করত। তোমাদের মধ্যে যে এ দিনে সিয়াম (রোজা/রোযা) পালন করতে আগ্রহী, সে এ দিনে সিয়াম (রোজা/রোযা) পালন করতে পারে। আর যে অপছন্দ করে, সে ছেড়ে দিতে পারে। (ইসলামিক ফাউন্ডেশন ২৫১১, ইসলামীক সেন্টার ২৫১০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2645,
			"arabicnumber": "1126.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৫, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩৫-(১১৯/...) আবূ কুরায়ব (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি আশুরার দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ কথা বলতে শুনেছেন যে, জাহিলী যুগে এ দিনে লোকেরা সিয়াম (রোজা/রোযা) সাধনা করত। যদি কেউ এদিনে সওম পালন করতে চায়, সে এ দিনে সিয়াম (রোজা/রোযা) পালন করবে। আর কেউ যদি এদিনে সওম পালন করতে না চায়, সে সওম পালন করবে না। আবদুল্লাহ (রাযিঃ) তার অভ্যস্ত দিনে না হলে আশূরার সওম পালন করতেন না। (ইসলামিক ফাউন্ডেশন ২৫১২, ইসলামীক সেন্টার ২৫১১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2646,
			"arabicnumber": "1126.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৬, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩৬-(১২০/...) মুহাম্মাদ ইবনু আহমাদ ইবনু আবূ খালাফ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আশূরার দিনের সিয়াম (রোজা/রোযা) সম্পর্কে কথা তোলা হল। তারপর তিনি লায়স ইবনু সা'দ (রহঃ) এর অনুরূপই বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৫১৩, ইসলামীক সেন্টার ২৫১২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2647,
			"arabicnumber": "1126.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৭, আন্তর্জাতিক নাম্বারঃ ১১২৬ ২৫৩৭-(১২১/...) আহমাদ ইবনু উসমান আন্‌ নাওফালী (রহঃ) ..... 'আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আশূরার দিবস সম্পর্কে কথা তোলা হলে তিনি বললেন, এ দিনে জাহিলী যুগে লোকেরা সিয়াম (রোজা/রোযা) পালন করত। যার ইচ্ছা সে এ দিন সওম পালন করবে, আর যার ইচ্ছা সে এ দিনে সওম পালন করবে না। (ইসলামিক ফাউন্ডেশন ২৫১৪, ইসলামীক সেন্টার ২৫১৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2648,
			"arabicnumber": "1127.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৮, আন্তর্জাতিক নাম্বারঃ ১১২৭ ২৫৩৮-(১২২/১১২৭) আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... আবদুর রহমান ইবনু ইয়াযীদ থেকে বর্ণিত। তিনি বলেন, আশ'আস ইবনু কায়স আবদুল্লাহ (রাযিঃ) এর নিকট গেলেন। তখন তিনি দুপুরের খাবার খাচ্ছিলেন। তিনি বললেন, হে আবূ মুহাম্মাদ! তুমি খাওয়ার জন্য কাছে এসো। তিনি বললেন, আজ কি আশূরার দিন নয়? তিনি বললেন, তুমি কি জান আশুরা দিন কী? আশ'আস বললেন, সে আবার কী? তিনি বললেন, রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হওয়ার পূর্বে এ দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিয়াম (রোজা/রোযা) পালন করতেন। যখন রমযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হল তখন তা ছেড়ে দেয়া হল। রাবী আবূ কুরায়ব (রহঃ) تُرِكَ এর স্থলে تَرَكَهُ বলেছেন। (ইসলামিক ফাউন্ডেশন ২৫১৫, ইসলামীক সেন্টার ২৫১৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2649,
			"arabicnumber": "1127.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৩৯, আন্তর্জাতিক নাম্বারঃ ১১২৭ ২৫৩৯-(.../...) যুহায়র ইবনু হারব ও উসমান ইবনু আবূ শয়বাহ (রহঃ) ... আ'মাশ (রহঃ) থেকে এ সানাদে অনুরূপ বর্ণনা করেছেন। তবে তারা বলেছেন, فَلَمَّا نَزَلَ رَمَضَانُ تَرَكَهُ “যখন রমাযানের বিধান নাযিল হল তখন তা ছেড়ে দেয়া হয়।\" (ইসলামিক ফাউন্ডেশন ২৫১৬, ইসলামীক সেন্টার ২৫১৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2650,
			"arabicnumber": "1127.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪০, আন্তর্জাতিক নাম্বারঃ ১১২৭ ২৫৪০-(১২৩/...) আবূ বাকর ইবনু আবূ শায়বাহ ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... কায়স ইবনু সাকান থেকে বর্ণিত। তিনি বলেন, আশুরার দিন আশ'আস ইবনু কায়স (রহঃ) আবদুল্লাহ (রাযিঃ) এর কাছে এলেন। এ সময় তিনি আহার করছিলেন। তিনি আশ'আসকে লক্ষ্য করে বললেন, হে আবূ মুহাম্মাদ নিকটে এসো, খানা খাও। তিনি বললেন, আমি তো সওম পালন করছি। এ কথা শুনে আবদুল্লাহ (রাযিঃ) বললেন, আমরা এ সওম পালন করতাম। পরে তা ছেড়ে দেয়া হয়েছে। (ইসলামিক ফাউন্ডেশন ২৫১৭, ইসলামীক সেন্টার ২৫১৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2651,
			"arabicnumber": "1127.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪১, আন্তর্জাতিক নাম্বারঃ ১১২৭ ২৫৪১-(১২৪/...) মুহাম্মাদ ইবনু হাতিম (রহঃ)..... আলকামাহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আশ'আস ইবনু কায়স (রহঃ) ইবনু মাসউদ (রাযিঃ) এর নিকট গেলেন। সেটা আশূরার দিন ছিল। তখন তিনি খানা খাচ্ছিলেন। এ দেখে আশ'আস (রহঃ) বললেন, হে আবদুর রহমানের পিতা! আজ তো আশূরার দিন। তিনি বললেন, রমাযানের সিয়াম (রোজা/রোযা) ফারয (ফরয) হওয়ার পূর্বে এ দিনে সিয়াম পালন করা হতো। কিন্তু রমযানের সিয়াম ফারয (ফরয) হলে এ দিনের সিয়াম পালন ছেড়ে দেয়া হয়। এখন তুমি যদি সওম না রেখে থাক তবে খাও। (ইসলামিক ফাউন্ডেশন ২৫১৮, ইসলামীক সেন্টার ২৫১৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2652,
			"arabicnumber": "1128",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪২, আন্তর্জাতিক নাম্বারঃ ১১২৮ ২৫৪২-(১২৫/১১২৮) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশূরার দিন আমাদেরকে সিয়াম (রোজা/রোযা) পালনের নির্দেশ দিতেন। তিনি এ ব্যাপারে আমাদেরকে অনুপ্রাণিত করতেন এবং এ বিষয়ে তিনি আমাদের খোজ-খবর নিতেন। কিন্তু যখন রমযানের সিয়াম ফারয (ফরয) হল তখন তিনি আমাদেরকে আদেশও করেননি, বাধাও করেননি এবং কোন খোঁজ-খবর আর নেননি। (ইসলামিক ফাউন্ডেশন ২৫১৯, ইসলামীক সেন্টার ২৫১৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2653,
			"arabicnumber": "1129.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৩, আন্তর্জাতিক নাম্বারঃ ১১২৯ ২৫৪৩-(১২৬/১১২৯) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) .... হুমায়দ ইবনু আবদুর রহমান (রহঃ) থেকে বর্ণিত। তিনি একদিন মুআবিয়াহ ইবনু আবূ সুফইয়ান (রাযিঃ) কে মদীনায় খুতবায় বলতে শুনলেন অর্থাৎ যখন তিনি মদীনায় এসেছিলেন, তখন আশুরার দিবসে তিনি তাদের উদ্দেশে খুতবাহ দিয়েছিলেন। তাতে তিনি বলেছিলন, হে মদীনাবাসী! তোমাদের আলিমগণ কোথায়? আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এ দিন সম্পর্কে বলতে শুনেছি যে, এ হল আশুরা দিবস। আল্লাহ তোমাদের উপর এ দিনের সওম ফারয (ফরয) করেননি। তবে আমি সওম পালন করছি। তাই তোমাদের মধ্যে যে সওম পালন করতে পছন্দ করে, সে পালন করবে আর যে পছন্দ করেনি, সে করবে না। (ইসলামিক ফাউন্ডেশন ২৫২০, ইসলামীক সেন্টার ২৫১৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2654,
			"arabicnumber": "1129.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৪, আন্তর্জাতিক নাম্বারঃ ১১২৯ ২৫৪৪-(.../...) আবূ তাহির (রহঃ) .... ইবনু শিহাব (রহঃ) থেকে এ সানাদে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৫২১, ইসলামীক সেন্টার ২৫২০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2655,
			"arabicnumber": "1129.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৫, আন্তর্জাতিক নাম্বারঃ ১১২৯ ২৫৪৫-(.../...) ইবনু আবূ উমর (রহঃ) ..... যুহরী (রহঃ) থেকে এ সানাদে বর্ণনা করেন যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ দিন সম্পর্কে বলতে শুনেছেন যে, আমি সওম পালনকারী। যে সওম পালনের ইচ্ছা করে, সে যেন সওম পালন করে, অতঃপর তিনি মালিক এবং ইউনুস বর্ণিত হাদীসের অবশিষ্ট অংশ উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৫২২, ইসলামীক সেন্টার ২৫২১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2656,
			"arabicnumber": "1130.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৬, আন্তর্জাতিক নাম্বারঃ ১১৩০ ২৫৪৬-(১২৭/১১৩০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) .... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (হিজরত করে) মদীনায় এলেন এবং তিনি ইয়াহুদীদেরকে আশুরার দিন সিয়াম (রোজা/রোযা) পালন করতে দেখতে পেলেন। এরপর তাদেরকে এ সম্পর্কে জিজ্ঞেস করার পর তারা বলল, এ সে দিন যে দিন আল্লাহ মূসা (আঃ) ও বনী ইসরাঈলকে ফিরআওনের উপর বিজয়ী করেছেন। তার সম্মানার্থে আমরা সওম পালন করে থাকি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমরা তোমাদের চেয়েও মূসা (আঃ) এর অধিক নিকটবর্তী। এরপর তিনি এ দিনে সওম পালন করার নির্দেশ দিলেন। (ইসলামিক ফাউন্ডেশন ২৫২৩, ইসলামীক সেন্টার ২৫২২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2657,
			"arabicnumber": "1130.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৭, আন্তর্জাতিক নাম্বারঃ ১১৩০ ২৫৪৭-(.../...) ইবনু বাশশার ও আবূ বকর ইবনু নাফি (রহঃ) ... আবূ বিশর (রহঃ) থেকে এ সনদে অনুরূপ হাদীস বর্ণনা করেছেন। তবে হাদীসে فَسُئِلُوا عَنْ ذَلِكَ (তারা এ বিষয়ে জিজ্ঞেস করল) এ স্থলে فَسَأَلَهُمْ (তিনি তাদেরকে এ বিষয়ে জিজ্ঞেস করলেন) বাক্যটি বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ২৫২৪, ইসলামীক সেন্টার ২৫২৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2658,
			"arabicnumber": "1130.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৮, আন্তর্জাতিক নাম্বারঃ ১১৩০ ২৫৪৮–(১২৮/...) ইবনু আবী উমর (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় হিজরত করে ইয়াহুদীদেরকে আশুরার দিন সওম পালনরত দেখতে পেলেন। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তোমরা কোন দিনের সওম পালন করছ, তারা বলল, এ মহান দিনে আল্লাহ তা'আলা মূসা (আঃ) ও তার সম্প্রদায়কে মুক্তি দিয়েছেন এবং ফিরআওন ও তার কওমকে ডুবিয়ে দিয়েছেন। এরপর মূসা (আঃ) কৃতজ্ঞতা প্রকাশ করার লক্ষ্যে এ দিনে সওম পালন করেছেন। তাই আমরাও এ দিনে সওম পালন করছি। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমরা তো তোমাদের থেকে মূসা (আঃ) এর অধিক নিকটবর্তী এবং হাক্বদার। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ সওম পালন করলেন এবং সওম পালন করার জন্য সকলকে নির্দেশ দিলেন। (ইসলামিক ফাউন্ডেশন ২৫২৫, ইসলামীক সেন্টার. ২৫২৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2659,
			"arabicnumber": "1130.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৪৯, আন্তর্জাতিক নাম্বারঃ ১১৩০ ২৫৪৯-(.../...) ইসহাক ইবনু ইব্রাহীম (রহঃ) ... আইয়ূব (রহঃ) থেকে এ সানাদের সাথে বর্ণনা করেছেন। তবে তিনি বলেছেন, ইবনু সাঈদ ইবনু জুবায়র (রহঃ) এ হাদীস সরাসরি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেননি। (ইসলামিক ফাউন্ডেশন ২৫২৬, ইসলামীক সেন্টার ২৫২৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2660,
			"arabicnumber": "1131.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫০, আন্তর্জাতিক নাম্বারঃ ১১৩১ ২৫৫০-(১২৯/১১৩১) আবূ বাকর ইবনু আবূ শায়বাহ ও ইবনু নুমায়র (রহঃ) .... আবূ মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ইয়াহুদী সম্প্রদায় আশুরা দিবসের সম্মান প্রদর্শন করত এবং তারা এ দিনকে ঈদ বলে গণ্য করত। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরাও এ দিনে সওম পালন কর। (ইসলামিক ফাউন্ডেশন ২৫২৭, ইসলামীক সেন্টার ২৫২৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2661,
			"arabicnumber": "1131.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫১, আন্তর্জাতিক নাম্বারঃ ১১৩১ ২৫৫১-(.../...) আহমাদ ইবনুল মুন্‌যির (রহঃ) ... কায়স (রহঃ) এর সূত্রে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। তবে এতে অতিরিক্ত বর্ণনা করেছেন যে, আবূ মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, খায়বারের ইয়াহুদীরা আশূরার দিন সওম পালন করত, তারা এ দিনকে ঈদরূপে বরণ করত এবং তারা তাদের মহিলাদেরকে অলংকার ও উত্তম পোশাকে সুসজ্জিত করত। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরাও এ দিনে সওম পালন কর। (ইসলামিক ফাউন্ডেশন ২৫২৮, ইসলামীক সেন্টার ২৫২৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2662,
			"arabicnumber": "1132.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫২, আন্তর্জাতিক নাম্বারঃ ১১৩২ ২৫৫২-(১৩১/১১৩২) আবূ বাকর ইবনু আবূ শায়বাহ ও আমর আন নাকিদ (রহঃ) ... উবায়দুল্লাহ ইবনু আবূ ইয়াযীদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, ইবনু আব্বাস (রাযিঃ) কে আশুরার দিনে সিয়াম (রোজা/রোযা) পালন করা সম্পর্কে জিজ্ঞেস করার পর তিনি বললেন, এ দিন ব্যতীত রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন মাসকে অন্য মাসের তুলনায় শ্রেষ্ঠ মনে করে সিয়াম (রোজা/রোযা) পালন করেছেন বলেও আমার জানা নেই। (ইসলামিক ফাউন্ডেশন ২৫২৯, ইসলামীক সেন্টার ২৫২৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2663,
			"arabicnumber": "1132.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৩, আন্তর্জাতিক নাম্বারঃ ১১৩২ ২৫৫৩-(.../...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... উবায়দুল্লাহ ইবনু আবূ ইয়াযীদ (রহঃ) এর সূত্রে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৫৩০, ইসলামীক সেন্টার ২৫২৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2664,
			"arabicnumber": "1133.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৪, আন্তর্জাতিক নাম্বারঃ ১১৩৩ ২৫৫৪-(১৩২/১১৩৩) আবূ বকর ইবনু আবূ শয়বাহ্ (রহঃ) .... হাকাম ইবনু আ'রাজ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু আব্বাস (রাযিঃ) এর কাছে পৌঁছলাম। এ সময় তিনি যমযমের কাছে চাঁদর বিছানো অবস্থায় বসা ছিলেন। তখন আমি তাকে বললাম, আমাকে আশুরা দিবসের সিয়াম (রোজা/রোযা) পালন সম্পর্কে সংবাদ দিন। উত্তরে তিনি বললেন, মুহররম মাসের চাঁদ দেখার পর তুমি এর তারিখগুলো গুণে রাখবে। এরপর নবম তারিখে সওম অবস্থায় তোমার যেন ভোর হয়। তখন আমি তাকে জিজ্ঞেস করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি সেদিন সিয়াম (রোজা/রোযা) পালন করেছেন? তিনি বললেন, হ্যাঁ, করেছেন। (ইসলামিক ফাউন্ডেশন ২৫৩১, ইসলামীক সেন্টার ২৫৩০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2665,
			"arabicnumber": "1133.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৫, আন্তর্জাতিক নাম্বারঃ ১১৩৩ ২৫৫৫-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ... হকাম ইবনু আ'রাজ (রহঃ) থেকে বর্ণিত। তিনি বলেন, যমযমের কাছে ইবনু আব্বাস (রাযিঃ) চাঁদর বিছিয়ে বসে থাকা অবস্থায় আমি তাকে আশূরার দিবসে সওম পালন করা সম্পর্কে জিজ্ঞেস করলাম। এরপর তিনি হাজিব ইবনু উমার (রহঃ) এর হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন, ২৫৩২, ইসলামীক সেন্টার ২৫৩১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2666,
			"arabicnumber": "1134.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৬, আন্তর্জাতিক নাম্বারঃ ১১৩৪ ২৫৫৬-(১৩৩/১১৩৪) হাসান ইবনু আলী আল হুলওয়ানী (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আশূরার দিন সিয়াম (রোজা/রোযা) পালন করেন এবং লোকদেরকে সিয়াম (রোজা/রোযা) পালনের নির্দেশ দেন, তখন সাহাবীগণ বললেন, ইয়া রসূলাল্লাহ! ইয়াহুদ এবং নাসারা এ দিনের প্রতি সম্মান প্রদর্শন করে থাকে। এ কথা শুনে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ইনশাআল্লাহ আগামী বছর আমরা নবম তারিখেও সিয়াম (রোজা/রোযা) পালন করব। বর্ণনাকারী বলেন, এখনো আগামী বছর আসেনি, এমতাবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকাল হয়ে যায়। (ইসলামিক ফাউন্ডেশন ২৫৩৩, ইসলামীক সেন্টার ২৫৩২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2667,
			"arabicnumber": "1134.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৭, আন্তর্জাতিক নাম্বারঃ ১১৩৪ ২৫৫৭-(১৩৪/...) আবূ বাকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি যদি আগামী বছর বেঁচে থাকি তবে মুহাররমের নবম তারিখেও সিয়াম (রোজা/রোযা) পালন করব। আবূ বাকর (রহঃ) বলেন, নবম তারিখই হচ্ছে আশুরার দিন। (ইসলামিক ফাউন্ডেশন ২৫৩৪, ইসলামীক সেন্টার ২৫৩৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2668,
			"arabicnumber": "1135",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৮, আন্তর্জাতিক নাম্বারঃ ১১৩৫ ২৫৫৮-(১৩৫/১১৩৫) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... সালামাহ্ ইবনু আকওয়া (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশুরার দিন আসলাম গোত্রের এক ব্যক্তিকে নির্দেশ দিয়ে পাঠালেন, সে যেন লোকদের মধ্যে এ কথা ঘোষণা করে যে, যে সিয়াম (রোজা/রোযা) পালন করেনি, সে যেন সিয়াম (রোজা/রোযা) পালন করে এবং যে আহার করেছে, সে যেন রাত পর্যন্ত তার সওম পূর্ণ করে। (ইসলামিক ফাউন্ডেশন ২৫৩৫, ইসলামীক সেন্টার ২৫৩৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2669,
			"arabicnumber": "1136.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৫৯, আন্তর্জাতিক নাম্বারঃ ১১৩৬ ২৫৫৯-(১৩৬/১১৩৬) আবূ বাকর ইবনু নাফি আল আবদী (রহঃ) .... রুবায়’ই বিনতু মু'আববিয ইবনু আফরা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশুরার দিন ভোরে এক ব্যক্তিকে মদীনার পার্শ্ববর্তী আনসারী সাহাবীগণের জনপদে এ নির্দেশ দিয়ে পাঠালেন, সে যেন এ ঘোষণা করে দেয় যে, সিয়াম (রোজা/রোযা)রত অবস্থায় যার ভোর হয়েছে, সে যেন তার সওমকে পূর্ণ করে। আর যার ইফত্বার অবস্থায় ভোর হয়েছে, সে যেন তার দিনের অবশিষ্ট অংশ পানাহার থেকে বিরত অবস্থায় পূর্ণ করে। এরপর আমরা এ দিন সওম পালন করতাম এবং আমাদের ছোট ছোট সন্তানদেরকেও আল্লাহ চাহে তো সওম পালনে অভ্যস্ত করে তুলতাম। আমরা তাদেরকে মসজিদে নিয়ে যেতাম এবং তাদের জন্য পশমের খেলনা বানিয়ে দিতাম। যখন তারা খাওয়ার জন্য কাঁদত, তখন আমরা তাদেরকে সে খেলনা প্রদান করতাম। এমনি করে ইফতারের সময় হয়ে যেত। (ইসলামিক ফাউন্ডেশন ২৫৩৬, ইসলামীক সেন্টার ২৫৩৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2670,
			"arabicnumber": "1136.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬০, আন্তর্জাতিক নাম্বারঃ ১১৩৬ ২৫৬০-(১৩৭/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... খালিদ ইবনু যাকওয়ান থেকে বর্ণিত। তিনি বলেছেন, আমি রুবায়’ই বিনতু মু'আববিয (রাযিঃ) কে আশুরার সিয়াম (রোজা/রোযা) সম্বন্ধে জিজ্ঞেস করলাম। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বার্তাবাহককে আনসারদের গ্রামে পাঠালেন ..... হাদীসের বাকি অংশ বিশর বর্ণিত হাদীসের অনুরূপ। শুধু এতটুকু ব্যতিক্রম রয়েছে, আমরা এদের জন্য পশম দিয়ে খেলনা তৈরি করতাম এবং এগুলো আমাদের সাথেই নিয়ে যেতাম। এরা আমাদের কাছে খাবার চাইলে আমরা এ খেলনা এদের হাতে দিতাম। এটা তাদেরকে সিয়াম (রোজা/রোযা) পূর্ণ করা পর্যন্ত ভুলিয়ে রাখত। (ইসলামিক ফাউন্ডেশন ২৫৩৭, ইসলামীক সেন্টার ২৫৩৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2671,
			"arabicnumber": "1137",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬১, আন্তর্জাতিক নাম্বারঃ ১১৩৭ ২৫৬১-(১৩৮/১১৩৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু আযহারের মুক্ত গোলাম আবূ উবায়দ থেকে বর্ণিত। তিনি বলেন, আমি ঈদের দিন উমর ইবনু খাত্ত্বাব (রাযিঃ) এর সাথে উপস্থিত ছিলাম। তিনি এসে সালাত (সালাত/নামাজ/নামায) আদায় সমাপ্ত করে লোকদের উদ্দেশে ভাষণ দিলেন। এতে তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু'দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেন। ঈদুল ফিতরের দিন, আর দ্বিতীয় হলো যেদিন তোমরা কুরবানীর গোশত খেয়ে থাক।\" (ইসলামিক ফাউন্ডেশন ২৫৩৮, ইসলামীক সেন্টার ২৫৩৭)* * ঈদুল ফিতর এবং ঈদুল আযহার দিন সওম পালন হারাম। চাই তা মানসা করা বা নযর মানার সওম বা নাফল সওমই হোক অথবা কাফফারার সওম বা অন্যান্য সওম হোক। আর যদি বিশেষ করে ইচ্ছাকৃতভাবে ঐ দিনসমূহে সওম পালনের মানসা করে তবে ইমাম শাফিঈ এবং অধিকাংশ উলামার মতে তার ঐ মানসা সাব্যস্তই হবে না। সওম পালন করা বা না করা পরের কথা, ফলে তার উপর কাযা করাও আবশ্যক নয়। অন্য পক্ষে ইমাম আবূ হানীফার মতে মানসা কার্যকর হবে এবং তার কায আদায় ওয়াজিব। ফলে অন্য কোন দিন সওম পালনে তা পূর্ণ হয়ে যাবে। কিন্তু এ কথা সকল ইমামের ব্যতিক্রম, ইমাম নাবাবীও এমনই বলেছেন।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2672,
			"arabicnumber": "1138",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬২, আন্তর্জাতিক নাম্বারঃ ১১৩৮ ২৫৬২-(১৩৯/১১৩৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু'দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেন- কুরবানীর ঈদের দিন আর ঈদুল ফিতরের দিন। (ইসলামিক ফাউন্ডেশন ২৫৩৯, ইসলামীক সেন্টার ২৫৩৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2673,
			"arabicnumber": "827.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৩, আন্তর্জাতিক নাম্বারঃ ৮২৭ ২৫৬৩-(১৪০/৮২৭) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... কাযা'আহ থেকে আবূ সাঈদ আল খুদরী (রাযিঃ) এর সূত্রে বর্ণিত। তিনি বললেন, আমি তার (আবূ সাঈদ) কাছে একটি হাদীস শুনলাম যা আমার অত্যন্ত পছন্দ হলো। আমি তাঁকে বললাম, আপনি এ হাদীস রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে শুনেছেন। তিনি বললেন, আমি যা শুনিনি এমন কথা তার নামে চালিয়ে দিতে পারি? এবার তিনি বললেন, আমি তাকে বলতে শুনেছিঃ দু'দিন সিয়াম (রোজা/রোযা) পালন করা সমীচীন নয়। কুরবানীর ঈদের দিন এবং রমযানে ঈদুল ফিতরের দিন। (ইসলামিক ফাউন্ডেশন ২৫৪০, ইসলামীক সেন্টার ২৫৩৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2674,
			"arabicnumber": "827.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৪, আন্তর্জাতিক নাম্বারঃ ৮২৭ ২৫৬৪-(১৪১/...)। আবূ কামিল আল জাহদারী (রহঃ) ... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু'টি দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেনঃ ঈদুল ফিতরের দিন এবং কুরবানীর দিন। (ইসলামিক ফাউন্ডেশন ২৫৪১, ইসলামীক সেন্টার ২৫৪০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2675,
			"arabicnumber": "1139",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৫, আন্তর্জাতিক নাম্বারঃ ১১৩৯ ২৫৬৫-(১৪২/১১৩৯) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... যিয়াদ ইবনু জুবায়র (রহঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি ইবনু উমর (রাযিঃ) এর কাছে এসে বলল, আমি একদিন সিয়াম (রোজা/রোযা) পালন করব বলে মানত করেছি। ঘটনাক্রমে ঐ দিনই ঈদুল আযহা বা ঈদুল ফিতরের দিন পড়েছে। ইবনু উমর (রাযিঃ) বললেন, আল্লাহ তা'আলা মানত পূর্ণ করার জন্যে নির্দেশ দিয়েছেন এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশন ২৫৪২, ইসলামীক সেন্টার ২৫৪১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2676,
			"arabicnumber": "1140",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৬, আন্তর্জাতিক নাম্বারঃ ১১৪০ ২৫৬৬-(১৪৩/১১৪০) ইবনু নুমায়র (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু'টি দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেন। ঈদুল ফিতরের দিন এবং ঈদুল আযহার দিন। (ইসলামিক ফাউন্ডেশন ২৫৪৩, ইসলামীক সেন্টার ২৫৪২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2677,
			"arabicnumber": "1141.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৭, আন্তর্জাতিক নাম্বারঃ ১১৪১ ২৫৬৭-(১৪৪/১১৪১) সুরায়জ ইবনু ইউনুস (রহঃ) ..... নুবায়শাহ আল হুযালী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আইয়্যামে তাশরীক হচ্ছে পানাহার করার দিন। (ইসলামিক ফাউন্ডেশন ২৫৪৪, ইসলামীক সেন্টার ২৫৪৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2678,
			"arabicnumber": "1141.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৮, আন্তর্জাতিক নাম্বারঃ ১১৪১ ২৫৬৮-(.../...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... নুবায়শাহ থেকে বর্ণিত। তিনি বলেন, খালিদ বলেছেন, আমি আবূল মালীহি এর সাথে সাক্ষাৎ করে এ বিষয়ে জিজ্ঞেস করি, তিনি আমাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হুশায়মের হাদীসের অনুরূপ বর্ণনা করেছেন। তবে এ হাদীসের মধ্যে অতিরিক্ত রয়েছে যে, “এ দিন আল্লাহকে স্মরণ করার দিন\"। (ইসলামিক ফাউন্ডেশন ২৫৪৫, ইসলামীক সেন্টার ২৫৪৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2679,
			"arabicnumber": "1142.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৬৯, আন্তর্জাতিক নাম্বারঃ ১১৪২ ২৫৬৯-(১৪৫/১১৪২) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... ইবনু কা'ব ইবনু মালিক (রাযিঃ) থেকে। বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এবং আওস ইবনু হাদাসান (রাযিঃ) কে আইয়্যামে তাশরীকে একটি ঘোষণা দেয়ার জন্য পাঠালেন। অতঃপর তারা রসূলের বাণী ঘোষণা করে শুনিয়ে দিলেনঃ মু'মিন ব্যক্তি ছাড়া কেউই জান্নাতে প্রবেশ করবে না, আর মিনায় অবস্থানের দিনগুলো হচ্ছে পানাহার করার দিন। (ইসলামিক ফাউন্ডেশন ২৫৪৬, ইসলামীক সেন্টার ২৫৪৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2680,
			"arabicnumber": "1142.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭০, আন্তর্জাতিক নাম্বারঃ ১১৪২ ২৫৭০-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... ইবরাহীম ইবনু ত্বহমান (রহঃ) থেকে এ সূত্রেও উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে উল্লেখ আছে তারা উভয়ে ঘোষণা করলেন। (ইসলামিক ফাউন্ডেশন ২৫৪৭, ইসলামীক সেন্টার ২৫৪৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2681,
			"arabicnumber": "1143.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭১, আন্তর্জাতিক নাম্বারঃ ১১৪৩ ২৫৭১-(১৪৬/১১৪৩) ‘আমর আন নাকিদ (রহঃ) ..... মুহাম্মাদ ইবনু আব্বাদ ইবনু জাফার (রহঃ) থেকে বর্ণিত। তিনি বলেন, জাবির ইবনু আবদুল্লাহ (রাযিঃ) যখন কা'বাহ ঘর প্রদক্ষিণ করছিলেন, আমি তাকে জিজ্ঞেস করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি জুমুআর দিন সিয়াম (রোজা/রোযা) পালন করতে নিষেধ করেছেন? তিনি বললেন, কা'বাহ ঘরের প্রভুর শপথ! হ্যাঁ, তিনি নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশন ২৫৪৮, ইসলামীক সেন্টার ২৫৪৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2682,
			"arabicnumber": "1143.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭২, আন্তর্জাতিক নাম্বারঃ ১১৪৩ ২৫৭২-(.../...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... জাবির (রাযিঃ) থেকে এ সূত্রেও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একই হাদীস বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৪৯, ইসলামীক সেন্টার ২৫৪৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2683,
			"arabicnumber": "1144.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৩, আন্তর্জাতিক নাম্বারঃ ১১৪৪ ২৫৭৩-(১৪৭/১১৪৪) আবূ বাকর ইবনু আবূ শায়বাহ ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহিমাহুমাল্লাহ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমুআর দিন কেউ যেন সিয়াম (রোজা/রোযা) পালন না করে। কিন্তু যদি কেউ জুমুআর দিনের আগে বা পরে একদিন সিয়াম (রোজা/রোযা) পালন করে তাহলে সে জুমুআর দিন সিয়াম পালন করতে পারে। (ইসলামিক ফাউন্ডেশন ২৫৫০, ইসলামীক সেন্টার ২৫৪৯) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। কোনো মুসলিম ব্যক্তির জন্য এটা জায়েজ নয় যে, সে শুধু শুক্রবারে বা জুমার দিনে রোজা রাখবে। তবে কোনো ব্যক্তির কোনো রোজা রাখার অভ্যাস থাকলে, সে ব্যক্তি শুধু জুমার দিনে রোজা রাখতে পারবে। ২। শুক্রবার বা জুমার দিনটি হলো দোয়া, জিকির এবং আল্লাহর উপাসনা বা ইবাদতে মগ্ন থাকার দিন এবং পবিত্র ও হালাল রুজি উপার্জন করার দিন; সুতরাং শুধু এই দিনে রোজা রাখা ভালো কর্ম নয়। তাই মহান আল্লাহ বলেছেন: فَاِذَا قُضِیَتِ الصَّلٰوۃُ فَانۡتَشِرُوۡا فِی الۡاَرۡضِ وَ ابۡتَغُوۡا مِنۡ فَضۡلِ اللّٰهِ وَ اذۡکُرُوا اللّٰهَ کَثِیۡرًا لَّعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۱۰﴾ ভাবার্থের অনুবাদ: “অতএব যখন জুমার নামাজ পড়া শেষ হয়ে যাবে, তখন তোমরা পৃথিবীতে ছড়িয়ে পড়বে এবং আল্লাহর প্রদত্ত জীবিকার্জনের কাজে তৎপর থাকবে। এবং আল্লাহকে অধিক স্মরণ করবে” । (সূরা আল জুমুয়া, আয়াত নং ১০ এর অংশবিশেষ) ।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2684,
			"arabicnumber": "1144.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৪, আন্তর্জাতিক নাম্বারঃ ১১৪৪ ২৫৭৪-(১৪৮/...) আবূ কুরায়ব (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা রাতগুলোর মধ্যে কেবলমাত্র জুমুআর রাতকে জাগরণের (নৈশ ইবাদাতের) জন্য নির্দিষ্ট করে নিও না, আর দিনগুলোর মধ্যে শুধু জুমুআর দিনকে সিয়ামের জন্য নির্দিষ্ট করে নিও না। তবে যদি তোমাদের কেউ সর্বদা (নাফল) সিয়াম (রোজা/রোযা) পালন করে আর এ সিয়ামের (ধারাবাহিকতার) মধ্যে জুমুআর দিন এসে যায় তাহলে ভিন্ন কথা। অর্থাৎ সে ঐদিন (নাফল) সিয়াম পালন করতে পারে। (ইসলামিক ফাউন্ডেশন ২৫৫১, ইসলামীক সেন্টার ২৫৫০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2685,
			"arabicnumber": "1145.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৫, আন্তর্জাতিক নাম্বারঃ ১১৪৫ ২৫৭৫-(১৪৯/১১৪৫) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... সালামাহ্ ইবনু আকওয়া (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, “যারা সিয়াম (রোজা/রোযা) পালন করতে সক্ষম (অথচ সিয়াম (রোজা/রোযা) পালন করতে চায় না) তারা ফিদইয়াহ হিসেবে একজন মিসকীনকে খাদ্য দান করবে\" যখন এ আয়াত অবতীর্ণ হলো, কেউ যদি রমযানের সিয়াম (রোজা/রোযা) পালন করতে না চাইতো সে সিয়াম (রোজা/রোযা) ভাঙ্গত এবং তার পরিবর্তে ফিদইয়াহ্ আদায় করে দিত। অতঃপর এর পরবর্তী আয়াত অবতীর্ণ হলো এবং তা পূর্ববর্তী আয়াতের হুকুম মানসূখ (রহিত) করে দিল। (ইসলামিক ফাউন্ডেশন ২৫৫২, ইসলামীক সেন্টার ২৫৫১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2686,
			"arabicnumber": "1145.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৬, আন্তর্জাতিক নাম্বারঃ ১১৪৫ ২৫৭৬-(১৫০/...) আমর ইবনু সাওওয়াদ আল আমিরী (রহঃ) ..... সালামাহ ইবনু আকওয়া (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে রমযান মাসে আমাদের মধ্যে যার ইচ্ছা হত সিয়াম (রোজা/রোযা) পালন করত আর যে চাইত ভঙ্গ করত এবং এর বিনিময়ে সিয়ামের ফিদইয়াহ হিসেবে একজন মিসকীনকে খাদ্য দান করত। অবশেষে এ আয়াত নাযিল হলঃ “কাজেই আজ হতে যে ব্যক্তিই এ মাসের সম্মুখীন হবে তার জন্য এ পূর্ণ মাসের সিয়াম (রোজা/রোযা) পালন করা একান্ত কর্তব্য।\" (ইসলামিক ফাউন্ডেশন ২৫৫৩, ইসলামীক সেন্টার ২৫৫২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2687,
			"arabicnumber": "1146.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৭, আন্তর্জাতিক নাম্বারঃ ১১৪৬ ২৫৭৭-(১৫১/১১৪৬) আহমাদ ইবনু আবদুল্লাহ ইবনু ইউনুস (রহঃ) ..... আবূ সালামাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে বলতে শুনেছি, আমার রমযান মাসের সিয়াম (রোজা/রোযা) অবশিষ্ট থেকে যেত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমাতে ব্যস্ত থাকার কারণে আমি শা'বান মাস ছাড়া অন্য কোন সময়ে তা আদায় করার সুযোগ পেতাম না। (ইসলামিক ফাউন্ডেশন ২৫৫৪ , ইসলামীক সেন্টার ২৫৫৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2688,
			"arabicnumber": "1146.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৮, আন্তর্জাতিক নাম্বারঃ ১১৪৬ ২৫৭৮-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইয়াহইয়া ইবনু সাঈদ (রহঃ) থেকে এ সূত্রেও উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ বর্ণনায় পার্থক্য এতটুকু যে, তিনি বলেছেন, আর রমযানের সিয়ামের কাযা আদায়ের ব্যাপারে শা'বান পর্যন্ত বিলম্ব করার কারণ হলো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমাতে নিযুক্ত থাকা। (ইসলামিক ফাউন্ডেশন ২৫৫৫, ইসলামীক সেন্টার ২৫৫৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": "1146.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৭৯, আন্তর্জাতিক নাম্বারঃ ১১৪৬ ২৫৭৯-(.../...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইয়াহইয়া ইবনু সাঈদ (রহঃ) এ সানাদেও উপরের হাদীসটি বর্ণনা করেছেন। তবে এ হাদীসে তিনি আরো বলেছেন, আমার মনে হয় তার এরূপ দেরী করার কারণ ছিল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমাতে ব্যস্ত থাকা। (ইসলামিক ফাউন্ডেশন ২৫৫৬, ইসলামীক সেন্টার ২৫৫৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2690,
			"arabicnumber": "1146.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮০, আন্তর্জাতিক নাম্বারঃ ১১৪৬ ২৫৮০-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও আমর আন্‌ নাকিদ (রহঃ) ..... ইয়াহইয়া (রহঃ) থেকে এ সানাদে উপরের হাদীসটি বর্ণনা করেছেন। তবে তিনি এ বর্ণনায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খিদমাতে তার ব্যস্ত থাকার কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৫৫৭, ইসলামীক সেন্টার ২৫৫৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2691,
			"arabicnumber": "1146.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮১, আন্তর্জাতিক নাম্বারঃ ১১৪৬ ২৫৮১-(১৫২/...) মুহাম্মাদ ইবনু আবূ উমার আল মাক্কী (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমাদের (রসূলের স্ত্রীগণের) মধ্যে কেউ যদি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়ে সিয়াম (রোজা/রোযা) ভঙ্গ করত তাহলে সে শাবান মাস আসার পূর্বে কোন সময়ই রোযা করার সুযোগ পেত না। (ইসলামিক ফাউন্ডেশন ২৫৫৮, ইসলামীক সেন্টার ২৫৫৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2692,
			"arabicnumber": "1147",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮২, আন্তর্জাতিক নাম্বারঃ ১১৪৭ ২৫৮২-(১৫৩/১১৪৭) হারূন ইবনু সাঈদ আল আয়লী ও আহমাদ ইবনু ঈসা (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মৃত ব্যক্তির উপর কাযা সিয়াম (রোজা/রোযা) থাকলে তার অভিভাবক তার পক্ষ থেকে সিয়াম (রোজা/রোযা) পূর্ণ করবে। (ইসলামিক ফাউন্ডেশন ২৫৫৯, ইসলামীক সেন্টার ২৫৫৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2693,
			"arabicnumber": "1148.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৩, আন্তর্জাতিক নাম্বারঃ ১১৪৮ ২৫৮৩-(১৫৪/১১৪৮) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। এক মহিলা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, আমার মা মারা গেছেন। তার এক মাসের রোযা বাকি আছে। তিনি বলেন, মনে কর তার (তোমার মায়ের) উপর যদি কোন ঋণ থাকত তাহলে কি তুমি তা পরিশোধ করতে? সে বলল, হ্যাঁ। এবার তিনি বললেন, তাহলে আল্লাহর ঋণ (বা পাওনা) পরিশোধিত হবার সবচেয়ে বেশী হাক (হক) রয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৬০, ইসলামীক সেন্টার ২৫৫৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2694,
			"arabicnumber": "1148.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৪, আন্তর্জাতিক নাম্বারঃ ১১৪৮ ২৫৮৪-(১৫৫/...) আহমাদ ইবনু উমার আল ওয়াকী'ঈ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, হে আল্লাহর রসূল! আমার মা মারা গেছেন এবং তার এক মাসের সিয়াম (রোজা/রোযা) বাকি আছে। আমি কি তার পক্ষ থেকে এটা আদায় করে দিব? তখন তিনি বললেন, যদি তোমার মায়ের উপর ঋণ থাকত তাহলে তুমি কি তা তার পক্ষ থেকে পরিশোধ করে দিতে? সে বলল, হ্যাঁ। এবার তিনি বললেন, তাহলে আল্লাহর ঋণ তো পরিশোধিত হবার সবচেয়ে বেশী দাবীদার। সুলায়মান বলেন, হাকাম ও সালামাহ্ ইবনু কুহায়ল উভয়ই বলেছেন, যখন মুসলিম আল বাত্বীন এ হাদীসটি বর্ণনা করেছেন তখন আমরা উভয়ই সেখানে বসা ছিলাম। অতঃপর তারা উভয়ই বলেন, আমরা মুজাহিদকে এ হাদীসটি ইবনু আব্বাসের সূত্রে বর্ণনা করতে শুনেছি। (ইসলামিক ফাউন্ডেশন ২৫৬১, ইসলামীক সেন্টার ২৫৬০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2695,
			"arabicnumber": "1148.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৫, আন্তর্জাতিক নাম্বারঃ ১১৪৮ ২৫৮৫-(.../...) আবূ সাঈদ আল আশাজ্জ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে এ সূত্রেও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একই হাদীস বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৬২, ইসলামীক সেন্টার ২৫৬১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2696,
			"arabicnumber": "1148.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৬, আন্তর্জাতিক নাম্বারঃ ১১৪৮ ২৫৮৬-(১৫৬/...) ইসহাক ইবনু মানসূর, ইবনু আবূ খালাফ ও ‘আবদ ইবনু হুমায়দ (রহঃ) .... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক মহিলা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললেন, হে আল্লাহর রসূল! আমার মা তার মানতের সওম বাকি রেখেই মারা গেছেন। এখন আমি কি তার পক্ষ থেকে এটা পূর্ণ করব? তিনি বললেন, মনে কর তোমার মায়ের পক্ষ থেকে ঋণ বাকি ছিল। তুমি তা পরিশোধ করে দিলে। এতে কি তোমার মায়ের পক্ষ থেকে ঋণ পরিশোধ হয়ে যেত? সে (মহিলা) বলল, হ্যাঁ। এবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তোমার মায়ের পক্ষ থেকে সওম রেখে দাও। (ইসলামিক ফাউন্ডেশন ২৫৬৩, ইসলামীক সেন্টার ২৫৬২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2697,
			"arabicnumber": "1149.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৭, আন্তর্জাতিক নাম্বারঃ ১১৪৯ ২৫৮৭-(১৫৭/১১৪৯) আলী ইবনু হুজুর আস্ সা’দী (রহঃ) ..... আবদুল্লাহ ইবনু বুরায়দাহ (রাযিঃ) থেকে পিতার সূত্রে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বসা ছিলাম। এমন সময় এক মহিলা তার কছে এসে বলল, আমার মাকে একটি দাসী দান করেছিলাম, আমার মা মারা গেছেন। তখন তিনি বললেন, তুমি তোমার সাওয়াবের অধিকারী হয়ে গেছ এবং ঐ দাসী উত্তরাধিকার সূত্রে পুনরায় তোমার মালিকানাধীনে ফিরে আসবে। সে (মহিলা) আবার বলল, হে আল্লাহর রসূল! তার এক মাসের সিয়াম (রোজা/রোযা) বাকি আছে। আমি কি তার পক্ষ থেকে এ সিয়াম (রোজা/রোযা) পালন করতে পারি? তিনি বললেন, হ্যাঁ, তার পক্ষ থেকে তুমি সিয়াম (রোজা/রোযা) পালন কর। আবার সে বলল, তিনি কখনো হাজ্জ (হজ্জ/হজ) করেননি। আমি কি তার পক্ষ থেকে হাজ্জ (হজ্জ/হজ) করব? তিনি বললেন, তার পক্ষ থেকে হাজ্জ (হজ্জ/হজ)ও কর। (ইসলামিক ফাউন্ডেশন ২৫৬৪, ইসলামীক সেন্টার ২৫৬৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2698,
			"arabicnumber": "1149.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৮, আন্তর্জাতিক নাম্বারঃ ১১৪৯ ২৫৮৮-(১৫৮/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আবদুল্লাহ ইবনু বুরায়দাহ (রাযিঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বসা ছিলাম। ... ইবনু মুসহিরের হাদীসের অনুরূপ। তবে এ সূত্রে দু' মাসের সওমের কথা উল্লেখ আছে। (ইসলামিক ফাউন্ডেশন ২৫৬৫, ইসলামীক সেন্টার ২৫৬৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2699,
			"arabicnumber": "1149.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৮৯, আন্তর্জাতিক নাম্বারঃ ১১৪৯ ২৫৮৯-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু বুরায়দাহ (রাযিঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, একজন স্ত্রীলোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসল। ... উপরের হাদীসের অনুরূপ। তবে এ সূত্রে এক মাসের সিয়ামের কথা উল্লেখ আছে। (ইসলামিক ফাউন্ডেশন ২৫৬৬, ইসলামীক সেন্টার ২৫৬৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2700,
			"arabicnumber": "1149.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯০, আন্তর্জাতিক নাম্বারঃ ১১৪৯ ২৫৯০-(.../...) ইসহাক ইবনু মানসূর (রহঃ) ..... সুফইয়ান থেকে এ সূত্রে উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে দু’ মাসের সিয়ামের কথা উল্লেখ রয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৬৭, ইসলামীক সেন্টার ২৫৬৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2701,
			"arabicnumber": "1149.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯১, আন্তর্জাতিক নাম্বারঃ ১১৪৯ ২৫৯১-(.../...) ইবনু আবূ খালাফ (রহঃ) ..... সুলায়মান ইবনু বুরায়দাহ (রাযিঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি (বুরায়দাহ) বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসল। ..... পূর্বের হাদীসের অনুরূপ। তবে এ সূত্রে এক মাসের সিয়ামের কথা উল্লেখ আছে। (ইসলামিক ফাউন্ডেশন ২৫৬৮, ইসলামীক সেন্টার ২৫৬৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2702,
			"arabicnumber": "1150",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯২, আন্তর্জাতিক নাম্বারঃ ১১৫০ ২৫৯২-(১৫৯/১১৫০) আবূ বকর ইবনু আবূ শায়বাহ, আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমাদের কেউ সিয়াম (রোজা/রোযা) অবস্থায় আহার করার জন্য আমন্ত্রিত হয়, তখন সে যেন বলে, আমি সিয়াম (রোজা/রোযা) পালনকারী। (ইসলামী ফাউন্ডেশন ২৫৬৯, ইসলামীক সেন্টার ২৫৬৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 2703,
			"arabicnumber": "1151.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৩, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৩-(১৬০/১১৫১) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) বর্ণনা করেছেন, যখন তোমাদের কেউ কোনদিন সিয়াম (রোজা/রোযা) অবস্থায় ভোরে উপনীত হয়, সে সেন অশ্লীল কথাবার্তা ও জাহিলী আচরণ না করে। যদি কেউ তাকে গালাগালি করে বা তার সাথে ঝগড়া-বিবাদে লিপ্ত হতে উদ্যত হয় তখন সে যেন বলে, আমি সিয়াম (রোজা/রোযা) পালনকারী, আমি সিয়াম (রোজা/রোযা) পালনকারী। (ইসলামিক ফাউন্ডেশন ২৫৭০, ইসলামীক সেন্টার ২৫৬৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 2704,
			"arabicnumber": "1151.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৪, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৪-(১৬১/...) হারমালাহ্ ইবনু ইয়াহইয়া আত তুজীবী (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ \"মহান আল্লাহ তা'আলা বলেছেন, মানব সন্তানের যাবতীয় কাজ তার নিজের জন্য। কিন্তু সিয়াম (রোজা/রোযা), এটা আমার জন্য এবং আমিই এর প্রতিদান দিব”। সে মহান সত্তার শপথ, যার হাতের মুঠোয় মুহাম্মাদের জীবন! নিশ্চয়ই সিয়াম (রোজা/রোযা) পালনকারীর মুখের গন্ধ আল্লাহর কাছে কস্তুরীর সুগন্ধির চেয়েও অধিক সুগন্ধিময়। (ইসলামিক ফাউন্ডেশন ২৫৭১, ইসলামীক সেন্টার ২৫৭০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 2705,
			"arabicnumber": "1151.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৫, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৫-(১৬২/...) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব ও কুতায়বাহ ইবনু সাঈদ (রহঃ) ...... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সিয়াম (রোজা/রোযা) ঢাল স্বরূপ। (ইসলামিক ফাউন্ডেশন ২৫৭২, ইসলামীক সেন্টার ২৫৭১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 2706,
			"arabicnumber": "1151.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৬, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৬-(১৬৩/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ \"মানব সন্তানের প্রতিটি নেক কাজের সাওয়াব দশ গুণ থেকে সাতশ গুণ পর্যন্ত বাড়িয়ে দেয়া হয়।\" মহান আল্লাহ বলেন, \"আদম সন্তানের যাবতীয় আমল তার নিজের জন্য কিন্তু সিয়াম (রোজা/রোযা) বিশেষ করে আমার জন্যেই রাখা হয়। আর আমি নিজেই এর প্রতিদান দিব।\" সুতরাং যখন তোমাদের কারো সওমের দিন আসে সে যেন ঐ দিন অশ্লীল কথাবার্তা না বলে এবং অনর্থক শোরগোল না করে। যদি কেউ তাকে গালি দেয় অথবা তার সাথে বিবাদ করতে চায়, সে যেন বলে, “আমি একজন সিয়াম পালনকারী। সে মহান আল্লাহর শপথ, যার হাতে মুহাম্মাদের জীবন! সিয়াম পালনকারীদের মুখের দুর্গন্ধ কিয়ামতের দিন আল্লাহর কাছে কস্তুরীর সুগন্ধির চেয়েও উত্তম হবে। আর সিয়াম পালনকারীদের জন্য দুটি আনন্দ রয়েছে। এর মাধ্যমে সে অনাবিল আনন্দ লাভ করে। একটি হলো যখন সে ইফতার করে তখন ইফতারীর মাধ্যমে আনন্দ পায় আর দ্বিতীয়টি হলো যখন সে তার প্রভুর সাথে মিলিত হবে তখন সে তার সিয়ামের জন্য আনন্দিত হবে।\" (ইসলামিক ফাউন্ডেশন ২৫৭৩, ইসলামীক সেন্টার ২৫৭২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 2707,
			"arabicnumber": "1151.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৭, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৭-(১৬৪/...) আবূ বকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব ও আবূ সাঈদ আল আশাজ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানব সন্তানের প্রতিটি নেক কাজের সাওয়াব দশ গুণ থেকে সাতশ গুণ পর্যন্ত বাড়িয়ে দেয়া হয়। মহান আল্লাহ বলেন, “কিন্তু সিয়াম (রোজা/রোযা) আমারই জন্য এবং আমি নিজেই এর প্রতিফল দান করব। বান্দা আমারই জন্য নিজের প্রবৃত্তিকে নিয়ন্ত্রণ করেছে এবং পানাহার পরিত্যাগ করেছে।\" সিয়াম পালনকারীর জন্য দুটি আনন্দ রয়েছে। একটি তার ইফত্বারের সময় এবং অপরটি তার প্রতিপালক আল্লাহর সাথে সাক্ষাতের সময়। সিয়াম (রোজা/রোযা) পালনকারীর মুখের দুর্গন্ধ আল্লাহ তা'আলার কাছে মিশকের সুগন্ধির চেয়েও অধিক সুগন্ধময়। (ইসলামিক ফাউন্ডেশন ২৫৭৪, ইসলামীক সেন্টার ২৫৭৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 2708,
			"arabicnumber": "1151.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৮, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৮-(১৬৫/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আবূ হুরায়রাহ ও আবূ সাঈদ (রাযিঃ) থেকে বর্ণিত। তারা উভয়ে বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা বলেন, \"সিয়াম (রোজা/রোযা) আমারই জন্য এবং আমিই এর প্রতিফল দান করব।” সিয়াম পালনকারীর জন্য দুটি আনন্দ রয়েছে। একটি হলো যখন সে ইফত্বর করে আনন্দিত হয়, অপরটি হলো যখন সে মহান আল্লাহর সাথে সাক্ষাৎ করবে তখন সে আনন্দিত হবে। সে মহান সত্তার শপথ, যার হাতে মুহাম্মাদের জীবন! নিশ্চয়ই সিয়াম পালনকারীর মুখের গন্ধ আল্লাহ তা'আলার কাছে মিশকের সুগন্ধের চেয়েও তীব্র।* (ইসলামিক ফাউন্ডেশন ২৫৭৫, ইসলামীক সেন্টার ২৫৭৪) * ইফত্বারের সময় খুশির কারণ হলো, মহান আল্লাহ তা'আলার অপার অনুগ্রহ সাহায্য এবং তাওফীকের কারণে এ রকম একটি ফাযীলাত ও মর্যাদাপূর্ণ কাজ সম্পাদন করতে পেরেছে, আর এ সময় দুনিয়ার যাবতীয় হালাল বস্তু আহার করা তার জন্য হালাল এবং এ সময় সওম পূর্ণ হওয়ার কারণে সে পরকালীন সুখ-শান্তির আশাবাদী হলো।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 2709,
			"arabicnumber": "1151.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৫৯৯, আন্তর্জাতিক নাম্বারঃ ১১৫১ ২৫৯৯-(.../...) ইসহাক ইবনু উমার ইবনু সুলায়ত্ব (সালীত্ব) আল হুযালী (রহঃ) ..... যিরার ইবনু মুররাহ (রহঃ) অর্থাৎ আবূ সিমান থেকে এ সানাদে উপরের হাদীসের অনুরূপ বর্ণিত আছে। তবে এতে আরো আছে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন সিয়াম (রোজা/রোযা) পালনকারী আল্লাহর সাথে সাক্ষাৎ করবে এবং তিনি তাকে প্রতিদান দিবেন তখন সে আনন্দিত হবে।* (ইসলামিক ফাউন্ডেশন ২৫৭৬, ইসলামীক সেন্টার ২৫৭৫) * আল্লাহ তা'আলার সাথে সাক্ষাতের সময় খুশি এজন্য যে, আল্লাহ তার অপার রহমাত ও দয়ার ইবাদাত কবুল করেছেন এবং যে সাওয়াব ও প্রতিদানের প্রতিশ্রুতি করেছিলেন তা পূর্ণ হয়ে গেল।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 2710,
			"arabicnumber": "1152",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০০, আন্তর্জাতিক নাম্বারঃ ১১৫২ ২৬০০-(১৬৬/১১৫২) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতে রাইয়্যান' নামক একটি দরজা আছে। কিয়ামতের দিন এ দরজা দিয়ে সিয়াম (রোজা/রোযা) পালনকারী জান্নাতে প্রবেশ করবে। আর সিয়াম (রোজা/রোযা) পালনকারীগণ ছাড়া অন্য কেউ তাদের সাথে এ দরজা দিয়ে প্রবেশ করতে পারবে না। কিয়ামতের দিন সিয়াম (রোজা/রোযা) পালনকারীদেরকে ডেকে বলা হবে, সিয়াম (রোজা/রোযা) পালনকারীরা কোথায়? তখন তারা সে দরজা দিয়ে জান্নাতে প্রবেশ করবে। অতঃপর সিয়াম (রোজা/রোযা) পালনকারীদের শেষ লোকটি প্রবেশ করার সাথে সাথে তা বন্ধ করে দেয়া হবে। অতঃপর সে দরজা দিয়ে আর কেউ প্রবেশ করতে পারবে না। (ইসলামিক ফাউন্ডেশন ২৫৭৭, ইসলামীক সেন্টার ২৫৭৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 2711,
			"arabicnumber": "1153.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০১, আন্তর্জাতিক নাম্বারঃ ১১৫৩ ২৬০১-(১৬৭/১১৫৩) মুহাম্মাদ ইবনু রুমহ ইবনুল মুহাজির (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে বান্দা আল্লাহর রাস্তায় (যুদ্ধের সময়) একদিন সিয়াম (রোজা/রোযা) পালন করবে আল্লাহ তা'আলা তার চেহারাকে এ দিনের (সিয়ামের) বারাকাতে জাহান্নামের আগুন থেকে সত্তর বছরের পথ দূরে রাখবেন। (ইসলামিক ফাউন্ডেশন ২৫৭৮, ইসলামীক সেন্টার ২৫৭৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 2712,
			"arabicnumber": "1153.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০২, আন্তর্জাতিক নাম্বারঃ ১১৫৩ ২৬০২-(.../...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... সুহায়ল (রহঃ) থেকে এ সূত্রেও উপরের হাদীস বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৭৯, ইসলামীক সেন্টার ২৫৭৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 2713,
			"arabicnumber": "1153.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৩, আন্তর্জাতিক নাম্বারঃ ১১৫৩ ২৬০৩-(১৬৮/...) ইসহাক ইবনু মানসূর ও আবদুর রহমান ইবনু বিশর আল আবদী (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যে ব্যক্তি আল্লাহর রাস্তায় একদিন সিয়াম (রোজা/রোযা) পালন করে, আল্লাহ তা'আলা তার চেহারাকে জাহান্নামের আগুন থেকে সত্তর বছরের পথ দূরে রাখবেন। (ইসলামিক ফাউন্ডেশন ২৫৮০, ইসলামীক সেন্টার ২৫৭৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 2714,
			"arabicnumber": "1154.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৪, আন্তর্জাতিক নাম্বারঃ ১১৫৪ ২৬০৪-(১৬৯/১১৫৪) আবূ কামিল ফুযায়ল ইবনু হুসায়ন (রহঃ) ..... উম্মুল মু'মিনীন আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, “হে আয়িশাহ! তোমাদের কাছে কি খাওয়ার মতো কিছু আছে? আমি বললাম, হে আল্লাহর রসূল! আমাদের কাছে খাওয়ার মতো কিছুই নেই। তিনি বললেন, আমি সিয়াম (রোজা/রোযা) পালনকারী। আয়িশাহ (রাযিঃ) বলেন, অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাইরে চলে গেলেন। পরে আমাদের জন্য হাদিয়াহ (হাদিয়া/উপহার) হিসেবে কিছু জিনিস আসলো এবং সাথে সাথে আমাদের কাছে কিছু সংখ্যক মেহমানও আসলো। তিনি আরো বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ফিরে আসলেন, আমি বললাম, হে আল্লাহর রসূল! আমাদের কাছে উপঢৌকন হিসেবে কিছু জিনিস এসেছে এবং কয়েকজন মেহমানও এসেছে (তাই হাদিয়্যার বেশীর ভাগ তাদেরকে খাইয়ে দিয়েছি)। আমি তা থেকে কিছু অংশ আপনার জন্য লুকিয়ে রেখেছি। তিনি বললেন, তা কী? আমি বললাম, তা হলো হায়স (খেজুর, পনির ও আটার সমন্বয়ে তৈরি হালুয়া)। তিনি বললেন, তা নিয়ে এসো। অতঃপর আমি তা নিয়ে আসলাম। তিনি তা খেয়ে বললেন, আমি ভোরে সিয়াম পালন করেছিলাম। ত্বলহাহ বলেন, আমি এ হাদীসটি মুজাহিদের কাছে বর্ণনা করলাম। তিনি বলেন, এটা (এভাবে নাফল সিয়াম ভেঙে ফেলা) এমন ব্যক্তির সাথে তুল্য যে নিজের সম্পদ থেকে সদাকাহ্ বের করে। অতঃপর সে ইচ্ছা করলে তা দিতেও পারে আর রেখেও দিতে পারে। (ইসলামিক ফাউন্ডেশন ২৫৮১, ইসলামীক সেন্টার ২৫৮০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 2715,
			"arabicnumber": "1154.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৫, আন্তর্জাতিক নাম্বারঃ ১১৫৪ ২৬০৫-(১৭০/...) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... উম্মুল মুমিনীন আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে এসে বললেন, তোমাদের কাছে কিছু আছে কি? আমরা বললাম, না। তিনি বললেন, তাহলে আমি সিয়াম (রোজা/রোযা) পালন করলাম। আর একদিন তিনি আমাদের কাছে আসলেন। আমরা বললাম, হে আল্লাহর রসূল! আমাদেরকে ‘হায়স' (ঘি বা পনির মিশ্রিত খেজুর) হাদিয়াহ দেয়া হয়েছে। তিনি বললেন, আমাকে তা দেখাও; অবশ্য আমি সকালে সিয়ামের নিয়্যাত করেছি। অতঃপর তিনি তা খেলেন। (ইসলামিক ফাউন্ডেশন ২৫৮২, ইসলামীক সেন্টার ২৫৮১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 2716,
			"arabicnumber": "1155",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৬, আন্তর্জাতিক নাম্বারঃ ১১৫৫ ২৬০৬-(১৭১/১১৫৫) আমর ইবনু মুহাম্মাদ আন্‌ নাকিদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি সিয়াম (রোজা/রোযা) অবস্থায় ভুলে কিছু খেয়েছে বা পান করেছে সে যেন তার সিয়াম (রোজা/রোযা) পূর্ণ করে। কেননা আল্লাহই তাকে খাইয়েছেন ও পান করিয়েছেন। (ইসলামিক ফাউন্ডেশন ২৫৮৩, ইসলামীক সেন্টার ২৫৮২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 2717,
			"arabicnumber": "1156.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৭, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬০৭-(১৭২/১১৫৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি রমযান মাস ছাড়া অন্য কোন সময় পূর্ণ মাস সিয়াম (রোজা/রোযা) পালন করতেন? তিনি বললেন, আল্লাহর শপথ তিনি আজীবন রমযান ছাড়া অন্য কোন সময় পূর্ণ এক মাস সিয়াম (রোজা/রোযা) পালন করেননি। আর এমন কোন মাসও অতিবাহিত হয়নি যাতে তিনি অন্তত কিছু সিয়াম (রোজা/রোযা) পালন করেননি। (ইসলামিক ফাউন্ডেশন ২৫৮৪, ইসলামীক সেন্টার ২৫৮৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 2718,
			"arabicnumber": "1156.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৮, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬০৮-(১৭৩/...) উবায়দুল্লাহ ইবনু মুআয (রহঃ) ..... 'আবদুল্লাহ ইবনু শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কখনও একটি পূর্ণ মাস (নাফল) সিয়াম (রোজা/রোযা) পালন করতেন? তিনি বললেন, আমার জানা মতে তার ইন্তিকালের পূর্ব পর্যন্ত তিনি রমযান মাস ছাড়া অন্য কোন সময়ে পূর্ণ মাস সিয়াম পালন করেননি। আর এমন কোন মাসও কাটেনি যে মাসে তিনি (দু’একটি) সিয়াম পালন করেননি। (ইসলামিক ফাউন্ডেশন ২৫৮৫, ইসলামীক সেন্টার ২৫৮৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 2719,
			"arabicnumber": "1156.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬০৯, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬০৯-(১৭৩/...) আবূ রবী' আয যাহরানী (রহঃ) ... আবদুল্লাহ ইবনু শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সিয়াম (রোজা/রোযা) সম্বন্ধে জিজ্ঞেস করলাম। তিনি বললেন, তিনি একাধারে সিয়াম পালন করে যেতেন যাতে আমরা বলাবলি করতাম, তিনি অনেক সিয়াম পালন করেছেন। আর কখনো তিনি একাধারে পানাহার (সিয়াম পালন না করে) কাটিয়ে দিতেন। যাতে আমরা বলাবলি করতাম, তিনি অনেক দিন যাবৎ সিয়াম পালন করেননি, তিনি অনেক দিন সিয়াম পালন করেননি। আয়িশাহ (রাযিঃ) আরো বলেন, তিনি মদীনায় আসার পর আমি তাকে রমযান মাস ছাড়া কখনো পূর্ণ একটি মাস সিয়াম পালন করতে দেখিনি। (ইসলামিক ফাউন্ডেশন ২৫৮৬, ইসলামীক সেন্টার ২৫৮৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": "1156.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১০, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬১০-(.../...) কুতায়বাহ্ (রহঃ) ..... আবদুল্লাহ ইবনু শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে জিজ্ঞেস করলাম ... উপরের হাদীসের অনুরূপ। তবে এ সানাদে অধঃস্তন রাবী হিশাম ও মুহাম্মাদের নাম উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ২৫৮৭, ইসলামীক সেন্টার ২৫৮৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": "1156.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১১, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬১১-(১৭৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মুল মুমিনীন আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একাধারে সিয়াম (রোজা/রোযা) পালন করতে থাকতেন। ফলে আমরা বলাবলি করতাম, তিনি আর সিয়াম ভঙ্গ করবেন না। আবার এমনভাবে তিনি ক্রমাগত সিয়াম ছাড়তে থাকতেন যাতে আমরা বলতাম, তিনি বুঝি আর (এ মাসে) সিয়াম পালন করবেন না। আমি তাকে কখনো রমযান মাস ছাড়া অন্য কোন মাসে অধিক সিয়াম পালন করতেও দেখিনি। (ইসলামিক ফাউন্ডেশন ২৫৮৮, ইসলামীক সেন্টার ২৫৮৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": "1156.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১২, আন্তর্জাতিক নাম্বারঃ ১১৫৬ ২৬১২-(১৭৬/...) আবূ বাকর ইবনু আবূ শায়বাহ ও আমর আন্‌ নাকিদ (রহঃ) ..... আবূ সালামাহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ্ (রাযিঃ) কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সিয়াম (রোজা/রোযা) সম্পর্কে জিজ্ঞেস করলাম। তিনি বলেন, কখনো কখনো একাধারে সিয়াম পালন করে যেতেন যে, আমরা বলতাম, তিনি সিয়াম পালন করে যাচ্ছেন (হয়ত আর বিরত হবেন না)। আবার তিনি কখনো কখনো একাধারে সিয়াম পালন না করে অতিবাহিত করতেন যে, আমরা বলতাম, হয়ত তিনি আর সিয়াম (রোজা/রোযা) পালন করবেন না। আমি তাকে শা'বান মাসের চেয়ে অন্য কোন মাসে এত অধিক (নাফল) সিয়াম পালন করতে দেখিনি। তিনি পুরো শাবান মাসেই সিয়াম পালন করতেন (অর্থাৎ কয়েক দিন ছাড়া পূর্ণ শাবান মাস সিয়াম পালন করতেন)। (ইসলামী ফাউন্ডেশন ২৫৮৯, ইসলামীক সেন্টার ২৫৮৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": "782.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৩, আন্তর্জাতিক নাম্বারঃ ৭৮২ ২৬১৩-(১৭৭/৭৮২) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শা'বান মাসে যত সিয়াম (রোজা/রোযা) পালন করতেন সারা বছরে অন্য কোন মাসে তিনি এত অধিক সিয়াম (রোজা/রোযা) পালন করতেন না। আর তিনি (লোকদের উদ্দেশে) বলতেন, \"তোমরা নিজ নিজ সামর্থ্য অনুযায়ী যত বেশী পার আমল কর। কেননা, আল্লাহ তা'আলা (তোমাদেরকে সাওয়াব দানে) ক্লান্ত বা বিরক্ত হবেন না যতক্ষণ তোমরা অক্ষম হয়ে না পড়বে। তিনি আরো বলেন, আল্লাহ তা'আলার কাছে সবচেয়ে প্রিয় ‘আমল হচ্ছে যা কোন বান্দা অব্যাহতভাবে করে থাকে- যদিও তা পরিমাণে কম হয়। (ইসলামিক ফাউন্ডেশন ২৫৯০, ইসলামীক সেন্টার ২৫৮৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": "1157.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৪, আন্তর্জাতিক নাম্বারঃ ১১৫৭ ২৬১৪-(১৭৮/১১৫৭) আবূ রবী যাহরানী (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাস ছাড়া আর কখনো পূর্ণ মাস সিয়াম (রোজা/রোযা) পালন করতেন না। তিনি যখন সিয়াম (রোজা/রোযা) পালন করতেন তখন ক্রমাগত সিয়াম পালন করে যেতেন। ফলে লোকেরা বলত, আল্লাহর কসম! হয়ত তিনি আর সিয়াম ভঙ্গ করবেন না। আবার যখন তিনি সিয়াম ছেড়ে দিতেন একাধারেই বিরতি দিতে থাকতেন। এমনকি লোকেরা বলত আল্লাহর কসম! তিনি হয়ত আর সিয়াম পালন করবেন না।*(ইসলামিক ফাউন্ডেশন ২৫৯১, ইসলামীক সেন্টার ২৫৯০) * এসব বর্ণনা থেকে জানা যায় যে, বছরের বারো মাস ধরেই সওম পালন সুন্নাতের খেলাফ এবং একে ভাল মনে করা বিদ’আত এবং রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হিদায়াতের বিপরীত। মুসলিমদেরকে কেবল পূর্ণ রমযান মাসের সওম পালন করতে বলা হয়েছে। রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি মাসেই কিছু কিছু সওম পালন করতেন, বিশেষ করে শাবান মাসে তুলনামূলক বেশি কেননা এটা রমযানের পূর্ব প্রস্তুতি। আর এখানে যে কসম খাওয়া হয়েছে তা স্বভাবগত কসম, যে সম্পর্কে আল্লাহ তা'আলা ইরশাদ করেন, অর্থাৎ এ ধরনের কসমের কারণে পাকড়াও হবে না।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": "1157.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৫, আন্তর্জাতিক নাম্বারঃ ১১৫৭ ২৬১৫-(.../...) মুহাম্মদ ইবনু বাশশার ও আবূ বাকর ইবনু নাফি (রহঃ) ..... আবূ বিশর (রহঃ) এর সূত্রে এ সানাদে উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এতে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনাতে আসার পর কখনো একাধারে এক মাস (নাফল) সিয়াম (রোজা/রোযা) পালন করেননি। (ইসলামিক ফাউন্ডেশন ২৫৯২, ইসলামীক সেন্টার ২৫৯১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": "1157.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৬, আন্তর্জাতিক নাম্বারঃ ১১৫৭ ২৬১৬-(১৭৯/...) আবূ বাকর ইবনু আবূ শায়বাহ ও ইবনু নুমায়র (রহঃ) ..... উসমান ইবনু হাকীম আল আনসারী (রহঃ) বলেন, আমি রজব মাসের সিয়াম (রোজা/রোযা) সম্পর্কে সাঈদ ইবনু জুবায়র কে জিজ্ঞেস করলাম। তিনি বললেন, আমি ইবনু আব্বাস (রাযিঃ) কে বলতে শুনেছি, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একাধারে সিয়াম (রোজা/রোযা) পালন করতে থাকতেন যাতে আমরা বলতাম, তিনি হয়ত আর সিয়াম (রোজা/রোযা) ছাড়বেন না। আবার তিনি এমনভাবে ক্রমাগত সিয়াম (রোজা/রোযা) না রেখে থাকতেন যাতে আমরা বলতাম, তিনি বুঝি আর (এ মাসে) সিয়াম (রোজা/রোযা) পালন করবেন না। (ইসলামিক ফাউন্ডেশন ২৫৯৩, ইসলামীক সেন্টার ২৫৯২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": "1157.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৭, আন্তর্জাতিক নাম্বারঃ ১১৫৭ ২৬১৭-(.../...) ‘আলী ইবনু হুজর ও ইবরাহীম ইবনু মূসা (রহঃ) ..... উসমান ইবনু হাকীম (রহঃ) থেকে এ সূত্রেও উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৫৯৪, ইসলামীক সেন্টার ২৫৯৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": "1158",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৮, আন্তর্জাতিক নাম্বারঃ ১১৫৮ ২৬১৮-(১৮০/১১৫৮) যুহায়র ইবনু হারব, ইবনু আবূ খালাফ ও আবূ বাকর ইবনু নাফি (রহিমাহুমুল্লাহ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিয়াম (রোজা/রোযা) পালন করে যেতেন, এমনকি বলা হত তিনি অনেক সিয়াম পালন করেছেন,তিনি অনেক সিয়াম পালন করেছেন। আবার তিনি সিয়াম থেকে এমনভাবে বিরত থাকতেন যে, বলা হত তিনি অনেক দিন সিয়াম (রোজা/রোযা) থেকে বিরত রয়েছেন, অনেক দিন বিরত রয়েছেন। (ইসলামিক ফাউন্ডেশন ২৫৯৫, ইসলামীক সেন্টার ২৫৯৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": "1159.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬১৯, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬১৯-(১৮১/১১৫৯) আবূ ত্বহির ও হারমালাহ্ ইবনু ইয়াহইয়া (রহিমাহুমাল্লাহ) ..... 'আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে অবহিত করা হলো যে, আমি বলছি, আমি যতদিন বেঁচে থাকব সারা রাতে সালাত (সালাত/নামাজ/নামায) আদায় করব এবং সর্বদা দিনের বেলা সিয়াম (রোজা/রোযা) পালন করব। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমাকে) জিজ্ঞেস করলেন, তুমি কি এ কথা বলেছ? আমি তাকে বললাম, হে আল্লাহর রসূল! আমি এ কথা বলেছি। তিনি বললেন, তুমি এ কাজ করতে পারবে না, কারণ তোমার সে সামর্থ্য নেই। পড়, নিদ্রাও যাও। আর প্রতি মাসে তিনদিন করে সিয়াম পালন কর। কেননা প্রত্যেক নেক কাজের জন্য দশগুণ সাওয়াব পাওয়া যায়। এতেই সারা জীবন সিয়াম পালন করার সাওয়াব পাওয়া যাবে। রাবী বলেন, আমি আরয করলাম, আমি এর চেয়েও বেশী করার সামর্থ্য রাখি। তিনি বললেন, তবে একদিন সিয়াম (রোজা/রোযা) পালন কর এবং অতঃপর দুদিন সিয়াম পালন থেকে বিরত থাক। বর্ণনাকারী বলেন, আমি বললাম, \"হে আল্লাহর রসূল! আমি এর চেয়েও বেশী করতে সক্ষম। তিনি বললেন, তাহলে তুমি একদিন সিয়াম পালন কর এবং একদিন বিরত থাক। এটাই দাউদ (আঃ)-এর সিয়াম। আর এর চেয়ে উত্তম আর কিছু নেই। 'আবদুল্লাহ ইবনু আমর (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নির্দেশ মত তিন দিনের সিয়াম পালন করাকে যদি আমি গ্রহণ করে নিতাম তাহলে এটা আমার কাছে আমার পরিবার-পরিজন ও ধন-সম্পদের চেয়েও পছন্দনীয় হত। (ইসলামিক ফাউন্ডেশন ২৫৯৬, ইসলামীক সেন্টার ২৫৯৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": "1159.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২০, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২০-(১৮২/...) আবদুল্লাহ ইবনু মুহাম্মাদ আর রূমী (রহঃ) ..... ইয়াহইয়া (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ও আবদুল্লাহ ইবনু ইয়াযীদ আবূ সালামার সাথে সাক্ষাতের উদ্দেশে রওনা হলাম। অবশেষে আমরা তার বাড়িতে গিয়ে পৌছলাম। তার বাড়ির সামনেই ছিল একটি মসজিদ। আমরা সেখানে গিয়ে বসলাম এবং তাকে খবর দেয়ার জন্য একটি লোক পাঠালাম। তিনি বাড়ির ভিতর থেকে বের হয়ে আমাদের কাছে এসে বললেন, তোমরা ইচ্ছে করলে ঘরে গিয়েও বসতে পার অথবা এখানেও বসতে পার। আমরা বললাম, অবশ্যই আমরা এখানে বসব। অতঃপর তিনি আমাদের কাছে হাদীস বর্ণনা করতে শুরু করলেন। তিনি বললেন, 'আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) আমার কাছে বলেছেন, আমি সর্বদা সিয়াম (রোজা/রোযা) পালন করতাম এবং প্রতি রাতেই (রাত ভর) কুরআন তিলাওয়াত করতাম। পরে হয়ত বা আমার ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আলোচনা করা হয়েছে অথবা (রাবীর সন্দেহ) তিনি নিজেই আমাকে ডেকে পাঠিয়েছেন। আমি গিয়ে তার কাছে হাজির হলাম। তিনি বললেন, আমি জানতে পারলাম, তুমি নাকি সর্বদা সিয়াম পালন কর এবং প্রতি রাতেই (সারা রাত) কুরআন তিলাওয়াত কর? আমি বললাম, হ্যাঁ, হে আল্লাহর নবী! আমি কল্যাণ লাভ করার উদেশেই তা করে থাকি। তিনি বললেন, প্রতি মাসে তিনটি করে সিয়াম (রোজা/রোযা) পালন করাই তোমার জন্য যথেষ্ট। তখন আমি বললাম, আমি এর চেয়েও বেশী করতে সক্ষম। তিনি বললেন, (এরূপ করো না)। কেননা তোমার উপর তোমার স্ত্রীর অধিকার রয়েছে, যারা তোমার সাথে সাক্ষাৎ করতে আসে তাদেরও তোমার উপর অধিকার রয়েছে। আর তোমার উপর তোমার দেহেরও হাক্ব (হক) আছে। তাই তুমি আল্লাহর নবী দাউদ (আঃ) এর সিয়াম অনুসরণ কর। কেননা তিনি মানুষের মধ্যে সবচেয়ে বেশী ইবাদাত করতেন। আবদুল্লাহ ইবনু 'আমর (রাযিঃ) বলেন, আমি রললাম, হে আল্লাহর নবী দাউদ (আঃ) এর সিয়াম কী? তিনি বললেন, দাউদ (আঃ) একদিন সিয়াম পালন করতেন এবং একদিন পালন করতেন না (অর্থাৎ একদিন পরপর সিয়াম পালন করতেন)। তিনি (আরো) বললেন, তুমি প্রতি মাসে একবার কুরআন খতম কর। আমি বললাম, হে আল্লাহর নবী! আমি এর চেয়েও বেশী পড়ার সামর্থ রাখি। তিনি বললেন, তাহলে তুমি প্রতি বিশ দিনে একবার কুরআন খতম কর। আমি আরয করলাম, হে আল্লাহর নবী! আমি এর চেয়েও বেশী করতে সক্ষম। তিনি বললেন, তাহলে তুমি প্রতি দশ দিনে একবার কুরআন খতম কর। আমি আবার বললাম, হে আল্লাহর নবী এর চেয়েও বেশী পারি। তিনি বললেন, তুমি সাতদিন অন্তর কুরআন খতম কর, তবে এর চেয়ে বেশী পড়ো না। কেননা তোমার উপর তোমার স্ত্রীর হাক্ব (হক) আছে, তোমার সাক্ষাতপ্রার্থীদেরও তোমার উপর হাক্ব (হক) আছে, আর তোমার শরীরেরও তোমার উপর হাক্ব (হক) আছে। আবদুল্লাহ (রাযিঃ) বলেন, আমি (সর্বদা সিয়াম পালন করে) নিজের উপর কঠোরতা করেছি। ফলে (আমার উপরও) কঠোরতা চেপে বসেছে। তিনি আরো বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছিলেন, তোমার জানা নেই হয়ত বা তুমি দীর্ঘায়ু লাভ করবে (তখন তোমার পক্ষে এত বেশী 'আমল করা অসম্ভব হয়ে পড়বে)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা বলেছিলেন বাস্তবে তাই হলো। আমি যখন বয়োবৃদ্ধ হয়ে পড়লাম তখন অনুশোচনা করে বলতাম, \"হায়! আমি যদি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দেয়া অবকাশটুকু গ্রহণ করতাম! (ইসলামিক ফাউন্ডেশন ২৫৯৭, ইসলামীক সেন্টার ২৫৯৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": "1159.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২১, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২১-(১৮৩/...) যুহায়র ইবনু হাব (রহঃ) ..... ইয়াহইয়া ইবনু আবূ কাসীর (রহঃ) কর্তৃক এ সানাদে উপরের হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে প্রতি মাসে তিনদিন করে সিয়াম (রোজা/রোযা) পালন করাই যথেষ্ট'- এ কথার পরে আরো আছে, “কেননা প্রত্যেক নেক কাজের বিনিময়ে তার দশগুণ সাওয়াব পাওয়া যায়, আর এভাবে তা সারা বছরের সিয়ামের সমতুল্য গণ্য হয়”। তিনি তার বর্ণিত হাদীসে আরো উল্লেখ করেছেন, “আমি বললাম, আল্লাহর নবী দাউদ (আঃ) এর সিয়াম কী (ছিল)? তিনি বললেন, বছরের অর্ধেক (অর্থাৎ একদিন সিয়াম পালন করা ও একদিন সিয়াম ভাঙ্গা)। তিনি (এ হাদীসে) কুরআন তিলাওয়াতের প্রসঙ্গে কিছুই উল্লেখ করেননি। এ বর্ণনায় তিনি “তোমার সাক্ষাত-প্রার্থীদেরও তোমার উপর হাক্ব (হক) আছে\"- এ কথাটি উল্লেখ করেননি। বরং এতে আছেঃ তোমার সন্তানেরও তোমার উপর হাক্ব (হক) আছে। (ইসলামিক ফাউন্ডেশন ২৫৯৮, ইসলামীক সেন্টার ২৫৯৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": "1159.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২২, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২২-(১৮৪/...) কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি প্রতি মাসে একবার করে সম্পূর্ণ কুরআন পাঠ কর। আবদুল্লাহ (রাযিঃ) বলেন, আমি বললাম, আরো বেশী পড়ার সামর্থ রাখি। তিনি বললেন, তাহলে তুমি বিশ দিন অন্তর একবার কুরআন খতম কর। রাবী বলেন, আমি আবার আরয করলাম, আমার আরো (বেশী পাঠ করার) শক্তি আছে। তিনি বললেন, তাহলে তুমি সাত দিন অন্তর একবার সম্পূর্ণ কুরআন পাঠ কর। তবে এর চেয়ে বেশী (তিলাওয়াত) করো না। (কারণ এর চেয়ে কম সময়ের মধ্যে কুরআন খতম করলে কুরআন নিয়ে চিন্তা-ভাবনা করা এবং এর মর্ম উপলব্ধি করার সুযোগ হয় না)।* (ইসলামিক ফাউন্ডেশন ২৫৯৯, ইসলামীক সেন্টার ২৫৯৮) * এ বর্ণনাসমূহ থেকে জানা গেল যে, রমযান মাসের এক রাত্রিতে পূর্ণাঙ্গ কুরআন মাজীদ খতম করার যে রীতি প্রচলিত আছে এবং কুরআনের হাফিযগণ এতে গর্ববোধ করেন তা সুন্নাতের খেলাফ এবং প্রকৃতপক্ষে বিদ’আত। আর বিশেষ করে এতে হাফিযদের এবং যে সকল ব্যক্তি এতে অংশগ্রহণ করে তাদের গর্ব করা যে, আমি একরাত্রিতে কুরআন খতম করেছি বা এতে অংশগ্রহণ করেছি এটা স্পষ্ট আহম্মকী ছাড়া আর কিছুই নয়।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": "1159.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৩, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৩-(১৮৫/...) আহমাদ ইবনু ইউসুফ আল আযদী (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আবদুল্লাহ! (বেশী বেশী রাত জেগে) তুমিও অমুক ব্যক্তির মতো হয়ে যেও না। সে রাত জেগে জেগে সালাত (সালাত/নামাজ/নামায) আদায় করত, অতঃপর রাত জেগে ইবাদাত করা ছেড়ে দিয়েছে। (ইসলামিক ফাউন্ডেশন ২৬০০, ইসলামীক সেন্টার ২৫৯৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": "1159.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৪, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৪-(১৮৬/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানতে পারলেন, আমি অনবরত সিয়াম (রোজা/রোযা) পালন করি এবং রাত ভর সালাত (সালাত/নামাজ/নামায) আদায় করি। তিনি আমাকে ডেকে পাঠালেন অথবা (রাবীর সন্দেহ) আমি তার সাথে দেখা করি। তিনি বললেন, আমি খবর পেয়েছি, তুমি অনবরত সিয়াম পালন কর, বিরতি দাও না, আর রাত ভর সালাত আদায় কর। এরপর আর এরূপ করবে না। কেননা তোমার উপর তোমার চোখের অংশ (হাক্ব (হক)) আছে, তোমার দেহ ও আত্মার অংশ আছে এবং তোমার পরিবার-পরিজনেরও অংশ আছে। কাজেই তুমি সিয়ামও পালন কর, বিরতিও দাও, সালাতও আদায় কর, ঘুমও যাও। তুমি দশ দিনে একদিন সিয়াম পালন কর, তাহলে বাকি নয়টি দিনেরও সাওয়াব পাবে। তিনি বললেন, হে আল্লাহর নবী! আমি নিজের মধ্যে এর চেয়েও অধিক সিয়াম পালন করার শক্তি রাখি। তিনি বললেন, তাহলে তুমি দাউদ (আঃ)-এর মত সিয়াম পালন কর। তিনি (আবদুল্লাহ) বললেন, হে আল্লাহর নবী দাউদ (আঃ) কিভাবে সিয়াম পালন করতেন? তিনি (নবী) বললেন, দাউদ (আঃ) একদিন সিয়াম পালন করতেন এবং একদিন বিরতি দিতেন। এ জন্যেই (দুর্বল হতেন না এবং) দুশমনের সম্মুখীন হলে (ময়দান ছেড়ে) পালাতেন না। আবদুল্লাহ (রাযিঃ) বললেন, হে আল্লাহর নবী! এ ব্যাপারে কে আমার দায়িত্ব নিবে? আতা বলেন, আমি জানি না, অনবরত সিয়াম পালন করার বিষয়টি কিভাবে আলোচনায় আসল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যে ব্যক্তি অনবরত সিয়াম পালন করল সে যেন কোন সিয়ামই পালন করেনি। যে ব্যক্তি সব সময় সিয়াম পালন করল সে যেন সিয়ামই পালন করেনি, যে ব্যক্তি সদাসর্বদা সিয়াম পালন করল সে যেন সিয়ামই পালন করেনি। (ইসলামিক ফাউন্ডেশন ২৬০১, ইসলামীক সেন্টার ২৬০০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": "1159.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৫, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৫-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ... ইবনু জুরায়জ থেকে এ সূত্রে অনুরূপ হাদীস বর্ণিত হয়েছে এবং তিনি বলেছেন, আবূ আব্বাস শাইর (রহঃ) তাকে অবহিত করেছেন। (ইমাম মুসলিম বলেনঃ) তিনি হলেন আবূ আব্বাস আস্ সায়িব ইবনু ফাররূখ। তিনি মক্কার (মক্কা) অধিবাসী এবং বিশুদ্ধ ও নির্ভরযোগ্য ছিলেন। (ইসলামিক ফাউন্ডেশন ২৬০২, ইসলামীক সেন্টার ২৬০১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": "1159.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৬, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৬-(১৮৭/...) উবায়দুল্লাহ ইবনু মু'আয (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, হে আবদুল্লাহ ইবনু আমর! তুমি তো একাধারে সওম (রোযা) পালন করে যাচ্ছ। সারারাত ইবাদাতে দাঁড়িয়ে থাক। তুমি এরূপ করলে তাতে তোমার চোখ ক্ষতিগ্রস্ত হবে এবং দৃষ্টিশক্তি হারিয়ে ফেলবে। যে ব্যক্তি সর্বদা সওম পালন করল, সে মূলত সওম পালন করল না। মাসে তিন দিন সওম পালন করা পূর্ণ মাস পালনের সমতুল্য। আমি বললাম, আমি এর চেয়েও বেশি সামর্থ্য রাখি। তিনি বললেন, দাউদ (আঃ) এর ন্যায় সওম পালন কর। তিনি একদিন সওম পালন করতেন এবং একদিন ছেড়ে দিতেন এবং পলায়ন করতেন না যখন শত্রুর সম্মুখীন হতেন। (ইসলামিক ফাউন্ডেশন ২৬০৩, ইসলামীক সেন্টার ২৬০২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": "1159.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৭, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৭-(.../...) আবূ কুরায়ব (রহঃ) ..... হাবীব ইবনু আবূ সাবিত (রহঃ) থেকে এ সানাদে অনুরূপ হাদীস বর্ণিত হয়েছে। এতে আরও আছে, \"এবং তুমি শ্ৰান্ত-ক্লান্ত হয়ে পড়বে।\" (ইসলামিক ফাউন্ডেশন ২৬০৪, ইসলামীক সেন্টার ২৬০৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": "1159.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৮, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৮-(১৮৮/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, আমাকে তোমার সম্পর্কে অবহিত করা হয়েছে যে, তুমি সারা রাত দাঁড়িয়ে সালাত (সালাত/নামাজ/নামায) আদায় কর এবং দিনের বেলা সওম রাখ? আমি বললাম, আমি অবশ্য করি। তিনি বলেন, তুমি এরূপ করতে গেলে অনিদ্রার কারণে তোমার চোখ কোটরগত হবে এবং তুমি দুর্বল হয়ে পড়বে। তোমার চোখের হাক্ব (হক) রয়েছে, তোমার দেহের হাক্ব (হক) রয়েছে এবং তোমার পরিবার-পরিজনের হাক্ব (হক) রয়েছে। অতএব তুমি রাতে ইবাদাতও করবে এবং নিদ্রাও যাবে। সওমও পালন করবে, আবার তা বাদও দিবে। (ইসলামিক ফাউন্ডেশন ২৬০৫, ইসলামীক সেন্টার ২৬০৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": "1159.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬২৯, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬২৯-(১৮৯/...) আবূ বাকর ইবনু আবূ শায়বাহ ও যুহায়র ইবনু হারব (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর নিকট পছন্দনীয় সওম হচ্ছে দাউদ (আঃ) এর সওম এবং তার নিকট পছন্দনীয় সালাত (সালাত/নামাজ/নামায) হচ্ছে দাউদ (আঃ) এর সালাত। তিনি অর্ধরাত ঘুমাতেন। অতঃপর এক-তৃতীয়াংশ রাত ইবাদাতে থাকতেন। অতঃপর এক-ষষ্ঠাংশ রাত ঘুমাতেন। তিনি একদিন সওম পালন করতেন এবং একদিন বাদ দিতেন। (ইসলামিক ফাউন্ডেশন ২৬০৬, ইসলামীক সেন্টার ২৬০৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": "1159.12",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩০, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬৩০-(১৯০/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবদুল্লাহ ইবনু 'আমর ইবনুল ‘আস (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর নিকট সর্বাধিক প্রিয় সওম হচ্ছে দাউদ (আঃ) এর সওম। তিনি বছরের অর্ধেক কাল সওম পালন করতেন। মহান আল্লাহর নিকট সর্বাধিক পছন্দনীয় সালাত (সালাত/নামাজ/নামায) হচ্ছে দাউদ (আঃ) এর সালাত। তিনি অর্ধ রাত ঘুমাতেন, অতঃপর সালাতে দাঁড়াতেন, অতঃপর শেষ রাতে ঘুমিয়ে যেতেন। তিনি অর্ধ রাত অতিক্রান্ত হবার পর এক-তৃতীয়াংশ রাত ইবাদাত করতেন। রাবী ইবনু জুরায়জ (রহঃ) বলেন, আমি 'আমর ইবনু দীনারকে বললাম, আমর ইবনুল আস (রাযিঃ) কি এ কথা বলতেন যে, তিনি অর্ধরত অতিক্রান্ত হবার পর এক-তৃতীয়াংশ রাত ইবাদাতে থাকতেন? তিনি বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ২৬০৭, ইসলামীক সেন্টার ২৬০৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": "1159.13",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩১, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬৩১-(১৯১/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ কিলাবাহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমাকে আবুল মালীহ (রহঃ) অবহিত করেছেন, তিনি বলেছেনঃ আমি তোমার পিতার সাথে ‘আবদুল্লাহ ইবনু 'আমর (রাযিঃ) এর কাছে গেলাম। তিনি আমাদের নিকট বললেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আমার সওম সম্পর্কে উল্লেখ করা হলে তিনি আমার কাছে এলেন। আমি তার জন্য একটি চামড়ার বালিশ বিছিয়ে দিলাম। তাতে খেজুরের আঁশ ভর্তি ছিল। তিনি মাটির উপর বসে গেলেন এবং বালিশটি তার ও আমার মাঝে পড়ে থাকল। তিনি আমাকে বললেন, প্রতি মাসে তিনদিন সওম পালন করা কি তোমার জন্য যথেষ্ট নয়? আমি বললাম, হে আল্লাহর রসূল (আমি এর অধিক সওম পালন করতে সক্ষম) তিনি বললেন, তাহলে পাঁচদিন। আমি বললাম হে আল্লাহর রসূল (আমি এর চেয়ে বেশি সামর্থ্য রাখি)। তিনি বললেন, তাহলে সাতদিন? আমি বললাম, হে আল্লাহর রসূল! আমি এর অধিক সামর্থ্য রাখি। তিনি বললেন, তাহলে নয়দিন। আমি বললাম, হে আল্লাহর রসূল (আমি এর অধিক সামর্থ্য রাখি)। তিনি বললেন, তাহলে এগার দিন। আমি বললাম, হে আল্লাহর রসূল (আমি এর অধিক সামর্থ্য রাখি) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, দাউদ (আঃ) এর সওমের উপর কোন সওম নেই। তিনি বছরের অর্ধেক অর্থাৎ একদিন যদি এ সওম পালন করতেন, আরেক দিন বাদ দিতেন। (ইসলামিক ফাউন্ডেশন ২৬০৮, ইসলামীক সেন্টার ২৬০৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": "1159.14",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩২, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬৩২-(১৯২/...) আবূ বাকর ইবনু আবূ শায়বাহ ও মুহাম্মাদ ইবনুল মুসান্না (রহিমাহুমাল্লাহ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেন, তুমি একদিন সওম পালন করলে পরের দিনের সাওয়াব পাবে। তিনি বলেন, আমি আরও অধিক রাখতে সক্ষম। তিনি বললেন, তুমি দু'দিন সওম পালন কর। তাহলে অবশিষ্ট দিনগুলোর সাওয়াব পাবে। তিনি বললেন, আমি আরও অধিক সওম পালন করতে সক্ষম। তিনি বললেন, তুমি তিনদিন সওম পালন কর তাহলে অবশিষ্ট দিনগুলোরও সাওয়াব পাবে। তিনি বললেন, আমি আরও অধিক রাখতে সক্ষম। তিনি বললেন, তুমি চারদিন সওম পালন কর, তাহলে অবশিষ্ট দিনগুলোরও সাওয়াব লাভ করবে। তিনি বললেন, আমি আরও অধিক রাখতে সক্ষম। তিনি বললেন, তুমি দাউদ (আঃ) এর সওম পালন কর যা আল্লাহর কাছে সর্বোত্তম সওম। তিনি পর্যায়ক্রমে একদিন সওম পালন করতেন এবং পরের দিন বাদ দিতেন। (ইসলামিক ফাউন্ডেশন ২৬০৯, ইসলামীক সেন্টার ২৬০৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": "1159.15",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৩, আন্তর্জাতিক নাম্বারঃ ১১৫৯ ২৬৩৩-(১৯৩/...) যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু হাতিম (রহিমাহুমাল্লাহ) ..... আবদুল্লাহ ইবনু 'আমর (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, হে আবদুল্লাহ ইবনু আমর! আমি জানতে পেরেছি যে, তুমি দিনের বেলা সওম পালন কর এবং রাতের বেলা সালাতে থাক, তুমি এরূপ করো না। কারণ তোমার উপর তোমাদের দেহের একটি অংশ (হাক্ব (হক)) রয়েছে, তোমার উপর তোমার চোখের অংশ রয়েছে এবং তোমার উপর তোমার স্ত্রীর অংশ রয়েছে। তুমি সওমও পালন কর এবং বাদও দাও। প্রতি মাসে তিনদিন করে সওম পালন কর এবং এটাই হল সারা বছরের সওম (এর নিয়ম)। আমি বললাম, হে আল্লাহর রসূল! আমার আরও শক্তি আছে। তিনি বললেন, তাহলে দাউদ (আঃ) এর সওম এর মতো সওম পালন কর। পর্যায়ক্রমে একটি সওম পালন কর এবং একদিন বাদ দাও। 'আবদুল্লাহ (রাযিঃ) বলতেন, হায়! আমি যদি সহজটার উপর আমল করতাম! (ইসলামিক ফাউন্ডেশন ২৬১০, ইসলামীক সেন্টার ২৬০৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": "1160",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৪, আন্তর্জাতিক নাম্বারঃ ১১৬০ ২৬৩৪-(১৯৪/১১৬০) শায়বান ইবনু ফারুখ (রহঃ) ..... মুআযাহ্ আল আদাবিয়্যাহ (রহঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাঃ) এর কাছে জানতে চাইলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি প্রতি মাসে তিনদিন সওম পালন করতেন? তিনি বললেন, হ্যাঁ। আমি পুনরায় তাকে জিজ্ঞেস করলাম, মাসের কোন কোন দিন তিনি সওম পালন করতেন? আয়িশাহ্ (রাযিঃ) বললেন, তিনি মাসের যে কোন দিন সওম পালন করতে দ্বিধা করতেন না। (ইসলামিক ফাউন্ডেশন ২৬১১, ইসলামীক সেন্টার ২৬১০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": "1161.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৫, আন্তর্জাতিক নাম্বারঃ ১১৬১ ২৬৩৫-(১৯৫/১১৬১) আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আসমা আয যুবাঈ (রহঃ) ..... ইমরান ইবনু হুসায়ন (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন অথবা (অধঃস্তন রাবীর সন্দেহ) তিনি কোন ব্যক্তিকে বলেছেন এবং তিনি তা শুনলেন, হে অমুক তুমি কি এ মাসের মধ্যভাগে সওম পালন করেছিলে? সে বলল, না। তিনি বললেন, যখন তুমি তা ভঙ্গ করবে, তখন দু'দিন সওম পালন করবে। (ইসলামিক ফাউন্ডেশন ২৬১২, ইসলামীক সেন্টার ২৬১১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": "1162.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৬, আন্তর্জাতিক নাম্বারঃ ১১৬২ ২৬৩৬-(১৯৬/১১৬২) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী ও কুতায়বাহ ইবনু সাঈদ (রহিমাহুমাল্লাহ) ...... আবূ কাতাদাহ্ (রাযিঃ) থেকে বর্ণিত এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত হয়ে জিজ্ঞেস করল, আপনি কিভাবে সওম পালন করেন? তার এ কথায় রসূলুল্লাহ অসন্তুষ্ট হলেন। উমর (রাযিঃ) তার অসন্তোষ লক্ষ্য করে বললেন, “আমরা আল্লাহর উপর (আমাদের) প্রতিপালক হিসেবে, ইসলামের উপর (আমাদের) দীন হিসেবে এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর আমাদের নবী হিসেবে আমরা সন্তুষ্ট। আমরা আল্লাহর কাছে তার ও তার রসূলের অসন্তোষ থেকে আশ্রয় প্রার্থনা করি।” “উমর (রাযিঃ) কথাটি বার বার আওড়াতে থাকলেন, এমনকি শেষ পর্যন্ত রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অসন্তোষের ভাব দূরীভূত হল। তখন উমর (রাযিঃ) বললেন, হে আল্লাহর রসূল! যে ব্যক্তি সারা বছর সওম পালন করে তার অবস্থা কিরূপ? তিনি বললেন, সে সওম পালন করেনি এবং ছেড়েও দেয়নি। তিনি পুনরায় জিজ্ঞেস করলেন, যে পর্যায়ক্রমে দু'দিন সওম পালন করে ও একদিন সওম ত্যাগ করে, তার অবস্থা কীরূপ? তিনি বললেন, এ সামর্থ্য কার আছে? (অর্থাৎ সামর্থ্য) থাকলে বেশ ভাল কথা। তিনি পুনরায় জিজ্ঞেস করলেন, যে ব্যক্তি একদিন পর একদিন সওম পালন করে তার অবস্থা কিরূপ? তিনি বললেন, এটা দাউদ (আঃ) এর সওম। তিনি আবার জিজ্ঞেস করলেন, যে একদিন সওম পালন করে ও একদিন করে না, তার অবস্থা কিরূপ? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি আশা করি যে, আমার এতটা শক্তি হোক। তিনি পুনরায় বললেন, প্রতি মাসে তিনদিন সওম পালন করা এবং রমাযান মাসের সওম এক রমাযান থেকে পরবর্তী রমাযান পর্যন্ত সারা বছর সওম পালনের সমান। আর আরাফাহ দিবসের সওম সম্পর্কে আমি আল্লাহর কাছে আশাবাদী যে, তাতে পূর্ববর্তী বছর ও পরবর্তী বছরের গুনাহের ক্ষতিপূরণ হয়ে যাবে। আর আশুরার সওম সম্পর্কে আমি আল্লাহর কাছে আশাবাদী যে, তাতে পূর্ববর্তী বছরের গুনাহসমূহের কাফফারাহ হয়ে যাবে। (ইসলামিক ফাউন্ডেশন ২৬১৩, ইসলামীক সেন্টার ২৬১২) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। আরাফার দিনে হজ্জ সম্পাদনের কাজে রত থাকা ব্যক্তিগণ ছাড়া অন্য মুসলিমগণকে আরাফার দিনে রোজা রাখার প্রতি এই হাদীসটি উৎসাহ প্রদান করে। ২। আরাফার দিনের একটি রোজা তার পূর্বের এক বছর ও পরের এক বছরের পাপের কাফ্ফারা হয়ে যাওয়ার অর্থ হলো ছোটো ছোটো পাপের কাফ্ফারা এবং বড়ো পাপের ক্ষমা প্রাপ্ত হওয়ার জন্য তওবার আনুষঙ্গিক বিষয়ের সহিত তওবা করার প্রয়োজন রয়েছে। ৩। ইসলাম ধর্মের শিক্ষা মোতাবেক আল্লাহর নিকটে সৎকর্মের দ্বারা মুসলিম ব্যক্তি উচ্চমর্যাদা লাভ করতে পারবে।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": "1162.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৭, আন্তর্জাতিক নাম্বারঃ ১১৬২ ২৬৩৭-(১৯৭/...) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আবূ কাতাদাহ আল আনসারী (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সওম সম্পর্কে জিজ্ঞেস করা হল। এতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসন্তুষ্ট হলেন। তখন উমর (রাযিঃ) বললেন, আমরা আল্লাহর উপর (আমাদের) প্রতিপালক হিসেবে, ইসলামের উপর (আমাদের) দীন হিসেবে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর (আমাদের) রসূল হিসেবে এবং আমাদের কৃত বাই’আতের উপর আমরা সন্তুষ্ট। অতঃপর সারা বছর সওম পালন সম্পর্কে জিজ্ঞেস করা হল। তিনি বললেন, সে সওম পালন করেনি, ইফত্বারও করেনি, সে সওম পালন করেনি এবং সওমহীনও থাকেনি। অতঃপর একাধারে দু'দিন সওম পালন করা ও একদিন সওম পালন না করা সম্পর্কে জিজ্ঞেস করা হল। তিনি বললেন, এভাবে সওম পালনের সামর্থ্য কার আছে? অতঃপর একদিন সওম পালন ও দু'দিন সওম ত্যাগ করা সম্পর্কে জিজ্ঞেস করা হল। তিনি বললেন, আল্লাহ যেন আমাদের এরূপ সওম পালনের সামর্থ্য দান করেন। অতঃপর একদিন সওম পালন করা ও একদিন না করা সম্পর্কে জিজ্ঞেস করা হল। তিনি বললেন, তা আমার ভাই দাউদ (আঃ) এর সওম। অতঃপর সোমবারের সওম সম্পর্কে জিজ্ঞেস করা হলে তিনি বললেন, এ দিন আমি জন্মলাভ করেছি এবং এ দিনই আমি নুবুওয়াতপ্রাপ্ত হয়েছি বা আমার উপর (কুরআন) নাযিল করা হয়েছে। তিনি আরও বললেন, প্রতি মাসে তিনদিন এবং গোটা রমযান মাস সওম পালন করাই হল সারা বছর সওম পালনের সমতুল্য। অতঃপর আরাফাহ দিবসের সওম সম্পর্কে জিজ্ঞেস করা হলে তিনি বললেন, তাতে পূর্ববর্তী বছর ও পরবর্তী বছরের গুনাহের কাফফারাহ হয়ে যাবে। অতঃপর আশুরার সওম সম্পর্কে জিজ্ঞেস করা হলে তিনি বললেন, বিগত বছরের গুনাহের কাফফারাহ হয়ে যাবে। এ হাদীসে শু'বাহ এর বর্ণনায় আরও আছে, “অতঃপর সোমবার ও বৃহস্পতিবারের সওম সম্পর্কে জিজ্ঞেস করা হল।\" কিন্তু আমাদের বৃহস্পতিবারের কথা ভুলবশতঃ বর্ণিত হয়েছে, তাই আমরা তার উল্লেখ করা থেকে বিরত থাকলাম। (ইসলামিক ফাউন্ডেশন ২৬১৪, ইসলামীক সেন্টার ২৬১৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": "1162.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৮, আন্তর্জাতিক নাম্বারঃ ১১৬২ ২৬৩৮-(.../...) উবায়দুল্লাহ ইবনু মুআয, আবূ বকর ইবনু আবূ শায়বাহ ও ইসহাক ইবনু ইবরাহীম (রহিমাহুমাল্লাহ) ..... শু’বাহ্ (রহঃ) এর সূত্রে এ সানাদে উপরোক্ত হাদীস বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৬১৫, ইসলামীক সেন্টার ২৬১৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": "1162.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৩৯, আন্তর্জাতিক নাম্বারঃ ১১৬২ ২৬৩৯-(.../...) আহমাদ ইবনু সাঈদ আদ দারিমী (রহঃ) ..... গইলান ইবনু জারীর (রহঃ) এর সূত্রে এ সানাদে শুবাহ-এর সূত্রে বর্ণিত হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে তিনি (গইলান) সোমবারের উল্লেখ করেছেন কিন্তু বৃহস্পতিবারের উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ২৬১৬, ইসলামীক সেন্টার ২৬১৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": "1162.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪০, আন্তর্জাতিক নাম্বারঃ ১১৬২ ২৬৪০-(১৯৮/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ কতাদাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে সোমবারের সওম সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেন, ঐদিন আমি জন্মলাভ করেছি এবং ঐদিন আমার উপর (কুরআন) নাযিল হয়েছে। (ইসলামিক ফাউন্ডেশন ২৬১৭, ইসলামীক সেন্টার ২৬১৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": "1161.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪১, আন্তর্জাতিক নাম্বারঃ ১১৬১ ২৬৪১-(১৯৯/১১৬১) হাদ্দাব ইবনু খালিদ (রহঃ) ..... 'ইমরান ইবনু হুসায়ন (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে অথবা অপর কাউকে জিজ্ঞেস করলেন, তুমি কি শা'বান মাসের মধ্যভাগে সওম পালন করেছিলে? তিনি বললেন, না। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যখন তুমি সওম পালন করনি, তখন দু'দিন সওম পালন করে নিও। (ইসলামিক ফাউন্ডেশন ২৬১৮, ইসলামীক সেন্টার ২৬১৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": "1161.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪২, আন্তর্জাতিক নাম্বারঃ ১১৬১ ২৬৪২-(২০০/...) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... ইমরান ইবনু হুসায়ন (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে জিজ্ঞেস করলেন, তুমি কি এ মাসের মধ্যভাগে কিছু দিন সওম পালন করেছিলে? সে বলল, না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তার বদলে রমযানের সিয়াম (রোজা/রোযা) শেষ করে দু'দিন সিয়াম পালন করবে। (ইসলামিক ফাউন্ডেশন ২৬১৯. ইসলামীক সেন্টার ২৬১৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 2753,
			"arabicnumber": "1161.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৩, আন্তর্জাতিক নাম্বারঃ ১১৬১ ২৬৪৩-(২০১/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ইমরান ইবনু হুসায়ন (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বললেন, তুমি কি এক মাসের অর্থাৎ শা'বান মাসের মধ্যভাগে কিছু দিন সিয়াম (রোজা/রোযা) পালন করেছ? সে বলল, না। তিনি তাকে বললেন, রমাযানের সওম পালন শেষ করে তুমি একদিন বা দু'দিন সওম পালন কর। এ সম্পর্কে শুবাহ এর সন্দেহ রয়েছে এবং রাবী বলেন, আমার ধারণা যে, তিনি দু' দিনের কথা বলেছেন। (ইসলামিক ফাউন্ডেশন ২৬২০, ইসলামীক সেন্টার ২৬১৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": "1161.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৪, আন্তর্জাতিক নাম্বারঃ ১১৬১ ২৬৪৪-(.../...) মুহাম্মাদ ইবনু কুদামাহ ও ইয়াহইয়া ইবনু লু'লু'য়ী (রহিমাহুমাল্লাহ) ..... আবদুল্লাহ ইবনু হানী ইবনু আখী মুতাররিফ থেকে এ সানাদে অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৬২১, ইসলামীক সেন্টার ২৬২০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": "1163.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৫, আন্তর্জাতিক নাম্বারঃ ১১৬৩ ২৬৪৫-(২০২/১১৬৩) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযানের সিয়ামের পর সর্বোত্তম সওম হচ্ছে আল্লাহর মাস মুহাররমের সওম এবং ফারয (ফরয) সালাতের পর সর্বোত্তম সালাত (সালাত/নামাজ/নামায) হচ্ছে রাতের সালাত। (ইসলামিক ফাউন্ডেশন ২৬২২, ইসলামীক সেন্টার ২৬২১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": "1163.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৬, আন্তর্জাতিক নাম্বারঃ ১১৬৩ ২৬৪৬-(২০৩/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিজ্ঞেস করা হল, ফারয (ফরয) সালাত (সালাত/নামাজ/নামায) সমূহের পর কোন সালাত এবং রমযান মাসের সিয়ামের পর কোন সওম সর্বোত্তম? তিনি বললেন, ফারয সালাত সমূহের পর গভীর রাতের সালাত সর্বোত্তম এবং রমযান মাসের সিয়ামের পর আল্লাহর মাস মুহাররমের সওম সর্বোত্তম। (ইসলামিক ফাউন্ডেশন ২৬২৩, ইসলামীক সেন্টার ২৬২২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": "1163.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৭, আন্তর্জাতিক নাম্বারঃ ১১৬৩ ২৬৪৭-(.../...) আবূ বাকর ইবনু শায়বাহ্ (রহঃ) ..... 'আবদুল মালিক ইবনু উমায়র (রাযিঃ) থেকে এ সানাদে অনুরূপ হাদীস বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ২৬২৪, ইসলামীক সেন্টার ২৬২৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": "1164.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৮, আন্তর্জাতিক নাম্বারঃ ১১৬৪ ২৬৪৮-(২০৪/১১৬৪) ইয়াহইয়া ইবনু আইয়ুব, কুতায়বাহ ও আলী ইবনু হুজ্‌র (রহিমাহুমাল্লাহ) ..... আবূ আইয়্যুব আল আনসারী (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ রমযান মাসের সিয়াম (রোজা/রোযা) পালন করে পরে শাওয়াল মাসে ছয়দিন সিয়াম (রোজা/রোযা) পালন করা সারা বছর সওম পালন করার মত। (ইসলামিক ফাউন্ডেশন ২৬২৫, ইসলামীক সেন্টার ২৬২৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": "1164.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৪৯, আন্তর্জাতিক নাম্বারঃ ১১৬৪ ২৬৪৯-(.../...) ইবনু নুমায়র (রহঃ) ..... আবূ আইয়ুব আল আনসারী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তিনি পূর্বোক্ত হাদীসের অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ২৬২৬, ইসলামীক সেন্টার ২৬২৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": "1164.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫০, আন্তর্জাতিক নাম্বারঃ ১১৬৪ ২৬৫০-(.../...) আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... আবূ আইয়ূব (রাযিঃ) থেকে অনুরূপ বর্ণিত। (ইসলামিক ফাউন্ডেশন ২৬২৭, ইসলামীক সেন্টার ২৬২৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": "1165.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫১, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫১-(২০৫/১১৬৫) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কতিপয় সাহাবীকে স্বপ্ন দেখানো হল যে, (রমাযানের) শেষ সাত দিনের মধ্যে কদরের রাত নিহিত রয়েছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি মনে করি যে, শেষের সাতদিন সম্পর্কে তোমাদের সকলের স্বপ্ন পরস্পর সামঞ্জস্যপূর্ণ। অতএব যে ব্যক্তি তা অন্বেষণ করবে, সে যেন রমযানের শেষ সাতদিনের রাতগুলোতে তা অন্বেষণ করে। (ইসলামিক ফাউন্ডেশন ২৬২৮, ইসলামীক সেন্টার ২৬২৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": "1165.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫২, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫২-(২০৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু উমর (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, (রমাযানের) শেষ সাতদিনের রাতগুলোতে লায়লাতুল কদর অন্বেষণ কর। (ইসলামিক ফাউন্ডেশন ২৬২৯, ইসলামীক সেন্টার ২৬২৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": "1165.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৩, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫৩-(২০৭/...) আমর আন নাক্বিদ ও যুহায়র ইবনু হারব (রহিমাহুমাল্লাহ) ..... সালিম (রহঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি (পিতা) বলেন, এক ব্যক্তি (রমাযানের) ২৭ তম রাতে লায়লাতুল কদর দেখতে পেল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমাকেও তোমাদের মতো স্বপ্ন দেখানো হয়েছে যে, তা রমাযানের শেষ দশকে নিহিত আছে। অতএব এর বেজোড় রাতগুলোতে তা অনুসন্ধান কর। (ইসলামিক ফাউন্ডেশন ২৬৩০, ইসলামীক সেন্টার ২৬২৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": "1165.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৪, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫৪-(২০৮/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... সলিম ইবনু আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত, তার পিতা ['আবদুল্লাহ (রাযিঃ)] বলেছেনঃ আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে লায়লাতুল কদর সম্পর্কে বলতে শুনেছি, তোমাদের কতিপয় লোককে দেখনো হল যে, তা রমাযানের প্রথম সাতদিনের মধ্যে, আবার কতিপয় লোককে দেখানো হয়েছে যে, তা শেষ সাতদিনের মধ্যে। অতএব (রমাযানের) শেষ দশকের মধ্যে তা অন্বেষণ কর। (ইসলামিক ফাউন্ডেশন ২৬৩১, ইসলামীক সেন্টার ২৬৩০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": "1165.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৫, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫৫-(২০৯/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... উকবাহ ইবনু হুরায়স (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে বলতে শুনেছি, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (রমাযানের) শেষ দশ দিনে কদরের রাত অনুসন্ধান কর। তোমাদের কেউ যদি দুর্বল অথবা অপারগ হয়ে পড়ে, তবে সে যেন শেষের সাত রাতে অলসতা না করে। (ইসলামিক ফাউন্ডেশন ২৬৩২, ইসলামীক সেন্টার ২৬৩১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": "1165.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৬, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫৬-(২১০/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবালাহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করতে শুনেছি যে, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেনঃ যে ব্যক্তি কদরের রাত অনুসন্ধান করতে চায়, সে যেন (রমাযানের) শেষ দশকে তা অনুসন্ধান করে। (ইসলামিক ফাউন্ডেশন ২৬৩৩, ইসলামীক সেন্টার ২৬৩২)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": "1165.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৭, আন্তর্জাতিক নাম্বারঃ ১১৬৫ ২৬৫৭-(২১১/...) আবূ বকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (রমযানের) শেষ দশকে কদরের রাত অনুসন্ধান কর অথবা তিনি বলেছেন, শেষের নয় রাতে। (ইসলামিক ফাউন্ডেশন ২৬৩৪, ইসলামীক সেন্টার ২৬৩৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": "1166",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৮, আন্তর্জাতিক নাম্বারঃ ১১৬৬ ২৬৫৮-(২১২/১১৬৬) আবূ তহির ও হারমালাহ্ ইবনু ইয়াহইয়া (রহিমাহুমাল্লাহ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমাকে স্বপ্লে কদরের রাত দেখানো হয়েছিল। অতঃপর আমার পরিবারের কেউ আমাকে ঘুম থেকে জাগানোর ফলে আমাকে তা ভুলিয়ে দেয়া হয়েছে। সুতরাং তোমরা তা শেষ দশকে অন্বেষণ কর। রাবী হারমালাহ (রহঃ) বলেছেন, “আমি তা ভুলে গেছি\"। (ইসলামিক ফাউন্ডেশন ২৬৩৫, ইসলামীক সেন্টার ২৬৩৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": "1167.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৫৯, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৫৯-(২১৩/১১৬৭) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (রমাযানের) মাঝের দশকে ইতিকাফ করেন। অতঃপর ২০তম দিন অতিবাহিত হবার পর এবং ২১তম দিনের সূচনাতে তিনি নিজ বাসস্থানে ফিরে আসেন এবং তার সঙ্গে যারা ইতিকাফ করেন, তারাও নিজ নিজ আবাসে প্রত্যাবর্তন করেন। অতঃপর একবার রমাযান মাসের মাঝের দশকে তিনি ইতিকাফ করলেন- যে রাতে তার ইতিকাফ হতে ফিরে আসার কথা, সে রাতে (পুনরায়) ইতিকাফ আরম্ভ করলেন ও লোকদের উদ্দেশে ভাষণ দিলেন এবং তাদের প্রয়োজনীয় নির্দেশ দিলেন। এরপর তিনি বললেন, আমি সাধারণত এ (মধ্যম) দশকে ইতিকাফ করতাম। এরপর শেষ দশকেও ইতিকাফ করা আমার কাছে সমীচীন মনে হল। অতএব যে ব্যক্তি আমার সাথে ইতিকাফ করতে চায়, যেন নিজ ইতিকাফের স্থানে অবস্থান করে। আমি এ (কদরের) রাত স্বপ্নে দেখেছিলাম, কিন্তু আমাকে তা ভুলিয়ে দেয়া হয়েছে। অতএব তোমরা শেষ দশকের বেজোড় রাতগুলোতে তা অনুসন্ধান কর। আমি স্বপ্লে নিজেকে পানি ও কাদার মধ্যে সিজদা করতে দেখেছি। আবূ সাঈদ আল খুদরী (রাযিঃ) বলেন, ২১ তম রাতে আমাদের উপর বৃষ্টি বর্ষিত হয়। তিনি যখন ফজরের সালাত (সালাত/নামাজ/নামায) থেকে ফিরলেন, তখন আমি তার মুখমণ্ডল কাদা ও পানিতে সিক্ত দেখলাম। (ইসলামিক ফাউন্ডেশন ২৬৩৬, ইসলামীক সেন্টার ২৬৩৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": "1167.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬০, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৬০-(২১৪/....) ইবনু আবূ উমর (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাসের মাঝের দশকে ইতিকাফ করতেন। অবশিষ্ট বর্ণনা পূর্ববর্তী হাদীসের অনুরূপ। তবে এ বর্ণনায় আছে, \"সে যেন তার ইতিকাফের স্থানে অবস্থান করে।” তিনি আরো বলেন, “তার কপাল মুবারক কাদা ও পানিতে সিক্ত ছিল।\" (ইসলামিক ফাউন্ডেশন ২৬৩৭, ইসলামীক সেন্টার ২৬৩৬)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": "1167.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬১, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৬১-(২১৫/...) মুহাম্মাদ ইবনু আবদুল আ'লা (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাসের প্রথম দশকে ইতিকাফ করলেন। এরপর তিনি মাঝের দশকেও একটি তুর্কি তাবুর মধ্যে ইতিকাফ করলেন এবং তাবুর দরজায় একটি চটাই ঝুলানো ছিল। রাবী বলেন, তিনি নিজ হাতে চাটাই ধরে তা তাবুর কোণে রাখলেন, এরপর নিজের মাথা বাইরে এনে লোকদের সাথে কথা বললেন এবং তারাও তার নিকট এগিয়ে এলো। তিনি বললেন, এ রাতের অনুসন্ধানকল্পে আমি (রমাযানের) প্রথম দশকে ইতিকাফ করলাম। অতঃপর মাঝের দশকে ইতিকাফ করলাম। এরপর আমার নিকট একজন আগন্তুক (লোক) এসে আমাকে বলল, লায়লাতুল কদর শেষ দশকে নিহিত আছে। অতএব তোমাদের মধ্যে যে ব্যক্তি ইতিকাফ করতে চায়, সে যেন ইতিকাফ করে। লোকেরা তার সঙ্গে (শেষ দশকে) ইতিকাফ করল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বললেন, স্বপ্নে আমাকে তা কোন এক বেজোড় রাতে দেখানো হয়েছে এবং আমি যেন সে রাতে কাদা ও পানির মধ্যে ফজরের সিজদা করছি। (রাবী বলেন), তিনি ২১তম রাতের ভোরে উপনীত হয়ে ফজরের সালাতে দাঁড়ালেন এবং আসমান থেকে বৃষ্টি বর্ষিত হল। ফলে ছাদ থেকে মসজিদে পানি বর্ষিত হল এবং আমি স্বচক্ষে কাদা ও পানি দেখতে পেলাম। তিনি ফজরের সালাত (সালাত/নামাজ/নামায) শেষে যখন বের হয়ে এলেন, তখন তার কপাল ও নাকের ডগা সিক্ত ও কর্দমাক্ত ছিল। আর তা ছিল রমাযানের শেষ দশকের ২১তম রাত। (ইসলামিক ফাউন্ডেশন ২৬৩৮, ইসলামীক সেন্টার ২৬৩৭)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": "1167.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬২, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৬২-(২১৬/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবূ সালামাহ্ (রহঃ) বলেন, আমরা পরস্পর কদরের রাত সম্পর্কে আলোচনা করছিলাম। এরপর আমি আবূ সাঈদ আল খুদরী (রাযিঃ) এর নিকট এলাম এবং তিনি ছিলেন আমার বন্ধু। আমি তাকে বললাম, আপনি কি আমাদের সাথে খেজুর বাগানে যাবেন না? তিনি একটি চাঁদর পরিহিত অবস্থায় বের হলেন। আমি তাকে বললাম, আপনি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে লায়লাতুল কদর সম্পর্কে কিছু বলতে শুনেছেন? তিনি বললেন, হ্যাঁ। আমরা রমযান মাসের মাঝের দশকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ইতিকাফ করলাম। আমরা ২১তম দিন ভোরে (ইতিকাফ থেকে) বের হলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের উদ্দেশে প্রদত্ত ভাষণে বললেন, আমাকে স্বপ্নযোগে কদরের রাত দেখানো হয়েছিল, কিন্তু আমি তা তুলে গেছি অথবা আমাকে ভুলানো হয়েছে। তোমরা শেষ দশ দিনের প্রতিটি বেজোড় রাতে তা অন্বেষণ কর। আমি আরও দেখেছি যে, আমি কাদা ও পানির মধ্যে সিজদা করছি। অতএব যে ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ইতিকাফ করেছে, সে যেন পুনরায় তার ইতিকাফে ফিরে যায়। আবূ সাঈদ (রাযিঃ) বলেন, আমরা (ইতিকাফের অবস্থায়) ফিরে গেলাম। আমরা আকাশে কোন মেঘ দেখতে পাইনি। ইতিমধ্যে একখণ্ড মেঘ এলো এবং আমাদের উপর বৃষ্টি হল, এমন কি মসজিদের ছাদ হতে পানি প্রবাহিত হল। মসজিদের ছাদ খেজুর ডাটার ছাউনিযুক্ত ছিল। ফজরের সালাত (সালাত/নামাজ/নামায) আদায় করা হল এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কাদা ও পানির মধ্যে সিজদা দিতে দেখলাম, এমন কি আমি তার কপালে কাদার চিহ্ন দেখতে পেলাম। (ইসলামিক ফাউন্ডেশন ২৬৩৯, ইসলামীক সেন্টার ২৬৩৮)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": "1167.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৩, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৬৩-(২১০/...) আবদ ইবনু হুমায়দ, আবদুল্লাহ ইবনু ‘আবদুর রহমান আদ দারিমী (রহঃ) ..... ইয়াহইয়া ইবনু আবূ কাসীর (রহঃ) থেকে এ সানাদ সূত্রে পূর্বোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে উভয়ের (মা'মার ও আল আওযাঈ) বর্ণনায় আছেঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাত (সালাত/নামাজ/নামায) শেষ করে ফিরলেন তখন আমি তার কপালে ও নাকের ডগায় কাদার চিহ্ন দেখতে পেলাম। (ইসলামিক ফাউন্ডেশন ২৬৪০, ইসলামীক সেন্টার ২৬৩৯)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": "1167.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৪, আন্তর্জাতিক নাম্বারঃ ১১৬৭ ২৬৬৪-(২১৭/...) মুহাম্মাদ ইবনুল মুসান্না ও আবূ বাকর ইবনু খাল্লাদ (রহঃ) ..... আবূ সাঈদ আল খুদর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কদরের রাত অন্বেষণের উদ্দেশে তা তার কাছে সুস্পষ্ট হবার পূর্বে রমযানের মধ্যেই দশদিন ইতিকাফ করলেন। দশদিন অতিবাহিত হবার পর তিনি তাবু তুলে ফেলার নির্দেশ দিলেন। অতএব তা গুটিয়ে ফেলা হল। অতঃপর তিনি জানতে পারলেন যে, তা শেষ দশ দিনের মধ্যে আছে। তাই তিনি পুনরায় তাবু খাটানোর নির্দেশ দিলেন। তা খাটানো হল। এরপর তিনি লোকদের নিকট উপস্থিত হয়ে বললেন, হে লোক সকল! আমাকে কদরের রাত সম্পর্কে অবহিত করা হয়েছিল এবং আমি তোমাদের তা জানানোর জন্য বের হয়ে এলাম। কিন্তু দু' ব্যক্তি পরস্পর ঝগড়া করতে করতে উপস্থিত হল এবং তাদের সাথে ছিল শাইতান। তাই আমি তা ভুলে গেছি। অতএব তোমরা তা রমযান মাসের শেষ দশ দিনে অন্বেষণ কর তোমরা তা ৯ম, ৭ম ও ৫ম রাতে অন্বেষণ কর। রাবী বলেন, আমি বললাম, হে আবূ সাঈদ! আপনি সংখ্য সম্পর্কে আমাদের তুলনায় অধিক জ্ঞানী। তিনি বললেন, হ্যাঁ, আমরাই এ বিষয়ে তোমাদের চেয়ে অধিক হকদার। আমি বললাম ৯ম, ৭ম, ৫ম সংখ্যাগুলো কী? তিনি বললেন, যখন ২১তম রাত অতিবাহিত হয়ে যায় এবং ২২তম রাত শুরু হয়- তখন তা হচ্ছে ৯ম তারিখ, ২৩ রাত অতিক্রান্ত হবার পরবর্তী রাত হচ্ছে ৭ম তারিখ এবং ২৫তম রাত অতিবাহিত হবার পরের দিনটি হচ্ছে ৫ম তারিখ। ইবনু খাল্লাদের বর্ণনায় يَحْتَقَّانِ এর শব্দের স্থলে يَخْتَصِمَانِ শব্দের উল্লেখ আছে (অর্থ একই, অর্থাৎ তারা ঝগড়া করে)। (ইসলামিক ফাউন্ডেশন ২৬৪১, ইসলামীক সেন্টার ২৬৪০)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": "1168",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৫, আন্তর্জাতিক নাম্বারঃ ১১৬৮ ২৬৬৫-(২১৮/১১৬৮) সাঈদ ইবনু আমর ইবনু সাহল ইবনু ইসহাক ইবনু মুহাম্মাদ ইবনুল আশ’আস ইবনু কায়স আল কিন্‌দী ও আলী ইবনু খাশরম (রহঃ) ..... আবদুল্লাহ ইবনু উনায়স (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমাকে কদরের রাত দেখানো হয়েছিল। অতঃপর তা ভুলিয়ে দেয়া হয়েছে। আমাকে ঐ রাতের ভোর সম্পর্কে স্বপ্নে আরও দেখানো হয়েছে যে, আমি পানি ও কাদার মধ্যে সিজদা করছি। রাবী বলেন, অতএব ২৩ তম রাতে বৃষ্টি হল এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সাথে (ফজরের) সালাত (সালাত/নামাজ/নামায) আদায় করে যখন ফিরলেন, তখন আমরা তার কপাল ও নাকের ডগায় কাদা ও পানির চিহ্ন দেখতে পেলাম। রাবী আবদুল্লাহ ইবনু উনায়স (রাযিঃ) বলতেন, তা ছিল ২৩ তম। (ইসলামিক ফাউন্ডেশন ২৬৪২, ইসলামীক সেন্টার ২৬৪১)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": "1169",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৬, আন্তর্জাতিক নাম্বারঃ ১১৬৯ ২৬৬৬-(২১৯/১১৬৯) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযান মাসের শেষ দশ দিনে তোমরা কদরের রাত (ইবনু নুমায়রের বর্ণনায়) অন্বেষণ কর এবং (ওয়াকী' এর বর্ণনায়) সন্ধানে সচেষ্ট হও। (ইসলামিক ফাউন্ডেশন ২৬৪৩, ইসলামীক সেন্টার ২৬৪২)।",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": "762.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৭, আন্তর্জাতিক নাম্বারঃ ৭৬২ ২৬৬৭-(২২০/৭৬২) মুহাম্মাদ ইবনু হাতিম ও ইবনু উমার (রাযিঃ) ..... যির ইবনু হুবায়শ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি উবাই ইবনু কাব (রাযিঃ) কে বললাম, আপনার ভাই আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) বলেন, যে ব্যক্তি গোটা বছর রাত জাগরণ করে- সে কদরের রাতের সন্ধান পাবে। তিনি (উবাই) বললেন, আল্লাহ তাকে রহম করুন, এর দ্বারা তিনি এ কথা বুঝাতে চাচ্ছেন যে, লোকেরা যেন কেবল একটি রাতের উপর ভরসা করে বসে না থাকে। অথচ তিনি অবশ্যই জানেন যে, তা রমযান মাসে শেষের দশ দিনের মধ্যে এবং ২৭তম রজনী। অতঃপর তিনি দৃঢ় শপথ করে বললেন, তা ২৭তম রজনী। আমি (যির) বললাম, হে আবূল মুনযির! আপনি কিসের ভিত্তিতে তা বলছেন? তিনি বললেন, বিভিন্ন আলামাত ও নিদর্শনের ভিত্তিতে- যে সম্পর্কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে অবহিত করেছেন। যেমন, সেদিন সূর্য উদয় হবে কিন্তু তাতে আলোকরশ্মি থাকবে না। (ইসলামিক ফাউন্ডেশন ২৬৪৪, ইসলামীক সেন্টার ২৬৪৩)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": "762.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৮, আন্তর্জাতিক নাম্বারঃ ৭৬২ ২৬৬৮-(২২১/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... উবাই ইবনু কা'ব (রাযিঃ) কদরের রাত সম্পর্কে বলেন, আল্লাহর শপথ! কদরের রাত সম্পর্কে আমি খুব ভাল করেই জানি। শু'বাহ বলেন, আমার জানামতে তা হচ্ছে, সে রাত যে রাতে জেগে ইবাদাত করার জন্য রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নির্দেশ দিয়েছেন। তা হচ্ছে রমযানের ২৭তম রজনী। “তা হচ্ছে সে রাত, যে রাতে ইবাদাত করার জন্য রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নির্দেশ দিয়েছেন।\" এ বাক্যটুকু সম্পর্কে শুবাহ সন্দেহে পতিত হয়েছেন এবং বলেছেন, আমার এক বন্ধু তার শায়খের সূত্রে আমার নিকট ঐ কথা বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ২৬৪৫, ইসলামীক সেন্টার ২৬৪৪)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": "1170",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৬৬৯, আন্তর্জাতিক নাম্বারঃ ১১৭০ ২৬৬৯-(২২২/...) মুহাম্মাদ ইবনু আব্বাদ ও ইবনু আবূ উমর (রহঃ) ..... আবূ হুরায়রাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে কদরের রাত সম্পর্কে আলাপ-আলোচনা করছিলাম। তিনি বললেন, তোমাদের মধ্যে কে সে (রাত) স্মরণ রাখবে, যখন চাঁদ উদিত হবে থালার একটি টুকরার ন্যায়। (ইসলামিক ফাউন্ডেশন ২৬৪৬, ইসলামীক সেন্টার ২৬৪৫)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 285
			}
		}
	]
}