{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 534,
			"arabicnumber": "223",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২২, আন্তর্জাতিক নাম্বারঃ ২২৩ ৪২২-(১/২২৩) ইসহাক ইবনু মানসূর (রহঃ) ..... আবূ মালিক আল আশ'আরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পবিত্রতা হল ঈমানের অর্ধেক অংশ। আলহামদু লিল্লা-হ' মিযানের পরিমাপকে পরিপূর্ণ করে দিবে এবং \"সুবহানাল্লা-হ ওয়াল হামদুলিল্লা-হ\" আসমান ও জমিনের মধ্যবর্তী স্থানকে পরিপূর্ণ করে দিবে। সালাত’ হচ্ছে একটি উজ্জ্বল জ্যোতি। সদাকাহ হচ্ছে দলীল। ধৈর্য হচ্ছে জ্যোতির্ময়। আর \"আল কুরআন' হবে তোমার পক্ষে অথবা বিপক্ষে প্রমাণ স্বরূপ। বস্তুতঃ সকল মানুষই প্রত্যেক ভোরে নিজেকে আমলের বিনিময়ে বিক্রি করে। তার আমল দ্বারা সে নিজেকে (আল্লাহর আযাব থেকে) মুক্ত করে অথবা সে তার নিজের ধ্বংস সাধন করে। (ইসলামিক ফাউন্ডেশনঃ ২য় খণ্ড, ৪২৫; ইসলামিক সেন্টারঃ ৪৪১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": "224.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৩, আন্তর্জাতিক নাম্বারঃ ২২৪ ৪২৩-(.../২২৪) সাঈদ ইবনু মানসূর, কুতাইবাহ ইবনু সাঈদ ও আবূ কামিল আল জাহদারী (রহঃ) ..... মুসআব ইবনু সা'দ (রহঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) অসুস্থ ইবনু আমিরকে দেখতে গিয়েছিলেন। তখন ইবনু আমির তাকে বললেন, হে ইবনু উমার! আপনি কি আমার জন্যে আল্লাহর কাছে দু’আ করেন না? ইবনু উমার বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তাহারাত ব্যতিরেকে সালাত কবুল হয় না। খিয়ানাতের সম্পদ থেকে সদাকাহও কবুল হয় না। আর তুমি তো ছিলে বাসরার শাসনকর্তা। (ইসলামিক ফাউন্ডেশনঃ ৪২৬, ইসলামিক সেন্টারঃ ৪৪২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": "224.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৪, আন্তর্জাতিক নাম্বারঃ ২২৪ ৪২৪-(.../...) মুহাম্মাদ ইবনু আল মুসান্না ও ইবন বাশশার (রহঃ) ..... শু'বাহ্ (রহঃ) থেকে অন্য সূত্রে আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ... ইসমাঈল (রহঃ) থেকে, সকলে সিমাক ইবনু হারব (রহঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৪২৭, ইসলামিক সেন্টারঃ ৪৪৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": "225",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৫, আন্তর্জাতিক নাম্বারঃ ২২৫ ৪২৫-(২/২২৫) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে কতগুলো হাদীস বর্ণনা করেছেন। তার মধ্য থেকে একটি হাদীস তিনি এভাবে বর্ণনা করেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো ওযু নষ্ট হলে পুনরায় ওযু না করা পর্যন্ত তার সালাত কবুল হয় না। (ইসলামিক ফাউন্ডেশনঃ ৪২৮, ইসলামিক সেন্টারঃ ৪৪৪) প্রাসঙ্গিক আলোচনা ইস্তিঞ্জার নিয়মাবলি অযু ভঙ্গ হওয়ার অপর পরিভাষা হচ্ছে, ইস্তিঞ্জা করা: ইস্তিঞ্জা হলো পেশাব ও পায়খানার রাস্তা থেকে নির্গত অপবিত্রতা পানি দ্বারা দূর করা। আর যদি পানি ছাড়া অন্য কিছু দ্বারা পবিত্রতা অর্জন করা হয় তবে তাকে বলা হয় ইস্তিজমার। এ ব্যাপারে ইসলামী শরী'আতে কিছু নিয়ম রয়েছে পেশাব-পায়খানায় প্রবেশের সময় বাম পা দিয়ে প্রবেশ করা এবং এ দোআ পড়া, হে আল্লাহ! নিশ্চয় আমি আপনার নিকট অপবিত্র জিন নর-নারীর (অনিষ্ট) থেকে আশ্রয় প্রার্থনা করছি।” (সহীহ বুখারী: ১৪২) আর বের হওয়ার সময় ডান পা আগে দিয়ে বের হওয়া এবং এ দোআ পড়া, “হে আল্লাহ! আমি তোমার নিকট ক্ষমা প্রার্থনা করছি\"। (তিরমিযী: ৭) পেশাব-পায়খানার সময় বাম পায়ের উপর ভর দিয়ে বসা মুস্তাহাব, তবে খালি জায়গায় পেশাব-পায়খানা করলে মানুষের দৃষ্টির বাহিরে নির্জন স্থানে বসা। পেশাব করার সময় নরম স্থান নির্বাচন করা, যাতে পেশাবের ছিটা থেকে পবিত্র থাকা যায়। অতি প্রয়োজন ছাড়া এমন কোনো কিছু সাথে নেয়া মাকরূহ যাতে আল্লাহর নাম রয়েছে। তাছাড়া যমীনের কাছাকাছি না হওয়ার আগে কাপড় তোলা, কথা বলা, গর্তে পেশাব করা, ডান হাত দিয়ে লজ্জাস্থান স্পর্শ করা এবং ডান হাত দিয়ে ঢিলা ব্যবহার মাকরূহ। উন্মুক্ত স্থানে পেশাব-পায়খানার সময় কিবলার দিকে মুখ বা পিঠ ফিরিয়ে বসা হারাম, আর ঘরের মধ্যে বসা জায়েয, তবে না বসা উত্তম। চলাচলের রাস্তা, বসা ও বিশ্রামের জায়গায়, ফলদার ছায়াদার গাছ ইত্যাদির নিচে পেশাব-পায়খানা করা হারাম। পবিত্র পাথর দিয়ে তিনবার শৌচকর্ম করা মুস্তাহাব। এতে ভালোভাবে পবিত্র না হলে সংখ্যা আরো বৃদ্ধি করা যাবে। তবে বেজোড় সংখ্যা তিন বা পাঁচ বা ততোধিক বেজোড় সংখ্যা ব্যবহার করা দ্বারা কাজটি শেষ করা সুন্নাত। হাড়, গোবর, খাদ্য ও সম্মানিত জিনিস দ্বারা ঢিলা করা হারাম। পানি, টিস্যু ও পাতা ইত্যাদি দিয়ে ঢিলা করা জায়েয। তবে শুধু পানি ব্যবহার করার চেয়ে পাথর ও পানি একত্রে ব্যবহার করা উত্তম কাপড়ে অপবিত্রতা লাগলে তা পানি দিয়ে ধৌত করা ফরয। আর যদি অপবিত্র স্থান অজ্ঞাত থাকে তবে পুরো কাপড় পানি দিয়ে ধৌত করতে হবে। বসে পেশাব করা সুন্নাত, তবে পেশাবের ছিটা থেকে নিরাপদ থাকলে দাঁড়িয়ে পেশাব করা মাকরূহ নয়। অত্র হাদীসে 'অযু করা' বলতে শুধু অযুই উদ্দেশ্য নয়। যদি অযু করার পানি না পাওয়া যায় তবে 'তায়াম্মুম' সেখানে কার্যকর হয়ে যাবে। হাদিস থেকে শিক্ষা ১. অপবিত্র ব্যক্তির সালাত পবিত্র না হওয়া পর্যন্ত কবুল হবে না। সেটা ছোট অপবিত্রতা হোক কিংবা বড় অপবিত্রতা। ২. অপবিত্রতা অযু নষ্ট করে, অনুরূপভাবে তাতে সালাতও নষ্ট হয়, যদি সালাতরত অবস্থায় অপবিত্র হয়ে যায়। ৩. কবুল না হওয়ার অর্থ সালাত বিশুদ্ধ না হওয়া আদায় না হওয়া। ৪. হাদীস থেকে বুঝা যায় যে, সালাতের জন্য পবিত্রতা শর্ত। ৫. পবিত্রতা ব্যতিত সালাত না হওয়ার বিষয়টি স্বাভাবিক অবস্থার সাথে সম্পৃক্ত। অস্বাভাবিক অবস্থা এর ব্যতিক্রম। সুতরাং যারা পবিত্রতা অর্জনের জন্য পানি বা মাটি কিছুই পাবে না, তারা এ হাদীসের বাহ্যিক দাবি অনুযায়ী সালাত আদায় করবে না তা কিন্তু নয়। কারণ তখনও তাদেরকে সালাত আদায় করতে হবে; কারণ আল্লাহ তা'আলা বলেন, “তোমরা যতটুকু সম্ভব আল্লাহর তাকওয়া অবলম্বন কর।\" [সূরা ৬৪; আত তাগাবুন ১৬]",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": "226.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৬, আন্তর্জাতিক নাম্বারঃ ২২৬ ৪২৬-(৩/২২৬) আবূ তাহির, আহমাদ ইবনু আমর ইবনু আবদুল্লাহ ইবনু আমর ইবনু সারহ ও হারমালাহ ইবনু ইয়াহইয়া আত-তুজীবী (রহঃ) ..... উসমান ইবনু আফফান (রাযিঃ) থেকে বর্ণিত যে, তিনি ওযুর পানি চাইলেন। এরপর তিনি ওযু করতে আরম্ভ করলেন। (বর্ণনাকারী বলেন), তিনি উসমান (রাযিঃ) তিনবার তার হাতের কজি পর্যন্ত ধুলেন, এরপর কুলি করলেন এবং নাক ঝাড়লেন। এরপর তিনবার তার মুখমণ্ডল ধুলেন এবং ডান হাত কনুই পর্যন্ত তিনবার ধুলেন। অতঃপর বাম হাত অনুরূপভাবে ধুলেন। অতঃপর তিনি মাথা মাসাহ করলেন। এরপর তার ডান পা টাখনু পর্যন্ত তিনবার ধুলেন- অতঃপর তদ্রুপভাবে বাম পা ধুলেন তারপর বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আমার এ ওয়ূর করার ন্যায় ওযু করতে দেখেছি এবং ওযু শেষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি আমার এ ওযুর ন্যায় ওযু করবে এবং একান্ত মনোযোগের সাথে দু' রাকাআত সালাত আদায় করবে, সে ব্যক্তির পিছনের সকল গুনাহ মাফ করে দেয়া হবে। ইবনু শিহাব বলেন, আমাদের ‘আলিমগণ বলতেন যে, সালাতের জন্য কারোর এ নিয়মের ওযুই হল পরিপূর্ণ ওযু (ইসলামিক ফাউন্ডেশনঃ ৪২৯, ইসলামিক সেন্টারঃ ৪৪৫) প্রাসঙ্গিক আলোচনা পাত্রের বাইরে হাত ধোয়ার বিধান পাত্রের বাইরে দু'হাতের উপর পানি ঢেলে হাত ধোয়ার ভিন্ন ভিন্ন অবস্থায় বিভিন্ন হুকুম হয়ে থাকে। এ ব্যাপারে মতভেদ পূর্বে বর্ণনা করা হয়েছে। কুলি করা ও নাকে পানি দেয়ার বিধান এ বিষয়ে আলেমগণ মতভেদ করেছেন। আবু হানীফা, মালিক ও শাফেয়ী রাহিমাহুমুল্লাহ বলেন, অযুতে এ দু'টিই সুন্নাত। ইমাম আহমাদ ইবন আবী লাইলা ও দাউদ আয যাহেরী বলেন, দু'টোই ফরয। ইমাম আবু সাওর, আবূ উবাইদ ও আহলে যাহেরদের অপর গোষ্ঠীর নিকট কুলি করা সুন্নাত কিন্তু নাকে পানি নেয়া ফরয। মাথা কতটুকু মাসেহ করবে? মাথা মাসাহ করা ফরয হওয়ার ব্যাপারে উম্মতের আলেমগণের ঐকমতা রয়েছে। অনুরূপভাবে পূর্ণ মাথা মাসাহ করা মুস্তাহাব হওয়ার ব্যাপারেও তাদের ঐকমত্য রয়েছে কিন্তু মাথার কতটুকু মাসাহ করা ফরয তা নির্ধারণে ফকীহগণ মতভেদ করেছেন। ইমাম মালিক ও আহমাদ রাহিমাহুমাল্লাহার মতে পূর্ণ মাথা মাসাহ করাই ফরয। ইমাম আবু হানীফা, শাফেয়ী, আওযায়ী, সাওরী বলেন, মাথার কিছু অংশ মাসাহ করলেই। ফরয আদায় হয়ে যাবে; এ কিছু অংশ নির্ধারণে তারা আবার মতভেদ করেছেন। আবু হানীফা বলেন, এক-চতুর্থাংশ এবং মালেকী মাযহাবের কারো কারো মতে এক-তৃতীয়াংশ। তবে ইমাম শাফেয়ী কোনো সীমা নির্ধারণ করেননি। বরং তার নিকট মাসাহ বলতে যা বুঝায় তা হলেই হবে। তবে বিশুদ্ধ মত হচ্ছে যে, পুরো মাথা মাসাহ করতে হবে। কারণ, রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম কখনও মাথার কিছু অংশ মাসাহ করা যথেষ্ট মনে করেছেন তেমন প্রমাণ নেই। যেখানে এসেছে যে, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম মাথার সামনের অংশ মাসাহ করেছেন সেখানেও এসেছে যে, তিনি বাকী মাথার মাসাহ করার জন্য পাগড়ীর উপর তা সম্পন্ন করেছেন। (আর পাগড়ীর ওপর মাসাহ তখনই হবে যখন তা মুহান্নাক বা গলার নিচ দিয়ে পেঁচ দিয়ে শক্ত করে মজবুতভাবে আটকে পাগড়ী বাঁধা হবে।) অযুতে আবশ্যকীয় কাজ \"উসমান রাদ্বিয়াল্লাহু আনহু বর্ণিত এ হাদীসটি অযুর বর্ণনার ক্ষেত্রে অনন্য। এ হাদীসটি যদি আমরা কুরআনুল কারীমের সূরা আল-মায়েদাহ'র ৬নং আয়াতের সাথে মিলিয়ে দেখি, তখন অযুতে কী কী করা অত্যাবশ্যক তা সুন্দরভাবে ফুটে উঠবে। সে হিসেবে অযুতে নিম্নোক্ত কাজগুলো অত্যাবশ্যক ১. মুখমণ্ডল ধৌত করা, আর মুখ ও নাক মুখমণ্ডলেরই অংশ। যেমনটি এ হাদীসে এসেছে। ২. কনুইসহ দুহাত ধৌত করা। ৩. মাথা মাসাহ করা আর দু'কান মাথারই অংশ। ৪. দু'পা ধৌত করা। তাছাড়া আরো যেগুলো বাস্তবেই এসে যায় কিন্তু কুরআনে শব্দ দিয়ে উল্লেখ করা হয়নি, তা হচ্ছে ৫. ধৌত অঙ্গের মধ্যে পরস্পর ক্রমবিন্যাস বজায় রাখা। কেননা আল্লাহ ধারাবাহিকভাবে বর্ণনা করেছেন এবং দু'অঙ্গ ধোয়ার মধ্যে একটি মাসাহ করার বিষয় উল্লেখ করেছেন যা ক্রমবিন্যাস আবশ্যক হওয়া বুঝায়। ৬. অযু করার সময় এক অঙ্গ ধৌত করার সাথে সাথেই বিলম্ব না করে অন্য অঙ্গ ধৌত করা। কেননা রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এভাবে করেছেন। অনুরূপভাবে আরো একটি কাজ রয়েছে যা করার আবশ্যকতা কুরআনে কারীম ও সহীহ হাদীস দ্বারা সাব্যস্ত হয়েছে: ৭. নিয়ত করা, অর্থাৎ অন্তরে সুদৃঢ়ভাবে নির্ধারণ করে সালাতে দাঁড়ানো। হাদীসের শিক্ষা ১. অযুর পানির পাত্রে হাত ঢুকানোর পূর্বে তিনবার তা বাইরে ধুয়ে ফেলাই হচ্ছে বৈধ নিয়ম। ২. অযুর অঙ্গ ধোয়ার জন্য ডান হাত ব্যবহার করাই শরীআতসম্মত পদ্ধতি। ৩. কুলি, নাকে পানি নেয়া, নাকের পানি ঝাড়ার বিষয়টি এভাবে ক্রমান্বয়ে করা হবে। ৪. মুখমণ্ডল ধোয়ার সময় খেয়াল রাখতে হবে তা যেন পার্শ্ব দিক থেকে এক কান থেকে অপর কান পর্যন্ত এবং লম্বায় মাথার চুল গজানোর স্থান থেকে থুতনী পর্যন্ত পুরো জায়গায় সম্পন্ন হয়। আর তা তিনবার করা সুন্নাত। মনে রাখা দরকার নাক ও মুখ চেহারার অন্তর্ভুক্ত। কারণ, আরবদের নিকট চেহারা হচ্ছে যা দেখা করার সময় সামনে প্রতিভাত হয়ে থাকে। ৫. দু'হাত কনুই সমেত তিনবার ধৌত করাই শরীআতসম্মত। আগে হাত ধৌত করলেও এখন আবারও পূর্ণ হাত কনুই সমেত তিনবার ধৌত করা বিধিসম্মত। ৬. পুরো মাথা একবার মাসাহ করতে হবে। দু'হাত দিয়ে মাথার সামনের দিক থেকে পিছনে নিবে, তারপর পিছন দিক থেকে সামনে আসবে। ৭. দু'পা টাখনু সমেত তিনবার ধৌত করবেন। ৮. এসব কাজের মধ্যে তারতীব বা ক্রমধারা অনুসরণ করতে হবে; কারণ আল্লাহ তা'আলা ও তাঁর রাসূল সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম ধৌত করার বিষয়াবলির মাঝখানে মাসাহ করার জিনিস উল্লেখ করেছেন, যা দ্বারা বুঝা যায় এ তারতীব রক্ষা করা জরুরী। ৯. হাদীসে বর্ণিত পদ্ধতিটিই ছিল রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের অযু করার পূর্ণ পদ্ধতি। ১০. অযুর পরে দু'রাক'আত সালাত আদায় করা বিধিসম্মত। ১১. আল্লাহর সামনে হাযির হওয়া। তাছাড়া ইখলাসের সাথে তা পালন করা। যদি দুনিয়ার জিনিস তাতে ঘটে যায় তখন তা কবুল নাও হতে পারে। আর কারো সালাতের মধ্যে দুনিয়ার জিনিসের অনুপ্রবেশ ঘটলে সে যদি তা তাড়াতে সক্ষম হয় তবে সেটার জন্য তার সাওয়াব রয়েছে। ১২. পূর্ণ অযুর সাওয়াব অনেক। কারণ এর মাধ্যমে গুনাহ মাফ হয়ে যায়। ১৩. হাদীসে উক্ত সাওয়াব পেতে হলে দু'টি জিনিস লাগবে- (ক) যেভাবে উসমান রাদ্বিয়াল্লাহু 'আনহু পূর্ণাঙ্গ অযু করে দেখিয়েছেন সে রকম অযু করা। (খ) তারপর দু' রাকআত সালাত পূর্ণাঙ্গরূপে আদায় করা। এ দু'টি মিলেই ক্ষমার ঘোষণা। তবে আলেমগণ বলেন, এ ক্ষমা কেবল ছোট ছোট গুনাহের জন্য। বড় বা কবীরা গুনাহের জন্য তাওবাহ লাগবে। * এই হাদীস হতে আরো শিক্ষণীয় বিষয়: ১। এটি একটি মহা হাদীস, এর মধ্যে সন্নিবেশিত হয়েছে প্রকৃত ইসলাম ধর্মে ওজু করার মৌলিক বিবরণ। তাই সমস্ত মুসলিম ব্যক্তির উচিত, তারা যেন ওজু করার এই মৌলিক বিবরণটির জ্ঞান লাভ করে ও যত্ন করে। তবে জেনে রাখা দরকার যে, একবার মাত্র মাথা মাসাহ করার সাথে সাথে দুই কানেরও মাসাহ করতে হবে। কেননা কান দুইটি তো হলো মাথারই অংশ। ২। ওজু এবং নামাজ হলো মহান আল্লাহর ক্ষমা ও জান্নাত লাভের মাধ্যম। তাই যে ব্যক্তি ওজু করবে, তার উচিত যে, সে যেন ওজু করার পর দুই রাকাআত নামাজ পড়ে। ৩। মুসলিম ব্যক্তির উচিত যে, সে যেন ওজু করার শেষে এই দোয়াটি পাঠ করে। অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত। যেহেতু আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেছেন: \"তোমাদের মধ্যে থেকে যখন কোনো ব্যক্তি যত্নসহকারে সম্পূর্ণরূপে অথবা উত্তম রূপে ওজু করবে এবং বলবে: (অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত।) তার জন্য জান্নাতের আটটি দরজা খুলে দেওয়া হবে, সে যে দরজা দিয়ে ইচ্ছে করবে, সেই দরজা দিয়ে জান্নাতে প্রবেশ করতে পারবে”। [দেখতে পারা যায় সহীহ মুসলিম, হাদীস নং ১৭ – (২২৪) ]।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": "226.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৭, আন্তর্জাতিক নাম্বারঃ ২২৬ ৪২৭-(৪/...) যুহায়র ইবনু হারব (রহঃ) ..... উসমান এর আযাদকৃত গোলাম হুমরান (রহঃ) থেকে বর্ণিত। তিনি উসমান ইবনু আফফানকে দেখেছেন তিনি ওযুর জন্যে এক পাত্র পানি আনিয়ে দু'হাতের উপর ঢেলে তিনবার ধুলেন। তারপর ডানহাত পানির পাত্রে প্রবেশ করিয়ে কুলি করলেন এবং নাকে পানি দিলেন, এরপর তিনবার মুখমণ্ডল এবং তিনবার দু'হাতের কনুই পর্যন্ত ধুইলেন। তারপর মাথা মাসাহ করলেন। অতঃপর উভয় পা (গোড়ালি পর্যন্ত) তিনবার ধুয়ে বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি আমার এ ওযুর ন্যায় ওযু করার পর এমনভাবে দুরাকাআত সালাত আদায় করবে যাতে তা অন্তরে কোন কল্পনার উদয় হয়নি; তবে তার পিছনের সকল গুনাহ মাফ করে দেয়া হবে। (ইসলামিক ফাউন্ডেশনঃ ৪৩০, ইসলামিক সেন্টারঃ ৪৪৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এটি একটি মহা হাদীস, এর মধ্যে সন্নিবেশিত হয়েছে প্রকৃত ইসলাম ধর্মে ওজু করার মৌলিক বিবরণ। তাই সমস্ত মুসলিম ব্যক্তির উচিত, তারা যেন ওজু করার এই মৌলিক বিবরণটির জ্ঞান লাভ করে ও যত্ন করে। তবে জেনে রাখা দরকার যে, একবার মাত্র মাথা মাসাহ করার সাথে সাথে দুই কানেরও মাসাহ করতে হবে। কেননা কান দুইটি তো হলো মাথারই অংশ। ২। ওজু এবং নামাজ হলো মহান আল্লাহর ক্ষমা ও জান্নাত লাভের মাধ্যম। তাই যে ব্যক্তি ওজু করবে, তার উচিত যে, সে যেন ওজু করার পর দুই রাকাআত নামাজ পড়ে। ৩। মুসলিম ব্যক্তির উচিত যে, সে যেন ওজু করার শেষে এই দোয়াটি পাঠ করে। \"أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنََّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ\". অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত। যেহেতু আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেছেন: \"তোমাদের মধ্যে থেকে যখন কোনো ব্যক্তি যত্নসহকারে সম্পূর্ণরূপে অথবা উত্তম রূপে ওজু করবে এবং বলবে: \"أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنََّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ\". (অর্থ: আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া অন্য কোনো সত্য উপাস্য নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, অব্যশই মুহাম্মাদ [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] আল্লাহর অতি প্রিয় মানুষ ও দূত।) তার জন্য জান্নাতের আটটি দরজা খুলে দেওয়া হবে, সে যে দরজা দিয়ে ইচ্ছে করবে, সেই দরজা দিয়ে জান্নাতে প্রবেশ করতে পারবে”। [দেখতে পারা যায় সহীহ মুসলিম, হাদীস নং ১৭ – (২২৪) ]।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": "227.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৮, আন্তর্জাতিক নাম্বারঃ ২২৭ ৪২৮-(৫/২২৭) কুতাইবাহ ইবনু সাঈদ, উসমান ইবনু মুহাম্মাদ ইবনু আবূ শাইবাহ, ইসহাক ইবনু ইবরাহীম আল হানযালী (রহঃ) ..... উসমান ইবনু আফফান (রাযিঃ) এর আযাদকৃত দাস হুমরান থেকে বর্ণিত। তিনি বলেন, আমি উসমান ইবনু আফফান (রাযিঃ) কে বলতে শুনেছি যে, তিনি মসজিদের বারান্দায় ছিলেন। এমন সময় আসর সালাতের জন্যে মুওয়াযযিন তার নিকট আসলে তিনি ওযুর পানি চাইলেন এবং ওযু করে বললেনঃ আল্লাহর কসম! আমি অবশ্যই তোমাদেরকে একটি হাদীস শুনাব, যদি আল্লাহর কিতাবে একটি আয়াত না থাকতো তাহলে আমি তোমাদেরকে হাদীসটি শুনাতাম না। (অতঃপর তিনি বললেন) আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, যে ব্যক্তি উত্তমরূপে ওযু করে সালাত আদায় করবে তার সমস্ত গুনাহ মাফ করে দেয়া হবে। (ইসলামিক ফাউন্ডেশনঃ ৪৩১, ইসলামিক সেন্টারঃ ৪৪৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": "227.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪২৯, আন্তর্জাতিক নাম্বারঃ ২২৭ ৪২৯-(.../...) আবূ কুরায়ব, আবূ উসামাহ হতে, অন্য সূত্রে যুহায়র ইবনু হারব ও আবূ কুরায়ব ওয়াকী’ (রহঃ) হতে, অন্য সূত্রে ইবনু আবূ উমার থেকে আবার সকলে হিশামের মাধ্যমে উপরোক্ত সূত্রেও হাদীসটি বর্ণনা করেছেন। তবে আবূ উসামার সূত্রে অতিরিক্ত বলা হয়েছে যে, অতঃপর তার ওযুকে সুন্দররূপে করে তারপর ফরয সালাত আদায় করে।' (ইসলামিক ফাউন্ডেশনঃ ৪৩২, ইসলামিক সেন্টারঃ ৪৪৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": "227.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩০, আন্তর্জাতিক নাম্বারঃ ২২৭ ৪৩০-(৬/...) যুহারর ইবনু হারব (রহঃ) ..... হুমরান (রহঃ) থেকে বর্ণিত। তিনি বলেন, উসমান (রাযিঃ) ওযু শেষে বললেন যে, আল্লাহর কসম, আমি তোমাদেরকে একটি হাদীস শুনাব। আল্লাহর কসম, যদি আল্লাহর কিতাবের মধ্যে একটি আয়াত না থাকত তাহলে আমি তোমাদেরকে কখনোই হাদীসটি শুনাতাম না। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, কোন ব্যক্তি যখন ওযু করে এবং উত্তমরূপে ওযু করে (অর্থাৎ ভালভাবে উযুর স্থানগুলো ভিজায়) তারপর সালাত আদায় করে তখন তার এ সালাত ও পিছনের সালাতের মধ্যবর্তী সকল গুনাহ মাফ করে দেয়া হয়। উরওয়াহ বলেন, আয়াতটি হলঃ \"আমি যে সকল স্পষ্ট নিদর্শন ও পথনির্দেশ অবতীর্ণ করেছি মানুষের জন্যে কিতাবে তা সুস্পষ্টভাবে বলে দেয়ার পরেও যারা তা গোপন রাখে, আল্লাহ তাদেরকে লানাত দেন এবং অভিশাপকারীরাও তাদেরকে অভিশাপ দেয়\" (সূরাহ আল-বাকার ২ঃ ১৫৯)। (ইসলামিক ফাউন্ডেশনঃ ৪৩৩, ইসলামিক সেন্টারঃ ৪৪৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": "228",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩১, আন্তর্জাতিক নাম্বারঃ ২২৮ ৪৩১-(৭/২২৮) আবদ ইবনু হুমায়দ ও হাজ্জাজ ইবনু আশ শাইর (রহঃ) .... 'আমূর ইবনু সাঈদ ইবনুল 'আস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি উসমান (রাযিঃ) এর নিকট উপস্থিত ছিলাম। এমন সময়ে তিনি পানি আনার নির্দেশ দিলেন। এরপর তিনি বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, কোন মুসলিমের যখন কোন ফরয সালাতের ওয়াক্ত হয় আর সে উত্তমরূপে সালাতের ওযু করে, সালাতের নিয়ম ও রুকূকে উত্তমরূপে আদায় করে তা হলে যতক্ষণ না সে কোন কাবীরাহ গুনাহে লিপ্ত হবে তার এ সালাত তার পিছনের সকল গুনাহের জন্যে কাফফারাহ হয়ে যাবে। তিনি বলেন, আর এ অবস্থা সর্বযুগেই বিদ্যমান। (ইসলামিক ফাউন্ডেশনঃ ৪৩৪, ইসলামিক সেন্টারঃ ৪৫০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": "229",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩২, আন্তর্জাতিক নাম্বারঃ ২২৯ ৪৩২-(৮/২২৯) কুতাইবাহ ইবনু সাঈদ ও আহমদ ইবনু আবদাহ আয যাব্বী (রহঃ) ..... হুমরান উসমানের আযাদকৃত দাস থেকে বর্ণিত। তিনি বলেন, আমি উসমান ইবনু আফফান (রাযিঃ) এর জন্যে উযুর পানি আনলাম। অতঃপর তিনি ওযু করে বললেন, লোকেরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনেক হাদীস বর্ণনা করা থাকে। আমি ঐ হাদীসগুলোর ব্যাপারে অবগত নই। তবে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমার এ ওযুর মত ওযু করতে দেখেছি। তারপর বলেছেন, যে ব্যক্তি এভাবে ওযু করতে তার পিছনের সকল গুনাহ মাফ করে দেয়া হবে। আর তার সালাত আদায় ও মসজিদের দিকে যাওয়া অতিরিক্ত সাওয়াব বলে গণ্য হবে। ইবন আবদাহ-এর বর্ণনায় কথাটি বাদ দিয়ে কেবল বলা হয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৪৩৫, ইসলামিক সেন্টারঃ ৪৫১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": "230",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৩, আন্তর্জাতিক নাম্বারঃ ২৩০ ৪৩৩-(৯/২৩০) কুতাইবা ইবনু সা'ঈদ, আবূ বাকর ইবনু আবূ শাইবাহ, যুহায়র ইবনু হারব (রহঃ) ...... আবূ আনাস (রহঃ) থেকে বর্ণিত। তিনি বলেছেনঃ একদিন উসমান একটি উচু স্থানে বসে ওযু করে বললেনঃ আমি কি তোমাদের রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওযু কিরূপ ছিল তা দেখাব না? এরপর তিনি প্রতিটি অঙ্গ তিনবার করে ধুলেন। কুতাইবাহ আনাস সূত্রে এতটুকু কথা অতিরিক্ত বলেছেন যে, এ সময় তার (উসমানের) কাছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনেক সাহাবা উপস্থিত ছিলেন (অর্থাৎ কেউই তার বিরোধিতা করেননি)। (ইসলামিক ফাউন্ডেশনঃ ৪৩৬, ইসলামিক সেন্টারঃ ৪৫২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": "231.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৪, আন্তর্জাতিক নাম্বারঃ ২৩১ ৪৩৪-(১০/২৩১) আবূ কুরায়ব মুহাম্মদ আলী ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... হুমরান ইবনু আবান (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমি উসমান (রাযিঃ) এর জন্যে ওযুর পানি ব্যবস্থা করতাম। এমন একটি দিনও অতিবাহিত হতো না যেদিন সামান্য পরিমাণ পানি হলেও তা দ্বারা গোসল করতেন না। উসমান বলেছেন, একদিন আমরা যখন এ (ওয়াক্তের) সালাত শেষ করলাম তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বললেন। মিসআর বলেনঃ আমার মনে হয় তা ছিল আসরের সালাত। তিনি বললেনঃ আমি স্থির করতে পারছি না যে, তোমাদেরকে একটি বিষয়ে কিছু বর্ণনা করব না নীরব থাকব। তখন আমরা বললাম, হে আল্লাহর রাসূল! যদি তা কল্যাণকর হয় তাহলে আমাদেরকে বলুন। আর যদি অন্য কিছু হয়, তাহলে আল্লাহ এবং তার রাসূলই অধিক অবগত। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন মুসলিমের যখন পবিত্রতা অর্জন করে এবং আল্লাহ তার ওপর যে পবিত্রতা অপরিহার্য করেছেন তা পূর্ণাঙ্গরূপে আদায় করে পাঁচ ওয়াক্ত সালাত আদায় করে, তাহলে এসব সালাত মধ্যবর্তী সময়ের সব গুনাহর কাফফারাহ হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৪৩৭, ইসলামিক সেন্টারঃ ৪৫৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": "231.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৫, আন্তর্জাতিক নাম্বারঃ ২৩১ ৪৩৫-(১১/...) উবাইদুল্লাহ ইবনু মুআয তার পিতার সূত্রে, অন্য সনদে মুহাম্মাদ ইবনু আল মুসান্না ও ইবনু বাশশার (রহঃ) ..... উসমান ইবনু আফফান (রাযিঃ) থেকে বর্ণিত। উসমান (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি আল্লাহ যেভাবে আদেশ করেছেন সেভাবে ওযুকে পূর্ণ করে, তার পাঁচ ওয়াক্তের ফরয সালাত আদায় করলে উক্ত সালাতসমূহ মধ্যবর্তী সময়ের (গুনাহের) কাফফারাহ হয়ে যায়। ইবনু মু'আযের হাদীসে এভাবেই বলা হয়েছে। কিন্তু গুনদার বর্ণিত হাদীসে বিশরের নেতৃত্বের কথা কিংবা ফরয সালাতের কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৪৩৮, ইসলামিক সেন্টারঃ ৪৫৪) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। ওজু হলো এমন একটি মহা ইবাদত বা উপাসনা যার মধ্যে মহান আল্লাহ মহা পুণ্য বা সওয়াব নির্ধারণ করে রেখেছেন। তাই এর দ্বারা পাপের ক্ষমা হয় এবং মর্যাদা উচ্চ হয়। সুতরাং মুসলিম ব্যক্তির উচিত যে, সে যেন এই ইবাদতটির যত্ন করে এবং এর আদব কায়দা, শর্তসমূহ আর ওজু বিনষ্টকারী বিষয়গুলির সঠিকভাবে জ্ঞান লাভ করে। ২। এই হাদীসটি পরিপূর্ণভাবে ও সুন্দরভাবে ওজু করার প্রতি উৎসাহ প্রদান করে। এবং বিনয় নম্রতা ও একাগ্রতার সহিত নামাজ পড়ার প্রতিও উৎসাহ প্রদান করে। ৩। এই হাদীসটি পাঁচ ওয়াক্ত নামাজের মর্যাদা বর্ণনা করে। আর সেই মর্যাদা হলো এই যে, এই নামাজের দ্বারা সমস্ত পাপ ক্ষমা করা হয়। তবে এই পাপগুলি বলতে ছোটো পাপগুলিকে বুঝানো হয়েছে। তাই বড়ো পাপের ক্ষমা অর্জনের জন্য সঠিক পন্থায় সত্য তওবা করা অপরিহার্য।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": "232.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৬, আন্তর্জাতিক নাম্বারঃ ২৩২ ৪৩৬-(১২/২৩২) হারূন ইবনু সাঈদ আল আইলী ..... উসমান (রাযিঃ) এর আযাদকৃত গোলাম হুমরান থেকে বর্ণিত। তিনি বলেছেনঃ একদিন উসমান ইবনু আফফান খুব উত্তমরূপে ওযু করে বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ওযু করতে দেখেছি যে, সে অতি যত্ন করে ওযু করলেন। অতঃপর তিনি [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেছেনঃ যে ব্যক্তি অনুরূপ ওযু করে সালাতের জন্যে মসজিদের দিকে যায় এবং তার মসজিদে যাওয়া যদি সালাত ব্যতীত অন্য কোন কারণে না হয় তবে তার অতীত জীবনের সকল গুনাহ মাফ করে দেয়া হবে। (ইসলামিক ফাউন্ডেশনঃ ৪৩৯, ইসলামিক সেন্টারঃ ৪৫৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": "232.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৭, আন্তর্জাতিক নাম্বারঃ ২৩২ ৪৩৭-(১৩/...) আবূ তাহির ও ইউনুস ইবনু আবদুল আ'লা (রহঃ) ..... উসমান ইবনু আফফান (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তিনি বলেছেনঃ যে ব্যক্তি সালাত আদায়ের জন্যে পরিপূর্ণরূপে ওযু করে ফরয সালাত আদায়ের উদ্দেশে (মসজিদে) যায় এবং লোকেদের সাথে, অথবা তিনি বলছেনঃ জামা'আতের সাথে, অথবা বলেছেন, মসজিদের মধ্যে সালাত আদায় করে, আল্লাহ তার গুনাসমূহকে মাফ করে দিবেন। (ইসলামিক ফাউন্ডেশনঃ ৪৪০, ইসলামিক সেন্টার, ৪৫৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": "233.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৩৮, আন্তর্জাতিক নাম্বারঃ ২৩৩ ৪৩৮-(১৪/২৩৩) ইয়াহইয়া ইবনু আইয়ুব, কুতাইবাহ ইবনু সাঈদ ও আলী ইবনু হুজুর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পাঁচ ওয়াক্ত সালাত এবং এক জুমুআহ থেকে অন্য জুমুআহ এবং উভয়ের মধ্যবর্তী সময়ের সব গুনাহের জন্যে কাফফারাহ হয়ে যায় যদি সে কাবীরাহ গুনাহতে লিপ্ত না হয়। (ইসলামিক ফাউন্ডেশনঃ ৪৪১, ইসলামিক সেন্টারঃ ৪৫৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": "233.02",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": "233.03",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": "234.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪১, আন্তর্জাতিক নাম্বারঃ ২৩৪ ৪৪১-(১৭/২৩৪) মুহাম্মাদ ইবনু হাতিম ইবনু মাইমূন (রহঃ) ..... উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার ওপর উট চড়ানোর দায়িত্ব ছিল। আমার পালা এলে আমি উট চরিয়ে বিকেলে ফিরিয়ে নিয়ে এলাম। তারপর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে পেলাম, তিনি দাঁড়িয়ে লোকেদের সঙ্গে কথা বলছেন। তখন আমি তার এ কথা শুনতে পেলাম, \"যে মুসলিম সুন্দরভাবে ওযু করে তারপর দাঁড়িয়ে দেহ ও মনকে পুরোপুরি আল্লাহর প্রতি নিবদ্ধ রেখে দু' রাকাআত সালাত আদায় করে সে অবশ্যই জান্নাতে যাবে। উকবাহ বলেন, কথাটি শুনে আমি বলে উঠলামঃ বাহ! হাদীসটি কত চমৎকার! তখন আমার সামনের একজন বলতে লাগলেন, আগের কথাটি আরো উত্তম। আমি সে দিকে তাকিয়ে দেখলাম তিনি 'উমার। তিনি আমাকে বললেন, তোমাকে দেখেছি, এ মাত্র এসেছে। রাসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর আগে বলেছেন, তোমাদের মধ্য থেকে যে ব্যক্তি উত্তম ও পূর্ণরূপে ওযু করে এ দু'আ পড়বে- \"আশহাদু আল্লা-ইলা-হা ইল্লাল্ল-হু ওয় আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু\"। তার জন্যে জান্নাতের আটটি দরজা খুলে যাবে এবং যে দরজা দিয়ে ইচ্ছা সে জান্নাতে প্রবেশ করতে পারবে। (ইসলামিক ফাউন্ডেশনঃ ৪৪৪, ইসলামিক সেন্টারঃ ৪৬০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": "234.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪২, আন্তর্জাতিক নাম্বারঃ ২৩৪ ৪৪২-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... উকবাহ ইবনু আমির আল জুহানী (রাযিঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে উপরের হাদীসের অনুরূপ বর্ণনা করেছেন। তবে এ বর্ণনায় বলেছেনঃ যে ব্যক্তি ওযু করে পাঠ করবে- 'আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত প্রকৃত কোন উপাস্য নেই। তিনি এক, তার কোন শারীক নেই। আমি আরো সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বান্দা ও রাসূল'। (ইসলামিক ফাউন্ডেশনঃ ৪৪৫, ইসলামিক সেন্টারঃ ৪৬১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": "235.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৩, আন্তর্জাতিক নাম্বারঃ ২৩৫ ৪৪৩-(১৮/২৩৫) মুহাম্মাদ ইবনুস সাব্বাহ (রহঃ) ..... আবদুল্লাহ ইবনু যায়দ ইবনু আসিম আল আনসারী (রাযিঃ) যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহচর্য লাভ করেছিলেন। রাবী বলেন, তাকে বলা হলো যে, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওযু (কেমন ছিল) আমাদেরকে দেখিয়ে দিন। তখন তিনি পানির পাত্র আনালেন। তারপর তা থেকে দু'হাতের ওপর পানি ঢেলে উভয় হাত তিনবার ধুলেন তারপর পাত্রে হাত ঢুকিয়ে পানি বের করে এক আজলা পানি দ্বারা কুলি করলেন ও নাকে পানি দিলেন। এরূপ তিনবার করলেন। পুনরায় পানিতে হাত ঢুকিয়ে পানি নিয়ে তিনবার মুখমণ্ডল ধুলেন। আবার হাত ঢুকিয়ে পানি বের করে দু'হাত কনুই পর্যন্ত দু'বার করে ধুলেন। তারপর হাত ঢুকিয়ে পানি বের করে মাথার সামনে ও পিছনে দু'হাত দিয়ে মাসাহ করলেন- তারপর, উভয় পা গিরা পর্যন্ত ধুলেন, এরপর বললেনঃ এরূপ ছিল রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওযু (ইসলামিক ফাউন্ডেশনঃ ৪৪৬, ইসলামিক সেন্টারঃ ৪৬২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": "235.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৪, আন্তর্জাতিক নাম্বারঃ ২৩৫ ৪৪৪-(.../...) কাসিম ইবনু যাকারিয়্যা, খালিদ ইবনু মাখলাদ, সুলাইমান ইবনু বিলাল, আমর ইবনু ইয়াহইয়া (রহঃ) থেকে ঐ সূত্রেই বর্ণনা করেছেন। তবে তিনি \"উভয় পায়ের গিরা পর্যন্ত\" ধুয়েছেন এ কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৪৪৭, ইসলামিক সেন্টারঃ ৪৬৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": "235.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৫, আন্তর্জাতিক নাম্বারঃ ২৩৫ ৪৪৫-(.../...) ইসহাক ইবনু মূসা আল আনসারী (রহঃ) .... 'আমর ইবনু ইয়াহইয়া (রাযিঃ) থেকে উক্ত সনদ দ্বারা এভাবেও বর্ণিত হয়েছে যে, তিনি তিনবার কুলি করলেন এবং নাকে পানি ঢেলে ঝাড়লেন, এক হাতে পানি নিয়ে করেছেন এ কথাটি তিনি বলেননি। অবশ্য এ বাক্যটির পরে নিম্নের বাক্যগুলো বর্ধিত করেছেন; মাথা মাসাহ করার সময় হাত দু’খানা মাথার সম্মুখভাগে রাখলেন এরং পরে তা টেনে মাথার পেছনভাগে নিয়ে গেলেন। অতঃপর আবার পূর্বের জায়গায় অর্থাৎ যেখান থেকে আরম্ভ করেছিলেন সেখানে নিয়ে আসলেন এবং পরে পা দু'খানা ধুলেন। (ইসলামিক ফাউন্ডেশনঃ ৪৪৮, ইসলামিক সেন্টারঃ ৪৬৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": "235.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৬, আন্তর্জাতিক নাম্বারঃ ২৩৫ ৪৪৬-(.../...) 'আবদুর রহমান ইবনু বিশ্বর আল আবদী ..... উহায়ব (রহঃ) বর্ণনা করেছেন যে, \"আমর ইবনু ইয়াহইয়া (রাযিঃ) থেকে পূর্ব বর্ণিত সনদের অনুরূপ বর্ণনা করেছেন। তবে এ হাদীসে রাবী বলেন যে, তিনি তিন আজলা পানি দ্বারা কুলি করেছেন এবং নাকে পানি দিয়ে নাক ঝেড়েছেন। তিনি আরো বলেছেন যে, তিনি একবার মাত্র মাসাহ করেছেন তবে হাতগুলো মাথার সম্মুখের দিক থেকে পেছনের টেনে নিয়েছেন। বাহয বলেছেন, উহায়ব এ হাদীসটি আমাকে লিপিবদ্ধ করে দিয়েছেন আর উহায়ব বলেছেনঃ এ হাদীসটি 'আমর ইবনু ইয়াহইয়া আমাকে দু'বার লিখিয়েছেন। (ইসলামিক ফাউন্ডেশনঃ ৪৪৯, ইসলামিক সেন্টারঃ ৪৬৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": "236",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৭, আন্তর্জাতিক নাম্বারঃ ২৩৬ ৪৪৭-(১৯/২৩৬) হারূন ইবনু মা’রূফ এবং হারূন ইবনু সাঈদ আল আইলী ও আবূ তাহির (রহঃ) ..... আবদুল্লাহ ইবনু যায়দ ইবনু আসিম আল মাযানী বলেন, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এভাবে ওযু করতে দেখেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুলি করলেন, নাকে পানি দিয়ে ঝাড়লেন, অতঃপর মুখমণ্ডল তিনবার ধুলেন। ডান হাত এবং বাম হাত খানাও তিনবার ধুলেন। এরপর হাতের অবশিষ্ট পানি ছাড়া নতুন পানি দিয়ে মাথা মাসাহ করলেন অতঃপর পা দু'খানা খুব ভালভাবে ধুয়ে পরিষ্কার করলেন। আবূ তাহির বলেনঃ ইবনু ওয়াহব, আমর ইবনু হারিস এর উদ্ধৃতি দিয়ে আমাদের নিকট এ হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৪৫০, ইসলামিক সেন্টারঃ ৪৬৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": "237.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৮, আন্তর্জাতিক নাম্বারঃ ২৩৭ ৪৪৮-(২০/২৩৭) কুতাইবাহ ইবনু সাঈদ, আমর আন নাকিদ ও মুহাম্মদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) … আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ তোমাদের কেউ যখন ঢিলা ব্যবহার করে, তখন যেন বেজোড় সংখ্যা ব্যবহার করে। আর তোমদের কেউ যখন ওযু করে তখন যেন নাকের ভেতর পানি প্রবেশ করায় এবং নাক ঝেড়ে সাফ করে। (ইসলামিক ফাউন্ডেশনঃ ৪৫১, ইসলামিক সেন্টারঃ ৪৬৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": "237.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৪৯, আন্তর্জাতিক নাম্বারঃ ২৩৭ ৪৪৯-(২১/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনব্বিহ (রহঃ) বলেনঃ এগুলো আবূ হুরাইরাহ (রাযিঃ) আমাদের কাছে মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। এরপর তিনি কয়েকটি হাদীস উল্লেখ করেন। তন্মধ্যে এও ছিল যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা যখন ওযু করবে তখন উভয় নাকের ছিদ্রে পানি টেনে নিবে, এরপর ঝেড়ে ফেলবে। (ইসলামিক ফাউন্ডেশনঃ ৪৫২, ইসলামিক সেন্টারঃ ৪৬৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": "237.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫০, আন্তর্জাতিক নাম্বারঃ ২৩৭ ৪৫০-(২২/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ওযু করবে, সে যেন নাকে পানি দিয়ে নাক ঝাড়ে, আর যে ঢিলা ব্যবহার করবে, সে যেন বেজোড় সংখ্যক ব্যবহার করে। (ইসলামিক ফাউন্ডেশনঃ ৪৫৩, ইসলামিক সেন্টারঃ ৪৬৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": "237.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫১, আন্তর্জাতিক নাম্বারঃ ২৩৭ ৪৫১-(.../...) সাঈদ ইনু মানসূর ও হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ ও আবূ সাঈদ আল খুদরী (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ অবশিষ্টাংশ অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৪৫৪, ইসলামিক সেন্টারঃ ৪৭০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": "238",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫২, আন্তর্জাতিক নাম্বারঃ ২৩৮ ৪৫২-(২৩/২৩৮) বিশর ইবনুল হাকাম আল আবদী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন তোমাদের কেউ ঘুম থেকে উঠবে সে যেন নাকে পানি দিয়ে তিনবার নাক ঝেড়ে নেয়। কেননা, শয়তান তার নাকের ভেতর রাত্রি যাপন করে। (ইসলামিক ফাউন্ডেশনঃ ৪৫৫, ইসলামিক সেন্টারঃ ৪৭১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": "239",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৩, আন্তর্জাতিক নাম্বারঃ ২৩৯ ৪৫৩-(২৪/২৩৯) ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যখন ঢিলা ব্যবহার করবে তখন বেজোড় সংখ্যা নিবে। (ইসলামিক ফাউন্ডেশনঃ ৪৫৬, ইসলামিক সেন্টারঃ ৪৭২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": "240.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৪, আন্তর্জাতিক নাম্বারঃ ২৪০ ৪৫৪-(২৫/২৪০) হারূন ইবনু সাঈদ আল আইলী, আবূ তাহির ও আহমাদ ইবনু ঈসা (রহঃ) ..... সালিম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি সা'দ ইবনু আবূ ওয়াক্কাস এর ইন্তিকালের দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) এর কাছে উপস্থিত হই। সে সময়ে 'আবদুর রহমান ইবনু আবূ বকরও এলেন এবং 'আয়িশাহ (রাযিঃ) এর সামনে ওযু করতে লাগলেন। তখন আয়িশাহ (রাযিঃ) বললেনঃ হে আবদুর রহমান পূর্ণভাবে ওযু কর। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ কথা বলতে শুনেছি যে, পায়ের ঐ গোড়ালিগুলোর জন্য আগুনের শাস্তি রয়েছে (যেগুলো শুকনো থাকে)। (ইসলামিক ফাউন্ডেশনঃ ৪৫৭, ইসলামিক সেন্টারঃ ৪৭৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": "240.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৫, আন্তর্জাতিক নাম্বারঃ ২৪০ ৪৫৫-(.../...) হারমালাহ ইবনু ইয়াহইয়া, ইবনু ওয়াহব, হাইওয়াহ মুহাম্মাদ ইবনু আবদুর রহমান এর মাধ্যমে শাদ্দাদ ইবনুল হাদ এর আযাদকৃত গোলাম আবূ আবদুল্লাহ থেকে বর্ণনা করেছেন যে, একদিন তিনি আয়িশাহ (রাযিঃ) এর নিকট গেলেন। এতটুকু বর্ণনা করার পর তিনি আয়িশাহ (রাযিঃ) এর উদ্ধৃতি দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পূর্ব বর্ণিত হাদীসের অনুরূপ হাদীস বর্ণনা করলেন। (ইসলামিক ফাউন্ডেশনঃ ৪৫৮, ইসলামিক সেন্টারঃ ৪৭৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": "240.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৬, আন্তর্জাতিক নাম্বারঃ ২৪০ ৪৫৬-(.../...) মুহাম্মাদ ইবনু হাতিম ও আবূ মা'ন আর রাকাশী (রহঃ) ..... সালিম মাওলা আল মাহরী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ও আবদুর রহমান ইবনু আবূ বকর (রাযিঃ) সা'দ ইবনু আবী ওয়াক্কাস এর জানাযার উদ্দেশে বের হলাম। আমরা আয়িশাহ (রাযিঃ) এর ঘরের দরজায় সম্মুখ দিয়ে যাচ্ছিলাম। তখন তিনি (সালিম) আয়িশাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশনঃ ৪৫৯, ইসলামিক সেন্টারঃ ৪৭৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": "240.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৭, আন্তর্জাতিক নাম্বারঃ ২৪০ ৪৫৭-(.../...) সালামাহ ইবনু শাবীব (রহঃ) ..... শাদ্দাদ ইবনু হাদ (রহঃ) এর আযাদকৃত গোলাম সালিম থেকে বর্ণিত। তিনি বলেছেনঃ একদা আমি আয়িশাহ্ (রাযিঃ) এর সাথে ছিলাম। অতঃপর তিনি 'আয়িশাহ (রাযিঃ) এর উদ্ধৃতি দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশনঃ ৪৬০, ইসলামিক সেন্টারঃ ৪৭৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": "241.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৮, আন্তর্জাতিক নাম্বারঃ ২৪১ ৪৫৮-(২৬/২৪১) যুহায়র ইবনু হারব, ইসহাক (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক সময় আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মক্কা থেকে মদীনায় ফিরে আসছিলাম। পথিমধ্যে আমরা যখন এক জায়গায় পানির কাছে পৌছলাম, তখন কিছু সংখ্যক লোক আসরের সালাতের সময় তাড়াহুড়া করল। এরা ওযুও করল তাড়াহুড়া করে। আমরা যখন তাদের কাছে পৌছলাম, তখন তাদের পায়ের গোড়ালিসমূহ এমনভাবে প্রকাশ পাচ্ছে যে, তাতে পানি পৌছেনি। এ দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ওযু করার সময় পায়ের গোড়ালি যে সব স্থানে পানি পৌছেনি সেগুলোর জন্য জাহান্নাম। তাই তোমরা ভালভাবে ওযু করো। (ইসলামিক ফাউন্ডেশনঃ ৪৬১, ইসলামিক সেন্টারঃ ৪৭৭) প্রাসঙ্গিক আলোচনা হাদীসের বর্ণনাকারী সাহাবীগণ বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে মক্কা থেকে মদীনায় প্রত্যাবর্তন করার পথে যখন রাস্তায় একটি পানির কূপের নিকট পৌঁছলাম, আমাদের মধ্যকার কতক লোক আসরের সময় তাড়াতাড়ি অযু করতে গেলেন এবং তাড়াহুড়া করে অযু করলেন। অতঃপর আমরা তাদের নিকট পৌঁছলাম ও দেখলাম তাদের পায়ের গোড়ালী শুষ্ক চকচক করছে, সেখানে পানি পৌঁছেনি, তা দেখে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এভাবে সাবধান করেছেন। হাদিস থেকে শিক্ষা ১. পা ধোয়া ফরয। আর এটিই কুরআন, হাদীস, সাহাবায়ে কেরামের আমল এবং তাবেয়ীগণের মত। এর ওপরই উম্মতের ইজমা হয়েছে। এ ব্যাপারে শিয়াদের বিরোধিতা গ্রহণযোগ্য নয়। ২. এ জন্যই অযুর জায়গায় যদি দৃশ্যমান প্রলেপ পড়ে এমন কিছু থাকে, যার কারণে শরীরের চামড়ায় পানি পৌঁছবে না এমন হয়ে যায়, তবে তা সরানো পর্যন্ত অযু হবে না। যেমন- নেইল পালিশ, প্রলেপ বিশিষ্ট রঙ, কড়া মেকআপ ইত্যাদি। অযু বা গোসল বিশুদ্ধ হওয়ার জন্য তা অবশ্যই দূর করতে হবে। ৩. যারা অযু করার ক্ষেত্রে কসুর করবে তাদের জন্য কঠোর শাস্তির ঘোষণা প্রদান করা হয়েছে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": "241.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৫৯, আন্তর্জাতিক নাম্বারঃ ২৪১ ৪৫৯-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) সুফইয়ান এর সূত্রে এবং ইবনু আল মুসান্না ও ইবনু বাশশার শু'বাহ্ (রহঃ)-এর সূত্রে উভয়ে উক্ত সনদে মানসূর থেকে বর্ণনা করেন তবে শু'বাহ বর্ণিত হাদীসে \"পরিপূর্ণভাবে ওযু করো\" কথাটি নেই। এ হাদীসের সনদে \"আবূ ইয়াহইয়া\" শব্দের সাথে \"আল আ'রাজ\" যুক্ত আছে। (ইসলামিক ফাউন্ডেশনঃ ৪৬২, ইসলামিক সেন্টারঃ ৪৭৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": "241.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬০, আন্তর্জাতিক নাম্বারঃ ২৪১ ৪৬০-(২৭/...) শাইবান ইবনু ফাররূখ ও আবূ কামিল আল জাহদারী (রহঃ) ..... 'আবদুল্লাহ ইবনু আমর (রাযিঃ) বলেনঃ কোন এক সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের পিছনে পড়ে যান। অবশেষে তিনি আমাদের পেলেন যখন আসরের সময় উপস্থিত এবং আমরা ওযু করতে গিয়ে পা মাসাহ করছি। তখন তিনি ঘোষণা দিলেন, ধ্বংস ঐ গোড়ালিগুলোর জন্যে, যে সব স্থানে পানি পৌঁছেনি; যেগুলোর ঠিকানা জাহান্নাম। (ইসলামিক ফাউন্ডেশনঃ ৪৬৩, ইসলামিক সেন্টারঃ ৪৭৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": "242.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬১, আন্তর্জাতিক নাম্বারঃ ২৪২ ৪৬১-(২৮/২৪২) ‘আবদুর রহমান ইবনু সাল্লাম আল জুমাহী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে দেখলেন, সে তার গোড়ালি ধোয়নি। তখন তিনি বললেন, ধ্বংস ঐ গোড়ালিগুলোর জন্য, যে সব স্থানে পানি পৌছেনি; যেগুলোর ঠিকানা জাহান্নাম। (ইসলামিক ফাউন্ডেশনঃ ৪৬৪, ইসলামিক সেন্টারঃ ৪৮০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": "242.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬২, আন্তর্জাতিক নাম্বারঃ ২৪২ ৪৬২-(২৯/...) কুতাইবাহ, আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি কয়েকজন লোককে দেখলেন, তারা পাত্র থেকে পানি নিয়ে ওযু করছে। তখন তিনি বললেনঃ পরিপূর্ণরূপে ওযু করো। কারণ, আমি আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ ধ্বংস ঐ গোড়ালিগুলোর জন্যে, যে সব স্থানে পানি পৌছেনি; যেগুলোর ঠিকানা হবে জাহান্নাম। (ইসলামিক ফাউন্ডেশনঃ ৪৬৫, ইসলামিক সেন্টারঃ ৪৮১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": "242.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৩, আন্তর্জাতিক নাম্বারঃ ২৪২ ৪৬৩-(৩০/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ধ্বংস ঐ গোড়ালিগুলোর জন্যে, যে সব স্থানে পানি পৌছেনি; যেগুলোর ঠিকানা হবে জাহান্নাম। (ইসলামিক ফাউন্ডেশনঃ ৪৬৬, ইসলামিক সেন্টারঃ ৪৮২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": "243",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৪, আন্তর্জাতিক নাম্বারঃ ২৪৩ ৪৬৪-(৩১/২৪৩) সালামাহ্ ইবনু শাবীব (রহঃ) ..... উমার ইবনুল খাত্তাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি ওযু করতে তার পায়ের ওপর নখ পরিমাণ অংশ ছেড়ে দেয়। তা দেখে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যাও, আবার ভালভাবে ওযু করে আসো। লোকটি ফিরে গেল। তারপর (পুনরায়) ওযু করে সালাত আদায করল। (ইসলামিক ফাউন্ডেশনঃ ৪৬৭, ইসলামিক সেন্টারঃ ৪৮৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": "244",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৫, আন্তর্জাতিক নাম্বারঃ ২৪৪ ৪৬৫-(৩২/২৪৪) আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিম কিংবা মু'মিন বান্দা (রাবীর সন্দেহ) ওযুর সময় যখন মুখমণ্ডল ধুয়ে ফেলে তখন তার চোখ দিয়ে অর্জিত গুনাহ পানির সাথে অথবা (তিনি বলেছেন) পানির শেষ বিন্দুর সাথে বের হয়ে যায় এবং যখন সে দু'টি হাত ধৌত করে তখন তার দু'হাতের স্পর্শের মাধ্যমে সব গুনাহ পানির অথবা পানির শেষ বিন্দুর সাথে ঝরে যায়। অতঃপর যখন সে পা দুটি ধৌত করে, তখন তার দু'পা দিয়ে হাটার মাধ্যমে অর্জিত সব গুনাহ পানির সাথে অথবা পানির শেষ বিন্দুর সাথে ঝরে যায়, এমনকি সে যাবতীয় গুনাহ থেকে মুক্ত ও পরিষ্কার-পরিচ্ছন্ন হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৪৬৮, ইসলামিক সেন্টারঃ ৪৮৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": "245",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৬, আন্তর্জাতিক নাম্বারঃ ২৪৫ ৪৬৬-(৩৩/২৪৫) মুহাম্মাদ ইবনু মামার ইবনু রিবাঈ আল কায়সী (রহঃ) ..... উসমান ইবনু আফফান (রাযিঃ) বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি ওযু করে এবং তা উত্তমরূপে করে, তার দেহ থেকে সমস্ত পাপ ঝরে যায়, এমনকি তার নখের ভিতর থেকেও (গুনাহ) বের হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৪৬৯, ইসলামিক সেন্টারঃ ৪৮৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": "246.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৭, আন্তর্জাতিক নাম্বারঃ ২৪৬ ৪৬৭-(৩৪/২৪৬) আবূ কুরায়ব, মুহাম্মাদ বিন 'আলা, কাসিম বিন যাকারিয়্যা ও আবদ বিন হুমায়দ (রহঃ) …. নুআয়ম ইবনু আবদুল্লাহ আল মুজমির (রহঃ) থেকে বর্ণিত। তিনি বলেছেন, আমি আবূ হুরাইরাহ (রাযিঃ) কে ওযু করতে দেখেছি। তিনি খুব ভালভাবে মুখমণ্ডল ধুলেন, এরপর ডান হাত ধুলেন এবং বাহুর কিছু অংশ ধুলেন। পরে বাম হাত ও বাহুর কিছু অংশসহ ধুলেন। এরপর মাথা মাসাহ করলেন। অতঃপর ডান পায়ের নালার কিছু অংশসহ ধুলেন, এরপর বাম পায়ের নালার কিছু অংশসহ একইভাবে ধুলেন। অতঃপর বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এভাবে ওযু করতে দেখেছি। তিনি আরো বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পূর্ণাঙ্গরূপে ওযু করার কারণে কিয়ামতের দিন তোমাদের মুখমণ্ডল, হাত ও পায়ের ওযুর স্থান জ্যোতির্ময় হবে। সুতরাং তোমাদের মধ্যে যারা সক্ষম তারা যেন নিজ নিজ মুখমণ্ডল, হাত ও পায়ের জ্যোতি বাড়িয়ে নেয়। (ইসলামিক ফাউন্ডেশনঃ ৪৭০, ইসলামিক সেন্টারঃ ৪৮৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": "246.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৮, আন্তর্জাতিক নাম্বারঃ ২৪৬ ৪৬৮-(৩৫/...) হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... নুআয়ম ইবনু আবদুল্লাহ (রহঃ) থেকে বর্ণিত। তিনি আবূ হুরাইরাহ (রাযিঃ) কে ওযু করতে দেখলেন। ওযু করতে তিনি মুখমণ্ডল ও হাত দুটি এমনভাবে ধুলেন যে, প্রায় কাঁধ পর্যন্ত ধুয়ে ফেললেন। এরপর পা দুটি এমনভাবে ধুলেন যে, পায়ের নালার কিছু অংশ ধুয়ে ফেললেন। এভাবে ওযু করার পর বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তিনি বলেছেনঃ আমার উম্মত ওযুর প্রভাবে কিয়ামতের দিন দীপ্তিময় মুখমণ্ডল ও হাত-পা নিয়ে উঠবে। কাজেই তোমরা যারা সক্ষম তারা অধিক বিস্তৃত দীপ্তিসহ উঠতে সে যেন চেষ্টা করে। (ইসলামিক ফাউন্ডেশনঃ ৪৭১, ইসলামিক সেন্টারঃ ৪৮৭) প্রাসঙ্গিক আলোচনা ওযূর মাকরূহ বিষয়সমূহ ওযূর যেমনি ফরয রয়েছে, তেমনি তাতে রয়েছে কিছু সুন্নাত। কিন্তু অতিরিক্ত কাজ করাও কিন্তু মাকরূহ বা অপছন্দনীয় কাজ। ওযূর মধ্যে বেশ কিছু অপছন্দনীয় কাজ রয়েছে নিম্নে সেগুলো বর্ণনা করা হলো: ১. অপবিত্রতা ছিটে ওযূকারীর দিকে আসতে পারে এমন অপবিত্র স্থানে ওযূ করা। ২. ওযূতে তিনবারের অধিক অঙ্গ-প্রত্যঙ্গ ধৌত করা। কেননা রাসূলুল্লাহ্ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম তিন তিনবার ধৌত করেছেন। তিনি বলেছেন, \"অতঃপর যে ব্যক্তি এর অধিক করে সে অবশ্যই যুলুম ও অন্যায় করে।” ৩. পানি ব্যবহারে অপচয় করা। যেহেতু রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এক মুদ পানি দিয়ে ওযূ করেছেন। আর মুদ হলো মাঝারি ধরনের পূর্ণ মানুষের এক মুঠো। তাছাড়া যেকোনো কিছুতে অপচয় করা নিষেধ। ৪. ওযূতে এক বা একাধিক সুন্নাত ছেড়ে দেয়া; কেননা সুন্নাত ছেড়ে দিলে সাওয়াব কমে যায়। তাই সুন্নতের ব্যাপারে যত্নবান হওয়া উচিৎ, ছেড়ে দেয়া অনুচিত। ওযূর অঙ্গসমূহ বাড়িয়ে ধৌত করা হাদীসের শেষের অংশটুকু আবু হুরায়রা রাদ্বিয়াল্লাহু 'আনহুর কথা। উপরোক্ত বর্ণনাগুলো থেকে বুঝা যায় যে, আবু হুরায়রা রাদ্বিয়াল্লাহু 'আনহু ওযূর অঙ্গসমূহ একটু বাড়িয়ে ধৌত করতেন। এটি ছিল তার ইজতিহাদ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমনটি করেছেন প্রমাণিত হয়নি। আর সেজন্য আলেমগণ এ বিষয়টি নিয়ে মতভেদ করেছেন। অধিকাংশ আলেম এভাবে চেহারা, দু' হাত ও দু পায়ের ওযূর জায়গা থেকে বাড়তি অংশ ধৌত করা মুস্তাহাব বলেছেন। কিন্তু ইমাম মালিক, ইমাম আহমাদ উপরোক্ত অঙ্গসমূহের ফরয অংশের অতিরিক্ত অংশ ইচ্ছাকৃত ধৌত করা মুস্তাহাব নয় বলেছেন। শাইখুল ইসলাম ইবন তাইমিয়্যাহ, ইবনুল কাইয়্যেম, ইবন সাদী রাহিমাহুমুল্লাহ এ মতটিকে প্রাধান্য দিয়েছেন।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": "247.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৬৯, আন্তর্জাতিক নাম্বারঃ ২৪৭ ৪৬৯-(৩৬/২৪৭) সুওয়াইদ ইবনু সাঈদ ও ইবনু আবূ উমার (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, আমার হাওযে কাওসার হবে আদান (ইয়ামানের বন্দর নগরী) থেকে আইলা (আরবের উত্তরাঞ্চলীয় শহর) এর যত দূরত্ব তার থেকেও বেশি দীর্ঘ। আর তা হবে বরফের থেকেও সাদা এবং দুধ মধু থেকেও মিষ্টি। আর তার পাত্রের সংখ্যা হবে তারকারাজির চেয়েও অধিক। আমি কিছু সংখ্যক লোককে তা থেকে ফিরিয়ে দিতে থাকবো যেমনিভাবে লোকে তার হাওয থেকে অন্যের উট ফিরিয়ে দেয়। সাহাবায়ে কিরাম আরয করলেন, “ইয়া রাসূলাল্লাহ! সেদিন কি আপনি আমাদেরকে চিনতে পারবেন? তিনি বললেন, “হ্যাঁ, তোমাদের এমন চিহ্ন হবে যা অন্য কোন উম্মতের হবে না। ওয়ূর বিনিময়ে তোমাদের মুখমণ্ডল জ্যোতির্ময় ও হাত-পা দীপ্তিমান অবস্থায় তোমরা আমার কাছে আসবে\"। (ইসলামিক ফাউন্ডেশনঃ ৪৭২, ইসলামিক সেন্টারঃ ৪৮৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": "247.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭০, আন্তর্জাতিক নাম্বারঃ ২৪৭ ৪৭০-(৩৭/...) আবূ কুরায়ব ও ওয়াসিল ইবনু আবদুল আ'লা (রহঃ) .... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উম্মতের কিছুলোক কিয়ামতের দিন আমার কাছে হাওযে কাওসারে উপস্থিত হবে। আর আমি তাদেরকে তা থেকে এমনভাবে বিতাড়িত করব, যেভাবে কোন ব্যক্তি তার উটের পাল থেকে অন্যের উটকে বিতাড়িত করে থাকে। (এ কথা শুনে) লোকেরা জিজ্ঞেস করলঃ আল্লাহর নবী! আপনি কি আমাদেরকে চিনতে পারবেন? জবাবে তিনি বললেন, হ্যাঁ। তোমাদের এমন এক চিহ্ন হবে যা অন্য কারোর হবে না। ওযুর প্রভাবে তোমাদের মুখমণ্ডল ও হাত-পায়ের দীপ্তি ও উজ্জ্বলতা ছড়িয়ে পড়বে। উজ্জ্বল জ্যোতি বিচ্ছুরিত অবস্থায় তোমরা আমার নিকট আসবে। আর তোমাদের একদল লোককে জোর করে আমার থেকে ফিরিয়ে দেয়া হবে। তাই তারা আমার কাছে পৌছাতে পারবে না। তখন আমি বলব, হে আমার প্রভু! এরাতো আমার লোক। এর জবাবে একজন ফেরেশতা আমাকে বলবে, আপনি জানেন না, আপনার অবর্তমানে (ইনতিকালের পরে) তারা কি কি নতুন কাজ (বিদ'আত) করেছে! (ইসলামিক ফাউন্ডেশনঃ ৪৭৩, ইসলামিক সেন্টারঃ ৪৮৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": "248",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭১, আন্তর্জাতিক নাম্বারঃ ২৪৮ ৪৭১-(৩৮/২৪৮) উসমান ইবনু আবূ শাইবাহ (রহঃ) ..... হুযাইফাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার হাওয (হাওযে কাওসার) আইলা থেকে আদান এর দূরত্ব পরিমাণ দীর্ঘ। সে মহান সত্তার কসম, যার হাতে আমার প্রাণ! আমি তা থেকে কিছু মানুষকে এমনভাবে তাড়াবো যেমন কোন ব্যক্তি অপরিচিত উটকে তার পানির কূপ থেকে তাড়িয়ে দেয়। লোকেরা জিজ্ঞেস করলঃ হে আল্লাহর রাসূল! আপনি কি সেদিন আমাদেরকে চিনতে পারবেন? তিনি বললেন, হ্যাঁ। ওযুর প্রভাবে তোমাদের চেহারা ও হাত-পা থেকে উজ্জ্বল জ্যোতি ছড়িয়ে পড়া অবস্থায় তোমরা আমার নিকট উপস্থিত হবে। এটা তোমাদের ছাড়া অন্য উম্মতের জন্যে হবে না। (ইসলামিক ফাউন্ডেশনঃ ৪৭৪, ইসলামিক সেন্টারঃ ৪৯০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": "249.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭২, আন্তর্জাতিক নাম্বারঃ ২৪৯ ৪৭২-(৩৯/২৪৯) ইয়াহইয়া ইবনু আইয়ুব, সুরায়জ ইবনু ইউনুস, কুতাইবাহ ইবনু সাঈদ ও আলী ইবনু হজর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি কবরস্থানে এসে বললেন, তোমাদের উপর শান্তি বর্ষিত হোক। হে কবরবাসী মু’মিনগণ! ইনশাআল্লাহ আমরাও তোমাদের সাথে এসে মিলব। আমার বড় ইচ্ছা হয় আমাদের ভাইদেরকে দেখি। সাহাবায়ে কিরাম আরয করলেন, ইয়া রাসূলাল্লাহ! আমরা কি আপনার ভাই নই? তিনি বললেন, তোমরা তো আমার সাহাবা। আর যারা এখনো (পৃথিবীতে) আসেনি তারা আমাদের ভাই। সাহাবায়ে কিরাম আরয করলেন, ইয়া রাসূলাল্লাহ। আপনার উম্মতের মধ্যে যারা এখনো (পৃথিবীতে) আসেনি তাদেরকে আপনি কিভাবে চিনবেন? তিনি বললেন, \"কেন, যদি কোন ব্যক্তি সাদা রঙের কপাল ও সাদা রঙের হাত-পা বিশিষ্ট ঘোড়া অনেকগুলো কালো ঘোড়ার মধ্যে মিশে যায় তবে সে কি তার ঘোড়াকে চিনে নিতে পারবে না? তারা বললেন, হ্যাঁ, ইয়া রাসূলাল্লাহ! তিনি বললেন, তারা (আমার উম্মত) সেদিন এমন অবস্থা আসবে যে, ওযুর ফলে তাদের মুখমণ্ডল, হাত-পা জ্যোতির্ময় হবে। আর হাওযের পাড়ে আমি হব তাদের অগ্রনায়ক। জেনে রাখ, কিছু সংখ্যক লোককে সেদিন আমার হাওয থেকে তাড়িয়ে দেয়া হবে যেমনিভাবে বেওয়ারিশ উটকে তাড়িয়ে দেয়া হবে। আমি তাদেরকে ডাকব, এসো এসো। তখন বলা হবে, \"এরা আপনার পরে (আপনার দীনকে) পরিবর্তন করে দিয়েছিল\"। তখন আমি বলব, “দূর হও, দূর হও”। (ইসলামিক ফাউন্ডেশনঃ ৪৭৫, ইসলামিক সেন্টারঃ ৪৯১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": "249.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৩, আন্তর্জাতিক নাম্বারঃ ২৪৯ ৪৭৩-(.../...) কুতাইবাহ ইবনু সাঈদ (রহঃ) .... ইসহাক ইবনু মূসা আল আনসারী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরস্থানে গেলেন ও বললেন, মু'মিনদের বাসস্থানে (কবরস্থানে) তোমাদের উপর শান্তি বর্ষিত হোক। আর আমরা ইনশাআল্লাহ তোমাদের সাথে এসে শামিল হব। অবশিষ্টাংশ ইসমাঈল ইবনু জাফার এর বর্ণিত (পূর্বের) হাদীসের অনুরূপ। তবে মালিক এর হাদীসের এতটুকু বেশি আছে, অবশ্যই কিছু লোককে এ হাওয থেকে তাড়িয়ে দেয়া হবে। (ইসলামিক ফাউন্ডেশনঃ ৪৭৬, ইসলামিক সেন্টারঃ ৪৯২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": "250",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৪, আন্তর্জাতিক নাম্বারঃ ২৫০ ৪৭৪-(৪০/২৫০) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হাযিম (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, একদিন আমি আবূ হুরাইরাহ (রাযিঃ) এর পেছনে ছিলাম। (দেখলাম) তিনি সালাতের জন্যে ওযু করছেন। তিনি হাতের বগল পর্যন্ত ধুলেন। তখন আমি বললাম, হে আবূ হুরাইরাহ! এটা কেমন ধরনের ওযু? তিনি অবাক হয়ে বললেন, হে বানী ফররূখ যদি আমি জানতাম তোমরা এখানে আছো, তাহলে আমি এ ধরনের ওযু করতাম না। আমি আমার বন্ধু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তিনি বলেছেন যে স্থান পর্যন্ত ওযুর পানি পৌছবে সে স্থান পর্যন্ত মু'মিন ব্যক্তির উজ্জ্বলতা অথবা সৌন্দর্যও পৌছবে। (ইসলামিক ফাউন্ডেশনঃ ৪৭৭, ইসলামিক সেন্টারঃ ৪৯৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": "251.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৫, আন্তর্জাতিক নাম্বারঃ ২৫১ ৪৭৫-(৪১/২৫১) ইয়াহইয়া ইবনু আইয়ুব, কুতাইবাহ ও ইবনু হুজর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ আমি কি তোমাদের এমন কাজ জানাবো না, যা করলে আল্লাহ (বান্দার) পাপরাশি দূর করে দেন এবং মর্যাদা বৃদ্ধি করেন? লোকেরা বলল, হে আল্লাহর রাসূল! আপনি বলুন। তিনি বললেন অসুবিধা ও কষ্ট সত্ত্বেও পরিপূর্ণরূপে ওযু করা, মসজিদে আসার জন্যে বেশি পদচারণা করা এবং এক সালাতের পর আর এক সালাতের জন্যে প্রতীক্ষা করা; আর এ কাজগুলোই হল সীমান্ত প্রহরা*। (ইসলামিক ফাউন্ডেশনঃ ৪৭৮, ইসলামিক সেন্টারঃ ৪৯৪) * রিবাত (সীমান্ত প্রহরী) অর্থঃ কোন জিনিস থেকে বন্ধ থাকা, অর্থাৎ ইতা’আতের উপর নিজের আত্মাকে বন্ধ রাখা, তাতে যত কষ্টই হোক।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": "251.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৬, আন্তর্জাতিক নাম্বারঃ ২৫১ ৪৭৬-(.../...) ইসহাক ইবনু মূসা আল আনসারী (রহঃ) ..... মালিক ও শু'বাহ (রাযিঃ), উভয়েই আলা ইবনু আবদুর রহমান (রাযিঃ) থেকে একই সনদে হাদীসটি বর্ণনা করেছেন। তবে শু'বাহর হাদীসের এর উল্লেখ নেই এবং মালিক এর হাদীসে দু'বার উল্লেখ রয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৪৭৯, ইসলামিক সেন্টারঃ ৪৯৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": "252",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৭, আন্তর্জাতিক নাম্বারঃ ২৫২ ৪৭৭-(৪২/২৫২) কুতাইবাহ ইবনু সাঈদ, আমুর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিনদের জন্যে এবং যুহায়র এর বর্ণিত হাদীসে রয়েছে, আমার উম্মতের জন্যে যদি কষ্টসাধ্য না হতো, তাহলে অবশ্যই তাদেরকে প্রত্যেক সালাতের সময় মিসওয়াক করার নির্দেশ দিতাম। (ইসলামিক ফাউন্ডেশনঃ ৪৮০, ইসলামিক সেন্টারঃ ৪৯৬) প্রাসঙ্গিক আলোচনা মিসওয়াক উম্মতের জন্য অবশ্যই গুরুত্বপূর্ণ সুন্নাত। ফরয হওয়া থেকে মুক্তি দেয়া হয়েছে কিন্তু সুন্নাত হিসেবে অবশিষ্ট থাকবে। হাদীসের শিক্ষা ১. উম্মতের প্রতি রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের পূর্ণ মায়া মহব্বত ও দয়া। যা তাদের কষ্ট দিবে তা থেকে তিনি প্রবর্তন করা থেকে সর্বদা দূরে থাকতেন। ২. মিসওয়াকের ফযীলত ও মুস্তাহাব হওয়া প্রমাণিত হলো। ৩. সালাতের সময় মিসওয়াক করার বিষয়টি অত্যধিক তাগিদপূর্ণ হওয়া। আর তা প্রতিটি সালাতের জন্যই, চাই তা ফরয সালাত হোক কিংবা নফল সালাত অথবা জানাযার সালাত হোক। ৪. ইসলামী শরীআত সহজ ও আমলযোগ্য হওয়ার প্রমাণ। এতে এমন কিছু নেই যা করা অসম্ভব বা প্রাণান্তকর। ৫. কল্যাণ আহরণের চেয়ে ক্ষতি নিরোধ আরো বেশি গুরুত্বপূর্ণ। ৬. হাদীসের দাবির ব্যাপকতা থেকে বুঝা যায় যে, সাওম পালনকারীগণের জন্যও তা ফযীলতপূর্ণ জিনিস, যদিও সূর্য পশ্চিম দিগন্তে চলে যাওয়ার পর হয়। যেমন, যোহর কিংবা আসরের সময়। ৭. রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের নির্দেশ থাকলে তার সাধারণ দাবি হচ্ছে বাধ্যতামূলক হওয়া। ৮. সালাতের বিষয়টি অত্যন্ত মর্যাদাপূর্ণ ও সম্মানিত হওয়া। কারণ, সালাতের জন্য বিশেষ করে মিসওয়াক করার গুরুত্ব তুলে ধরা হয়েছে। বস্তুত মানুষ তখন আল্লাহর সাথে কথোপকথন করে। সুতরাং তার মুখ দুর্গন্ধমুক্ত হোক এটা একজন ঈমানদার সর্বদা কামনা করে। ৯. এ হাদীসের কোনো কোনো বর্ণনায় এসেছে, “প্রত্যেক সালাতের ওযূর সময়\" যা ইমাম আহমাদ, নাসায়ী ও মালিক রাহিমাহুমুল্লাহ বর্ণনা করেছেন। এর দ্বারা কেউ কেউ বলেছেন, আলোচ্য হাদীসের প্রয়োগক্ষেত্র হচ্ছে সালাতের ওযূর সময়ে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": "253.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৮, আন্তর্জাতিক নাম্বারঃ ২৫৩ ৪৭৮-(৪৩/২৫৩) আবূ কুরায়ব মুহাম্মাদ ইবনুল 'আলা (রহঃ) ..... মিকদাম এর পিতা শুরায়হ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে জিজ্ঞেস করলাম যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ঘরে ঢুকে সর্বপ্রথম কোন কাজটি করতেন? তিনি বললেন, সর্বপ্রথম মিসওয়াক করতেন। (ইসলামিক ফাউন্ডেশনঃ ৪৮১, ইসলামিক সেন্টারঃ ৪৯৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": "253.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৭৯, আন্তর্জাতিক নাম্বারঃ ২৫৩ ৪৭৯-(৪৪/...) আবূ বাকর ইবনু নাফি আল আবদী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (বাইরে থেকে এসে) বাড়িতে প্রবেশ করে সর্বপ্রথম মিসওয়াক করতেন। (ইসলামিক ফাউন্ডেশনঃ ৪৮২, ইসলামিক সেন্টারঃ ৪৯৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": "254",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮০, আন্তর্জাতিক নাম্বারঃ ২৫৪ ৪৮০-(৪৫/২৫৪) ইয়াহইয়া ইবনু হাবীব আল হারিসী (রহঃ) ..... আবূ মূসা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম তখন মিসওয়াকের এক অংশ তার জিহবার উপর ছিল। (ইসলামিক ফাউন্ডেশনঃ ৪৮৩, ইসলামিক সেন্টারঃ ৪৯৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": "255.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮১, আন্তর্জাতিক নাম্বারঃ ২৫৫ ৪৮১-(৪৬/২৫৫) আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ..... হুযাইফাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তাহাজ্জুদের জন্যে উঠতেন তখন মিসওয়াক দ্বারা ঘষে মুখ পরিষ্কার করতেন। (ইসলামিক ফাউন্ডেশনঃ ৪৮৪, ইসলামিক সেন্টারঃ ৫০০) হাদীসের শিক্ষা ১. ঘুম থেকে জাগ্রত হওয়ার পর মিসওয়াক করার গুরুত্ব। কারণ ঘুমে সাধারণত মুখের গন্ধ পরিবর্তনের অবস্থা তৈরি হয়। সেজন্য ঘুমের পরে মিসওয়াক বেশি গুরুত্বপূর্ণ। বিশেষ করে যদি এর পরে সালাত আদায় করা হয়। ২. ঘুম ছাড়াও যখনই মুখের গন্ধ পরিবর্তন হবে তখনই মিসওয়াক করা উচিত। ৩. ইসলামী শরী'আতে পবিত্রতা ও পরিচ্ছন্নতার যে সবিশেষ গুরুত্ব রয়েছে হাদীস থেকে তা স্পষ্টভাবে প্রমাণিত হচ্ছে। ৪. মিসওয়াক করার বিষয়টি মুখের ভিতরের যাবতীয় অংশের সাথে সম্পৃক্ত; সুতরাং দাঁত পরিষ্কার করার পাশাপাশি মাড়ি ও জিহ্বা পরিষ্কার করার দিকেও নজর দেয়া উচিত। ৫. ঘুম থেকে উঠে মিসওয়াক করা রাসূলের আদর্শ।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": "255.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮২, আন্তর্জাতিক নাম্বারঃ ২৫৫ ৪৮২-(.../...) ইসহাক ইবনু ইবরাহীম ও ইবনু নুমায়র (রহঃ) ..... হুযাইফাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রাতে উঠতেন এরপর অনুরূপ বর্ণনা রয়েছে। এ হাদীসে তাহাজ্জুদের কথা উল্লেখ করা হয়নি। (ইসলামিক ফাউন্ডেশনঃ ৪৮৫, ইসলামিক সেন্টারঃ ৫০১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": "255.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৩, আন্তর্জাতিক নাম্বারঃ ২৫৫ ৪৮৩-(৪৭/...) মুহাম্মাদ ইবনু আল মুসান্না ও ইবনু বাশশার (রহঃ) ..... হুযাইফাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রাতে উঠতেন তখন মিসওয়াক দ্বারা ঘষে মুখ পরিষ্কার করতেন। (ইসলামিক ফাউন্ডেশনঃ ৪৮৬, ইসলামিক সেন্টারঃ ৫০২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": "256",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৪, আন্তর্জাতিক নাম্বারঃ ২৫৬ ৪৮৪-(৪৮/২৫৬) আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। একদা তিনি আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে রাত কাটালেন। (তিনি দেখলেন) আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শেষ রাতে ঘুম থেকে উঠলেন এবং বাইরে গিয়ে আকাশের দিকে তাকালেন এর পরে সূরাহ্ আ-লি ইমরানের এ আয়াতটি তিলাওয়াত করলেন \"আকাশ ও পৃথিবীর সৃষ্টি এবং রাত ও দিনের আবর্তনে জ্ঞানীদের জন্যে বহু নিদর্শন রয়েছে ..... অতএব আপনি অনুগ্রহ করে আমাদেরকে আগুনের শাস্তি থেকে রক্ষা করুন\" পর্যন্ত পড়লেন– (সূরাহ্ আ-লি “ইমরান ৩ঃ ১৯০-১৯১)। অতঃপর ঘরে ফিরে এসে মিসওয়াক ও ওযু করলেন। এরপর দাঁড়িয়ে সালাত আদায় করলেন। সালাত শেষে শুয়ে পড়লেন। পুনরায় কিছুক্ষণ পরে উঠে বাইরে গেলেন এবং আকাশের দিকে তাকিয়ে উক্ত আয়াতটি পাঠ করলেন। অতঃপর ফিরে এসে (আবার) মিসওয়াক করে ওযু করলেন; অতঃপর ফজরের সালাত আদায় করলেন। (ইসলামিক ফাউন্ডেশনঃ ৪৮৭, ইসলামিক সেন্টারঃ ৫০৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": "257.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৫, আন্তর্জাতিক নাম্বারঃ ২৫৭ ৪৮৫-(৪৯/২৫৭) আবূ বাকর ইবনু আবূ শাইবাহ, আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ফিতরাহ্ (স্বভাব) পাঁচটি অথবা বলেছেন, পাঁচটি কাজ হলো ফিতরাহ এর অন্তর্ভুক্ত- খাতনা করা, ক্ষুর দ্বারা নাভীর নিচের লোম পরিষ্কার করা, নখ কাটা, বগলের লোম উপড়িয়ে ফেলা এবং গোফ কাটা। (ইসলামিক ফাউন্ডেশনঃ ৪৮৮, ইসলামিক সেন্টারঃ ৫০৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": "257.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৬, আন্তর্জাতিক নাম্বারঃ ২৫৭ ৪৮৬-(৫০/...) আবূ তাহির ও হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পাঁচটি কাজ ফিতরাহ বা (সুষ্ঠু স্বভাব) খাতন করা, নাভীর নিচের লোম পরিষ্কার করে ফেলা, গোফ ছাটা, নখ কাটা এবং বগলের লোম উপড়িয়ে ফেলা। (ইসলামিক ফাউন্ডেশনঃ ৪৮৯, ইসলামিক সেন্টারঃ ৫০৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": "258",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৭, আন্তর্জাতিক নাম্বারঃ ২৫৮ ৪৮৭-(৫১/২৫৮) ইয়াহইয়া ইবনু ইয়াহইয়া ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। গোফ ছাটা, নখ কাটা, বগলের লোম উপড়িয়ে ফেলা এবং নাভীর নীচের লোম ছেচে ফেলার জন্যে আমাদেরকে সময়সীমা নির্দিষ্ট করে দেয়া হয়েছিল যেন আমরা তা চল্লিশ দিনের অধিক দেরি না করি। (ইসলামিক ফাউন্ডেশনঃ ৪৯০, ইসলামিক সেন্টারঃ ৫০৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": "259.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৮, আন্তর্জাতিক নাম্বারঃ ২৫৯ ৪৮৮-(৫২/২৫৯) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... 'আবদুল্লাহ ইবনু উমার (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা গোফ কেটে ফেল (অর্থাৎ ঠোটের ওপর থেকে কেটে দেয়া) এবং দাড়ি ছেড়ে দাও অর্থাৎ বড় হতে দাও। (ইসলামিক ফাউন্ডেশনঃ ৪৯১, ইসলামিক সেন্টারঃ ৫০৭) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দাবি মোতাবেক এটা প্রতিমান হয় যে, দাড়ির সম্মান ও যত্ন করা এবং তা ছেড়ে দেওয়া ওয়াজেব ও অপরিহার্য। তাই দাড়ি মুণ্ডন করা বা কামানো এবং তুলে ফেলা ও ছাঁটা বৈধ নয়। ২। থুতনির উপরে এবং ঠোঁটের নীচের চুলগুলি দাড়ির মধ্যেই পড়ছে। ৩। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, মোচ কেটে ফেলে দেওয়ার বিষয়টি প্রকৃত ইসলামের শিক্ষা সম্মত একটি কাজ। তাই মুসলিম ব্যক্তির জন্য সম্পূর্ণ মোচ কিংবা তার দুই দিক ছেড়ে দেওয়া জায়েজ নয়। সুতরাং তার জন্য এটাই উচিত যে, সে যেন তার মোচ ছেঁটে ফেলে অথবা মুণ্ডন করে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": "259.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৮৯, আন্তর্জাতিক নাম্বারঃ ২৫৯ ৪৮৯-(৫৩/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম গোঁফ ছোট করতে এবং দাড়ি বড় করে রাখতে আদেশ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৪৯২, ইসলামিক সেন্টারঃ ৫০৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": "259.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯০, আন্তর্জাতিক নাম্বারঃ ২৫৯ ৪৯০-(৫৪/...) সাহল ইবনু উসমান (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা মুশরিকদের বিরুদ্ধাচরণ কর-মোচ কেটে ফেল এবং দাড়ি লম্বা কর। (ইসলামিক ফাউন্ডেশনঃ ৪৯৩, ইসলামিক সেন্টারঃ ৫০৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": "260",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯১, আন্তর্জাতিক নাম্বারঃ ২৬০ ৪৯১-(৫৫/২৬০) আবূ বকর ইবনু ইসহাক (রহঃ) ... আবূ হুরাইরাহ (রবি) হতে বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা মোচ কেটে ফেলে এবং দাড়ি লম্বা করে অগ্নি পূজকদের বিরুদ্ধাচরণ কর। (ইসলামিক ফাউন্ডেশনঃ ৪৯৪, ইসলামিক সেন্টারঃ ৫১০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": "261.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯২, আন্তর্জাতিক নাম্বারঃ ২৬১ ৪৯২-(৫৬/২৬১) কুতাইবাহ ইবনু সাঈদ, আবূ বকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, দশটি কাজ ফিতরাতের অন্তর্ভুক্তঃ মোচ খাটো করা, দাড়ি লম্বা করা, মিসওয়াক করা, নাকে পানি দিয়ে ঝাড়া, নখ কাটা এবং আঙ্গুলের গিরাসমূহ ধোয়া, বগলের পশম উপড়ে ফেলা, নাভীর নীচের পশম মুন্ডন করা এবং পানি দ্বারা ইস্তিঞ্জা করা। যাকারিয়্যা বলেন, হাদীসের রাবী মুসআব বলেন, দশমটির কথা আমি ভুলে গিয়েছি। সম্ভবতঃ সেটি হবে কুলি করা। এ হাদীসের বর্ণনায় কুতাইবাহ আরো একটি বাক্য বাড়ালেন যে, ওয়াকী বলেন, انْتِقَاصُ الْمَاءِ অর্থাৎ ইস্তিঞ্জা করা। (ইসলামিক ফাউন্ডেশনঃ ৪৯৫, ইসলামিক সেন্টারঃ ৫১১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": "261.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৩, আন্তর্জাতিক নাম্বারঃ ২৬১ ৪৯৩-(.../...) আবূ কুরায়ব (রহঃ) একই সনদে মুসআব ইবনু শাইবাহ্ (রহঃ) এর পূর্ব বর্ণিত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। তবে তার বর্ণনায় এ কথাও আছে যে, তার পিতা বলেছেনঃ আমি দশম বস্তুটি ভুলে গেছি। (ইসলামিক ফাউন্ডেশনঃ ৪৯৬, ইসলামিক সেন্টারঃ ৫১২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": "262.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৪, আন্তর্জাতিক নাম্বারঃ ২৬২ ৪৯৪-(৫৭/২৬২) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... সালমান (রাযিঃ) হতে বর্ণিত। একদা তাকে বলা হল, তোমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদেরকে সকল কাজই শিক্ষা দেন; এমনকি প্রস্রাব-পায়খানার নিয়ম-কানুনও! তিনি বললেন, হ্যাঁ, তিনি আমাদেরকে নিষেধ করেছেন পায়খানা ও প্রস্রাবের সময় কিবলামুখী হয়ে বসতে, ডান হাত দিয়ে শৌচকার্য করতে, তিনটি টিলার কম দিয়ে ইস্তিঞ্জা করতে এবং গোবর ও হাড় দিয়ে ইস্তিঞ্জা করতে। (ইসলামিক ফাউন্ডেশনঃ ৪৯৭, ইসলামিক সেন্টারঃ ৫১৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": "262.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৫, আন্তর্জাতিক নাম্বারঃ ২৬২ ৪৯৫-(.../...) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... সালমান (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মুশরিকরা একবার আমাকে বলল, আমরা দেখছি তোমাদের সঙ্গী রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদেরকে সব কাজই শিক্ষা দেয়, এমনকি প্রস্রাব পায়খানার নিয়ম নীতিও তোমাদেরকে শিক্ষা দেয়! (জবাবে) তিনি বললেন, হ্যাঁ, তিনি আমাদেরকে নিষেধ করেছেন ডান হাতে শৌচ কাজ করতে, (ইস্তিঞ্জার সময়) কিবলামুখী হয়ে বসতে এবং তিনি আমাদেরকে আরো নিষেধ করেছেন গোবর অথবা হাড় দিয়ে ইস্তিঞ্জা করতে। তিনি বলেছেন, তোমাদের কেউ যেন তিনটি ঢিলার কম দিয়ে ইস্তিঞ্জা না করে। (ইসলামিক ফাউন্ডেশনঃ ৪৯৮, ইসলামিক সেন্টারঃ ৫১৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": "263",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৬, আন্তর্জাতিক নাম্বারঃ ২৬৩ ৪৯৬-(৫৮/২৬৩) যুহারর ইবনু হারব (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাড় অথবা গোবর ঢিলা হিসেবে ব্যবহার করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৪৯৯, ইসলামিক সেন্টারঃ ৫১৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": "264",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৭, আন্তর্জাতিক নাম্বারঃ ২৬৪ ৪৯৭-(৫৯/২৬৪) যুহায়র ইবনু হারব ও ইবনু নুমায়র (রহঃ) ..... আবূ আইয়ূব (রাযিঃ) হতে বর্ণিত। নবী বলেছেন সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমরা প্রস্রাব বা পায়খানায় গেলে কিবলার দিকে মুখ করে কিংবা কিবলাহ পেছনে রেখে বসো না বরং পূর্ব কিংবা পশ্চিম দিকে মুখ করে বস। আবূ আইয়ুব বলেছেন, এক সময় আমরা শাম দেশে (সিরিয়ায়) গেলে দেখলাম, তাদের পায়খানাগুলো কিবলামুখী করে নির্মিত। কাজেই আমরা ঘুরে বসতাম এবং আল্লাহর কাছে ইসতিগফার করতাম। জবাবে সুফইয়ান বললেন, হ্যাঁ (আমি তার নিকট থেকে এ হাদীসটি শুনেছি)। (ইসলামিক ফাউন্ডেশনঃ ৫০০, ইসলামিক সেন্টারঃ ৫১৬) হাদীসের শিক্ষা ১. পেশাব-পায়খানার সময় কিবলামুখী হয়ে বা কিবলার দিকে পিছন দিয়ে থাকা নিষেধ। অধিকাংশ আলেম এ নিষেধাজ্ঞাকে হারাম হিসেবে ধরেছেন। এ মতের পক্ষে ছিলেন, সাহাবী আবু আইয়াব আল আনসারী রাদ্বিয়াল্লাহু 'আনহু, মুজাহিদ, নাখায়ী, সাওরী, ইবন হাযম, ইবন তাইমিয়্যাহ, ইবনুল কাইয়্যেম প্রমুখ ২. এ নিষেধাজ্ঞা ঘর কিংবা খালিস্থান উভয়কে অন্তর্ভুক্ত করে। ৩. কা'বার সম্মান ও মর্যাদা প্রতিষ্ঠাকরণ। 8. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উত্তম শিক্ষাদান পদ্ধতি। তিনি নিষিদ্ধ জিনিস জানানোর পরে যা করা বৈধ তা জানিয়ে দিলেন। ৫. পেশাব ও পায়খানা অবস্থায় সূর্য কিংবা চন্দ্রের মুখোমুখী হয়ে বসা কিংবা পিছন দিয়ে বসা বৈধ।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": "265",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৮, আন্তর্জাতিক নাম্বারঃ ২৬৫ ৪৯৮-(৬০/২৬৫) আহমাদ ইবনু আল হাসান ইবনু খিরাশ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ প্রস্ৰাব-পায়খানা করতে বসলে কখনো যেন সে কিবলার দিকে মুখ করে সেদিকে পিছন দিয়েও না বসে। (ইসলামিক ফাউন্ডেশনঃ ৫০১, ইসলামিক সেন্টারঃ ৫১৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": "266.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪৯৯, আন্তর্জাতিক নাম্বারঃ ২৬৬ ৪৯৯-(৬১/২৬৬) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... ওয়াসি ইবনু হাব্বান (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি একদা মসজিদে সালাত আদায় রত ছিলাম। আর 'আবদুল্লাহ ইবনু উমর (রাযিঃ) তখন কিবলার দিকে পিছন করে হেলান দিয়ে বসেছিলেন। অতঃপর আমি সালাত শেষ করে তার দিকে ঘুরে বসলাম। তখন আবদুল্লাহ (রাযিঃ) বললেন, কিছু লোকে বলে, “তুমি যখন বসবে তখন কিবলার দিকে মুখ করে বসো না এবং বাইতুল মুকাদ্দাস-এর দিকেও না।\" অথচ একবার আমি একটি ঘরের ছাদের উপর উঠে রাসূলুল্লাহু সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দু'টি ইটের উপর বসা অবস্থায় দেখলাম। তিনি তখন ইস্তিঞ্জার জন্যে বাইতুল মুকাদ্দাস এর দিকে মুখ করে বসেছিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫০২, ইসলামিক সেন্টারঃ ৫১৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": "266.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০০, আন্তর্জাতিক নাম্বারঃ ২৬৬ ৫০০-(৬২/...) আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একদা আমার বোন হাফসার ঘরের ছাদে উঠলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ইস্তিঞ্জায় বসা অবস্থায় দেখতে পেলাম। তিনি শাম (সিরিয়া) এর দিকে মুখ করে এবং কিবলার দিকে পিঠ করে বসেছিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫০৩, ইসলামিক সেন্টারঃ ৫১৯) প্রাসঙ্গিক আলোচনা হাদীসের বক্তব্য থেকে বুঝা যায় যে, বাধা দিবে না এমন হলে, কারো ঘরের ছাদে উঠা জায়েজ। প্রয়োজন বলতে হাদীসে পায়খানা সারার কথা বুঝানো হয়েছে। এর দ্বারা বুঝা যায় যে, যা বলা অসুন্দর তা ভিন্নভাবে তুলে ধরাই শ্রেয়। বাহ্যিক দৃষ্টিতে উক্ত হাদীস দু'টিকে পরস্পর বিরোধী মনে হলেও আসলে তা পরস্পর বিরোধী নয়। এ ব্যাপারে আলেমগণের কয়েকটি মত পাওয়া যায়- (১) আলেমগণের কেউ কেউ উভয় হাদীসের মধ্যে সামঞ্জস্য সাধনে বলেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম ঘরের মধ্যে প্রাকৃতিক কাজ করছিলেন, আর পূর্বোক্ত হাদীসের নির্দেশনা হচ্ছে ঘরের বাইরের স্থানের জন্য। (২) অপর দল বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের জন্য এটা বিশেষ ব্যতিক্রম ছিল। (৩) কেউ বলেছেন, ইবন উমার রাদিয়াল্লাহু আনহুমার উপরোক্ত ঘটনাটি সম্ভবত নিষেধ করার পূর্বে ছিল।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": "267.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০১, আন্তর্জাতিক নাম্বারঃ ২৬৭ ৫০১-(৬৩/২৬৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) থেকে বর্ণিত। তিনি তার পিতা হতে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যেন প্রস্রাব করার সময় তার পুরুষাঙ্গ ডান হাত দিয়ে না ধরে এবং পায়খানার পর ডান হাত দিয়ে যেন ইস্তিঞ্জা (ঢিলা ব্যবহার) না করে এবং (পানি পান করার সময়) পাত্রের মধ্যে নিঃশ্বাস না ফেলে। (ইসলামিক ফাউন্ডেশনঃ ৫০৪, ইসলামিক সেন্টারঃ ৫২০) হাদীসের শিক্ষা ১. পেশাব করার সময় ডান হাতে গোপনাঙ্গ না ধরার নির্দেশনা। এটি মূলত মাকরূহ। ২. বিনা ওযরে ডান হাতে পায়খানা পরিষ্কার করা নিষেধ। ৩. পানিয়ের মধ্যে নিঃশ্বাস ফেলা নিষেধ। অনুরূপভাবে ফুঁ দেয়াও নিষেধ। ৪. যেকোনো ভদ্র ও উত্তম কাজে ডান হাত, পক্ষান্তরে যেকোনো ময়লা কাজের জন্য বাম হাত ব্যবহার বাঞ্ছনীয়। ৫. ডান হাতের ফযীলত বর্ণিত হলো। ৬. ইসলাম যে পরিপূর্ণ ও তাতে খুঁটিনাটি সবকিছুর নির্দেশনা রয়েছে এটি তার প্রমাণ।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": "267.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২, আন্তর্জাতিক নাম্বারঃ ২৬৭ ৫০২-(৬৪/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যখন পায়খানায় (শৌচাগারে) যায় তখন সে যেন ডান হাত দিয়ে তার পুরুষাঙ্গ স্পর্শ না করে। (ইসলামিক ফাউন্ডেশনঃ ৫০৫, ইসলামিক সেন্টারঃ ৫২১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": "267.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩, আন্তর্জাতিক নাম্বারঃ ২৬৭ ৫০৩-(৬৫/...) ইবনু আবূ উমর (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাত্রের মধ্যে নিঃশ্বাস ফেলতে, ডান হাত দিয়ে পুরুষাঙ্গ স্পর্শ করতে এবং ডান হাত দিয়ে ইস্তিঞ্জা করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫০৬, ইসলামিক সেন্টারঃ ৫২২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": "268.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪, আন্তর্জাতিক নাম্বারঃ ২৬৮ ৫০৪-(৬৬/২৬৮) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওযু গোসলের পবিত্রতা অর্জন করতে, চুল আঁচড়ানোর সময় এবং জুতা পরার সময় ডান দিক থেকে শুরু করতে ভালবাসতেন। (ইসলামিক ফাউন্ডেশনঃ ৫০৭, ইসলামিক সেন্টারঃ ৫২৩) প্রাসঙ্গিক আলোচনা ডান দিক যে কোনো ভালো কাজের জন্য ব্যবহার করা সুন্নাতসম্মত। ইমাম সানাআনী বলেন, আল্লাহ ও তাঁর রাসুল কর্তৃক কোনো কিছু পছন্দ করার বিষয়টি বর্ণিত হলে সেটি নিদেনপক্ষে বৈধ হওয়া সাব্যস্ত করে; কারণ তা হয় ওয়াজিব হবে না হয় মুস্তাহাব হবে। ইমাম ইবন তাইমিয়্যাহ রাহিমাহুল্লাহ বলেন, ডান দিক ব্যবহারের এ নিয়ম থেকে বাথরুমে প্রবেশ করা, মসজিদ থেকে বের হওয়া ইত্যাদি কর্মকাণ্ডগুলো ব্যতিক্রম ধরা হবে। * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত ইসলাম ধর্মের একটি স্থায়ী বিধান হলো এই যে, সম্মানিত ও সমাদৃত কাজে অথবা যে বিষয়টির দ্বারা সম্মান ও মর্যাদাদান করা হয়: যেমন জামাকাপড়, পাজামা, মোজা পরিধান করা। এবং মাসজিদে প্রবেশ, মেসওয়াক বা দাঁতন ব্যবহার করা, চোখে কাজল বা সুরমা লাগানো, নখ কাটা, মোচ ছাঁটা, চিরনির দ্বারা মাথার চুল আঁচড়াবার সময়, বগলের চুল উপড়ানো বা তুলে ফেলার সময়, মাথার চুল মুণ্ডন এবং নামাজ শেষে সালাম ফেরানো, পবিত্রতার্জন করার সময়, দেহের অঙ্গগুলি ধৌত করার সময় ডান দিক থেকে শুরু করা উত্তম। অনুরূপভাবে শৌচাগার বা টয়লেট থেকে বের হওয়ার সময়, পানাহার ও মুসাফাহা করার সময় এবং হাজরে আসওয়াদ ‍স্পর্শ করার সময় এবং আরো ইত্যাদি সেই সমস্ত কাজে ডান হাত কিংবা দিক থেকে আরম্ভ করা উত্তম বা মুস্তাহাব যে সমস্ত কাজে সম্মান ও মর্যাদাদান করা হয় । ২। তবে যে সমস্ত কাজে সম্মান ও মর্যাদা দান করা হয় না যেমন, শৌচাগার বা টয়লেটে প্রবেশ করা, মাসজিদ থেকে বের হওয়া, নাক পরিষ্কার করা, মলত্যাগের পর মলদ্বার ইত্যাদি পরিষ্কার করা, জামাকাপড়, পাজামা, মোজা ইত্যাদি খোলার কাজগুলি বাম দিক থেকে সম্পাদন করা উত্তম বা মুস্তাহাব। আর এই বিধানটির উদ্দেশ্য হলো ডান দিকের সম্মান ও মর্যাদা দান করা। ৩। প্রত্যেক মুসলিম ব্যক্তির একটি অপরিহার্য বিষয় হলো এই যে, তারা যেন প্রকৃত ইসলাম ধর্মের কার্য সম্পাদনের ক্ষেত্রে আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর সঠিক পন্থায় অনুসরণ করে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 617,
			"arabicnumber": "268.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫, আন্তর্জাতিক নাম্বারঃ ২৬৮ ৫০৫-(৬৭/...) উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সব কাজেই- জুতা পরায়, চুল আঁচড়ানোতে এবং পবিত্রতা অর্জনে ডান দিক থেকে শুরু করতে ভালবাসতেন। (ইসলামিক ফাউন্ডেশনঃ ৫০৮, ইসলামিক সেন্টারঃ ৫২৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": "269",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬, আন্তর্জাতিক নাম্বারঃ ২৬৯ ৫০৬-(৬৮/২৬৯) ইয়াহইয়া ইবনু আইয়ুব, কুতাইবাহ ও ইবনু হুজুর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা লা'নাতকারীর দুটি কাজ থেকে দূরে থাকো। সাহাবায়ে কিরাম জিজ্ঞেস করলেন, লানাতের সে কাজ দুটি কি, ইয়া রাসূলাল্লাহ! তিনি বললেন, মানুষের (যাতায়াতের) চলাফেরার রাস্তায় অথবা তাদের (বিশ্রাম নেয়ার) ছায়ায় প্রস্রাব পায়খানা করা। (ইসলামিক ফাউন্ডেশনঃ ৫০৯, ইসলামিক সেন্টারঃ ৫২৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": "270",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭, আন্তর্জাতিক নাম্বারঃ ২৭০ ৫০৭-(৬৯/২৭০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বাগানে ঢুকলেন। একটি বদনাসহ একজন বালক তার পিছনে পিছনে গেল। সে ছিল আমাদের সকলের চেয়ে বয়ঃকনিষ্ঠ। সে বদনাটি একটি কুল গাছের কাছে রেখে দিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার প্রয়োজন শেষ করে আমাদের কাছে এলেন। তিনি পানি দিয়ে ইস্তিঞ্জা (শৌচকার্য) করেছিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫১০, ইসলামিক সেন্টারঃ ৫২৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": "271.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮, আন্তর্জাতিক নাম্বারঃ ২৭১ ৫০৮-(৭০/২৭১) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শৌচাগারে ঢুকতেন তখন আমি এবং আমার মতই একটি বালক পানির লোটা ও একখানা ছোট বর্শা বয়ে নিয়ে যেতাম। অতঃপর তিনি পানি দিয়ে ইস্তিঞ্জা করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫১১, ইসলামিক সেন্টারঃ ৫২৭) প্রাসঙ্গিক আলোচনা তখনকার যুগে বর্তমান সময়ের মতো অত্যাধুনিক বাথরুম ছিল না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অত্যন্ত লজ্জাশীল ছিলেন, তিনি বাথরুমে যাওয়ার সময় আড়াল করতেন। তাই তিনি একটি বর্শা নিতেন, যার উপর কাপড় দিয়ে আড়াল করে নিয়ে তিনি তার কাজ সারতেন। হাদীসের শিক্ষা ১. শুধু পানি দিয়ে ইস্তিঞ্জা করা (পবিত্র হওয়া) জায়েয। বরং শুধু পাথরের চেয়ে শুধু পানি দিয়ে ইস্তিঞ্জা করা উত্তম। কারণ, পানি দ্বারা বেশি পবিত্র হওয়া যায়। তবে পাথর ও পানি দু'টি ব্যবহারে নিষেধ নেই। তখন আগে পাথর ব্যবহার করবেন পরে পানি; যাতে করে পরিপূর্ণ পবিত্রতা অর্জিত হয়। ইমাম নাওয়াওয়ী বলেছেন যার ওপর সালাফ ও খালাফের একটি গোষ্ঠী একমত এবং বিখ্যাত ফাতওয়াবিদরা ঐকমত্য পোষণ করেছেন তা হলো, পাথর (ঢিলা) ও পানি উভয়টি ব্যবহার করা উত্তম। ২ মুসলিমের উচিত আগে থেকেই পবিত্রতা অর্জনের ব্যবস্থাপনা রাখা; কারণ হতে পারে তার অব্যবস্থাপনার কারণে প্রয়োজন সেরেই দাঁড়িয়ে যাবে ফলে কাপড়-চোপড় ময়লা করে ফেলবে। ৩. গোপনাঙ্গ ঢাকা ফরয। স্ত্রী ব্যতীত কারো গোপনাঙ্গের দিকে নজর দেয়া জায়েয নয়। ৪. ছোট বাচ্চাদের দ্বারা খেদমত নেয়া জায়েয, যদিও তারা স্বাধীন লোক হয়। ৫. এ হাদীসের মাধ্যমে আনাস রাদ্বিয়াল্লাহু 'আনহুর মর্যাদা ও তার বুদ্ধিমত্তাও সাব্যস্ত হচ্ছে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": "271.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯, আন্তর্জাতিক নাম্বারঃ ২৭১ ৫০৯-(৭১/...) যুহায়র ইবনু হারব ও আবূ কুরায়ব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন নির্জনে দূরবতী ময়দানে ইস্তিঞ্জার জন্যে যেতেন তখন আমি তার কাছে পানি নিয়ে যেতাম। তিনি তা নিয়ে ইস্তিঞ্জা (শৌচকাজ) করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫১২, ইসলামিক সেন্টারঃ ৫২৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": "272.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০, আন্তর্জাতিক নাম্বারঃ ২৭২ ৫১০-(৭২/২৭২) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী, ইসহাক ইবনু ইবরাহীম, আবূ কুরায়ব ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... হাম্মাম (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা জারীর (রাযিঃ) একবার প্রস্রাব করলেন, অতঃপর ওযু করলেন এবং তার উভয় মোজার উপর মাসাহ করলেন। তাকে বলা হল, আপনি কি এ রকম করে থাকেন? তিনি বললেন, হ্যাঁ, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখেছি তিনি প্রস্রাব করেছেন, তারপর ওযু করেছেন এবং তার উভয় মোযার উপর মাসাহ করেছেন। আ'মাশ বলেন, ইবরাহীম বলেছেন যে, এ হাদীসটি (হাদীস বিশারদ) লোকেরা আগ্রহের সাথে গ্রহণ করেছেন। কারণ জারীর (রাযিঃ) সূরাহ আল মায়িদাহ নাযিলের পর ইসলাম গ্রহণ করেন। (ইসলামিক ফাউন্ডেশনঃ ৫১৩, ইসলামিক সেন্টারঃ ৫২৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": "272.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১, আন্তর্জাতিক নাম্বারঃ ২৭২ ৫১১-(.../..) ইসহাক ইবনু ইবরাহীম ও আলী ইবনু খাশরাম (রহঃ), মুহাম্মাদ ইবনু আবূ উমার, মিনজাব ইবনু ইবনু হারিস আত তামীমী (রহঃ) ..... আ'মাশ থেকে এ সনদেই আবূ মু'আবিয়ার হাদীসের অর্থের অবিকল বর্ণিত হয়েছে। তবে ঈসা ও সুফইয়ানের হাদীসে বর্ণিত হয়েছে যে, তিনি বলেন, ‘আবদুল্লাহর সঙ্গী-সাথীদের নিকট অত্র হাদীসটি পছন্দনীয় বলে মনে হত। কারণ জারীর (রহঃ) ইসলাম গ্রহণ করেছিলেন সূরাহ আল মায়িদাহ অবতীর্ণ হবার পর। (ইসলামিক ফাউন্ডেশনঃ ৫১৪, ইসলামিক সেন্টারঃ ৫৩০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": "273.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২, আন্তর্জাতিক নাম্বারঃ ২৭৩ ৫১২-(৭৩/২৭৩) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... হুযাইফাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি (কোন এক সফরে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। তিনি কোন এক জাতির ময়লা-আবর্জনা ফেলার জায়গা এসে পৌছলেন। অতঃপর সেখানে দাঁড়িয়ে প্রস্রাব করলেন, আমি তখন দূরে সরে গেলাম। তিনি বললেন, কাছে এসো। আমি তার নিকটে গেলাম এমনকি একেবারে তার পিছনে গিয়ে দাঁড়ালাম। তিনি ওযু করলেন। অতঃপর তার উভয় মোজার উপর মাসাহ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫১৫, ইসলামিক সেন্টারঃ ৫৩১) প্রাসঙ্গিক আলোচনা রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম 'পেশাব করলেন', হাদীসের এ অংশে কিছুটা সংকোচন করা হয়েছে। কারণ বিস্তারিত বর্ণনায় এসেছে, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম কোনো এক বাগানের পিছনে ময়লা ফেলার জায়গায় গেলেন, সেখানে কারো কারো মতো দাঁড়িয়ে পেশাব করার ইচ্ছা করলেন, আমি দূরে সরে দাঁড়ালাম কিন্তু তিনি আমাকে তাঁর পিছনে দাঁড়াতে বললেন, যাতে তাকে দেখা না যায়, তিনি তার প্রয়োজন পুরা না করা পর্যন্ত আমি সেখানে দাঁড়িয়ে থাকলাম। তারপর...। হুযাইফা ইবনুল ইয়ামান রাদ্বিয়াল্লাহু 'আনহু কর্তৃক হাদীসটি বর্ণনার পিছনে একটি ঘটনা আছে। আর তা হচ্ছে, আবু ওয়ায়েল শাক্বীক ইবন আবদুল্লাহ বলেন, আবু মূসা আল আশআরী রাদ্বিয়াল্লাহু আনহু পেশাব করার ব্যাপারে খুব সাবধান থাকতেন। এমনকি তিনি বোতলে পেশাব করতেন; যাতে করে সেটার কোনো অংশ কারো গায়ে না লাগে। আর তিনি বলতেন, বনী ইসরাঈলদের যদি চামড়ায় পেশাব লাগত তাহলে তারা সেটাকে কাঁচি দিয়ে কেটে ফেলত। তখন হুযাইফা ইবনুল ইয়ামান রাদ্বিয়াল্লাহু 'আনহু বললেন, তোমাদের এ লোক (আবু মূসা উদ্দেশ্য) এতো কঠোরতা না করলেও কিছু হবে না। কারণ আমি একবার রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের সাথে ছিলাম, তিনি পেশাব করার ইচ্ছা করলেন, সেখানে কোনো এক বাগানের পিছনে গেলেন, সেখানে ডাস্টবিনের কাছে দাঁড়িয়ে পেশাব করতে চাইলেন। আমি বেশ দূরে সরে গেলাম; কিন্তু রাসূল (সা.) আমাকে কাছে ডেকে নিলেন, যাতে করে পেশাবের সময় এভাবে সবার দূরে সরে যাওয়া সুন্নাত না হয়ে পড়ে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম তাকে কাছে ডাকার পর একেবারে নিজের গোড়ালীদ্বয়ের খুব কাছে দাঁড়াতে বললেন, যদিও পেশাবের ছিটা আসার সম্ভাবনা ছিল। তারপরও তিনি বাড়াবাড়ি পছন্দ করেননি। সুতরাং আবু মূসা আল আশআরী রাদ্বিয়াল্লাহু 'আনহু কর্তৃক এমন বাড়াবাড়ি করার কোনো সংগত কারণ নেই। যদি তা থাকতো তবে রাসূল তা অনুমোদন করতেন এবং হুযাইফা রাদ্বিয়াল্লাহু আনহুর দূরে সরে যাওয়ারই প্রশংসা করতেন। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এ জাতীয় বাড়াবাড়ি থেকে মুক্ত রাখার জন্যই হুযাইফা রাদ্বিয়াল্লাহু 'আনহুকে কাছে ডেকে নিলেন। [দেখুন, মুসলিম: ২৭৩] হাদীসের শিক্ষা ১. অত্র হাদীসে আলোচ্য বিষয়টি ছিল মদীনায় যা দ্বারা সফর ছাড়াও মোজার উপর মাসাহ করার বৈধতা বর্ণিত হয়েছে। সুতরাং, মুকীম বা অবস্থানরত অবস্থাতেও মোজার উপর মাসাহ করা জায়েয হওয়া। ২. একজন মানুষ কোনো মহান ব্যক্তিকে বলতে পারেন যে, তিনি পেশাব করলেন। ৩. পা ধোয়ার পরিবর্তে মোজার উপর মাসাহ করা বৈধ। ৪. দীনের মধ্যে বাড়াবাড়ি অবৈধ। ৫. কোনো কোনো বর্ণনায় দাঁড়িয়ে পেশাব করার বিষয়টিও এসেছে, তার অর্থ, আমাদের এ দীন অত্যন্ত সহজ। পরিস্থিতি অনুসারে ছাড়াও গ্রহণ করা উত্তম।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": "273.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩, আন্তর্জাতিক নাম্বারঃ ২৭৩ ৫১৩-(৭৪/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ ওয়ায়িল থেকে বর্ণিত। তিনি বলেন, আবূ মূসা (রাযিঃ) প্রস্রাবের ব্যাপারে খুবই কঠোরতা অবলম্বন করতেন। তিনি একটি বোতলে প্রস্রাব করতেন এবং বলতেন, বনী ইসরাঈলদের কারো চামড়ায় (পরিধেয় বস্ত্রে) যদি প্রস্রাব লাগত তখন কাচি দিয়ে সে স্থান কেটে ফেলত। অতঃপর হুযাইফাহ (রাযিঃ) এ কথা শুনে বললেন, আমি চাই যে, তোমাদের সঙ্গী (আবূ মূসা) এ ব্যাপারে এত কঠোরতা না করলেই ভাল হত। (কারণ) একবার আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর সঙ্গে পথে চলছিলাম। তিনি একটি দেয়ালের পিছনে জনৈক জাতির আবর্জনা ফেলার জায়গায় পৌছলেন। অতঃপর তোমরা যেমনভাবে দাঁড়াও, তেমনি দাঁড়িয়ে প্রস্রাব করলেন। আমি তার থেকে দূরে সরে ছিলাম। তিনি আমার দিকে ইশারা করলেন অতঃপর আমি বললাম এবং একেবারে তার পিছনে এসে দাঁড়ালাম। তিনি তার প্রয়োজন শেষ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫১৬, ইসলামিক সেন্টারঃ ৫৩২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": "274.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫১৪-(৭৫/২৭৪) কুতাইবাহ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমহ ইবনু আল মুহাজির (রহঃ) ..... মুগীরাহ ইবনু শু'বাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাজাত (প্রাকৃতিক প্রয়োজন) পূরণের জন্যে বের হলেন তারপর মুগীরাহ (রাযিঃ) একটি পানি ভর্তি বদনা নিয়ে তার অনুসরণ করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাজাত শেষ করলে তিনি তাকে পানি ঢেলে দিলেন। এরপর তিনি ওযু করলেন এবং উভয় মোজার ওপর মাসাহ করলেন। ইবনু রুমহ-এর বর্ণনায় حِينَ যখন শব্দের স্থলে যে পর্যন্ত حَتَّى শব্দের উল্লেখ রয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৫১৭, ইসলামিক সেন্টারঃ ৫৩৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": "274.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫১৬-(৭৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... মুগীরাহ্ ইবনু শুবাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক রাতে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। হঠাৎ তিনি এক স্থানে থেকে হাজাত পূরণ করলেন। এরপর ফিরে এলেন এবং আমার কাছে রাখা একটি বদনা থেকে আমি তার দিকেও পানি ঢেলে দিলাম। তিনি ওযু করলেন এরপর তার উভয় মোজার উপর মাসাহ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫১৯, ইসলামিক সেন্টারঃ ৫৩৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": "274.03",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": "274.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫১৭-(৭৭/...) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... মুগীরাহ ইবনু শুবাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তিনি বললেন, মুগীরাহ বদনা (সঙ্গে) নাও। আমি বদনা (সঙ্গে) নিলাম। তারপর তার সাথে বেরিয়ে পড়লাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাঁটতে হাঁটতে আমার থেকে আড়ালে চলে গেলেন। তারপর তিনি তার হাজাত পূরণ করলেন ও ফিরে এলেন। তখন তার গায়ে ছিল একটি শামী জুব্বা যার আস্তিন ছিল চাপা (অপ্রশস্ত)। তিনি আস্তিন থেকে তার হাত বের করার চেষ্টা করছিলেন কিন্তু (অপ্রশস্ত হবার কারণে) তা আটকে গেল। অতঃপর তিনি জুব্বার নিচ থেকে তার হাত বের করলেন। আমি তার ওপর পানি ঢেলে দিলাম। তিনি সালাতের জন্যে যেমন ওযু করা হয়- তেমনি ওযু করলেন। তারপর তার উভয় মোজার ওপর মাসাহ করে সালাত আদায় করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫২০, ইসলামিক সেন্টারঃ ৫৩৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 630,
			"arabicnumber": "274.05",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": "274.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫১৯-(৭৯/...) মুহাম্মাদ ইবনু 'আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... মুগীরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে এক রাতে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তিনি আমাকে বললেন, “তোমার সাথে কি পানি আছে\"? আমি বললাম, হ্যাঁ। তিনি তার সওয়ারী থেকে নেমে পড়লেন। তারপর হাঁটতে হাঁটতে রাতের অন্ধকারে মিলিয়ে গেলেন। কিছুক্ষণ পর ফিরে এলেন। তখন আমি বদনা থেকে তাকে পানি ঢেলে দিলাম। তিনি তার মুখমণ্ডল ধুলেন তখন তার গায়ে ছিল একটি পশমের জুব্বা। তিনি তা থেকে হাত বের করতে না পেরে জুব্বার নীচ দিয়ে বের করলেন। তারপর তার উভয় বাহু ধুলেন এবং মাথা মাসাহ করলেন। আমি তার উভয় মোজা খুলে দিতে চাইলাম। কিন্তু (বাধা দিয়ে) তিনি বললেন, ওভাবেই থাকতে দাও। কারণ আমি ও দু'টি পবিত্র অবস্থায় পায়ে দিয়েছি। (এই বলে) তিনি তার উভয় মোযার ওপর মাসাহ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫২২, ইসলামিক সেন্টারঃ ৫৩৮) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। আরবী ভাষায় চামড়া অথবা অন্য কোনো বস্তুর তৈরি পায়ের আবরণকে মোজা বা খুফ বলা হয়। ২। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, চামড়া অথবা অন্য কোনো বস্তুর তৈরি পায়ের আবরণ বা মোজার উপরে মাসাহ করা প্রকৃত ইসলামের শিক্ষা সম্মত একটি বিধান। তাই এই ধরণের পায়ের আবরণ বা মোজার উপরে বাসস্থানে বাস করার অবস্থায় এবং মুসাফির অবস্থায় গ্রীষ্মকালে এবং শীতকালে মাসাহ করা বৈধ। চামড়া অথবা অন্য কোনো বস্তুর তৈরি পায়ের আবরণ বা মোজার উপরে মাসাহ করার শর্ত হলো: পরিপূর্ণ পবিত্র অবস্থায় ওজু অথবা গোসল করার পর চামড়া অথবা অন্য কোনো বস্তুর তৈরি পায়ের আবরণ বা মোজার উপর মাসাহ করা। সুতরাং এই পদ্ধতিতে পায়ের আবরণ বা মোজা পরিধান করার পর ওজু চলে গেলে উক্ত মোজার বা অবরণের উপরে মুসলিম ব্যক্তির জন্য মাসাহ করা বৈধ। আর এটাই হলো অধিকাংশ ইমাম ও পণ্ডিতদের অভিমত। মহান আল্লাহ তাঁদের প্রতি দয়া করুন। ৩। চামড়া অথবা অন্য কোনো বস্তুর তৈরি পায়ের আবরণ বা মোজার উপরে মাসাহ করার সময় শুরু হবে ওজু ভেঙ্গে যাওয়ার পর প্রথম মাসাহ করা থেকে। সুতরাং বাসস্থানে বাস করা অবস্থায় প্রথম মাসাহ থেকে একদিন একরাত এবং মুসাফির অবস্থায় তিনদিন তিনরাত মাসাহ করা বৈধ।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": "274.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫২০-(৮০/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... মুগীরাহ (রাযিঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ওযু করালেন। তিনি ওযু করলেন এবং উভয় মোজার উপর মাসাহ করলেন। মুগীরাহ (রাযিঃ) বলেন, তারপর তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, আমি এ দু'টিকে পবিত্রাবস্থায় পরেছি। (ইসলামিক ফাউন্ডেশনঃ ৫২৩, ইসলামিক সেন্টারঃ ৫৩৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": "274.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫২১-(৮১/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু বায়ী (রহঃ) ..... মুগীরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (এক সফরে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিছে রয়ে গেলেন। আমিও তার সাথে পিছনে পড়লাম। তিনি হজ্জত পূরণ করে বললেন, তোমার সাথে কি পানি আছে? আমি একটি পানির পাত্র নিয়ে এলাম। তিনি উভয় হাতের কজি পর্যন্ত এবং মুখমণ্ডল ধুলেন তারপর উভয় বাহু বের করতে চাইলেন; কিন্তু জোব্বার আস্তিনে আটকে গেল। এতে জুব্বার নীচ থেকে তিনি হাত বের করলেন এবং জুব্বাকে কাঁধের উপর রেখে দিলেন। উভয় হাত তিনি ধুলেন, মাথার সম্মুখভাগ এবং পাগড়ি ও উভয় মোজার উপর মাসাহ করলেন। তারপর তিনি সওয়ার হলেন এবং আমিও সওয়ার হলাম। আমরা যখন আমাদের জাতির কাছে পৌছলাম তখন তারা সালাত আদায় করছিল। 'আবদুর রহমান ইবনু আওফ (রাযিঃ) তাদের সালাতে ইমামতি করছিলেন। তিনি তাদেরকে নিয়ে এক রাকাআত পড়ে ফেলেছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আগমন টের পেয়ে তিনি পিছিয়ে আসছিলেন; কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (সেখানে থাকতে) ইশারা করলেন। এতে তিনি (আবদুর রহমান ইবনু আওফ) তাদেরকে নিয়ে সালাত আদায় করলেন। তিনি যখন সালাম ফিরালেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে গেলেন এবং আমিও দাঁড়িয়ে গেলাম। তারপর আমাদের থেকে যে রাকাআত ছুটে গিয়েছিল তা পূর্ণ করলাম। (ইসলামিক ফাউন্ডেশনঃ ৫২৪, ইসলামিক সেন্টারঃ ৫৪০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": "274.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫২২-(৮২/...) উমাইয়্যাহ্ ইবনু বিসতাম ও মুহাম্মাদ ইবনু আবদুল আ'লা (রহঃ) ..... মুগীরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উভয় মোজার উপর এবং মাথার সম্মুখভাগ ও পাগড়ীর উপর মাসাহ করেন। (ইসলামিক ফাউন্ডেশনঃ ৫২৫, ইসলামিক সেন্টারঃ ৫৪১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": "274.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫২৩-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... মুগীরাহ (রাযিঃ) থেকে তার পিতা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৫২৬, ইসলামিক সেন্টারঃ ৫৪২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": "274.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪, আন্তর্জাতিক নাম্বারঃ ২৭৪ ৫২৪-(৮৩/...) মুহাম্মাদ ইবনু বাশশার ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... মুগীরাহ (রাযিঃ) থেকে বর্ণিত। রাবী বাকর ইবনু আবদুল্লাহ বলেন, আমি মুগীরাহ (রাযিঃ) এর পুত্র থেকে শুনেছি সে তার পিতা থেকে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা ওযু করলেন। মাথার সম্মুখভাগ এবং পাগড়ী ও উভয় মোজার উপর মাসাহ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫২৭, ইসলামিক সেন্টারঃ ৫৪৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": "276.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬, আন্তর্জাতিক নাম্বারঃ ২৭৬ ৫২৬-(৮৫/২৭৬) ইসহাক ইবনু ইবরাহীম আল হানজালী (রহঃ) ..... শুরায়হ ইবনু হানী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) এর কাছে আসলাম, মোজার উপর মাসাহ করার মাসআলাহ জিজ্ঞেস করতে। তিনি বললেন, আবূ তালিবের পুত্র (‘আলী (রাযিঃ) এর কাছে গিয়ে এ মাসআলাহ জিজ্ঞেস কর। কারণ সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফর করত। অতঃপর আমরা তাকে গিয়ে জিজ্ঞেস করলাম। তিনি বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরকারীর জন্যে তিন দিন তিন রাত নির্দিষ্ট করে দিয়েছেন এবং বাড়ীতে অবস্থানকারীদের জন্যে একদিন এক রাত। এ হাদীস সুফইয়ান সাওরী (রহঃ) যখন তার উস্তায আমর এর উল্লেখ করতেন তখন তার প্রশংসা করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৩০, ইসলামিক সেন্টারঃ ৫৪৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": "276.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭, আন্তর্জাতিক নাম্বারঃ ২৭৬ ৫২৭-(.../...) ইসহাক (রহঃ) ..... হাকাম (রহঃ) হতে একই সূত্রে অবিকল হাদীস বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৫৩১, ইসলামিক সেন্টারঃ ৫৪৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": "276.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৮, আন্তর্জাতিক নাম্বারঃ ২৭৬ ৫২৮-(.../...) যুহারর ইবনু হারব (রহঃ) ..... শুরায়হ ইবনু হানী (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে মোজার উপর মাসাহ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, আলীর কাছে যাও। কারণ এ ব্যাপারে সে আমার চেয়ে বেশি জানে। আমি আলী (রাযিঃ) এর কাছে এলাম। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ উল্লেখ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৩২, ইসলামিক সেন্টারঃ ৫৪৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": "277",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৯, আন্তর্জাতিক নাম্বারঃ ২৭৭ ৫২৯-(৮৬/২৭৭) মুহাম্মাদ বিন আবদুল্লাহ (রহঃ) সুলাইমান ইবনু বুরাইদাহ তার পিতা বুরাইদাহ থেকে বর্ণনা করেছেন যে, মক্কা বিজয়ের দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই ওযুর দ্বারা কয়েক ওয়াক্ত সালাত পড়েছেন এবং মোজার উপর মাসাহ করেছেন। তা দেখে উমার বললেন, আপনি আজ এমন কিছু করলেন যা কখনো করেননি। জবাবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে উমার! আমি ইচ্ছা করেই এরূপ করেছি। (ইসলামিক ফাউন্ডেশনঃ ৫৩৩, ইসলামিক সেন্টারঃ ৫৪৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": "278.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩০, আন্তর্জাতিক নাম্বারঃ ২৭৮ ৫৩০-(৮৭/২৭৮) নাসর ইবনু আলী আল জাহযামী ও হামিদ ইবনু উমার আল বাকরাবী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, তোমাদের কেউ যখন ঘুম থেকে উঠবে তখন সে যেন তিনবার হাত না ধোয়া পর্যন্ত পাত্রে না ঢুকায়। কারণ সে জানে না যে, তার হাত রাতে কোথায় ছিল। (ইসলামিক ফাউন্ডেশনঃ ৫৩৪, ইসলামিক সেন্টারঃ ৫৫০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": "278.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩১, আন্তর্জাতিক নাম্বারঃ ২৭৮ ৫৩১-(.../...) আবূ কুরায়ব ও আবূ সাঈদ আল আশাজ্জ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে অবিকল হাদীস বর্ণিত আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আর ওয়াকী কর্তৃক হাদীসটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্যন্ত বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৫৩৫, ইসলামিক সেন্টারঃ ৫৫১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": "278.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩২, আন্তর্জাতিক নাম্বারঃ ২৭৮ ৫৩২-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ, ‘আমর আন নাকিদ, যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে অবিকল বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৫৩৬, ইসলামিক সেন্টারঃ ৫৫২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": "278.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৩, আন্তর্জাতিক নাম্বারঃ ২৭৮ ৫৩৩-(৮৮/...) সালামাহ ইবনু শাবীব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন তোমাদের কেউ জাগ্রত হবে তখন সে তার হাত পাত্রে ঢুকাবার পূর্বে যেন তা তিনবার ধুয়ে নেয়। কারণ সে জানে না যে, তার হাত রাতে কোথায় ছিল। (ইসলামিক ফাউন্ডেশনঃ ৫৩৭, ইসলামিক সেন্টারঃ ৫৫৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": "278.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৪, আন্তর্জাতিক নাম্বারঃ ২৭৮ ৫৩৪-(.../...) কুতাইবাহ ইবনু সাঈদ, নাসর ইবনু আলী, আবূ কুরায়ব, মুহাম্মাদ ইবনু রাফি, মুহাম্মাদ ইবনু হাতিম ও আল হুলওয়ানী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। আবদুর রহমান ইবনু যায়দ এর আযাদকৃত গোলাম সাবিত থেকে বর্ণিত। প্রত্যেকের বর্ণনাতেই حَتَّى يَغْسِلَهَا \"হাত না ধোয়া পর্যন্ত\" রয়েছে। এসব বর্ণনাতে কেউ-ই তিনবারের কথা উল্লেখ করেননি। তবে আমরা ইতোপূর্বে জাবির ইবনু মুসাইয়্যিব (রহঃ), আবূ সালামাহ্ (রহঃ), আবদুল্লাহ ইবনু শাকীক (রহঃ), আবূ সালিহ্ (রহঃ) ও আবূ রাযীন (রহঃ) কর্তৃক বর্ণিত যে হাদীস উল্লেখ করেছি, তাতে তারা সবাই তিনবারের কথা উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৩৮, ইসলামিক সেন্টারঃ ৫৫৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": "279.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৫, আন্তর্জাতিক নাম্বারঃ ২৭৯ ৫৩৫-(৮৯/২৭৯) ‘আলী ইবনু হুজুর আস সা’দী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কারো পাত্রে যখন কুকুরে মুখ দিবে তখন সে যেন পাত্রের বস্তু ফেলে দেয়। তারপর পাত্রটি সাতবার ধুয়ে ফেলে। (ইসলামিক ফাউন্ডেশনঃ ৫৩৯, ইসলামিক সেন্টারঃ ৫৫৫) প্রাসঙ্গিক আলোচনা কুকুরের লালা থেকে পাত্র পবিত্র করার হুকুম কোনো কোনো বর্ণনায় এসেছে, প্রথমবারে মাটি দিয়ে ধৌত করতে হবে, কোনো বর্ণনায় এসেছে অষ্টম বার। আবার কোনো কোনো বর্ণনায় যে কোন একবার মাটি দিয়ে ধৌত করতে বলা হয়েছে। সুতরাং, একবার মাটি দিয়ে ঘষে নিলেই বিধান পালন হয়ে যাবে। হাদীসের শিক্ষা ১. কুকুর কোনো পাত্রে মুখ দিলে, তা থেকে পান করলে বা তা থেকে কোনো কিছু ভক্ষণ করলে উক্ত পাত্রকে অপবিত্র করে দেয়। ২. কুকুর যে পাত্রে মুখ দিবে সেটি ৭ বার ধুতে হবে। ৩. কুকুর কোথাও মুখ দেয়া, পান করা, খাবার খাওয়া সবই একই পর্যায়ের। সুতরাং সে পাত্রের অবশিষ্ট জিনিস অপবিত্র হয়ে যাবে। ৪. মাটির মতো অন্যান্য বর্তমান বিভিন্ন বস্তু যেমন- সাবান, ভীম, রীন, গুড়া সাবান ইত্যাদি ব্যবহার করলেও পবিত্র করবে বলে ইমাম আহমাদ ও শাফেয়ী রাহিমাহুমাল্লাহ মত প্রকাশ করেছেন। অন্যান্য আলেমগণ তা অনুমোদন করেননি। ৫. সাত বার ধোয়া ও অষ্টম বারে মাটি দিয়ে ঘষে নেয়ার রহস্য জানা না থাকলেও সেটাই মেনে নিতে হবে। এটাই ঈমানী দায়িত্ব। আল্লাহ ও তাঁর রাসূল সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম যা বলেন কিছু ঈমানদার তা বিনা বাক্য মেনে নেয়। রহস্য জানা না গেলেও তাতে তাদের কিছু যায় আসে না। ৬. হাদীসে সকল ধরনের কুকুরকেই এ বিধানের অন্তর্ভুক্ত করা হয়েছে। কেউ কেউ শিকারী কুকুর কিংবা পাহারাদার কুকুরকে আলাদা করতে চেয়েছেন, কিন্তু দলীল তাদের পক্ষে যায় না।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": "279.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৬, আন্তর্জাতিক নাম্বারঃ ২৭৯ ৫৩৬-(.../...) মুহাম্মাদ ইবনুল সাব্বাহ (রহঃ) ..... আ'মাশ (রহঃ) হতে এ সূত্রে অবিকল বর্ণিত আছে; তবে পাত্রের বস্তু ফেলার কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৫৪০, ইসলামিক সেন্টারঃ ৫৫৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": "279.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৭, আন্তর্জাতিক নাম্বারঃ ২৭৯ ৫৩৭-(৯০/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কারো পাত্র থেকে যখন কুকুরে পান করবে তখন সে যেন তা সাতবার ধুয়ে ফেলে। (ইসলামিক ফাউন্ডেশনঃ ৫৪১, ইসলামিক সেন্টারঃ ৫৫৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": "279.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৮, আন্তর্জাতিক নাম্বারঃ ২৭৯ ৫৩৮-(৯১/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কারো পাত্রে যখন কুকুরে মুখ লাগিয়ে পান করবে তখন (সে পাত্র পবিত্র করার পদ্ধতি হল) সাতবার তা ধুয়ে ফেলা। তবে প্রথমবার মাটি দিয়ে ঘষে পরিষ্কার করতে হবে। (ইসলামিক ফাউন্ডেশনঃ ৫৪২, ইসলামিক সেন্টারঃ ৫৫৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": "279.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৩৯, আন্তর্জাতিক নাম্বারঃ ২৭৯ ৫৩৯-(৯২/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কারো পাত্রে যখন কুকুরে মুখ লাগিয়ে পান করবে, তখন (সে পাত্র পবিত্র করার নিয়ম হল), সাতবার ধুয়ে ফেলা। (ইসলামিক ফাউন্ডেশনঃ ৫৪৩, ইসলামিক সেন্টারঃ ৫৫৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": "280.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪০, আন্তর্জাতিক নাম্বারঃ ২৮০ ৫৪০-(৯৩/২৮০) উবাইদুল্লাহ ইবনু মু'আয (রহ) ..... ইবনুল মুগাফফাল (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুর হত্যার নির্দেশ দিয়েছিলেন। পরে বললেন, তাদের কি হয়েছে যে, তারা কুকুরের পিছনে পড়লো? তারপর শিকারী কুকুর এবং বকরীর (পাহারা দেয়ার) কুকুর পোষার অনুমতি দেন এবং বলেন যে, যখন তোমাদের কারো পাত্রে কুকুর মুখ লাগিয়ে পান করবে তখন সাতবার ধুয়ে ফেলবে এবং অষ্টমবার মাটি দিয়ে মেজে ফেলবে। (ইসলামিক ফাউন্ডেশনঃ ৫৪৪, ইসলামিক সেন্টারঃ ৫৬০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": "280.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪১, আন্তর্জাতিক নাম্বারঃ ২৮০ ৫৪১-(.../...) ইয়াহইয়া ইবনু হাবীব আল হারিসী, মুহাম্মাদ ইবনু হাতিম, মুহাম্মাদ ইবনুল ওয়ালীদ (রহঃ) …. শুবাহ (রহঃ) হতে উক্ত সনদে অবিকল বর্ণিত আছে। তবে ইয়াহইয়া ইবনু সাঈদ এর বর্ণনায় একটু অতিরিক্ত আছে। তা হল, \"তিনি বকরী পাহারা দেয়ার, শিকার করার এবং চাষাবাদ করার কুকুর রাখার অনুমতি দিয়েছেন।\" ইয়াহইয়া ছাড়া আর কারো বর্ণনায় চাষাবাদের কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৫৪৫, ইসলামিক সেন্টারঃ ৫৬১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": "281",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪২, আন্তর্জাতিক নাম্বারঃ ২৮১ ৫৪২-(৯৪/২৮১) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রুমহ (রহঃ) ও কুতাইবাহ (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জমা পানিতে প্রস্রাব করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৪৬, ইসলামিক সেন্টারঃ ৫৬২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": "282.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৩, আন্তর্জাতিক নাম্বারঃ ২৮২ ৫৪৩-(৯৫/২৮২) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যেন জমা পানিতে প্রস্রাব করে তা দিয়ে যেন গোসল না করে। (ইসলামিক ফাউন্ডেশনঃ ৫৪৭, ইসলামিক সেন্টারঃ ৫৬৩) প্রাসঙ্গিক আলোচনা পানি ও তার প্রকারভেদ যা প্রবাহমান নয় এমন পানি হলো, টাঙ্কির পানি, ছোট জলাধারের পানি ইত্যাদি। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এগুলোতে ময়লা ফেলতে নিষেধ করেছেন যাতে করে তা দূষিত হয়ে না পড়ে। কারণ, এর মাধ্যমে ভাইরাস ছড়িয়ে পড়তে পারে। মারাত্মক রোগ ব্যাধির প্রাদুর্ভাব ঘটতে পারে। মানুষের মধ্যে এ জাতীয় পানি ব্যবহারে ঘৃণার জন্ম হতে পারে। পানি বিশুদ্ধ ও পরিচ্ছন্ন রাখা, নষ্ট ও দূষিত না করা ঈমানের দাবি। পানি তিন প্রকার ১. পবিত্র পানিঃ আর তা হলো পানি তার সৃষ্টিগত স্বাভাবিক অবস্থায় বিদ্যমান থাকা। আর তা হলো- যে পানি দ্বারা অপবিত্রতা ও শরীরের পবিত্র অঙ্গের আপতিত নাজাসাত দূর করা হয়েছে। আল্লাহ তাআলা বলেছেন, “এবং আকাশ থেকে তোমাদের উপর বৃষ্টি বর্ষণ করেন, আর যাতে এর মাধ্যমে তিনি তোমাদেরকে পবিত্র করেন।” [সূরা আল ১১] ২. পবিত্র পানিঃ যে পানি নাজাসাত ছাড়াই রঙ বা স্বাদ বা গন্ধ পরিবর্তন হয়ে গেছে। এ ধরনের পানি নিজে পবিত্র; তবে এর যে কোনো একটি গুণ পরিবর্তন হওয়ার কারণে এর দ্বারা অপবিত্রতা দূর করা যাবে না। ৩. অপবিত্র পানি: যে পানি অল্প বা বেশি নাজাসাতের কারণে এর ৩টি গুণের যেকোনো একটি গুণ পরিবর্তন হয়ে গেছে। অপবিত্র পানি পবিত্র হয়ে যাবে, তার পরিবর্তনের কারণ নিজে নিজে দূর হলে বা উক্ত পানি শুকিয়ে ফেললে অথবা এর সাথে এতটুকু পরিমাণ পানি মিশানো; যাতে পরিবর্তনের কারণ দূরীভূত হয়ে যায়। যখন কোনো মুসলিম পানির অপবিত্রতা বা পবিত্রতার ব্যাপারে সন্দেহ পোষণ করবে তখন সে তার নিশ্চিত ধারণার ওপর ভিত্তি করে পবিত্রতা অর্জন করবে। আর তা হলো, পবিত্র বস্তুসমূহের আসল হচ্ছে পবিত্র থাকা। যখন কোনো পানি, যা দ্বারা পবিত্রতা অর্জন করা যায় আর যা দ্বারা পবিত্রতা অর্জন করা যায় না এমন কোন পানির সাথে সন্দেহে নিপতিত করবে তখন তা বাদ দিয়ে তায়াম্মুম করবে। যখন কোনো পবিত্র কাপড়, অপবিত্র বা হারাম কাপড়ের সাথে একাকার হওয়ার কারণে সন্দেহে নিপতিত করবে, তখন ইয়াকীনের ওপর ভিত্তি করবে এবং সে কাপড় দ্বারা কেবল একটি সালাত আদায় করবে। হাদিস থেকে শিক্ষা ১. বদ্ধ পানিতে পেশাব করা হারাম, পায়খানা করা আরো বড় হারাম। ২. এ নিষেধাজ্ঞা দ্বারা কি হারাম বুঝানো হয়েছে নাকি মাকরূহে তাহরীমী বুঝানো হয়েছে এ ব্যাপারে দু'টি মত রয়েছে: মালেকীরা বলেন, তা মাকরূহ, আর হাম্বলী ও যাহেরীরা বলেন, তা হারাম বুঝাবে। কোনো কোনো আলেম বলেন, অল্প পানির জন্য তা হারাম, আর বেশি পানির জন্য তা মাকরূহ। তবে হারাম হওয়াই অধিক যুক্তিযুক্ত। ৩. যদি পানিতে পেশাব করা হয় তবে তা কি নাপাক হয়ে যাবে? এ ব্যাপারে সবাই একমত যে, যদি পেশাব দ্বারা সে পানি পরিবর্তিত হয়ে যায় তবে তা অপবিত্র হয়ে যাবে। পানি কম হোক কিংবা বেশি। আর যদি পানি এত বেশি হয় যে, তাতে পেশাব তেমন পরিবর্তন করতে পারেনি, তবে সকলের ঐকমত্যে তা পবিত্র। কিন্তু যদি অল্প পানি থাকে আর তা পেশাব বা পায়খানা দ্বারা পরিবর্তন না করে থাকে, তবে এ ব্যাপারে দু'টি মত রয়েছে- ইমাম মালিক, বুখারী ও দাউদ এর মতে তা পবিত্র থেকে যাবে। অন্য দিকে ইমাম আবু হানীফা, শাফোয়ী, আহমাদের মতে তা অপবিত্র হয়ে যাবে। যদিও ইমাম মালিকের মতটি অনেক সত্যনিষ্ঠ আলেম, যেমন শাইখুল ইসলাম ইবন তাইমিয়্যাহ প্রমুখের মতে বেশি শক্তিশালী। ৪. এ হাদীস থেকে আরো বুঝা যায় যে, অপবিত্র অবস্থা থেকে মুক্ত হওয়ার জন্য বদ্ধ পানি অর্থাৎ টাঙ্কি বা পানির ছোট হাউজে ডুব দিয়ে গোসল করা একেবারেই নিষেধ; যদিও তাতে পেশাব না করা হয়। নিয়ম হচ্ছে সেখান থেকে হাত বা কোনো কিছু দিয়ে পানি নিয়ে পবিত্র হওয়া। ৫. সর্বাবস্থায় কষ্টদায়ক যাবতীয় কাজ ও সীমালঙ্ঘনকারী কোনো কিছু করা নিষেধ হওয়া।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": "282.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৪, আন্তর্জাতিক নাম্বারঃ ২৮২ ৫৪৪-(৯৬/...) মুহাম্মদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি এমনটি করো না যে, চলন্ত নয় এমন জমা পানিতে প্রস্রাব করবে তারপর আবার তা থেকে গোসল করবে। (ইসলামিক ফাউন্ডেশনঃ ৫৪৮, ইসলামিক সেন্টারঃ ৫৬৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": "283",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৫, আন্তর্জাতিক নাম্বারঃ ২৮৩ ৫৪৫-(৯৭/২৮৩) হারূন বিন সাঈদ আল আইলী, আবূ তাহির ও আহমাদ ইবনু ঈসা (রহঃ) ..... আব হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ নাপাক অবস্থায় যেন জমা পানিতে গোসল না করে। তখন আবূ সায়িব জিজ্ঞেস করলেন, হে আবূ হুরাইরাহ! তাহলে সে কিভাবে গোসল করবে? জবাবে আবূ হুরাইরাহ (রাযিঃ) বলেন, পানি উঠিয়ে নিয়ে গোসল করবে। (ইসলামিক ফাউন্ডেশনঃ ৫৪৯, ইসলামিক সেন্টারঃ ৫৬৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": "284.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৬, আন্তর্জাতিক নাম্বারঃ ২৮৪ ৫৪৬-(৯৮/২৮৪) কুতাইবাহ বিন সাঈদ (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। (তিনি বলেছেন) এক বেদুঈন এসে মসজিদের মধ্যে প্রস্রাব করতে শুরু করল। উপস্থিত লোকদের মধ্যে কেউ কেউ তাকে বাধা দিতে দাঁড়ালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ থামো, তাকে প্রস্রাব করতে বাধা দিও না। আনাস বলেন, লোকটির প্রস্রাব করা শেষ হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বালতি পানি আনিয়ে তার প্রস্রাবের উপর ঢেলে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৫০, ইসলামিক সেন্টারঃ ৫৬৬) প্রাসঙ্গিক আলোচনা পেশাবকারীকে বাধা দিতে নিষেধ করার কয়েকটি কারণ থাকতে পারে- (১) মূর্খের প্রতি কোমলতা প্রদর্শন করার জন্য। (২) তার করুন অবস্থার প্রতি লক্ষ্য করে, সম্ভবত পেশাব তাকে কাবু করে ফেলেছে। (৩) উম্মতকে শিক্ষা দেয়ার জন্য যে কীভাবে একজন মূর্খ মানুষকে সঠিকভাবে দিক-নির্দেশনা দেয়া যায়। (৪) পেশাব বন্ধ করলে তার স্বাস্থ্যগত ক্ষতি হতে পারে। (৫) পেশাব নিয়ে দাঁড়িয়ে গেলে হতে পারে তা আরও বেশি জায়গা ময়লা করবে। মুসলিমের অপর বর্ণনায় এসেছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বেদুইনকে ডেকে বললেন, “এ মসজিদসমূহ পেশাবের উপযোগী নয়, অন্যান্য অপরিচ্ছন্ন কাজের জন্যও নয়, তা তো কেবল আল্লাহর যিকির, সালাত ও কুরআন তিলাওয়াতের জন্য।” [সহীহ মুসলিম: ২৮৫] অনুরূপভাবে আবু হুরায়রা রাদ্বিয়াল্লাহু আনহুর হাদীসে এসেছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবায়ে কেরামকে উক্ত বেদুইনকে ছাড় দিতে বললেন, আরো বললেন, “তোমরা তো কেবল সহজকারীরূপে প্রেরিত হয়েছ, সংকীর্ণকারীরূপে প্রেরিত হওনি।\" হাদীসের শিক্ষা ১. পেশাব নাপাক হওয়া। ২. মসজিদের পবিত্রতার ব্যাপারে যত্নবান হওয়া। ৩. যখনি মসজিদ অপবিত্র হয়ে যাবে তখনই তা পবিত্র করার জন্য লেগে যেতে হবে। ৪. কোনো ভূমি পবিত্র করার জন্য অপবিত্র জায়গায় একবার পানি প্রবাহিত করে দিলেই হবে, সে স্থান থেকে মাটি সরানোর প্রয়োজন নেই। তবে যদি দৃশ্যমান ময়লা থাকে তবে আগে তা দূর করতে হবে তারপর পানি ঢালতে হবে। ৫. নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের উত্তম চারিত্রিক উৎকর্ষতা। যে কারণে বেদুইন বলতে আরম্ভ করলো, 'হে আল্লাহ আমাকে ও মুহাম্মাদকে রহমত করুন, আমাদের সাথে আর কাউকে রহমত করবেন না।” যেমনটি সহীহ বুখারীর বর্ণনায় এসেছে। ৬. মূর্খদের শিক্ষা প্রদানের ক্ষেত্রে কোমলতা প্রদর্শন করতে হবে। ৭. অন্যায় দূর করার জন্য হিকমত অবলম্বন অপরিহার্য। ৮. নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের দূরদৃষ্টি ও মানুষের প্রকৃতি সম্পর্কে অবহিত হওয়া।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": "284.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৭, আন্তর্জাতিক নাম্বারঃ ২৮৪ ৫৪৭-(৯৯/...) মুহাম্মাদ বিন আল মুসান্না, ইয়াহইয়া ইবনু ইয়াহইয়া ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা জনৈক বেদুঈন এসে মসজিদের এক কোনে দাঁড়িয়ে প্রস্রাব করতে থাকলে লোকজন চিৎকার করে তাকে বিরত রাখার চেষ্টা করল। তা দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, থাম, তাকে বাধা দিও না। তার প্রস্রাব করা শেষ হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বালতি পানি আনতে আদেশ দিলেন এবং প্রস্রাবের উপর ঢেলে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৫১, ইসলামিক সেন্টারঃ ৫৬৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": "285",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮, আন্তর্জাতিক নাম্বারঃ ২৮৫ ৫৪৮-(১০০/২৮৫) যুহারর বিন হারব (রহঃ) ..... ইসহাকের চাচা আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদিন আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মসজিদে নববীতে বসে ছিলাম। এ সময় হঠাৎ এক বেদুঈন এসে মসজিদের মধ্যে দাঁড়িয়ে প্রস্রাব করতে লাগল, তা দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবাগণ থামো থামো’ বলে তাকে প্রস্রাব করতে বাধা দিলেন। আনাস বলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা তাকে বাধা দিও না, বরং তাকে ছেড়ে দাও লোকেরা তাকে ছেড়ে দিল, সে প্রস্রাব সেরে নিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তাকে কাছে ডেকে বললেনঃ এটা হলো মাসজিদ। এখানে প্রস্রাব করা কিংবা ময়লা আবর্জনা ফেলা যায় না। বরং এ হল আল্লাহর যিকর করা, সালাত আদায় করা এবং কুরআন পাঠ করার স্থান। অথবা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কথাটা যেভাবে বলেছেন তাই আনাস বলেন, এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সবার মধ্য থেকে এক ব্যক্তিকে এক বালতি পানি আনে আদেশ করলেন। সে এক বালতি পানি আনলে তিনি তা প্রস্রাবের উপর ঢেলে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৫২, ইসলামিক সেন্টারঃ ৫৬৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": "286.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯, আন্তর্জাতিক নাম্বারঃ ২৮৬ ৫৪৯-(১০১/২৮৬) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে শিশুদেরকে আনা হতো। তিনি তাদের জন্যে বারাকাত ও কল্যাণের দু'আ করতেন এবং 'তাহনীক (কিছু চিবিয়ে মুখে ঢুকিয়ে দিতেন) করতেন। একদিন একটি শিশুকে আনা হল, (তিনি তাকে কোলে তুলে নিলেন) শিশুটি তার কোলে প্রস্রাব করে দিল, পরে তিনি পানি চেয়ে নিলেন এবং প্রস্রাবের উপর পানির ছিটা দিলেন, আর তা ধুলেন না। (ইসলামিক ফাউন্ডেশনঃ ৫৫৩, ইসলামিক সেন্টারঃ ৫৬৯) প্রাসঙ্গিক আলোচনা ছেলে শিশুর পেশাবের হুকুম অত্র হাদীসে বর্ণিত ছেলে শিশুর পেশাবের হুকুম যতক্ষণ শুধু মায়ের দুধ খায় অন্য কিছু দ্বারা জীবন নির্বাহ করে না তখন পর্যন্ত কার্যকর হবে। যদি মায়ের দুধের সাথে অন্য খাবারও গ্রহণ করে তখন আর এ হুকুমের আওতায় আসবে না। মুসলিমের অপর বর্ণনায় এসেছে, 'সে তখনো খাবার খাওয়ার মতো প্রাপ্ত বয়স্ক হয় হাদীসে উল্লিখিত ‘নম্বহ'- এর অর্থ এখানে অধিকাংশ ফকীহ পানি ছিটিয়ে দেয়া বলেছেন। অবশ্য ইমাম আবু হানীফা রাহিমাহুল্লাহ এখানেও ধোয়ার অর্থই নিয়েছেন। তবে বিশুদ্ধ হচ্ছে পানি ছিটিয়ে দেয়া অর্থই; কারণ হাদীসের অন্যান্য শব্দে স্পষ্টভাবে এসেছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা ধুয়ে ফেলেননি।' তাহনীকের হুকুম ছোট বাচ্চাদেরকে রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের দরবারে আনা হতো সাধারণত 'তাহনীক করার জন্য। তাহনীক হচ্ছে বাচ্চাদের মুখে খেজুর ইত্যাদি চিবিয়ে দেয়া। অনেক আলেমের মতে যা কেবল রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের জন্য খাস। কারণ, অন্য কারো মুখ ভাইরাসমুক্ত হওয়ার প্রমাণ লাগবে। পরবর্তীতে সাহাবী ও তাবেয়ীদের মধ্যে তাহনীকের বহুল প্রচলন ছিল না। যা প্রমাণ করে যে, এটা কেবল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের জন্য নির্দিষ্ট। তবে কোনো কোনো আলেম বিভিন্ন নস ও কোনো কোনো তাবেয়ী ও আলেমগণের দ্বারা তাহনীক হওয়ার কারণে তাহনীককে ব্যাপকভাবে অনুমোদন করেন। যদিও বিষয়টি আমার কাছে পছন্দনীয় নয়। এর পরিবর্তে খেজুর পানি দিয়ে নরম করে মুখে দেওয়া যায়। হাদীসের শিক্ষা ১. ছোট ছেলে শিশুর পেশাবও নাপাক। ২. তবে তা থেকে পাক হওয়ার ব্যাপারে সামান্যতম ছাড় দেখা যাচ্ছে, সেটা হচ্ছে পানি প্রবাহিত করে ধৌত করতে হবে না। পেশাবের জায়গায় বেশ পরিমাণে পানি ছিটিয়ে দিলেই তা পবিত্র হয়ে যাবে। ৩. রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের অত্যন্ত সুন্দর চরিত্রের বহিঃপ্রকাশ। ৪. বাচ্চার পায়খানা অন্যান্য নাপাকীর মতোই ধৌত করতে হবে। ৫. ময়লার স্থান যত দ্রুত সম্ভব ধুয়ে ফেলা উত্তম; যাতে করে ভূলে না যাওয়া হয়। ৬. সাহাবায়ে কেরাম কর্তৃক রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কাছে বাচ্চাদেরকে দো'আ ও তাহনীকের জন্য নিয়ে আসা; যাতে করে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের মুখের পবিত্র লালার বরকত তাদের বাচ্চাদের পেটে প্রবেশ করে।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": "286.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০, আন্তর্জাতিক নাম্বারঃ ২৮৬ ৫৫০-(১০২/...) যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একবার একটি শিশুকে আনা হল। শিশুটি তার কোলে প্রস্রাব করে দিল। তারপর তিনি পানি আনিয়ে প্রস্রাবের উপর (ছিটা) ঢেলে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৫৪, ইসলামিক সেন্টারঃ ৫৭০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": "286.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১, আন্তর্জাতিক নাম্বারঃ ২৮৬ ৫৫১-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... হিশাম (রহঃ) হতে এ সূত্রে ইবনু নুমায়রের হাদীসের অবিকল বর্ণনা করেন। (ইসলামিক ফাউন্ডেশনঃ ৫৫৫, ইসলামিক সেন্টারঃ ৫৭১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": "287.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২, আন্তর্জাতিক নাম্বারঃ ২৮৭ ৫৫২-(১০৩/২৮৭) মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... উম্মু কায়স বিনতু মিহসান (রাযিঃ) থেকে বর্ণিত। তিনি তার শিশু পুত্র সহ, যে তখনও খাদ্য খাওয়া শুরু করেনি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলেন। তার শিশু পুত্রটি তখনও কঠিন খাদ্য খেতে শুরু করেনি। তিনি শিশুটিকে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোলে রেখে দিলেন। সে তার কাপড়ে প্রস্রাব করে দিল। বর্ণনাকারী বলেন, তাতে তিনি পানি ছিটিয়ে দেয়া ছাড়া অধিক কিছুই করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৫৫৬, ইসলামিক সেন্টারঃ ৫৭২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": "287.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩, আন্তর্জাতিক নাম্বারঃ ২৮৭ ৫৫৩-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) আবূ বকর ইবনু আবূ শইবাহ (রহঃ), আমুর আন নাকিদ (রহঃ) ও যুহায়র ইবনু হারব (রহঃ) সকলেই ইবনু উয়াইনাহ্ (রহঃ) এর মাধ্যমে যুহরী (রহঃ) থেকে এ সনদে বর্ণনা করেন এবং তিনি বলেন, “অতঃপর তিনি [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] পানি আনিয়ে তা ছিটিয়ে দিলেন\"। (ইসলামিক ফাউন্ডেশনঃ ৫৫৭, ইসলামিক সেন্টারঃ ৫৭৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": "287.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪, আন্তর্জাতিক নাম্বারঃ ২৮৭ ৫৫৪-(১০৪/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... উবাইদুল্লাহ ইবনু আবদুল্লাহ ইবনু উতবাহ ইবনু মাসউদ (রহঃ) থেকে বর্ণিত। উম্মু কায়স বিনতু মিহসান (রাযিঃ) যিনি ছিলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বাই’আত গ্রহণকারিণী প্রথম মুজাহির মহিলাদের অন্যতম। তিনি ছিলেন বানু আসাদ ইবনু খুযাইমাহ গোত্রের উক্কাশাহ ইবনু মিহসান (রাযিঃ) এর বোন। রাবী বলেন, তিনি (উম্মু কায়স) আমাকে জানান যে, তিনি একবার তার এক পুত্রকে যে তখনো খাবার গ্রহণের বয়সে পৌছেনি-নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। উবাইদুল্লাহ বলেন, তিনি আমাকে জানান যে, তার সে পুত্র রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোলে প্রস্রাব করে দিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানি আনিয়ে তার কাপড়ের উপর ছিটিয়ে দিলেন এবং তা মোটেই ধুলেন না। (ইসলামিক ফাউন্ডেশনঃ ৫৫৮, ইসলামিক সেন্টারঃ ৫৭৪)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": "288.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫, আন্তর্জাতিক নাম্বারঃ ২৮৮ ৫৫৫-(১০৫/২৮৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... 'আলকামাহ ও আল আসওয়াদ (রহঃ) থেকে বর্ণিত। একদিন জনৈক ব্যক্তি আয়িশাহ (রাযিঃ) এর ঘরে মেহমান হল। আয়িশাহ (রাযিঃ) দেখলেন, ভোরে সে তার কাপড় ধৌত করছে (অর্থাৎ রাত্রে তার স্বপ্ন দোষ হয়েছিল) তা দেখে আয়িশাহ বললেনঃ মূলত তোমার পক্ষে এটুকুই যথেষ্ট হতো যে, তুমি বীর্য দেখে থাকলে কেবলমাত্র সে স্থানটি ধুয়ে নিতে। আর যদি তা না দেখে থাক, তাহলে (মনের সন্দেহ দূর করার জন্যে) জায়গাটিতে পানি ছিটিয়ে নিতে পারতে। কেননা, এমনও হয়েছে আমি নিজে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে শুকনো বীর্য রগড়িয়ে ফেলেছি, আর তিনি সে কাপড় পরেই সালাত আদায় করেছেন*। (ইসলামিক ফাউন্ডেশনঃ ৫৫৯, ইসলামিক সেন্টারঃ ৫৭৫) * যা লাফিয়ে কুদে বের হয়, তাকে বলে মানী (বীর্য), তাতে গোসল করা ফরয হয়। আর যদি কারও প্রস্রাবের আগে বা পরে কিছু বের হয়, তাতে গোসল করতে হয় না। কতলোক খুব হাস্য রসিক, সামান্য মহিলার স্পর্শ পেলেই তরল কিছু বের হয়, তাতে শুধু লজ্জাস্থান ধুয়ে নিবে ও ওযু করে নিবে। গোসল করতে হবে না।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": "288.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬, আন্তর্জাতিক নাম্বারঃ ২৮৮ ৫৫৬-(১০৬/...) উমর ইবনু হাফস্ ইবনু গিয়াস (রহঃ) ... 'আয়িশাহ (রাযিঃ) থেকে বীর্য সম্পর্কে বলেন, আমি তা (বীর্য) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে নখ দিয়ে আঁচড়ে ফেলতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৬০, ইসলামিক সেন্টারঃ ৫৭৬)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": "288.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭, আন্তর্জাতিক নাম্বারঃ ২৮৮ ৫৫৭-(১০৭/...) কুতাইবাহ ইবনু সাঈদ, ইসহাক ইবনু ইবরাহীম, আবূ বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে বীর্য রগড়িয়ে ফেলা সম্পর্কে, আবূ মা’শার থেকে বর্ণিত খালিদের হাদীসের অনুরূপ বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৫৬১, ইসলামিক সেন্টারঃ ৫৭৭)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": "288.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮, আন্তর্জাতিক নাম্বারঃ ২৮৮ ৫৫৮-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু উওয়াইনাহ্ (রহঃ) এর সূত্রে আয়িশাহ (রাযিঃ) থেকে অনুরূপ হাদীস বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৫৬২, ইসলামিক সেন্টারঃ ৫৭৮)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": "289.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯, আন্তর্জাতিক নাম্বারঃ ২৮৯ ৫৫৯-(১০৮/২৮৯) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আমর ইবনু মাইমূন (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি সুলাইমান ইবনু ইয়াসারকে জিজ্ঞেস করলাম যে, বীর্য কোন লোকের কাপড়ে লেগে গেলে সে শুধু সে বীর্য ধুয়ে ফেলবে না কাপড়টাই ধুয়ে ফেলবে? তিনি বললেন, ‘আয়িশাহ (রাযিঃ) আমাকে জানিয়েছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বীর্য ধুয়ে ফেলতেন তারপর সে কাপড়েই সালাতের জন্যে বেরিয়ে যেতেন আর আমি (পিছন থেকে) সে কাপড়ে ধোয়ার চিহ্ন দেখতে পেতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৬৩, ইসলামিক সেন্টারঃ ৫৭৯)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": "289.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০, আন্তর্জাতিক নাম্বারঃ ২৮৯ ৫৬০-(.../...) আবূ কামিল আল জাহদারী, আবূ কুরায়ব ও ইবনু আবূ যায়িদাহ (রহঃ) এরা সকলেই আমর ইবনু মাইমূন থেকে এ সনদে হাদীসটি বর্ণনা করেছেন। তবে ইবনু যায়িদার হাদীস ইবনু বিশর এর অনুরূপ যাতে বর্ণিত হয়েছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (নিজে) বীর্য ধুলেন। আর ইবনুল মুবারক (রহঃ) ও ‘আবদুল ওয়াহিদ (রহঃ) এর হাদীসে রয়েছে যে, আয়িশাহ (রাযিঃ) বলেনঃ আমি তা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে ধুয়ে ফেলতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৬৪, ইসলামিক সেন্টারঃ ৫৮০)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": "290",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১, আন্তর্জাতিক নাম্বারঃ ২৯০ ৫৬১-(১০৯/২৯০) আহমাদ ইবনু জাওওয়াস আল হানাফী আবূ ‘আসিম (রহঃ) ..... আবদুল্লাহ ইবনু শিহাব আল খাওলানী (রহঃ) বলেন, আমি একবার আয়িশাহ (রাযিঃ) এর মেহমান ছিলাম। (রাতে) আমার কাপড়েই স্বপ্নদোষ হল। আমি সে কাপড় দুটি পানিতে ডুবিয়ে পরিষ্কার করছিলাম। আয়িশাহ (রাযিঃ) এর এক দাসী আমাকে এ রকম করতে দেখে তাকে গিয়ে জানাল। আয়িশাহ (রাযিঃ) লোক পাঠিয়ে আমাকে বললেন, তুমি তোমার কাপড় দুটিকে এ রকম করছ কেন? তিনি (আবদুল্লাহ ইবনু শিহাব) বলেন, আমি বললাম, ঘুমন্ত ব্যক্তি তার স্বপ্নে যা দেখে আমি তাই দেখেছি। তিনি বললেন, তুমি কি কাপড় দুটিতে কিছু দেখতে পেয়েছ? আমি বললাম, না। তিনি বললেন, তুমি যদি কিছু দেখতে, তবে তা ধুয়ে ফেলতে। আমি তো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় থেকে শুকনো বীর্য নখ দিয়ে আঁচড়ে ফেলতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৬৫, ইসলামিক সেন্টারঃ ৫৮১)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": "291.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২, আন্তর্জাতিক নাম্বারঃ ২৯১ ৫৬২-(১১০/২৯১) আবূ বাকর ইবনু আবূ শাইবাহ ও মুহাম্মদ ইবনু হাতিম (রহঃ) ..... আসমা (রাযিঃ) থেকে বর্ণিত, একদিন একটি মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে এসে বলল, হে আল্লাহর রাসূল! আমাদের কারো যদি কাপড়ে হারিযের রক্ত লেগে যায় তখন সে কী করবে? তিনি বললেনঃ রক্তের জায়গাটি খুব ভালভাবে রগড়াবে, তারপর ঘষে পানি দিয়ে ভালভাবে ধুয়ে ফেলবে, তারপর ঐ কাপড় পরে সালাত আদায় করতে পারবে। (ইসলামিক ফাউন্ডেশনঃ ৫৬৬, ইসলামিক সেন্টারঃ ৫৮২)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": "291.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩, আন্তর্জাতিক নাম্বারঃ ২৯১ ৫৬৩-(.../...) আবূ কুরায়ব (রহঃ) ও আবূ তাহির (রহঃ) এর সকলেই হিশাম ইবনু উরওয়াহ্ (রহঃ) হতে এ সূত্রে ইয়াহইয়া ইবনু সাঈদের হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৬৭, ইসলামিক সেন্টারঃ ৫৮৩)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": "292.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪, আন্তর্জাতিক নাম্বারঃ ২৯২ ৫৬৪-(১১১/২৯২) আবূ সাঈদ আল আশাজ্জ (রহঃ), আবূ কুরায়ব মুহাম্মাদ ইবনুল 'আলা (রহঃ) ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি কবরের পাশ দিয়ে যাচ্ছিলেন। এমন সময় তিনি বললেন, (জেনে রাখ) এ দু' কবরবাসীকে আযাব দেয়া হচ্ছে। তবে কোন কঠিন (কাজের) দরুন তাদেরকে আযাব দেয়া হচ্ছে না। তাদের একজন চোগলখোরী করত। আর অপরজন তার প্রস্রাব থেকে সতর্কতা অবলম্বন করত না। তিনি [ইবনু আব্বাস (রাযিঃ)] বলেনঃ অতঃপর তিনি খেজুরের একটি কাঁচা ডাল আনিয়ে দু’টুকরো করলেন। তারপর প্রত্যেক কবরের ওপর একটি করে গেড়ে দিলেন। আর বললেনঃ সম্ভাবনা আছে, আযাব কিছুটা হালকা করা হবে যতদিন পর্যন্ত এ দুটি না শুকিয়ে যাবে। (ইসলামিক ফাউন্ডেশনঃ ৫৬৮, ইসলামিক সেন্টারঃ ৫৮৪) প্রাসঙ্গিক আলোচনা হাদীসে উল্লিখিত ব্যক্তিদেরকে কবরে আযাব দেওয়ার যে কারণ, তা ত্যাগ করা তাদের ওপর কঠিন ছিল না। বস্তুত কেউ যদি অন্যায় থেকে বাঁচার চেষ্টা করে আল্লাহ তাকে সাহায্য করেন। কিন্তু অধিকাংশ মানুষ চেষ্টা করে না। জীবিত মানুষের যেসব আমল মৃতদের কাজে লাগে সর্বসম্মত মতে, জীবিত মানুষের পক্ষ থেকে দো'আ ঈমানদার মৃত মানুষের কাজে লাগে। এখানে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম যা করেছেন তা দো'আর সমতুল্য। সুতরাং সেটা কাজে লাগবে। কিন্তু অন্য কারো জন্য এ ধরনের গাছ ভেঙ্গে দেয়ার ব্যাপারটি কোথাও বর্ণিত হয়নি। সুতরাং, বর্তমানে কারো জন্য গাছ ভেঙ্গে রোপন করলে সেটা কার্যকরী হবে বলা যায় না। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের উক্ত কাজটি তার সাথে বিশেষভাবে সংশ্লিষ্ট, অন্য কারো সাথে তা কার্যকারী হওয়ার প্রমাণ নেই। কারণ, এ হাদীসেরই অপর বর্ণনায় যা সহীহ মুসলিমে এসেছে, “আমার সুপারিশের কারণে আল্লাহ তাদের শাস্তি গাছের ডালটি শুষ্ক হওয়া পর্যন্ত লাঘব করবেন।” [সহীহ মুসলিম ৩০০৬] ইমাম খাত্তাবী রাহিমাহুল্লাহ বলেন, এটা এর উপর ধরা হবে যে, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এ দুই কবরবাসীর ‘আযাব লাঘবের জন্য দো'আ করেছেন; যতক্ষণ তা তরতাজা থাকবে। এটা নয় যে, আযাব বন্ধ করার ব্যাপারে গাছের ডালে এমন কোনো বৈশিষ্ট্য রয়েছে বা কাঁচা ডালে কোনো বৈশিষ্ট্য রয়েছে যা শুকনো ডালে নেই। [আউনুল মাবুদ (১/২৫)] অথচ আফসোসের বিষয় হচ্ছে, অনেক মুসলিমকে দেখা যায় তারা কবরের উপর ফুল দিচ্ছে, যা কখনও জয়েয নেই, প্রথমত: এটাতো নাসারাদের কাজ। দ্বিতীয়ত: যদি এ হাদীস দলীল হয় তবে এ হাদীস তো প্রমাণ করছে যে, এখানে মৃতব্যক্তির আযাব হচ্ছে, তারা যেখানে ফুল দিচ্ছে কিংবা খেজুর ডাল পুঁতে দিচ্ছে তাদের কাছে কি এসব কবরে আযাব হওয়ার বিষয়টির সংবাদ এসেছে? হাদীসের শিক্ষা ১. কবরের আযাব হক্ব ও যথার্থ। ২. আরো বুঝা যায় যে, চোগলখুরী বা একের কথা অন্যের কাছে লাগানো হারাম ও কবীরা গুনাহ। এর মাধ্যমে স্বার্থ হাসিল করা আরো বড় হারাম। ৩. চোগলখুরী ও পেশাব থেকে পবিত্র না হওয়া কবর আযাবের অন্যতম কারণ। ৪. আল্লাহ তা'আলা কখনও কখনও মানুষের জন্য নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কোনো নিদর্শন প্রকাশ করে দেন; যাতে মানুষ তা থেকে শিক্ষা গ্রহণ করতে পারে। ৫. সালাতের বিষয়টি অত্যধিক মহৎ হওয়া; কারণ এর একটি শর্ত বাস্তবায়ন না হওয়ায় বান্দার ওপর শাস্তি হচ্ছে। যারা সালাত ত্যাগ করে তাদের পরিণতি কত ভয়াবহ হতে পারে তা থেকেই অনুমেয়। ৬. উম্মতের প্রতি নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের ভালোবাসা; এমনকি তাদের মধ্যে যারা গুনাহগার তাদের নাজাতের জন্যও রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম ঐকান্তিক প্রচেষ্টা চালাতেন। ৭. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুপারিশ কখনও কখনও কিছু সময়ের জন্য বা বড় কষ্ট থেকে ছোট কষ্টে নিয়ে যাওয়ার জন্য হতে পারে; কারণ রাসূলুল্লাহ্ সাল্লাল্লাহ \"আলাইহি ওয়াসাল্লাম বলেছেন, 'আশা করা যায় যতক্ষণ এ দু'টি ডাল শুষ্ক না হলে ততক্ষণ তাদের ওপর সে আযাব হালকা করা হবে। ৮. সাহাবায়ে কেরাম সর্বদা রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কাজের কারণ ও হিকমত জানতে সচেষ্ট থাকতেন। এজন্য তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহর রাসূল আপনি এ কাজটি কেন করলেন? ৯. সাধারণ অপরাধী ও গুনাহগারদের অপমান না করে তাদেরকে গোপন করা জরুরী। কারণ রাসুলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এ দু'জনের নাম বর্ণনা করেননি।",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": "292.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫, আন্তর্জাতিক নাম্বারঃ ২৯২ ৫৬৫-(.../...) আহমাদ ইবনু ইউসুফ আল আযদী (রহঃ) ..... সুলাইমান আল আ'মাশ হতে এ সূত্রে বর্ণিত আছে। তবে তিনি বলেন, \"আর অপরজন প্রস্রাব হতে পবিত্রতা অর্জন করত না\"। (ইসলামিক ফাউন্ডেশনঃ ৫৬৯, ইসলামিক সেন্টারঃ ৫৮৫)",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		}
	]
}