{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"25": "The Book of Wills"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4204,
			"arabicnumber": "1627.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪০৯৬, আন্তর্জাতিক নাম্বারঃ ১৬২৭ ৪০৯৬-(১/১৬২৭) আবূ খাইসামাহ্ যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু মুসান্না আনাযী (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির কিছু অর্থ সম্পদ রয়েছে, আর সে এ সম্পর্কে ওয়াসিয়্যাত করতে চায়, সে মুসলিম ব্যক্তির উচিত হবে না ওয়াসিয়্যাত লিখে না রেখে দুটি রাতও অতিবাহিত করা। (ইসলামিক ফাউন্ডেশন ৪০৫৮, ইসলামিক সেন্টার ৬ষ্ঠ খণ্ড-৪০৫৭)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4205,
			"arabicnumber": "1627.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪০৯৭, আন্তর্জাতিক নাম্বারঃ ১৬২৭ ৪০৯৭-(২/...) আবূ বকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) উবাইদুল্লাহ থেকে উক্ত সানাদে বর্ণনা করেন। তবে এ হাদীসে আছে, তারা উভয়ে বলেছেন, তার কাছে ওয়াসিয়্যাত করার মত কিছু আছে। তারা এ কথা বলেননি যে, সে ওয়াসিয়্যাত করার ইচ্ছা করে। (ইসলামিক ফাউন্ডেশন ৪০৫৯, ইসলামিক সেন্টার ৪০৫৮)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4206,
			"arabicnumber": "1627.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪০৯৮, আন্তর্জাতিক নাম্বারঃ ১৬২৭ ৪০৯৮-(৩/...) আবূ কামিল জাহদারী (রহঃ) আরো বিভিন্ন সূত্রে ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে উবাইদুল্লাহ বর্ণিত হাদীসের অনরূপ বর্ণনা করেন। আর তারা সবাই এভাবে বলেছেন যে তার কাছে এমন সম্পদ আছে, যাতে সে ওয়াসিয়্যাত করতে পারে। কিন্তু আইয়ূব (রহঃ) এর হাদীসে রয়েছে যে, তিনি বলেছেন, সে তাতে ওয়াসিয়্যাত করতে চায়। উবাইদুল্লাহ থেকে ইয়াহইয়ার বর্ণনার মতই। (ইসলামিক ফাউন্ডেশন ৪০৬০, ইসলামিক সেন্টার ৪০৫৯)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4207,
			"arabicnumber": "1627.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪০৯৯, আন্তর্জাতিক নাম্বারঃ ১৬২৭ ৪০৯৯-(৪/...) হারূন ইবনু মা’রূফ (রহঃ) ..... সলিম (রহঃ) এর সূত্রে তার পিতা থেকে বর্ণনা করেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেন, কোন মুসলিম ব্যক্তির জন্যে সঙ্গত নয়, তার কাছে ওয়াসিয়্যাত করার মতো সম্পদ আছে এমতাবস্থায় ওয়াসিয়্যাত লিখিত না রেখে তিন রাত অতিবাহিত করা। 'আবদুল্লাহ ইবনু উমার (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এ কথা শোনার পর এক রাতও আমার উপর পার হয়নি যে, আমার ওয়াসিয়্যাত আমার কাছে ছিল না। (ইসলামিক ফাউন্ডেশন ৪০৬১, ইসলামিক সেন্টার ৪০৬০)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4208,
			"arabicnumber": "1627.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০০, আন্তর্জাতিক নাম্বারঃ ১৬২৭ ৪১০০-(.../...) আবূ তাহির ও হারমালাহ, ‘আবদুল মালিক ইবনু শু'আয়ব, ইবনু লায়স, ইবনু আবূ উমার 'আবদ ইবনু উমর (রহঃ) সকলেই যুহরী (রহঃ) সূত্রে উক্ত সানাদে আমর ইবনু হারিস এর হাদীসের অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪০৬২, ইসলামিক সেন্টার ৪০৬১)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4209,
			"arabicnumber": "1628.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০১, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০১-(৫/১৬২৮) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ...... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, বিদায় হজ্জের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন; এমন রোগের সময় যাতে আমি মৃত্যুর কাছাকাছি হয়ে পড়েছিলাম। আমি বললাম, হে আল্লাহর রসূল! রোগের কারণে আমার কী অবস্থা হয়েছে, আপনি তো দেখতেই পাচ্ছেন? আমি একজন সম্পদশালী ব্যক্তি, অথচ একটি মাত্র কন্যা সন্তান ব্যতীত আমার আর কোন ওয়ারিস নেই। সুতরাং আমি আমার সম্পদের দু-তৃতীয়াংশ দান করতে পারব কি? তিনি বললেন, না। আমি বললাম, তবে কি অর্ধেক মাল সদাকাহ করতে পারব? তিনি বললেন, না। বরং এক তৃতীয়াংশ এবং এক তৃতীয়াংশও বেশি হয়ে যায়। তোমার ওয়ারিসদের অভাবমুক্ত অবস্থায় রেখে যাওয়া তোমার জন্যে উত্তম, এমন অভাবগ্রস্ত অবস্থায় ছেড়ে সাওয়ার চেয়ে যে, তারা মানুষের নিকট হাত পাতবে। আর আল্লাহর সন্তুষ্টি লাভের জন্যে তুমি যা কিছুই খরচ কর তার উপর তোমাকে প্রতিদান দেয়া হবে। এমনকি, সে লোকমাটির বদৌলতেও যা তুমি তোমার স্ত্রীর মুখে তুলে দিবে। আমি বললাম, হে আল্লাহর রসূল! আমি তো আমার সাথীদের পর তাদের পিছনে রয়ে যাচ্ছি। তিনি বললেন, তুমি পেছনে রয়ে গেছো (জীবিত রয়ে গেছো), তাতে তুমি এমন আমল করে আল্লাহর সন্তুষ্টি লাভ করতে পার যাতে তোমার মর্যাদা বাড়বে ও উচু হবে। আর সম্ভবত তুমি পরবর্তীতেও থাকবে অর্থাৎ দীর্ঘায়ু লাভ করবে। এমনকি বহু সম্প্রদায় তোমার দ্বারা লাভবান হবে এবং বহু লোক তোমার দ্বারা ক্ষতিগ্রস্ত হবে। (নবীজী দুআ করলেন) ইয়া আল্লাহ! আমার সাথীদের হিজরাত অক্ষুণ্ণ রাখুন এবং তাদেরকে পশ্চাতে ফিরিয়ে দিবেন না। কিন্তু সা'দ ইবনু খাওলার জন্যে আফসোস! বর্ণনাকারী বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্যে দুঃখ প্রকাশ করেন। কারণ, তিনি মক্কায় মৃত্যুবরণ করেছিলেন। (ইসলামিক ফাউন্ডেশন ৪০৬৩, ইসলামিক সেন্টার ৪০৬২) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, নিজের স্ত্রী ও শিশু সন্তানসন্ততিদের খোরপোশ জোগানোর সুব্যবস্থা করার জন্য টাকাপয়সা ও ধনসম্পদ ব্যয় করার মধ্যে যে ব্যক্তি মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভের আশা পোষণ করবে না, সে ব্যক্তি মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভ করতে পারবে না। ২। এই হাদীসটির দ্বারা এটা প্রতিমান হয় যে, প্রকৃত ইসলামের শিক্ষা অনুযায়ী মহান আল্লাহর উপাসনার অর্থ হলো বৃহত্তর ও ব্যাপক বিষয়; তাই মানুষ যখন সাধারণ জায়েজ বস্তুগুলি নিজে উপভোগ করার জন্য ব্যবহার করবে এবং তার জরুরি বিষয়গুলি পালন করবে, তখন সে যদি তাতে মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভের আশা পোষণ করে, তাহলে সে নিশ্চয় তার সেই সাধারণ জায়েজ বস্তুগুলি এবং জরুরি বিষয়গুলি পালন করার মাধ্যমে মহান আল্লাহর সন্তুষ্টি ও পুণ্য লাভ করতে পারবে। ৩। স্বামী-স্ত্রীর মনের ইচ্ছা যৌন পূরণ করার জন্য তাদের মধ্যে যে সম্পর্ক স্থাপন হবে, তাতেও তারা মহান আল্লাহর সন্তুষ্টি ও অনেক পুণ্য লাভ করতে পারবে, যদি তারা তাদের সম্পর্ক স্থাপন করার মাধ্যমে মহান আল্লাহর নৈকট্য লাভ করার ইচ্ছা পোষণ করে।",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4210,
			"arabicnumber": "1628.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০২, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০২-(.../...) কুতাইবাহ্ ইবনু সাঈদ, আবূ বাকর ইবনু আবূ শাইবাহ, আবূ তাহির, হারমালাহ, ইসহাক ইবনু ইবরাহীম ও আবদ হুমায়দ (রহঃ) ..... সহ সকলেই যুহরীর সূত্রে উক্ত সানাদে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৪০৬৪, ইসলামিক সেন্টার ৪০৬৩)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4211,
			"arabicnumber": "1628.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৩, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৩-(.../...) ইসহাক ইবনু মানসূর (রহঃ) ...... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার রোগের খোজ-খবর নেয়ার জন্যে আমার নিকট আগমন করেন। তারপর যুহরীর বর্ণিত হাদীসের অনুরূপ উল্লেখ করেন এবং সা'দ ইবনু খাওলার প্রসঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উক্তির উল্লেখ নেই। তবে এতে এ কথা রয়েছে, কোন ব্যক্তি যেখান থেকে হিজরাত করেছে তথায় মৃত্যুবরণ করুক, এটা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পছন্দ করেন না। (ইসলামিক ফাউন্ডেশন ৪০৬৫, ইসলামিক সেন্টার ৪০৬৪)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4212,
			"arabicnumber": "1628.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৪, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৪-(৬/...) যুহায়র ইবনু হারব (রহঃ) ..... মুসআব ইবনু সা'দ (রহঃ) তার পিতা থেকে বর্ণনা করেন। তিনি বলেন, আমি একবার অসুস্থ হয়ে পড়ি এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে সংবাদ প্রেরণ করি। (তিনি আসলেন) আমি বললাম, আমার সম্পত্তি যে পরিমাণ ইচ্ছা বণ্টন করার অনুমতি দিন। তিনি সম্মতি জানালেন না। আমি বললাম, তা হলে অর্ধেক? তিনি তাও স্বীকার করলেন না। আমি বললাম, তাহলে এক-তৃতীয়াংশ? রাবী বলেন, একতৃতীয়াংশ বলার পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব থাকেন। রাবী বলেন, এরপর থেকে এক তৃতীয়াংশ জায়িয হয়ে যায়। (ইসলামিক ফাউন্ডেশন ৪০৬৬, ইসলামিক সেন্টার ৪০৬৫)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4213,
			"arabicnumber": "1628.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৫, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৫-(.../...) মুহাম্মাদ ইবনু মুসান্না ও ইবনু বাশশার (রহঃ) ...... সিমাক (রহঃ) এর সূত্রে উক্ত সানাদে অনুরূপ বর্ণনা করেন। তবে তিনি \"এরপর থেকে এক তৃতীয়াংশ বৈধ হয়ে যায়\" কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৪০৬৭, ইসলামিক সেন্টার ৪০৬৬)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4214,
			"arabicnumber": "1628.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৬, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৬-(৭/...) কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... মুসআব ইবনু সা'দ (রহঃ) এর সূত্রে তাঁর পিতা হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার রোগের খোজ-খবর নিতে এলেন। আমি জিজ্ঞেস করলাম, আমি কি আমার সমস্ত সম্পদ ওয়াসিয়্যাত করে যাব? তিনি বললেন, না। আমি বললাম, তা হলে অর্ধেক? তিনি বললেন, না। আমি বললাম, তবে এক-তৃতীয়াংশ? তিনি বললেন, হ্যাঁ এবং বললেন এক-তৃতীয়াংশ অনেক। (ইসলামিক ফাউন্ডেশন ৪০৬৮, ইসলামিক সেন্টার ৪০৬৭)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": "1628.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৭, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৭-(৮/...) মুহাম্মদ ইবনু আবূ 'উমার মাক্কি (রহঃ) ..... সা'দ (রাযিঃ) এর তিন পুত্র তাদের পিতার থেকে বর্ণনা করেন যে, মক্কায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা'দের অসুখ দেখার জন্যে তার নিকট আসেন। সা'দ (রাযিঃ) কেঁদে ফেলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কেন কাঁদছ? তিনি বললেন, আমি ভয় পাচ্ছি, যে স্থান থেকে হিজরাত করেছি, সেথায় না আমি মারা যাই; যেমনিভাবে মারা গিয়েছেন সা'দ ইবনু খাওলা (রাযিঃ)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ইয়া আল্লাহ! সাদকে সুস্থতা দান করুন তিন বার বললেন। সা'দ (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমার প্রচুর সম্পদ আছে। আর একমাত্র কন্যাই আমার উত্তরাধিকার হবে। তবে কি আমার সমুদয় সম্পদ ওয়াসিয়্যাত করতে পারি? তিনি বললেন, না। সা'দ (রাযিঃ) বললেন, তবে কি দুই-তৃতীয়াংশ? তিনি বললেন, না। সা'দ (রাযিঃ) বললেন, তা হলে অর্ধেক? তিনি বললেন, না। সা'দ বললেন, তাহলে এক তৃতীয়াংশ? তিনি বললেন, হ্যাঁ, এক তৃতীয়াংশ আর এক তৃতীয়াংশই অনেক। তোমার সম্পদ থেকে তুমি যা সদাকাহ কর তা তো সদাকাহ-ই এবং তোমার পরিবারের জন্যে যা খরচ কর তাও সদাকাহ্ আর তোমার মাল থেকে তোমার স্ত্রী যা খায় তাও সদাকাহ্। তোমার পরিবার-পরিজনকে যদি তুমি সম্পদশালী রেখে যাও, অথবা বলেছেন স্বাচ্ছন্দ্যে রেখে যাও, তবে তা তাদের মানুষের কাছে হাতপাতা অবস্থায় রেখে যাওয়ার তুলনায় ভাল। আর এ কথা বলতে তিনি নিজ হাত দিয়ে ইশারা করলেন। (ইসলামিক ফাউন্ডেশন ৪০৬৯, ইসলামিক সেন্টার ৪০৬৮)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": "1628.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৮, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৮-(৯/...) আবূ রাবী' আতাকী (রহঃ) ...... সা'দ (রাযিঃ) এর তিন পুত্র হতে বর্ণিত। তারা বলেছেন, সা'দ (রাযিঃ) মক্কায় অসুস্থ হয়ে পড়েন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার খোঁজ খবর নেয়ার জন্যে তার কাছে আসেন। পরবর্তী অংশ সাকাফীর হাদীসের অনুরূপ। (ইসলামিক ফাউন্ডেশন ৪০৭০, ইসলামিক সেন্টার ৪০৬৯)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": "1628.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১০৯, আন্তর্জাতিক নাম্বারঃ ১৬২৮ ৪১০৯-(.../...) মুহাম্মাদ ইবনু মুসান্না (রহঃ) ..... হুমায়দ ইবনু আবদুর রহমান (রাহঃ) এর সূত্রে বর্ণিত। তিনি বলেন, আমার নিকট সা'দ ইবনু মালিকের তিন পুত্র বর্ণনা করেছেন। তারা প্রত্যেকেই আমার কাছে বর্ণনা করেন যে, সাদ মক্কায় অসুস্থ হয়ে পড়লো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার খোঁজ-খবর নেয়ার জন্যে তার কাছে আসেন। পরবর্তী অংশ ‘আমর ইবনু সাঈদ সূত্রে বর্ণিত হুমায়দ হিমইয়ারী (রহঃ) এর হাদীসের অনুরূপ। (ইসলামিক ফাউন্ডেশন ৪০৭১, ইসলামিক সেন্টার ৪০৭০)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": "1629",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১০, আন্তর্জাতিক নাম্বারঃ ১৬২৯ ৪১১০-(১০/১৬২৯) ইবরাহীম ইবনু মূসা রাযী, আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, হায়! লোকজন যদি এক-তৃতীয়াংশ কমিয়ে এক চতুর্থাংশ করতো। কেননা, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এক তৃতীয়াংশ এবং এক-তৃতীয়াংশই বেশী। ওয়াকী' এর হাদীসে আছে 'বড়' বা 'বেশি\"। (ইসলামিক ফাউন্ডেশন ৪০৭২, ইসলামিক সেন্টার ৪০৭১)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": "1630",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১১, আন্তর্জাতিক নাম্বারঃ ১৬৩০ ৪১১১-(১১/১৬৩০) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ্ ইবনু সাঈদ ও আলী ইবনু হুজুর (রহঃ) ... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলো, আমার পিতা মারা গেছেন এবং তিনি কিছু সম্পদ রেখে গেছেন; কিন্তু ওয়াসিয়্যাত করেননি। তার পক্ষ থেকে সদাকাহ্ করা হলে কি তার গুনাহ ক্ষমা হবে? তিনি বললেন, হ্যাঁ (ইসলামিক ফাউন্ডেশন ৪০৭৩, ইসলামিক সেন্টার ৪০৭২)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": "1004.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১২, আন্তর্জাতিক নাম্বারঃ ১০০৪ ৪১১২-(১২/১০০৪) যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললো, আমার মা হঠাৎ মারা গেছেন। তার ব্যাপারে আমি ধারণা করি, তিনি যদি কথা বলতে পারতেন তবে সদাকাহ্ করতেন। আমি যদি তার পক্ষে সদাকাহ্ করি, তবে কি আমার এ কাজের কোন সাওয়াব হবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৪০৭৪, ইসলামিক সেন্টার ৪০৭৩)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": "1004.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৩, আন্তর্জাতিক নাম্বারঃ ১০০৪ ৪১১৩-(.../...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, হে আল্লাহর রসূল! আমার মা হঠাৎ মৃত্যুবরণ করেন এবং কোন ওয়াসিয়্যাত করেননি। তার প্রতি আমার ধারণা যে, যদি তিনি কথা বলার সুযোগ পেতেন তবে সদাকাহ করতেন। আমি যদি তার পক্ষে সদাকাহ করি, তবে কি তিনি সাওয়াব পাবেন? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৪০৭৫, ইসলামিক সেন্টার ৪০৭৪)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": "1004.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৪, আন্তর্জাতিক নাম্বারঃ ১০০৪ ৪১১৪-(১৩/...) আবূ কুরায়ব হাকাম ইবনু মূসা, উমাইয়াহ ইবনু বিসতাম ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... এ সকল সূত্রে হিশাম ইবনু উরওয়াহ্ (রহঃ) থেকে উক্ত সানাদে হাদীসটি উল্লেখ করেন। তবে উসামাহ ও রাওহ (রহঃ) এর বর্ণিত হাদীসে আছে, আমার কি সাওয়াব হবে? যেমন বলেছেন, ইয়াহইয়া ইবনু সাঈদ। আর শু'আয়ব ও জাফার (রহঃ) এর বর্ণনায় আছে, তার কি সাওয়াব হবে? যেমন রয়েছে ইবনু বিশরের রিওয়ায়াতে। (ইসলামিক ফাউন্ডেশন ৪০৭৬, ইসলামিক সেন্টার ৪০৭৫)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": "1631",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৫, আন্তর্জাতিক নাম্বারঃ ১৬৩১ ৪১১৫-(১৪/১৬৩১) ইয়াহইয়া ইবনু আইয়্যুব ও কুতাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন মানুষ মৃত্যুবরণ করে তখন তার সমস্ত আমল বন্ধ হয়ে যায় তিন প্রকার আমল ছাড়া। ১. সদাকাহ জারিয়াহ্ অথবা ২. এমন ইলম যার দ্বারা উপকার হয় অথবা ৩. পুণ্যবান সন্তান যে তার জন্যে দু'আ করতে থাকে। (ইসলামিক ফাউন্ডেশন ৪০৭৭, ইসলামিক সেন্টার ৪০৭৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, মানুষের মৃত্যুবরণ করার সাথে সাথে তার সমস্ত কর্ম বন্ধ হয়ে যায়। তবে সে মৃত্যুবরণ করার পরেও তার উল্লিখিত তিনটি কর্মের দ্বারা সে উপকৃত হতে থাকে। কেননা প্রকৃতপক্ষে উল্লিখিত তিনটি কর্মের প্রকৃত উপাদান ও মাধ্যম সে নিজেই। সুতরাং তার সন্তান তার মাধ্যমেই এই পৃথিবীতে এসেছে, বই লিখার মাধ্যমে অথবা শিক্ষা প্রদানের মাধ্যমে জ্ঞান প্রচারের বিষয়টিও তার উপার্জিত রত্ন, অনুরূপভাবে প্রবহমান দান খয়রাত প্রদান করার বিষয়টিও তার উপার্জিত সম্পদ এবং আল্লাহর নামে তারই ওয়াকফ। ২। এই হাদীসটির দ্বারা এই বিষয়টি সাব্যস্ত হয় যে, মৃত ব্যক্তির জন্য পবিত্র কুরআন পাঠ করে তাকে তার পুণ্য দান করা বৈধ নয়। তাই আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] থেকে এই বিষয়টি প্রমাণিত হয় নি যে, তিনি তাঁর পরিবার-পরিজনের কোনো ব্যক্তির জন্য কিংবা অন্য কোনো ব্যক্তির জন্য পবিত্র কুরআন পাঠ করে তার পুণ্য তাকে দান করেছেন। আর যদি পবিত্র কুরআন পাঠ করে তার পুণ্যের দ্বারা মৃত ব্যক্তিদেরকে পুরস্কৃত করা সম্ভব হতো, তাহলে তিনি এই কাজে আগ্রহ প্রকাশ করতেন। এবং এই বিষয়টির প্রতি তিনি মুসলিম জাতিকে উৎসাহিত করতেন। কেননা তার মাধ্যমে মুসলিমগণ তাদের মৃত ব্যক্তিদেরকে এই কাজটির মাধ্যমে উপকৃত করতে সক্ষম হতো। কেননা আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] তো মুসলিম জাতির প্রতি অত্যন্ত দয়াবান ও করুণাময়। অতঃপর এই বিষয়টি প্রকৃত ইসলামের প্রথম চার খালীফা এবং সাহাবীগণ [রাদিয়াল্লাহু আনহুম] আল্লাহর নাবী [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এর পন্থা অবলম্বন করেছিলেন। তাই তাঁদের মধ্যে থেকেও কোনো সাহাবী পবিত্র কুরআন পাঠ করে তার পুণ্যের দ্বারা কোনো মৃত ব্যক্তিকে পুরস্কৃত করেছেন, এই বিষয়টি প্রমাণিত হয়নি। ৩। এই হাদীসটির দ্বারা এই বিষয়টি সাব্যস্ত হয় যে, বিবাহ করার প্রতি মুসলিম ব্যক্তিকে উৎসাহিত করা উচিত। যেহেতু এই বিবাহের মাধ্যমেই ধর্মপরায়ণ সন্তান জন্ম গ্রহণ করার সুযোগ রয়েছে।",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": "1632.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৬, আন্তর্জাতিক নাম্বারঃ ১৬৩২ ৪১১৬-(১৫/১৬৩২) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উমর (রাযিঃ) খাইবারে একখণ্ড জমি লাভ করেন। তখন এ সম্পর্কে পরামর্শের জন্যে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসেন এবং বলেন, হে আল্লাহর রসূল! আমি খাইবারে এমন একখণ্ড জমি লাভ করেছি যে, এর চেয়ে উৎকৃষ্টতর সম্পদ আমি কখনও লাভ করিনি। আপনি এ সম্পর্কে আমাকে কী নির্দেশ দেন। তিনি বললেন, তুমি যদি চাও, তবে তার মূল মালিকানা রেখে তা সদাকাহ করতে পার। রাবী বলেন, তারপর উমর (রাযিঃ) তা সদাকাহ করে দেন এ শর্তে যে, এর মূলস্বত্ব বিক্রি করা যাবে না, খরিদ করা যাবে না, উত্তরাধিকার সূত্রে লাভ করা যাবে না এবং দানও করা যাবে না। সুতরাং উমর (রাযিঃ) এর আয় দরিদ্র, আত্মীয়, দাস মুক্তি, জিহাদ, পথিক ও মেহমানের উদ্দেশে সদাকাহ করে দেন। অবশ্য যে ব্যক্তি এর তত্ত্বাবধায়ক হবে তার জন্যে এর থেকে যুক্তিসঙ্গত পরিমাণ খাওয়া বা কোন বন্ধু-বান্ধবকে খাওয়ানো দূষণীয় হবে না, যদি সে এর থেকে সঞ্চয় না করে। বর্ণনাকারী বলেন, আমি এ হাদীসটি মুহাম্মদ (রহঃ) এর নিকট বর্ণনা করতে গিয়ে যখন এ স্থানে পৌছি,غَيْرَ مُتَمَوِّلٍ فِيهِ (যদি সে এর থেকে সঞ্চয়কারী না হয়) তখন মুহাম্মাদ (রহঃ) বললেনغَيْرَ مُتَأَثِّلٍ مَالاً (সম্পদ সঞ্চয়কারী হবে না।) ইবনু আওন (রহঃ) বলেন, এ কিতাব যিনি পড়েছেন তিনি আমাকে জানিয়েছেন যে, --- এ স্থলে রয়েছে غَيْرَ مُتَأَثِّلٍ مَالاً। (ইসলামিক ফাউন্ডেশন ৪০৭৮, ইসলামিক সেন্টার, ৪০৭৭)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": "1632.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৭, আন্তর্জাতিক নাম্বারঃ ১৬৩২ ৪১১৭-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ, ইসহাক ও মুহাম্মাদ ইবনু মুসান্না (রহঃ) ..... সূত্রে ইবনু আওন (রহঃ) থেকে উক্ত সানাদে হুবহু বর্ণনা করেছেন। তবে ইবনু আবূ যায়িদাহ ও আযহার (রহঃ) এর হাদীস এ পর্যন্ত এসে শেষ হয়েছে যে, “অথবা কোন বন্ধু-বান্ধবকে খাওয়ায় এতে সঞ্চয়কারী না হয়ে\", পরের অংশ তিনি উল্লেখ করেননি। আর ইবনু আদী (রহঃ) এর হাদীসে তাই আছে, যা সুলায়ম (রহঃ) উল্লেখ করেছেন অর্থাৎ \"অতঃপর আমি এ হাদীসটি মুহাম্মাদ (রহঃ) এর নিকট বর্ণনা করি ..... শেষ পর্যন্ত।\" (ইসলামিক ফাউন্ডেশন ৪০৭৯, ইসলামিক সেন্টার ৪০৭৮)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": "1633",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৮, আন্তর্জাতিক নাম্বারঃ ১৬৩৩ ৪১১৮-(১৬৩৩) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি খাইবারের এলাকায় একখণ্ড জমি লাভ করি। তখন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলি, আমি এমন একখণ্ড জমি লাভ করেছি, যার চেয়ে বেশি প্রিয় এবং আমার কাছে উত্তম কোন মাল আর পাইনি। রাবী এ হাদীসে পরবর্তী অংশ অন্যান্যের অনুরূপ বর্ণনা করেন। তবে তিনি এ কথা বর্ণনা করেননি যে, অতঃপর আমি মুহাম্মদ (রহঃ) এর নিকট বর্ণনা করি এবং এর পরেরটুকু। (ইসলামিক ফাউন্ডেশন ৪০৮০, ইসলামিক সেন্টার ৪০৭৯)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": "1634.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১১৯, আন্তর্জাতিক নাম্বারঃ ১৬৩৪ ৪১১৯-(১৬/১৬৩৪) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ..... তালহাহ ইবনু মুসারিফ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ ইবনু আবূ আওফা (রাযিঃ) কে জিজ্ঞেস করলাম যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি ওয়াসিয়্যাত করেছিলেন? তিনি বললেন, না। আমি বললাম, তাহলে কেন মুসলিমদের উপর ওয়াসিয়্যাত ফরয করা হলো? অথবা বললেন, কিভাবে তাদেরকে ওয়াসিয়াতের হুকুম দেয়া হলো? তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওয়াসিয়্যাত করেছেন, আল্লাহ তা'আলার কিতাব সম্পর্কে (আমল করতে)। (ইসলামিক ফাউন্ডেশন ৪০৮১, ইসলামিক সেন্টার ৪০৮০)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": "1634.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২০, আন্তর্জাতিক নাম্বারঃ ১৬৩৪ ৪১২০-(১৭/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... মালিক ইবনু মিগওয়াল (রহঃ) এর সূত্রে উক্ত সানাদে অনুরূপ বর্ণনা করেছেন। অবশ্য ওয়াকী (রহঃ) এর বর্ণনায় আছে- আমি বললাম, “তাহলে কী করে মানুষকে ওয়াসিয়াতের হুকুম করা হলো\"? আর ইবনু নুমায়র (রহঃ) এর বর্ণনায় আছে, আমি বললাম, কিভাবে মুসলিমের উপর ওয়াসিয়্যাত ওয়াজিব হলো? (ইসলামিক ফাউন্ডেশন ৪০৮২, ইসলামিক সেন্টার ৪০৮১)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": "1635.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২১, আন্তর্জাতিক নাম্বারঃ ১৬৩৫ ৪১২১-(১৮/১৬৩৫) আবূ বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) .... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন দীনার, দিরহাম, বকরী বা উট রেখে যাননি এবং কোন কিছুর ওয়াসিয়্যাত করেননি। (ইসলামিক ফাউন্ডেশন ৪০৮৩, ইসলামিক সেন্টার ৪০৮২)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": "1635.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২২, আন্তর্জাতিক নাম্বারঃ ১৬৩৫ ৪১২২-(.../...) যুহায়র ইবনু হারব, উসমান ইবনু আবূ শাইবাহ, ইসহাক ইবনু ইবরাহীম (রহঃ) আর সকলে জারীর হতে ও আলী ইবনু খাশরাম (রহঃ) ..... আ'মাশ (রহঃ) হতে উক্ত সানাদে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৪০৮৪, ইসলামিক সেন্টার ৪০৮৩)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": "1636",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৩, আন্তর্জাতিক নাম্বারঃ ১৬৩৬ ৪১২৩-(১৯/১৬৩৬) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আসওয়াদ ইবনু ইয়াযীদ হতে বর্ণিত। তিনি বলেন, তারা আয়িশাহ (রাযিঃ) এর কাছে উল্লেখ করেন যে, আলী (রাযিঃ) তো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওয়াসিয়াতের ব্যাপারে দায়িত্ববান ছিলেন। তিনি বললেন, কখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ওয়াসিয়্যাত করেছেন? আমি তো তাকে (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে) আমার বুকে ভর দিয়ে রেখেছিলাম, অথবা বলেছেন, আমার কোলে; তখন তিনি একটি রিকাব চাইলেন, এরপর আমার কোলে ঢলে পড়েন। আমি বুঝতেও পারিনি যে, তিনি মৃত্যুবরণ করেছেন। তিনি কখন তাকে ওয়াসিয়্যাত করলেন? (ইসলামিক ফাউন্ডেশন ৪০৮৫, ইসলামিক সেন্টার ৪০৮৪)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": "1637.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৪, আন্তর্জাতিক নাম্বারঃ ১৬৩৭ ৪১২৪-(২০/১৬৩৭) সাঈদ বিনু মানসূর, কুতাইবাহ ইবনু সাঈদ, আবূ বাকর ইবনু আবূ শাইবাহ ও আমর আন নাকিদ (রহঃ) ..... সাঈদ ইবনু জুবায়র (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সময় ইবনু আব্বাস (রাযিঃ) বলেন, বৃহস্পতিবার দিন, হায়রে বৃহস্পতিবার দিন! বলে তিনি কেঁদে ফেলেন। এমনকি তার অশ্রুধারায় কংকর ভিজে যায়। আমি বললাম, হে আবূ আব্বাস! বৃহস্পতিবার দিনের ব্যাপার কী? তিনি বললেন, সেদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রোগ বেড়ে যায়। তখন তিনি বললেন, আমার নিকট এসো, আমি তোমাদের এমন একটি লিপি লিখে দিই, যাতে আমার পরে তোমরা আর পথহারা হবে না। তখন উপস্থিত সাহাবাগণ পরস্পর বিতর্কে লিপ্ত হলেন। অথচ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে তর্কবিতর্ক করা উচিত নয়। তারা বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অবস্থা কী হলো? তিনি তা অর্থহীন বলতে পারেন না? তোমরা তার কথা বুঝার চেষ্টা কর। রাবী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের তিনটি বিষয়ে ওয়াসিয়্যাত করছি, মুশরিকদেরকে আরব উপদ্বীপ থেকে বহিষ্কার কর। প্রতিনিধি (আগন্তক) দলকে উপঢৌকন দাও, যেমনি আমি তাদেরকে উপহার দিতাম। বর্ণনাকারী বললেন, ইবনু আব্বাস (রাযিঃ) তৃতীয়টা থেকে নীরব থাকেন অথবা তিনি বলেছেন, কিন্তু তা ভুলে গেছি। আবূ ইসহাক (রহঃ) বলেন, হাসান ইবনু বিশর (রহঃ) সুফইয়ান (রাযিঃ) থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৪০৮৬, ইসলামিক সেন্টার ৪০৮৫)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": "1637.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৫, আন্তর্জাতিক নাম্বারঃ ১৬৩৭ ৪১২৫-(২১/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। (তিনি কোন এক সময় বললেন,) বৃহস্পতিবার দিন, আর কী সে বৃহস্পতিবার দিন! এরপর তার অশ্রু প্রবাহিত হতে থাকে। এমন কি, আমি দেখলাম যে, তার উভয় গালের উপরে যেন মুক্তার লহরী। রাবী বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমার কাছে হাড় ও দোয়াত নিয়ে আস, অথবা বলেছেন কাষ্ঠফলক ও দোয়াত। আমি তোমাদের এমন একটি কিতাব লিখে দিব যে, এরপর আর তোমরা পথভ্রষ্ট হবে না। অতঃপর তারা বললো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (অসুস্থতা বেড়ে যাওয়ায় অনিচ্ছাকৃত) কথা বলছেন? (ইসলামিক ফাউন্ডেশন ৪০৮৭ ইসলামিক সেন্টার ৪০৮৬)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": "1637.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৬, আন্তর্জাতিক নাম্বারঃ ১৬৩৭ ৪১২৬-(২২/...) মুহাম্মাদ ইবনু রাফি ও আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃত্যুশয্যায় ছিলেন এবং ঘরে বেশ লোক উপস্থিত ছিলেন। তাদের মধ্যে উমার ইবনু খাত্তাবও ছিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এসো, আমি তোমাদের এক কিতাব লিখে দিই। এরপরে আর তোমরা পথভ্রষ্ট হবে না। উমর (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অসুস্থতা বৃদ্ধি পেয়েছে। আর তোমাদের কাছে কুরআন বর্তমান আছে। আল্লাহর কিতাব আমাদের জন্যে যথেষ্ট। তখন ঘরের লোকজনের মধ্যে বিতর্ক শুরু হয় এবং তারা ঝগড়ায় লিপ্ত হন। তাদের কেউ কেউ বলেন, তোমরা (কাগজ) কাছে নিয়ে এসো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদের এমন এক কিতাব লিখে দিবেন, যার পরে আর তোমরা পথভ্রষ্ট হবে না। আর কেউ কেউ সে কথা বলেন, যা উমর (রাযিঃ) বলেছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে যখন তাদের এ ঝগড়া ও কথা কাটাকাটি বৃদ্ধি পায়, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা উঠে যাও। উবাইদুল্লাহ (রহঃ) বলেন, এরপর থেকে ইবনু আব্বাস (রাযিঃ) আক্ষেপ করে বলতেন, বিপদ সে যে কত বড় বিপদ! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাদের জন্য সে কিতাব লিখে দেয়ার মাঝখানে তাদের মতবিরোধ ও ঝগড়া যে অন্তরায় হয়ে পড়ল। (ইসলামিক ফাউন্ডেশন ৪০৮৮, ইসলামিক সেন্টার ৪০৮৭)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		}
	]
}