{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"26": "The Book of Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4235,
			"arabicnumber": "1638.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৭, আন্তর্জাতিক নাম্বারঃ ১৬৩৮ ৪১২৭-(১/১৬৩৮) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী, মুহাম্মাদ ইবনু রুমহ ইবনু মুহাজির ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, সা'দ ইবনু উবাদাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সে মানতের কথা জিজ্ঞেস করেন, যা তার মায়ের যিম্মায় ছিল, কিন্তু তিনি তা পূর্ণ করার আগেই মারা যান। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তার পক্ষ থেকে তা আদায় কর। (ইসলামিক ফাউন্ডেশন ৪০৮৯, ইসলামিক সেন্টার ৪০৮৮)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": "1638.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৮, আন্তর্জাতিক নাম্বারঃ ১৬৩৮ ৪১২৮-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শাইবাহ, আমর আন্‌ নাকিদ, ইসহাক ইবনু ইবরাহীম, হারমালাহ্ ইবনু ইয়াহইয়া, আবদ ইবনু হুমায়দ ও উসমান ইবনু আবূ শাইবাহ্ (রহঃ) সবাই যুহরী (রহঃ) এর সূত্রে লায়স (রহঃ) এর বর্ণিত সানাদের সমার্থক হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪০৯০, ইসলামিক সেন্টার ৪০৮৯)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": "1639.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১২৯, আন্তর্জাতিক নাম্বারঃ ১৬৩৯ ৪১২৯-(২/১৬৩৯) যুহায়র ইবনু হারব ও ইসহাক ইবন ইবরাহীম (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক সময় আমাদেরকে মানৎ করতে বারণ করতেন এবং বলতেন যে, তা (তাকদীরের) কিছুই ফিরিয়ে দেয় না। তবে এর মাধ্যমে কৃপণের হাত থেকে কিছু বের করা হয়।* (ইসলামিক ফাউন্ডেশন ৪০৯১, ইসলামিক সেন্টার ৪০৯০) * ইমাম নাবাবী (রহঃ) বলেন এতে মুসলিমদের ইজমা রয়েছে যে, মানৎ করা চলে এবং তা আদায় করা ওয়াজিব। তবে পাপের কাজে মানৎ করা এবং তা পূরণ করা কোনটি করা যাবে না। সাহাবী সা’দ (রাযিঃ) এর মায়ের মানৎ- এ ব্যাপারে সাধারণ হুকুমভূক্ত। (মুখতাসার শারহে মুসলিম আল্লামা ওয়াহীদুজ্জামান, ৪র্থ খণ্ড, ৪৬৫ পৃঃ)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": "1639.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩০, আন্তর্জাতিক নাম্বারঃ ১৬৩৯ ৪১৩০-(৩/...) মুহাম্মাদ ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, মানৎ কোন কিছুকে না এগিয়ে আনতে পারে, আর না পিছিয়ে দিতে পারে। তবে এর মাধ্যমে কৃপণ থেকে কিছু (মাল) বের করা হয়। (ইসলামিক ফাউন্ডেশন ৪০৯২, ইসলামিক সেন্টার ৪০৯১)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": "1639.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩১, আন্তর্জাতিক নাম্বারঃ ১৬৩৯ ৪১৩১-(৪/...) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু মুসান্না ও ইবনু বাশশার (রহঃ) ...... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানৎ নিষেধ করেছেন। আর বলেছেন, তা কোন রকম কল্যাণ বয়ে আনে না। তবে এর মাধ্যমে কৃপণ লোকের থেকে কিছু বের করা হয়। (ইসলামিক ফাউন্ডেশন ৪০৯৩, ইসলামিক সেন্টার ৪০৯২)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": "1639.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩২, আন্তর্জাতিক নাম্বারঃ ১৬৩৯ ৪১৩২-(.../...) মুহাম্মদ ইবনু রাফি, মুহাম্মদ ইবনু মুসান্না ও ইবনু বাশশার (রহঃ) ..... উক্ত সনদে জারীরের হাদীসের অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪০৯৪, ইসলামিক সেন্টার ৪০৯৩)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": "1640.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৩, আন্তর্জাতিক নাম্বারঃ ১৬৪০ ৪১৩৩-(৫/১৬৪০) কুতাইবাহ্ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা মানৎ করো না। কারণ, মানৎ তাকদীর থেকে কোন উপকার করে না। তার মাধ্যমে কেবল কৃপণের সম্পদই বের করা হয়। (ইসলামিক ফাউন্ডেশন ৪০৯৫ ইসলামিক সেন্টার ৪০৯৪)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": "1640.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৪, আন্তর্জাতিক নাম্বারঃ ১৬৪০ ৪১৩৪-(৬/...) মুহাম্মাদ ইবনু মুসান্না ও ইবনু বাশশার (রহঃ) ...... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানৎ করতে বারণ করেছেন এবং বলেছেন, তা তাকদীরকে ফিরাতে পারে না। এর মাধ্যমে শুধুমাত্র কৃপণের থেকে কিছু বের করা হয়। (ইসলামিক ফাউন্ডেশন ৪০৯৬, ইসলামিক সেন্টার ৪০৯৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": "1640.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৫, আন্তর্জাতিক নাম্বারঃ ১৬৪০ ৪১৩৫-(৭/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ ও আলী ইবনু হুজুর (রহঃ) .... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানৎ এমন কোন জিনিসকে মানুষের নিকটে এনে দেয় না, যা আল্লাহ তার তাকদীরে রাখেননি। কিন্তু মানৎ যদি তাকদীরের অনুকূলে হয়ে যায় তখন এর দ্বারা কৃপণের সে মাল বের করা হয়, যা বের করতে সে ইচ্ছুক ছিল না। (ইসলামিক ফাউন্ডেশন ৪০৯৭, ইসলামিক সেন্টার ৪০৯৬)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": "1640.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৬, আন্তর্জাতিক নাম্বারঃ ১৬৪০ ৪১৩৬-(.../...) কুাতাইবাহ ইবনু সাঈদ (রহঃ) ...... আমর ইবনু আবূ আমর (রহঃ) এর সূত্রে উক্ত সানাদে অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪০৯৮, ইসলামিক সেন্টার ৪০৯৭)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": "1641.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৭, আন্তর্জাতিক নাম্বারঃ ১৬৪১ ৪১৩৭-(৮/১৬৪১) যুহায়র ইবনু হারব ও আলী ইবনু হুজর সা’দী (রহঃ) ..... ইমরান ইবনু হুসায়ন (রাযিঃ) হতে বর্ণিত। তিনি বলেন, সাকীফ গোত্র ছিল বানু উকায়ল গোত্রের মিত্র। সাকীফ গোত্রের লোকেরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু’জন সাহাবীকে বন্দী করে। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীরা বানু উকায়ল গোত্রের এক ব্যক্তিকে বন্দী করে এবং তার সাথে আযবা নাম্নী উষ্ট্রীকেও আটক করে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছে আসলেন। তখন সে বাঁধা অবস্থায় ছিল। সে ডাক দিল, ইয়া মুহাম্মাদ! ইয়া মুহাম্মাদ! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট এলেন এবং বললেন, তোমার কী অবস্থা? সে বললো, আমাকে কী কারণে বন্দী করেছেন? আর কেনই বা হাজীদের অগ্রগামী উষ্ট্রটিকে আটক করেছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, বিরাট অপরাধের কারণে। তোমার মিত্র সাকীফ গোত্রের অপরাধের জন্য তোমাকে বন্দী করেছি। এরপর তিনি তার কাছ থেকে ফিরে আসলেন। সে আবার তাকে ডেকে বললো, ইয়া মুহাম্মাদ! ইয়া মুহাম্মাদ! আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন বড়ই দয়ালু এবং নম্র স্বভাবের। তাই তিনি তার দিকে আবার এলেন এবং বললেন, তোমার কী অবস্থা? সে বললো, আমি একজন মুসলিম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি যদি এ কথা তখন বলতে, যখন তোমার ব্যাপার তোমার অধিকারে ছিল, তবে তুমি পুরোপুরি সফল হতে। এরপর তিনি ফিরে আসলেন। সে আবারও তাকে ডাক দিয়ে বললো, ইয়া মুহাম্মাদ! ইয়া মুহাম্মাদ! তিনি পুনরায় তার কাছে এসে বললেন, তোমার কী হয়েছে? সে বললো, আমি ক্ষুধার্ত, আমাকে খাবার দিন, এবং পিপাসিত, আমাকে পান করান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ-ই তোমার প্রয়োজন? অতঃপর তাকে সেই দু’ব্যক্তির বিনিময়ে মুক্তি দেয়া হয়। রাবী বলেন, একবার এক আনসার মহিলা বন্দী হয় এবং আযবা নাম্নী উষ্ট্রী (তাদের হাতে) ধরা পড়ে। মহিলাটি বাঁধা অবস্থায় ছিল। গোত্রের লোকদের অভ্যাস ছিল তারা তাদের পশু গৃহের সামনে রাখত। এক রাত্রে রমণীটি বন্ধন মুক্ত হয়ে পলায়ন করে এবং উটের কাছে আসে। সে যখনই কোন উটের কাছে আসতো, উট আওয়াজ করতো এবং তখন সে তাকে পরিত্যাগ করতো। অবশেষে সে ‘আযবার কাছে এসে পৌছে। ‘আযবা' কোন আওয়াজ করলো না। এ উটনী ছিল বড়ই অনুগত। সে তার পিঠের উপর বসে এবং তাকে হাকায়, আর সে চলতে থাকে। তখন তারা তার পলায়ন টের পেয়ে গেল এবং তার খোঁজে ছুটল। কিন্তু আযবা তাদেরকে ব্যর্থ করে দেয়। রাবী বলেন, মহিলাও আল্লাহর নামে মানৎ করে যে, আল্লাহ যদি এ উষ্ট্রীর সাহায্যে তাকে মুক্তি দেন, তবে সে অবশ্যই তাকে কুরবানী দিবে। তারপর যখন মহিলাটি মদীনায় আসলেন আর লোক সকল তাকে দেখাদেখি করছেন এবং বলাবলি করছেন। এ আযবা নাম্নী উষ্ট্রীটি রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর। তারপর তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে ঘটনাটি তাকে বললেন। তিনি বললেন, সুবহানাল্লাহ কী মন্দ প্রতিদান, যা সে তাকে দিয়েছে। সে আল্লাহর নামে মানৎ করেছে যে, যদি আল্লাহ তাকে এ উষ্ট্রীর উপর রক্ষা করেন তবে সে তাকেই কুরবানী করে দিবে। (জেনে রেখ) পাপের ব্যাপারে মানৎ করলে সে মানৎ পূরণ করতে নেই। আর সে বস্তুর মানৎ ও পূরণযোগ্য নয়, যার মালিক সে ব্যক্তি নয়। ইবনু হুজুর (রহঃ)-এর বর্ণনায় আছে যে, আল্লাহর নাফরমানীর বিষয়ে মানৎ সংঘটিত হয় না। (ইসলামিক ফাউন্ডেশন ৪০৯৯, ইসলামিক সেন্টার ৪০৯৮)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": "1641.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৮, আন্তর্জাতিক নাম্বারঃ ১৬৪১ ৪১৩৮-(.../...) আবূ রাবী' আতাকী, ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমার (রহঃ) ..... আইয়্যুব (রহঃ) এর সূত্রে অনুরূপ বর্ণনা করেছেন। আর হাম্মদ (রহঃ) বর্ণিত হাদীসে আছে যে, আযবা ছিল উকায়ল গোত্রর কোন এক ব্যক্তির এবং হাজীদের উটের মধ্যে অগ্রগামী। তার হাদীসে আরও আছে যে, মহিলাটি একটি উষ্ট্রীর নিকট আসে, যা ছিল অনুগত ও সওয়ারীতে অভ্যস্ত। আর সাকাফীর হাদীসে আছে যে, তা ছিল একটি প্রশিক্ষণপ্রাপ্ত উষ্ট্রী। (ইসলামিক ফাউন্ডেশন ৪১০০, ইসলামিক সেন্টার ৪০৯৯)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": "1642",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৩৯, আন্তর্জাতিক নাম্বারঃ ১৬৪২ ৪১৩৯-(৯/১৬৪২) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী ও ইবনু আবূ উমার (রহঃ) ...... আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার এক বৃদ্ধকে দেখলেন যে, সে তার দু' পুত্রের উপর ভর দিয়ে হেঁটে যাচ্ছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এর কী হলো? তারা বললো, সে হেঁটে চলার মানৎ করেছে। তিনি বললেন, এভাবে নিজেকে শাস্তি দেয়ার ব্যাপারে আল্লাহ তা'আলার কিছু আসে যায় না। অতঃপর তিনি তাকে সওয়ারিতে আরোহী হতে বলেন। (ইসলামিক ফাউন্ডেশন ৪১০১, ইসলামিক সেন্টার ৪১০০)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": "1643.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৪০, আন্তর্জাতিক নাম্বারঃ ১৬৪৩ ৪১৪০-(১০/১৬৪৩) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ও ইবনু হুজুর (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বৃদ্ধকে তার দু'পুত্রের মাঝে তাদের উপর ভর দিয়ে চলতে দেখেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ ব্যক্তির কী হলো? তার দু'পুত্র বললেন, হে আল্লাহর রসূল! তার উপর (হেঁটে যাওয়ার) মানত ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ওহে বৃদ্ধ! তুমি বাহনে উঠ। কেননা আল্লাহ তোমার ও তোমার মানতের ব্যাপারে অমুখাপেক্ষী! এ শব্দ হল কুতাইবাহ ও ইবনু হুজুর (রহঃ) এর। (ইসলামিক ফাউন্ডেশন ৪১০২, ইসলামিক সেন্টার ৪১০১)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": "1643.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৪১, আন্তর্জাতিক নাম্বারঃ ১৬৪৩ ৪১৪১-(.../...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ...... 'আমূর ইবনু আবূ 'আমর (রহঃ) সূত্রে উক্ত সানাদে অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪১০৩, ইসলামিক সেন্টার ৪১০২)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": "1644.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৪২, আন্তর্জাতিক নাম্বারঃ ১৬৪৪ ৪১৪২-(১১/১৬৪৪) যাকারিয়্যা ইবনু ইয়াহইয়া ইবনু সালিহ মিসরী (রহঃ) ..... উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার বোন খালি পায়ে হেঁটে বাইতুল্লাহ যাওয়ার মানৎ করে। সে আমাকে তার জন্যে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ফাতাওয়া জানার জন্যে আদেশ করে। আমি তার কাছে এ ব্যাপারে জিজ্ঞেস করলাম। তিনি বললেন, সে যেন পায়ে হেঁটে ও আরোহণ করে যায়। (ইসলামিক ফাউন্ডেশন ৪১০৪, ইসলামিক সেন্টার ৪১০৩)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": "1645",
			"text": "হাদিস একাডেমি নাম্বারঃ ৪১৪৫, আন্তর্জাতিক নাম্বারঃ ১৬৪৫ ৪১৪৫-(১৩/১৬৪৫) হারূন ইবনু সাঈদ আইলী, ইউনুস ইবনু আবদুল আলা আহমাদ ইবনু ঈসা (রহ) ...… উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কসমের কাফফারাই মানতের কাফফারাহ। (ইসলামিক ফাউন্ডেশন ৪১০৭, ইসলামিক সেন্টার ৪১০৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		}
	]
}