{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 679,
			"arabicnumber": "293.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬, আন্তর্জাতিক নাম্বারঃ ২৯৩ ৫৬৬-(১/২৯৩) আবূ বাকর ইবনু আবূ শাইবাহ, যুহায়র ইবনু হারব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদের কেউ যখন ঋতুবতী হয়ে পড়ত তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নির্দেশে সে পরিহিত কাপড় ভাল করে বেঁধে নিত। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে মেলামেশা করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৭০, ইসলামিক সেন্টারঃ ৫৮৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": "293.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭, আন্তর্জাতিক নাম্বারঃ ২৯৩ ৫৬৭-(২/...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ও ‘আলী ইবনু হুজুর আস্ সা’দী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদের কেউ যখন ঋতুবতী হয়ে পড়ত তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হায়িয আসার স্থানে তাকে শক্ত করে কাপড় বেঁধে নেয়ার নির্দেশ দিতেন। অতঃপর তার সাথে মেলামেশা করতেন। তিনি আয়িশাহ (রাযিঃ) বলেন, তোমাদের মধ্যে কে তার যৌনকামনা সেরূপ নিয়ন্ত্রণে রাখতে সক্ষম- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেরূপ যৌন কামনা নিয়ন্ত্রণে রাখতে সক্ষম ছিলেন? (ইসলামিক ফাউন্ডেশনঃ ৫৭১, ইসলামিক সেন্টারঃ ৫৮৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": "294",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮, আন্তর্জাতিক নাম্বারঃ ২৯৪ ৫৬৮-(৩/২৯৪) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... মাইমুনাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সহধর্মিণীদের সাথে পরিহিত কাপড়ের উপর ঋতুর অবস্থায় মেলামেশা করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৭২, ইসলামিক সেন্টারঃ ৫৮৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": "295",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯, আন্তর্জাতিক নাম্বারঃ ২৯৫ ৫৬৯-(৪/২৯৫) আবূ তাহির, হারূন ইবনু সাঈদ ও আহমাদ ইবনু ঈসা (রহঃ) ... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) এর আযাদকৃত গোলাম কুরায়ব বলেছেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী মাইমূনাকে বলতে শুনেছি, তিনি বলেছেনঃ আমি ঋতুবতী অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সঙ্গে একই বিছানায় শুইতেন। এ সময় আমার ও তার মাঝে কেবলমাত্র একখানা কাপড়ের আড়াল থাকত। (ইসলামিক ফাউন্ডেশনঃ ৫৭৩, ইসলামিক সেন্টারঃ ৫৮৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": "296",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০, আন্তর্জাতিক নাম্বারঃ ২৯৬ ৫৭০-(৫/২৯৬) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি রেখাযুক্ত চাঁদরের নিচে শুয়েছিলাম। ইতোমধ্যেই আমার হায়িয এলো। আমি চুপিসারে উঠে গিয়ে আমার হায়িয এর কাপড় পরে নিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, ‘তোমার কি হায়িয এসেছে? আমি বললাম, হ্যাঁ। তিনি আমাকে (কাছে) ডাকলেন। অতঃপর আমি তার চাঁদরটির নীচে শুইলাম। রাবী বলেন, তিনি (উম্মু সালামাহ) ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে (পানি নিয়ে) নাপাকির পবিত্র হওয়ার গোসল করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৭৪, ইসলামিক সেন্টারঃ ৫৯০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 684,
			"arabicnumber": "297.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১, আন্তর্জাতিক নাম্বারঃ ২৯৭ ৫৭১-(৬/২৯৭) ইয়াহইয়া ইবনু আল মুসান্না (রহঃ) ..... আয়িশাহ (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ইতিকাফ করতেন তখন আমার দিকে তার মাথা ঝুঁকিয়ে দিতেন। আমি তা আঁচড়ে দিতাম। (ইতিকাফ কালে) তিনি ঘরে প্রবেশ করতেন না প্রাকৃতিক প্রয়োজন (যেমন প্রস্রাব পায়খানা) ছাড়া। (ইসলামিক ফাউন্ডেশনঃ ৫৭৫, ইসলামিক সেন্টারঃ ৫৯১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": "297.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২, আন্তর্জাতিক নাম্বারঃ ২৯৭ ৫৭২-(৭/...) কুতাইবাহ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (ইতিকাফের সময়) আমি যখন প্রাকৃতিক প্রয়োজনে ঘরে প্রবেশ করতাম। ঘরে কোন রোগী থাকে তাহলেও তাকে কোন কথা জিজ্ঞেস না করেই চলে যেতাম। ইতিকাফের সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাসজিদ থেকে আমার দিকে মাথা এগিয়ে দিতেন, আর আমি তার চুল আঁচড়ে দিতাম। ইতিকাফ থাকাবস্থায় তিনি (প্রাকৃতিক) কোন প্রয়োজন ছাড়া ঘরে প্রবেশ করতেন না। ইবনু রুমহ বলেছেনঃ যখন তারা ইতিকাফের অবস্থায় থাকতেন, প্রাকৃতিক প্রয়োজন ছাড়া ঘরে প্রবেশ করতেন না। (ইসলামিক ফাউন্ডেশনঃ ৫৭৬, ইসলামিক সেন্টারঃ ৫৯২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": "297.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩, আন্তর্জাতিক নাম্বারঃ ২৯৭ ৫৭৩-(৮/...) হারূন ইবনু সাঈদ আল আইলী (রহঃ) ... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতিকাফে থাকাবস্থায় (অধিকাংশ সময়) মাসজিদ থেকে তার মাথা আমার দিকে বের করে দিতেন। আমি ঋতুবতী অবস্থায় তা ধুয়ে দিতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৭৭, ইসলামিক সেন্টারঃ ৫৯৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": "297.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪, আন্তর্জাতিক নাম্বারঃ ২৯৭ ৫৭৪-(৯/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার দিকে তার মাথা এগিয়ে দিতেন। আমার হুজরায় থেকে ঋতুবতী অবস্থায় আমি তার মাথা আঁচড়ে দিতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৭৮, ইসলামিক সেন্টারঃ ৫৯৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": "297.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫, আন্তর্জাতিক নাম্বারঃ ২৯৭ ৫৭৫-(১০/...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি ঋতুবতী অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাথা ধুয়ে দিতাম। (ইসলামিক ফাউন্ডেশনঃ ৫৭৯, ইসলামিক সেন্টারঃ ৫৯৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": "298.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৬, আন্তর্জাতিক নাম্বারঃ ২৯৮ ৫৭৬-(১১/২৯৮) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, \"মসজিদ থেকে আমার জায়নামাযটি (হাত বাড়িয়ে) নিয়ে এসো”। তিনি বলেন, আমি বললাম, আমি তো ঋতুবতী। তিনি বললেনঃ তোমার হায়িয তো তোমার হাতে নয়। (ইসলামিক ফাউন্ডেশনঃ ৫৮০, ইসলামিক সেন্টারঃ ৫৯৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": "298.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৭, আন্তর্জাতিক নাম্বারঃ ২৯৮ ৫৭৭–(১২/...) আবূ কুরায়ব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদ থেকে জায়নামায (হাত বাড়িয়ে) তুলে নিয়ে আসতে আমাকে নির্দেশ দিলেন। আমি বললাম যে, আমি তো ঋতুবতী। তিনি বললেন, তুমি তো আমার কাছে নিয়ে এসো। কারণ হায়িয তোমার হাতে নেই (লেগে যায়নি)। (ইসলামিক ফাউন্ডেশনঃ ৫৮১, ইসলামিক সেন্টারঃ ৫৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": "299",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮, আন্তর্জাতিক নাম্বারঃ ২৯৯ ৫৭৮-(১৩/২৯৯) যুহায়র ইবনু হারব, আবূ কামিল ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতিকাফরত অবস্থায় মসজিদ থেকে বললেন, হে আয়িশাহ! আমাকে কাপড়টা এগিয়ে দাও। তিনি ['আয়িশাহ (রাযিঃ)] বলেন, আমি যে ঋতুবতী! জবাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ঋতু তো তোমার হাতে লাগে নেই। তারপর আমি তা এনে দিলাম। (ইসলামিক ফাউন্ডেশনঃ ৫৮২, ইসলামিক সেন্টারঃ ৫৯৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": "300",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৯, আন্তর্জাতিক নাম্বারঃ ৩০০ ৫৭৯-(১৪/৩০০) আবূ বকর ইবনু আবূ শাইবাহ, যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি ঋতুবতী অবস্থায় পানি পান করতাম এবং পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে অবশিষ্টটুকু প্রদান করলে আমি যেখানে মুখ লাগিয়ে পান করতাম তিনিও পাত্রের সে স্থানে মুখ লাগিয়ে পান করতেন। আবার আমি ঋতুবতী অবস্থায় হাড় খেয়ে তা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দিলে আমি যেখানে মুখ লাগিয়েছিলাম তিনি সেখানে মুখ লাগিয়ে খেতেন। তবে যুহায়র কর্তৃক বর্ণিত হাদীসে “পান করার\" উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৫৮৩, ইসলামিক সেন্টারঃ ৫৯৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": "301",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮০, আন্তর্জাতিক নাম্বারঃ ৩০১ ৫৮০-(১৫/৩০১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (অধিকাংশ সময়) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার হায়িয অবস্থায় আমার কোলে মাথা রেখে কুরআন পাঠ করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৮৪, ইসলামিক সেন্টারঃ ৬০০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": "302",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮১, আন্তর্জাতিক নাম্বারঃ ৩০২ ৫৮১-(১৬/৩০২) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত যে, ইয়াহুদীগণ তাদের মহিলাদের হায়িয হলে তার সাথে এক সঙ্গে খাবার খেত না এবং এক ঘরে বাস করত না। সাহাবায়ে কিরাম এ সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন। তখন আল্লাহ তা'আলা এ আয়াত নাযিল করলেন, \"তারা তোমার কাছে হায়িয সম্পর্কে জিজ্ঞেস করে। বলে দাও যে, তা হলো নাপাক। সুতরাং হায়িয অবস্থায় তোমরা মহিলাদের থেকে পৃথক থাক.....\"— (সূরাহ আল বাকারাহ ২ঃ ২২২)। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা (সে সময় তাদের সাথে) শুধু সহবাস ছাড়া অন্যান্য সব কাজ কর। এ খবর ইয়াহুদীদের কাছে পৌছলে তারা বলল, এ লোকটি সব কাজেই কেবল আমাদের বিরোধিতা করতে চায়। অতঃপর উসায়দ ইবনু হুযায়র (রাযিঃ) ও আব্বাদ ইবনু বিশ্বর (রাযিঃ) এসে বললেন, ইয়া রাসূলাল্লাহ! ইয়াহুদীরা এমন এমন বলছে। আমরা কি তাদের সাথে (হায়িয অবস্থায়) সহবাস করব না? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর চেহারা মুবারক বিবর্ণ হয়ে গেল। এতে আমরা ধারণা করলাম যে, তিনি তাদের উপর ভীষণ রাগাম্বিত হয়েছেন। তারা (উভয়ে) বেরিয়ে গেল। ইতোমধ্যেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে দুধ হাদিয়া এলো। তিনি তাদেরকে ডেকে আনার জন্যে লোক পাঠালেন। (তারা এলে) তিনি তাদেরকে দুধ পান করালেন। তখন তারা বুঝল যে, তিনি তাদের উপর রাগ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৫৮৫, ইসলামিক সেন্টারঃ ৬০১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": "303.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮২, আন্তর্জাতিক নাম্বারঃ ৩০৩ ৫৮২-(১৭/৩০৩) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আলী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার বেশি বেশি মাযী বের হত। আমি এ সম্পর্কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিজ্ঞেস করতে লজ্জাবোধ করতাম। কারণ তার কন্যা ছিল আমার স্ত্রী। তাই আমি মিকদাদ ইবনুল আসওয়াদকে (এ সম্পর্কে জানতে) বললাম, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন। তখন তিনি বললেন, এতে তার পুরুষাঙ্গ ধুয়ে ফেলবে এবং ওযু করে নিবে। (ইসলামিক ফাউন্ডেশনঃ ৫৮৬, ইসলামিক সেন্টারঃ ৬০২) প্রাসঙ্গিক আলোচনা নাম্বহ বলতে কী বুঝায়? হাদীসের আরবী ভাষ্যে 'নাম্বহ' শব্দ ব্যবহার করা হয়েছে। শব্দটির দু'টি অর্থ রয়েছে: এক. ধুয়ে ফেলা, যা এখানে উদ্দেশ্য নেয়া হয়েছে। কারণ হাদীসের অপরাপর শব্দ তার ওপর প্রমাণ বহন করছে। অপর অর্থ হচ্ছে পানি ছিটিয়ে দেয়া। এ অর্থটিও বহুল প্রচলিত। যেমন দুধ ছাড়া আর কিছু খায় না এমন পুত্র সন্তানের পেশাবের ব্যাপারে তা ব্যবহৃত হয়েছে। হাদীসের শিক্ষা ১. ‘মযী' নাপাক। তা পানি দিয়ে ধুয়ে ফেলতে হবে। ২. এর দ্বারা আরো বুঝা যায় যে, মযী বের হলে ওযূ নষ্ট হবে; কারণ তা দু' পথের একটি দিয়ে বের হয়েছে। ৩. মযী'র কারণে পুরুষাঙ্গ ধুয়ে ফেলা ওয়াজিব। ৪. সর্বসম্মত সিদ্ধান্ত হচ্ছে মযীর কারণে গোসল করা ফরয হয় না। ৫. মযী দূর করতে হলে পাথর বা মাটি দিয়ে মুছে ফেললে চলবে না, বরং পানি দিয়ে ধুতে হবে। ৬. মানুষ যে বিষয়ে লজ্জা পায় সে বিষয় সম্পর্কে জানতে হলে অপর কাউকে তা বলে জানার ব্যবস্থা করা দোষণীয় নয়। তবে শর্ত হচ্ছে যাকে প্রতিনিধি বানানো হলে তিনি বিশ্বস্ত হবেন। ৭. লজ্জার কারণে নিজে প্রশ্ন না করা জায়েয। ৮. মানুষ তার লজ্জাজনক বিষয়টি বিশেষ কারণে অপরকে বলা বৈধ। ৯. আদব ও শিষ্টাচার হচ্ছে কোনো লোক স্ত্রীর আত্মীয়দের কাছে গোপনাঙ্গ ও সহবাস সংক্রান্ত বিষয় বলবে না। ১০. আলী রাদ্বিয়াল্লাহু আনহুর ফযীলত সাব্যস্ত হচ্ছে: কারণ লজ্জা তাকে অপরের মাধ্যমে জ্ঞান অর্জন করা থেকে বিরত রাখেনি।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": "303.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩, আন্তর্জাতিক নাম্বারঃ ৩০৩ ৫৮৩-(১৮/...) ইয়াহইয়া ইবনু হাবীব আল হারিসী (রহঃ) ..... আলী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে মাযী সম্পর্কে জিজ্ঞেস করতে লজ্জাবোধ করছিলাম ফাতিমার কারণে। তাই আমি মিকদাদকে বললাম, তখন তিনি তাকে এ ব্যাপারে জিজ্ঞেস করলে তিনি বললেনঃ তাতে (মাযী বের হলে) শুধু ওযু করতে হয়। (ইসলামিক ফাউন্ডেশনঃ ৫৮৭, ইসলামিক সেন্টারঃ ৬০৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": "303.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪, আন্তর্জাতিক নাম্বারঃ ৩০৩ ৫৮৪-(১৯/...) হারূন ইবনু সাঈদ আল আইলী ও আহমাদ ইবনু ঈসা (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, 'আলী ইবনু আবূ তালিব (রাযিঃ) বলেন, আমি একবার মিকদাদ ইবনুল আসওয়াদকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পাঠালাম। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে জিজ্ঞেস করলেন যে, কোন লোকের মাযী বের হলে সে তখন কি করবে? তিনি বললেন। পুরুষাঙ্গ ধুয়ে ফেলবে এবং ওযু করবে। (ইসলামিক ফাউন্ডেশনঃ ৫৮৮, ইসলামিক সেন্টারঃ ৬০৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": "304",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫, আন্তর্জাতিক নাম্বারঃ ৩০৪ ৫৮৫-(২০/৩০৪) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। একদা নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম রাতে (ঘুম থেকে) জেগে প্রাকৃতিক প্রয়োজন সারলেন (প্ৰস্ৰাব-পায়খানা), তারপর তার মুখমণ্ডল এবং উভয় হাত ধুলেন। এরপর ঘুমিয়ে গেলেন। (ইসলামিক ফাউন্ডেশনঃ ৫৮৯, ইসলামিক সেন্টারঃ ৬০৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": "305.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬, আন্তর্জাতিক নাম্বারঃ ৩০৫ ৫৮৬-(২১/৩০৫) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী, মুহাম্মাদ ইবনু রুমহ ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাপাকী অবস্থায় যখন ঘুমাতে ইচ্ছা করতেন তখন ঘুমাবার আগে সালাতের জন্য যেমন ওযু করতে হয় তেমন ওযু করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯০, ইসলামিক সেন্টারঃ ৬০৬) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। জুনুবী ব্যক্তি তাকেই বলা যেতে পারে, যে ব্যক্তি যৌনকর্ম বা যৌন সংসর্গ করবে যদিও তাতে বীর্যপাত না ঘটে। কিংবা যে ব্যক্তি বীর্যপাত করবে যদিও তাতে যৌনমিলন না ঘটে। এই বিষয়ে নারী পুরুষের মধ্যে কোনো তফাত নেই। আর জুনুবী ব্যক্তির জন্য গোসল করার পূর্বে পানাহার করা এবং পুনরায় শারীরিক সম্পর্ক ও যৌনমিলন করা জায়েজ। ২। জুনুবী অবস্থায় নারীদের জন্য রান্না করা, বাড়ির সেবা করা, সন্তানদেরকে দেখাশুনা ও তত্ত্বাবধান করা এবং তাদের নিজেদের প্রয়োজন পূরণ করা বৈধ। ৩। জুনুবী ব্যক্তি যখন পানাহার করার ইচ্ছা করবে অথবা ঘুমানোর ইচ্ছা করবে কিংবা পুনরায় যৌনমিলন বা সহবাস করার ইচ্ছা করবে, তখন তার জন্য নামাজের ওজুর ন্যায় ওজু করে নেওয়া ভালো আর গোসল করে নেওয়া অধিকতর ভালো। কেননা গোসলের মাধ্যমে শরীরে ফুর্তি, উৎসাহ, আনন্দ এবং শক্তি আসে এবং বীর্যপাত হওয়ার কারণে শরীরের মধ্যে থেকে যে শক্তি ও তৎপরতা কমে যায়, সেই শক্তি ও তৎপরতা গোসলের মাধ্যমে ফিরে আসে এবং অধিকতর তৃপ্তি লাভ হয়।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": "305.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭, আন্তর্জাতিক নাম্বারঃ ৩০৫ ৫৮৭-(২২/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন নাপাক থাকতেন তখন কিছু খেতে অথবা ঘুমানোর ইচ্ছা করলে ওযু করে নিতেন যেমন, সালাতের ওযু করতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯১, ইসলামিক সেন্টারঃ ৬০৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": "305.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮, আন্তর্জাতিক নাম্বারঃ ৩০৫ ৫৮৮-(.../...) মুহাম্মাদ ইবনু আল মুসান্না, ইবনু বাশশার ও উবাইদুল্লাহ ইবনু মুআয (রহঃ) এর সূত্রে উক্ত সনদে হাদীসটি বর্ণনা করেছেন। ইবনু আল মুসান্না তার হাদীসে বলেছেনঃ আমাকে হাকাম বর্ণনা করে বলেন যে, আমি ইবরাহীমকে এ হাদীস বলতে শুনেছি। (ইসলামিক ফাউন্ডেশনঃ ৫৯২, ইসলামিক সেন্টারঃ ৬০৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": "306.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৯, আন্তর্জাতিক নাম্বারঃ ৩০৬ ৫৮৯-(২৩/৩০৬) মুহাম্মাদ ইবনু আবূ বাকর আল মুকাদ্দামী ও যুহায়র ইবনু হারব (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত। একদিন উমর (রাযিঃ) জিজ্ঞেস করলেন, ইয়া রাসূলাল্লাহ! আমাদের কেউ নাপাক অবস্থায় কি ঘুমাতে পারবে? তিনি বললেনঃ হ্যাঁ, যখন সে ওযু করে নিবে। (ইসলামিক ফাউন্ডেশনঃ ৫৯৩, ইসলামিক সেন্টারঃ ৬০৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": "306.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০, আন্তর্জাতিক নাম্বারঃ ৩০৬ ৫৯০-(২৪/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত। উমর (রাযিঃ) একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ফাতাওয়া জিজ্ঞেস করলেন যে, আমাদের কেউ কি নাপাক অবস্থায় ঘুমাতে পারবে? তিনি বললেন, হ্যাঁ, সে যেন ওযু করে তারপর ঘুমায়। এরপর যখন ইচ্ছা গোসল করে নেয়। (ইসলামিক ফাউন্ডেশনঃ ৫৯৪, ইসলামিক সেন্টারঃ ৬১০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": "306.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১, আন্তর্জাতিক নাম্বারঃ ৩০৬ ৫৯১-(২৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ... ইবনু উমর (রাযিঃ) বলেন, উমার ইবনুল খাত্তাব (রাযিঃ) একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললেন, তিনি যদি রাতে (স্ত্রী সহবাসকালে) নাপাক হন (তাহলে কি করবেন)। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তুমি (তখন) ওযু করবে এবং তোমার লজ্জাস্থান ধুয়ে ফেলবে তারপর ঘুমাবে। (ইসলামিক ফাউন্ডেশনঃ ৫৯৫, ইসলামিক সেন্টারঃ ৬১১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": "307.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২, আন্তর্জাতিক নাম্বারঃ ৩০৭ ৫৯২-(২৬/৩০৭) কুতাইবাহ ইবনু সাঈদ (রহঃ) .... 'আবদুল্লাহ ইবনু আবূ কায়স (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিতর সম্বন্ধে আয়িশাহ্ (রাযিঃ) কে প্রশ্ন করলাম। তিনি (তৎবিষয়ে) হাদীস বর্ণনা করলেন। আমি জিজ্ঞেস করলাম, তিনি নাপাকির সময় কী করতেন, তিনি কি ঘুমাবার আগে গোসল করতেন, না গোসল করার আগে ঘুমাতেন? তিনি [আয়িশাহ (রাযিঃ)] বললেন, সবই করতেন। কখনো গোসল করে ঘুমাতেন আর কখনো ওযু করে ঘুমিয়ে পড়তেন। আমি বললাম, সমস্ত প্রশংসা সে আল্লাহর যিনি সব কাজেই অবকাশ রেখেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯৬, ইসলামিক সেন্টারঃ ৬১২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": "307.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩, আন্তর্জাতিক নাম্বারঃ ৩০৭ ৫৯৩-(.../...) যুহায়র ইবনু হারব ও হারূন সাঈদ আল আইলী (রহঃ) মুআবিয়াহ ইবনু সালিহ (রহঃ)-এর সূত্রে উক্ত সনদে এ হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯৭, ইসলামিক সেন্টারঃ ৬১৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": "308",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪, আন্তর্জাতিক নাম্বারঃ ৩০৮ ৫৯৪-(২৭/৩০৮) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও আমর আন নাকিদ (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন তার স্ত্রীর সাথে মিলিত হবে তারপর আবার মিলিত হবার ইচ্ছা করবে সে যেন ওযু করে নেয়। আবূ বকর তার হাদীসে উভয় মিলনের মধ্যে ওযু করবে' বাক্যটি বাড়িয়েছেন এবং أَرَادَ أَنْ يَعُودَ এর স্থলে أَرَادَ أَنْ يُعَاوِدَ বলেছেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯৮, ইসলামিক সেন্টারঃ ৬১৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": "309",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫, আন্তর্জাতিক নাম্বারঃ ৩০৯ ৫৯৫-(২৮/৩০৯) হাসান ইবনু আহমাদ ইবনু আবূ শু'আয়ব আল হাররানী (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সকল স্ত্রীর কাছে একই গোসলে যেতেন। (ইসলামিক ফাউন্ডেশনঃ ৫৯৯, ইসলামিক সেন্টারঃ ৬১৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": "310",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬, আন্তর্জাতিক নাম্বারঃ ৩১০ ৫৯৬-(২৯/৩১০) যুহারর ইবনু হারব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উম্মু সুলায়ম (রাযিঃ) যিনি ছিলেন (এ হাদীসের রাবী) ইসহাকের দাদী- একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললেন, ‘আয়িশাহ (রাযিঃ) তখন তার নিকট উপস্থিত ছিলেন- ইয়া রাসূলাল্লাহ! পুরুষ যেমন স্বপ্নে দেখে, নারীও যদি তা দেখে, এমতাবস্থায় সে কি করবে? তখন 'আয়িশাহ্ (রাযিঃ) বললেন, উম্মু সুলায়ম! তুমি নারী জাতিকে অপমানিত করেছ। তোমার অকল্যাণ হোক (তার এ কথা ছিল ভাল উদ্দেশ্যে)। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আয়িশাহ (রাযিঃ) কে বললেন, বরং তোমার অকল্যাণ হোক! এরপর উম্মু সুলায়ম (রাযিঃ) এর জবাবে বললেন হ্যাঁ, উম্মু সুলায়ম! সে গোসল করে ফেলবে যখন ঐরূপ দেখবে। (ইসলামিক ফাউন্ডেশনঃ ৬০০, ইসলামিক সেন্টারঃ ৬১৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": "311",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭, আন্তর্জাতিক নাম্বারঃ ৩১১ ৫৯৭-(৩০/৩১১) আব্বাস ইবনুল ওয়ালীদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। উম্মু সুলায়ম (রাযিঃ) বলেন, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সে মহিলা সম্পর্কে জিজ্ঞেস করলেন যে ঘুমে পুরুষ যা দেখে তাই দেখতে পায়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, মেয়েলোক যখন তেমনই দেখবে তখন সে গোসল করবে। উম্মু সালামাহ (রাযিঃ) বলেন, এ কথায় আমি লজ্জাবোধ করলাম। তিনি বললেন, এ রকমও কি হয়? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, হ্যাঁ, তা না হলে ছেলে মেয়ে তার সদৃশ কেমন করে হয়? পুরুষের বীর্য গাঢ়, সাদা আর মহিলাদের বীর্য পাতলা, হলুদ। দুয়ের মধ্যে থেকে যার বীর্য ওপরে উঠে যায় অথবা আগে চলে যায় (সন্তান) তারই সদৃশ হয়। (ইসলামিক ফাউন্ডেশনঃ ৬০১, ইসলামিক সেন্টারঃ ৬১৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": "312",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮, আন্তর্জাতিক নাম্বারঃ ৩১২ ৫৯৮-(৩১/৩১২) দাউদ ইবনু রুশায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে ঐ মহিলা সম্পর্কে জিজ্ঞেস করলেন, যে পুরুষ লোক ঘুমের মধ্যে যা দেখতে পায় সেও তাই। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ পুরুষের যা হয় (স্বপ্নদোষ) মহিলাদেরও এমন হলে সে গোসল করবে। (ইসলামিক ফাউন্ডেশনঃ ৬০২, ইসলামিক সেন্টারঃ ৬১৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": "313.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯, আন্তর্জাতিক নাম্বারঃ ৩১৩ ৫৯৯-(৩২/৩১৩) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উম্মু সালামাহ্ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললেন, ইয়া রসুলাল্লাহ! আল্লাহ তা'আলা হক কথা বলতে লজ্জাবোধ করেন না। তাই মহিলাদের যখন স্বপ্নদোষ হয় তখন কি তার উপর গোসল করা জরুরী? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হ্যাঁ, যখন সে বীর্য দেখবে। (এ কথা শুনে) উম্মু সালামাহ্ (রাযিঃ) বললেন, “ইয়া রাসূলাল্লাহ! মহিলাদেরও কি স্বপ্নদোষ হয়\"? তিনি বললেন, তোমার উভয় হাত ধূলিময় হোক! তাহলে তার সন্তান কেমন করে তার সদৃশ হয়? (ইসলামিক ফাউন্ডেশনঃ ৬০৩, ইসলামিক সেন্টারঃ ৬১৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": "313.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০, আন্তর্জাতিক নাম্বারঃ ৩১৩ ৬০০-(.../...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ), যুহায়র ইবনু হারব ও ইবনু আবূ উমার (রহঃ) ..... উরওয়াহ হতে এ সনদে উপরোক্ত হাদীসের অর্থের অবিকল বর্ণিত আছে। তিনি আরো একটু বাড়িয়ে বলেন যে, তিনি উম্মু সালামাহ্ (রাযিঃ) বললেন, তুমি নারী জাতিকে লজ্জিত করেছ। (ইসলামিক ফাউন্ডেশনঃ ৬০৪, ইসলামিক সেন্টারঃ ৬২০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": "314.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১, আন্তর্জাতিক নাম্বারঃ ৩১৪ ৬০১-(.../৩১৪) 'আবদুল মালিক ইবনু শু'আয়ব ইবনুল লায়স (রহঃ) ..... উম্মুল মু'মিনীন আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন যে, আবূ তালহার সন্তানদের মা উন্মু সুলায়ম একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে হিশামের হাদীসের অনুরূপ বর্ণনা করেন। তবে এ হাদীসটিতে ব্যতিক্রম যা রয়েছে তা হল, আয়িশাহ্ (রাযিঃ) বলেন, আমি বললাম, \"ছিঃ ছিঃ (অসন্তোষ প্রকাশক শব্দ) মেয়েলোক কি ঐরুপ দেখে?\" (ইসলামিক ফাউন্ডেশনঃ ৬০৫, ইসলামিক সেন্টারঃ ৬২১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": "314.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২, আন্তর্জাতিক নাম্বারঃ ৩১৪ ৬০২-(৩৩/...) ইবরাহীম ইবনু মূসা আর রায়ী, সাহল ইবনু উসমান ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলল, মেয়েলোকের যখন স্বপ্নদোষ হবে এবং সে বীর্যরস দেখতে পাবে তখন কি সে গোসল করবে? তিনি বললেন, হ্যাঁ, এরপর আয়িশাহ (রাযিঃ) মহিলাটিকে বললেন, তোমার উভয় হাত ধূলিময় হোক এবং তাতে অস্ত্রের খোচা লাগুক। তিনি ['আয়িশাহ্ (রাযিঃ)] বলেন, তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ছেড়ে দাও ওকে (ভৎসনা করো না) সন্তান মা-বাবার সদৃশের কারণেই হয়ে থাকে। যখন স্ত্রীর বীর্য পুরুষের বীর্যের আগে জরায়ুতে প্রবেশ করে তখন সন্তানের আকৃতি তার মামাদের মতই হয়। আর যখন পুরুষের বীর্য মেয়েলোকের বীর্যের উপর প্রাধান্য লাভ করে তখন তার আকৃতি চাচাদের মতই হয়। (ইসলামিক ফাউন্ডেশনঃ ৬০৬, ইসলামিক সেন্টারঃ ৬২২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": "315.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩, আন্তর্জাতিক নাম্বারঃ ৩১৫ ৬০৩-(৩৪/৩১৫) আল হাসান ইবনু আলী আল হুলওয়ানী (রহঃ) ..... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুক্তিপ্রাপ্ত গোলাম সাওবান (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে দাঁড়িয়েছিলাম। ইতোমধ্যেই ইয়াহুদীদের এক আলিম এসে বলল, আসসালামু 'আলাইকা ইয়া মুহাম্মাদ! এরপর আমি তাকে এমন এক ধাক্কা মারলাম যে, সে প্রায় পড়ে যাওয়ার উপক্রম হলো! সে বলল, তুমি আমাকে ধাক্কা মারলে কেন? আমি বললাম, ইয়া রাসূলাল্লাহ! বলতে পার না। ইয়াহুদী বলল, আমরা তাকে তার পরিবার-পরিজন যে নাম রেখেছে সে নামেই ডাকি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমার নাম মুহাম্মাদ। আমার পরিবারের লোকই আমার এ নাম রেখেছে। এরপর ইয়াহুদী বলল, আমি আপনাকে (কয়েকটি কথা) জিজ্ঞেস করতে এসেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তাকে বললেন, তোমার কী লাভ হবে, যদি আমি তোমাকে কিছু বলি? সে বলল, আমি আমার কান পেতে শুনব। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তার কাছে যে খড়িটি ছিল তা দিয়ে মাটিতে আঁকাঝোকা দাগ কাটতে ছিলেন। তারপর বললেন, জিজ্ঞেস কর। ইয়াহুদী বলল, যেদিন এ জমিন ও আকাশমণ্ডলী পাল্টে গিয়ে অন্য জমিন ও আকাশমণ্ডলীতে পরিণত হবে (অর্থাৎ কিয়ামত হবে) সেদিন লোকজন কোথায় থাকবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তারা সেদিন পুলসিরাতের কাছে অন্ধকারে থাকবে। সে বলল, কে সর্বপ্রথম (তা পার হবার) অনুমতি লাভ করবে? তিনি বললেন, দরিদ্র মুহাজিরগণ! ইয়াহুদী বলল, জান্নাতে যখন তারা প্রবেশ করবে তখন তাদের তোহফা কি হবে? তিনি বললেন, মাছের কলিজার টুকরা। সে বলল, এরপর তাদের দুপুরের খাদ্য কি হবে? তিনি বললেন, তাদের জন্য জান্নাতের ষাঁড় যাবাহ করা হবে যা জান্নাতের আশেপাশে চড়ে বেড়ায়। সে বলল, এরপরে তাদের পানীয় কি হবে? তিনি বললেন, সেখানকার একটি ঝর্ণার পানি যার নাম সালসাবীল। সে বলল, আপনি ঠিক বলেছেন। সে আরো বলল যে, আমি আপনার কাছে এমন একটি বিষয় সম্পর্কে জিজ্ঞেস করতে এসেছি যা নবী ছাড়া পৃথিবীর কোন অধিবাসী জানে না অথবা একজন কি দু'জন লোক ছাড়া। তিনি বললেন, আমি যদি তোমাকে তা বলে দেই তবে তোমার কি কোন উপকার হবে? সে বলল, আমি আমার কান পেতে শুনব। সে বলল, আমি আপনাকে সন্তান সম্পর্কে জিজ্ঞেস করতে এসেছি। তিনি বললেন, পুরুষের বীর্য সাদা এবং মেয়েলোকের বীর্য হলুদ। যখন উভয়টি একত্রিত হয়ে যায় এবং পুরুষের বীর্য মেয়েলোকের বীর্যের উপর প্রাধান্য লাভ করে তখন আল্লাহর হুকুমে পুত্র সন্তান হয়। আর যখন মেয়েলোকের বীর্য পুরুষের বীর্যের ওপর প্রধান্য লাভ করে তখন আল্লাহর হুকুমে কন্যা সন্তান হয়। ইয়াহুদী বলল, আপনি ঠিকই বলেছেন এবং নিশ্চয়ই আপনি নবী। এরপর সে চলে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, এ লোক আমার কাছে যা জিজ্ঞেস করেছে, ইতোপূর্বে আমার সে সম্পর্কে কোন জ্ঞানই ছিল না। আল্লাহ তা'আলা এক্ষণে আমাকে তা জানিয়ে দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৬০৭, ইসলামিক সেন্টারঃ ৬২৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": "315.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪, আন্তর্জাতিক নাম্বারঃ ৩১৫ ৬০৪-(.../...) আবদুল্লাহ ইবনু আবদুর রহমান ..... মুআবিয়াহ ইবনু সাল্লাম একই সনদে অনুরূপ বর্ণনা করেছেন। তবে তিনি তার বর্ণনাতে এতটুকু অতিরিক্ত বলেছেন যে, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বসে ছিলাম। আর তিনি বললেনঃ মাছের কলিজা'র টুকরা আর তিনি আযকারা’ ও ‘আ-নাসা' শব্দ দুটির একবচন রূপ ব্যবহার করেছেন, দ্বিবচন ব্যবহার করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬০৮, ইসলামিক সেন্টারঃ ৬২৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": "316.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫, আন্তর্জাতিক নাম্বারঃ ৩১৬ ৬০৫-(৩৫/৩১৬) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন অপবিত্রতা থেকে গোসল করতেন তখন প্রথমে দুই হাত ধুতেন। তারপর ডান হাত দিয়ে বাম হাতে পানি ঢেলে লজ্জাস্থান ধুতেন। তারপর সালাতের ওযুর মত ওযু করতেন। তারপর পানি নিয়ে তার আঙ্গুলগুলো চুলের গোড়ায় ঢুকাতেন। এমনিভাবে যখন মনে করতেন যে, চুল ভিজে গেছে তখন মাথায় তিন আজল (দুই হাতের তালু ভরা) পানি ঢালতেন। তারপর সমস্ত শরীরে পানি ঢেলে দিতেন। তারপর তার উভয় পা ধুয়ে ফেলতেন।\" (ইসলামিক ফাউন্ডেশনঃ ৬০৯, ইসলামিক সেন্টারঃ ৬২৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": "316.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৬, আন্তর্জাতিক নাম্বারঃ ৩১৬ ৬০৬-(.../...) কুতাইবাহ ইবনু সাঈদ, যুহায়র ইবনু হারব, আলী ইবনু হুজুর ও আবূ কুরায়ব (রহঃ) ..... হিশাম হতে অবিকল সনদে উক্ত হাদীসটি বর্ণিত আছে। তবে তাদের হাদীসে পা ধোয়ার কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৬১০, ইসলামিক সেন্টারঃ ৬২৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": "316.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৭, আন্তর্জাতিক নাম্বারঃ ৩১৬ ৬০৭-(৩৬/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অপবিত্রতা থেকে গোসলের সময় প্রথমে তার উভয় হাত কজি পর্যন্ত তিনবার ধুতেন। এরপর আবূ মুআবিয়ার হাদীসের অবিকল উল্লেখ করেন কিন্তু তিনি উভয় পা ধোয়ার কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬১১, ইসলামিক সেন্টারঃ নেই)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": "316.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৮, আন্তর্জাতিক নাম্বারঃ ৩১৬ ৬০৮-(.../...) 'আমর আন নাকিদ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন অপবিত্রতা থেকে গোসল করতেন তখন পাত্রে হাত ঢুকানোর আগে প্রথমেই তার দুই হাত ধুতেন, তারপর সালাতের ওযুর মত ওযু করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬১২, ইসলামিক সেন্টারঃ ৬২৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": "317.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৯, আন্তর্জাতিক নাম্বারঃ ৩১৭ ৬০৯-(৩৭/৩১৭) 'আলী ইবনু হুজুর আস্ সাদী (রহঃ) ..... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেছেন, আমার খালা মাইমূনাহ্ আমাকে বলেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অপবিত্রতার গোসলের জন্যে পানির পাত্র এগিয়ে দিতাম। তিনি প্রথমে দুহাতের কজি পর্যন্ত দু'বার অথবা তিনবার ধুয়ে নিলেন। তারপর পাত্রের মধ্যে হাত ঢুকিয়ে বাম হাতে লজ্জাস্থান ধুয়ে পরিষ্কার করলেন। পরে বাম হাতখানা মাটিতে খুব করে রগড়ালেন, এরপর ধুয়ে নিলেন। অতঃপর উক্তস্থান থেকে একটু সরে গিয়ে পা দু’খানা ধুলেন। অতঃপর আমি তার শরীর মোছার জন্যে কাপড় বা রুমাল নিয়ে আসলে তিনি তা ব্যবহার না করে বরং ফেরত দিলেন*। (ইসলামিক ফাউন্ডেশনঃ ৬১৩, ইসলামিক সেন্টারঃ ৬২৮) * অপবিত্র গোসলের পর রুমাল ব্যবহার করা যাবে কিনা, সাহাবাগণের তিনটি মত দেখা যায়। (১) ওযু গোসল করে রুমাল বা কাপড় ব্যবহার করা যাবে, দোষ নেই। যেমন আনাস বিন মালিক (রাযিঃ) বলেন। (২) ওযু ও গোসল করে কাপড় বা রুমাল ব্যবহার করা যাবে না। যেমন ইবনু উমর (রাযিঃ) বলেন (৩) ওযুতে রুমাল বা কাপড় ব্যবহার করা যাবে না, গোসলে ব্যবহার করা যাবে। যেমন ইবনু আব্বাস (রাযিঃ) বলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম থেকে নিখুঁতভাবে বিধান উল্লেখ নেই যে, প্রয়োজনবোধে উভয়ই রুমাল বা কাপড় ব্যবহার করা যাবে।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": "317.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১০, আন্তর্জাতিক নাম্বারঃ ৩১৭ ৬১০-(.../...) মুহাম্মাদ ইবনু সাব্বাহ, আবূ বকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব, আল আশাজ্জ ও ইসহাক প্রত্যেকেই ওয়াকী হতে এবং ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ কুরায়ব আবূ মু'আবিয়াহ হতে উভয়ে আ'মাশ হতে উক্ত সনদে হাদীসটি বর্ণনা করেন। তবে তাদের উভয়ের হাদীসে তিন আজলা পানি মাথায় ঢেলে দেয়ার কথা নেই। আর ওয়াকী’ এর হাদীসে ওযুর পূর্ণ বর্ণনা দেয়া হয়েছে। অতঃপর তিনি কুলি করা এবং নাকে পানি দেয়ার কথা তার হাদীসে বর্ণনা করেছেন। আবূ মু'আবিয়ার হাদীসে রুমালের কথা উল্লেখ নেই। (ইসলামিক ফাউন্ডেশনঃ ৬১৪, ইসলামিক সেন্টারঃ ৬২৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": "317.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১১, আন্তর্জাতিক নাম্বারঃ ৩১৭ ৬১১-(৩৮/...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... মাইমুনাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রুমাল দেয়া হল, কিন্তু তিনি তা স্পর্শ করলেন না। তিনি পানি নিয়ে এরূপ করছিলেন অর্থাৎ পানি ঝেড়ে ফেলেছিলেন। (ইসলামিক ফাউন্ডেশনঃ ৬১৫, ইসলামিক সেন্টারঃ ৬৩০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": "318",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১২, আন্তর্জাতিক নাম্বারঃ ৩১৮ ৬১২-(৩৯/৩১৮) মুহাম্মাদ ইবনু আল মুসান্না আল আনাযী (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন অপবিত্রতা থেকে গোসল করতেন তখন হিলাব এর (দুধ দোহন করার পাত্রের) মতো একটি পানির পাত্র চেয়ে নিতেন। অতঃপর এক হাত দিয়ে পানি নিয়ে প্রথমে মাথার ডান দিকে ধুয়ে ফেলতেন তারপর বাম দিক ধুতেন, তারপর উভয় হাত দিয়ে পানি নিয়ে মাথায় ঢেলে দিতেন। (ইসলামিক ফাউন্ডেশনঃ ৬১৬, ইসলামিক সেন্টারঃ ৬৩১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": "319.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৩, আন্তর্জাতিক নাম্বারঃ ৩১৯ ৬১৩-(৪০/৩১৯) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ফারাক (সাড়ে সাত কেজি) পরিমাণ পাত্রের পানি দিয়ে অপবিত্রতার গোসল করতেন*। (ইসলামিক ফাউন্ডেশনঃ ৬১৭, ইসলামিক সেন্টারঃ ৬৩২) * ইমাম নাবাবী (রহঃ) বলেনঃ ওযু এবং গোসলের জন্য পানির পরিমাণ নির্ধারিত নেই। কারণ কোন রিওয়ায়াতে গোসলের জন্য এক ফারাক (সাড়ে সাত কেজি) কোন রিওয়ায়াতে তিন মুদ। কাযী আয়ায (রহঃ) বলেন, এ রিওয়ায়াতের মুদের অর্থ 'সা' (আড়াই কেজি) তা হলে উভয় রিওয়ায়াতের মধ্যে সামঞ্জস্য বজায় থাকে। অপর এক রিওয়ায়াতে বর্ণিত হচ্ছে যে, আয়িশাহ (রাযিঃ) এক সা পানি দ্বারা গোসল করেছেন। অপর এক রিওয়ায়াতে পাঁচ মাককুফ গোসলের জন্য আর ওযুর জন্য এক মাককুফ, এ রিওয়ায়াতে মাককুফের দ্বারা মুদ উদ্দেশ্য করা হয়েছে আর মুদের পরিমাণ ১১ ছটাক। অন্য এক রিওয়ায়াতে গোসলের জন্য সা’ এবং ওযুর জন্য এক মুদের বর্ণনা করেছেন। অন্য আর এক রিওয়ায়াতে ওযুর জন্য এক মুদ এবং গোসলের জন্য এক সা থেকে পাঁচ মুদ পর্যন্ত বর্ণনা করেছেন। সুতরাং ইমাম শাফি'ঈ এবং অন্যান্য উলামায়ি কিরাম বলেন, রিওয়ায়াতের এ মতপার্থক্যের দ্বারা বুঝা যায় যে, স্থান, কাল, পাত্র কিংবা অবস্থা ভেদে পানি কিছুটা কম-বেশি হতে পারে। তবে শর্ত হচ্ছে যাতে ওযুর অঙ্গসমূহ এবং গোসলের জন্য শরীরের কোন স্থানে শুকনা না থাকে ভালভাবে ভিজে যায় বরং একটি পশমের গোড়াও যেন শুকনা না থাকে কিন্তু প্রয়োজনের অতিরিক্ত পানি ব্যবহার করা সমীচীন নয়। এমন কি নদীর কিনারায় বসে ওযু কিংবা গোসল করলেও প্রয়োজনের অতিরিক্ত পানি ব্যবহার করা যাবে না। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": "319.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৪, আন্তর্জাতিক নাম্বারঃ ৩১৯ ৬১৪-(৪১/...) কুতাইবাহ ইবনু সাঈদ, ইবনু রুমহ, আবূ বকর ইবনু আবূ শাইবাহ, ‘আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ফারাক পরিমাণ পানি দিয়ে গোসল করতেন। অনেক সময় আমি এবং তিনি একই পাত্রে গোসল করতাম। সুফইয়ানের হাদীসে বর্ণিত হয়েছে “একই পাত্র থেকে\"। কুতাইবাহ বলেন, সুফইয়ান বলেছেন, ফারাক হল তিন সা পরিমাণ*। (ইসলামিক ফাউন্ডেশনঃ ৬১৮, ইসলামিক সেন্টারঃ ৬৩৩) * ইমাম নাবাবী (রহঃ) বলেনঃ স্বামী এবং স্ত্রীর পবিত্রতার গোসল এক সঙ্গে একই পাত্রে জায়িয। এ ব্যাপারে মুসলিমদের ..... ঐকমত্য হয়েছে। অনুরূপভাবে পুরুষের ব্যবহারকৃত পানি হতে উদ্বৃত্ত পানি দ্বারা মহিলাদের গোসল জায়িয। এ বিষয়েও ঐকমত্য হয়েছে। উক্ত মহিলার ব্যবহারকৃত পানি হতে উদ্বৃত্ত পানি দ্বারা পুরুষের জন্য পবিত্রতা অর্জন করা সম্পর্কে কিছুটা মতানৈক্য থাকলেও সহীহ হাদীসের দ্বারা জারিয প্রমাণিত হয়েছে, তবে মহিলাদেরকে একটু সতর্কতার সাথে পানি ব্যবহার করা উচিত যাতে শরীরের ব্যবহারকৃত পানি পুনরায় পাত্রে পতিত না হয়, কেননা শরীরের অঙ্গ-প্রত্যঙ্গ ধোয়া পানি ব্যবহার জায়িয নয়। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": "320",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৫, আন্তর্জাতিক নাম্বারঃ ৩২০ ৬১৫-(৪২/৩২০) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... আবূ সালামাহ ইবনু আবদুর রহমান (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি এবং আয়িশাহ্ (রাযিঃ) এর দুধ ভাই একবার তার কাছে গেলাম। অতঃপর তার দুধ ভাই তাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অপবিত্রতার গোসল সম্পর্কে জিজ্ঞেস করলেন। তিনি একটি পাত্র আনালেন যা ছিল এক সা' পরিমাণ। তারপর তিনি গোসল করলেন। আমাদের এবং তার মধ্যে পর্দা ছিল। তিনি তার মাথায় তিনবার পানি ঢানলেন। আবূ সালামাহ বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রীগণ মাথার চুল কেটে রাখতেন তা ওয়াফরা এর ন্যায় হয়ে যেত (ঘাড় বরাবর লম্বা চুলই ওয়াফরা)*। (ইসলামিক ফাউন্ডেশনঃ ৬১৯, ইসলামিক সেন্টারঃ ৬৩৪) * (ওয়াফরা) ঐ চুলকে বলা হয় যা কাধ পর্যন্ত লম্বা থাকে। কাযী আয়ায বলেন, আরবের মেয়েরা মাথার চুল বেনী গেথে রাখতো। সুতরাং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রীগণ তার (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর) মৃত্যুর পর সম্ভবত এরূপ করতেন সৌন্দর্য বর্জন করার জন্য। ইমান নাবাবী (রহঃ) বলেন, কাযী আয়াযের মতো অন্যান্য উলামায়ে কিরামও বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর জীবদ্দশায় তারা এরূপ করেছেন বলে ধারণা করা যায় না।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": "321.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৬, আন্তর্জাতিক নাম্বারঃ ৩২১ ৬১৬-(৪৩/৩২১) হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন গোসল করতেন তখন ডানদিক থেকে শুরু করতেন। তিনি প্রথমেই ডান হাতে পানি ঢেলে তা ধুয়ে ফেলতেন। তারপর ডান হাত দিয়ে শরীরের যেখানে নাপাকী থাকত সেখানে পানি ঢেলে দিতেন এবং বাম হাত দিয়ে তা ধুয়ে ফেলতেন। এটা শেষ করে তিনি মাথায় পানি ঢালতেন। আয়িশাহ (রাযিঃ) বলেন, আমি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উভয়েই অপবিত্র অবস্থায় একই পাত্র থেকে (পানি নিয়ে) গোসল করতাম। (ইসলামিক ফাউন্ডেশনঃ ৬২০, ইসলামিক সেন্টারঃ ৬৩৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": "321.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৭, আন্তর্জাতিক নাম্বারঃ ৩২১ ৬১৭-(৪৪/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, তিনি এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে গোসল করতেন যাতে তিন মুদ বা তার সমপরিমাণ পানি ধরত। (ইসলামিক ফাউন্ডেশনঃ ৬২১, ইসলামিক সেন্টারঃ ৬৩৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": "321.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৮, আন্তর্জাতিক নাম্বারঃ ৩২১ ৬১৮-(৪৫/...) আবদুল্লাহ ইবনু মাসলামাহ ইবনু কানাব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে (পানি নিয়ে) গোসল করতাম। আমাদের দু'জনের হাত ভিন্ন ভিন্নভাবে তাতে লাগত। এ গোসল ছিল অপবিত্রতা থেকে। (ইসলামিক ফাউন্ডেশনঃ ৬২২, ইসলামিক সেন্টারঃ ৬৩৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": "321.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬১৯, আন্তর্জাতিক নাম্বারঃ ৩২১ ৬১৯-(৪৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র থেকে গোসল করতাম যা আমার এবং তার মাঝখানে থাকত। তিনি আমার থেকে আগে তাড়াতাড়ি করে ফেলতেন। তখন আমি বলতাম, আমার জন্যে একটু রেখে দিন, আমার জন্য একটু রেখে দিন। তিনি ['আয়িশাহ (রাযিঃ)] বলেন যে, তারা উভয়েই অপবিত্র অবস্থায় ছিলেন। (ইসলামিক ফাউন্ডেশনঃ ৬২৩, ইসলামিক সেন্টারঃ ৬৩৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": "322",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২০, আন্তর্জাতিক নাম্বারঃ ৩২২ ৬২০-(৪৭/৩২২) কুতাইবাহ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মাইমূনাহ্ (রাযিঃ) আমাকে বলেন যে, তিনি ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্রে গোসল করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬২৪, ইসলামিক সেন্টারঃ ৬৩৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": "323",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২১, আন্তর্জাতিক নাম্বারঃ ৩২৩ ৬২১-(৪৮/৩২৩) ইসহাক ইবনু ইবরাহীম (রহঃ) ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাইমুনাহ (রাযিঃ) এর উদ্ধৃত্ত পানি দিয়ে গোসল করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬২৫, ইসলামিক সেন্টারঃ ৬৪০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": "324",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২২, আন্তর্জাতিক নাম্বারঃ ৩২৪ ৬২২-(৪৯/৩২৪) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... উম্মু সালামাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, তিনি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্রে অপবিত্রতার গোসল করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬২৬, ইসলামিক সেন্টারঃ ৬৪১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": "325.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৩, আন্তর্জাতিক নাম্বারঃ ৩২৫ ৬২৩-(৫০/৩২৫) উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ও মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঁচ মাককূক পানি দিয়ে গোসল করতেন এবং এক মাককুক পানি দিয়ে ওযু করতেন। আর ইবনু আল মুসান্না বলেছেনঃ পাঁচ মাককূক দ্বারা গোসল করতেন এবং বর্ণনাকারীদের মধ্যে ইবনু মুআয আবদুল্লাহ ইবনু আবদুল্লাহ থেকে হাদীসটি বর্ণনা করেছেন। তিনি 'ইবনু জাবর' শব্দটি উল্লেখ করেননি। (মাককূক ও মুদ পৌনে এগার ছটাক পরিমাণ এবং এক সা' দু’সের এগার ছটাকের পরিমাণ) (ইসলামিক ফাউন্ডেশনঃ ৬২৭, ইসলামিক সেন্টারঃ ৬৪২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": "325.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৪, আন্তর্জাতিক নাম্বারঃ ৩২৫ ৬২৪-(৫১/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মুদ পানি দিয়ে ওযু করতেন এবং এক সা থেকে পাঁচ মুদ পর্যন্ত পানি দিয়ে গোসল করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬২৮, ইসলামিক সেন্টারঃ ৬৪৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": "326.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৫, আন্তর্জাতিক নাম্বারঃ ৩২৬ ৬২৫-(৫২/৩২৬) আবূ কামিল আল জাহদারী (রহঃ) ও 'আমর ইবনু ‘আলী (রহঃ) ..... সাফীনাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক সা পানিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর অপবিত্রতার গোসল সম্পন্ন হয়ে যেত এবং এক মুদ্ পানিতে ওযু হয়ে যেত। (ইসলামিক ফাউন্ডেশনঃ ৬২৯, ইসলামিক সেন্টারঃ ৬৪৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": "326.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৬, আন্তর্জাতিক নাম্বারঃ ৩২৬ ৬২৬-(৫৩/...) আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ও আলী ইবনু হুজুর (রহঃ) ..... সাফীনাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবা আবূ বকর (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সা' পানি দিয়ে গোসল এবং এক মুদ পানি দিয়ে পবিত্রতা অর্জন (ওযু) করতেন। আর ইবনু হুজুর তার বর্ণিত হাদীসে রয়েছে অথবা তিনি বলেছেন, এক মুদ (পানি) তাকে অপবিত্রতা থেকে পবিত্র করতেন। তিনি (আবূ রাইহানাহ) বলেনঃ সাফীনাহ অত্যন্ত বৃদ্ধ হয়ে গিয়েছিলেন। তাই আমি তার বর্ণিত হাদীসের উপর নির্ভর করতে পারি না। (ইসলামিক ফাউন্ডেশনঃ ৬৩০, ইসলামিক সেন্টারঃ ৬৪৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": "327.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৭, আন্তর্জাতিক নাম্বারঃ ৩২৭ ৬২৭-(৫৪/৩২৭) ইয়াহইয়া ইবনু ইয়াহইয়া, কুতাইবাহ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... জুবায়র ইবনু মুতাইম (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে লোকেরা গোসল নিয়ে তর্ক-বিতর্ক শুরু করল। কেউ কেউ বলল, আমি তো এ পরিমাণ পানি দিয়ে মাথা ধুয়ে থাকি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি তো আমার মাথায় তিন কোষ পানি ঢেলে থাকি*। (ইসলামিক ফাউন্ডেশনঃ ৬৩১, ইসলামিক সেন্টারঃ ৬৪৬) * ইমাম নাবাবী (রহঃ) বলেন, এ হাদীস দ্বারা বুঝা যায় যে, পবিত্রতার গোসলের সময় মাথায় তিনবার পানি ঢেলে দেয়া মুস্তাহাব, মাথার উপর ভিত্তি করে অন্যান্য অঙ্গেও তিনবার পানি ঢেলে দেয়া মুস্তাহাব। যেমন ওযুর অঙ্গসমূহ তিনবার করে ধৌত করা মুস্তাহাব। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": "327.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৮, আন্তর্জাতিক নাম্বারঃ ৩২৭ ৬২৮-(৫৫/...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... জুবায়র ইবনু মুতাইম (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একবার অপবিত্রতা থেকে গোসলের আলোচনা করা হলে তিনি বললেন, আমি তো আমার মাথায় তিনবার পানি ঢেলে দেই। (ইসলামিক ফাউন্ডেশনঃ ৬৩২, ইসলামিক সেন্টারঃ ৬৪৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": "328",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬২৯, আন্তর্জাতিক নাম্বারঃ ৩২৮ ৬২৯-(৫৬/৩২৮) ইয়াহইয়া ইবনু ইয়াহইয়া ও ইসমাঈল ইবনু সালিম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। (তিনি বলেছেন) সাকীফ গোত্রের প্রতিনিধি দল এসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলঃ আমাদের এলাকাটি অত্যন্ত শীতপ্রধান, সেখানে আমরা (অপবিত্রতার) গোসল কিভাবে করব? তিনি বললেন, আমি তো আমার মাথায় তিনবার পানি ঢেলে থাকি। ইবনু সালিম হুশায়ম ও আবূ বিশর এর মাধ্যমে তার বর্ণিত হাদীসে বলেছেন, সাকীফ গোত্রের প্রতিনিধি দল এসে 'হে আল্লাহর রাসূল' বলে সম্বোধন করে বলেছিল। (ইসলামিক ফাউন্ডেশনঃ ৬৩৩, ইসলামিক সেন্টারঃ ৬৪৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": "329",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩০, আন্তর্জাতিক নাম্বারঃ ৩২৯ ৬৩০-(৫৭/৩২৯) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। (তিনি বলেছেন) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অপবিত্রতার গোসল করার সময় মাথায় তিন আঁজলা পানি ঢালতেন। হাসান ইবনু মুহাম্মদ তাকে (জাবিরকে) বললেন, আমার মাথায় তো চুল অনেক (কাজেই এটুকু পানি তো আমার জন্যে যথেষ্ট নয়) জবাবে জাবির বললেন, ভাতিজা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাথায় চুল তোমার চেয়ে অনেক বেশি এবং উত্তম ও পরিচ্ছন্ন ছিল। (ইসলামিক ফাউন্ডেশনঃ ৬৩৪, ইসলামিক সেন্টার, ৬৪৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": "330.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩১, আন্তর্জাতিক নাম্বারঃ ৩৩০ ৬৩১-(৫৮/৩৩০) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললাম, হে আল্লাহর রাসূল! আমি তো মাথায় চুলের বেনী গেঁথে থাকি। সুতরাং অপবিত্রতার গোসলের সময় কি আমি তা খুলব? তিনি বললেন, না। বরং তোমার জন্যে এটাই যথেষ্ট যে, তুমি মাথার ওপর তিন আজলা পানি ঢেলে দিয়ে। অতঃপর সারা শরীরে পানি ঢেলে দিয়ে পবিত্র হয়ে যাবে*। (ইসলামিক ফাউন্ডেশনঃ ৬৩৫, ইসলামিক সেন্টারঃ ৬৫০) * উম্মু সালামাহ এবং আয়িশাহ (রাযীঃ) বর্ণিত হাদীস দ্বারা বোঝা গেল যে, মহিলাদের পবিত্রতার গোসলের সময় চুলের বেনী খোলা জরুরী নয়।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": "330.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩২, আন্তর্জাতিক নাম্বারঃ ৩৩০ ৬৩২-(.../...) 'আমর আন নাকিদ ও আবদ ইবনু হুমায়দ (রহঃ) এর সূত্রে এ সনদে উক্ত হাদীসটি বর্ণিত আছে। আবদুর রাযযাকের হাদীসে রয়েছে যে, “আমি কি তা হায়িয ও অপবিত্রতা থেকে গোসলের জন্যে খুলব? তিনি বললেন, না\"। এরপর ইবনু উয়াইনার (উপরোক্ত) হাদীসের অনুরূপ। (ইসলামিক ফাউন্ডেশনঃ ৬৩৬, ইসলামিক সেন্টারঃ ৬৫১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": "330.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৩, আন্তর্জাতিক নাম্বারঃ ৩৩০ ৬৩৩-(.../....) আহমাদ ইবনু সাঈদ আদ দারিমী (রহঃ) এর সূত্রে আইয়ুব ইবনু মূসা (রাযিঃ) হতে এ সূত্রে হাদীসটি বর্ণিত আছে। সেখানে উল্লেখ আছে যে, “আমি কি তা খুলে অপবিত্রতা থেকে গোসল করব?\" সেখানে তিনি হায়িযের কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬৩৭, ইসলামিক সেন্টারঃ ৬৫২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": "331",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৪, আন্তর্জাতিক নাম্বারঃ ৩৩১ ৬৩৪-(৫৯/৩৩১) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু শাইবাহ ও আলী ইবনু হুজুর (রহঃ) ..... উবায়দ ইবনু উমায়র (রহঃ) হতে বর্ণিত। তিনি বলেছেন, 'আয়িশাহ (রাযিঃ) এর নিকটে খবর পৌছল যে, 'আবদুল্লাহ ইবনু আমর স্ত্রীলোকদেরকে গোসলের সময় তাদের মাথার চুল (বেনী) খোলার আদেশ দিয়ে থাকেন। এ কথা জানার পর আয়িশাহ (রাযিঃ) বললেন, আশ্চর্য লাগে ইবনু আমর (রাযিঃ) এর মতো লোক মেয়েদেরকে গোসলের সময় মাথার চুল খোলার আদেশ করেন। তাহলে তো তিনি তাদেরকে মাথার চুল মুড়ে ফেলার আদেশ দিতে পারেন। অথচ আমি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সাথে একই পাত্র থেকে পানি নিয়ে অপবিত্রতার গোসল করেছি। এ সময় আমি আমার মাথায় তিন কোষ (দুই হাতের তালুর) অধিক পানি ঢালিনি। (ইসলামিক ফাউন্ডেশনঃ ৬৩৮, ইসলামিক সেন্টারঃ ৬৫৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": "332.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৫, আন্তর্জাতিক নাম্বারঃ ৩৩২ ৬৩৫-(৬০/৩৩২) আমর ইবনু মুহাম্মাদ আন নাকিদ ও ইবনু আবূ উমর (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে জিজ্ঞেস করল যে, কিভাবে সে তার হায়িয থেকে গোসল করবে? হাদীসের রাবী বলেন, আয়িশাহ্ (রাযিঃ) উল্লেখ করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভদ্রমহিলাকে সে কিভাবে গোসল করবে, তা শিখিয়ে দিলেন তারপর সুগন্ধযুক্ত কাপড় বা তুলা ব্যবহার করবে এবং তা দ্বারা পবিত্রতা অর্জন করবে। সে বলল, এ সুগন্ধ যুক্ত কাপড় দ্বারা আমি কিভাবে পবিত্রতা অর্জন করব? তিনি বললেন, তা দ্বারা পবিত্রতা অর্জন করবে। তিনি বললেন, সুবহানাল্লাহ! (এত সোজা কথাও বুঝ না)। এরপর তিনি (মুখ) সরিয়ে নিলেন। (রাবী বলেন) সুফইয়ান ইবনু উয়াইনাহ নিজ মুখের ওপর হাত দিয়ে আমাদেরকে ইশারা করে দেখালেন। আয়িশাহ (রাযিঃ) বলেন, আমি তাকে আমার দিকে টেনে আনলাম। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কী বুঝাতে চাচ্ছেন তা আমি বুঝে ফেললাম। অতঃপর আমি (মহিলাটিকে) বললাম, তুমি তা (সুগন্ধযুক্ত কাপড় বা তুলা) রক্তের স্থানে (লজ্জাস্থানে) বুলিয়ে নিবে। ইবনু উমার তার বর্ণিত হাদীসে বলেছেন, তিনি বলেনঃ আমি বললাম, রক্তের স্থানে সুগন্ধযুক্ত কাপড়টি বুলিয়ে দিন। (ইসলামিক ফাউন্ডেশনঃ ৬৩৯, ইসলামিক সেন্টারঃ ৬৫৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": "332.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৬, আন্তর্জাতিক নাম্বারঃ ৩৩২ ৬৩৬-(.../...) আহমাদ ইবনু সাঈদ আদ দারিমী (রহঃ) ... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করল যে, আমি তুহুর-এর (হায়িয থেকে পবিত্রতার) সময় কিভাবে গোসল করব তিনি বললেন, এক টুকরো সুগন্ধযুক্ত কাপড় বা তুলা নিবে তারপর তা দ্বারা পবিত্রতা অর্জন করবে। এরপর সুফইয়ানের হাদীসের অনুরূপ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশনঃ ৬৪০, ইসলামিক সেন্টারঃ ৬৫৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": "332.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৭, আন্তর্জাতিক নাম্বারঃ ৩৩২ ৬৩৭-(৬১/...) মুহাম্মাদ ইবনু আল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। একদা আসমা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে হায়িযের গোসল সম্পর্কে জিজ্ঞেস করল। তিনি বললেন, তোমাদের কেউ পানি এবং বরই এর পাতা নিয়ে সুন্দরভাবে পবিত্রতা অর্জন করবে। তারপর মাথায় পানি ঢেলে দিয়ে ভালভাবে নাড়াচড়া করবে যাতে পানি সমস্ত চুলের গোড়া পর্যন্ত পৌছে যায়। তারপর তার উপর পানি ঢেলে দিবে। তারপর সুগন্ধযুক্ত কাপড় নিয়ে তার দ্বারা পবিত্রতা অর্জন করবে। আসমা বলল, তা দিয়ে সে কিভাবে পবিত্রতা অর্জন করবে? তিনি বললেন, সুবহানাল্লাহ! তা দিয়ে পবিত্রতা অর্জন করবে। অতঃপর আয়িশাহ (রাযিঃ) তাকে যেন চুপি চুপি বলে দিলেন, রক্ত বের হবার জায়গায় তা বুলিয়ে দিবে। সে অপবিত্রতার গোসল সম্পর্কেও জিজ্ঞেস করল। তিনি বললেন, পানি নিয়ে তার দ্বারা সুন্দরভাবে পবিত্রতা অর্জন করবে। তারপর মাথায় পানি ঢেলে দিয়ে ভাল করে নাড়াচড়া করবে যাতে চুলের গোড়ায় পানি পৌছে যায়। তারপর সমস্ত শরীরে পানি ঢেলে দিবে। আয়িশাহ (রাযিঃ) বললেন, আনসারদের মহিলারা কত ভাল লজ্জা তাদেরকে দীন এর জ্ঞান থেকে ফিরিয়ে রাখে না। (ইসলামিক ফাউন্ডেশনঃ ৬৪১, ইসলামিক সেন্টারঃ ৬৫৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": "332.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৮, আন্তর্জাতিক নাম্বারঃ ৩৩২ ৬৩৮-(.../...) উবাইদুল্লাহ ইবনু মুআয (রহঃ) .... শুবাহ হতে অবিকল বর্ণিত হয়েছে। তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সুবহানাল্লাহ! তা দ্বারা পবিত্রতা লাভ করবে। অতঃপর তিনি আড়াল করলেন। (ইসলামিক ফাউন্ডেশনঃ ৬৪২, ইসলামিক সেন্টারঃ ৬৫৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": "332.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৩৯, আন্তর্জাতিক নাম্বারঃ ৩৩২ ৬৩৯-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ..... ‘আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আসমা বিনতু শাকাল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, ইয়া রাসূলাল্লাহ! আমাদের কেউ যখন হায়িয থেকে পবিত্র হবে তখন সে কিভাবে গোসল করবে? এরপর পূর্বোক্ত হাদীসের অনুরূপ বর্ণনা করেছেন। তবে এ হাদীসটির মধ্যে অপবিত্রতার গোসলের কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬৪৩, ইসলামিক সেন্টারঃ ৬৫৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": "333.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪০, আন্তর্জাতিক নাম্বারঃ ৩৩৩ ৬৪০-(৬২/৩৩৩) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) বলেন, ফাতিমা বিনতু আবূ হুবায়শ নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে এসে বলল, হে আল্লাহর রাসূল! আমি একজন ইসতিহাযাহ বা রক্তপ্রদর রোগগ্রস্ত নারী। কখনো এ রোগ থেকে মুক্ত হই না। তাই আমি এ সালাত আদায় করা কি ছেড়ে দিব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তাকে বললেনঃ না, তুমি সালাত আদায় ছাড়বে না। কেননা, এ হায়িয না বরং একটি শিরা-নিঃসৃত রক্ত। তাই যখন হায়িয দেখা দিবে তখন শুধু সালাত আদায় করবে না। আর যখন হায়িয ভাল হয়ে যাবে তখন রক্ত ধুয়ে ফেলে গোসল করে পবিত্র হয়ে সালাত আদায় করবে। (ইসলামিক ফাউন্ডেশনঃ ৬৪৪, ইসলামিক সেন্টারঃ ৬৫৯) * ইসতিহাযাহ বলা হয় ঐ রক্তকে যা হায়িয ও নিফাসের নির্দিষ্ট সময় ব্যতীত মহিলাদের লজ্জাস্থান দিয়ে রক্ত বের হয়। এ রক্ত একটি রগ থেকে বের হয়ে থাকে যাকে আদিল বলা হয়। আর হায়িযের রক্ত জরায়ুর ভিতর থেকে বের হয়। ইসতিহাযার রক্ত সাধারণত লাল কিংবা হলদে অথবা মেটে রং হয় এবং হায়িযের রক্ত স্বভাবত কালচে রং হয়। সুতরাং রক্তের প্রতি বিশেষভাবে লক্ষ্য রাখলে উভয়ের মধ্যে পার্থক্য বুঝা যায়। ইসতিহাযাহ রোগাক্রান্ত মহিলা সুস্থ মহিলার মত সালাত, সওম, ইতিকাফ, কুরআন মাজীদ তিলাওয়াত সহ যাবতীয় ইবাদাত বন্দেগী করতে পারবে। তবে প্রত্যেক ওয়াক্তের সালাতের প্রারম্ভে ওযু কর নিবে। আর যখন সালাত আদায় করার নিয়্যাত করবে তখন লজ্জাস্থান ধুয়ে ফেলবে এবং উক্তস্থানে এক টুকরো কাপড়, তুলা লাগিয়ে রাখবে। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": "333.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪১, আন্তর্জাতিক নাম্বারঃ ৩৩৩ ৬৪১-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জারীর (রাযিঃ) থেকে বর্ণিত। ফাতিমা বিনতু আবূ হুবায়শ ইবনু আবদুল মুত্তালিব ইবনু আসাদ যিনি আমাদের বংশের একজন মহিলা ছিলেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। আর হাম্মাদ ইবনু যায়দ এর হাদীসে একটা অক্ষর অতিরিক্ত ছিল, আমরা তা উল্লেখ করিনি। (ইসলামিক ফাউন্ডেশনঃ ৬৪৫, ইসলামিক সেন্টারঃ ৬৬০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": "334.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪২, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪২-(৬৩/৩৩৪) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উম্মু হাবীবাহ বিনতু জাহশ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে মাসআলা জানতে চেয়ে বলল, আমার ইসতিহাযাহ হয়েছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ওটা হল একটা রগের (ধমনী) রক্ত। তাই তুমি গোসল করে ফেলবে তারপর সালাত আদায় করবে। এরপর সে প্রতি সালাতের সময়ই গোসল করত। রাবী লায়স ইবনু সা'দ বলেন, ইবনু শিহাব এ কথা উল্লেখ করেননি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু হাবীবাহকে প্রত্যেক সালাতের সময়ই গোসলের নির্দেশ দিয়েছিলেন। বরং এটা সে নিজের থেকেই করত। ইবনু রূমহ তার বর্ণনায় জাহশের কন্যার কথা বলেছেন, উম্মু হাবীবার নাম উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬৪৬, ইসলামিক সেন্টারঃ ৬৬১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": "334.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৩, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪৩-(৬৪/...) মুহাম্মাদ ইবনু সালামাহ আল মুরাদী (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শ্যালিকা এবং আবদুর রহমান ইবনু আওফ এর স্ত্রী হাবীবাহ বিনতু জাহশ সাত বৎসর যাবৎ ইসতিহাযার রোগী ছিলেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর কাছে এ ব্যাপারে মাসআলা জানতে চাইলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এটা হায়িয নয়; বরং ধমনীর (রগের) রক্ত। তাই তুমি গোসল করে ফেল এবং সালাত আদায় কর। আয়িশাহ (রাযিঃ) বলেন, এরপর তিনি তার বোন যাইনাব বিনতু জাহশ এর ঘরে একটি পাত্রের মধ্যে বসে গোসল করতেন। এমনকি পানি রক্তে লাল হয়ে যেত। ইবনু শিহাব বলেন, আমি এ হাদীসটি আবূ বকর ইবনু আবদুর রহমান ইবনুল হারিস ইবনু হিশাম এর কাছে বর্ণনা করলাম। তিনি বললেন, আল্লাহ তা'আলা হিন্দ এর ওপর রহমত করুন। সে যদি এ ফাতাওয়া (মাসআলাহ) শুনতে পেত। আল্লাহর কসম! সে শুধু কাঁদত। কারণ সে সালাত আদায় করত না (এ মাসআলা তার জানা ছিল না। ফলে সালাত আদায় করতে না পারার কারণে কাঁদত)। (ইসলামিক ফাউন্ডেশনঃ ৬৪৭, ইসলামিক সেন্টারঃ ৬৬২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": "334.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৪, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪৪-(.../...) আবূ ইমরান মুহাম্মাদ ইবনু জা'ফার ইবনু যিয়াদ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উম্মু হাবীবাহ বিনতু জাহশ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলো। আর সাত বৎসর ধরে তার ইসতিহাযাহ চলছিল। এরপর রাবী আবূ ইমরান আমর ইবনুল হারিসের হাদীসের অনুরূপ \"এমনকি পানি রক্তে লাল হয়ে যেত\" পর্যন্ত বর্ণনা করেন এর পরবর্তী অংশ তিনি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬৪৮, ইসলামিক সেন্টারঃ ৬৬৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": "334.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৫, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪৫-(.../...) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। জাহশ এর কন্যার সাত বৎসর যাবৎ ইসতিহাযাহ ছিল। এরপর পূর্বোক্ত হাদীসের অনুরূপ বর্ণিত। (ইসলামিক ফাউন্ডেশনঃ ৬৪৯, ইসলামিক সেন্টারঃ ৬৬৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": "334.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৬, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪৬-(৬৫/...) মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উম্মু হাবীবাহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রক্ত সম্পর্কে জিজ্ঞেস করল। এরপর আয়িশাহ (রাযিঃ) বলেন, আমি তার পাত্র দেখেছি রক্তে পরিপূর্ণ। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তোমার হায়িয যে কয়দিন হয়, সে কয়দিন পরিমাণ তুমি অপেক্ষা কর। তারপর গোসল করে ফেল এবং সালাত আদায় কর। (ইসলামিক ফাউন্ডেশনঃ ৬৫০, ইসলামিক সেন্টারঃ ৬৬৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": "334.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৭, আন্তর্জাতিক নাম্বারঃ ৩৩৪ ৬৪৭-(৬৬/...) মূসা ইবনু কুরায়শ আত তামীমী (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেছেন, 'আবদুর রহমান ইবনু আওফ এর স্ত্রী উম্মু হাবীবাহ বিনতু জাহশ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে তার রক্ত প্রদরের অসুবিধার কথা বলল। তিনি তাকে বললেনঃ তুমি তোমার মাসিক ঋতুর মেয়াদ পরিমাণ অপেক্ষা কর (অর্থাৎ) এ সময়ে সালাত আদায় করবে না। এ সময় পার হলে তুমি গোসল করবে এরং সালাত আদায় করবে। তাই তিনি প্রত্যেক সালাতের সময়ই গোসল করতেন*। (ইসলামিক ফাউন্ডেশনঃ ৬৫১, ইসলামিক সেন্টারঃ ৬৬৬) (১)- হায়য অবস্থায় সালাত মাফ এবং সওমের কাযা করতে হয়। এটা পরম করুণাময় আল্লাহর বিশেষ অনুগ্রহ তা না হলে সালাতের কাযা করতে মহিলাদের বিশেষ কষ্ট হতো। সালাত দৈনিক পাঁচবার পড়তে হয় বিধায় বছরের বহু সালাতের কাযা করতে হতো। আর সওম বছরে একবার মাত্র। সুতরাং ৫/৭ দিন সওম কায করা কোন কঠিন কিছু নয়। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": "335.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৮, আন্তর্জাতিক নাম্বারঃ ৩৩৫ ৬৪৮-(৬৭/৩৩৫) আবূ রাবী' আয যাহরানী ও হাম্মদ (রহঃ) ..... মুআযাহ্ (রহঃ) থেকে বর্ণিত। জনৈক মহিলা আয়িশাহ (রাযিঃ) কে প্রশ্ন করল, আমাদের কেউ কি তার হায়িযের দিনগুলোর সালাত কাযা করবে? আয়িশাহ (রাযিঃ) বললেন, তুমি কি হারূরিয়্যাহ’* (খারিজীয়া)? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমাদের কারো হায়িয হলে পরে তাকে (সালাত) কাযা করার নির্দেশ দেয়া হতো না। (ইসলামিক ফাউন্ডেশনঃ ৬৫২, ইসলামিক সেন্টারঃ ৬৬৭) * (হরূরী) হারূরা কুফা নগরের নিকটবর্তী একটি গ্রামের নাম। প্রথমে খারিজীরা এ গ্রামে এসে একত্রিত ছিল এজন্য তাদেরকে হারুরী বলা হয়েছে। এ খারিজীরা সহীহ হাদীস এবং মুসলিমদের ঐকমত্যের বিরোধিতা করে বলে হায়িযা অর্থাৎ ঋতুবতী মহিলাদের সালাত কাযা করতে হবে। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": "335.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৪৯, আন্তর্জাতিক নাম্বারঃ ৩৩৫ ৬৪৯-(৬৮/...) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... মুআযাহ (রহঃ) থেকে বর্ণিত। তিনি 'আয়িশাহ (রাযিঃ) কে প্রশ্ন করলেন, ঋতুবতী মহিলা কি সালাত কাযা করবে? আয়িশাহ (রাযিঃ) বললেন, তুমি কি হারূরিয়্যাহ? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এর পত্নীগণের হায়িয হত, তিনি কি তাদেরকে (সালাত) কাযা করার হুকুম দিয়েছেন? মুহাম্মদ ইবনু জাফার বলেনঃ এর অর্থ সালাত কাযা করা। (ইসলামিক ফাউন্ডেশনঃ ৬৫৩, ইসলামিক সেন্টারঃ ৬৬৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": "335.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫০, আন্তর্জাতিক নাম্বারঃ ৩৩৫ ৬৫০-(৬৯/...) আবদ ইবনু হুমায়দ (রহঃ) ..... মুআযাহ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে প্রশ্ন করলাম, ঋতুবতী মহিলা সওম কাযা করবে এবং সালাত কাযা করবে না এটা কেমন কথা? তিনি বললেন, তুমি কি হারূরিয়্যাহ? আমি বললাম, আমি হারূরিয়্যাহ নই; বরং আমি (জানার জন্যই কেবল) জিজ্ঞেস করছি। তিনি 'আয়িশাহ (রাযিঃ) বললেন, আমাদের এরূপ হত। তখন আমাদেরকে কেবল সওম কাযা করার নির্দেশ দেয়া হত, সালাত কাযা করার নির্দেশ দেয়া হত না। (ইসলামিক ফাউন্ডেশনঃ ৬৫৪, ইসলামিক সেন্টারঃ ৬৬৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": "336.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫১, আন্তর্জাতিক নাম্বারঃ ৩৩৬ ৬৫১-(৭০/৩৩৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... উম্মু হানী (রাযিঃ) বিনতু আবূ তালিব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মক্কা বিজয়ের বছর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম। তখন আমি তাকে এ অবস্থায় পেলাম যে, তিনি গোসল করছিলেন, আর তার কন্যা ফাতিমা একটি কাপড় দিয়ে তাকে আড়াল করে রেখেছিল*। (ইসলামিক ফাউন্ডেশনঃ ৬৫৫, ইসলামিক সেন্টারঃ ৬৭০) * ইমাম নাবাবী (রহঃ) বলেনঃ প্রয়োজনের সময় গুপ্তাঙ্গ খোলা জায়িয, যেমন নির্জনে গোসল করার সময়, প্রস্রাব করার সময়, স্ত্রী সহবাসের সময়। কিন্তু লোক সম্মুখে গুপ্তাঙ্গ খোলা কখনও বৈধ নয়। অন্যান্য উলামায়ে কিরাম বলেন, নির্জনে গোসলের সময়ও লুঙ্গী পরে থাকা মুস্তাহাব। তবে প্রয়োজনে উলঙ্গ হয়ে গোসল করাও বৈধ আছে। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": "336.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫২, আন্তর্জাতিক নাম্বারঃ ৩৩৬ ৬৫২-(৭১/...) মুহাম্মাদ ইবনু রুমহ ইবনু আল মুহাজির (রহঃ) ..... উম্মু হানী বিনতু আবূ তালিব (রাযিঃ) থেকে বর্ণিত। মক্কা বিজয়ের বছর তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। তিনি তখন মক্কার উচু এলাকায় অবস্থান করছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গোসল করতে গেলে ফাতিমা তাকে আড়াল করেন। এরপর তিনি নিজের কাপড় নিয়ে পরিধান করলেন। তারপর আট রাকাআত চাশতের সালাত আদায় করলেন। (ইসলামিক ফাউন্ডেশনঃ ৬৫৬, ইসলামিক সেন্টারঃ ৬৭১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": "336.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৩, আন্তর্জাতিক নাম্বারঃ ৩৩৬ ৬৫৩-(৭২/...) আবূ কুরায়ব (রহঃ) ..... সাঈদ ইবনু আবূ হিন্দ (রাযিঃ) হতে এ সূত্রে বর্ণিত। অতঃপর তিনি বলেন, এরপর তার কন্যা ফাতিমা তার কাপড় দিয়ে তাকে আড়াল করে রেখেছিল। গোসল শেষে তিনি ঐ কাপড় নিয়ে পরিধান করলেন। তারপর দাঁড়িয়ে আট রাকাআত সালাত আদায় করলেন। আর সেটা ছিল চাশতের সময়। (ইসলামিক ফাউন্ডেশনঃ ৬৫৭, ইসলামিক সেন্টারঃ ৬৭২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": "337",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৪, আন্তর্জাতিক নাম্বারঃ ৩৩৭ ৬৫৪-(৭৩/৩৩৭) ইসহাক ইবনু ইবরাহীম আল হানযালী (রহঃ) ..... মাইমুনাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্যে পানি রাখলাম এবং তাকে আড়াল করলাম। এরপর তিনি গোসল করলেন। (ইসলামিক ফাউন্ডেশনঃ ৬৫৮, ইসলামিক সেন্টারঃ ৬৭৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": "338.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৫, আন্তর্জাতিক নাম্বারঃ ৩৩৮ ৬৫৫-(৭৪/৩৩৮) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কোন পুরুষ অপর পুরুষের লজ্জাস্থানের দিকে তাকাবে না এবং কোন মহিলা অপর মহিলার লজ্জাস্থানের দিকে তাকাবে না; কোন পুরুষ অপর পুরুষের সাথে এক কাপড়ের নীচে (উলঙ্গ অবস্থায়) ঘুমাবে না এবং কোন মহিলা অপর মহিলার সাথে একই কাপড়ের নীচে ঘুমাবে না*।(ইসলামিক ফাউন্ডেশনঃ ৬৫৯, ইসলামিক সেন্টারঃ ৬৭৪) * \"কোন পুরুষ অপর পুরুষের সাথে এক কাপড়ের নিচে ঘুমাবে না এবং কোন মহিলা অপর মহিলার সাথে একই কাপড়ের নীচে ঘুমাবে না।\" এর দ্বারা উদ্দেশ্য উভয়ের উলঙ্গ অবস্থায় যখন শরীরে কোন প্রকার কাপড় থাকবে না। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": "338.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৬, আন্তর্জাতিক নাম্বারঃ ৩৩৮ ৬৫৬-(../...) হারূন ইবনু 'আবদুল্লাহ ও মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... যাহহাক ইবনু উসমান (রহঃ) এর সূত্রে উক্ত সনদে হাদীসটি বর্ণনা করেছেন। তারা উভয়েই عَوْرَةِ এর স্থলে عُرْيَةِ এর উল্লেখ করেছেন। অর্থাৎ- উলঙ্গ অবস্থায় পুরুষ পুরুষের দিকে এবং নারী নারীর দিকে তাকাতে পারবে না এবং একই বিছানায় ঘুমাবে না। (ইসলামিক ফাউন্ডেশনঃ ৬৬০, ইসলামিক সেন্টারঃ ৬৭৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": "339",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৭, আন্তর্জাতিক নাম্বারঃ ৩৩৯ ৬৫৭-(৭৫/৩৩৯) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনব্বিহ্ (রহঃ) থেকে বর্ণিত। তিনি কয়েকটি হাদীসের উল্লেখ করে বলেন, এগুলো আবূ হুরাইরাহ (রাযিঃ) মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমার কাছে বর্ণনা করেছেন। তন্মধ্যে একটি হল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, বনী ইসরাঈলগণ উলঙ্গ হয়ে গোসল করত একে অপরের লজ্জাস্থানের দিকে দেখত। আর মূসা (আঃ) গোসল করতেন একাকী। তাই তারা বলাবলি করত, আল্লাহর কসম! মূসা আমাদের সাথে গোসল করে না কারণ তার একশিরা রোগ হয়েছে। একবার তিনি গোসল করতে গিয়ে একটি পাথরের ওপর তার কাপড় রাখলেন। এরপর পাথরটি তার কাপড় নিয়ে দৌড়াতে লাগল। রাবী বলেন, মূসা (আঃ) তার পিছু পিছু ছুটলেন আর বলতে লাগলেন, পাথর! আমার কাপড়, পাথর! আমার কাপড়। এমনিভাবে বনী ইসরাঈলগণ মূসা (আঃ)-এর লজ্জাস্থান দেখে ফেলল এবং তারা বলল, আল্লাহর কসম! মূসার তো কোন খুঁত নেই। এরপর পাথর দাঁড়িয়ে গেল এবং তাকে দেখে নিল। রাবী বলেন, এরপর তিনি তার কাপড় তুলে নিলেন এবং (রাগে) পাথরকে মারতে শুরু করে দিলেন। আবূ হুরাইরাহ (রাযিঃ) বলেন, আল্লাহর কসম! পাথরের ওপর মূসা (আঃ) এর আঘাতের ছয়টি কি সাতটি চিহ্ন রয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৬৬১, ইসলামিক সেন্টারঃ ৬৭৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": "340.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৮, আন্তর্জাতিক নাম্বারঃ ৩৪০ ৬৫৮-(৭৬/৩৪০) ইসহাক ইবনু ইবরাহীম আল হানযালী, মুহাম্মাদ ইবনু হাতিম ইবনু মাইমূন ও ইসহাক ইবনু মানসূর ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন কা'বাহ তৈরি করা হচ্ছিল তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আব্বাস (রাযিঃ) পাথর বয়ে নিয়ে যাচ্ছিলেন। আব্বাস (রাযিঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে বললেন, পাথর বহনের সুবিধার্থে তোমার লুঙ্গি কাঁধের উপর তুলে নাও। এরপর তিনি এরূপ করলেন। সাথে সাথেই তিনি (বেহুশ হয়ে) মাটিতে পড়ে গেলেন। আর তার উভয় চোখ আকাশের দিকে নিবদ্ধ হল। তারপর তিনি দাঁড়িয়ে বললেন, আমার লুঙ্গি আমার লুঙ্গি। এরপর তার লুঙ্গি পরিয়ে দেয়া হল। ইবনু রাফি তার রিওয়ায়াতে কাঁধের স্থলে ঘাড়ের উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৬২, ইসলামিক সেন্টারঃ ৬৭৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": "340.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৫৯, আন্তর্জাতিক নাম্বারঃ ৩৪০ ৬৫৯-(৭৭/...) যুহায়র ইবনু হারব (রহঃ)... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সাথে কা'বাহ মেরামতের জন্যে পাথর বয়ে নিচ্ছিলেন। আর তার পরনে ছিল লুঙ্গি। এরপর তার চাচা আব্বাস (রাযিঃ) তাকে বললেন, ভাতিজা! তোমার লুঙ্গি খুলে যদি কাঁধের উপর পাথরের নিচে রেখে নিতে (তাহলে ভাল হত)। তিনি লুঙ্গি খুলে তার কাঁধের ওপর রাখলেন। সাথে সাথেই তিনি বেহুশ হয়ে পড়ে গেলেন। জাবির (রাযিঃ) বলেন, সেদিনের পর থেকে আর কখনো তাকে উলঙ্গ দেখা যায়নি। (ইসলামিক ফাউন্ডেশনঃ ৬৬৩, ইসলামিক সেন্টারঃ ৬৭৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": "341",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬০, আন্তর্জাতিক নাম্বারঃ ৩৪১ ৬৬০-(৭৮/৩৪১) সাঈদ ইবনু ইয়াহইয়া আল উমাবী (রহঃ) ..... মিসওয়ার ইবনু মাখরামাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একটি ভারী পাথর বয়ে নিয়ে যাচ্ছিলাম। আর তখন আমার পরনে ছিল একটি পাতলা লুঙ্গি। তিনি বলেন, এরপর আমার লুঙ্গি খুলে গেল। পাথরটি তখন আমার কাছে ছিল। তাই আমি লুঙ্গি তুলে নিতে পারলাম না। এমনিভাবে আমি পাথরটি যথাস্থানে নিয়ে গেলাম। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার কাপড়ের কাছে ফিরে গিয়ে তা নিয়ে এসো। আর কখনো উলঙ্গ হয়ে চলবে না। (ইসলামিক ফাউন্ডেশনঃ ৬৬৪, ইসলামিক সেন্টারঃ ৬৭৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": "342",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬১, আন্তর্জাতিক নাম্বারঃ ৩৪২ ৬৬১-(৭৯/৩৪২) শাইবান ইবনু ফাররূখ (রহঃ) ..... 'আবদুল্লাহ ইবনু জাফার (রাযিঃ) হতে বর্ণিত। তিনি বলেছেন, একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে তার সওয়ারীর পিছন দিকে বসালেন এবং আমাকে চুপে চুপে এমন একটি কথা বললেন যা আমি কাউকে কখনও বলব না। তবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রাকৃতিক প্রয়োজন সমাধা করার সময় উঁচু টিলা অথবা ঘন গাছগাছালির দ্বারা ঢাকা স্থানকে সবচেয়ে বেশী পছন্দ করতেন। ইবনু আসমা তার বর্ণিত হাদীসে বলেছেন, অর্থাৎ খেজুর বাগানের আড়ালে মানবীয় প্রয়োজন সমাধা করাটাই বেশি পছন্দ করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬৬৫, ইসলামিক সেন্টারঃ ৬৮০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": "343.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬২, আন্তর্জাতিক নাম্বারঃ ৩৪৩ ৬৬২-(৮০/৩৪৩) ইয়াহইয়াহ ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুর রহমান ইবনু আবূ সাঈদ আল খুদরী (রাযিঃ) তার পিতা আবূ সাঈদ আল খুদরী বলেছেন, কোন এক সোমবারে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কুবা এলাকার দিকে গেলাম। আমরা বানু সালিম গোত্রের মহল্লায় পৌছলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতবান এর বাড়ীর গেইটে দাঁড়ালেন এবং তাকে উচ্চস্বরে ডাকলেন। তৎক্ষণাৎ তিনি পরনের লুঙ্গি হেঁচড়াতে হেঁচড়াতে বের হয়ে আসলেন। এ অবস্থা দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমরা কি লোকটিকে তাড়াহুড়োয় ফেলে দিলাম? তখন ইতবান বললেন, হে আল্লাহর রাসূল! যদি কোন ব্যক্তি তার স্ত্রীর সাথে সহবাসের সময় তাড়াহুড়ো করে এবং তাতে বীর্যপাত না হয় তখন তাকে কি করতে হবে? (অর্থাৎ তাকে গোসল করতে হবে কিনা?) জবাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, বস্তুত বীর্যপাত ঘটলেই গোসল করতে হবে*। (ইসলামিক ফাউন্ডেশনঃ ৬৬৬, ইসলামিক সেন্টারঃ ৬৮১) * \"বস্তুতঃ বীর্যপাত ঘটলেই গোসল করতে হবে।” এ কথায় ব্যাখ্যায় ইমাম নাবাবী (রহঃ) বলেন, সহবাস করলেই গোসল ফরয হয়ে যায়। এ ব্যাপারে উম্মতের ইজমা (ঐকমত্য) হয়েছে। সহবাসের দ্বারা বীর্যপাত হোক বা না হোক শুধুমাত্র পুরুষের যৌনাঙ্গের অগ্রভাগ মহিলার গুপ্তাঙ্গে প্রবেশ করলেই গোসল করতে হবে। \"বীর্যপাত ঘটলেই গোসল করতে হবে\" এ হাদীস মানসুখ (রহিত) হয়েছে। অর্থাৎ ইসলামের প্রথম যুগে এ হুকুম ছিল যে, সহবাসে বীর্যপাত না ঘটলে গোসল করা অপরিহার্য নয়। কিন্তু পরবর্তীতে তা রহিত হয়ে গেছে। এ অধ্যায়ে (৮৭-৩৪৮) নম্বর হাদীসটি নাসিখ (রহিতকারী)।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": "343.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৩, আন্তর্জাতিক নাম্বারঃ ৩৪৩ ৬৬৩-(৮১/...) হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, পানির (ধাতু বের হলে) দ্বারা পানি (গোসল) ফরয হয়। (ইসলামিক ফাউন্ডেশনঃ ৬৬৭, ইসলামিক সেন্টারঃ ৬৮২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": "344",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৪, আন্তর্জাতিক নাম্বারঃ ৩৪৪ ৬৬৪-(৮২/৩৪৪) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... আবূল আলা ইবনু শিখখীর (রহঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এক হাদীস অপর হাদীসকে মানসুখ (রহিত) করে দিত যেমনিভাবে কুরআনের এক আয়াত অপর আয়াতকে মানসুখ করে। (ইসলামিক ফাউন্ডেশনঃ ৬৬৮, ইসলামিক সেন্টারঃ ৬৮৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": "345",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৫, আন্তর্জাতিক নাম্বারঃ ৩৪৫ ৬৬৫-(৮৩/৩৪৫) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু আল মুসান্না এবং ইবনু বাশশার (রহঃ) ... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর (বাড়ীর) সামনে দিয়ে যাচ্ছিলেন। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সংবাদ পাঠালেন। সে বেরিয়ে এলো আর তার মাথা থেকে তখন ফোটা ফোটা পানি ঝরছিল। তিনি [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বললেন, সম্ভবত আমরা তোমাকে তাড়াহুড়ার মধ্যে ফেলেছি। সে বলল, হ্যাঁ, ইয়া রাসূলাল্লাহ! তিনি বললেন, যখন (কোন কারণে) তোমাকে তাড়াতাড়ি (বীর্য বের হবার আগেই উঠে পড়তে হয়) অথবা বীর্য বের হতে বাধাপ্রাপ্ত হও তখন তোমার উপর গোসল করা (ফরয) নয় বরং তোমার উপর শুধু ওযু করা জরুরী। আর ইবনু বাশশার বলেন, যখন তোমাকে তাড়াহুড়ার মধ্যে ফেলা হয়েছে। বা তোমাকে বীর্যপাত করতে বাধা দেয়া হয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৬৬৯, ইসলামিক সেন্টারঃ ৬৮৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": "346.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৬, আন্তর্জাতিক নাম্বারঃ ৩৪৬ ৬৬৬-(৮৪/৩৪৬) আবূ রাবী' আয যাহরানী (রহঃ) ..... উবাই ইবনু কাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে প্রশ্ন করলাম সে ব্যক্তি সম্পর্কে যে স্ত্রী সহবাস করে (অথচ) তারপর বীর্যপাত হলো না। তিনি বললেন, স্ত্রীর (লজ্জাস্থান) থেকে তার (লজ্জাস্থানে) যা লেগেছে তা ধুয়ে ফেলবে। তারপর ওযু করবে এবং সালাত আদায় করবে। (ইসলামিক ফাউন্ডেশনঃ ৬৭০, ইসলামিক সেন্টারঃ ৬৮৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": "346.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭, আন্তর্জাতিক নাম্বারঃ ৩৪৬ ৬৬৭-(৮৫/...) মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) ..... উবাই ইবনু কা'ব (রাযিঃ) থেকে বর্ণিত। যে ব্যক্তি তার স্ত্রীর সাথে সহবাস করে তারপর বীর্যপাত হয় না- তার সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যে, সে তার লজ্জাস্থান ধুয়ে ফেলবে এবং ওযু করবে। (ইসলামিক ফাউন্ডেশনঃ ৬৭১, ইসলামিক সেন্টারঃ ৬৮৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": "347.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮, আন্তর্জাতিক নাম্বারঃ ৩৪৭ ৬৬৮-(৮৬/৩৪৭) যুহায়র ইবনু হারব ও আবূদ ইবনু হুমায়দ (রহঃ) ..... যায়দ ইবনু খালিদ আল জুহানী (রাযিঃ) থেকে বর্ণিত। একদা তিনি উসমান ইবনু আফফান (রাযিঃ) কে প্রশ্ন করেন, কোন লোক যদি তার স্ত্রীর সাথে মেলামেশা করে এবং বীর্যপাত না হয় তাহলে তার হুকুম কি? উসমান (রাযিঃ) বললেন, সে সালাতের ওযুর মতো ওযু করে নিবে এবং তার লজ্জাস্থান ধুয়ে ফেলবে। উসমান (রাযিঃ) বলেন, আমি এটা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। (ইসলামিক ফাউন্ডেশনঃ ৬৭২, ইসলামিক সেন্টারঃ ৬৮৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": "347.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": "348.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০, আন্তর্জাতিক নাম্বারঃ ৩৪৮ ৬৭০-(৮৭/৩৪৮) যুহায়র ইবনু হারব ও আবূ গাসসান আল মিসমাঈ, মুহাম্মদ ইবনু আল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন কেউ তার স্ত্রীর চার-হাত পায়ের মাঝখানে বসবে এবং তার সাথে মিলবে তখন তার উপর গোসল ফরয হবে। মাতার-এর হাদীসে 'যদিও বীর্য বের না করে'- বাক্যটি অতিরিক্ত রয়েছে। যুহায়র বলেছেন, তাদের মধ্য হতে কেউ যদি নারীর চার শাখার মধ্যে বসে*। (ইসলামিক ফাউন্ডেশনঃ ৬৭৪, ইসলামিক সেন্টারঃ ৬৮৯) * নারীর চার শাখা বলতে তার দু'হাত ও দু'পা বুঝানো হয়েছে। তবে কেউ কেউ বলেন, নারীর যোনীর চার পাশ। ইমাম নাবাবী (রহঃ) বলেন, নারীর যোনীর মধ্যে পুরুষাঙ্গ প্রবেশ করলে, উভয়ের উপর গোসল ফরয হয়। এক সময় এ সম্বন্ধে সাহাবাদের মাঝে মতানৈক্য থাকলেও পরবর্তী সময়ে গোসল ফরয হওয়ার উপর ইজমা বা ঐকমত্য স্থাপন হয়ে গেছে।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": "348.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১, আন্তর্জাতিক নাম্বারঃ ৩৪৮ ৬৭১-(.../...) মুহাম্মাদ ইবনু 'আমর ইবনু আব্বাদ ইবনু জাবালাহ ও মুহাম্মাদ ইবনু আল মুসান্না (রহঃ) এর সূত্রে কাতাদাহ্ (রহঃ) হতে অবিকল বর্ণিত রয়েছে। তবে শু'বার হাদীসে এরপর মিলিত হয় কথাটির উল্লেখ আছে। কিন্তু যদিও বীর্য বের না হয়\"- কথাটি বর্ণনা নেই। (ইসলামিক ফাউন্ডেশনঃ ৬৭৫, ইসলামিক সেন্টারঃ ৬৯০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": "349",
			"text": "",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": "350",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩, আন্তর্জাতিক নাম্বারঃ ৩৫০ ৬৭৩-(৮৯/৩৫০) হারূন ইবনু মা’রূফ ও হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা কোন এক লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রশ্ন করল- যদি কেউ তার স্ত্রীর সাথে মেলামেশা করে, অতঃপর বীর্য বের হবার আগেই তার পুরুষাঙ্গ বের করে ফেলে তাহলে কি তাদের উভয়ের উপর গোসল ফরয হবে? এ সময়ে আয়িশাহ (রাযিঃ) সেখানে উপবিষ্ট ছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি এবং 'আয়িশাহ (রাযিঃ) ঐরূপ করি, এরপর আমরা গোসল করে ফেলি। (ইসলামিক ফাউন্ডেশনঃ ৬৭৭, ইসলামিক সেন্টারঃ ৬৯২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": "351",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪, আন্তর্জাতিক নাম্বারঃ ৩৫১ ৬৭৪-(৯০/৩৫১) 'আবদুল মালিক ইবনু শু'আয়ব (রহঃ) ..... যায়দ ইবনু সাবিত (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে বলতে শুনেছি তিনি বলেছেন, আগুনে পাকানো খাবার খেয়ে ওযু করতে হবে। (ইসলামিক ফাউন্ডেশনঃ ৬৭৮, ইসলামিক সেন্টারঃ ৬৯৩) [‘অগ্নি-স্পৃষ্ট দ্রব্যাদি খাবার পর ওযু করা।' ইমাম নাবাবী (রহঃ) বলেন, ইমাম মুসলিন (রহঃ) এ অধ্যায়ে প্রথমে এ সকল হাদীসের উল্লেখ করেছেন, যেগুলোর দ্বারা সাব্যস্ত হয় যে, আগুনের দ্বারা পাকানো খাদ্যবস্তু খেলে ওযু নষ্ট হয়ে যায়। অতঃপর ঐ সকল হাদীসের বর্ণনা পেশ করেছেন, যেগুলোর দ্বারা প্রমাণিত হয়েছে যে, এ ধরনের খাবার খেলে ওযু নষ্ট হয় না। সুতরাং প্রথমে উল্লিখিত হাদীসসমূহ মানসুখ (রহিত)। এ ব্যাপারে পূর্ববর্তী এবং পরবর্তী জমহুর উলামায়ে কিরাম, সহাবরি কিরাম ও তাবিঈনে এযাম প্রায় সকলেই ঐকমত্য ঘোষণা করেছেন। তবে যে কোন জিনিস খাওয়ার পর কুলি করা এবং হাত-মুখ ভাল করে ধুয়ে ফেলা মুস্তাহাব। (নাবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": "352",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫, আন্তর্জাতিক নাম্বারঃ ৩৫২ ৬৭৫-(.../৩৫২) ইবনু শিহাব বলেন, উমার ইবনু ‘আবদুল আযীয (রহঃ) তাঁকে বলেছেন, আবদুল্লাহ ইবনু ইবরাহীম ইবনু কারিয (রহঃ) তাকে জানিয়েছেন যে, তিনি একদিন আবূ হুরাইরাহ (রাযিঃ) কে মসজিদের সামনে ওযু করতে দেখেছেন। আবূ হুরাইরাহ (রাযিঃ) বললেন, আমি কয়েক টুকরো পনির খেয়েছি, তাই ওযু করছি। কেননা, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি। তোমরা আগুনে রান্না করা খাবার খেলে ওযু করবে। (ইসলামিক ফাউন্ডেশনঃ ৬৭৮, ইসলামিক সেন্টারঃ ৬৯৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": "353",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬, আন্তর্জাতিক নাম্বারঃ ৩৫৩ ৬৭৬-(.../৩৫৩) ইবনু শিহাব বর্ণনা করেছেন, আমি সাঈদ ইবনু খালিদ ইবনু আমর ইবনু উসমান এর কাছে এ হাদীসটি বর্ণনা করেছিলাম। তখন তিনি আমাকে বললেন যে, তিনি আগুনে পাকানো খাবার খেয়ে ওযু করা সম্পর্কে উরওয়াহ ইবনু যুবায়রকে জিজ্ঞেস করলেন, তিনি বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) কে বলতে শুনেছি তিনি বলেছেন, তোমরা আগুনে রান্না করা খাবার খেয়ে ওযু করবে। (ইসলামিক ফাউন্ডেশনঃ ৬৭৮, ইসলামিক সেন্টারঃ ৬৯৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": "354.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭, আন্তর্জাতিক নাম্বারঃ ৩৫৪ ৬৭৭-(৯১/৩৫৪) আবদুল্লাহ ইবনু মাসলামাহ ইবনু কানাব (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বকরীর কাঁধের গোশত খেলেন তারপর সালাত আদায় করলেন কিন্তু ওযু করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৭৯, ইসলামিক সেন্টারঃ ৬৯৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": "354.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮, আন্তর্জাতিক নাম্বারঃ ৩৫৪ ৬৭৮-(.../...) যুহায়র ইবনু হারব (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার হাড়ে লাগানো গোশত অথবা গোশত খেলেন। তারপর সালাত আদায় করলেন; কিন্তু ওযু করলেন না এবং পানিও স্পর্শ করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৮০, ইসলামিক সেন্টারঃ ৬৯৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": "355.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯, আন্তর্জাতিক নাম্বারঃ ৩৫৫ ৬৭৯-(৯২/৩৫৫) মুহাম্মাদ ইবনু সাববাহ (রহঃ) ..... 'আমর ইবনু উমাইয়্যাহ আয যামরী (রাযিঃ) হতে বর্ণিত। তিনি একবার দেখলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বকরীর কাঁধের গোশত কেটে খাচ্ছেন। তারপর তিনি সালাত আদায় করলেন আর ওযু করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৮১, ইসলামিক সেন্টারঃ ৬৯৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": "355.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০, আন্তর্জাতিক নাম্বারঃ ৩৫৫ ৬৮০-(৯৩/...) আহমাদ ইবনু ঈসা (রহঃ) .... 'আমর ইবনু উমাইয়্যাহ আয যামরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখলাম তিনি একটি বকরীর কাধের গোশত (ছুরি দিয়ে) কাটছেন। এরপর তিনি তা খেলেন। ইতিমধ্যেই সালাতের জন্যে ডাকা হল। তিনি তখন দাঁড়িয়ে গেলেন এবং ছুরিটি ফেলে দিলেন এবং সালাত আদায় করলেন; কিন্তু ওযু করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৮২) ইবনু শিহাব বলেন, ‘আলী ইবনু আবদুল্লাহ ইবনু আব্বাস তার পিতা আবদুল্লাহ ইবনু আব্বাস এর মাধ্যমে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৮২, ইসলামিক সেন্টারঃ ৬৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": "356.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১, আন্তর্জাতিক নাম্বারঃ ৩৫৬ ৬৮১-(.../৩৫৬) আমর বলেন, বুকায়র ইবনু আল আশাজ্জ কুরায়ব এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী মাইমূনাহ (রাযিঃ) থেকে আমার কাছে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তার কাছে বসে কাঁধের গোশত খেলেন, তারপর সালাত আদায় করলেন কিন্তু ওযু করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৮২, ইসলামিক সেন্টারঃ ৬৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": "356.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২, আন্তর্জাতিক নাম্বারঃ ৩৫৬ ৬৮২-(.../...) 'আমর বলেন, জাফার ইবনু রাবী'আহ ..... ইয়াকুব ইবনু আল আশাজ্জ কুরায়ব এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী মাইমুনাহ (রাযিঃ) থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৮২, ইসলামিক সেন্টারঃ ৬৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": "357",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৩, আন্তর্জাতিক নাম্বারঃ ৩৫৭ ৬৮৩-(৯৪/৩৫৭) 'আমর বলেন, সাঈদ ইবনু আবূ হিলাল-এর সূত্রে আবূ রাফি' (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি সাক্ষ্য দিচ্ছি যে, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্যে বকরীর পেটের গোশত ভুনা করতাম (তিনি তা খেতেন) তারপর পুনরায় ওযু না করেই সালাত আদায় করতেন। (ইসলামিক ফাউন্ডেশনঃ ৬৮২, ইসলামিক সেন্টারঃ ৬৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": "358.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৪, আন্তর্জাতিক নাম্বারঃ ৩৫৮ ৬৮৪-(৯৫/৩৫৮) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার দুধ পান করলেন। তারপর পানি আনালেন। এরপর কুলি করলেন এবং বললেন, এতে তৈলাক্ত পদার্থ রয়েছে। (ইসলামিক ফাউন্ডেশনঃ ৬৮৩, ইসলামিক সেন্টারঃ ৬৯৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": "358.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৫, আন্তর্জাতিক নাম্বারঃ ৩৫৮ ৬৮৫-(.../...) আহমাদ ইবনু ঈসা (রহঃ), যুহায়র ইবনু হারব, হারমালাহ ইবনু ইয়াহইয়া প্রত্যেকেই ইবনু শিহাব থেকে উকায়ল এর সনদে যুহরী থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৮৪, ইসলামিক সেন্টারঃ ৬৯৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": "359.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৬, আন্তর্জাতিক নাম্বারঃ ৩৫৯ ৬৮৬-(৯৬/৩৫৯) ‘আলী ইবনু হুজুর (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার কাপড় পরে সালাতের জন্যে বের হলেন। এমন সময় কিছু রুটি ও গোশত উপঢৌকন এলো। এরপর তিনি (সেখান থেকে) তিন লুকমা খেলেন। তারপর লোকদেরকে নিয়ে সালাত আদায় করলেন এবং পানি স্পর্শও করলেন না। (ইসলামিক ফাউন্ডেশনঃ ৬৮৫, ইসলামিক সেন্টারঃ ৭০০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": "359.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৭, আন্তর্জাতিক নাম্বারঃ ৩৫৯ ৬৮৭-(.../...) আবূ কুরায়ব (রহঃ) ..... মুহাম্মাদ ইবনু আমর ইবনু আতা (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি একদিন ইবনু আব্বাস (রাযিঃ) এর সাথে ছিলাম। তারপর তিনি ইবনু হালহালাহ এর হাদীস (উপরোক্ত হাদীস) এর অনুরূপ বর্ণনা করেন। সেখানে উল্লেখ আছে যে, ইবনু আব্বাস (রাযিঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এমন করতে দেখেছেন। আর এ হাদীসের রাবী শুধু সালাত আদায়ের কথা উল্লেখ করেছেন। লোকদেরকে নিয়ে কথাটির উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশনঃ ৬৮৬, ইসলামিক সেন্টারঃ ৭০১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": "360.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৮, আন্তর্জাতিক নাম্বারঃ ৩৬০ ৬৮৮-(৯৭/৩৬০) আবূ কামিল ফুযায়ল ইবনু হুসায়ন আল জাহদারী (রহঃ) .... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। এক লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে জিজ্ঞেস করল, আমি কি বকরীর গোশত খেয়ে ওযু করব? তিনি বললেন, তোমার ইচ্ছা ওযু করতে পার আর নাও করতে পার। সে বলল, আমি কি উটের গোশত খেয়ে ওযু করব? তিনি বললেন, হ্যাঁ, উটের গোশত খেয়ে তুমি ওযু করবে। সে বলল, আমি কি বকরীর ঘরে সালাত আদায় করতে পারি? তিনি বললেন, হ্যাঁ। সে বলল, আমি কি উটের ঘরে সালাত আদায় করতে পারি? তিনি বললেন, না*। (ইসলামিক ফাউন্ডেশনঃ ৬৮৭, ইসলামিক সেন্টারঃ ৭০২) *যেহেতু অত্র হাদীস স্পষ্ট প্রমাণ করছে যে, উটের গোশত খেলে ওযু নষ্ট হয়ে যাবে। সেহেতু কোন প্রকার মন্তব্য ছাড়াই এ নির্দেশ মেনে নিতে হবে। ওযু অবস্থায় উটের গোশত খেয়ে সালাত আদায়ের ইচ্ছা করলে অবশ্যই পুনরায় ওযু করতে হবে। উটের আস্তাবলে সালাত আদায়ের নিষেধের কারণ হচ্ছে, উট দুষ্ট প্রকৃতির বিরাট পশু। সালাত আদায়কারীর ক্ষতি সাধন করতে পারে। পক্ষান্তরে বকরীর ঘরে সালাত আদায় করলে ক্ষতি সাধনের আশঙ্কা নেই। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": "360.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮৯, আন্তর্জাতিক নাম্বারঃ ৩৬০ ৬৮৯-(.../...) আবূ বকর ইবনু আবূ শাইবাহ ও কাসিম ইবনু যাকারিয়্যা (রহঃ) প্রত্যেকেই নিজ নিজ সনদে জাবির ইবনু সামুরাহ (রাযিঃ) হতে আবূ কামিল এর অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৮৮, ইসলামিক সেন্টারঃ ৭০৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": "361",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯০, আন্তর্জাতিক নাম্বারঃ ৩৬১ ৬৯০-(৯৮/৩৬১) 'আমর আন নাকিদ, যুহায়র ইবনু হারব এবং আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ..... আব্বাদ ইবনু আত তামীম তার চাচা থেকে বর্ণনা করেন যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে সে ব্যক্তি সম্পর্কে জানতে চাইলেন সালাতের মধ্যে যার এমন মনে হয় যেন কিছু (বায়ু) বের হল। তিনি [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বললেন, সে (সালাত ছেড়ে) যাবে না যতক্ষণ না (বায়ু বের হবার) শব্দ শুনবে অথবা (তার) গন্ধ পাবে। আবূ বাকর ও যুহায়র ইবনু হারব তাদের বর্ণনায় উল্লেখ করেন যে, ঐ ব্যক্তি ছিলেন আবদুল্লাহ ইবনু যায়দ। (ইসলামিক ফাউন্ডেশনঃ ৬৮৯, ইসলামিক সেন্টারঃ ৭০৪) প্রাসঙ্গিক আলোচনা হাদীসে অভিযোগকারী হচ্ছেন হাদীসের বর্ণনাকারী স্বয়ং আবদুল্লাহ ইবন যায়েদ ইবন আসেম আল-মাযেনী রাদ্বিয়াল্লাহু আনহু। আর এখানে 'ধারণা' হয় বলা হয়েছে। সুতরাং যদি বাতাস বের হওয়ার বিষয়টি নিশ্চিত হয় তখন ওযূ ভঙ্গ হওয়ার জন্য শব্দ বা গন্ধের প্রয়োজন হবে না। হাদীসের শিক্ষা ১. কোনো কিছুর যদি দু'টি অবস্থা হতে পারে যেমন হালাল ছিল তা দৃঢ়ভাবে নির্ধারিত কিন্তু পরবর্তীতে কোনো এক কারণে হারাম হওয়ার সম্ভাবনা দেখা দেয় তখন সেটাকে দৃঢ় অবস্থার ওপর রাখতে হবে। অর্থাৎ মূলনীতি হচ্ছে যা আগে ছিল তা-ই রাখা, যতক্ষণ না ভিন্নটি প্রমাণিত হচ্ছে। ২. শুধুমাত্র ওযূ ভঙ্গ হওয়ার বিষয়টি সন্দেহ হিসেবে আসলে তার কারণে সালাত থেকে বের হওয়া যাবে না। ৩. যখন কারো পিছনের রাস্তা দিয়ে বাতাস বের হবে তখন তা তার ওযূ নষ্ট করে দিবে, চাই বের হওয়ার বিষয়টি শব্দ শোনা কিংবা গন্ধ বা অন্য কিছুর মাধ্যমে সাব্যস্ত হবে। ৪. যেসব জিনিস বলতে লজ্জা লাগে সেগুলো না বলে পরিহার করাই উচিত। ৫. যার ওযূ আছে তিনি যদি ওযূ ভঙ্গ হওয়ার ব্যাপারে সন্দেহ করেন, তখন সে সন্দেহের কারণে তার ওযূ করা আবশ্যক নয়; যতক্ষণ না তার ওযূ ভঙ্গ হওয়ার বিষয়টি দৃঢ়ভাবে সাব্যস্ত হচ্ছে। ৬. হাদীসে শব্দ ও গন্ধের বিষয়টি দৃঢ় হওয়ার জন্য বলা হয়েছে। নতুবা যদি সত্যি সত্যিই তিনি অনুভব করেন যে, তার থেকে বায়ু বের হয়েছে তখন ওযূ ভঙ্গ হয়ে যাবে।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": "362",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯১, আন্তর্জাতিক নাম্বারঃ ৩৬২ ৬৯১-(৯৯/৩৬২) যুহারর ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ যখন তার পেটের মধ্যে কিছু অনুভব করে তারপর তার সন্দেহ দেখা দেয় যে, পেট থেকে কিছু বের হল কি না। তখন সে যেন মাসজিদ থেকে কখনো বের না হয় যতক্ষণ না শব্দ শোনে অথবা গন্ধ পায়। (অর্থাৎ ওযু ভঙ্গের পূর্ণ বিশ্বাস না হওয়া পর্যন্ত যেন বের না হয়।) (ইসলামিক ফাউন্ডেশনঃ ৬৯০, ইসলামিক সেন্টারঃ ৭০৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": "363.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২, আন্তর্জাতিক নাম্বারঃ ৩৬৩ ৬৯২-(১০০/৩৬৩) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শাইবাহ, আমর আন নাকিদ ও ইবনু আবূ উমর (রহঃ) ... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মাইমূনাহ (রাযিঃ) এর দাসীকে কেউ একটি বকরী সদাকাহ দিল। পরে সে বকরীটি মারা যায়। সে সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মরে পড়ে থাকা বকরীটির সামনে দিয়ে যাচ্ছিলেন। এ অবস্থা দেখে তিনি বললেন, তোমরা কেন এর চামড়া খুলে নিয়ে তা পাকা করে তা দিয়ে উপকৃত হও না? সাহাবাগণ বললেন, এটা যে মৃত। তিনি বললেন, (তাতে কি) এটা খাওয়া হারাম (চামড়া ব্যবহার করা তো হারাম নয়)। আবূ বাকর ও ইবনু আবূ উমার মাইমুনাহ থেকে হাদীসটি বর্ণনা করেছেন। (অর্থাৎ রাবী মাইমুনাহ 'আবদুল্লাহ ইবনু আব্বাস নন) (ইসলামিক ফাউন্ডেশনঃ ৬৯১, ইসলামিক সেন্টারঃ ৭০৬) [ইমাম নববী (রহঃ) বলেনঃ যে সমস্ত বস্তুর দ্বারা ভিজা চামড়া শুকিয়ে যায় এবং তার দুর্গন্ধ দূর হয়ে যায়। অতঃপর আর চামড়া পচে যাওয়ার আশঙ্কা থাকে না। এ জাতীয় জিনিসের দ্বারা চামড়া পাকা (দাবাগত) করা বৈধ আছে। যেমন- আনারের (ডালিমের) ছাল ফিটকিরী, লবণ ইত্যাদি। শুধুমাত্র রোদ্রে শুকালে চামড়া দাবাগত তথা পাকা হবে না। পাকা (দাবাগত দেয়া) চামড়া জীবিত পশুর হোক অথবা মৃত পশুরই হোক যে কোন কাজে ব্যবহার করা অথবা বিক্রি করা জায়িয আছে। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": "363.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩, আন্তর্জাতিক নাম্বারঃ ৩৬৩ ৬৯৩-(১০১/...) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি মৃত বকরী দেখলেন যা মাইমূনাহ (রাযিঃ) এর দাসীকে সদাকাহ হিসেবে দেয়া হয়েছিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা এর চামড়া দিয়ে উপকৃত হও না কেন? সাহাবাগণ বললেন, এটা তো মৃত। তিনি বললেন, এটা তো খাওয়া হারাম। (ইসলামিক ফাউন্ডেশনঃ ৬৯২, ইসলামিক সেন্টারঃ ৭০৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": "363.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪, আন্তর্জাতিক নাম্বারঃ ৩৬৩ ৬৯৪-(.../...) হাসান আল হুলওয়ানী ও আবদ ইবনু হুমায়দ (রহঃ) এ সনদে ইউনুস এর রিওয়ায়াতের অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ৬৯৩, ইসলামিক সেন্টারঃ ৭০৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": "363.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫, আন্তর্জাতিক নাম্বারঃ ৩৬৩ ৬৯৫-(১০২/...) ইবনু আবূ উমার ও আবদুল্লাহ ইবনু মুহাম্মাদ আয যুহরী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফেলে দেয়া একটি মরা বকরীর সামনে দিয়ে যাচ্ছিলেন যা মাইমুনাহ (রাযিঃ) এর দাসীকে সদাকাহ হিসেবে দেয়া হয়েছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তারা এর চামড়া কেন খুলে নিল না? চামড়াটি পাকা করে তা দিয়ে উপকৃত হত। (ইসলামিক ফাউন্ডেশনঃ ৬৯৪, ইসলামিক সেন্টারঃ ৭০৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": "364",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬, আন্তর্জাতিক নাম্বারঃ ৩৬৪ ৬৯৬-(১০৩/৩৬৪) আহমাদ ইবনু উসমান আন নাওফালী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। মাইমুনাহ (রাযিঃ) তাকে জানান যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন এক স্ত্রীর একটি পালিত বকরী ছিল সেটি মারা গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা কেন এর চামড়া খুলে নিচ্ছ না সেটা দিয়ে উপকৃত হতে! (ইসলামিক ফাউন্ডেশনঃ ৬৯৫, ইসলামিক সেন্টারঃ ৭১০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": "365",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭, আন্তর্জাতিক নাম্বারঃ ৩৬৫ ৬৯৭-(১০৪/৩৬৫) আবূ বকর ইবনু আবূ শইবাহ (রহঃ) .... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাইমুনাহ্ (রাযিঃ) এর দাসীর একটি মরা বকরীর সামনে দিয়ে যাচ্ছিলেন, তখন তিনি বললেন, তোমরা এর চামড়া দিয়ে উপকৃত হও না কেন? (ইসলামিক ফাউন্ডেশনঃ ৬৯৬, ইসলামিক সেন্টারঃ ৭১১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": "366.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮, আন্তর্জাতিক নাম্বারঃ ৩৬৬ ৬৯৮-(১০৫/৩৬৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, চামড়া যখন পাকা (দাবাগাত) করা হয় তখন তা পবিত্র হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৬৯৭, ইসলামিক সেন্টারঃ ৭১২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": "366.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯, আন্তর্জাতিক নাম্বারঃ ৩৬৬ ৬৯৯-(.../...) আবূ বকর ইবনু আবূ শাইবাহ, আমর আন নাকিদ, কুতাইবাহ ইবনু সাঈদ, আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে ইয়াহইয়া ইবনু ইয়াহইয়ার হাদীসের অনুরূপ বর্ণিত আছে। (ইসলামিক ফাউন্ডেশনঃ ৬৯৮, ইসলামিক সেন্টারঃ ৭১৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": "366.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০, আন্তর্জাতিক নাম্বারঃ ৩৬৬ ৭০০-(১০৬/...) ইসহাক ইবনু মানসূর ও আবূ বকর ইবনু ইসহাক (রহঃ) …. আবূল খায়র (রহঃ) (মারসাদ ইবনু আবদুল্লাহ আল ইয়াযানী) হতে বর্ণিত। তিনি বলেছেন, একদিন আমি ইবনু ওয়া'লাহ আস সাবায়ীর গায়ে একটা নরম পশমের তৈরি জামা দেখে তা স্পর্শ করে দেখলাম। তখন তিনি বললেন, কি ব্যাপার স্পর্শ করে দেখছো যে? (নাপাক মনে করছে নাকি!) আমি আবদুল্লাহ ইবনু আব্বাসকে এ বিষয়ে জিজ্ঞেস করেছিলাম। বলেছিলাম, আমরা মাগরিবে (মরক্কো) বাস করি। আমাদের সাথে বার্বার এবং অগ্নিপূজকরাও বাস করে। তাদের যাবাহ করে মেষের পোশাক আমাদের কাছে আসে। অথচ আমরা তাদের যাবাহ করা পশুর গোশত খাই না। তারা আমাদের জন্য চর্বি ভর্তি মশকও নিয়ে আসে। এ কথা শুনে আবদুল্লাহ ইবনু আব্বাস বললেন, আমরা এ ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলে তিনি বললেন, চামড়া পাকা করলে পবিত্র হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৬৯৯, ইসলামিক সেন্টারঃ ৭১৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": "366.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১, আন্তর্জাতিক নাম্বারঃ ৩৬৬ ৭০১-(১০৭/...) ইসহাক ইবনু মানসূর ও আবূ বকর ইবনু ইসহাক (রহঃ) ..... ইবনু ওয়া'লাহ আস্ সাবায়ী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) কে জিজ্ঞেস করলাম যে, আমরা পশ্চিম দেশে থাকি। সেখানে আমাদের কাছে অগ্নিপূজকরা মশক নিয়ে আসে, সেটাতে পানি এবং চর্বি জাতীয় পদার্থ থাকে (আমরা সেগুলো ব্যবহার করব কি?)। তিনি বললেন, তা পান করে নাও। আমি বললাম, এটা কি আপনার নিজের অভিমত? ইবনু আব্বাস (রাযিঃ) বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, চামড়া পাকা (দাবাগাত) করলেই তা পবিত্র হয়ে যায়। (ইসলামিক ফাউন্ডেশনঃ ৭০০, ইসলামিক সেন্টারঃ ৭১৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": "367.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০২, আন্তর্জাতিক নাম্বারঃ ৩৬৭ ৭০২-(১০৮/৩৬৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন এক সফরে আমরা তার সাথে বের হলাম। আমরা যখন বাইদা অথবা বাতুল জায়শ নামক স্থানে পৌছলাম তখন আমার হার খুলে পড়ে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা খোঁজ করতে সেখানে থামালেন। আর লোকজনও তার সাথে সাথে থামালেন। তাদের কাছাকাছি কোথাও পানি ছিল না এবং তাদের নিজেদের কাছেও পানি ছিল না। অতঃপর লোকজন আবূ বকর (রাযিঃ) এর কাছে এসে বলতে লাগল, আপনি দেখছেন না আয়িশাহ (রাযিঃ) কি করল? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আটকে দিয়েছে এবং সে সাথে সমস্ত লোককে আটকে রেখেছে। অথচ তাদের কাছাকাছি কোথাও পানি নেই আর না তাদের নিজেদের কাছে পানি আছে। অতঃপর আবূ বাকর (রাযিঃ) আমার কাছে এলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার উরুর উপর মাথা রেখে ঘুমিয়েছিলেন। তিনি এসে বললেন, তুমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং সমস্ত লোকজনকে আটকে রেখেছ। অথচ না তারা পানির কাছাকাছি রয়েছে, আর না তাদের নিজেদের কাছে পানি আছে। আয়িশাহ (রাযিঃ) বলেন, অতঃপর আবূ বাকর (রাযিঃ) আমাকে ভৎসনা করলেন এবং যতদূর বলার বললেন। তিনি তার হাত দিয়ে আমার পাজরে আঘাত করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আমার উরুর উপর থাকার কারণে আমি নড়তেও পারলাম না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ঘুমিয়েই রইলেন। এমনি করে পানি বিহীনভাবে সকাল হয়। অতঃপর আল্লাহ তা'আলা তায়াম্মুমের আয়াত নাযিল করলেন। অতঃপর তারা তয়াম্মুম করলেন তখন উসায়দ ইবনু হুযায়র যিনি ছিলেন নকীব (দলপতি)-দের অন্যতম বললেন, হে আবূ বাকর পরিবার! এটাই আপনার প্রথম বারাকাত নয়\"। আয়িশাহ (রাযিঃ) বলেন, অতঃপর আমি যে উটের ওপর ছিলাম সেটিকে চলার জন্যে উঠালাম। তখন উক্ত হারটি তার নীচে পাওয়া গেল। (ইসলামিক ফাউন্ডেশনঃ ৭০১, ইসলামিক সেন্টারঃ ৭১৬) [তায়াম্মুম শব্দের অর্থ সংকল্প করা, ইচ্ছা করা। শরীআতের দৃষ্টিতে পবিত্রতা অর্জনের সংকল্পে পবিত্র মাটিতে হাত মেরে মুখমণ্ডল এবং কব্জির উপরিভাগ মাসাহ করাই 'তায়াম্মুম। তবে তায়াম্মুমের নিয়্যাত করবে এবং বিসমিল্লাহ' বলবে।]",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": "367.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৩, আন্তর্জাতিক নাম্বারঃ ৩৬৭ ৭০৩-(১০৯/...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ও আবূ কুরায়ব (রহঃ) ..... ‘আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি আসমা (রাযিঃ) থেকে একটি হার ধার নিয়েছিলেন। অতঃপর তা হারিয়ে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাহাবাদের মধ্যে কিছু লোককে খুঁজতে পাঠালেন। (পথে) তাদের সালাতের সময় হয়ে গেল। তখন তারা ওযু ছাড়াই সালাত আদায় করলেন। এরপর তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে এ ঘটনা জানালেন। তখন তায়াম্মুমের আয়াত নাযিল হল। এ সময় উসায়দ ইবনু হুযায়র বললেন, আল্লাহ তা'আলা আপনাকে (আয়িশাহ) উত্তম বদলা দান করুন। আল্লাহর কসম! আপনার ওপর যখনই কোন সমস্যা এসেছে তখন আল্লাহ তা'আলা আপনার জন্যে এর সমাধানের পথ করে দিয়েছেন এবং মুসলিমদের জন্যে তাতে বারাকাত রেখেছেন*। (ইসলামিক ফাউন্ডেশনঃ ৭০২, ইসলামিক সেন্টারঃ ৭১৭) * কুরআন মাজীদ ও সহীহ হাদীসের দ্বারা ওযু ও গোসলের বিকল্প হিসেবে তায়াম্মুম সাব্যস্ত করা হয়েছে। অর্থাৎ প্রয়োজনের সময় পানি না পাওয়া গেলে অথবা অসুস্থতা বা অন্য কোন অপ্রতিরোধ্য কারণে পানি ব্যবহারে অসমর্থ হয়ে পড়লে পবিত্রতা অর্জনের জন্য তায়াম্মুম জায়িয। এ অধ্যায়ের ১১০ ও ১১১ নং হাদীসের দ্বারা তায়াম্মুমের পদ্ধতি বর্ণনা করা হয়েছে যে, \"পবিত্র মাটিতে একবার হাত মেরে তা একবার ঝেড়ে ফেলে মুখমণ্ডল এবং উভয় হাতের কজি পর্যন্ত মাসাহ করতে হবে। মাটিতে দু'বার হাত মারা বা হাতের কনুই পর্যন্ত মাসাহ করার কোন দলীল নেই। (নবাবী)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": "368.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৪, আন্তর্জাতিক নাম্বারঃ ৩৬৮ ৭০৪-(১১০/৩৬৮) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবী শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... শাকীক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার আবদুল্লাহ (ইবনু মাসউদ) ও আবূ মূসা (রাযিঃ) এর কাছে বসেছিলাম। তখন আবূ মূসা (রাযিঃ) বললেন, হে আবূ আবদুর রহমান! কোন লোক যদি জুনুবী হয় (যার ফলে তার গোসল ফরয হয়) এবং সে এক মাস যাবৎ পানি না পায় তাহলে সে কিভাবে সালাত আদায় করবে? আবদুল্লাহ বললেন, সে তায়াম্মুম করবে না যদিও একমাস পানি না পায়। আবূ মূসা (রাযিঃ) বললেন, তাহলে সূরাহ মায়িদাহ এর এ আয়াত- ..... \"যদি তোমরা পানি না পাও তাহলে পবিত্র মাটি দিয়ে তায়াম্মুম কর\"- (সূরাহ আল মায়িদাহ ৫: ৬) এর কি হবে? আবদুল্লাহ বললেন, এ আয়াতের দ্বারা তাদেরকে যদি তায়াম্মমের অনুমতি দেয়া হয় তাহলে (ধীরে ধীরে এমন এক পর্যায়ে পৌছবে যে) পানি ঠাণ্ডাবোধ হলে তারা মাটি দিয়ে তায়াম্মুম শুরু করবে। আবূ মূসা (রাযিঃ) তখন আবদুল্লাহ-কে বললেন, আপনি কি আম্মার-এর বর্ণনা শোনেননি (তিনি বলেন) যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে কোন এক প্রয়োজনে পাঠালেন। (পথিমধ্যে) আমি অপবিত্র হয়ে গেলাম এবং পানি পেলাম না। তখন আমি মাটিতে গড়াগড়ি দিলাম চতুষ্পদ জন্তু যেভাবে মাটিতে গড়াগড়ি দেয়। তারপর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে এ ঘটনা বললাম। তিনি বললেন, তোমার জন্যে দু'হাত দিয়ে এরূপ করাই যথেষ্ট ছিল-এ বলে তিনি তার দু'হাত একবার মাটিতে মারলেন। তারপর বামহাত দিয়ে ডানহাত মাসাহ করলেন এরং উভয় হাতের কব্জির উপরিভাগ ও মুখমণ্ডল মাসাহ করলেন। আবদুল্লাহ বললেন, তুমি কি দেখনি যে, উমার (রাযিঃ) আম্মার (রাযিঃ) এর কথা যথেষ্ট মনে করেননি? (ইসলামিক ফাউন্ডেশনঃ ৭০৩, ইসলামিক সেন্টারঃ ৭১৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": "368.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৫, আন্তর্জাতিক নাম্বারঃ ৩৬৮ ৭০৫–(১১১/...) আবূ কামিল আল জাহদারী (রহঃ) ..... শাকীক (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ মূসা আবদুল্লাহ (রাযিঃ) কে বললেন, এরপর আবূ মু'আবিয়ার হাদীসের অনুরূপ বর্ণনা করেন। তবে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার জন্যে এরূপ করাই যথেষ্ট ছিল- এ বলে তিনি তার উভয় হাত মাটিতে মারলেন। অতঃপর ঝেড়ে মুখমণ্ডল এবং উভয় হাতের কব্জি মাসাহ করলেন। (ইসলামিক ফাউন্ডেশনঃ ৭০৪, ইসলামিক সেন্টারঃ ৭১৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": "368.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৬, আন্তর্জাতিক নাম্বারঃ ৩৬৮ ৭০৬-(১১২/...) আবদুল্লাহ ইবনু হাশিম আল আবদী (রহঃ) ..... 'আবদুর রহমান ইবনু আবযা (রাযিঃ) হতে বর্ণিত। এক লোক উমার (রাযিঃ) এর কাছে এসে বলল, আমি অপবিত্র হয়েছি কিন্তু পানি পাইনি (তখন কি করব?)। তিনি বললেন, তুমি সালাত আদায় করো না। তখন আম্মার (রাযিঃ) বললেন, আমীরুল মুমিনীন! আপনার কি স্মরণ নেই যে, আমি ও আপনি কোন এক অভিযানে অংশগ্রহণ করেছিলাম। অতঃপর আমরা উভয়েই অপবিত্র হয়ে পড়লাম। আর কোথাও পানি পেলাম না তখন আপনি সালাত আদায় করলেন না কিন্তু আমি মাটিতে গড়াগড়ি দিলাম এবং সালাত আদায় করলাম। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ ঘটনা জানালে তিনি বললেন, তোমার জন্যে এটাই যথেষ্ট ছিল যে, তুমি দু'হাত জমিনে মারতে তারপর ফুঁক দিয়ে আলগা ধুলা ফেলে দিতে তারপর উভয় হাতের কব্জি দ্বারা মাসাহ করতে তোমার দু'হাতে ও চেহারা\"। উমার (রাযিঃ) বললেন, \"আম্মার! আল্লাহকে ভয় কর\"। তিনি ['আম্মার (রাযিঃ)] বললেন, “আপনি চাইলে আমি এটা আর বর্ণনা করব না\"। হাকাম বলেন, আবদুর রহমান ইবনু আবযার পুত্র তার পিতা আবদুর রহমান থেকে আমার কাছে যার এর হাদীসের অনুরূপ বর্ণনা করেছেন। তিনি বলেন, অতঃপর উমর (রাযিঃ) বললেন, তোমার বর্ণনার দায়-দায়িত্ব তোমার উপর। (ইসলামিক ফাউন্ডেশনঃ ৭০৫, ইসলামিক সেন্টারঃ ৭২০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": "368.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৭, আন্তর্জাতিক নাম্বারঃ ৩৬৮ ৭০৭-(১১৩/...) ইসহাক ইবনু মানসূর (রহঃ) ..... 'আবদুর রহমান ইবনু আবযা (রাযিঃ) থেকে বর্ণিত। এক লোক উমার (রাযিঃ) এর কাছে এসে বলল, আমি অপবিত্র হয়েছি এবং পানি পাইনি (তখন কি করব?) এরপর রাবী পূর্বোক্ত হাদীসের অনুরূপ বর্ণনা করেছেন। তাতে অতিরিক্ত আছে যে, আম্মার (রাযিঃ) বললেন, হে আমীরুল মুমিনীন আল্লাহ তা'আলার আমার ওপর আপনার যে হক রেখেছেন (অর্থাৎ আপনাকে খলীফা বানিয়েছেন) তার প্রতি লক্ষ্য রেখে বলছি। আপনি চাইলে আমি আর কারো কাছে এটা বর্ণনা করব না এবং সালামাহ্ আমার কাছে যার থেকে হাদীস বর্ণনা করেছেন কথাটি উল্লেখ করেনি। (ইসলামিক ফাউন্ডেশনঃ ৭০৬, ইসলামিক সেন্টারঃ ৭২১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": "369",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৮, আন্তর্জাতিক নাম্বারঃ ৩৬৯ ৭০৮-(১১৪/৩৬৯) মুসলিম বলেন, লায়স ইবনু সাদ এর সূত্রে ইবনু আব্বাস (রাযিঃ) এর মুক্তকৃত দাস উমায়র থেকে বর্ণিত। তিনি ইবনু আব্বাস (রাযিঃ) কে বলতে শুনেছেন যে, আমি এবং উন্মুল মুমিনীন মাইমুনাহ (রাযিঃ) এর মুক্তকৃত দাস আবদুর রহমান ইবনু ইয়াসার একবার আবূল জাহম ইবনুল হারিস ইবনুস সিম্মা আল আনাসারীর কাছে গেলাম। তখন আবূল জাহম (রাযিঃ) বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বি'রি জামাল (মদীনার নিকটবর্তী একটি স্থান) এর দিক থেকে আসছিলেন, অতঃপর পথিমধ্যে এক ব্যক্তি তার সাথে সাক্ষাৎ করে সালাম দিল কিন্তু তিনি তার উত্তর দিলেন না বরং একটি দেয়ালের কাছে গিয়ে তার মুখমণ্ডল এবং উভয় হাত মাসাহ করলেন। তারপর তার সালামের জবাব দিলেন। (ইসলামিক ফাউন্ডেশনঃ ৭০৬, ইসলামিক সেন্টারঃ ৭২১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": "370",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০৯, আন্তর্জাতিক নাম্বারঃ ৩৭০ ৭০৯-(১১৫/৩৭০) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। এক ব্যক্তি পথ দিয়ে যাচ্ছিল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন প্রস্রাব করছিলেন। সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সালাম করল। কিন্তু তিনি তার জবাব দিলেন না। (ইসলামিক ফাউন্ডেশনঃ ৭০৭, ইসলামিক সেন্টারঃ ৭২২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": "371",
			"text": "",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": "372",
			"text": "",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": "373",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১২, আন্তর্জাতিক নাম্বারঃ ৩৭৩ ৭১২-(১১৭/৩৭৩) আবূ কুরায়ব মুহাম্মাদ ইবনুল আলা ও ইবরাহীম ইবনু মুসা (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বাবস্থায়ই আল্লাহর যিকর করতেন। (ইসলামিক ফাউন্ডেশনঃ ৭১০, ইসলামিক সেন্টারঃ ৭২৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": "374.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৩, আন্তর্জাতিক নাম্বারঃ ৩৭৪ ৭১৩-(১১৮/৩৭৪) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী ও আবূ রাবী' আয যাহরানী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পায়খানা থেকে বের হলেন। ইতিমধ্যেই খাবার আনা হল। লোকজন তাঁকে ওযুর কথা আলোচনা করল। তিনি বললেন, আমি কি সালাত আদায়ের ইচ্ছা করছি যে, ওযু করব? (ইসলামিক ফাউন্ডেশনঃ ৭১১, ইসলামিক সেন্টারঃ ৭২৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": "374.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৪, আন্তর্জাতিক নাম্বারঃ ৩৭৪ ৭১৪-(১১৯/...) আবূ বকর ইবনু আবূ শইবাহ্ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ছিলাম। তিনি পায়খানা থেকে এলেন। খাবার আনা হল। তাকে বলা হল, আপনি কি ওযু করবেন না? তিনি বললেন, কেন? আমি কি সালাত আদায় করছি যে, ওযু করব? (ইসলামিক ফাউন্ডেশনঃ ৭১২, ইসলামিক সেন্টারঃ ৭২৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": "374.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৫, আন্তর্জাতিক নাম্বারঃ ৩৭৪ ৭১৫-(১২০/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার পায়খানায় গেলেন। পরে তিনি যখন (পায়খানা সেরে ফিরে) এলেন তখন তার সামনে খাবার দেয়া হল। অতঃপর তাকে বলা হল, হে আল্লাহর রাসূল! আপনি কি ওযু করবেন না? তিনি বললেন, কেন? সালাতের জন্যে? (ইসলামিক ফাউন্ডেশনঃ ৭১৩, ইসলামিক সেন্টারঃ ৭২৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": "374.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৬, আন্তর্জাতিক নাম্বারঃ ৩৭৪ ৭১৬-(১২১/...) মুহাম্মাদ ইবনু 'আমূর (রহঃ) ..... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পায়খানা থেকে তার প্রাকৃতিক প্রয়োজন পূরণ করে আসলে তার সামনে খাবার এনে দেয়া হল। তিনি তা খেলেন, কিন্তু পায়খানা থেকে বের হয়ে পানি স্পর্শও করেননি (অর্থাৎ ওযু করলেন না)। মুহাম্মাদ ইবনু মুসলিম বললেন, 'আমর ইবনু দীনার সাঈদ ইবনু হুওয়াইরিসের মাধ্যমে আমার কাছে এতটুকু বর্ণনা করেছেন যে, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলা হল, আপনি তো ওযু করলেন না? জবাবে তিনি বলেছেনঃ আমি তো এখন সালাত আদায় করছি না যে ওযু করতে হবে? আমর ইবনু দীনার বলেছেন যে, তিনি হাদীসটি সাঈদ ইবনু হুওয়াইরিস এর নিকট থেকে নিজে শুনেছেন। (ইসলামিক ফাউন্ডেশনঃ ৭১৪, ইসলামিক সেন্টারঃ ৭২৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": "375.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৭, আন্তর্জাতিক নাম্বারঃ ৩৭৫ ৭১৭-(১২২/৩৭৫) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) .... আনাস (রাযিঃ) থেকে বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শৌচাগারে প্রবেশ করার সময় বলতেন, \"আল্লাহুম্মা ইন্নী আউযুবিকা মিনাল খুবসি ওয়াল খবা-য়িস\" অর্থাৎ \"হে আল্লাহ! আমি আপনার নিকট দুষ্ট পুরুষ ও জিন ও নারী জিন থেকে আশ্রয় চাচ্ছি।\" (ইসলামিক ফাউন্ডেশনঃ ৭১৫, ইসলামিক সেন্টারঃ ৭৩০) হাদীসের শিক্ষা ১. বাথরুমে পায়খানা ব্যবহার করার জন্য গেলে উপরোক্ত দো'আ পাঠ করা সুন্নাত। ২. আলেমগণ বলেছেন, এর মাধ্যমে শয়তানের ওয়াসওয়াসা, কুমন্ত্রণা ও বিভিন্ন প্রকার ধোকা থেকে হিফাযত থাকা যায়। শয়তান ওযূতে সমস্যা করে, সালাত বিনষ্ট করতে চেষ্টা চালায় এসব থেকে বাঁচার জন্য এ দোআ করা উচিত। ৩. শয়তানের অন্যতম অস্ত্র হচ্ছে মানুষকে ময়লা, পায়খানা ইত্যাদির মাধ্যমে অশুচি করে ফেলবে। তাই শয়তানদের থেকে আল্লাহর কাছে আশ্রয় চাওয়া জরুরী। ৪. ময়লা ও অপবিত্রতা থেকে বেঁচে থাকা ফরয: অনুরূপভাবে যা মানুষকে এসব থেকে বাঁচাতে পারবে তা অবলম্বন করাও জরুরী; কারণ হাদীসে পেশাব থেকে না বাঁচার কারণে কবরে শাস্তি হওয়ার বিষয়টি সাব্যস্ত হয়েছে। ৫. 'ইস্তেআযাহ' হচ্ছে অদৃশ্য শত্রুর ক্ষতি থেকে বাঁচার জন্য আশ্রয় চাওয়া। এটি আল্লাহ ব্যতীত অন্য কারো কাছে চাওয়ার অর্থ হচ্ছে শির্ক করা। সুতরাং ইস্তেআযাহ কেবল আল্লাহর কাছেই চাইতে হবে।",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": "375.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৮, আন্তর্জাতিক নাম্বারঃ ৩৭৫ ৭১৮-(.../...) আবূ বকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) ..... 'আবদুল আযীয (রহঃ) থেকে অবিকল বর্ণিত রয়েছে। এ বর্ণনায় \"আউযু বিল্লা-হি মিনাল খুবসি ওয়াল খবা-য়িস\" এর উল্লেখ আছে। (ইসলামিক ফাউন্ডেশনঃ ৭১৬, ইসলামিক সেন্টারঃ ৭৩১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": "376.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭১৯, আন্তর্জাতিক নাম্বারঃ ৩৭৬ ৭১৯-(১২৩/৩৭৬) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বণিত। তিনি বলেছেন, একদা সালাতের ইকামাত দেয়া হয়ে গেল। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখনও এক লোকের সঙ্গে চুপে চুপে আলাপ করছিলেন। লোকেরা বসে বসে ঘুমিয়ে না পড়া পর্যন্ত তিনি সালাতে এসে দাঁড়াননি। সালাতে দাঁড়াতে দাঁড়াতে তার দেরি হওয়ায় লোকেরা (বসে বসে) ঘুমিয়ে পড়েছিল। (ইসলামিক ফাউন্ডেশনঃ ৭১৭, ইসলামিক সেন্টারঃ ৭৩২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": "376.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭২০, আন্তর্জাতিক নাম্বারঃ ৩৭৬ ৭২০-(১২৪/...) উবাইদুল্লাহ ইবনু মু'আয আল 'আম্বারী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেছেন, একদিন সালাতের জন্যে ইকামাত দেয়া হয়ে গেল। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখনও এক ব্যক্তির সাথে চুপে চুপে আলাপ করছিলেন। তিনি দীর্ঘক্ষণ আলাপ করলেন। এমনকি সাহাবারা সবাই ঘুমিয়ে পড়লেন। এরপর তিনি আসলেন এবং তাদের সাথে করে সালাত আদায় করলেন। (ইসলামিক ফাউন্ডেশনঃ ৭১৮, ইসলামিক সেন্টারঃ ৭৩৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": "376.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭২১, আন্তর্জাতিক নাম্বারঃ ৩৭৬ ৭২১-(১২৫/...) ইয়াহইয়া ইবনু হাবীব আল হারিসী (রহঃ) …. কাতাদাহ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আনাস (রাযিঃ) কে বলতে শুনেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবাগণ ঘুমিয়ে যেতেন তারপর সালাত আদায় করতেন কিন্তু ওযু করতেন না। বর্ণনাকারী শুবাহ (রাযিঃ) বলেন, আমি কাতাদাহকে বললাম \"আপনি কি নিজে আনাস (রাযিঃ) এর কাছ থেকে শুনেছেন\"? তিনি বললেন, “হ্যাঁ, আল্লাহর কসম!\" (ইসলামিক ফাউন্ডেশনঃ ৭১৯, ইসলামিক সেন্টারঃ ৭৩৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": "376.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭২২, আন্তর্জাতিক নাম্বারঃ ৩৭৬ ৭২২-(১২৬/...) আহমাদ ইবনু সাঈদ ইবনু সাখর আদ দারিমী (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (একদা) ইশার জামা'আত দাঁড়িয়ে গিয়েছিল। তখন এক লোক বলল, আমার কিছু প্রয়োজন আছে। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে তার সাথে আলাপ করতে লাগলেন। তিনি এতক্ষণ ধরে আলাপ করলেন যে, উপস্থিত সকলেই অথবা কিছু লোক ঘুমিয়ে পড়ল (বসে বসে)। তারপর তারা সালাত আদায় করল। (ইসলামিক ফাউন্ডেশনঃ ৭২০, ইসলামিক সেন্টার, ৭৩৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		}
	]
}