{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5114,
			"arabicnumber": "977.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০০৮, আন্তর্জাতিক নাম্বারঃ ১৯৭৭ ৫০০৮-(৩৭/১৯৭৭) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... বুরাইদাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কবর যিয়ারাত হতে তোমাদের বারণ করেছিলাম, এখন তোমরা যিয়ারাত করতে পার। আর আমি তোমাদের তিনদিনের বেশি কুরবানীর গোশত খেতে নিষেধ করেছিলাম, এখন তোমরা নিজেদের প্রয়োজন অনুপাতে জমা করে রাখতে পার। আমি আরো তোমাদের নিষেধ করেছিলাম চর্ম দ্বারা নির্মিত পাত্র ব্যতীত অন্যান্য সকল পাত্রে তৈরি নবীয (খেজুর ভেজানো পানি) পান করতে, এখন তোমরা যে কোন পাত্র থেকেই পান করতে পারো। তবে যা কিছু নেশা সৃষ্টি করে তা পান করো না। (ইসলামিক ফাউন্ডেশন ৪৯৫২, ইসলামিক সেন্টার ৪৯৫৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5115,
			"arabicnumber": "977.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০০৯, আন্তর্জাতিক নাম্বারঃ ১৯৭৭ ৫০০৯-(.../...) হাজ্জাজ ইবনু শাইর (রহঃ) ..... বুরাইদাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি তোমাদের বারণ করেছিলাম .....। তারপর রাবী আবূ সিনানের হাদীসের অবিকল অর্থ বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪৯৫৩, ইসলামিক সেন্টার ৪৯৫৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5127,
			"arabicnumber": "1979.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২১, আন্তর্জাতিক নাম্বারঃ ১৯৭৯ ৫০২১-(১/১৯৭৯) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ... আলী ইবনু আবূ তালিব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বাদর দিবসে আমি গনীমাত (যুদ্ধলব্ধ মাল) হতে একটি বয়স্ক উট পেয়েছিলাম। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে আর একটি বয়স্ক উট দিয়েছিলেন। একদিন আমি জনৈক আনসারী ব্যক্তির দরজার সামনে সে দুটি বেঁধে রাখলাম। আমার আকাঙ্ক্ষা ছিল, সে দুটির পিঠে করে কিছু ইযখির ঘাস বয়ে আনবো, আর তা বিক্রয় করে ফাতিমাহ (রাযিঃ) এর ওয়ালীমায় সাহায্য নিব। আমার সঙ্গে ছিল বানু কাইনুকা গোত্রের জনৈক স্বর্ণকার। হামযাহ ইবনু আবদুল মুত্তালিব (রাযিঃ) সে বাড়িতেই মদ পান করছিল। তার সাথে ছিল একজন গায়িকা। সে (তার গানের মধ্যে) বললঃأَلاَ يَا حَمْزَ لِلشُّرُفِ অর্থাৎ- হে হামযাহ! হৃষ্টপুষ্ট উট দু'টির কাছে যাও এবং তোমার মেহমানদের জন্য তা যাবাহ করো। তারপর হামযাহ ও দুটির নিকট ছুটে গেল। পরে দুটিরই কুঁজ* কেটে ফেললো এবং তাদের পেট ফেড়ে দিল। তারপর সে এ দু'টির কলিজা বের করে নিল। আমি ইবনু শিহাবকে বললাম, তিনি কুঁজ দুটি কি করলেন? তিনি বললেন, কুঁজ দুটি কেটে সাথে নিয়ে চললেন। ইবনু শিহাব বলেন, আলী (রাযিঃ) বলেছেন, এ মর্মান্তিক দৃশ্য দেখে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেলাম। তার নিকট ছিল যায়দ ইবনু হারিসাহ (রাযিঃ)। এরপর আমি তাকে পুরো ঘটনা জানালাম। তিনি যায়দ (রাযিঃ) কে সঙ্গে নিয়ে বের হলেন। আমিও তার সাথে চললাম। হামযাহ (রাযিঃ) এর নিকট গিয়ে তিনি তাকে কিছু কঠিন কথা বললেন। হামযাহ (রাযিঃ) চোখ তুলে বলল, তোমরা তো আমার বাবার ক্রীতদাস ছাড়া কিছু নও। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিছন দিকে ফিরে আসলেন। এমনকি তিনি তাদের নিকট থেকে বেরিয়ে চলে এলেন। (ইসলামিক ফাউন্ডেশন ৬ষ্ঠ খণ্ড-৪৯৬৪, ইসলামিক সেন্টার ৪৯৭১) [বিঃদ্রঃ ৪৯৬৪ নম্বরটি ইসলামিক ফাউন্ডেশন বাংলাদেশ' ভুলক্রমে দুইবার দিয়েছে।] * জন্তুর বুক ও ঘাড়ের মাঝামাঝি উপরের অংশে বৃহৎ যে গোশতপিণ্ড তাকে তাকে কুঁজ বলা হয়।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5128,
			"arabicnumber": "1979.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২২, আন্তর্জাতিক নাম্বারঃ ১৯৭৯ ৫০২২-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু জুরায়জ (রহঃ) হতে এ সূত্রে হুবহু বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৬৫, ইসলামিক সেন্টার ৪৯৭২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৩, আন্তর্জাতিক নাম্বারঃ ১৯৭৯ ৫০২৩-(২/...) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... আলী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, বদরের দিন আমি গনীমাত থেকে আমার ভাগে একটি বয়স্ক উট পেয়েছিলাম। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেদিন এক পঞ্চমাংশ থেকে আমাকে আর একটি উট দিয়েছিলেন। আমি যখন রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তনয়া ফাতিমাহ এর সাথে বাসর যাপনের আকাজক্ষা করলাম, তখন বানু কাইনুকা গোত্রের জনৈক স্বর্ণকার ও আমি উভয়ে অঙ্গীকারাবদ্ধ হলাম। সে আমার সাথে যাবে আর আমরা (দু’জনে) ইযখির (ঘাস) নিয়ে আসবো। আমি ইচ্ছা করলাম, এগুলো স্বর্ণকারদের কাছে বিক্রি করে তা দিয়ে আমার বিয়ের ওয়ালীমার বিষয়ে সাহায্য নিব। আমি উট দু'টির জন্য বসার গদি, থলে এবং রশি ইত্যাদি জিনিস সংগ্রহ করছিলাম। আর আমার উট দুটি একজন আনসার লোকের গৃহের পাশে বাধা ছিল। আমিও যা সংগ্রহ করার সংগ্রহ করলাম। এমন সময় অকস্মাৎ লক্ষ্য করি সে দু'টি (উটের) কুঁজ কেটে ফেলা হয়েছে, পেটের দিক কেটে ফেলা হয়েছে এবং উভয়ের কলিজা বের করে নেয়া হয়েছে। আমার দু’ নয়ন এ দৃশ্য সহ্য করতে পারল না। আমি বলে উঠলাম, এ কাজ কোন্‌ লোক করল? লোকেরা, বলল হামযাহ্ ইবনু আবদুল মুত্তালিব। সে এ বাড়িতে আনসারদের একদল মদ্যপায়ীকারীদের মাঝে আছে। তাকে ও তার সঙ্গীদেরকে গান শুনাচ্ছিল এক গায়িকা। সে তার গানে বললঃأَلاَ يَا حَمْزَ لِلشُّرُفِ النِّوَاءِ অর্থাৎ- হে হামযাহ! তুমি হৃষ্টপুষ্ট উট দুটির সম্মুখে যাবে কি? পরে হামযাহ্ তরবারি নিয়ে উঠলো, উট দু'টির কুঁজ কেটে ফেললো, পশ্চাৎদিক চিড়ে ফেললো। অতঃপর ও দু’টোর কলিজা নিয়ে গেল। আলী (রাযিঃ) বলেন, সরাসরি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকটে গিয়ে উপস্থিত হলাম, তখন তার কাছে ছিল যায়দ ইবনু হারিসাহ (রাযিঃ)। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার অবয়ব দেখে বুঝতে পারলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার কি হয়েছে? আমি বললাম, হে আল্লাহর রসূল! আল্লাহর কসম, আজকের দিনের মতো আমি আর কখনও দেখিনি। হামযাহ আমার উট দুটির উপর ক্ষিপ্ত হয়ে উভয়ের কুঁজ দুটি কেটে ফেলেছে, পিছনের দিক কেটে ফেলেছে এবং কলিজা খুলে নিয়েছে। সে ঐ গৃহে আছে আর তার সাথে আছে মদ্যপায়ীদের কিছু লোক। তিনি বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার চাদর নিয়ে আসতে বললেন। অতঃপর তা পরিধান করে হাটতে লাগলেন। আমি এবং যায়দ ইবনু হারিসাহ তার পিছনে পিছনে অনুকরণ করলাম। পরিশেষে তিনি সে ঘরের দরজায় এসে অনুমতি চাইলেন যে ঘরে হামযাহ ছিল। তারা তাকে অনুমতি দিল। তিনি প্রবেশ করেই লক্ষ্য করলেন মদ্যপায়ীর দল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হামযার অপকর্মের জন্য তাকে শাসন ও নিন্দা করতে লাগলেন। এমতাবস্থায় হামযার চোখ দুটি লাল হয়ে গেল। সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দিকে দৃষ্টি নিক্ষেপ করলো। এরপর সে তার হাটুর দিকে তাকালো, তারপর আরো উচুতে দৃষ্টি নিবদ্ধ করল তার নাভীর দিকে, এরপর দৃষ্টি উঠালো তার চেহারার দিকে। এরপর হামযাহ বলল, তোমরা তো আমার পিতার গোলাম ছাড়া কিছুই নও। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বুঝতে পারলেন সে নেশাগ্রস্ত, তখন তিনি পিছনে হেঁটে বের হয়ে পড়লেন। আমরাও তার সাথে বের হলাম। (ইসলামিক ফাউন্ডেশন ৪৯৬৬, ইসলামিক সেন্টার ৪৯৭৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5130,
			"arabicnumber": "1979.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৪, আন্তর্জাতিক নাম্বারঃ ১৯৭৯ ৫০২৪-(.../...) মুহাম্মদ ইবনু আবদুল্লাহ ইবনু কুহযায (রহঃ) ..... যুহরী (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ৪৯৬৬, ইসলামিক সেন্টার ৪৯৭৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5131,
			"arabicnumber": "1980.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৫, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০২৫-(৩/১৯৮০) আবূ রাবী' সুলাইমান ইবনু দাউদ আতাকী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মদ হারাম হওয়ার দিন আমি আবূ তালহার ঘরে লোকদের মদ পান করাচ্ছিলাম। তারা শুকনো ও কাঁচা খেজুরের মদ পান করতো (অর্থাৎ শুকনো ও কাঁচা খেজুর দ্বারা তৈরি ঘন তৈলাক্ত ও সিরকা পান করতো)। হঠাৎ শুনা গেল জনৈক লোক ঘোষণা দিচ্ছে। তিনি বললেন, বের হয়ে দেখো। আমি বের হয়ে দেখলাম, এক লোক ঘোষণা দিচ্ছেঃ শুনে রাখো, মদ নিষিদ্ধ করা হয়েছে। তিনি বলেন, অতঃপর মদীনার চারপাশে ও অলিগলি দিয়ে মদের ঢল প্রবাহিত বইতে থাকে। আবূ তালহাহ আমাকে বললেন, বের হও এবং এগুলো ঢেলে দিয়ে আসো। অতঃপর আমি সেগুলো ঢেলে দেই। তারা সবাই বা তাদের কেউ কেউ বললেন, অমুকে নিহত হয়েছে। অমুকে নিহত হয়েছে! অথচ তাদের উদরে মদ আছে। রাবী বলেন, আমি জ্ঞাত নই যে, এ কথাও আনাস (রাযিঃ) এর হাদীসের অন্তর্ভুক্ত কি-না। এরপর আল্লাহ তা'আলা নাযিল করেনঃ “যারা ঈমান এনেছে ও সৎকর্ম করেছে তারা পূর্বে যা খেয়েছে তাতে তাদের কোন গুনাহ নেই, যদি তারা সতর্ক হয় এবং ঈমান আনে ও সৎকাজ করে\"- (সূরা আল-মায়িদাহ্ ৫ঃ ৯৩)। (ইসলামিক ফাউন্ডেশন ৪৯৬৭, ইসলামিক সেন্টার ৪৯৭৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5132,
			"arabicnumber": "1980.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৬, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০২৬-(৪/…) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আবদুল আযীয ইবনু সুহায়ব (রহঃ) হতে বর্ণিত। তিনি বলেন, মানুষেরা আনাস (রাযিঃ)-কে প্রশ্ন করল 'ফাযীখ’ (খেজুরের তৈরি মদ) সম্পর্কে। তিনি বললেন, তোমরা যাকে ‘ফাযীখ’ বলে সম্বোধন কর, তোমাদের এ ফাযীখ ব্যতীত আমাদের আর কোন মদ-ই ছিল না। আমি আমাদের ঘরে আবূ তালহা, আবূ আইয়্যুব (রাযিঃ) এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আরো কতিপয় সাহাবীকে মদপান করাতে মত্ত ছিলাম। এমন সময় এক লোক এসে বলল, তোমাদের নিকট কি কোন সংবাদ এসেছে? আমরা বললাম, না। সে বলল, মদ তো সম্পূর্ণরূপে নিষেধ করা হয়েছে। তিনি (আবূ তালহা) বললেন, হে আনাস! এ মদের কলসগুলো ঢেলে দাও। তিনি বলেন, তারা উক্ত ব্যক্তির সংবাদের পর কোন খোঁজখবরও করেননি। এ সম্পর্কে কোন জিজ্ঞাসাবাদও করেননি। (ইসলামিক ফাউন্ডেশন ৪৯৬৮, ইসলামিক সেন্টার ৪৯৭৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5133,
			"arabicnumber": "1980.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৭, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০২৭-(৫/...) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার সম্প্রদায়ের লোকদের মধ্যখানে দাঁড়িয়ে আমার চাচাদের 'ফাযীখ' পান করাচ্ছিলাম। আর বয়সে আমি তাদের সবার ছোট ছিলাম। এ সময় এক লোক এসে বলল, মদ তো হারাম করা হয়েছে। তারা সবাই বললেন, হে আনাস! এ হাড়িগুলো উল্টিয়ে দাও। আমি সেগুলো উপুড় করে ফেলে দিলাম। সুলাইমান বলেন, আমি আনাসকে বললাম, ফাযীখ কি জিনিস? তিনি বললেন, কাঁচা-পাকা খেজুর দ্বারা তৈরিকৃত মদ। তিনি বলেন, আবূ বাকর ইবনু আনাস বলেছেন, তখন এটাই ছিল তাদের একমাত্র নেশাজাতীয় দ্রব্য। সুলাইমান বলেন, আমার নিকটে জনৈক লোক আনাস ইবনু মালিক (রাযিঃ) হতে রিওয়ায়াত করেছেন যে, তিনিও (আনাস) এ কথা বলেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৬৯, ইসলামিক সেন্টার ৪৯৭৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5134,
			"arabicnumber": "1980.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৮, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০২৮-(৬/...) মুহাম্মাদ ইবনু আবদুল আ'লা (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি সম্প্রদায়ের মাঝে দাঁড়িয়ে তাদের মদপান করাচ্ছিলাম। এরপর বর্ণনাকারী ইবনু উলাইয়্যার মতো বর্ণনা করেন। তবে তিনি বলেন, তারপর আবূ বাকর ইবনু আনাস বললেন, সেকালে ওটাই ছিল তাদের মদ। আনাস (রাযিঃ) তথায় উপস্থিত ছিলেন, তিনি এ কথা অস্বীকার করেননি। ইবনু আবদুল আ'লা মু'তামির এর সূত্রে তার বাবা হতে বর্ণনা করেন যে, তিনি বলেছেনঃ যারা তার সাথে ছিল তাদের একজন আমার কাছে বর্ণনা করেছেন, তিনি আনাস (রাযিঃ) কে বলতে শুনেছেন, \"তৎকালীন সময়ে সেটাই ছিল তাদের মদ।\" (ইসলামিক ফাউন্ডেশন ৪৯৭০, ইসলামিক সেন্টার ৪৯৭৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5135,
			"arabicnumber": "1980.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০২৯, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০২৯-(৭/...) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ তালহাহ, আবূ দুজানাহ ও মু'আয ইবনু জাবাল (রাযিঃ) কে আনসারীদের একদল মানুষের মাঝে মদপান করাচ্ছিলাম। তখন এক লোক আমাদের নিকট এসে বলল, একটি নতুন ব্যাপার ঘটেছে, মদ নিষিদ্ধ করা হয়েছে। অতঃপর আমরা তখন পাত্রগুলো উপুড় করে ঢেলে দিয়েছিলাম। সে মদ ছিল কাঁচা-পাকা মিশ্ৰিত খেজুরের বানানো। কাতাদাহ্ বলেন, আনাস ইবনু মালিক (রাযিঃ) বলেছেন, মদকে হারাম করা হয়েছে। সেকালে তাদের সাধারণ মদ ছিল কাঁচা-পাকায় সংমিশ্রিত খেজুরের তৈরি। (ইসলামিক ফাউন্ডেশন ৪৯৭১, ইসলামিক সেন্টার ৪৯৭৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5136,
			"arabicnumber": "1980.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩০, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০৩০-(…/...) আবূ গাসসান আল-মিসমাঈ, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি এমন একটি মদপাত্র হতে আবূ তালহাহ, আবূ দুজানাহ ও সুহায়ল ইবনু বাইযা (রাযিঃ) কে মদপান করাচ্ছিলাম যার মধ্যে কাঁচা-পাকা খেজুরের মদ ছিল। অতঃপর বর্ণনাকারী সাঈদ (রহঃ) এর হাদীসের হুবহু রিওয়ায়াত করেন। (ইসলামিক ফাউন্ডেশন ৪৯৭২, ইসলামিক সেন্টার ৪৯৮০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5137,
			"arabicnumber": "1981",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩১, আন্তর্জাতিক নাম্বারঃ ১৯৮১ ৫০৩১-(৮/১৯৮১) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাঁচা-পাকা খেজুর দিয়ে মদ তৈরি করা এবং তা পান করা থেকে বারণ করেছেন। সেদিন তাই ছিল তাদের সাধারণ নেশাজাতীয় দ্রব্য যেদিন মদ হারাম করা হয়। (ইসলামিক ফাউন্ডেশন ৪৯৭৩, ইসলামিক সেন্টার ৪৯৮১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5138,
			"arabicnumber": "1980.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩২, আন্তর্জাতিক নাম্বারঃ ১৯৮০ ৫০৩২-(৯/১৯৮০) আবূ তাহির (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ উবাইদাহ্ ইবনু জাররাহ, আবূ তালহাহ উবাই ইবনু কা'ব (রাযিঃ) কে মদপান করাচ্ছিলাম, যা কাঁচা ও শুকনো খেজুর দিয়ে তৈরি ছিল। অতঃপর জনৈক আগত ব্যক্তি এসে বলল, মদ তো হারাম ঘোষণা করা হয়েছে। আবূ তালহাহ্ (রাযিঃ) বললেন, হে আনাস! তুমি সে কলসটির কাছে গিয়ে তা ভেঙ্গে ফেল। আমি আমাদের মিহ্রাসটির (ছিদ্রযুক্ত পাথর) নিকট গেলাম এবং কলসের নিম্নাংশে আঘাত করলাম। যার দরুন সেটি ভেঙ্গে টুকরো টুকরো হয়ে গেল। (ইসলামিক ফাউন্ডেশন ৪৯৭৪, ইসলামিক সেন্টার ৪৯৮২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5139,
			"arabicnumber": "1982",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৩, আন্তর্জাতিক নাম্বারঃ ১৯৮২ ৫০৩৩-(১০/১৯৮২) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জা'ফার (রহঃ) হতে বর্ণিত। তিনি আনাস ইবনু মালিক (রাযিঃ) কে বলতে শুনেছেন যে, আল্লাহ তা'আলা যে আয়াতে মদ নিষিদ্ধ করেছেন, সেটি এমন সময় তৈরি করেছেন, যখন মদীনায় শুধুমাত্র খেজুরের তৈরি মদপান করা হত। (ইসলামিক ফাউন্ডেশন ৪৯৭৫, ইসলামিক সেন্টার ৪৯৮৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5140,
			"arabicnumber": "1983",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৪, আন্তর্জাতিক নাম্বারঃ ১৯৮৩ ৫০৩৪-(১১/১৯৮৩) ইয়াহইয়া ইবনু ইয়াহইয়া ‘আবদুর রহমান ইবনু মাহদী ও যুহায়র ইবনু হারব (রহঃ) ... আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মদ দিয়ে সিরকা তৈরি করা সম্পর্কে প্রশ্ন করা হলে তিনি বললেন, না। (ইসলামিক ফাউন্ডেশন ৪৯৭৬, ইসলামিক সেন্টার ৪৯৮৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5141,
			"arabicnumber": "1984",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৫, আন্তর্জাতিক নাম্বারঃ ১৯৮৪ ৫০৩৫-(১২/১৯৮৪) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... ওয়ায়িল আল-হাযরামী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, তারিক ইবনু সুওয়াইদ জুকী (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মদ সম্পর্কে প্রশ্ন করলেন। তিনি তাকে বারণ করলেন, কিংবা মদ প্রস্তুত করাকে খুব জঘন্য মনে করলেন। তিনি [তারিক (রাযিঃ)] বললেন, আমি তো শুধু ঔষধ তৈরি করার জন্য মদ প্রস্তুত করি। তিনি বললেনঃ এটি তো (ব্যাধি নিরামক) ঔষধ নয়, বরং এটি নিজেই ব্যাধি। (ইসলামিক ফাউন্ডেশন ৪৯৭৭, ইসলামিক সেন্টার ৪৯৮৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5142,
			"arabicnumber": "1985.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৬, আন্তর্জাতিক নাম্বারঃ ১৯৮৫ ৫০৩৬-(১৩/১৯৮৫) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদ তৈরি হয় দুটি গাছ (এর ফল) হতে, তা হলো- খেজুর ও আঙ্গুর গাছ (এর ফল)। (ইসলামিক ফাউন্ডেশন ৪৯৭৮, ইসলামিক সেন্টার ৪৯৮৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5143,
			"arabicnumber": "1985.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৭, আন্তর্জাতিক নাম্বারঃ ১৯৮৫ ৫০৩৭-(১৪/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, মদ তৈরি হয় ঐ দুটি গাছ (এর ফল) থেকে, তা হলো খেজুর ও আঙ্গুর গাছ (এর ফল)। (ইসলামিক ফাউন্ডেশন ৪৯৭৯, ইসলামিক সেন্টার ৪৯৮৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5144,
			"arabicnumber": "1985.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৮, আন্তর্জাতিক নাম্বারঃ ১৯৮৫ ৫০৩৮-(১৫/...) যুহায়র ইবনু হারব (রহঃ) ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদ তৈরি হয় ঐ দুটি গাছ (এর ফল) থেকে, তা হলো- আঙ্গুর ও খেজুর গাছ (এর ফল)। আবূ কুরায়ব (রহঃ) এর বর্ণনায় আঙ্গুরকে খেজুর বলা হয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৮০, ইসলামিক সেন্টার ৪৯৮৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5145,
			"arabicnumber": "1986.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৩৯, আন্তর্জাতিক নাম্বারঃ ১৯৮৬ ৫০৩৯-(১৬/১৯৮৬) শাইবান ইবনু ফাররূখ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ আনসারী (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিসমিস ও শুকনো খেজুর এবং কাঁচা-পাকা খেজুর একসাথে মিশিয়ে নবীয বানাতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৮১, ইসলামিক সেন্টার ৪৯৮৯) [নাবীয় বলা হয় কাঁচা বা পাকা খেজুর, খোরমা, কিসমিস যে কোন এক প্রকারের ফল পরিমাণ মত নিয়ে কাচের পেয়ালাতে পরিমাণ মত পানিতে কয়েক ঘণ্টা ভিজিয়ে রাখার পর যা তৈরি হয় সেটাকে চটকিয়ে রস করে প্রয়োজনে ছেকে নিয়ে পান করা হয়। তবে তাতে ফেনা উঠে গেলে খাওয়া নিষিদ্ধ এজন্য যে, সেটাতে নেশার উপকরণ তৈরি হয়ে থাকে।]",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5146,
			"arabicnumber": "1986.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪০, আন্তর্জাতিক নাম্বারঃ ১৯৮৬ ৫০৪০-(১৭/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ আনসারী (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুকনো খেজুর ও কিসমিস একত্র করে নবীয তৈরি করতে নিষেধ করেছেন। তিনি আরও নিষেধ করেছেন কাঁচা-পাকা খেজুর একত্র মিশিয়ে নবীয বানানো থেকে। (ইসলামিক ফাউন্ডেশন ৪৯৮২, ইসলামিক সেন্টার ৪৯৯০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5147,
			"arabicnumber": "1986.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪১, আন্তর্জাতিক নাম্বারঃ ১৯৮৬ ৫০৪১-(১৮/...) মুহাম্মদ ইবনু হাতিম, ইসহাক ইবনু ইবরাহীম ও মুহাম্মদ ইবনু রাফি (রহঃ) ...... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কাঁচা-পাকা খর্জুর (খেজুর) এবং কিসমিস ও খোরমা মিশ্রণ করে নবীয বানিও না। (ইসলামিক ফাউন্ডেশন ৪৯৮৩, ইসলামিক সেন্টার ৪৯৯১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5148,
			"arabicnumber": "1986.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪২, আন্তর্জাতিক নাম্বারঃ ১৯৮৬ ৫০৪২-(১৯/...) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ আনসারী (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিসমিস ও খোরমা মিশিয়ে 'নবীয' বানাতে বারণ করেছেন। তিনি একসাথে কাঁচা-পাকা খেজুর দিয়ে 'নবীয’ প্রস্তুত করতেও বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৮৪, ইসলামিক সেন্টার ৪৯৯২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5149,
			"arabicnumber": "1987.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৩, আন্তর্জাতিক নাম্বারঃ ১৯৮৭ ৫০৪৩-(২০/১৯৮৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খোরমা ও কিসমিস একসঙ্গে মিশ্রণ (করে নবীয তৈরি) করতে বারণ করেছেন এবং কাঁচা-পাকা খেজুর একত্র (করে নবীব তৈরি) করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৮৫, ইসলামিক সেন্টার ৪৯৯৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5150,
			"arabicnumber": "1987.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৪, আন্তর্জাতিক নাম্বারঃ ১৯৮৭ ৫০৪৪-(২১/…) ইয়াহইয়া ইবনু আইয়ূব (রহঃ) .... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে (নবীয তৈরিতে) কিসমিস ও শুকনো খেজুর এবং কাঁচা-পাকা খেজুর একসাথে মিশাতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৮৬, ইসলামিক সেন্টার ৪৯৯৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5151,
			"arabicnumber": "1987.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৫, আন্তর্জাতিক নাম্বারঃ ১৯৮৭ ৫০৪৫-(.../...) নাসর ইবনু আলী জাহযামী (রহঃ) ..... আবূ মাসলামাহ্ (রহঃ) হতে উপরোল্লিখিত সানাদে একইভাবে বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৮৭, ইসলামিক সেন্টার ৪৯৯৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5152,
			"arabicnumber": "1987.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৬, আন্তর্জাতিক নাম্বারঃ ১৯৮৭ ৫০৪৬-(২২/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি নবীয (খেজুর বা আঙ্গুর ভেজানো পানি) পান করতে ইচ্ছা পোষণ করে, সে যেন কিসমিস বা শুকনো খেজুর অথবা কাঁচা খেজুর দ্বারা আলাদাভাবে নবীয তৈরি করে তা পান করে। (ইসলামিক ফাউন্ডেশন ৪৯৮৮, ইসলামিক সেন্টার ৪৯৯৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5153,
			"arabicnumber": "1987.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৭, আন্তর্জাতিক নাম্বারঃ ১৯৮৭ ৫০৪৭-(২৩/...) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... ইসমাঈল ইবনু মুসলিম আবদী (রহঃ) হতে উল্লেখিত সানাদে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বারণ করেছেন, যেন আমরা কাঁচা খেজুর শুকনো খেজুরের সঙ্গে না মেশাই অথবা কিসমিস খোরমার সঙ্গে না মেশাই অথবা কিসমিস কাঁচা খেজুরের সাথে না মেশাই। তিনি আরও বলেন, তোমাদের মাঝে যে তা পান করতে আগ্রহী। অতঃপর বর্ণনাকারী ওয়াকী' (রহঃ) এর হাদীসের অবিকল বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৪৯৮৮, ইসলামিক সেন্টার ৪৯৯৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5154,
			"arabicnumber": "1988.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৮, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৪৮-(২৪/১৯৮৮) ইয়াহইয়া ইবনু আইয়ূব (রহঃ) ..... আবদুল্লাহ ইবনু আবূ কাতাদাহ্ সূত্রে তাঁর পিতা আবূ কাতাদাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কাঁচা-পাকা খেজুর একসাথে করে নবীয বানাবে না। কিসমিস ও খোরমা একত্র করেও নবীয প্রস্তুত করবে না বরং একেকটি আলাদাভাবে নবীয বানাবে। (ইসলামিক ফাউন্ডেশন ৪৯৮৯, ইসলামিক সেন্টার ৪৯৯৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5155,
			"arabicnumber": "1988.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৪৯, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৪৯-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইয়াহইয়া ইবনু আবূ কাসীর (রহঃ) হতে উল্লেখিত সূত্রে হুবহু বর্ণিত রয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৯০, ইসলামিক সেন্টার ৪৯৯৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5156,
			"arabicnumber": "1988.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫০, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৫০-(২৫/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কাঁচা-পাকা খেজুর একসাথে মিশিয়ে নবীয বানাবে না এবং কাঁচা খেজুর ও কিসমিস একত্রে মিশিয়ে নবীয বানাবে না বরং একেকটি দ্বারা আলাদাভাবে নবীয বানাবে। ইয়াহইয়া ধারণা করেন যে, তিনি আবদুল্লাহ ইবনু আবূ কাতাদার সঙ্গে দেখা করলে তিনি তার পিতার সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস তার নিকটে রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৯১, ইসলামিক সেন্টার ৫০০০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5157,
			"arabicnumber": "1988.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫১, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৫১-(…/...) আবূ বকর ইবনু ইসহাক (রহঃ) ..... ইয়াহইয়া ইবনু আবূ কাসীর (রহঃ) হতে উপরোক্ত الزَّهْوَ وَالرُّطَبَ এর স্থলেالرُّطَبَ وَالزَّهْوَ এবংالرُّطَبَ وَالزَّبِيبَ এর স্থলেالتَّمْرَ وَالزَّبِيبَ শব্দ উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৯১, ইসলামিক সেন্টার ৫০০১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5158,
			"arabicnumber": "1988.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫২, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৫২-(২৬/…) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাঁচা ও শুকনো খেজুর একত্র সংমিশ্রণ করা হতে এবং কিসমিস ও শুকনো খেজুর সংমিশ্রণ করা থেকে এবং কাঁচা পাকা খেজুর সংমিশ্রণ করা হতে বারণ করেছেন। তিনি বলেছেন, প্রত্যেকটি দিয়ে আলাদাভাবে নবীয বানাও। (ইসলামিক ফাউন্ডেশন ৪৯৯২, ইসলামিক সেন্টার ৫০০২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5159,
			"arabicnumber": "1988.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৩, আন্তর্জাতিক নাম্বারঃ ১৯৮৮ ৫০৫৩-(.../...) ইয়াহইয়া (রহঃ) বলেন, আবূ সালামাহ্ ইবনু আবদুর রহমান (রহঃ) আবূ কাতাদাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৯৩, ইসলামিক সেন্টার ৫০০২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5160,
			"arabicnumber": "1989.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৪, আন্তর্জাতিক নাম্বারঃ ১৯৮৯ ৫০৫৪-(২৬/১৯৮৯) যুহায়র ইবনু হারব ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিসমিস ও শুকনো খেজুর (একত্রে মিশিয়ে নবীয প্রস্তুত করা) হতে নিষেধ করেছেন। তিনি বলেছেন, প্রত্যেকটি দিয়ে পৃথকভাবে নবীয বানানো যেতে পারে। (ইসলামিক ফাউন্ডেশন ৪৯৯৪ ইসলামিক সেন্টার ৫০০৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5161,
			"arabicnumber": "1989.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৫, আন্তর্জাতিক নাম্বারঃ ১৯৮৯ ৫০৫৫-(.../...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন ..... অতঃপর রাবী অবিকল হাদীস রিওয়ায়াত করেন। (ইসলামিক ফাউন্ডেশন ৪৯৯৪, ইসলামিক সেন্টার ৫০০৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5162,
			"arabicnumber": "1990.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৬, আন্তর্জাতিক নাম্বারঃ ১৯৯০ ৫০৫৬-(২৭/১৯৯০) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুকনো খেজুর ও কিসমিস সংমিশ্রণে এবং কাঁচা ও শুকনো খেজুর মিশিয়ে নবীয প্রস্তুত করতে বারণ করেছেন। তিনি জুরাশ (ইয়ামানের একটি শহর) অধিবাসীদের চিঠি লিখে তাদেরকে শুকনো খেজুর ও কিসমিসের মিশ্রণে নবীয প্রস্তুত করতে বারণ করেন। (ইসলামিক ফাউন্ডেশন ৪৯৯৫, ইসলামিক সেন্টার ৫০০৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5163,
			"arabicnumber": "1990.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৭, আন্তর্জাতিক নাম্বারঃ ১৯৯০ ৫০৫৭-(…/...) বর্ণনাকারী বলেন, আমাকে ওয়াহব ইবনু বাকিয়্যাহ খালিদ তাহহান (রহঃ) এর সানাদে শাইবানী (রহঃ) হতে উল্লেখিত সূত্রে শুকনো খেজুর ও কিসমিসের কথা বর্ণনা করেছেন। তবে তিনি (ওয়াহব) কাঁচা ও শুকনো খেজুরের কথা বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৪৯৯৫, ইসলামিক সেন্টার ৫০০৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5164,
			"arabicnumber": "1991.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৮, আন্তর্জাতিক নাম্বারঃ ১৯৯১ ৫০৫৮-(২৮/১৯৯১) মুহাম্মাদ ইবনু রাফি’ (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, তিনি বলতেন, কাঁচা-পাকা খেজুর একসাথে এবং শুকনো খেজুর ও কিসমিস একত্রে মিশিয়ে নবীয তৈরি করতে বারণ করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৯৬, ইসলামিক সেন্টার ৫০০৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5165,
			"arabicnumber": "1991.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৫৯, আন্তর্জাতিক নাম্বারঃ ১৯৯১ ৫০৫৯-(২৯/...) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কাঁচা-পাকা খেজুর মিশিয়ে এবং শুকনো খেজুর ও কিসমিস মিশ্রণে নবীয তৈরি করতে বারণ করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৪৯৯৭, ইসলামিক সেন্টার ৫০০৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5166,
			"arabicnumber": "1992.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬০, আন্তর্জাতিক নাম্বারঃ ১৯৯২ ৫০৬০-(৩০/১৯৯২) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা ও মুযাফফাতে নবীয প্রস্তুত করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৯৮, ইসলামিক সেন্টার ৫০০৮) মুযাফফাত, দুব্বা, হানতাম ও নাকীর- (১) মুযাফফাত- আলকাতরা মাখানো এক প্রকার পাত্র যাতে মদ প্রস্তুত করা হত। (২) দুব্বা- লাউয়ের শুকনো খোলা-এর বাসন যাতে মদ প্রস্তুত করা হত। (৩) হানতাম- সবুজ রং-এর কলসী যাতে মদ প্রস্তুত করা হতো। (৪) নাকীর- খেজুর বৃক্ষের গোড়ালি দ্বারা প্রস্তুত বিশেষ পাত্র।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5167,
			"arabicnumber": "1992.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬১, আন্তর্জাতিক নাম্বারঃ ১৯৯২ ৫০৬১-(৩১/...) আমর আন নাকিদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা ও মুযাফফাতে নবীয বানাতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৪৯৯৯, ইসলামিক সেন্টার ৫০০৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5168,
			"arabicnumber": "1993.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬২, আন্তর্জাতিক নাম্বারঃ ১৯৯৩ ৫০৬২-(.../১৯৯৩) বর্ণনাকারী বলেন, আবূ সালামাহ্ (রহঃ)-ও তাকে অবহিত করেছেন, তিনি আবূ হুরাইরাহ (রাযিঃ) কে বলতে শুনেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা দুব্বা ও মুযাফফাতে নবীয বানিও না। অতঃপর আবূ হুরাইরাহ (রাযিঃ) বলেন, হানতাম ব্যবহার করা থেকেও তোমরা সরে (বেঁচে) থাকো। (ইসলামিক ফাউন্ডেশন ৪৯৯৯, ইসলামিক সেন্টার ৫০০৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5169,
			"arabicnumber": "1993.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৩, আন্তর্জাতিক নাম্বারঃ ১৯৯৩ ৫০৬৩-(৩২/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযাফফাত, হানতাম ও নাকীর (ইত্যাদিতে নবীয প্রস্তুত করা) হতে বারণ করেছেন। রাবী বলেন, আবূ হুরাইরাহ (রাযিঃ) কে প্রশ্ন করা হলো, হানতাম কি জিনিস? তিনি বললেন, সবুজ রং-এর কলসী। (ইসলামিক ফাউন্ডেশন ৫০০০, ইসলামিক সেন্টার ৫০১০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5170,
			"arabicnumber": "1993.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৪, আন্তর্জাতিক নাম্বারঃ ১৯৯৩ ৫০৬৪-(৩৩/...) নাস্‌র ইবনু আলী জাহযামী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুল কায়সের প্রতিনিধি দলকে বলেছেন, আমি তোমাদেরকে দুব্বা, হানতাম, নাকীর ও মুকাইয়্যার হতে বারণ করছি। হানতাম হল মাথা কাটা চামড়ার বাসন হতে। আর তুমি তোমার চামড়ার বানানো মশক হতে নবীয পান করো এবং এর প্রবেশ মুখ আটকে রাখো (ইসলামিক ফাউন্ডেশন ৫০০১, ইসলামিক সেন্টার ৫০১১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5171,
			"arabicnumber": "1994",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৫, আন্তর্জাতিক নাম্বারঃ ১৯৯৪ ৫০৬৫-(৩৪/১৯৯৪) সাঈদ ইবনু আমর আশ'আসী, যুহায়র ইবনু হারব ও বিশর ইবনু খালিদ (রহঃ) ..... ‘আলী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা ও মুযাফফাতে নবীয প্রস্তুত করতে বারণ করেছেন। এ হলো জারীর (রহঃ) এর বর্ণিত হাদীস। আবসার ও শুবাহ্ (রহঃ) এর হাদীসে উল্লেখ আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা ও মুযাফফাত হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০০২, ইসলামিক সেন্টার ৫০১২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5172,
			"arabicnumber": "1995.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৬, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৬৬-(৩৫/১৯৯৫) যুহায়র ইবনু হারব (রহঃ) ..... ইবরাহীম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আসওয়াদ (রহঃ) কে বললাম, আপনি কি উম্মুল মুমিনীন আয়িশাহ (রাযিঃ) কে প্রশ্ন করেছিলেন- কোন জিনিসে নবীয প্রস্তুত করা মাকরূহ? তিনি বললেন, হ্যাঁ। আমি তখন বলেছিলাম, হে উম্মুল মু'মিনীন! আমাকে বলুন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন জিনিসে নবীয প্রস্তুত করতে বারণ করেছেন। তিনি বললেন, তিনি আমাদের পরিবারের সকলকে বারণ করেছেন, আমরা যেন দুব্বা ও মুযাফফাতে নবীয প্রস্তুত না করি। ইবরাহীম (রহঃ) বলেন, আমি আসওয়াদকে বললাম, তিনি [আয়িশাহ্ (রাযিঃ)] কি হানতাম ও কলসীর কথা বর্ণনা করেননি? তিনি বললেন, আমি যা শুনেছি, তাই তোমার কাছে বলছি। সেটিও কি তোমার কাছে বলতে হবে যা আমি শুনিনি? (ইসলামিক ফাউন্ডেশন ৫০০৩, ইসলামিক সেন্টার ৫০১৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5173,
			"arabicnumber": "1995.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৭, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৬৭-(৩৬/...) সাঈদ ইবনু আমর আশ'আসী (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা ও মুযাফফাত হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০০৪, ইসলামিক সেন্টার ৫০১৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5174,
			"arabicnumber": "1995.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৮, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৬৮-(…/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আয়িশাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু বর্ণনা করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫০০৫, ইসলামিক সেন্টার ৫০১৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5175,
			"arabicnumber": "1995.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৬৯, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৬৯-(৩৭/...) শাইবান ইবনু ফাররূখ (রহঃ) ..... সুমামাহ ইবনু হাযন কুশাইরী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) এর সাথে দেখা করে তাকে নবীয সম্বন্ধে প্রশ্ন করলাম। তিনি আমার কাছে উল্লেখ করলেন যে, আবদুল কায়সের প্রতিনিধি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসল এবং তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নবীয সম্পর্কে প্রশ্ন করল। তিনি দুব্বা, নাকীর, মুযাফফাত ও হানতাম-এ তাদেরকে নবীয প্রস্তুত করতে বারণ করলেন। (ইসলামিক ফাউন্ডেশন ৫০০৬, ইসলামিক সেন্টার ৫০১৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5176,
			"arabicnumber": "1995.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭০, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৭০-(৩৮/...) ইয়াকুব ইবনু ইবরাহীম (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা, হানতাম, নাকীর ও মুযাফফাত হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০০৭, ইসলামিক সেন্টার ৫০১৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5177,
			"arabicnumber": "1995.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭১, আন্তর্জাতিক নাম্বারঃ ১৯৯৫ ৫০৭১-(…/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইসহাক ইবনু সুওয়াইদ (রহঃ) হতে উপরোল্লিখিত সানাদে হাদীসটি বর্ণনা করেছেন। তবে তিনি ‘মুযাফফাত’ এর জায়গায় 'মুকাইয়্যার' শব্দটি ব্যবহার করেছেন। (ইসলামিক ফাউন্ডেশন ৫০০৮, ইসলামিক সেন্টার ৫০১৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5178,
			"arabicnumber": "17.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭২, আন্তর্জাতিক নাম্বারঃ ১৭ ৫০৭২-(৩৯/১৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ও খালাফ ইবনু হিশাম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল কায়সের প্রতিনিধি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলে তিনি বললেনঃ আমি তোমাদেরকে দুব্বা, হানতাম, নাকীর এবং মুকাইয়্যার হতে বারণ করছি। হাম্মাদ (রহঃ) বর্ণিত হাদীসে 'মুকাইয়্যার' স্থলে 'মুযাফফাত' শব্দটি উল্লেখ করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫০০৯, ইসলামিক সেন্টার ৫০১৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5179,
			"arabicnumber": "17.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৩, আন্তর্জাতিক নাম্বারঃ ১৭ ৫০৭৩-(৪০/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা, হানতাম, মুযাফফাত ও নাকীর হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০১০, ইসলামিক সেন্টার ৫০২০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5180,
			"arabicnumber": "17.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৪, আন্তর্জাতিক নাম্বারঃ ১৭ ৫০৭৪-(৪১/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন- দুব্বা, হানতাম, মুযাফফাত ও নাকীর থেকে এবং কাঁচা-পাকা খেজুর একসাথে মিশিয়ে নবীয প্রস্তুত করা থেকে। (ইসলামিক ফাউন্ডেশন ৫০১১, ইসলামিক সেন্টার ৫০২১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5181,
			"arabicnumber": "17.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৫, আন্তর্জাতিক নাম্বারঃ ১৭ ৫০৭৫-(৪২/...) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা, নাকীর ও মুযাফফাত হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০১২, ইসলামিক সেন্টার ৫০২২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5182,
			"arabicnumber": "1996.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৬, আন্তর্জাতিক নাম্বারঃ ১৯৯৬ ৫০৭৬-(৪৩/১৯৯৬) ইয়াহইয়া ইবনু ইয়াহইয়া ও ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কলসীতে নবীয তৈরি করতে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০১৩, ইসলামিক সেন্টার ৫০২৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5183,
			"arabicnumber": "1996.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৭, আন্তর্জাতিক নাম্বারঃ ১৯৯৬ ৫০৭৭-(৪৪/...) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা, হানতাম, নাকীর ও মুযাফফাত (এ নবীয বানানো) থেকে নিষেধ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০১৪, ইসলামিক সেন্টার ৫০২৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5184,
			"arabicnumber": "1996.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৮, আন্তর্জাতিক নাম্বারঃ ১৯৯৬ ৫০৭৮-(.../…) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... কাতাদাহ্ (রহঃ) হতে উল্লেখিত সূত্রে বর্ণিত যে, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নবীয বানাতে বারণ করেছেন। অতঃপর রাবী উল্লেখিত হাদীসের হুবহু বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৫০১৫, ইসলামিক সেন্টার ৫০২৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5185,
			"arabicnumber": "1996.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৭৯, আন্তর্জাতিক নাম্বারঃ ১৯৯৬ ৫০৭৯-(৪৫/...) নাসর ইবনু আলী আল-জাহযামী (রহঃ) ..... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন হানতাম, দুব্বা ও নাকীরের (বানানো নবীয) পান করতে। (ইসলামিক ফাউন্ডেশন ৫০১৬, ইসলামিক সেন্টার ৫০২৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5186,
			"arabicnumber": "1997.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮০, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮০-(৪৬/১৯৯৭) আবূ বাকর ইবনু আবূ শাইবাহ ও সুরায়জ ইবনু ইউনুস (রহঃ) ..... সাঈদ ইবনু জুবায়র (রাযিঃ) হতে বর্ণিত। ইবনু উমার ও ইবনু আব্বাস (রাযিঃ) সম্পর্কে আমি সাক্ষ্য দিচ্ছি যে, তারা দু’জনেই সাক্ষ্য দিয়েছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুব্বা, হানতাম, মুযাফফাত ও নাকীর (এ নবীয বানানো) হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০১৭, ইসলামিক সেন্টার ৫০২৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5187,
			"arabicnumber": "1997.02",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5188,
			"arabicnumber": "1997.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮২, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮২-(৪৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের উদ্দেশে কোন এক যুদ্ধে বক্তৃতা দিচ্ছিলেন। ইবনু উমর (রাযিঃ) বলেন, আমি সে দিকে অগ্রসর হচ্ছিলাম। তবে আমি তার কাছে পৌছার আগেই তিনি (অন্যদিকে) চলে গেলেন। আমি (লোকেদের) প্রশ্ন করলাম, তিনি কি বললেন? তারা বললেন, তিনি দুব্বা ও মুযাফফাতে নবীয তৈরি করতে বারণ করলেন। (ইসলামিক ফাউন্ডেশন ৫০১৯, ইসলামিক সেন্টার ৫০২৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5189,
			"arabicnumber": "1997.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮৩, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮৩-(৪৯/...) কুতাইবাহ, ইবনু রুমূহ, আবূ রাবী', আবূ কামিল, যুহায়র ইবনু হারব, ইবনু নুমায়র, ইবনুল মুসান্না, ইবনু আবূ উমার, মুহাম্মাদ ইবনু রাফি ও হারূন আইলী (রহঃ) ..... উসামাহ্ (রহঃ) হতে তাদের প্রত্যেকেই নাফি' (রহঃ) এর সানাদে ইবনু উমার (রাযিঃ) হতে মালিক (রহঃ) এর হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু মালিক ও উসামাহ্ (রহঃ) ভিন্ন অন্য কেউ \"কোন এক যুদ্ধে\" কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫০২০, ইসলামিক সেন্টার ৫০৩০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5190,
			"arabicnumber": "1997.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮৪, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮৪-(৫০/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সাবিত (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে প্রশ্ন করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কলসীর নবীয হতে বারণ করেছেন কি? তিনি বললেন, মানুষের তো তাই ধারণা। আমি বললাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন কি-না? তিনি বললেন, মানুষের তো তাই ধারণা। (ইসলামিক ফাউন্ডেশন ৫০২১, ইসলামিক সেন্টার ৫০৩১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5191,
			"arabicnumber": "1997.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮৫, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮৫-(.../…) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... তাউস (রহঃ) হতে বর্ণিত। তিনি বলেন, এক লোক ইবনু উমার (রাযিঃ) কে বলল, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কলসীর নবীয হতে বারণ করেছেন? তিনি বললেন, হ্যাঁ। অতঃপর তাউস বলেন, আল্লাহর কসম! আমি তা তার নিকট হতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৫০২২, ইসলামিক সেন্টার ৫০৩২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5192,
			"arabicnumber": "1997.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮৬, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮৬-(৫১/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, এক লোক তার নিকট এসে বলল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কলসী ও লাউয়ের খোলে নবীয তৈরি করতে বারণ করেছেন? তিনি বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৫০২৩, ইসলামিক সেন্টার ৫০৩৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5193,
			"arabicnumber": "1997.08",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5194,
			"arabicnumber": "1997.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৮৮, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৮৮-(৫৩/...) 'আমর আন নাকিদ (রহঃ) ..... তাউস (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) এর কাছে উপস্থিত ছিলাম। এমনি মুহুর্তে জনৈক লোক এসে বলল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কলসী, দুব্বা ও মুযাফফাত এর (বানানো) নবীয হতে বারণ করেছেন? তিনি বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৫০২৫, ইসলামিক সেন্টার ৫০৩৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5195,
			"arabicnumber": "1997.10",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5196,
			"arabicnumber": "1997.11",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5197,
			"arabicnumber": "1997.12",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5198,
			"arabicnumber": "1997.13",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯৩, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৯৩-(৫৭/...) উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ..... যাযান (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে বললাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে সমস্ত পানীয় হতে বারণ করেছেন সে সম্পর্কে আপনি আপনার ভাষায় আমার কাছে উল্লেখ করুন এবং আমাদের ভাষায় তা বুঝিয়ে দিন। কারণ আপনাদের ভাষা আমাদের ভাষা থেকে ব্যতিক্রম। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন হানতাম হতে- হানতাম হলো কলসী এবং দুব্বা থেকে, তা হলো- কদু (এর খোল)। আর মুযাফফাত হতে, তা হলো- আলকাতরা মিশ্রিত পাত্র এবং নাকীর থেকে, তা হলো- খেজুর গাছের নিম্নাংশ, যার ভেতরের অংশ ফেলে দিয়ে পাত্রের মতো করা হয়। আর তিনি চামড়া দ্বারা তৈরি পাত্রে নবীয প্রস্তুত করার নির্দেশ দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫০৩০, ইসলামিক সেন্টার ৫০৪০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5199,
			"arabicnumber": "1997.14",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯৪, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৯৪-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আবূ দাউদ (রহঃ) হতে বর্ণিত। তিনি বলেন, শুবাহ্ (রহঃ) উল্লেখিত সূত্রে আমাদের কাছে হাদীসটি রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৩১, ইসলামিক সেন্টার ৫০৪১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5200,
			"arabicnumber": "1997.15",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯৫, আন্তর্জাতিক নাম্বারঃ ১৯৯৭ ৫০৯৫-(৫৮/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... সাঈদ ইবনু মুসাইয়্যিব (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে এ মিম্বারের নিকট বলতে শুনেছি বলে তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মিম্বারের প্রতি ইশারা করেন। আবদুল কায়সের প্রতিনিধি দল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলো এবং তাকে মদ সম্বন্ধে প্রশ্ন করলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে দুব্বা, নাকীর ও হানতাম হতে বারণ করলেন। আমি বললাম, হে আবূ মুহাম্মাদ! মুযাফফাতের কথা? আমরা মনে করলাম, তিনি সম্ভবত ভুলে গেছেন। তিনি বললেন, সেদিন আবদুল্লাহ ইবনু উমর (রাযিঃ) এ কথা বলেছেন আমি তা শুনিনি। তবে তিনি সেটাকে পছন্দ করতেন না। (ইসলামিক ফাউন্ডেশন ৫০৩২, ইসলামিক সেন্টার ৫০৪২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5201,
			"arabicnumber": "1997.16",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯৬, আন্তর্জাতিক নাম্বারঃ ১৯৯৮ ৫০৯৬-(৫৯/১৯৯৮) আহমাদ ইবনু ইউনুস ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির ও ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাকীর, মুযাফফাত ও দুব্বা (-তে নবীয তৈরি করা) হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৩৩, ইসলামিক সেন্টার ৫০৪৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5202,
			"arabicnumber": "1998.01",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5203,
			"arabicnumber": "1998.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫০৯৮, আন্তর্জাতিক নাম্বারঃ ১৯৯৮ ৫০৯৮-(.../...) আবূ যুবায়র (রহঃ) বলেন, আমি জাবির (রাযিঃ) কেও বলতে শুনেছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন কলসী, মুযাফফাত ও নাকীরের (বানানো নবীয পান করতে)। (ইসলামিক ফাউন্ডেশন ৫০৩৪, ইসলামিক সেন্টার ৫০৪৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5205,
			"arabicnumber": "1999.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০০, আন্তর্জাতিক নাম্বারঃ ১৯৯৯ ৫১০০-(৬১/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য পাথর দ্বারা তৈরি পাত্রে নবীয বানানো হতো। (ইসলামিক ফাউন্ডেশন ৫০৩৫, ইসলামিক সেন্টার ৫০৪৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5206,
			"arabicnumber": "1999.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০১, আন্তর্জাতিক নাম্বারঃ ১৯৯৯ ৫১০১-(৬২/...) আহমাদ ইবনু ইউনুস ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ...... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য চর্ম দ্বারা তৈরি বাসনে নবীয প্রস্তুত করা হতো। তবে চামড়া নির্মিত বাসন পাওয়া না গেলে পাথর নির্মিত বাসনে তার জন্য নবীয প্রস্তুত করা হতো। সে সময় এক লোক আবূ যুবায়র এর নিকটে জিজ্ঞেস করল আর আমি তা শুনলাম। তিনি বললেন, পাথরের ডেগ? তিনি (আবূ যুবায়র) বললেন, হ্যাঁ পাথরের ডেগ। (ইসলামিক ফাউন্ডেশন ৫০৩৬, ইসলামিক সেন্টার ৫০৪৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5209,
			"arabicnumber": "977.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০৪, আন্তর্জাতিক নাম্বারঃ ৯৭৭ ৫১০৪-(৬৫/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... বুরাইদাহ (রাযিঃ) তিনি তার পিতা হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি তোমাদেরকে নিষেধ করেছিলাম চামড়া নির্মিত সব রকম বাসনে (বানানো নবীয) পান করতে। কিন্তু এখন তোমরা সর্বপ্রকার বাসনেই পান করতে পার। তবে নেশা জাতীয় কোন প্রকার জিনিসই বানানো নবীয পান করো না। (ইসলামিক ফাউন্ডেশন ৫০৩৯, ইসলামিক সেন্টার ৫০৪৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5210,
			"arabicnumber": "2000",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০৫, আন্তর্জাতিক নাম্বারঃ ২০০০ ৫১০৫-(৬৬/২০০০) আবূ বকর ইবনু আবূ শইবাহ ও ইবনু আবূ উমর (রহঃ) ...… আবদুল্লাহ ইবনু 'আমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সকল (চামড়ার ছাড়া) বাসনের নবীয হতে বারণ করলেন, তখন মানুষেরা বলল সবাই তো (চামড়ার বাসন) পায় না। পরে তিনি আলকাতরা মিশ্রিত কলসী ব্যতীত ভিন্ন কলসীর ক্ষেত্রে অনুমতি প্রদান করেন। (ইসলামিক ফাউন্ডেশন ৫০৪০, ইসলামিক সেন্টার ৫০৫০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5211,
			"arabicnumber": "2001.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০৬, আন্তর্জাতিক নাম্বারঃ ২০০১ ৫১০৬-(৬৭/২০০১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) .... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বিত'ই (بِتْعِ)* বিষয়ে প্রশ্ন করা হলো। তিনি বললেন, নেশাগ্রস্ত করে এমন সকল প্রকার পানীয়ই নিষিদ্ধ। (ইসলামিক ফাউন্ডেশন ৫০৪১, ইসলামিক সেন্টার ৫০৫১) * بِتْعِ (বিত'ই) মদ। মধু কিংবা খেজুর রসের তৈরি করা মদ বা তাড়ি। (মিসবাহ ২৭ পৃঃ)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5212,
			"arabicnumber": "2001.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০৭, আন্তর্জাতিক নাম্বারঃ ২০০১ ৫১০৭-(৬৮/...) হারমালাহ ইবনু ইয়াহইয়া তুজাইবী (রহঃ) ..... আবূ সালামাহ্ ইবনু আবদুর রহমান (রহঃ) হতে বর্ণিত যে, তিনি আয়িশাহ (রাযিঃ) কে বলতে শুনেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বিত'ইالْبِتْعِ এ সম্বন্ধে প্রশ্ন করা হলো। তিনি বললেন, নেশা উদ্রেক করে এমন সর্বপ্রকার পানীয়ই নিষিদ্ধ। (ইসলামিক ফাউন্ডেশন ৫০৪২, ইসলামিক সেন্টার ৫০৫২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5213,
			"arabicnumber": "2001.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১০৮, আন্তর্জাতিক নাম্বারঃ ২০০১ ৫১০৮-(৬৯/...) ইয়াহইয়া ইবনু ইয়াহইয়া, সাঈদ ইবনু মানসুর, আবূ বাকর ইবনু আবূ শাইবাহ্, আমর আন নাকিদ, যুহায়র ইবনু হারব উয়াইনাহ্ হতে অপর সূত্রে হাসান-হুলওয়ানী, আবদ ইবনু হুমায়দ ইয়াকুব ইবনু ইবরাহীম ইবনু সা'দ সালিহ্ হতে অন্য সূত্রে ইসহাক ইবনু ইবরাহীম ও আবদ ইবনু হুমায়দ (রহঃ) ..... মা'মার (রহঃ) হতে, তারা সবাই যুহরী (রহঃ) হতে উক্ত সূত্রে হাদীসটি বর্ণনা করেছেন। তবে সুফইয়ান সালিহ্ (রহঃ) এর হাদীসে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে \"বিত'ই সম্বন্ধে প্রশ্ন করা হলো\"- কথাটি নেই। কিন্তু মা'মার (রহঃ) এর কথাটি হাদীসে রয়েছে। আর সালিহ্ (রহঃ) এর হাদীসে রয়েছে যে, তিনি [আয়িশাহ্ (রাযিঃ)] রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন- সকল প্রকার নেশা উদ্রেককারী পানীয়ই নিষিদ্ধ। (ইসলামিক ফাউন্ডেশন ৫০৪৩, ইসলামিক সেন্টার ৫০৫৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5215,
			"arabicnumber": "1733.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১০, আন্তর্জাতিক নাম্বারঃ ১৭৩৩ ৫১১০-(.../...) মুহাম্মাদ ইবনু আব্বাদ (রহঃ) ..... সাঈদ ইবনু আবূ বুরদাহ (রাযিঃ) তার পিতা, তিনি দাদা হতে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ও মুআয (রাযিঃ) কে ইয়ামানে প্রেরণ করলেন এবং তাদেরকে বললেনঃ তোমরা (মানুষকে) সুসংবাদ দিবে আর (দীনকে) সহজভাবে প্রকাশ করবে, (মানুষকে) দীন শিক্ষা দেবে, কাউকে (দীন থেকে) পৃথক করে দিবে না। আমার ধারণা হয়, তিনি ‘একতাবদ্ধ হয়ে কাজ করবে' কথাটিও বলেছেন। তিনি যাত্রা করলে আবূ মূসা (রাযিঃ) ফিরে এসে বললেন, হে আল্লাহর রসূল! তাদের তো মধু থেকে বানানো মদ আছে যা পাকিয়ে ঘন করা হয় এবং মিযর আছে যা যব দিয়ে প্রস্তুত করা হয়। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যা কিছু সালাত (সালাত/নামাজ/নামায) হতে বিরত করে তা-ই হারাম। (ইসলামিক ফাউন্ডেশন ৫০৪৫, ইসলামিক সেন্টার ৫০৫৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5216,
			"arabicnumber": "1733.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১১, আন্তর্জাতিক নাম্বারঃ ১৭৩৩ ৫১১১-(৭১/...) ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনু আহমাদ ইবনু আবূ খালাফ (রহঃ) ..... আবূ বুরদাহ (রহঃ) তার পিতা হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ও মু'আয (রাযিঃ) কে ইয়ামানে প্রেরণ করে বললেনঃ তোমরা লোকদেরকে (দীনের) আহ্বান করবে, সুখবর দিবে, কাউকে তাড়িয়ে দিবে না। সহজ করবে- কঠিন করবে না। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! ইয়ামানে আমরা দু' রকমের মদ তৈরি করি, আপনি সে ব্যাপারে আমাদেরকে জানান। (১) আল-বিতই, যা মধু পাকিয়ে ঘন করে প্রস্তুত করা হয়; (২) আল-মিযর, যা যব পাকিয়ে ঘন করে তৈরি করা হয়। বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কিছু শব্দ অথচ ব্যাপক অর্থবোধক কথা পূর্ণতার সঙ্গে প্রকাশ করার সামর্থ্য দেয়া হয়েছিল। তিনি বললেনঃ প্রত্যেক নেশাযুক্ত জিনিস যা সালাত (সালাত/নামাজ/নামায) হতে গাফিল করে তা (পান করতে) বারণ করছি। (ইসলামিক ফাউন্ডেশন ৫০৪৬, ইসলামিক সেন্টার ৫০৫৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5217,
			"arabicnumber": "2002",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১২, আন্তর্জাতিক নাম্বারঃ ২০০২ ৫১১২-(৭২/২০০২) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... জাবির (রহঃ) হতে বর্ণিত। ‘জাইশান’ থেকে জনৈক লোক আসলো। জাইশান ইয়ামানের একটি অঞ্চল। অতঃপর সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাদের অঞ্চলে তারা শস্য দিয়ে প্রস্তুত 'মিয্‌র' নামক যে মদ পান করে সে সম্পর্কে প্রশ্ন করলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা কি নেশা তৈরি করে? সে বলল, হ্যাঁ। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ নেশা উদ্রেক করে এমন সবই নিষিদ্ধ। আল্লাহ তা'আলা ওয়াদা করেছেন, যে লোক নেশাযুক্ত জিনিস পান করবে তাকে তিনি “তীনাতুল খাবাল” পান করিয়ে ছাড়বেন। মানুষেরা বলল, হে আল্লাহর রসূল! তীনাতুল খাবাল কি? তিনি বললেন, জাহান্নামবাসীদের ঘাম বা জাহান্নামবাসীদের মলমূত্র। (ইসলামিক ফাউন্ডেশন ৫০৪৭, ইসলামিক সেন্টার ৫০৫৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5218,
			"arabicnumber": "2003.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৩, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৩-(৭৩/২০০৩) আবূ রাবী' আতাকী ও আবূ কামিল (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যা কিছু নেশা তৈরি করে তা-ই মদ। আর যা নেশা উদ্রেক করে তাই নিষিদ্ধ। যে লোক দুনিয়াতে মদ পান করবে, আবার সব সময় এ কাজ করে তওবা না করেই মৃত্যুমুখে পতিত হবে, সে আখিরাতে তা পান করতে পারবে না। (ইসলামিক ফাউন্ডেশন ৫০৪৮, ইসলামিক সেন্টার ৫০৫৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5219,
			"arabicnumber": "2003.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৪, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৪-(৭৪/...) ইসহাক ইবনু ইবরাহীম ও আবূ বকর ইবনু ইসহাক (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, নিশ্চয়ই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যা কিছু নেশাগ্রস্ত করে তা-ই মদ। আর যা নেশা উদ্রেক করে তা-ই নিষিদ্ধ। (ইসলামিক ফাউন্ডেশন ৫০৪৯, ইসলামিক সেন্টার ৫০৫৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5220,
			"arabicnumber": "2003.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৫, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৫-(.../...) সালিহ্ ইবনু মিসমার সুলামী (রহঃ) ..... মূসা ইবনু উকবাহ (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫০৫০, ইসলামিক সেন্টার ৫০৬০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5221,
			"arabicnumber": "2003.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৬, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৬-(৭৫/...) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত। সম্ভবত তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকেই বর্ণনা করেছেন। তিনি বলেন, যে জিনিসে নেশা উদ্রেক করে তাই মদ। আর মদ মাত্রই হারাম। (ইসলামিক ফাউন্ডেশন ৫০৫১, ইসলামিক সেন্টার ৫০৬১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5222,
			"arabicnumber": "2003.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৭, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৭-(৭৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক পৃথিবীতে মদ পান করবে, পরকালে তাকে তা থেকে বঞ্চিত থাকবে। (ইসলামিক ফাউন্ডেশন ৫০৫২, ইসলামিক সেন্টার ৫০৬২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5223,
			"arabicnumber": "2003.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৮, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৮-(৭৭/…) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যে লোক দুনিয়াতে মদ পান করবে এবং তওবা করবে না, পরকালে তাকে তা থেকে বঞ্চিত করা হবে। তাকে তা পান করতে দেয়া হবে না। মালিক (রহঃ) কে বলা হলো- হাদীসটি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে? তিনি জবাবে বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৫০৫৩, ইসলামিক সেন্টার ৫০৬৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5224,
			"arabicnumber": "2003.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১১৯, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১১৯-(৭৮/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) আবদুল্লাহ ইবনু নুমায়র (রহঃ) হতে, ভিন্ন সূত্রে ইবনু নুমায়র (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক পৃথিবীতে মদ পান করবে, পরকালে সে তা পান করতে পারবে না। তবে যদি তওবা করে। (ইসলামিক ফাউন্ডেশন ৫০৫৪, ইসলামিক সেন্টার ৫০৬৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5225,
			"arabicnumber": "2003.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২০, আন্তর্জাতিক নাম্বারঃ ২০০৩ ৫১২০-(…/...) ইবনু আবূ উমার (রহঃ) ..... ইবনু উমর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উবাইদুল্লাহ (রহঃ) এর হাদীসের হুবহু বর্ণিত রয়েছে। (ইসলামিক ফাউন্ডেশন ৫০৫৫, ইসলামিক সেন্টার ৫০৬৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5226,
			"arabicnumber": "2004.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২১, আন্তর্জাতিক নাম্বারঃ ২০০৪ ৫১২১-(৭৯/২০০৪) উবাইদুল্লাহ ইবনু মুআয আম্বারী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য রাতের প্রথম ভাগে নবীয প্রস্তুত করা হতো। তিনি তা পান করতেন, সেদিন সকালে, আগামী রাতে, পরবর্তী দিনে, এর পরের রাতে এবং পরদিন 'আসর পর্যন্ত। তবে যদি কিছু পরিশিষ্ট থেকে যেত, তা তিনি তার সেবাদানকারীকে পান করাতেন, কিংবা ফেলে দিতে নির্দেশ দিতেন। (ইসলামিক ফাউন্ডেশন ৫০৫৬, ইসলামিক সেন্টার ৫০৬৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5227,
			"arabicnumber": "2004.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২২, আন্তর্জাতিক নাম্বারঃ ২০০৪ ৫১২২-(৮০/...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... ইয়াহইয়া বাহরানী (রহঃ) হতে বর্ণিত। তিনি বলেন, মানুষেরা ইবনু আব্বাস (রাযিঃ) এর কাছে নবীযের ব্যাপারে আলোচনা করলে তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য মশকে নবীয প্রস্তুত করা হতো। শু'বাহ্‌ বলেন, সোমবারের রজনীতে (অর্থাৎ রোববার দিবাগত রাতে) তিনি তা সোমবার দিন ও মঙ্গলবার আসর পর্যন্ত পান করতেন। এরপরও কিছু বাকী থাকলে তিনি সেটা খাদিমকে পান করাতেন বা ফেলে দিতেন। (ইসলামিক ফাউন্ডেশন ৫০৫৭, ইসলামিক সেন্টার ৫০৬৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5228,
			"arabicnumber": "2004.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৩, আন্তর্জাতিক নাম্বারঃ ২০০৪ ৫১২৩-(৮১/...) আবূ বাকর ইবনু আবূ শাইবাহ্, আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য কিসমিস পানিতে ডুবিয়ে রাখা হতো। তিনি সেদিন, তার পরের দিন এবং তৃতীয় দিন বিকাল পর্যন্ত তা পান করতেন। অতঃপর তার নির্দেশে কোন লোককে পান করানো হতো কিংবা ফেলে দেয়া হতো। (ইসলামিক ফাউন্ডেশন ৫০৫৮, ইসলামিক সেন্টার ৫০৬৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5229,
			"arabicnumber": "2004.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৪, আন্তর্জাতিক নাম্বারঃ ২০০৪ ৫১২৪-(৮২/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য মশকের ভিতরে কিসমিসের নবীয প্রস্তুত করা হতো। তিনি ঐদিন, তার পরবর্তী দিন এবং পরশু দিন পর্যন্ত তা পান করতেন। তৃতীয় দিনের বিকাল হলে তিনি নিজে তা পান করতেন এবং অপরকে পান করাতেন। তারপরও যদি কিছু বাকী থাকত তিনি তা ঢেলে দিতেন। (ইসলামিক ফাউন্ডেশন ৫০৫৯, ইসলামিক সেন্টার ৫০৬৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5230,
			"arabicnumber": "2004.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৫, আন্তর্জাতিক নাম্বারঃ ২০০৪ ৫১২৫-(৮৩/…) মুহাম্মাদ ইবনু আবূ খালাফ (রহঃ) ..... ইয়াহইয়া নাখ'ঈ (রহঃ) হতে বর্ণিত। তিনি বলেন, কতিপয় লোক ইবনু আব্বাস (রাযিঃ) কে মদ কেনা-বেচা এবং এর ব্যবসা সম্পর্কে প্রশ্ন করলো। তিনি বললেন, তোমরা কি মুসলিম? তারা বললো, হ্যাঁ। তিনি বললেন, তাহলে এর কেনা-বেচা ও ব্যবসা জায়িয হবে না। রাবী বলেন, অতঃপর তারা তাকে নবীয সম্বন্ধে প্রশ্ন করলেন। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার ভ্রমণে গিয়ে যখন ফিরে আসলেন, তখন তার সাহাবীদের থেকে কতিপয় লোক হানতাম, নাকীর ও দুব্বার মাঝে নবীয প্রস্তুত করছিল। তিনি নির্দেশ দিলে তা ঢেলে ফেলা হয়। অতঃপর তিনি মশক আনতে নির্দেশ দিলেন। অতঃপর তার মধ্যে কিসমিস ও পানি দিয়ে সারারাত রাখা হলো। সেদিন সকালে এবং আগামী রাত ও তার পরবর্তী বিকাল পর্যন্ত তিনি তা হতে পান করেন, আর অন্যদের পান করতে দেন। রাত পার হলে তিনি বাকী অংশের ব্যাপারে আদেশ দিলে, তা ঢেলে ফেলা হলো। (ইসলামিক ফাউন্ডেশন ৫০৬০, ইসলামিক সেন্টার ৫০৭০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5231,
			"arabicnumber": "2005.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৬, আন্তর্জাতিক নাম্বারঃ ২০০৫ ৫১২৬-(৮৪/২০০৫) শাইবান ইবনু ফাররূখ (রহঃ) ..... সুমামাহ্ ইবনু হায্‌ন কুশাইরী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ্ (রাযিঃ) এর সাথে সাক্ষাৎ করে তাকে নবীয সম্বন্ধে প্রশ্ন করলাম। আয়িশাহ (রাযিঃ) এক হাবশী ক্রীতদাসীকে ডেকে বললেন, একে প্রশ্ন করে- রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য সে নবীয প্রস্তুত করতো। অতঃপর হাবশী মেয়েটি বলল, রাতে আমি তার জন্য মশকের ভিতরে নবীয প্রস্তুত করতাম এবং সেটি মুখ বন্ধ করে লটকিয়ে রাখতাম। ভোর হলে তিনি এ থেকে পান করতেন। (ইসলামিক ফাউন্ডেশন ৫০৬১, ইসলামিক সেন্টার ৫০৭১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5232,
			"arabicnumber": "2005.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৭, আন্তর্জাতিক নাম্বারঃ ২০০৫ ৫১২৭-(৮৫/...) মুহাম্মাদ ইবনুল মুসান্না আম্বারী (রহঃ) ...... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য নবীয তৈরি করতাম এমন মশকে যার প্রবেশদ্বার উপরের দিকে এবং যেটির (নিচের দিকে) বহু ছিদ্র ছিল। আমরা ডোরে নবীয প্রস্তুত করলে রাত্রেই তিনি পান করতেন। পুনরায় রাতে করলে ভোরেই তিনি পান করতেন। (ইসলামিক ফাউন্ডেশন ৫০৬২, ইসলামিক সেন্টার ৫০৭২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5233,
			"arabicnumber": "2006.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৮, আন্তর্জাতিক নাম্বারঃ ২০০৬ ৫১২৮-(৮৬/২০০৬) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... সাহল ইবনু সা'দ (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ উসায়দ সাইদী (রাযিঃ) তার বিবাহে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দাওয়াত করলেন। তার সদ্য বিবাহিতা স্ত্রীই সেদিন তাদের সেবায় নিয়োজিত ছিলেন। সাহল (রাযিঃ) বললেন, তোমরা কি জান, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কী পান করতে দিয়েছিলেন? তিনি রাতে কিছু খেজুর একটি পাথরের পাত্রে ভিজিয়ে রেখেছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবার শেষ করলে তিনি তাকে তা পান করিয়েছিলেন। (ইসলামিক ফাউন্ডেশন ৫০৬৩, ইসলামিক সেন্টার ৫০৭৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5234,
			"arabicnumber": "2006.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১২৯, আন্তর্জাতিক নাম্বারঃ ২০০৬ ৫১২৯-(…/...) কুতাইবাহ্‌ ইবনু সাঈদ (রহঃ) ..... আবূ হাযিম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি সাহল (রহঃ) কে বলতে শুনেছি যে, আবূ উসায়দ সাইদী (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দাওয়াত করলেন। তারপর রাবী উপরোল্লিখিত হাদীসের অবিকল বর্ণনা করেন। তবে তিনি এ কথা বলেননি যে, “খাওয়া শেষ হলে সে নবীযটুকু তিনি তাকে পান করান”। (ইসলামিক ফাউন্ডেশন ৫০৬৪, ইসলামিক সেন্টার ৫০৭৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5235,
			"arabicnumber": "2006.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩০, আন্তর্জাতিক নাম্বারঃ ২০০৬ ৫১৩০-(৮৭/...) মুহাম্মাদ ইবনু সাহল আত-তামীমী (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) থেকে উল্লেখিত হাদীসটি বর্ণনা করেন। তবে তিনি বলেছেন, পাথর দিয়ে তৈরি বাসনে (নবীয বানানো হয়েছিল), এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবার শেষ করলে তিনি তা হালকা করে একমাত্র তাকেই পান করতে দিয়েছিলেন। (ইসলামিক ফাউন্ডেশন ৫০৬৫, ইসলামিক সেন্টার ৫০৭৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5236,
			"arabicnumber": "2007",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩১, আন্তর্জাতিক নাম্বারঃ ২০০৭ ৫১৩১-(৮৮/২০০৭) মুহাম্মাদ ইবনু সাহল আত তামীমী ও আবূ বকর ইবনু ইসহাক (রহঃ) .... সাহল ইবনু সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আরবের জনৈকা মহিলার ব্যাপারে আলোচনা করা হলে, তিনি আবূ উসায়দ (রাযিঃ) কে তার কাছে লোক প্রেরণের জন্য নির্দেশ দিলেন। তিনি লোক (দূত) পাঠালে উক্ত মহিলা আসলো এবং বানু সাইদাহ্ সম্প্রদায়ের দূর্গে অবস্থান গ্রহণ করলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হয়ে তার কাছে আসলেন। তিনি যখন তার কাছে পৌছলেন, তখন মহিলা মাথা নীচু করে বসেছিল। তিনি তার সঙ্গে আলাপ করলে সে বলল, আমি আপনার থেকে আল্লাহর কাছে আশ্রয় চাই। তিনি বললেন, আমিও তোমাকে পরিত্রাণ দিলাম। লোকেরা মহিলাকে বলল, তুমি জান ইনি কে? সে বলল, না। তারা বলল, ইনি তো আল্লাহর রসূল। তিনি তোমাকে বিবাহের প্রস্তাব দিতে এসেছিলেন। তখন সে বলল, আমি তো এর অযোগ্য! সাহল (রাযিঃ) বলেন, অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেদিন প্রত্যাবর্তন করে তিনি ও তার সাহাবীগণ বানু সাইদার সাকীফায় (বাগানে) নিজেকে উপবেশন করেন। অতঃপর তিনি সাহলকে বললেন, আমাদেরকে কিছু পান করাও। সাহল বলেন, পরে আমি এ পেয়ালাটি বের করে তাদের সকলকেই তা হতে পান করিয়েছিলাম। আবূ হাযিম (রহঃ) বলেন, সাহল (রাযি) আমাদের সম্মুখে বাটিটি বের করলে আমরা তা হতে পান করলাম। অতঃপর উমার ইবনু আবদুল আযীয (রহঃ) তা চাইলে, তিনি তাকে সেটি দান করেন। আবূ বাকর ইবনু ইসহাক (রহঃ) এর রিওয়ায়াতে আছে, তিনি বললেন, হে সাহল! তুমি আমাদেরকে পান করাও। (ইসলামিক ফাউন্ডেশন ৫০৬৬, ইসলামিক সেন্টার ৫০৭৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5237,
			"arabicnumber": "2008",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩২, আন্তর্জাতিক নাম্বারঃ ২০০৮ ৫১৩২-(৮৯/২০০৮) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার এ পেয়ালাটি দিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মধু, নবীয, পানি, দুধ ইত্যাদি সকল প্রকার পানীয় (দ্রব্য) পান করিয়েছি। (ইসলামিক ফাউন্ডেশন ৫০৬৭, ইসলামিক সেন্টার ৫০৭৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5238,
			"arabicnumber": "2009.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৩, আন্তর্জাতিক নাম্বারঃ ২০০৯ ৫১৩৩-(৯০/২০০৯) উবাইদুল্লাহ ইবনু মুআয আম্বারী (রহঃ) ..... বারা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ বাকর সিদীক (রাযিঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যখন আমরা মক্কাহ হতে মদীনার দিকে রওনা দিলাম। এক সময় আমরা এক রাখালের পাশ দিয়ে পথ অতিক্রম করছিলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিপাসিত হলে আমি তার জন্য কিছু দুধ দোহন করে নিয়ে আসলাম। তিনি তা পান করলে আমি খুব আনন্দিত হলাম। (ইসলামিক ফাউন্ডেশন ৫০৬৮, ইসলামিক সেন্টার ৫০৭৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5239,
			"arabicnumber": "2009.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৪, আন্তর্জাতিক নাম্বারঃ ২০০৯ ৫১৩৪-(৯১/...) মুহাম্মাদ ইবনু মুসান্না ও ইবনু বাশশার (রহঃ) ..... বারা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ বাকর সিদীক (রাযিঃ) বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মক্কাহ থেকে মদীনার দিকে বের হলেন। তখন সুরাকাহ্ ইবনু মালিক ইবনু জুশুম তার পশ্চাদ্ধাবন করল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার উপর বদদুআ করলে তার ঘোড়া জমিনে দেবে গেলো। সে বলল, আমার জন্য দু'আ করুন, আমি আপনার কোন ক্ষতি করবো না। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করলেন। ....... বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিপাসার্ত হলেন এবং তারা এক বকরীর রাখালের নিকট দিয়ে অতিক্রম করছিলেন। আবূ বাকর সিদীক (রাযিঃ) বলেন, আমি একখানা বাটি নিয়ে রসূলুল্লাহ এর জন্য কিছু দুধ দোহন করে আনলাম। তিনি তা পান করলেন। আমি আনন্দিত হলাম। (ইসলামিক ফাউন্ডেশন ৫০৬৯, ইসলামিক সেন্টার ৫০৭৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5240,
			"arabicnumber": "168.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৫, আন্তর্জাতিক নাম্বারঃ ১৬৮ ৫১৩৫-(৯২/১৬৮) মুহাম্মাদ ইবনু আব্বাদ ও যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, মি'রাজের রাত্রে ঈলিয়া নামক স্থানে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে মদ ও দুধের দুটি পেয়ালা নিয়ে আসা হলে তিনি সে দুটির প্রতি দৃষ্টি নিক্ষেপ করলেন, অতঃপর তিনি দুধ গ্রহণ করলেন। জিবরীল (আঃ) বললেনঃ সমস্ত প্রশংসা আল্লাহর- যিনি আপনাকে স্বভাবসুলভ রাস্তা গ্রহণের তাওফীক দিয়েছেন। যদি আপনি মদের পেয়ালা গ্রহণ করতেন তবে আপনার উম্মাত পথভ্রষ্ট হয়ে যেত। [দ্রষ্টব্য হাদীস ৪২৪] (ইসলামিক ফাউন্ডেশন ৫০৭০, ইসলামিক সেন্টার ৫০৮০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5241,
			"arabicnumber": "168.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৬, আন্তর্জাতিক নাম্বারঃ ১৬৮ ৫১৩৬-(.../...) সালামাহ্ ইবনু শাবীব (রহঃ) .... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আনা হলো। অতঃপর বর্ণনাকারী উপরোল্লিখিত হাদীসের অবিকল বর্ণনা করেছেন। কিন্তু তিনি ঈলিয়া ব্যাপারটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫০৭১, ইসলামিক সেন্টার ৫০৮১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5242,
			"arabicnumber": "2010.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৭, আন্তর্জাতিক নাম্বারঃ ২০১০ ৫১৩৭-(৯৩/২০১০) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনুল মুসান্না ও আবদ ইবনু হুমায়দ (রহঃ) ..... আবূ হুমায়দ সাইদী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নাকী' নামক জায়গা হতে এক বাটি দুধ নিয়ে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলাম। বাটিটি ছিল ঢাকনাবিহীন। তিনি বললেনঃ তুমি একে ঢাকলে না কেন, এর উপর একটি কাঠি রেখে হলেও? আবূ হুমায়দ (রাযিঃ) বলেন, রাতে মশকের মুখ বেঁধে রাখতে ও দরজা আটকানোর নির্দেশ দেয়া হয়েছে। (ইসলামিক ফাউন্ডেশন ৫০৭২, ইসলামিক সেন্টার ৫০৮২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5243,
			"arabicnumber": "2010.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৮, আন্তর্জাতিক নাম্বারঃ ২০১০ ৫১৩৮-(…/...) ইব্রাহীম ইবনু দীনার (রহঃ) ..... আবূ হুমায়দ (রাযিঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এক পেয়ালা দুধ নিয়ে এলেন। পরবর্তী অংশ উপরোল্লিখিত হাদীসের মতই। রাবী বলেন, রাবী যাকারিয়্যা (রহঃ) আবূ হুমায়দ এর বর্ণনায় উপরোল্লিখিত রাতে কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫০৭৩, ইসলামিক সেন্টার ৫০৮৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5244,
			"arabicnumber": "2011.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩৯, আন্তর্জাতিক নাম্বারঃ ২০১১ ৫১৩৯-(৯৪/২০১১) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরাযব (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তিনি কিছু পান করার ইচ্ছা করলে এক লোক বলল, হে আল্লাহর রসূল! আমরা কি আপনাকে নবীয পান করতে দিবো? তিনি বললেন, হ্যাঁ। অতঃপর লোকটি তাড়াতাড়ি চলে গেল এবং একটি বাটি নিয়ে আসলো তার মধ্যে নবীয ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন এর উপর একটি কাঠি দিয়ে হলেও তুমি এটি ঢেকে আনলে না কেন? আবূ হুমায়দ (রাযিঃ) বলেন, তারপর তিনি পান করলেন। (ইসলামিক ফাউন্ডেশন ৫০৭৪, ইসলামিক সেন্টার ৫০৮৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5245,
			"arabicnumber": "2011.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪০, আন্তর্জাতিক নাম্বারঃ ২০১১ ৫১৪০-(৯৫/...) উসমান ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ হুমায়দ (রাযিঃ) নামক এক লোক নাকী' (নামক জায়গা) থেকে এক বাটি দুধ নিয়ে এলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তুমি এটা আবৃত করে আনলে না কেন, এর উপর একটা কাঠি দিয়ে হলেও (ইসলামিক ফাউন্ডেশন ৫০৭৫, ইসলামিক সেন্টার ৫০৮৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5246,
			"arabicnumber": "2012.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪১, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪১-(৯৬/২০১২) কুতাইবাহ ইবনু সাঈদ (রহঃ) ও মুহাম্মাদ ইবনু রুমূহ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত আছে যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা (রাতে) বাসনগুলো ঢেকে রাখবে, মশকগুলোর প্রবেশদ্বার আটকিয়ে রাখবে, ফটকগুলো বন্ধ করবে এবং বাতিগুলো নিভিয়ে দেবে। কারণ, শাইতান মশকের মুখ ও দরজা খুলতে পারে না এবং বাসনও অনাবৃত করতে পারে না। যদি তোমাদের কেউ তার বাসনের উপর রাখার জন্য কাঠি ছাড়া অন্য কিছু না পায়, তবে সে যেন তাই রেখে দেয় এবং আল্লাহর নাম উচ্চারণ করে। কেননা ইদুর ঘরের মালিকদের ঘর তাড়াতাড়ি জ্বলিয়ে দেয়। কুতাইবাহ তার হাদীসে দরজা আটকাও কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫০৭৬, ইসলামিক সেন্টার ৫০৮৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5247,
			"arabicnumber": "2012.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪২, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪২-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির (রাযিঃ) থেকে হাদীসটি বর্ণিত আছে। তবে তিনি বলেছেন- তোমরা বাসনগুলো উল্টিয়ে বা কাত করে রাখবে অথবা ঢেকে রাখবে। আর তিনি বাসনের উপর কাঠি দেয়ার কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫০৭৭, ইসলামিক সেন্টার ৫০৮৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5248,
			"arabicnumber": "2012.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৩, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪৩-(…/...) আহমাদ ইবনু ইউনুস (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা দরজা আটকিয়ে রাখবে। তারপর রাবী লায়স (রহঃ) এর হাদীসের মত হুবহু বর্ণনা করেছেন। তবে তিনি বলেছেন, তোমরা বাসনগুলো আবৃত রাখবে। তিনি আরও বলেন, ইদুর ঘরের অধিবাসীদের পোশাক পুড়িয়ে ফেলে। (ইসলামিক ফাউন্ডেশন, ৫০৭৮, ইসলামিক সেন্টার ৫০৮৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5249,
			"arabicnumber": "2012.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৪, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪৪-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তাদের হাদীসের হুবহু বর্ণিত আছে। তিনি বলেছেন, ইদুর গৃহবাসীদের ঘর জ্বালিয়ে দেয়। (ইসলামিক ফাউন্ডেশন ৫০৭৯ ইসলামিক সেন্টার ৫০৮৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5250,
			"arabicnumber": "2012.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৫, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪৫-(৯৭/...) ইসহাক ইবনু মানুসূর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রাত্রি যখন ঘনিভূত হবে অথবা বলেছেন, তোমরা সন্ধ্যায় উপনীত হবে তখন তোমরা তোমাদের সন্তানদের দেখে রাখবে। কেননা, শাইতান তখন ঘুরাফেরা করে। রাত্রি ঘণ্টাখানিক পার হলে তাদের ছেড়ে দাও। আর দরজাগুলো আটকিয়ে রাখবে এবং আল্লাহর নাম উচ্চারণ করবে। কেননা শাইতান কোন বন্ধ দরজা খুলতে পারে না। আর তোমরা তোমাদের মশকসমূহের মুখ বেঁধে রাখবে এবং আল্লাহর নাম মনে করবে। আর তোমাদের বাসনগুলো আবৃত রাখবে, যদি তার উপর একটি কাঠিও রেখে হয় এবং আল্লাহর নাম উচ্চারণ করবে। আর তোমাদের বাতিগুলো নিভিয়ে দেবে। (ইসলামিক ফাউন্ডেশন ৫০৮০, ইসলামিক সেন্টার ৫০৯০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5251,
			"arabicnumber": "2012.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৬, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪৬-(…/...) ইসহাক ইবনু মানসূর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি আতা (রহঃ) এর হাদীসের মতই বর্ণনা করেছেন। তবে তিনি আল্লাহর নাম স্মরণ করার কথা বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫০৮১, ইসলামিক সেন্টার ৫০৯১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5252,
			"arabicnumber": "2012.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৭, আন্তর্জাতিক নাম্বারঃ ২০১২ ৫১৪৭-(…/...) আহমাদ ইবনু উসমান নাওফালী (রহঃ) ...... ইবনু জুরায়জ (রহঃ) আতা ও আমর ইবনু দীনার (রহঃ) হতে রাওহ্ (রহঃ) এর সানাদের হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৮২, ইসলামিক সেন্টার ৫০৯২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5253,
			"arabicnumber": "2013.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৮, আন্তর্জাতিক নাম্বারঃ ২০১৩ ৫১৪৮-(৯৮/২০১৩) আহমাদ ইবনু ইউনুস (রহঃ) ..... অপর সূত্রে ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের গৃহপালিত জন্তু এবং সন্তানিদেরকে সূর্য ডোবার সময় বের হতে দিবে না যতক্ষণ না ইশার কালোর অন্ধকার অতিবাহিত হয়। কারণ সূর্য ডোবার পর থেকে ইশার কালোর অন্ধকার পার হওয়া পর্যন্ত শাইতান ঘুরাফেরা করতে থাকে। (ইসলামিক ফাউন্ডেশন ৫০৮৩, ইসলামিক সেন্টার ৫০৯৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5254,
			"arabicnumber": "2013.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৪৯, আন্তর্জাতিক নাম্বারঃ ২০১৩ ৫১৪৯-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে যুহায়র (রহঃ) এর হাদীসের অনুরূপ বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ৫০৮৪, ইসলামিক সেন্টার ৫০৯৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5255,
			"arabicnumber": "2014.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫০, আন্তর্জাতিক নাম্বারঃ ২০১৪ ৫১৫০-(৯৯/২০১৪) আমর আন নাকিদ (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তোমরা বাসনগুলো আবৃত রাখবে এবং মশকসমূহের মুখ বেঁধে রাখবে। কারণ বছরে একটি এমন রাত আছে, যে রাতে মহামারী অবতীর্ণ হয়। যে কোন খোলা পাত্র এবং বন্ধনহীন মশকের উপর দিয়ে তা অতিবাহিত হয়, তাতেই সে মহামারী নেমে আসে। (ইসলামিক ফাউন্ডেশন ৫০৮৫, ইসলামিক সেন্টার ৫০৯৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5256,
			"arabicnumber": "2014.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫১, আন্তর্জাতিক নাম্বারঃ ২০১৪ ৫১৫১-(…/...) নাসর ইবনু ‘আলী আল-জাহযামী (রহঃ) ..... লায়স ইবনু সা'দ (রহঃ) হতে উপরোক্ত সূত্রে হুবহু বর্ণিত হয়েছে। কিন্তু তিনি বলেছেন, ‘কেননা বছরে একটি এমন দিন রয়েছে, যে দিনে মহামারী ধেয়ে আসে। বর্ণনাকারী হাদীসের শেষলগ্নে বাড়তি বলেছেন যে, লায়স বলেছেন, আমাদের মাঝে অনারবরা \"প্রথম কানুন\"* মাসে তা থেকে বাচার চেষ্টা করে। (ইসলামিক ফাউন্ডেশন ৫০৮৬, ইসলামিক সেন্টার ৫০৯৬) * রোমানদের বর্ষ গণনার দ্বিতীয় মাস, যা শুরু হয় খ্ৰীষ্টীয় ডিসেম্বর মাসের ছয় কিংবা তের তারিখ থেকে।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5257,
			"arabicnumber": "2015",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫২, আন্তর্জাতিক নাম্বারঃ ২০১৫ ৫১৫২-(১০০/২০১৫) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ), 'আমর আন্‌ নাকিদ (রহঃ) ও যুহায়র ইবনু হারব (রহঃ) ...... সালিম সূত্রে তার পিতা হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ঘরে অগ্নি প্রজ্জ্বলন অবস্থায় শায়িত হবে না। (ইসলামিক ফাউন্ডেশন ৫০৮৭, ইসলামিক সেন্টার ৫০৯৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5258,
			"arabicnumber": "2016",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৩, আন্তর্জাতিক নাম্বারঃ ২০১৬ ৫১৫৩-(১০১/২০১৬) সাঈদ ইবনু আমর আশ'আসী, আবূ বকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু 'আবদুল্লাহ ইবনু নুমায়র, আবূ আমির আশ'আরী ও আবূ কুরায়ব (রহঃ) ..... আবূ মূসা (রাযিঃ) হতে বর্ণিত যে, একবার রাতে মদীনায় ঘরের অধিবাসীসহ একটি বাড়ি পুড়ে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাদের অবস্থা সম্পর্কে জানানো হলে তিনি বললেনঃ এ আগুন তোমাদের শত্রু। অতএব তোমরা রাতে শোয়ার সময় তা নিভিয়ে ফেলবে। (ইসলামিক ফাউন্ডেশন ৫০৮৮, ইসলামিক সেন্টার ৫০৯৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5259,
			"arabicnumber": "2017.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৪, আন্তর্জাতিক নাম্বারঃ ২০১৭ ৫১৫৪-(১০২/২০১৭) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... হুযাইফাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কোন খাবার অনুষ্ঠানে যখন আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে উপবিষ্ট হতাম। যতক্ষণ তিনি স্বীয় হাত রেখে আরম্ভ না করতেন ততক্ষণ আমরা আমাদের হাত (আহারে) রাখতাম না। একবার আমরা তার সাথে এক খাবার অনুষ্ঠানে উপস্থিত হলাম। এমনি মুহুর্তে একটি মেয়ে এলো। (মনে হচ্ছিল) যেন তাকে তাড়িয়ে দেয়া হয়েছে। সে খাবারে হাত দিতে গেলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হাত ধরে নিলেন। অতঃপর একজন বেদুঈন এলো। (মনে হচ্ছিল) যেন তাকে তাড়িয়ে দেয়া হচ্ছিল। তিনি তারও হাত ধরে নিলেন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহর নাম স্মরণ করা না হলে শাইতান সে খাদ্যকে হালাল করে ফেলে। আর সে এ মেয়েটিকে নিয়ে এসেছে যাতে করে (এ খাদ্যকে) তার দ্বারা হালাল করতে পারে। অতঃপর আমি তার হাত ধরে ফেললে সে এ বেদুঈনকে নিয়ে এসেছে। যাতে করে (এ খাদ্যকে) তার দ্বারা হালাল করতে পারে। কিন্তু আমি তারও হাত ধরে ফেলেছি। সে সত্তার কসম যার হাতে আমার জীবন! অবশ্যই তার (শাইতানের) হাত মেয়েটির হাতসহ আমার হাতের মুঠোয়। (ইসলামিক ফাউন্ডেশন ৫০৮৯, ইসলামিক সেন্টার ৫০৯৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5260,
			"arabicnumber": "2017.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৫, আন্তর্জাতিক নাম্বারঃ ২০১৭ ৫১৫৫-(…/...) ইসহাক ইবনু ইবরাহীম হান্‌যালী (রহঃ) ..... হুযাইফাহ ইবনু ইয়ামান (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদেরকে যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে কোন খাবার উপলক্ষে দাওয়াত করা হতো। অতঃপর বর্ণনাকারী আবূ মু'আবিয়াহ্ (রহঃ) এর হাদীসের মতই বর্ণনা করেন। তবে তিনি يُدْفَعُ এর স্থলে يُطْرَدُ এবং মেয়ের বেলায় تُدْفَعُ স্থলে تُطْرَدُ শব্দ উচ্চারণ করেন। আর এ হাদীসে তিনি মেয়েটির আগমনের পূর্বে বেদুঈনের আসার কথা বর্ণনা করেছেন এবং হাদীসের শেষে অতিরিক্ত বলেছেন, তারপর তিনি \"বিসমিল্লাহ\" বলেন এবং খাদ্য গ্রহণ করেন। (ইসলামিক ফাউন্ডেশন ৫০৯০, ইসলামিক সেন্টার ৫১০০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5261,
			"arabicnumber": "2017.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৬, আন্তর্জাতিক নাম্বারঃ ২০১৭ ৫১৫৬-(.../...) আবূ বাকর ইবনু নাফি’ (রহঃ) ..... আ'মাশ (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণিত আছে। তবে তিনি প্রথমে মেয়েটির আসা ও পরে বেদুঈনের আসার কথা উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৯০, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5262,
			"arabicnumber": "2018.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৭, আন্তর্জাতিক নাম্বারঃ ২০১৮ ৫১৫৭-(১০৩/২০১৮) মুহাম্মাদ ইবনুল মুসান্না আনাযী (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, যখন কোন ব্যক্তি তার ঘরে প্রবেশের এবং খাবার গ্রহণের সময় আল্লাহর নাম স্মরণ করে, তখন শয়তান হতাশ হয়ে (তার সঙ্গীদের) বলে- তোমাদের (এখানে) রাত্রি যাপনও নেই, খাওয়াও নেই। আর যখন সে প্রবেশ করে এবং প্রবেশকালে আল্লাহর নাম স্মরণ না করে, তখন শয়তান বলে, তোমরা থাকার স্থান পেয়ে গেলে। আর যখন সে খাবারের সময় আল্লাহর নাম স্মরণ না করে, তখন সে (শয়তান) বলে, তোমাদের নিশি যাপন ও রাতের খাওয়ার আয়োজন হলো। (ইসলামিক ফাউন্ডেশন ৫০৯১, ইসলামিক সেন্টার ৫১০১) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। বাড়িতে প্রবেশ করার সময় এবং খাবার খাওয়ার সময় আল্লাহকে স্মরণ করার প্রতি এই হাদীসটি উৎসাহ প্রদান করে। সুতরাং মুসলিম ব্যক্তির উচিত যে, সে যেন তার বাড়িতে প্রবেশ করার সময় এবং খাবার খাওয়ার সময় আল্লাহকে স্মরণ করার কথাটি ভুলে না যায়। ২। শয়তান এবং তার অনুচরগুলি সেই সব বাড়িতে প্রবেশ করে, যে সব বাড়ির লোকজন আল্লাহকে স্মরণ করে না। সুতরাং শয়তান এবং তার অনুচরগুলি তাদের সাথে তাদের বাড়িতে বসবাস করে এবং পানাহার করে। ৩। মহান আল্লাহর স্মরণ শয়তানকে বিতাড়িত করে, অনন্ত করুণাময় আল্লাহকে রাজি রাখে, উদ্বিগ্নতা, দুশ্চিন্তা এবং দুঃখ কষ্টকে দূরে রাখে। আর খুশি, আনন্দ, সুখ ও শান্তি নিয়ে আসে। এবং অন্তরে সৃষ্টি করে আল্লাহর ভালোবাসা এবং আল্লাহর জন্য সচেতন থাকার অভ্যাস। অতঃপর মুসলিম ব্যক্তি নিষ্ঠাবান হয়ে অতি সুন্দর পন্থায় মহান আল্লাহর উপাসনার গণ্ডিতে প্রবেশ করে আর এমন পদ্ধতিতে মহান আল্লাহর উপাসনা করতে থাকে যে, সে যেন মহান আল্লাহকে দেখতে পাচ্ছে। আরো জেনে রাখা দরকার যে, মহান আল্লাহর স্মরণের দ্বারা মানুষ আল্লাহর দিকে অধিকতর অগ্রসর হতে পারে এবং তাঁর নৈকট্য লাভ করতে সক্ষম হয়।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5263,
			"arabicnumber": "2018.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৮, আন্তর্জাতিক নাম্বারঃ ২০১৮ ৫১৫৮-(…/...) ইসহাক ইবনু মানুসূর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন। তারপর রাবী আবূ আসিম (রহঃ) এর হাদীসের মত বর্ণনা করেন। কিন্তু তিনি وَإِذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ শব্দের স্থানে وَإِنْ لَمْ يَذْكُرِ اسْمَ اللَّهِ عِنْدَ طَعَامِهِ এবং فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ এর জায়গায়إِنْ لَمْ يَذْكُرِ اسْمَ اللَّهِ عِنْدَ دُخُولِهِ বলেছেন। (ইসলামিক ফাউন্ডেশন ৫০৯১, ইসলামিক সেন্টার ৫১০২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5264,
			"arabicnumber": "2019",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৫৯, আন্তর্জাতিক নাম্বারঃ ২০১৯ ৫১৫৯-(১০৪/২০১৯) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমূহ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত যে, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা বাম হাতে আহার করবে না। কারণ, শাইতান বাম হাতে আহার করে। (ইসলামিক ফাউন্ডেশন ৫০৯২, ইসলামিক সেন্টার ৫১০৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5265,
			"arabicnumber": "2020.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬০, আন্তর্জাতিক নাম্বারঃ ২০২০ ৫১৬০-(১০৫/২০২০) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, যুহায়র ইবনু হারব ও ইবনু আবূ উমর (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমাদের কেউ খাদ্য খায়, তখন সে যেন ডান হাতে খায় আর যখন পান করে, সে যেন ডান হাতে পান করে। কারণ শাইতান বাম হাতে খায় ও পান করে। (ইসলামিক ফাউন্ডেশন ৫০৯৩, ইসলামিক সেন্টার ৫১০৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5266,
			"arabicnumber": "2020.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬১, আন্তর্জাতিক নাম্বারঃ ২০২০ ৫১৬১-(…/...) কুতাইব ইবনু সাঈদ (রহঃ) মালিক ইবনু আনাস (রহঃ) হতে, ভিন্ন সূত্রে ইবনু নুমায়র (রহঃ) তার পিতা নুমায়র থেকে, অন্য একটি সূত্রে ইবনুল মুসান্না (রহঃ) ইয়াহইয়া আল-কাত্তান (রহঃ) হতে, শেষাংশে দু’জন উবাইদুল্লাহ হতে, আর তারা সবাই যুহরী (রহঃ) হতে সুফইয়ান (রহঃ) এর সূত্রে হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৯৪, ইসলামিক সেন্টার ৫১০৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5267,
			"arabicnumber": "2020.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬২, আন্তর্জাতিক নাম্বারঃ ২০২০ ৫১৬২-(১০৬/...) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন বাম হাতে পানাহার না করে। কারণ শাইতান বাম হাতে পানাহার করে। রাবী বলেন, নাফি (রহঃ) এতে অতিরিক্ত করতেন, বাম হাতে যেন কোন (কিছু আদান-প্ৰদানও না করে। আবূ তাহির (রহঃ) এর বর্ণনায় أَحَدٌ مِنْكُمْ এর জায়গায়أَحَدُكُمْ শব্দ রয়েছে। (ইসলামিক ফাউন্ডেশন ৫০৯৫, ইসলামিক সেন্টার ৫১০৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5268,
			"arabicnumber": "2021",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৩, আন্তর্জাতিক নাম্বারঃ ২০২১ ৫১৬৩–(১০৭/২০২১) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... সালামাহ ইবনু আকওয়া (রাযিঃ) হতে বর্ণিত যে, এক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বাম হাতে খাদ্য গ্রহণ করছিল। তিনি বললেনঃ তুমি তোমার ডান হাতে খাও। সে বলল, আমি পারবো না। তিনি বললেনঃ তুমি যেন না-ই পার। শুধুমাত্র অহমিকাই তাকে বারণ করছে। সালামাহ্ (রাযিঃ) বলেন, সে আর কখনো তার ডান হাত মুখের নিকট উঠাতে পারেনি। (ইসলামিক ফাউন্ডেশন ৫০৯৬, ইসলামিক সেন্টার ৫১০৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5269,
			"arabicnumber": "2022.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৪, আন্তর্জাতিক নাম্বারঃ ২০২২ ৫১৬৪-(১০৮/২০২২) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু আবূ উমার (রহঃ) ..... উমার ইবনু আবূ সালামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর তত্ত্বাবধানে ছিলাম। খাবার বাসনে আমার হাত চারপাশে ঘুরত। তিনি আমাকে বললেনঃ হে বালক! তুমি তোমার ডান হাতে খাও এবং নিজের পাশ হতে খাও। (ইসলামিক ফাউন্ডেশন ৫০৯৭, ইসলামিক সেন্টার ৫১০৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5270,
			"arabicnumber": "2022.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৫, আন্তর্জাতিক নাম্বারঃ ২০২২ ৫১৬৫-(১০৯/...) হাসান ইবনু আলী হুলওয়ানী ও আবূ বাকর ইবনু ইসহাক (রহঃ) ..... উমর ইবনু আবূ সালামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদিন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে খাবার খাচ্ছিলাম। আমি বাসনের বিভিন্ন দিক হতে গোশত নিতে লাগলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি নিজের পাশ থেকে ভক্ষণ কর। (ইসলামিক ফাউন্ডেশন ৫০৯৮ ইসলামিক সেন্টার ৫১০৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5271,
			"arabicnumber": "2023.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৬, আন্তর্জাতিক নাম্বারঃ ২০২৩ ৫১৬৬-(১১০/২০২৩) আমর আন নাকিদ (রহঃ) ..... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বর্তনের মুখে মুখ লাগিয়ে পান করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫০৯৯, ইসলামিক সেন্টার ৫১১০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5272,
			"arabicnumber": "2023.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৭, আন্তর্জাতিক নাম্বারঃ ২০২৩ ৫১৬৭-(১১১/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত যে, তিনি বলেছেনঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মশক বাকিয়ে এর মুখে মুখ লাগিয়ে পান করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫১০০, ইসলামিক সেন্টার ৫১১১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5273,
			"arabicnumber": "2023.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৮, আন্তর্জাতিক নাম্বারঃ ২০২৩ ৫১৬৮-(…/...) আবদ ইবনু হুমায়ুদ (রহঃ) ..... যুহরী (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণনা করেছেন। তবে রাবী মা'মার বলেছেন, اخْتِنَاثُهَا অর্থ মশকের মাথা হেলিয়ে তাতে মুখ লাগিয়ে পান করা। (ইসলামিক ফাউন্ডেশন ৫১০১. ইসলামিক সেন্টার ৫১১২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5274,
			"arabicnumber": "2024.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৬৯, আন্তর্জাতিক নাম্বারঃ ২০২৪ ৫১৬৯-(১১২/২০২৪) হাদ্দাব ইবনু খালিদ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে পান করা হতে শাসন করেছেন। (ইসলামিক ফাউন্ডেশন ৫১০২, ইসলামিক সেন্টার ৫১১৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5275,
			"arabicnumber": "2024.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭০, আন্তর্জাতিক নাম্বারঃ ২০২৪ ৫১৭০-(১১৩/...) মুহাম্মদ ইবনুল মুসান্না (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন লোককে দণ্ডায়মান হয়ে পান করতে বারণ করেছেন। কাতাদাহ বলেন, আমরা বললাম, তবে খাবারের ব্যাপারে (আদেশ কি)? তিনি বললেন, সেটা তো আরো নিকৃষ্ট, আরো জঘন্য। (ইসলামিক ফাউন্ডেশন ৫১০৩, ইসলামিক সেন্টার ৫১১৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5276,
			"arabicnumber": "2024.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭১, আন্তর্জাতিক নাম্বারঃ ২০২৪ ৫১৭১-(.../...) কুতাইবাহ্ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত করেছেন। তবে রাবী হিশাম (রহঃ) কাতাদাহ্ (রাযিঃ) এর উক্তিটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫১০৪, ইসলামিক সেন্টার ৫১১৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5277,
			"arabicnumber": "2025.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭২, আন্তর্জাতিক নাম্বারঃ ২০২৫ ৫১৭২-(১১৪/২০২৫) হাদ্দাব ইবনু খালিদ (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে পান করা হতে কঠিনভাবে সাবধান করেছেন। (ইসলামিক ফাউন্ডেশন ৫১০৫, ইসলামিক সেন্টার ৫১১৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5278,
			"arabicnumber": "2025.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৩, আন্তর্জাতিক নাম্বারঃ ২০২৫ ৫১৭৩-(১১৫/...) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে পান করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫১০৬, ইসলামিক সেন্টার ৫১১৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5279,
			"arabicnumber": "2026",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৪, আন্তর্জাতিক নাম্বারঃ ২০২৬ ৫১৭৪-(১১৬/২০২৬) আবদুল জাব্বার ইবনু 'আলা (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন কখনো দাঁড়িয়ে পান না করে। কেউ ভুলে পান করলে সে যেন পরে বমি করে ফেলে। (ইসলামিক ফাউন্ডেশন ৫১০৭, ইসলামিক সেন্টার ৫১১৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5280,
			"arabicnumber": "2027.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৫, আন্তর্জাতিক নাম্বারঃ ২০২৭ ৫১৭৫–(১১৭/২০২৭) আবূ কামিল জাহদারী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যমযম হতে পানি পান করিয়েছি। তিনি দাঁড়িয়ে তা পান করলেন। (ইসলামিক ফাউন্ডেশন ৫১০৮, ইসলামিক সেন্টার ৫১১৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5281,
			"arabicnumber": "2027.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৬, আন্তর্জাতিক নাম্বারঃ ২০২৭ ৫১৭৬-(১১৮/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত রয়েছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যমযম কুয়া হতে ছোট বালতি দ্বারা পানি উঠিয়ে দাঁড়িয়ে পান করেছেন। (ইসলামিক ফাউন্ডেশন ৫১০৯, ইসলামিক সেন্টার ৫১২০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5282,
			"arabicnumber": "2027.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৭, আন্তর্জাতিক নাম্বারঃ ২০২৭ ৫১৭৭-(১১৯/...) সুরায়জ ইবনু ইউনুস, ইয়াকুব দাওরাকী ও ইসমাঈল ইবনু সালিম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে যমযম হতে পানি পান করেছেন। (ইসলামিক ফাউন্ডেশন ৫১১০, ইসলামিক সেন্টার ৫১২০১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5283,
			"arabicnumber": "2027.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৮, আন্তর্জাতিক নাম্বারঃ ২০২৭ ৫১৭৮-(১২০/...) উবাইদুল্লাহ ইবনু মুআয (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যমযম হতে (পানি) পান করিয়েছি। তিনি দাঁড়ানো অবস্থায় পান করেছেন এবং তিনি পানি চেয়ে লোক পাঠালেন, তখন তিনি বাইতুল্লাহর নিকটে ছিলেন। (ইসলামিক ফাউন্ডেশন ৫১১১, ইসলামিক সেন্টার ৫১২২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5284,
			"arabicnumber": "2027.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৭৯, আন্তর্জাতিক নাম্বারঃ ২০২৭ ৫১৭৯-(.../...) মুহাম্মাদ ইবনু বাশশার ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... শু'বাহ (রহঃ) হতে উল্লেখিত সূত্রে হাদীসটি রিওয়ায়াত করেছেন। তবে তাদের দু'জনের হাদীসে রয়েছে- ‘আমি তার নিকট বালতি নিয়ে আসলাম'। (ইসলামিক ফাউন্ডেশন ৫১১২, ইসলামিক সেন্টার ৫১২৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5285,
			"arabicnumber": "267.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮০, আন্তর্জাতিক নাম্বারঃ ২৬৭ ৫১৮০-(১২১/২৬৭) ইবনু আবূ উমার (রহঃ) ..... আবূ কাতাদাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানপাত্রের মধ্যে শ্বাস ফেলতে বারণ করেছেন। [দ্রষ্টব্য হাদীস ৬১৩] (ইসলামিক ফাউন্ডেশন ৫১১৩, ইসলামিক সেন্টার ৫১২৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5286,
			"arabicnumber": "2028.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮১, আন্তর্জাতিক নাম্বারঃ ২০২৮ ৫১৮১-(১২২/২০২৮) কুতাইবাহ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (যখন পান করতেন) তিনবার পাত্রে (পাত্রের বাইরে) শ্বাস নিতেন। (ইসলামিক ফাউন্ডেশন ৫১১৪, ইসলামিক সেন্টার ৫১২৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5287,
			"arabicnumber": "2028.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮২, আন্তর্জাতিক নাম্বারঃ ২০২৮ ৫১৮২-(১২৩/...) ইয়াহইয়া ইবনু ইয়াহইয়া ও শাইবান ইবনু ফাররূখ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, পান করার সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিনবার নিঃশ্বাস নিতেন এবং বলতেন, এতে করে ভালভাবে প্রশান্তি লাভ হয়, তৃষ্ণার্তের কষ্ট লাঘব হয় এবং খুব আরামে গলধঃকরণ হয়। আনাস (রাযিঃ) বলেন, আমিও পান করার সময় তিনবার নিঃশ্বাস নিয়ে থাকি। (ইসলামিক ফাউন্ডেশন ৫১১৫, ইসলামিক সেন্টার ৫১২৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5288,
			"arabicnumber": "2028.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৩, আন্তর্জাতিক নাম্বারঃ ২০২৮ ৫১৮৩-(…/...) কুতাইবাহ ইবনু সাঈদ ও আবূ বকর ইবনু আবূ শাইবাহ (রহঃ) ... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু বর্ণনা করেন। বর্ণনাকারী হিশাম فِي الشَّرَابِ শব্দের স্থানে فِي الإِنَاءِ বলেছেন। (ইসলামিক ফাউন্ডেশন ৫১১৬, ইসলামিক সেন্টার ৫১২৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5289,
			"arabicnumber": "2029.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৪, আন্তর্জাতিক নাম্বারঃ ২০২৯ ৫১৮৪-(১২৪/২০২৯) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পানি মেশানো কিছু দুধ আনা হলো। তার ডান দিকে একজন বেদুঈন ছিল, বাম দিকে ছিলেন আবূ বাকর (রাযিঃ)। তিনি পান করলেন। অতঃপর বেদুঈনকে দিয়ে বললেনঃ ডান থেকে, ডানে হওয়া করণীয়। (ইসলামিক ফাউন্ডেশন ৫১১৭, ইসলামিক সেন্টার ৫১২৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5290,
			"arabicnumber": "2029.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৫, আন্তর্জাতিক নাম্বারঃ ২০২৯ ৫১৮৫-(১২৫/...) আবূ বকর ইবনু আবূ শাইবাহ, আম্‌র আন নাকিদ যুহায়র ইবনু হারব ও মুহাম্মদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদীনায় আসেন তখন আমার বয়স ছিল দশ বছর। তিনি যখন মৃত্যুবরণ করেন তখন আমার বয়স বিশ বছর। আমার মা খালাগণ আমাকে তার সেবা করার জন্য প্রেরণা দিতেন। একবার তিনি আমাদের গৃহে আসলেন, আমরা তার জন্য পালিত বকরীর দুধ দোহন করলাম, গৃহের একটি কুয়া থেকে অল্প পানি মেশানো হলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পান করলেন। তার বাম দিকে আবূ বকর (রাযিঃ) ছিলেন। উমর (রাযিঃ) বললেন, হে আল্লাহর রসূল! আবূ বাকর (রাযিঃ) কে দিন। কিন্তু তিনি তার ডান পাশের বেদুঈনকে দিলেন এবং বললেনঃ ডান দিক হতে, ডানের হক বেশি। (ইসলামিক ফাউন্ডেশন ৫১১৮, ইসলামিক সেন্টার ৫১২৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5291,
			"arabicnumber": "2029.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৬, আন্তর্জাতিক নাম্বারঃ ২০২৯ ৫১৮৬-(১২৬/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ ইবনু হুজুর ও আবদুল্লাহ ইবনু মাসলামাহ ইবনু কা'নাব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের গৃহে আগমন করে কিছু পান করতে ইচ্ছা করলেন। আমরা তার জন্য একটি ছাগলের দুধ দোহন করলাম। তারপর আমি আমার এ কুপ হতে কিছু পানি দুধের সাথে মেশালাম। তিনি (আনাস) বলেন, অতঃপর আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দিলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পান করলেন। আবূ বাকর (রাযিঃ) তার বাম পাশে ছিলেন। উমর (রাযিঃ) তার সম্মুখে আর তার ডান দিকে ছিল এক বেদুঈন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন পান করা শেষ করলেন, তখন উমর (রাযিঃ) আবূ বকরকে দেখিয়ে তাকে বললেন, হে আল্লাহর রসূল! এ তো আবূ বাকর (রাযিঃ) (তাকে দিন)। কিন্তু রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর ও উমর (রাযিঃ) কে (আগে) না দিয়ে সে বেদুঈনকে দিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আগে ডান পাশের মানুষদের। ডান পাশের মানুষদের, ডান পাশের লোকদেরই বেশি হক রয়েছে। আনাস (রাযিঃ) বলেন, অতএব এটা সুন্নাত, এটা সুন্নাত, এটা সুন্নাত। (ইসলামিক ফাউন্ডেশন ৫১১৯, ইসলামিক সেন্টার ৫১৩০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5292,
			"arabicnumber": "2030.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৭, আন্তর্জাতিক নাম্বারঃ ২০৩০ ৫১৮৭-(১২৭/২০৩০) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... সাহল ইবনু সা'দ সাইদী (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছু পানীয় আনা হলে তিনি সামান্য পান করলেন। তার ডান পাশে ছিল একটি ছেলে আর বাম পাশে কিছু বৃদ্ধ মানুষ। তিনি ছেলেটিকে বললেন, তুমি কি তাদেরকে দেয়ার জন্য আমাকে অনুমতি দিবে? ছেলেটি বলল, না। আল্লাহর শপথ। আপনার নিকট হতে যা পাওনা আমার ভাগে (তাতে) আমি অন্য কাউকে প্রাধান্য দিব না। আনাস (রাযিঃ) বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুধের বাটি তার হাতেই তুলে দিলেন। (ইসলামিক ফাউন্ডেশন ৫১২০, ইসলামিক সেন্টার ৫১৩১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5293,
			"arabicnumber": "2030.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৮, আন্তর্জাতিক নাম্বারঃ ২০৩০ ৫১৮৮-(১২৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া, কুতাইবাহ ইবনু সাঈদ ..... সাহল ইবনু সা'দ (রাযিঃ) এর সনাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু বর্ণনা করেছেন। তারা দুজনেই فَتَلَّهُ (তার হাতে দিলেন) শব্দটি বর্ণনা করেননি। তবে ইয়াকুব (রহঃ) এর বর্ণনায় فَتَلَّهُ এর স্থানে فَأَعْطَاهُ إِيَّاهُ (তাকেই দিলেন) উক্তিটি বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫১২১, ইসলামিক সেন্টার ৫১৩২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5294,
			"arabicnumber": "2031.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৮৯, আন্তর্জাতিক নাম্বারঃ ২০৩১ ৫১৮৯–(১২৯/২০৩১) আবূ বাকর ইবনু আবূ শাইবাহ, ‘আমর আন নাকিদ, ইসহাক ইবনু ইব্রাহীম ও ইবনু আবূ উমর (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন আহার করে, সে যেন তার হাত মুছে না ফেলে যতক্ষণ না সে তা চেটে খায়* বা অপরকে দিয়ে চাটায়। (ইসলামিক ফাউন্ডেশন ৫১২২, ইসলামিক সেন্টার ৫১৩৩) * এ সুন্নাতটা বর্তমান সময়ে আমাদের মধ্যে নেই বললেই চলে। এ বিষয়গুলো পুনরায় চালু করলে খাদ্যে অধিক বারাকাত লাভের সুযোগ রয়েছে।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5295,
			"arabicnumber": "2031.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯০, আন্তর্জাতিক নাম্বারঃ ২০৩১ ৫১৯০-(১৩০/...) হারূন ইবনু আবদুল্লাহ, ‘আবদ ইবনু হুমায়দ ও যুহায়র ইবনু হারব (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমাদের কেউ আহার করে, সে যেন স্বীয় হস্ত মুছে না ফেলে যতক্ষণ না সে তা নিজে চেটে খায় কিংবা অপরকে দিয়ে চাটায়। (ইসলামিক ফাউন্ডেশন ৫১২৩, ইসলামিক সেন্টার ৫১৩৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5296,
			"arabicnumber": "2032.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯১, আন্তর্জাতিক নাম্বারঃ ২০৩২ ৫১৯১-(১৩১/২০৩২) আবূ বাকর ইবনু আবূ শাইবাহ্, যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ...... কা'ব ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর আঙ্গুল তিনটি* হতে খাবার চেটে খেতে দেখেছি। কিন্তু ইবনু হাতিম (রহঃ) ثلاث (তিন) শব্দটি উল্লেখ করেননি। আর ইবনু আবূ শাইবাহ তার বর্ণনায় আব্দুর রহমান ইবনু কা'ব (রহঃ) তাঁর পিতা হতে সূত্রটির কথা বলেছেন। (ইসলামিক ফাউন্ডেশন ৫১২৪, ইসলামিক সেন্টার ৫১৩৫) * আরবের প্রধান খাদ্য ছিল তখন রুটি বা শুকনো জাতীয় খাবার। ঐগুলো খেতে নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার (১) বৃদ্ধ (২) শাহাদাত (৩) মধ্যম আঙ্গুলগুলোই ব্যবহার করতেন। (আমাদেরও ঐ রকম খাদ্যে একই রকমভাবে নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুসরণ করা দরকার)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5297,
			"arabicnumber": "2032.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯২, আন্তর্জাতিক নাম্বারঃ ২০৩২ ৫১৯২-(…/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... কা'ব ইবনু মালিক (রহঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিন আঙ্গুলে খাবার খেতেন এবং হাত মুছার আগে তা চেটে খেতেন। (ইসলামিক ফাউন্ডেশন ৫১২৫, ইসলামিক সেন্টার ৫১৩৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5298,
			"arabicnumber": "2032.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৩, আন্তর্জাতিক নাম্বারঃ ২০৩২ ৫১৯৩–(১৩২/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... কা'ব (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিন আঙ্গুলে খাবার খেতেন এবং খাবার শেষ করে আঙ্গুলগুলো চেটে খেতেন। (ইসলামিক ফাউন্ডেশন ৫১২৬, ইসলামিক সেন্টার ৫১৩৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5299,
			"arabicnumber": "2032.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৪, আন্তর্জাতিক নাম্বারঃ ২০৩২ ৫১৯৪-(…/...) আবূ কুরায়ব (রহঃ) ..... কা'ব ইবনু মালিক (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫১২৭, ইসলামিক সেন্টার ৫১৩৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5300,
			"arabicnumber": "2033.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৫, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫১৯৫-(১৩৩/২০৩৩) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আজুল ও বাসন চেটে খেতে* নির্দেশ করেছেন। আর তিনি বলেছেনঃ (খাদ্যের) কোন অংশে বারাকাত আছে তা তোমরা জান না। (ইসলামিক ফাউন্ডেশন ৫১২৮, ইসলামিক সেন্টার ৫১৩৯) * বাসন চেটে বা পরিষ্কার করে খাওয়া নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সুন্নাত। এ সুন্নাতটা আরো অধিক পরিমাণে অবহেলার স্বীকার। এ সুন্নানটাও আমাদের জীবিত করা দরকার।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5301,
			"arabicnumber": "2033.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৬, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫১৯৬-(১৩৪/…) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো লোকমা পড়ে গেলে সে যেন তা তুলে নেয়। তারপর তাতে যে আবর্জনা স্পর্শ করেছে তা যেন দূরীভূত করে এবং খাদ্যটুকু খেয়ে ফেলে। শাইতানের জন্য সেটি যেন ফেলে না রাখে। আর তার আঙ্গুল চেটে না খাওয়া পর্যন্ত সে যেন তার হাত রুমাল দিয়ে মুছে না ফেলে। কেননা সে জানে না খাদ্যের কোন অংশে বারাকাত রয়েছে। (ইসলামিক ফাউন্ডেশন ৫১২৯, ইসলামিক সেন্টার ৫১৪০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5302,
			"arabicnumber": "2033.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৭, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫১৯৭-(.../...) ইসহাক ইবনু ইবরাহীম, মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... সুফইয়ান (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণনা করেছেন। তাদের দু'জনের হাদীসে আছে, সে ব্যক্তি যেন তার হাত রুমাল দিয়ে মুছে না ফেলে, যতক্ষণ না সে তার নিজের হাত চেটে খায় কিংবা অপরকে দিয়ে চাটায়। ...... পরবর্তীতে বাকী অংশ উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৩০, ইসলামিক সেন্টার ৫১৪১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5303,
			"arabicnumber": "2033.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৮, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫১৯৮–(১৩৫/...) উসমান ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, শাইতান তোমাদের সকল কাজ-কর্মে উপস্থিত হয়। এমনকি তোমাদের কারো খাবারের সময়ও সে উপস্থিত হয়। সুতরাং তোমাদের যদি কারো লোকমা মাটিতে পড়ে যায়, সে যেন তাতে লেগে যাওয়া আবর্জনা সরিয়ে তা খেয়ে ফেলে। শাইতানের জন্য যেন ফেলে না রাখে। খাবার শেষে সে যেন তার আঙ্গুলগুলো চেটে খায়। কেননা সে জানে না, তার খাদ্যের কোন অংশে বারাকাত (কল্যাণ) রয়েছে। (ইসলামিক ফাউন্ডেশন ৫১৩১, ইসলামিক সেন্টার ৫১৪২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5304,
			"arabicnumber": "2033.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৯৯, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫১৯৯-(.../...) আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) দু’জনই আবূ মু'আবিয়াহ্ (রহঃ) হতে, তিনি আ'মাশ (রহঃ) হতে উপরোক্ত সূত্রে বর্ণনা করেছেন যে, “যখন তোমাদের কারো লোকমা পড়ে যায়, ..... হাদীসের শেষ পর্যন্ত। তবে আবূ মুআবিয়াহ্ (রহঃ) হাদীসের প্রথমাংশ \"শইতান তোমাদের প্রতিটি কাজে-কর্মে উপস্থিত হয়\"- কথাটি উত্থাপন করেননি। (ইসলামিক ফাউন্ডেশন ৫১৩২, ইসলামিক সেন্টার ৫১৪৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5305,
			"arabicnumber": "2033.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০০, আন্তর্জাতিক নাম্বারঃ ২০৩৩ ৫২০০-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে চেটে খাওয়ার ব্যাপারে হাদীস বর্ণনা করেছেন। আবূ সুফইয়ান (রহঃ) জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে রিওয়ায়াত করেছেন। তিনিও তাদের উভয়ের হাদীসের ন্যায় লোকমার কথা বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৩৩, ইসলামিক সেন্টার ৫১৪৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5306,
			"arabicnumber": "2034",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০১, আন্তর্জাতিক নাম্বারঃ ২০৩৪ ৫২০১–(১৩৬/২০৩৪) মুহাম্মাদ ইবনু হাতিম ও আবূ বকর ইবনু নাফি আবদী (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন খাদ্য খেতেন তখন তাঁর আঙ্গুল তিনটি চেটে খেতেন এবং তিনি বলেছেনঃ তোমাদের কারো লোকমা যদি মাটিতে পড়ে যায় তবে সে যেন তা হতে ময়লা দূর করে এবং খাবারটুকু খেয়ে ফেলে, তা যেন শাইতানের জন্য রেখে না দেয়। আর তিনি আমাদের বাসন মুছে খেতে নির্দেশ দিয়ে বলেছেন, 'কারণ তোমরা জান না, তোমাদের খাবারের কোন অংশে কল্যাণ রয়েছে'। (ইসলামিক ফাউন্ডেশন ৫১৩৪, ইসলামিক সেন্টার ৫১৪৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5307,
			"arabicnumber": "2035.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০২, আন্তর্জাতিক নাম্বারঃ ২০৩৫ ৫২০২-(১৩৭/২০৩৫) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ তোমাদের কেউ যখন খাবার খায়, সে যেন তার আঙ্গুলগুলো চেটে খায়। কারণ সে জানে না খাদ্যের কোন অংশে বারাকাত রয়েছে। (ইসলামিক ফাউন্ডেশন, ৫১৩৫, ইসলামিক সেন্টার ৫১৪৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5308,
			"arabicnumber": "2035.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৩, আন্তর্জাতিক নাম্বারঃ ২০৩৫ ৫২০৩-(.../...) আবূ বকর ইবনু নাফি' (রহঃ) ..... হাম্মাদ (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীসটি বর্ণিত। তবে তিনি বলেছেন, তোমাদের সবাই যেন বাসন চেটে খায়। আর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, তোমরা জান না তোমাদের কোন খাদ্যে বারাকাত রয়েছে অথবা কোন খাদ্যে বারাকাত দেয়া হয়। (ইসলামিক ফাউন্ডেশন ৫১৩৫, ইসলামিক সেন্টার ৫১৪৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5309,
			"arabicnumber": "2036.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৪, আন্তর্জাতিক নাম্বারঃ ২০৩৬ ৫২০৪-(১৩৮/২০৩৬) কুতাইবাহ ইবনু সাঈদ ও উসমান ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ মাসউদ আনসারী (রাযিঃ) হতে বর্ণিত। আবূ শু'আয়ব নামধারী এক আনসারী ব্যক্তি ছিল। তার একজন কসাই দাস ছিল। লোকটি একদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখে তার অবয়বে ক্ষুধার আভাস অনুভব করলো। পরে তার গোলামকে বলল, তোমার কল্যাণ হোক আমাদের পাঁচজনের জন্য তুমি খাবার তৈরি করো। কেননা আমি পঞ্চম ব্যক্তি হিসেবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দা'ওয়াত দিতে ইচ্ছা পোষণ করেছি। তখন সে খাবার তৈরি করলো। তারপর লোকটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে তাকে সহ পাঁচজনকে দাওয়াত দিল। জনৈক লোক তাদের পিছে অনুসরণ করলো। দরজা পর্যন্ত পৌছলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ লোকটি আমাদের পিছু পিছু এসেছে। তুমি চাইলে তাকে অনুমতি দিতে পার, আর যদি ইচ্ছা কর তবে সে প্রত্যাবর্তন করবে। লোকটি বলল, না। বরং আমি তাকে অনুমতি দিচ্ছি, হে আল্লাহর রসূল! (ইসলামিক ফাউন্ডেশন ৫১৩৬, ইসলামিক সেন্টার ৫১৪৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5310,
			"arabicnumber": "2036.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৫, আন্তর্জাতিক নাম্বারঃ ২০৩৬ ৫২০৫-(.../…) আবূ বাকর ইবনু আবূ শইবাহ, ইসহাক ইবনু ইবরাহীম নাসর ইবনু আলী জাহযামী, আবূ সাঈদ আশাজ্জ, উবাইদুল্লাহ ইবনু মুআয ও আবদুল্লাহ ইবনু আব্দুর রহমান দারিমী (রহঃ) ..... আবূ মাসউদ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে জারীর (রাযিঃ) এর হাদীসের অবিকল হাদীস বর্ণনা করেছেন। কিন্তু নাসর ইবনু আলী পুরো সানাদ 'হাদ্দাসানা' দিয়ে বর্ণনা করেছেন এবং পুরো হাদীসটি বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৩৭, ইসলামিক সেন্টার ৫১৪৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5311,
			"arabicnumber": "2036.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৬, আন্তর্জাতিক নাম্বারঃ ২০৩৬ ৫২০৬-(…/...) মুহাম্মাদ ইবনু 'আমর ইবনু জাবালাহ্ ইবনু আবূ রাওওয়াদ (রহঃ) ..... জাবির (রাযিঃ) হতে, ভিন্ন সূত্রে সালামাহ্ ইবনু শাবীব (রহঃ) ..... আবূ মাসউদ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৩৮, ইসলামিক সেন্টার ৫১৫০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5312,
			"arabicnumber": "2037",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৭, আন্তর্জাতিক নাম্বারঃ ২০৩৭ ৫২০৭—(১৩৯/২০৩৭) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একজন ইরানী প্রতিবেশী ভাল সালুন রান্না করতে পারতো। একদা সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য সামান্য খাবার তৈরি করে তাকে দা'ওয়াত করতে আসলো। তিনি আয়িশাহ (রাযিঃ) এর দিকে ইশারা করে বললেন এই যে, আয়িশাহ আছেন। সে বলল, না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ (তাহলে আমিও) না। লোকটি আবার তাকে দাওয়াত করলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইনিও ['আয়িশাহ (রাযিঃ)]? সে বলল, না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ (তাহলে আমিও) না। এরপর সে পুনরায় তাকে দাওয়াত করতে আসলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইনিও? লোকটি তৃতীয়বারে বলল, হ্যাঁ। তারপর তারা উভয়েই দাঁড়ালেন এবং একজনের পিছনে আরেকজন চলে তার গৃহে এসে পৌছলেন। (ইসলামিক ফাউন্ডেশন ৫১৩৯, ইসলামিক সেন্টার ৫১৫১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5313,
			"arabicnumber": "2038.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৮, আন্তর্জাতিক নাম্বারঃ ২০৩৮ ৫২০৮-(১৪০/২০৩৮) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক দিনে কিংবা রাতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তার বাড়ী থেকে) বের হয়ে আবূ বাকর (রাযিঃ) ও উমার (রাযিঃ) কে দর্শন করলেন। তিনি প্রশ্ন করলেন, এ সময় কিসে তোমাদের গৃহ হতে বের করেছে? তারা বললেন, হে আল্লাহর রসূল! উপবাসের যন্ত্রণায়। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, যে মহান আল্লাহর হাতে আমার জীবন, তার কসম, যা তোমাদের বের করে এনেছে, আমাকেও তা-ই বের করে এনেছে, চলো। তারা উভয়ে তার সাথে চলতে লাগলেন। তারপর তিনি এক আনসারীর গৃহে এলেন তখন তিনি বাড়িতে ছিলেন না। তার সহধর্মিণী তাকে (রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) দেখে বলল, মারহাবা ওয়া আহলান مَرْحَبًا وَأَهْلاً রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে প্রশ্ন করলেন, অমুক কোথায়? স্ত্রীলোকটি বলল, তিনি আমাদের জন্য মিষ্ট পানি আনতে গেছেন। তখনই আনসারী ব্যক্তিটি উপস্থিত হয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার দু' সাথীকে দেখতে পেয়ে বললেন, আল্লাহর প্রশংসা, আজ মেহমানের দিক হতে আমার থেকে সৌভাগ্যবান আর কেউ নেই। তারপর সে গিয়ে একটি খেজুরের ছড়া নিয়ে আসলেন। তাতে কাঁচা, পাকা ও শুকনা খেজুর ছিল। তিনি বললেন, আপনার এ ছড়া থেকে খান। এরপর তিনি ছুরি নিলেন (ছাগল যাবাহ করার জন্য) তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, সাবধান, দুধওয়ালা বকরী যাবাহ করবে না। অতঃপর তাদের জন্য (বকরী) যাবাহ করলে তারা বকরীর গোশত ও কাঁদির খেজুর খেলেন এবং (মিঠা) পানি পান করলেন। তারা সকলে ক্ষুধা মিটালেন ও পরিতৃপ্ত হলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন আবূ বাকর ও উমর (রাযিঃ) কে কেন্দ্র করে বললেনঃ যে সত্তার হাতে আমার জীবন, তার কসম! কিয়ামতের দিন এ নি’আমাত সম্বন্ধে তোমরা জিজ্ঞাসিত হবে। ক্ষুধা তোমাদের বাড়ি হতে বের করে এনেছে অথচ তোমরা এ নি’আমাত লাভ না করে ফিরে যাওনি। (ইসলামিক ফাউন্ডেশন ৫১৪০, ইসলামিক সেন্টার ৫১৫২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5314,
			"arabicnumber": "2038.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২০৯, আন্তর্জাতিক নাম্বারঃ ২০৩৮ ৫২০৯-(…/...) ইসহাক ইবনু মানসূর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একবার আবূ বাকর (রাযিঃ) বসে ছিলেন। তার সাথে উমর (রাযিঃ)-ও ছিলেন। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের পাশে এসে বললেনঃ কোন জিনিস তোমাদের এ স্থানে বসিয়ে রেখেছে? তারা বললেন, সে আল্লাহর কসম! যিনি আপনাকে সত্য দীন দিয়ে প্রেরণ করেছেন। ক্ষুধা আমাদের ঘর থেকে আমাদের বাইরে নিয়ে এসেছে। অতঃপর বর্ণনাকারী খালাফ ইবনু খলীফা (রহঃ) এর হাদীসের অবিকল বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৫১৪১, ইসলামিক সেন্টার ৫১৫৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১০, আন্তর্জাতিক নাম্বারঃ ২০৩৯ ৫২১০-(১৪১/২০৩৯) হাজ্জাজ ইবনু শাইর (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (খন্দক যুদ্ধের প্রাক্কালে) পরিখা খোড়ার সময় আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দেহে ক্ষুধার যন্ত্রণা লক্ষ্য করলাম। অতঃপর আমার সহধর্মিণীর নিকট ফিরে এসে তাকে বললাম, তোমার কাছে কিছু আছে কি? কেননা, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে চরম ক্ষুধার্ত অবস্থায় দেখেছি। অতঃপর সে একটি চামড়ার ব্যাগ বের করলো, যার মধ্যে এক সা' পরিমাণ যব ছিল। আর আমাদের একটা গৃহপালিত বকরী ছিল। আমি ওটা যাবাহ করলাম, আর স্ত্রী যবগুলো ভালভাবে পিষে নিল। আমার কাজ সম্পাদনের সঙ্গে সঙ্গে সেও তার কাজ শেষ করলো। আমি (রান্নার জন্য) গোশত কেটে ডেগচিতে রাখলাম। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ফিরে এলাম। (যাওয়ার সময়) আমার স্ত্রী আমাকে বলল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার সাথীদের দিয়ে তুমি আমাকে লাঞ্ছিত করো না। তিনি বলেন, তারপর আমি তার নিকট এসে চুপি চুপি তাকে বললাম, হে আল্লাহর রসূল! আমরা একটি বকরী যাবাহ করেছি আর আমাদের এক সা' পরিমাণ যব ছিল আমার স্ত্রী তাই পিষে নিয়েছে। সুতরাং আপনি কয়েকজনকে সাথে নিয়ে আসুন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দরাজকণ্ঠে বললেন, হে পরিখা খননকারীরা জাবির তোমাদের জন্য কিছু খাবার তৈরি করেছে। তোমরা সকলে চলো। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমাকে) বললেন; আমি না আসা পর্যন্ত তোমাদের ডেগ (চুলা থেকে) নামাবে না এবং খামীর দ্বারা রুটি প্রস্তুত করবে না। আমি আসলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানুষদের আগে আগে আসলেন। আমি আমার স্ত্রীর নিকট এলে সে আমাকে (তিরস্কার করে) বলল, তোমার ধ্বংস হোক, তোমার ধ্বংস হোক। আমি বললাম, আমি তাই করেছি, তুমি যা আমাকে বলেছিলে। অতঃপর সে খামীরগুলো বের করলো। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মধ্যে একটু লালা দিলেন এবং বারাকাতের দুআ করলেন। অতঃপর তিনি বললেন, রুটি প্রস্তুতকারিণীকে ডাক, যে তোমার সঙ্গে রুটি প্রস্তুত করবে। আর তুমি পাতিল হতে পেয়ালা ভরে ভরে নিবে। আর ডেগ (চুল্লি হতে) নামাবে না। তারা ছিলেন মোট এক হাজার মানুষ। আল্লাহর নামে শপথ করছি। তারা সকলে খাবার খেলেন। পরিশেষে তারা তা রেখে এমনভাবে ফিরে গেলেন যে, আমাদের ডেগ আগের মতো উতলিয়ে পড়ছিল। আর আমাদের খামীর পূর্বের মতো রুটি প্রস্তুত করা হচ্ছিল। (ইসলামিক ফাউন্ডেশন ৫১৪২, ইসলামিক সেন্টার ৫১৫৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১১, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১১-(১৪২/২০৪০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (একদা) আবূ তালহাহ (রাযিঃ) উম্মু সুলায়ম (রাযিঃ) কে বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দুর্বল শব্দ শ্রবণ করে বুঝতে পেরেছি যে, তিনি ক্ষুধার্ত। তাই তোমার কাছে কিছু আছে কি? তিনি বললেন, হ্যাঁ। তিনি যবের কয়েক খন্ড রুটি বের করলেন। তারপর তার ওড়না নিলেন এবং এটির একাংশ দিয়ে রুটিগুলো পেচিয়ে আমার কাপড়ের তলায় গুজে দিলেন এবং অপর অংশ আমার দেহে জড়িয়ে দিলেন। অতঃপর আমাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে প্রেরণ করলেন। তিনি (আনাস) বলেন, আমি এগুলো নিয়ে এসে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখতে পেলাম তিনি মসজিদে বসে আছেন। তার সাথে আরো মানুষ ছিলেন। আমি তাদের নিকট গিয়ে দাঁড়ালাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাকে আবূ তালহাহ প্রেরণ করেছে? আমি বললাম, হ্যাঁ। তিনি বললেন, খাওয়ার ব্যাপারে? আমি বললাম, হ্যাঁ। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথীদের বললেন, সবাই চলো। আনাস (রাযিঃ) বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গেলেন। আর আমি তাদের সামনে চলতে লাগলাম। পরিশেষে আমি আবূ তালহাহ্ (রাযিঃ)-এর কাছে এসে তাকে (ঘটনা) খবর দিলাম। তখন আবূ তালহাহ (রাযিঃ) বললেন, হে উম্মু সুলায়ম (রাযিঃ)! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তো লোকদের নিয়ে আসছেন, অথচ আমাদের কাছে সে পরিমাণ খাদ্য নেই যা দিয়ে তাদের আপ্যায়ন করতে পারি। উম্মু সুলায়ম (রাযিঃ) বললেন, (তুমি উদ্বিগ্ন হয়ে না) আল্লাহ এবং তার রসূলই ভাল জানেন। আনাস (রাযিঃ) বলেন, তারপর আবূ তালহাহ্ (রাযিঃ) যেয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে দেখা করলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে এসে (উভয়ে) ঘরে ঢুকলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু সুলায়ম (রাযিঃ)-কে লক্ষ্য করে বললেন, হে উম্মু সুলায়ম! তোমার কাছে যা আছে নিয়ে আসো। তিনি সে রুটিগুলো তার সাথে করে নিয়ে আসলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দান করলে সেগুলো টুকরা টুকরা করা হলো। আর উম্মু সুলায়ম (রাযিঃ) চামড়া দ্বারা তৈরি ঘি-এর পাত্রটি চিপে সেটি সালুন হিসেবে দিলেন। আর এর ভিতরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর ইচ্ছানুযায়ী কিছু পড়লেন। অতঃপর বললেন, দশজনকে আসতে বলো। তাদের ডাকা হলে তারা এসে তৃপ্তির সাথে খাবার খেয়ে বেরিয়ে গেলেন। অতঃপর তিনি বললেন, আরো দশজনকে আসতে বলে। তাদের ডাকা হলে তারা পেট ভরে খেয়ে চলে গেলেন। পুনরায় তিনি বললেন, দশজনকে ডাক। এভাবে দলের সকলে পেটপুরে খাবার খেলেন। সত্তর কিংবা আশিজন লোক তাদের দলে ছিল। (ইসলামিক ফাউন্ডেশন ৫১৪৩, ইসলামিক সেন্টার ৫১৫৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5317,
			"arabicnumber": "2040.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১২, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১২-(১৪৩/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ তালহাহ (রাযিঃ) কিছু খাদ্যের ব্যবস্থা করে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দাওয়াত করার জন্য আমাকে প্রেরণ করলেন। আমি তার নিকট গেলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাথীদের সাথে ছিলেন। তিনি আমার প্রতি দৃষ্টি নিক্ষেপ করলেন। আমি লজ্জার সাথে বললাম, আপনি আবূ তালহার দাওয়াত কবুল করুন। তখন তিনি লোকদের বললেনঃ তোমরা সবাই চলো। আবূ তালহাহ্ (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমি তো শুধুমাত্র আপনার জন্য সামান্য খাবার ব্যবস্থা করেছি। আনাস (রাযিঃ) বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবারগুলো ছুয়ে দেখলেন এবং এতে বারাকাতের দুআ করলেন। অতঃপর বললেন, আমার সাথীদের থেকে দশজনকে ঘরে নিয়ে এসো। তিনি তাদের বললেন, তোমরা খেতে থাকো। তিনি তাদের জন্য তার আঙ্গুলের মধ্য থেকে কিছু বের করে দিলেন। তারা সকলে তৃপ্তিসহ খাওয়ার পর বেরিয়ে গেলেন। অতঃপর বললেন, আরো দশ জনকে ঘরে নিয়ে এসো। তারাও আহার শেষে বের হয়ে গেলেন। এভাবে দশজন ঘরে প্রবেশ করে এবং দশজন বের হয়ে যায়। এমনকি তাদের মাঝ থেকে একজনও বাকী থাকেনি যে ঘরে ঢুকেনি। অতঃপর তিনি পাত্র খুলে দেখলেন, সকলে আহার করার পূর্বে যেমন ছিল এখনও ঠিক তেমনি আছে।* (ইসলামিক ফাউন্ডেশন ৫১৪৪, ইসলামিক সেন্টার ৫১৫৬) * অর্থাৎ পাত্রের খাবার আগে যেমন ছিল সবাই খাওয়ার পর ঠিক তেমনই রয়ে গেল। এটা ছিল রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মু'জিযা।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5318,
			"arabicnumber": "2040.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৩, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৩-(.../…) সাঈদ ইবনু ইয়াহইয়া উমাবী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ তালহাহ (রাযিঃ) আমাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে প্রেরণ করলেন। রাবী ইবনু নুমায়র (রহঃ) এর হাদীসের হুবহু বর্ণনা করেন। তবে হাদীসটির শেষাংশে তিনি বলেন, অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাকী অংশ জমা করে এতে বারাকাতের প্রার্থনা করলেন। আনাস (রাযিঃ) বলেন, ফলে তা (পূর্বে) যেমনি ছিল আবার তেমনি হয়ে গেল এবং তিনি বললেনঃ এবার তোমরা নাও। (ইসলামিক ফাউন্ডেশন ৫১৪৫, ইসলামিক সেন্টার ৫১৫৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5319,
			"arabicnumber": "2040.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৪, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৪-(.../...) আমর আন নাকিদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একমাত্র নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য খাবার তৈরি করতে আবূ তালহাহ্ (রাযিঃ) উম্মু সুলায়ম (রাযিঃ) কে আদেশ করলেন। অতঃপর তিনি আমাকে তার কাছে প্রেরণ করলেন। অতঃপর রাবী শেষ পর্যন্ত হাদীসটি রিওয়ায়াত করেন। এ হাদীসে তিনি বলেছেন, অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাতে হাত রাখলেন এবং আল্লাহর নাম স্মরণ করলেন। অতঃপর বললেন, দশজনকে ডাকো। তাদের ডাকলে তারা ঘরে ঢুকলো। তিনি বললেন, তোমরা বিসমিল্লাহ (আল্লাহর নামে) বলে খাওয়া শুরু করো। তারা আহার করলো। এভাবে আশিজনের সাথে এ রকম করলেন। সবশেষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ঘরের লোকেরা খাবার খেলেন এবং কিয়দংশ রেখে গেলেন। (ইসলামিক ফাউন্ডেশন ৫১৪৬, ইসলামিক সেন্টার ৫১৫৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5320,
			"arabicnumber": "2040.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৫, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৫-(…/...) আবদ ইবনু হুমায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) এর সানাদে আবূ তালহাহ (রাযিঃ) এর খাবারের এ বর্ণনাটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করেছেন। এর মধ্যে রাবী বলেছেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আগমনের পূর্ব মুহূর্ত পর্যন্ত আবূ তালহাহ্ (রাযিঃ) দরজায় দাঁড়িয়ে থাকলেন। তারপর তাকে বললেন, হে আল্লাহর রসূল! এতো কিছু মাত্র (অল্প খাবার)। তিনি বললেন, তাই নিয়ে আসো। আল্লাহ অবশ্যই এতে বারাকাত দান করবেন। (ইসলামিক ফাউন্ডেশন ৫১৪৭, ইসলামিক সেন্টার ৫১৫৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5321,
			"arabicnumber": "2040.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৬, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৬-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীস বর্ণনা করেছেন। এতে বর্ণনাকারী বলেছেন, অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবার খেলেন। ঘরের অধিবাসীরাও খাবার খেলো এবং তারা তাদের প্রতিবেশীদের কাছে পৌছানোর জন্যও কিয়দংশ রাখলেন। (ইসলামিক ফাউন্ডেশন ৫১৪৮, ইসলামিক সেন্টার ৫১৬০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5322,
			"arabicnumber": "2040.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৭, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৭-(.../...) হাসান ইবনু আলী হুলওয়ানী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ তালহাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মসজিদে শয়ন করে ও পিঠ উপর-নিচ করতে দেখলেন। তখন তিনি উম্মু সুলায়ম (রাযিঃ) এর সন্নিকটে এসে বললেন। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মসজিদে শয়ন করে পেট ও পিঠ উপর-নিচ করতে লক্ষ্য করেছি। আমার ধারণা হলো, তিনি ক্ষুধার্ত। তারপর রাবী শেষ পর্যন্ত হাদীসটি বর্ণনা করেন। এতে তিনি বলেছেন, অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবূ তালহাহ (রাযিঃ), উম্মু সুলায়ম (রাযিঃ) ও আনাস (রাযিঃ) খাবার খেলেন। সামান্য অবশিষ্ট রয়ে গেলে আমরা সেটা প্রতিবেশীদের কাছে উপটৌকন প্রেরণ করলাম। (ইসলামিক ফাউন্ডেশন ৫১৪৯, ইসলামিক সেন্টার ৫১৬১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5323,
			"arabicnumber": "2040.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৮, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৮-(.../…) হারমালাহ্ ইবনু ইয়াহইয়া তুজীবী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি একদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে তাকে দেখলাম, তিনি সাহাবীদের সাথে বসে আলোচনায় রত আছেন এবং তিনি তার পেট একটি কাপড়ের টুকরো দিয়ে বেঁধে রেখেছেন। বর্ণনাকার উসামাহ্ বলেন, পাথরসহ ছিল কি-না, এতে আমার মনে সন্দেহের উদ্রেক হয়েছে। আমি তার কোন এক সাহাবীকে প্রশ্ন করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পেট কেন বেঁধে রেখেছেন? তারা বললেন, ক্ষুধার তাড়নায়। তারপর আমি আবূ তাহাহ্ (রাযিঃ) এর কাছে গেলাম। তিনি উম্মু সুলায়ম বিনতু মিলহান (রাযিঃ) এর স্বামী ছিলেন। আমি বললাম, আব্বা! আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রত্যক্ষ করলাম, তিনি বস্ত্র দ্বারা তার পেট বেঁধে রেখেছেন। আমি তার এক সাহাবীর কাছে জানতে চাইলে তিনি বললেন, ক্ষুধার যন্ত্রণায়। অতঃপর আবূ তালহাহ (রাযিঃ) আমার মায়ের নিকট গিয়ে বললেন, কিছু আছে কি? তিনি বললেন, হ্যাঁ; আমার কাছে কয়েক টুকরা রুটি আর কিছু খেজুর আছে। যদি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের ঘরে একাকী আসেন, তাহলে আমরা তাকে তৃপ্তি সহকারে আহার করাতে পারি। আর যদি ভিন্ন কেউ তার সাথে আসে তাহলে তাদের সামান্য হবে। অতঃপর বর্ণনাকারী ঘটনাসহ পূর্ণ হাদীসটি বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৫১৫০, ইসলামিক সেন্টার ৫১৬২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5324,
			"arabicnumber": "2040.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২১৯, আন্তর্জাতিক নাম্বারঃ ২০৪০ ৫২১৯-(…/...) হাজ্জাজ ইবনু শাইর (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আবূ তালহার আহারের ব্যাপারে তাদের (উপরোল্লিখিত রাবীদের) হাদীসের হুবহু বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৫১৫১, ইসলামিক সেন্টার ৫১৬৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5325,
			"arabicnumber": "2041.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২০, আন্তর্জাতিক নাম্বারঃ ২০৪১ ৫২২০-(১৪৪/২০৪১) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক দর্জি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য কিছু খাদ্য প্রস্তুত করে তাকে দাওয়াত করলো। আনাস ইবনু মালিক (রাযিঃ) বলেন, সে দাওয়াতে আমিও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে গেলাম। রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে যবের রুটি, ঝোল বিশিষ্ট লাউ ও শুকনা গোশত পেশ করা হলো। আনাস (রাযিঃ) বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে লক্ষ্য করলাম, তিনি থালার চারপাশে থেকে লাউ সন্ধান করছেন। সেদিন থেকে আমিও লাউ পছন্দ করতে লাগলাম। (ইসলামিক ফাউন্ডেশন ৫১৫২, ইসলামিক সেন্টার ৫১৬৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5326,
			"arabicnumber": "2041.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২১, আন্তর্জাতিক নাম্বারঃ ২০৪১ ৫২২১-(১৪৫/...) মুহাম্মাদ ইবনু 'আলা, আবূ কুরায়ব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দাওয়াত করলো। আমিও তার সাথে গেলাম। তরকারি আনা হলো যাতে লাউ ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে লাউগুলো খেতে লাগলেন। লাউ তার নিকট ভাল লাগছিল। তিনি বলেন, এ অবস্থা দেখে স্বয়ং আমি না খেয়ে এগুলো তার নিকট বাড়িয়ে দিতে লাগলাম। আনাস (রাযিঃ) বলেন, তারপর থেকে সব সময় লাউ আমার প্রিয় খাবার হয়ে যায়। (ইসলামিক ফাউন্ডেশন ৫১৫৩, ইসলামিক সেন্টার ৫১৬৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5327,
			"arabicnumber": "2041.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২২, আন্তর্জাতিক নাম্বারঃ ২০৪১ ৫২২২-(.../...) হাজ্জাজ ইবনু শাইর (রাযিঃ) ও 'আব্‌দ ইবনু হুমায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, এক দর্জি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দাওয়াত করলো। রাবী অতিরিক্ত বর্ণনা করেছেন যে, সাবিত (রহঃ) বলেছেন, আমি আনাস (রাযিঃ) কে বলতে শুনেছি যে, অতঃপর আমার জন্য যদি আহার তৈরি করা হতো এবং এতে আমি লাউ দিতে সমর্থ হলে তাই করা হতো। (ইসলামিক ফাউন্ডেশন ৫১৫৪, ইসলামিক সেন্টার ৫১৬৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5328,
			"arabicnumber": "2042.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৩, আন্তর্জাতিক নাম্বারঃ ২০৪২ ৫২২৩-(১৪৬/২০৪২) মুহাম্মাদ ইবনুল মুসান্না আনায়ী (রহঃ) ..... 'আবদুল্লাহ ইবনু বুসর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার আব্বার কাছে আসলেন। আমরা তার সম্মুখে কিছু খাবার ও ওয়াত্‌বাহ (খেজুর চূর্ণ, পনির ও ঘি যোগে তৈরি এক প্রকার খাদ্য) পেশ করলাম। তিনি তা হতে খেলেন। অতঃপর খেজুর নিয়ে আসলে তিনি তা খেতে লাগলেন। আর বিচিগুলো মধ্যমা ও শাহাদাত অঙ্গুলি একত্র করে দু'আঙ্গুলের মাঝখান দিয়ে ফেলতে লাগলেন। শু'বাহ বলেন, এটা আমার অনুমান। তবে ইনশা আল্লাহ এতে দু'আঙ্গুলের মাঝখান দিয়ে বীজ ফেলার কথাটি আছে। অতঃপর তার নিকট সুপেয় আনা হলে তিনি তা পান করেন। পরে তিনি তার ডান পাশের লোককে দিলেন। আবদুল্লাহ ইবনু বুসূর (রাযিঃ) বলেন, অতঃপর আমার আব্বা তার সওয়ারীর লাগাম ধরে বললেন, আপনি আমাদের জন্য আল্লাহর নিকট প্রার্থনা করুন। তখন তিনি বললেন, ইয়া আল্লাহ! তুমি তাদের রিযকে বারাকাত দাও, তাদের ক্ষমা করো এবং তাদের প্রতি দয়া করো। (ইসলামিক ফাউন্ডেশন ৫১৫৫, ইসলামিক সেন্টার ৫১৬৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5329,
			"arabicnumber": "2042.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৪, আন্তর্জাতিক নাম্বারঃ ২০৪২ ৫২২৪-(…/...) মুহাম্মাদ ইবনু বাশশার ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... শু'বাহ (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীসটি বর্ণনা করেছেন। তবে তারা দু’জনেই দু'আঙ্গুলের মধ্য দিয়ে বিচি ফেলে দেয়ার ব্যাপারে শুবাহর সন্দেহে কথা উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫১৫৬, ইসলামিক সেন্টার ৫১৬৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5330,
			"arabicnumber": "2043",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৫, আন্তর্জাতিক নাম্বারঃ ২০৪৩ ৫২২৫-(১৪৭/২০৪৩) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী ও আবদুল্লাহ ইবনু আওন হিলালী (রহঃ) ...... 'আবদুল্লাহ ইবনু জাফার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সতেজ খেজুরের সঙ্গে শশা খেতে লক্ষ্য করেছি। (ইসলামিক ফাউন্ডেশন ৫১৫৭, ইসলামিক সেন্টার ৫১৬৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5331,
			"arabicnumber": "2044.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৬, আন্তর্জাতিক নাম্বারঃ ২০৪৪ ৫২২৬-(১৪৮/২০৪৪) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ সাঈদ আশাজ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জানুদ্বয় উচ্চে তুলে উপরি বৈঠকে খেজুর খেতে লক্ষ্য করেছি। (ইসলামিক ফাউন্ডেশন ৫১৫৮, ইসলামিক সেন্টার ৫১৭০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5332,
			"arabicnumber": "2044.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৭, আন্তর্জাতিক নাম্বারঃ ২০৪৪ ৫২২৭-(১৪৯/...) যুহায়র ইবনু হারব ও ইবনু আবূ উমর (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুকনা খেজুর আনা হলে তিনি তা ভাগ করতে লাগলেন এবং স্বয়ং জানুদ্বয় তুলে উপর বৈঠক অবস্থায় জলদি এগুলো থেকে আহার করছিলেন। যুহায়র (রহঃ) এর বর্ণনায় أَكْلاً ذَرِيعًا শব্দের স্থানে أَكْلاً حَثِيثًا শব্দ বর্ণিত হয়েছে। (দুটি শব্দের একই অর্থ দ্রুত)। (ইসলামিক ফাউন্ডেশন ৫১৫৯, ইসলামিক সেন্টার ৫১৭১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5333,
			"arabicnumber": "2045.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৮, আন্তর্জাতিক নাম্বারঃ ২০৪৫ ৫২২৮-(১৫০/২০৪৫) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবালাহ ইবনু সুহায়ম (রহঃ) হতে বর্ণিত। তিনি বলেন, ইবনু যুবায়র (রাযিঃ) আমাদেরকে খাদ্য হিসেবে খেজুর দিতেন। তৎকালীন সময় লোকেরা অনাহারে পতিত হয়েছিল। আমরা তাই খেয়ে থাকতাম। একবার আমরা খাবার খাচ্ছিলাম। তখন ইবনু উমর (রাযিঃ) আমাদের নিকট দিয়ে যাচ্ছিলেন। তিনি বললেন, তোমরা একাধিক খেজুর এক সঙ্গে খেও না। কেননা, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সাথে একাধিক খেজুর খেতে বারণ করেছেন। তবে যদি কেউ তার (সাখী) ভাইয়ের অনুমতি নিয়ে নেয় (তাহলে খেতে পারে)। শু'বাহ্ (রহঃ) বলেন, আমার ধারণা হয়, অনুমতি নেয়ার কথাটা ইবনু উমর (রাযিঃ) এরই কথা। (ইসলামিক ফাউন্ডেশন ৫১৬০, ইসলামিক সেন্টার ৫১৭২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5334,
			"arabicnumber": "2045.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২২৯, আন্তর্জাতিক নাম্বারঃ ২০৪৫ ৫২২৯-(…/...) উবাইদুল্লাহ ইবনু মুআয মুহাম্মাদ ইবনু বাশশার শুবাহ্ (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীসটি বর্ণনা করেছেন। তবে তাদের হাদীসে (অনুমতি সম্পর্কে) শুবাহ (রহঃ) এর কথা এবং জাবালাহ্ (রহঃ) এর এ কথা নেই যে, তখন মানুষ অনাহারে পতিত হয়েছিল। (ইসলামিক ফাউন্ডেশন ৫১৬১, ইসলামিক সেন্টার ৫১৭৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5335,
			"arabicnumber": "2045.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩০, আন্তর্জাতিক নাম্বারঃ ২০৪৫ ৫২৩০-(১৫১/...) যুহায়র ইবনু হারব (রহঃ) ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবালাহ্ ইবনু সুহায়ম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু উমর (রাযিঃ) কে বলতে শুনেছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাথীদের অনুমতি ব্যতীত কোন লোকের এক সাথে দুটি করে খেজুর ভক্ষণ করা হতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৬২, ইসলামিক সেন্টার ৫১৭৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5336,
			"arabicnumber": "2046.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩১, আন্তর্জাতিক নাম্বারঃ ২০৪৬ ৫২৩১-(১৫২/২০৪৬) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে পরিবারের লোকদের নিকট খেজুর আছে, তারা অনাহার থাকে না। (ইসলামিক ফাউন্ডেশন ৫১৬৩, ইসলামিক সেন্টার ৫১৭৫) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটি প্রতিটি মানুষকে তার বাড়িতে নিজের জন্য এবং নিজের পোষ্যবর্গের জীবনযাত্রার জন্য খেজুর জমা করে রাখার প্রতি উৎসাহ প্রদান করে। ২। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, যে বাড়ির লোকজন খেজুর খেতে থাকবে, সে বাড়ির লোকজন ক্ষুধার্ত হবে না। ৩। ইসলাম ধর্মের পণ্ডিতগণের মধ্যে থেকে কতকগুলি পণ্ডিত (মহান আল্লাহ তাঁদের প্রতি দয়া করুন) বলেছেন: যখন কোনো সমাজের লোকজনের অবস্থা পরিবর্তিত হবে, আর সেই সমাজের প্রয়োজনীয় বিষয় এবং খাদ্যদ্রব্য খেজুর ব্যতীত অন্য কোনো জিনিস থাকবে, তখন সেই সমাজের জন্য এই হাদীসটি প্রযোজ্য নয়। যেহেতু আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] এই উপদেশটি মদীনাবাসীকে প্রদান করছিলেন এবং বলেছিলেন যে, “তাদের কাছে খেজুর না থাকলে তারা ক্ষুধার্ত অবস্থায় থাকবে”। কেননা তারা তো সেই সময়ে খেজুর খাওয়ার অভ্যাসে অভ্যাসিত ছিলো। এবং খেজুরই তাদের সমাজে প্রধান খাদ্যদ্রব্য হিসেবে গণ্য করা হতো। এই পদ্ধতিতে তাঁরা এই হাদীসটির ব্যাখ্যা প্রদান করেছেন। কিন্তু এই ব্যাখ্যাটির দ্বারা মনের মধ্যে তৃপ্তি আসছে না। কেননা এই ব্যাখ্যার দ্বারা খেজুরের সমস্ত বৈশিষ্ট্য নষ্ট হয়ে যায়। আর খেজুরকে পৃথিবীর যে কোনো সাধারণ খাদ্যদ্রব্য হিসেবে গণ্য করা হয়। এই বিষয়ে মহান আল্লাহই অধিক জানেন।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5337,
			"arabicnumber": "2046.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩২, আন্তর্জাতিক নাম্বারঃ ২০৪৬ ৫২৩২-(১৫৩/...) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আয়িশাহ! যে গৃহে খেজুর নেই সে গৃহের মানুষজন ক্ষুধার্ত। হে আয়িশাহ! যে গৃহে খেজুর নেই সে গৃহে মানুষজন ক্ষুধার্ত। এ কথাটি তিনি দু’বার বা তিনবার বলেছিলেন। (ইসলামিক ফাউন্ডেশন ৫১৬৪, ইসলামিক সেন্টার ৫১৭৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5338,
			"arabicnumber": "2047.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৩, আন্তর্জাতিক নাম্বারঃ ২০৪৭ ৫২৩৩-(১৫৪/২০৪৭) 'আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক মদীনার উভয় সীমান্তের মধ্যে উৎপাদিত খেজুরের সাতটি করে প্রতি সকালে আহার করে সন্ধ্যা অবধি কোন বিষ তার অনিষ্ট করতে পারে না। (ইসলামিক ফাউন্ডেশন ৫১৬৫, ইসলামিক সেন্টার ৫১৭৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 5339,
			"arabicnumber": "2047.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৪, আন্তর্জাতিক নাম্বারঃ ২০৪৭ ৫২৩৪-(১৫৫/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, যে ব্যক্তি প্রতিদিন সকালে সাতটি করে আজওয়া (মদীনায় উৎপন্ন এক জাতীয় উৎকৃষ্ট মানের খেজুর) আহার করে, সেদিন তাকে কোন বিষ বা যাদু অনিষ্ট করতে পারে না। (ইসলামিক ফাউন্ডেশন ৫১৬৬, ইসলামিক সেন্টার ৫১৭৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 5340,
			"arabicnumber": "2047.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৫, আন্তর্জাতিক নাম্বারঃ ২০৪৭ ৫২৩৫-(.../...) ইবনু আবূ উমার মারওয়ান আল-ফাযারী (রহঃ) হতে, ভিন্ন সূত্রে ইসহাক ইবনু ইব্রাহীম (রহঃ) আবূ বাদ্‌র শুজা ইবনু ওয়ালীদ (রহঃ) হতে, তারা দু’জনেই হাশিম ইবনু হাশিম (রহঃ) হতে উপরোল্লিখিত সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অবিকল বর্ণনা করেছেন। তবে তারা উভয়ে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি উক্তিটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫১৬৭, ইসলামিক সেন্টার ৫১৭৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 5341,
			"arabicnumber": "2048",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৬, আন্তর্জাতিক নাম্বারঃ ২০৪৮ ৫২৩৬-(১৫৬/২০৪৮) ইয়াহইয়া ইবনু ইয়াহইয়া, ইয়াহইয়া ইবনু আইয়্যুব ও ইবনু হুজুর (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদীনার উচু ভূমির আজওয়াহ খেজুরে শিফা (রোগমুক্তি) রয়েছে। কিংবা তিনি বলেছেন, এগুলো প্রতি সকালে খাবারে বিষমুক্ত ঔষধের কাজ করে। (ইসলামিক ফাউন্ডেশন ৫১৬৮, ইসলামিক সেন্টার ৫১৮০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 5342,
			"arabicnumber": "2049.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৭, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৩৭-(১৫৭/২০৪৯) কুতাইবাহ ইবনু সাঈদ (রহঃ) জারীর (রহঃ) হতে, ভিন্ন সূত্রে ইসহাক ইবনু ইবরাহীম (রহঃ) ..... সাঈদ ইবনু যায়দ ইবনু আমর ইবনু নুফায়ল (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, কামআহ মান্না জাতীয়। আর এর নিগৃহীত রস চোখের জন্য উপশম (ইসলামিক ফাউন্ডেশন ৫১৬৯, ইসলামিক সেন্টার ৫১৮১) [কামআহ ছত্রাক জাতীয় উদ্ভিদ। সাধারণতঃ স্যাঁত স্যাঁতে জায়গায় এর উৎপত্তি। ইংরেজি নাম মাসরুম, বাংলা নাম ব্যাঙের ছাতা। এর আবাদ হয়]",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 5343,
			"arabicnumber": "2049.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৮, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৩৮-(১৫৮/...) মুহাম্মদ ইবনুল মুসান্না (রহঃ) ...... সাঈদ ইবনু যায়দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, কামআহ্ মান্না জাতীয় এবং এর রস চোখের জন্য উপশম। (ইসলামিক ফাউন্ডেশন ৫১৭০, ইসলামিক সেন্টার ৫১৮২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 5344,
			"arabicnumber": "2049.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৩৯, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৩৯-(…/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... সাঈদ ইবনু যায়দ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অবিকল বর্ণিত রয়েছে। শুবাহ্ (রহঃ) বলেন, হাকাম (রহঃ) যখন আমার নিকট হাদীসটি রিওয়ায়াত করলেন, তখন আমি আবদুল মালিক (রহঃ) এর হাদীসটিকে আর \"গারীব\" (অর্থাৎ- যে হাদীসের সানাদে শুধুমাত্র কোন একজন বর্ণনাকারী থাকে) মনে করলাম না। (ইসলামিক ফাউন্ডেশন ৫১৭১, ইসলামিক সেন্টার ৫১৮৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 5345,
			"arabicnumber": "2049.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪০, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৪০-(১৫৯/...) সাঈদ ইবনু আমর আশ‘আসী (রহঃ) …. সাঈদ ইবনু যায়দ ইবনু 'আমর ইবনু নুফায়ল (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কামআহ মান্না জাতীয় (উদ্ভিদ) যা বনী ইসরাঈলের উপর আল্লাহ নাযিল করেছিলেন এবং এটা হতে নিগৃহীত রস চোখের উপশম। (ইসলামিক ফাউন্ডেশন ৫১৭২, ইসলামিক সেন্টার ৫১৮৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 5346,
			"arabicnumber": "2049.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪১, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৪১-(১৬০/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... সাঈদ ইবনু যায়দ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেন, কামআহ মান্না জাতীয় (উদ্ভিদ) যা মহান আল্লাহ মূসা (আঃ) এর উপর নাযিল করেছিলেন এবং এর রস চোখের জন্য নিরাময়। (ইসলামিক ফাউন্ডেশন ৫১৭৩, ইসলামিক সেন্টার ৫১৮৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 5347,
			"arabicnumber": "2049.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪২, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৪২-(১৬১/...) ইবনু আবূ 'উমার (রহঃ) ..... সাঈদ ইবনু যায়দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কামআহ্ এক প্রকারের মান্না জাতীয় (উদ্ভিদ) যা মহান আল্লাহ অবতীর্ণ করেছিলেন বনী ইসরাঈলের উপর। আর এটির রস চোখের জন্য ঔষধ হিসেবে ব্যবহৃত হয়। (ইসলামিক ফাউন্ডেশন ৫১৭৪, ইসলামিক সেন্টার ৫১৮৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 5348,
			"arabicnumber": "2049.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৩, আন্তর্জাতিক নাম্বারঃ ২০৪৯ ৫২৪৩-(১৬২/...) ইয়াহইয়া ইবনু হাবীব হারিসী (রহঃ) ..... সাঈদ ইবনু যায়দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কামআহ মান্না জাতীয় এক প্রকার উদ্ভিদ। এর রস চোখের জন্য এক প্রকার ঔষধ (ইসলামিক ফাউন্ডেশন ৫১৭৫, ইসলামিক সেন্টার ৫১৮৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 5349,
			"arabicnumber": "2050",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৪, আন্তর্জাতিক নাম্বারঃ ২০৫০ ৫২৪৪-(১৬৩/২০৫০) আবূ তাহির (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ‘মারযুয যাহরান' নামক জায়গায় কাবাস (পিলু ফল) সংগ্রহ করেছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা তাথেকে শুধু কালোগুলো সংগ্রহ। বর্ণনাকারী বলেন, আমরা সে সময় বললাম, হে আল্লাহর রসূল! আপনি সম্ভবত বকরী চরিয়েছেন। তিনি বললেন, হ্যাঁ। সকল নবীই বকরী চরিয়েছেন (বর্ণনাকারী বলেন) কিংবা তিনি শুধু এ ধরনের কোন কথা বলেছেন। (ইসলামিক ফাউন্ডেশন ৫১৭৬, ইসলামিক সেন্টার ৫১৮৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 5350,
			"arabicnumber": "2051.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৫, আন্তর্জাতিক নাম্বারঃ ২০৫১ ৫২৪৫-(১৬৪/২০৫১) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সিরকা তো খুব মজাদার সালুন। (ইসলামিক ফাউন্ডেশন ৫১৭৭, ইসলামিক সেন্টার ৫১৮৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 5351,
			"arabicnumber": "2051.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৬, আন্তর্জাতিক নাম্বারঃ ২০৫১ ৫২৪৬-(১৬৫/...) মূসা ইবনু কুরায়শ ইবনু নাফি তামীমী (রহঃ) ..... সুলাইমান ইবনু বিলাল (রহঃ) হতে উল্লেখিত সূত্রে হাদীসটি বর্ণিত রয়েছে। তবে তিনি نِعْمَ الأُدُمُ বলেছেন نِعْمَ الأُدُمُ أَوِ الإِدَامُ বলে শব্দের মাঝে কোন সংশয় প্রকাশ করেননি। (ইসলামিক ফাউন্ডেশন ৫১৭৮, ইসলামিক সেন্টার ৫১৯০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 5352,
			"arabicnumber": "2052.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৭, আন্তর্জাতিক নাম্বারঃ ২০৫২ ৫২৪৭-(১৬৬/২০৫২) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার গৃহের লোকদের নিকট সালুন চাইলে তারা বললো, সিরকা ব্যতীত আমাদের নিকট ভিন্ন কিছু নেই। সে সময় তিনি তাই নিয়ে আসতে বললেন এবং খাওয়ার সময় বললেন, সিরকা কত ভাল তরকারি, সিরকা কত চমৎকার তরকারি! (ইসলামিক ফাউন্ডেশন ৫১৭৯, ইসলামিক সেন্টার ৫১৯১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 5353,
			"arabicnumber": "2052.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৮, আন্তর্জাতিক নাম্বারঃ ২০৫২ ৫২৪৮-(১৬৭/…) ইয়াকুব ইবনু ইবরাহীম দাওরাকী (রহঃ) ..... নাফি হতে বর্ণিত। তিনি জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) কে বলতে শুনেছেন যে, একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার হাত ধরে স্বীয় ঘরে গেলেন। (খাদেম) এক খণ্ড রুটি তার সম্মুখে পেশ করলে তিনি বললেনঃ কোন তরকারি কি নেই? তারা বলল, না। তবে অল্প কিছু সিরকা রয়েছে। তিনি বললেন, সিরকা তো ভাল তরকারি। জাবির (রাযিঃ) বলেন, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এ কথা শুনার পর আমি সিরকা পছন্দ করতে থাকি। তালহাহ্ (রহঃ) বলেন, আমিও জাবির (রাযিঃ) এর কাছে এ কথা শুনার পর হতে সিরকা পছন্দ করতে লাগলাম। (ইসলামিক ফাউন্ডেশন ৫১৮০, ইসলামিক সেন্টার ৫১৯২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 5354,
			"arabicnumber": "2052.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৪৯, আন্তর্জাতিক নাম্বারঃ ২০৫২ ৫২৪৯-(১৬৮/…) নাসর ইবনু আলী জাহযামী (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একদা) তার হাত ধরে স্বীয় ঘরে গেলেন। অতঃপর রাবী সিরকা কত উত্তম তরকারি- পর্যন্ত ইবনু উলাইয়্যাহ্ (রহঃ) এর হাদীসের অবিকল বর্ণনা করেছেন। তবে তিনি এর পরবর্তী অংশ উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫১৮১, ইসলামিক সেন্টার ৫১৯৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 5355,
			"arabicnumber": "2052.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫০, আন্তর্জাতিক নাম্বারঃ ২০৫২ ৫২৫০-(১৬৯/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার গৃহে বসা ছিলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার পাশ দিয়ে যাচ্ছিলেন। তিনি আমাকে ইঙ্গিত করলে আমি তার নিকট উঠে গেলাম। তিনি আমার হাত ধরলেন। অতঃপর আমরা চললাম। পরিশেষে তিনি তার কোন এক সহধর্মিণীর ঘরে এসে ঢুকলেন। অতঃপর তিনি আমাকে প্রবেশাধিকার দিলে আমি পর্দার ভিতরে ঢুকলাম। তিনি বললেনঃ কিছু খাবার আছে কি? তারা বললেন, হ্যাঁ। পরে তিন টুকরো রুটি আনা হলো এবং তা দস্তরখানে রাখা হলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি টুকরো নিয়ে তার সম্মুখে রাখলেন। অপর একটি নিয়ে আমার সম্মুখে রাখলেন। অতঃপর তৃতীয় টুকরোটি দুখণ্ড করলেন এবং এটির অর্ধেক তার সামনে অবশিষ্ট অর্ধেক আমার সামনে রাখলেন। এরপর বললেনঃ কোন সালুন আছে কি? তারা বললেনঃ সামান্য পরিমাণ সিরকা আছে। তিনি বললেন, তাই নিয়ে আসো। সেটা তো খুব ভালো তরকারি। (ইসলামিক ফাউন্ডেশন ৫১৮২, ইসলামিক সেন্টার ৫১৯৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 5356,
			"arabicnumber": "2053.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫১, আন্তর্জাতিক নাম্বারঃ ২০৫৩ ৫২৫১-(১৭০/২০৫৩) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আবূ আইয়্যুব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কোন খাদ্য নিয়ে আসলে তিনি সামান্য খেতেন আর বাকীটুকু আমার নিকট প্রেরণ করতেন। একদা তিনি এমন কিছু খাবার প্রেরণ করলেন যা হতে তিনি কিছুই আহার করেনি। কেননা তাতে রসুন ছিল। আমি তার কাছে জানতে চাইলাম, এটা কি নিষিদ্ধ? তিনি বললেন, না। তবে গন্ধের কারণে ওটা আমার কাছে অপছন্দনীয়। তিনি বললেন, তাহলে আমিও তা পছন্দ করবো না, যা আপনি পছন্দ করেননি। (ইসলামিক ফাউন্ডেশন ৫১৮৩, ইসলামিক সেন্টার ৫১৯৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 5357,
			"arabicnumber": "2053.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫২, আন্তর্জাতিক নাম্বারঃ ২০৫৩ ৫২৫২-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... শুবাহ্ (রহঃ) হতে উল্লেখিত সূত্রে হাদীসটি বর্ণনা করেন; (ইসলামিক ফাউন্ডেশন ৫১৮৪, ইসলামিক সেন্টার ৫১৯৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 5358,
			"arabicnumber": "2053.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৩, আন্তর্জাতিক নাম্বারঃ ২০৫৩ ৫২৫৩-(১৭১/...) হাজ্জাজ ইবনু শাইর ও আহমাদ ইবনু সাঈদ ইবনু সাখ্‌র (রহঃ) ..... আবূ আইয়্যুব (রাযিঃ) হতে বর্ণিত যে, (হিজরাতের সময়) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর গৃহে মেহমান হলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবস্থান করতেন নীচ তলায় এবং আবূ আইয়্যুব (রাযিঃ) অবস্থান করতেন উপর তলায়। একদা রাত্রে আবূ আইয়্যুব (রাযিঃ) জাগ্রত হয়ে বললেন, আমরা তো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাথার উপর চলাফেরা করি। তখন তিনি সে স্থান হতে দূরে গিয়ে এক কোণে রাত্রি যাপন করলেন। অতঃপর (সকালে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তিনি ব্যাপারটি জানালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, নীচ তলায়ই অনেক সুবিধা। তখন তিনি বললেন, আপনি নীচে থাকবেন এমন ছাদে আমি উঠবো না। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপর তলায় এবং আবূ আইয়্যুব (রাযিঃ) নীচ তলায় জায়গা পরিবর্তন করলেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য খাদ্য প্রস্তুত করতেন যখন (অবশিষ্ট) খাদ্য ফেরত আনা হতো, তখন তিনি জানতে চাইতেন, রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন জায়গায় তার আঙ্গুল স্পর্শ করেছেন। অতঃপর তার আঙ্গুলের স্থান অনুসরণ করে সেখান থেকে খেতেন। একবার তিনি তার জন্য খানা প্রস্তুত করলেন, যার মধ্যে রসুন ছিল। তার নিকট ফেরত নিয়ে আসলে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আঙ্গুল স্পর্শের স্থান সম্পর্কে প্রশ্ন করলেন। তাকে বলা হলো, তিনি এগুলো খাননি। তিনি হতভম্ব হয়ে গেলেন এবং তার কাছে গেলেন। অতঃপর জানতে চাইলেন, ওটা কি নিষিদ্ধ? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না। তবে আমি ওটা পছন্দ করি না। তিনি বললেন, তাহলে আপনি যা পছন্দ করেন না, আমিও তা পছন্দ করি না। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সে সময় ওয়াহী আসত। (ইসলামিক ফাউন্ডেশন ৫১৮৫, ইসলামিক সেন্টার ৫১৯৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 5359,
			"arabicnumber": "2054.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৪, আন্তর্জাতিক নাম্বারঃ ২০৫৪ ৫২৫৪-(১৭২/২০৫৪) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, আমি চরম অনাহারে ভুগছি। তিনি তার কোন এক সহধর্মিণীর নিকট লোক প্রেরণ করলে তিনি বললেন, যে স্রষ্টা আপনাকে সঠিক দীনসহ পাঠিয়েছেন তার কসম! আমার নিকট পানি ব্যতীত আর কিছু নেই। তিনি অপর এক স্ত্রীর নিকট লোক প্রেরণ করলে তিনিও অনুরূপ কথা বললেন। এভাবে তারা সবাই একই কথা বললেন যে, সে সত্তার কসম! যিনি আপনাকে সত্য দীনসহ প্রেরণ করেছেন, আমার কাছে পানি ব্যতীত আর কিছু নেই। তখন তিনি বললেন, আজ রাত্রে লোকটির কে অতিথিপরায়ণ হবে? আল্লাহ তার উপর দয়া করুন! তখন এক আনুসারী লোক উঠে বলল, হে আল্লাহর রসূল! আমি। অতঃপর লোকটিকে নিয়ে আনুসারী নিজ বাড়িতে গেলেন এবং তার সহধর্মিণীকে বললেন, তোমার নিকট কিছু আছে কি? সে বলল, না। তবে সন্তানদের জন্য অল্প কিছু খাবার আছে। তিনি বললেন, তুমি তাদের কিছু একটা দিয়ে ব্যস্ত রাখো। আর যখন অতিথি ঘরে ঢুকবে, তখন তুমি আলোটা নিভিয়ে দেবে। আর তাকে বুঝাবো যে, আমরাও খাবার খাচ্ছি। সে (মেহমান) যখন খাওয়া আরম্ভ করবে তখন তুমি আলোর পাশে যেয়ে সেটা নিভিয়ে দেবে। রাবী বলেন, অতঃপর তারা বসে থাকলেন এবং অতিথি খেতে শুরু করলো। সকালে তিনি (আনসারী) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলে, তিনি বললেনঃ আজ রাত্রে অতিথির সঙ্গে তোমাদের উভয়ের ব্যবহারে আল্লাহ খুশী হয়েছেন। (ইসলামিক ফাউন্ডেশন ৫১৮৬, ইসলামিক সেন্টার ৫১৯৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 5360,
			"arabicnumber": "2054.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৫, আন্তর্জাতিক নাম্বারঃ ২০৫৪ ৫২৫৫-(১৭৩/...) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, এক আনসারী লোকের বাড়িতে এক অতিথি রাত কাটালেন। তার কাছে তার ও সন্তানদের জন্য অল্প কিছু খাদ্য ব্যতীত আর কিছু ছিল না। তিনি তার স্ত্রীকে বললেন, বাচ্চাদের ঘুমিয়ে দাও, আলোটা বন্ধ করে দাও এবং তোমার নিকট যা কিছু আছে তাই অতিথির জন্য পেশ করো। রাবী বলেন, এরপর এ আয়াতটি নাযিল হয়ঃ \"তারা তাদের উপর অপরকে প্রাধান্য দেয়, যদিও তারা অনাহারে থাকে”— (সূরা আল হাশর ৫৯ঃ ৯)। (ইসলামিক ফাউন্ডেশন ৫১৮৭, ইসলামিক সেন্টার ৫১৯৯)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 5361,
			"arabicnumber": "2054.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৬, আন্তর্জাতিক নাম্বারঃ ২০৫৪ ৫২৫৬-(…/...) আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মেহমান হয়ে এক লোক তার নিকট এলেন। কিন্তু তার কাছে এমন কিছু ছিল না যা দিয়ে তিনি সে ব্যক্তির আপ্যায়ন করবেন। তখন তিনি বললেন, এর মেহমানদারী করার মতো কেউ কি আছে? আল্লাহ তার উপর দয়া করুক। এ সময় আবূ তালহাহ নামক এক আনসারী লোক দাঁড়ালেন এবং লোকটিকে আপন গৃহে নিয়ে গেলেন। অতঃপর রাবী শেষ পর্যন্ত হাদীসটি জারীর (রহঃ) এর হাদীসের অবিকল বর্ণনা করেছেন। আর তিনি ওয়াকী' (রহঃ) এর মতো আয়াত অবতীর্ণ হওয়ার কথাও বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৮৮, ইসলামিক সেন্টার ৫২০০)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৭, আন্তর্জাতিক নাম্বারঃ ২০৫৫ ৫২৫৭-(১৭৪/২০৫৫) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... মিকদাদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, প্রচুর খাদ্য সংকটে আমার ও আমার দু'সাথীর দৃষ্টিশক্তি ও শ্রুতিশক্তি কমে যায়। অতঃপর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের নিকটে নিজেদের উত্থাপন করতে লাগলাম। কিন্তু তাদের কেউ আমাদের কথা শুনলেন না। সবশেষে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আগমন করলে তিনি আমাদের সাথে নিয়ে তার পরিবারের নিকটে গেলেন। সেখানে তিনটি বকরী ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা দুধ দোহন করবে। এ দুধ আমরা বণ্টন করে পান করবো। তিনি বলেন, এরপর থেকে আমরা দুধ দোহন করতাম। আমাদের সবাই যার যার অংশ পান করতো। আর আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য তার অংশ উঠিয়ে রাখতাম। মিকদাদ (রাযিঃ) বলেন, তিনি রাত্রে এসে এমনভাবে সালাম দিতেন যাতে নিদ্রারত লোক উঠে না যায় এবং জাগ্রত লোক শুনতে পায়। বর্ণনাকারী বলেন, অতঃপর তিনি মসজিদে এসে সালাত (সালাত/নামাজ/নামায) আদায় করতেন। প্রত্যাবর্তন করে দুধ পান করতেন। একদা রাতে আমার নিকটে শাইতান আগমন করলো। আমি তো আমার অংশ পান করে ফেলেছিলাম। সে বলল, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারীদের নিকটে গেলে তারা তাকে উপঢৌকন দিবে এবং তাদের নিকটে তার এ অল্প দুধের প্রয়োজনীয়তাও ফুরিয়ে যাবে। অতঃপর আমি এসে সেটুকুও পান করে ফেললাম। দুধ যখন উত্তমভাবে আমার পেটে ঢুকে গেলে আমি বুঝলাম, এ দুধ বের করার আর কোন উপায় নেই তখন শইতান আমার থেকে দূরে সরে গিয়ে বলল, তোমার ধ্বংস হোক, তুমি একি করলে তুমি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দুধ পান করে ফেলেছ? তিনি জাগ্রত হয়ে যখন তা পাবেন না, তখন তোমার উপর বদ-দু'আ করবেন এতে তুমি সর্বনাশ হয়ে যাবে এবং তোমার ইহকাল ও পরকাল নিঃশেষ হয়ে যাবে। আমার শরীরে একটা চাদর ছিল। আমি যদি তা আমার পাদ্বয়ের উপর রাখি তাহলে আমার মাথা বের হয়ে পড়ে, আর যদি আমি তা আমার মাথার উপর রাখি তাহলে আমার পদদ্বয় বেরিয়ে পড়ে। কিছুতেই আমার ঘুম আসছিল না। আমার সাথীদ্বয় তো নিদ্রাচ্ছন্ন ছিল। তারা তো আমার মতো কাজ করেনি। তিনি বলেন, অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আগমন করে যেভাবে সালাম করতেন সেভাবেই সালাম করলেন। অতঃপর তিনি মসজিদে এসে সালাত (সালাত/নামাজ/নামায) আদায় করলেন। অতঃপর দুধের নিকটে এসে ঢাকনা খুলে সেখানে কিছুই পেলেন না। এরপর তিনি নিজ মাথা আকাশের দিকে তুললেন। আমি তখন (মনে মনে) বললাম, এখনই হয়তো আমার উপর তিনি বদদুআ করবেন, আর আমি নিঃশেষ হয়ে যাবো। তিনি বললেন, হে আল্লাহ! যে লোক আমার খাবারের ব্যবস্থা করে তুমি তার খাদ্যের ব্যবস্থা কর। আর যে আমাকে পান করায় তাকে তুমি পান করাও। মিকদাদ (রাযিঃ) বলেন, তখন আমি চাদরটি নিয়ে গায়ে বাঁধলাম এবং একটি ছুরি নিলাম, অতঃপর (এ ভেবে) বকরীগুলোর কাছে গেলাম যে, এদের মধ্যে যেটি সবচেয়ে বেশি মোটাতাজা আমি সেটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য যাবাহ করবো। সেখানে গিয়ে দেখলাম, সেটি দুধে পরিপূর্ণ এবং অন্যান্য সব বকরীও দুধে স্বয়ংসম্পূর্ণ। অতঃপর আমি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরিবারের একটি বাসন নিয়ে এলাম যার মধ্যে তারা দুধ দোহাতেন না। তিনি [মিকদাদ (রাযিঃ)] বলেন, আমি তার মধ্যেই দুধ দোহন করলাম, এমনকি বাসনের উপরের অংশ ফেনা ভেসে উঠলো। অতঃপর আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আগমন করলাম। তিনি বললেন, তোমরা কি রাত্রের দুধ পান করেছো? তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! আপনি পান করুন। তিনি পান করে আমাকে দিলেন। আমি বললাম, হে আল্লাহর রসূল! আপনি পান করুন। তিনি পান করে আমাকে দিলেন। আমি যখন বুঝতে পারলাম যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পরিতৃপ্ত হয়ে গেছেন এবং আমি তার নেক দু’আ পেয়ে গেছি, তখন আমি খুশীতে হাসতে হাসতে মাটিতে নুয়ে পড়লে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে মিকদাদ এটা তোমার এক মন্দকাজ? তখন আমি বললাম, হে আল্লাহর রসূল! আমার এ ঘটনা ঘটে গেছে। কিংবা তিনি বলেছেন, আমার দ্বারা এরূপ কাজ হয়ে গেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা একমাত্র আল্লাহর মেহেরবানী! তুমি কেন আমাকে জানালে না? আমরা আমাদের সঙ্গীদ্বয়কে জাগাতাম, তাহলে তারাও এর অংশ পেত। তিনি বলেন, আমি তখন বললাম, যে মহান স্রষ্টা আপনাকে সত্য দীনসহ প্রেরণ করেছেন তার কসম! আপনি যখন পেয়েছেন এবং আমি যখন আপনার সঙ্গে ভাগ পেয়েছি, তখন ভিন্ন কোন ব্যক্তি পাওয়া না পাওয়ার আমি তোয়াক্কা করি না। (ইসলামিক ফাউন্ডেশন ৫১৮৯, ইসলামিক সেন্টার ৫২০১)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 5363,
			"arabicnumber": "2055.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৮, আন্তর্জাতিক নাম্বারঃ ২০৫৫ ৫২৫৮-(.../...) ইসহাক ইবনু ইব্রাহীম (রহঃ) ..... সুলাইমান ইবনু মুগীরাহ (রহঃ) হতে উল্লেখিত সূত্রে হাদীসটি বর্ণিত রয়েছে। (ইসলামিক ফাউন্ডেশন ৫১৯০, ইসলামিক সেন্টার ৫২০২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 5364,
			"arabicnumber": "2056",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৫৯, আন্তর্জাতিক নাম্বারঃ ২০৫৬ ৫২৫৯-(১৭৫/২০৫৬) উবাইদুল্লাহ ইবনু মুআয আম্বারী, হামিদ ইবনু উমার বাকরাবী ও মুহাম্মাদ ইবনু 'আবদুল আ'লা (রহঃ) ..... আব্দুর রহমান ইবনু আবূ বাকর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা একশ' তিরিশ জন ব্যক্তি (এক সফরে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের মাঝে কারো নিকট খাবার আছে কি? দেখা গেল, এক লোকের নিকটে এক সা’ বা সমপরিমাণ খাদ্য রয়েছে। তা (মিশিয়ে) খামীর করা হলো। অতঃপর এলোমেলো চুলে দীর্ঘাঙ্গ এক মুশরিক লোক কিছু ছাগল হাকিয়ে নিয়ে আসলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এগুলো বিক্রি করে দিবে না উপটৌকন হিসেবে দিবে? কিংবা উপঢৌকন শব্দের স্থলে তিনি দান করবে বলেছিলেন। লোকটি স্বলল, না; আমি বরং বিক্রি করবো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট থেকে একটি বকরী ক্রয় করলেন। বকরীটা যাবাহ করা হলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কলিজা ভূনা করতে নির্দেশ দিলেন। বর্ণনাকারী আব্দুর রহমান (রাযিঃ) বলেন, আল্লাহর শপথ! একশ' ত্রিশজনের মাঝে একজনও এমন ছিল না যাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক টুকরা কলিজা দেননি। যারা সমবেত ছিল তাদেরকে তো তখনই দিয়েছেন। আর যারা উপস্থিত ছিল না তাদের জন্য পৃথকভাবে তুলে রেখেছেন। বর্ণনাকারী বলেন, গোশত দুটি বাসনে বন্টন করে রাখলেন। আমরা সবাই তৃপ্তি সহকারে খেলাম। তারপরও বাসন দুটিতে গোশত অতিরিক্ত থাকলো। আমি তা উটের উপর বহন করে নিয়ে গেলাম। কিংবা তিনি (রাবী) যেভাবে রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৯১, ইসলামিক সেন্টার ৫২০৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 5365,
			"arabicnumber": "2057.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬০, আন্তর্জাতিক নাম্বারঃ ২০৫৭ ৫২৬০-(১৭৬/২০৫৭) উবাইদুল্লাহ ইবনু মুআয আম্বারী, হামিদ ইবনু উমার বাকরাবী ও মুহাম্মাদ ইবনু ‘আবদুল আ'লা কাইসী (রহঃ) ..... আবদুর রহমান ইবনু আবূ বাকর (রাযিঃ) হতে বর্ণিত যে, আসহাবে সুফফার মানুষজন দরিদ্র ছিলেন। তাই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেনঃ যার কাছে দু'জনের খাদ্য আছে সে যেন তৃতীয় এক জনকে নিয়ে যায়। আর যার নিকটে চার জনের খাদ্য রয়েছে, সে যেন পঞ্চম অথবা ষষ্ঠ ব্যক্তিকে নিয়ে যায়। কিংবা রাবী যেভাবে বর্ণনা করেছেন। রাবী বলেন, আবূ বাকর (রাযিঃ) তিনজনকে সাথে নিয়ে আগমন করলেন। আর আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশজনকে নিয়ে রওনা হলেন। আমার পরিবারে আমরা ছিলাম তিনজন আমি, আমার আব্বা ও আমার আম্মা। রাবী বলেন, আমি জানি না, তিনি বলেছেন কি-না যে, আমার সহধর্মিণী আমাদের ও আবূ বাকরের গৃহে শারীক খাদিম। বর্ণনাকারী বলেন, আবূ বকর (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বাড়িতে রাতের খাবার খেলেন। অতঃপর তিনি প্রতীক্ষা করলেন। পরিশেষে ইশার সালাত (সালাত/নামাজ/নামায) আদায় করা হলো। সালাত (সালাত/নামাজ/নামায) শেষে ফিরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিদ্রাচ্ছন্ন হওয়া পর্যন্ত তিনি প্রতীক্ষা করলেন। অতঃপর আল্লাহর ইচ্ছায় রাত্রির কিছু অংশ পার হলে তিনি (বাড়িতে) প্রত্যাবর্তন করলেন। তার স্ত্রী তাকে বললেন, অতিথি রেখে দেরী করলেন কেন? তিনি বললেন, কেন? তুমি কি তাদের রাত্রের খাবার খাওয়াওনি? তার সহধর্মিণী বললেন, আপনি না ফেরা পর্যন্ত তারা খাবার খেতে নারাজ। কয়েক বারই খাবার দেয়া হয়েছে কিন্তু মেহমানরা তাদের কথা হতে ফিরে আসেনি। 'আবদুর রহমান (রাযিঃ) বলেন, আমি যেয়ে পালিয়ে রইলাম। তিনি বললেন, হে নির্বোধ! অতঃপর তিনি আমাকে বকাঝকা করলেন। আর (মেহমানদের) বললেন, ভাল হলো না। আপনারা খাবার গ্রহণ করুন। তিনি আরও বললেন, আল্লাহর শপথ আমি এ খাবার গ্রহণ করবো না। আবদুর রহমান (রাযিঃ) বলেন, আল্লাহর কসম! আমরা যে লোকমাই মুখে দিচ্ছিলাম তার নীচে এর থেকে বহু পরিমাণে বৃদ্ধি পেত। এমনকি আমরা পেটপুরে খেয়েও আমাদের খাওয়ার আগে যা ছিল তার তুলনায় প্রচুর পরিমাণে বৃদ্ধি পেলে আবূ বাকর (রাযিঃ) খাবারের প্রতি খেয়াল করে দেখলেন, তা যেমন ছিল তেমনি আছে বা তার চেয়েও বেশী হয়েছে। তিনি তার স্ত্রীকে বললেন, হে উখত (বোন) বানী ফিরাস! একি অবস্থা, তিনি বললেন, কিছু না। আমার চোখের প্রশান্তি এগুলো যা আগে ছিল তার থেকে তিন গুণ বর্ধিত হয়েছে। আবদুর রহমান বলেন, অতঃপর আবূ বাকর (রাযিঃ) কিছু খেয়ে বললেন, ওটা অর্থাৎ- শপথটা ছিল শাইতানের নিকট থেকে, তারপর আরও এক লোকমা খেলেন। অতঃপর সেগুলো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে নিয়ে চললেন। আমিও তার নিকটে সকাল পর্যন্ত ছিলাম। তিনি বলেন, আমাদের এবং কোন এক গোত্রের মধ্যে একটি অঙ্গীকারনামা ছিল। যার মেয়াদ শেষ হয়ে গেলে আমরা (বারটি দল করে) বার জন ব্যক্তি নিযুক্ত করলাম। প্রত্যেক ব্যক্তির সঙ্গে অনেক ব্যক্তি ছিল। আল্লাহই ভাল জানেন, প্রত্যেক লোকের সাথে কতজন ব্যক্তি ছিল। তাদের প্রত্যেকের কাছে এ খাদ্য প্রেরণ করা হলো এবং তারা সকলেই সে খাবার খেলেন। কিংবা রাবী যেভাবে বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫১৯২, ইসলামিক সেন্টার ৫২০৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬১, আন্তর্জাতিক নাম্বারঃ ২০৫৭ ৫২৬১-(১৭৭/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবদুর রহমান ইবনু আবূ বাকর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একবার কিছু অতিথি আমাদের গৃহে আসলেন। (বর্ণনাকারী বলেন) আমার আব্বা রাতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কথোপকথন করতেন। তাই তিনি যাওয়ার সময় বললেন, হে আবদুর রহমান! মেহমানদারীর সব কাজ সুন্দরভাবে শেষ করবে। আবদুর রহমান বলেন, রাত হলে আমি অতিথিদের আহার নিয়ে আসলাম। কিন্তু তারা খেতে সম্মত হলেন না। তারা বললেন, যতক্ষণ গৃহের মালিক এসে আমাদের সঙ্গে না খাবেন ততক্ষণ পর্যন্ত আমরা খাবো না। আমি তাদের বললাম, তিনি অত্যন্ত ক্ষিপ্ত লোক। আপনারা যদি খাওয়া দাওয়া না করেন তাহলে আমার শঙ্কা হচ্ছে তার পক্ষ হতে আমাকে হয়তো বকাঝকা শুনতে হবে। তিনি বলেন, তারা কেউ সম্মত হলোই না। আমার আব্বা এসে শুরুতেই তাদের সংবাদ নিলেন। তিনি বললেন, তোমরা কি অতিথিপরায়ণের কাজ শেষ করেছো? তারা বললো, না। আল্লাহর শপথ আমরা সমাপ্ত করিনি। তিনি বললেন, আমি কি আবদুর রহমানকে আদেশ দিয়ে যাইনি? আবদুর রহমান বলেন, আমি তার চোখের পলক হতে আড়ালে গিয়েছিলাম। তিনি বললেন, হে আব্দুর রহমান! আমি আরও সরে গেলাম। তিনি আবার বললেন, ওরে নির্বোধ! আমি শপথ করে তোমাকে বলছি যদি তুমি আমার শব্দ শুনে থাকো তাহলে উপস্থিত হও। তিনি বলেন, তখন আমি উপস্থিত হয়ে বললাম, আল্লাহর শপথ আমার কোন দোষ নেই। আপনার অতিথিদের প্রশ্ন করে দেখুন। আমি তাদের আহার নিয়ে এসেছিলাম, কিন্তু আপনি না ফেরা পর্যন্ত তারা খেতে রাযী হলেন না। তখন তিনি (অতিথিদের) বললেন, আপনাদের কি হয়েছে? আপনারা কেন আমাদের পরিবেশন কবুল করেননি। 'আবদুর রহমান বলেন, তখন আবূ বাকর (রাযিঃ) বললেন, আল্লাহর শপথ আজ রাতে খাবো না। অতিথিরাও শপথ করে বলল, যতক্ষণ আপনি না খাবেন ততক্ষণ আমরাও খাব না। তখন আবূ বকর (রাযিঃ) বললেন, আজকের রাত্রের মতো এতো মন্দ রাত আমি আর দেখিনি। আফসোস, তোমরা কেন আমাদের আপ্যায়ন কবুল করবে না? তিনি বললেন, প্রথমে যা হয়েছে তা শাইতানের তরফ হতে হয়েছে। তোমরা খাবার নিয়ে আসো। রাবী বলেন, অতঃপর খাবার নিয়ে আসলে তিনি বিসমিল্লাহ্ পড়ে খাওয়া শুরু করলেন। তারাও খাওয়া শুরু করলো। 'আব্দুর রহমান (রাযিঃ) বলেন, পরদিন সকালে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে যেয়ে বললেনঃ হে আল্লাহর রসূল! তারা তো শপথ পূর্ণ করেছে। কিন্তু আমি শপথ ভেঙ্গে ফেলেছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বরং তুমি সবচেয়ে বেশী সৎকর্মশীল এবং উত্তম ব্যক্তি। ‘আব্দুর রহমান বলেন, কাফফারার কথা আমার নিকটে পৌঁছেনি। (ইসলামিক ফাউন্ডেশন ৫১৯৩, ইসলামিক সেন্টার ৫২০৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 5367,
			"arabicnumber": "2058",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬২, আন্তর্জাতিক নাম্বারঃ ২০৫৮ ৫২৬২-(১৭৮/২০৫৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু'জনের খাদ্য তিনজনের জন্য এবং তিনজনের খাদ্য চারজনের জন্য যথেষ্ট। (ইসলামিক ফাউন্ডেশন ৫১৯৪, ইসলামিক সেন্টার ৫২০৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 5368,
			"arabicnumber": "2059.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬৩, আন্তর্জাতিক নাম্বারঃ ২০৫৯ ৫২৬৩-(১৭৯/২০৫৯) ইসহাক ইবনু ইবরাহীম ও ইয়াহইয়া ইবনু হাবীব (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, একজনের খাদ্য দু'জনের জন্য পর্যাপ্ত এবং দু'জনের খাদ্য চারজনের জন্য যথেষ্ট, এমনিভাবে চারজনের খাবার আটজনের জন্য যথেষ্ট। ইসহাক (রহঃ) এর বর্ণনায় রয়েছে, \"রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনি “আমি শুনেছি” কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫১৯৫, ইসলামিক সেন্টার ৫২০৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 5369,
			"arabicnumber": "2059.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬৪, আন্তর্জাতিক নাম্বারঃ ২০৫৯ ৫২৬৪-(.../...) ইবনু নুমায়র (রহঃ) ..... সুফইয়ান (রহঃ) হতে ভিন্ন সূত্রে মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ...... জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ইবনু জুরায়জ (রহঃ) হাদীসের হুবহু বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ৫১৯৬, ইসলামিক সেন্টার ৫২০৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 5370,
			"arabicnumber": "2059.03",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 5371,
			"arabicnumber": "2059.04",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 5372,
			"arabicnumber": "2060.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬৭, আন্তর্জাতিক নাম্বারঃ ২০৬০ ৫২৬৭-(১৮২/২০৬০) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনুল মুসান্না ও উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ..... ইবনু উমার (রাযিঃ) সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেন, কাফির লোক সাত আঁতে খায় আর মুমিন খায় এক আতে।* (ইসলামিক ফাউন্ডেশন ৫১৯৯, ইসলামিক সেন্টার ৫২১১) * অর্থাৎ মুমিন আল্লহর নাম নিয়ে খায়, এতে তার খাবারে বারাকাত হয় এবং অল্প খাবারই তার জন্য যথেষ্ট হয়ে যায় কিন্তু কাফিরের অবস্থার বিপরীত তার খাবারে বারাকাত হয় না সে অনেক খায় তাও তার তৃপ্তি হয় না।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 5373,
			"arabicnumber": "2060.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬৮, আন্তর্জাতিক নাম্বারঃ ২০৬০ ৫২৬৮-(…/...) মুহাম্মদ ইবনু আবদুল্লাহ ইবনু নুমায়র, আবূ বাকুর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু রাফি’ ও ‘আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু উমর (রাযিঃ) সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫২০০, ইসলামিক সেন্টার ৫২১২)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": "2060.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৬৯, আন্তর্জাতিক নাম্বারঃ ২০৬০ ৫২৬৯-(১৮৩/...) আবূ বাকর ইবনু খাল্লাদ বাহিলী (রহঃ) ..... নাফি’ (রহঃ) হতে বর্ণিত। তিনি বলেন, ইবনু উমার (রাযিঃ) এক মিসকীনকে প্রত্যক্ষ করলেন, সে শুধু সম্মুখে হাত মারছে এবং এভাবে সে প্রচুর খাবার শেষ করে ফেলেছে। তিনি (নাফি') বলেন, তখন ইবনু উমর (রাযিঃ) বললেন, তুমি এ জাতীয় লোককে আর কখনো আমার নিকটে নিয়ে আনবে না। কেননা আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, কাফির লোক সাত আঁতে ভক্ষণ করে। (ইসলামিক ফাউন্ডেশন ৫২০১, ইসলামিক সেন্টার ৫২১৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": "2061.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭০, আন্তর্জাতিক নাম্বারঃ ২০৬১ ৫২৭০-(১৮৪/২০৬১) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির ও ইবনু উমর (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঈমানদার লোক এক আঁতে ভক্ষণ করে আর কাফির লোক সাত আঁতে ভক্ষণ করে। (ইসলামিক ফাউন্ডেশন ৫২০২, ইসলামিক সেন্টার ৫২১৪)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": "2061.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭১, আন্তর্জাতিক নাম্বারঃ ২০৬১ ৫২৭১-(.../...) ইবনু নুমায়র (রহঃ) ..... জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত আছে। এখানে রাবী ইবনু উমার (রাযিঃ) এর কথা বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫২০৩, ইসলামিক সেন্টার ৫২১৫)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": "2062.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭২, আন্তর্জাতিক নাম্বারঃ ২০৬২ ৫২৭২-(১৮৫/২০৬২) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা (রহঃ) ..... আবূ মূসা (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ মু'মিন এক আঁতে খাবার খায় এবং কাফির সাত আঁতে খাবার খায়। (ইসলামিক ফাউন্ডেশন ৫২০৪, ইসলামিক সেন্টার ৫২১৬)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": "2062.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭৩, আন্তর্জাতিক নাম্বারঃ ২০৬২ ৫২৭৩-(.../...) কুতাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে তাদের সবার হাদীসের হুবহু বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫২০৫, ইসলামিক সেন্টার ৫২১৭)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": "2063",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭৪, আন্তর্জাতিক নাম্বারঃ ২০৬৩ ৫২৭৪-(১৮৬/২০৬৩) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, জনৈক কাফির লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অতিথি হলো। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বকরীর দুধ দোহন করতে নির্দেশ দিলেন। দুধ দোহন শেষ হলে ব্যক্তিটি সে দুধটুকু পান করলো। এরপর অন্য একটি বকরী দোহন করা হলে সে তাও পান করলো। পুনরায় আরেকটি দোহন করা হলে সেটার দুধও সে পান করলো। এভাবে সে সাতটি বকরীর দুধ পান করে ফেলল। পরবর্তী দিন সকালে সে ইসলাম গ্রহণ করলো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় তার জন্য একটি বকরীর দুধ দোহন করতে নির্দেশ দিলেন। (দোহন করা হলে) সে তা পান করলো। তিনি আবার আর একটি দোহন করার আদেশ দিলে তখন সে আর তার পুরোটুকু পান করতে পারল না। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মু'মিন এক আঁতে পান করে। আর কাফির সাত আঁতে পান করে। (ইসলামিক ফাউন্ডেশন ৫২০৬, ইসলামিক সেন্টার ৫২১৮)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": "2064.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭৫, আন্তর্জাতিক নাম্বারঃ ২০৬৪ ৫২৭৫-(১৮৭/২০৬৪) ইয়াহইয়া ইবনু ইয়াহইয়া, যুহায়র ইবনু হারব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন সময় কোন খাদ্যকে মন্দ বলেননি। কোন খাদ্য প্রিয় হলে খেয়েছেন আর পছন্দ না হলে ছেড়ে দিয়েছেন।* (ইসলামিক ফাউন্ডেশন ৫২০৭, ইসলামিক সেন্টার ৫২১৯) * সকল খাদ্যই আল্লাহর নি’আমাত, কোন খাদ্য একজনের জন্য রুচিসম্মত না হলেও অপরের জন্য তা পছন্দনীয় হতে পারে। তাই কোন খাদ্যকে মন্দ বলা উচিত নয়, রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এটা অপছন্দ করতেন।",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": "2064.02",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": "2064.03",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": "2064.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫২৭৮, আন্তর্জাতিক নাম্বারঃ ২০৬৪ ৫২৭৮-(১৮৮/…) আবূ বকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব মুহাম্মাদ ইবনুল মুসান্না ও আমর আন নাকিদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেছেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে কক্ষনো কোন খাদ্যের দোষ-ত্রুটি বর্ণনা করতে দেখিনি। তার (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ইচ্ছা জাগলে খেতেন আর অনিচ্ছা হলে চুপ থাকতেন। (ইসলামিক ফাউন্ডেশন ৫২১০) আবূ কুরায়র ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত রয়েছে। (ইসলামিক ফাউন্ডেশন ৫২১১, ইসলামিক সেন্টার ৫২২২-৫২২৩)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 257
			}
		}
	]
}