{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"38": "The Book of Manners and Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5586,
			"arabicnumber": "2131",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৭৯, আন্তর্জাতিক নাম্বারঃ ২১৩১ ৫৪৭৯-(১/২১৩১) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা ও ইবনু আবূ উমার (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, বাকী' নামক স্থানে এক লোক আর এক লোককে ডাক দিল- হে আবূল কাসিম! তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিকে দৃষ্টি দিলেন। সে বলল, হে আল্লাহর রসূল! আমি আপনাকে উদ্দেশ্য করিনি; আমি তো অমুককে ডেকেছি। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার নামে তোমরা নাম রাখো; কিন্তু আমার উপনামে তোমরা নামকরণ করো না।* (ইসলামিক ফাউন্ডেশন ৫৪০১, ইসলামিক সেন্টার ৫৪২৩) * কুনইয়াত- ‘অমুকের বাপ বা ‘অমুকের পুত্র' বলে নামকরণ করা।",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": "2132",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮০, আন্তর্জাতিক নাম্বারঃ ২১৩২ ৫৪৮০-(২/২১৩২) ইবরাহীম ইবনু যিয়াদ যার উপাধি সাবলান (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলার নিকটে তোমাদের নামগুলোর মধ্যে সর্বাধিক পছন্দনীয় নাম আবদুল্লাহ ও আবদুর রহমান। (ইসলামিক ফাউন্ডেশন ৫৪০২, ইসলামিক সেন্টার ৫৪২৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": "2133.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮১, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮১-(৩/২১৩৩) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদের মাঝে এক লোকের একটি ছেলে সন্তান জন্ম নিল। সে তার নাম রাখল মুহাম্মাদ। সে সময় তার সম্প্রদায়ের লোকেরা তাকে বলল, আমরা তোমাকে ছাড়ব না রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামে নাম রাখা হলে। এরপর সে তার সন্তানটিকে পিঠে বয়ে নিয়ে চলল এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, হে আল্লাহর রসূল! আমার একটি পুত্র সন্তানের জন্ম নিয়েছে আমি তার নাম রাখলাম মুহাম্মাদ। এতে আমার সম্প্রদায়ের লোকেরা আমাকে বলছে, আমরা তোমাকে ছাড়ব না রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামে নাম রাখা হলে। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার নামে তোমরা নাম রাখো, কিন্তু আমার উপনাম অনুসারে উপনাম রেখে না। কারণ, আমি একমাত্র (বন্টনকারী), (আল্লাহ প্রদত্ত সম্পদ) তোমাদের মধ্যে বন্টন করে থাকি। (ইসলামিক ফাউন্ডেশন ৫৪০৩, ইসলামিক সেন্টার ৫৪২৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": "2133.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮২, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮২-(৪/...) হান্নাদ ইবনু সারী (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বললেন, আমাদের মাঝে একজন লোকের একটি পুত্র সন্তান জন্ম নিলো। সে তার নাম দিল মুহাম্মাদ। আমরা বললাম, তোমাকে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামের দ্বারা তোমার কুনইয়াত রাখতে দিব না, যতক্ষণ তুমি তার অনুমতি না নিবে। বর্ণনাকারী বলেন, এরপর সে তার নিকট গিয়ে বলল যে, আমার একটি ছেলে জন্ম নিয়েছে। আমি রসূলুল্লাহর নামে তার নাম রেখেছি। ওদিকে আমার সম্প্রদায়ের লোকেরা সে নাম দিয়ে আমার উপনাম বলতে অস্বীকৃতি জানায়। (তারা বলল) যতক্ষণ তুমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুমতি গ্রহণ না করো। এরপর তিনি বললেনঃ তোমরা আমার নামে নাম রাখো, আমার উপনামে নাম রেখো না। কারণ, আমাকে কাসিম’ (বন্টনকারী) হিসেবে পাঠানো হয়েছে; আমি তোমাদের মাঝে বণ্টন করার দায়িত্ব পালন করি। (ইসলামিক ফাউন্ডেশন ৫৪০৪, ইসলামিক সেন্টার ৫৪২৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": "2133.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৩, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৩-(.../...) রিফা'আহ ইবনু হাইসাম ওয়াসিতী (রহঃ) ..... হুসায়ন (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস রিওয়ায়াত করেছেন। \"কেননা একমাত্র আমাকে বণ্টনকারীরূপে পাঠানো হয়েছে; \"তোমাদের মধ্যে বণ্টন করার দায়িত্ব পালন করি\"- উক্তিটুকু বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৪০৫, ইসলামিক সেন্টার ৫৪২৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": "2133.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৪, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৪-(৫/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ও আবূ সাঈদ আশাজ্জ (রহঃ) ..... জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার নামে তোমরা নাম রাখো এবং আমার উপনাম অনুসারে উপনাম রেখে না। কারণ, আমিই হলাম, আবূল কাসিম তোমাদের মধ্যে ভাগাভাগি করে থাকি। রাবী আবূ বাকর (রহঃ) এর বর্ণনায়وَلاَ تَكَنَّوْا স্থানেوَلاَ تَكْتَنُوا রয়েছে।* (ইসলামিক ফাউন্ডেশন ৫৪০৬, ইসলামিক সেন্টার ৫৪২৮) * শব্দদ্বয় সমার্থক যার অর্থ উপনাম গ্রহণ করো না।",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": "2133.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৫, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৫-(…/...) আবূ কুরায়ব (রহঃ) ..... আ'মাশ (রহঃ) হতে উপরোক্ত সূত্রে বর্ণনা করেছেন। একমাত্র আমাকে 'কাসিম' (বন্টনকারী) রূপে সৃষ্টি করা হয়েছে; তোমাদের মধ্যে আমি বন্টন করে থাকি। (ইসলামিক ফাউন্ডেশন ৫৪০৭, ইসলামিক সেন্টার ৫৪২৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": "2133.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৬, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৬-(৬/...) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, এক আনসারী লোকের একটি পুত্র সন্তান জন্ম নিলে সে তার নাম মুহাম্মাদ রাখা ইচ্ছা করল। তখন সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে জিজ্ঞেস করলো, তিনি বললেনঃ আনসারীরা ভাল কর্ম করেছে। আমার নামে তোমরা নাম রাখো, তবে আমার উপনামে উপনাম রেখো না। (ইসলামিক ফাউন্ডেশন ৫৪০৮, ইসলামিক সেন্টার ৫৪৩০)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": "2133.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৭, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৭-(৭/...) আবূ বাকর ইবনু আবূ শইবাহ, মুহাম্মাদ ইবনুল মুসান্না, মুহাম্মাদ ইবনু আমর ইবনু জাবালাহ্ ইবনুল মুসান্না ও বিশর ইবনু খালিদ (রহঃ), ইসহাক ইবনু ইবরাহীম হান্‌যালী ও ইসহাক ইবনু মানসূর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে ইতোপূর্বে আমরা যাদের হাদীস বর্ণনা করেছি তাদের হাদীসের হুবহু রিওয়ায়াত করেছেন। শু'বাহ্ (রহঃ) এর সানাদে বর্ণিত হাদীসে নাযর (রহঃ) বলেছেন যে, এতে হুসায়ন ও সুলাইমান (রহঃ) আরো কিছু বর্ধিত বলেছেন। হুসায়ন (রহঃ) বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আমি তো বণ্টনকারী হিসেবে প্রেরিত হয়েছি, আমি তোমাদের মধ্যে বণ্টন করে থাকি। আর সুলাইমান (রহঃ) বলেছেন, ‘একমাত্র আমিই বণ্টনকারী, তোমাদের মধ্যে বন্টন করে থাকি। (ইসলামিক ফাউন্ডেশন ৫৪০৯, ইসলামিক সেন্টার ৫৪৩১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": "2133.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৮, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৮-(.../...) 'আমর আন্‌ নাকিদ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদের মাঝে এক লোকের পুত্র জন্ম নিলে সে তার নাম রাখল কাসিম’। আমরা বললাম, আমরা তোমাকে আবূল কাসিম’ (কাসিমের বাপ) উপনামে ডাকব না এবং তোমার চোখ শীতল করব না। সে তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে এসে ঐ ব্যাপরটি বলল। তিনি বললেন, তোমার সন্তানের নাম রাখো ‘আবদুর রহমান। (ইসলামিক ফাউন্ডেশন ৫৪১০, ইসলামিক সেন্টার ৫৪৩২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": "2133.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৮৯, আন্তর্জাতিক নাম্বারঃ ২১৩৩ ৫৪৮৯-(.../...) উমাইয়াহ্ ইবনু বিসতাম, আলী ইবনু হুজর (রহঃ) ... জাবির (রাযিঃ) হতে ইবনু উয়াইনাহ্ (রহঃ) বর্ণিত হাদীসের অবিকল বর্ণনা করেছেন। তবে তিনি \"তোমার চোখ শীতল করব না\" এ উক্তি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৪১১, ইসলামিক সেন্টার ৫৪৩৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": "2134",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯০, আন্তর্জাতিক নাম্বারঃ ২১৩৪ ৫৪৯০-(৮/২১৩৪) আবূ বাকর ইবনু আবূ শাইবাহ, আমর আন্‌ নাকিদ, যুহায়র ইবনু হারব ও ইবনু নুমায়র (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার নামে নাম রাখো এবং আমার উপনাম হিসেবে উপনাম রেখো না। আমর (রহঃ) তার বর্ণনাতে বলেছেন, আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত এবং তিনি এ উক্তিটি করেননি বলতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৫৪১২, ইসলামিক সেন্টার ৫৪৩৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": "2135",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯১, আন্তর্জাতিক নাম্বারঃ ২১৩৫ ৫৪৯১-(৯/২১৩৫) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, আবূ সাঈদ আশাজ্জ ও মুহাম্মাদ ইবনুল মুসান্না আনাযী (রহঃ) ..... আল মুগীরাহ ইবনু শু'বাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি যে সময় নাজরান গমন করলাম, তখন সেখানকার ব্যক্তির আমাকে জিজ্ঞেস করল, আপনারা পড়েনيَا أُخْتَ هَارُونَ (হে হারূনের বোন) অথচ মূসা (আঃ) ছিলেন ঈসা (আঃ) এর এত দিন আগে? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আমি যখন ফিরে আসলাম তখন এ বিষয়ে তাকে প্রশ্ন করলাম। তিনি বললেন, তারা (ইয়াহুদী-খ্ৰীষ্টানরা) তাদের পূর্ববর্তী নবী ও সালিহগণের নামে (বাচ্চাদের) নাম রাখতো। (ইসলামিক ফাউন্ডেশন ৫৪১৩, ইসলামিক সেন্টার ৫৪৩৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": "2136.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯২, আন্তর্জাতিক নাম্বারঃ ২১৩৬ ৫৪৯২-(১০/২১৩৬) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... সামুরাহ ইবনু জুনদাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের গোলামদের চারটি নাম দ্বারা নামকরণ করতে বারণ করেছেনঃ আফলাহ, রাবাহ, ইয়াসার ও নাফি'। (ইসলামিক ফাউন্ডেশন ৫৪১৪, ইসলামিক সেন্টার ৫৪৩৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": "2136.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯৩, আন্তর্জাতিক নাম্বারঃ ২১৩৬ ৫৪৯৩-(১১/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... সামুরাহ ইবনু জুনদাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার ক্রীতদাসের নাম রাবাহ, ইয়াসার, আফলাহ ও নাফি’ রেখো না। (ইসলামিক ফাউন্ডেশন ৫৪১৫, ইসলামিক সেন্টার ৫৪৩৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": "2137.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯৪, আন্তর্জাতিক নাম্বারঃ ২১৩৭ ৫৪৯৪-(১২/২১৩৭) আহমাদ ইবনু আবদুল্লাহ ইবনু ইউনুস (রহঃ) ..... সামুরাহ ইবনু জুনদাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর নিকট বেশি পছন্দনীয় কালাম চারটি। سُبْحَانَ اللَّهِআল্লাহর পবিত্রতা ঘোষণা করছি,وَالْحَمْدُ لِلَّهِ যাবতীয় প্রশংসা আল্লাহর,وَلاَ إِلَهَ إِلاَّ اللَّهُ (এক) আল্লাহ ছাড়া আর উপাস্য নেই এবংوَاللَّهُ أَكْبَرُ আল্লাহ সর্বশ্রেষ্ঠ। এগুলোর যে কোন শব্দ দ্বারা তুমি আরম্ভ কর, এতে তোমার কোন ক্ষতি নেই এবং কক্ষনো তোমার ক্রীতদাসের নাম ইয়াসার, রাবাহ, নাজীহ ও আফলাহ রাখবে না। কেননা, তুমি হয়তো বা ডাকবে- ওখানে সে আছে কি? আর সে (তখন) সেখানে নাও থাকতে পারে। তখন কেউ বলবে না এখানে নেই। (এ জবাবে কু-ধারণা তৈরি হতে পারে)। (বর্ণনাকারী বলেন), নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কেবল এ চারটি নাম বলেছেন। অতঃপর কেউ যেন আমার চাইতে অধিক সংযোজন না করে। (ইসলামিক ফাউন্ডেশন ৫৪১৬, ইসলামিক সেন্টার ৫৪৩৮)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": "2137.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯৫, আন্তর্জাতিক নাম্বারঃ ২১৩৭ ৫৪৯৫-(.../...) ইসহাক ইবনু ইবরাহীম, উমাইয়াহ ইবনু বিসতাম, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) মানসূর (রহঃ) হতে যুহায়র (রহঃ) এর সানাদানুসারে হাদীস বর্ণনা করেছেন। কিন্তু জারীর (রহঃ) ও রাওহ্ (রহঃ) উল্লিখিত হাদীস যুহায়র (রহঃ) বর্ণিত সম্পূর্ণ ঘটনার বর্ণনা সম্বলিত হাদীসের অবিকল। তবে শু'বাহ (রহঃ) এর হাদীসে শুধু সন্তানের নাম রাখার কথা বর্ণনা আছে। তিনি أربع (চার-এর) কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৪১৭, ইসলামিক সেন্টার ৫৪৩৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": "2138",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯৬, আন্তর্জাতিক নাম্বারঃ ২১৩৮ ৫৪৯৬-(১৩/২১৩৮) মুহাম্মাদ ইবনু আহমাদ ইবনু আবূ খালাফ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইয়া'লা, বারাকাহ, আফলাহ, ইয়াসার ও নাফি’ ইত্যাদি এ রকম নাম রাখা বারণ করার ইচ্ছা পোষণ করেছিলেন। অতঃপর তাকে আমি লক্ষ্য করলাম যে, এ ব্যাপারে তিনি নিশ্চুপ রইলেন, কিছু বললেন না। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে উঠিয়ে নেয়া হলো এবং তিনি তা (শক্তভাবে) বারণ করেননি। পরে উমার (রাযিঃ) তা বারণ করার ইচ্ছা পোষণ করলেন, তারপর তিনিও তা পরিত্যাগ করেন। (ইসলামিক ফাউন্ডেশন ৫৪১৮, ইসলামিক সেন্টার ৫৪৪০)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": "2139.01",
			"text": "(হাদিস একাডেমি নাম্বারঃ ৫৪৯৭, আন্তর্জাতিক নাম্বারঃ ২১৩৯ ৫৪৯৭-১৪/২১৩৯) আহমাদ ইবনু হাম্বাল, যুহায়র ইবনু হারব, মুহাম্মদ ইবনুল মুসান্না, উবাইদুল্লাহ ইবনু সাঈদ ও মুহাম্মদ ইবনু বাশশার (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামعَاصِيَةَ (অমান্যকারী) এর নাম পরিবর্তন করে দিলেন এবং বললেন, তুমিجَمِيلَةُ (সুন্দরী)। বর্ণনাকারী আহমাদ (রহঃ) এর সানাদেأَخْبَرَنِي এর স্থানেعَنْ দিয়ে উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪১৯, ইসলামিক সেন্টার ৫৪৪১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": "2139.02",
			"text": "(হাদিস একাডেমি নাম্বারঃ ৫৪৯৮, আন্তর্জাতিক নাম্বারঃ ২১৩৯ ৫৪৯৮-১৫/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, উমার (রাযিঃ) এর এক মেয়েকেعَاصِيَةُ (আসিয়াহ) নামে ডাকা হত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নাম রাখলেন, 'জামীলাহ্'। (ইসলামিক ফাউন্ডেশন ৫৪২০, ইসলামিক সেন্টার ৫৪৪২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": "2140",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৪৯৯, আন্তর্জাতিক নাম্বারঃ ২১৪০ ৫৪৯৯-(১৬/২১৪০) ‘আমর আন নাকিদ ও ইবনু আবূ উমার (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (উম্মুল মু'মিনীন) জুওয়াইরিয়াহ্ (রাযিঃ) এর আসল নাম ছিল বাররাহ্ (পুণ্যবতী) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নাম পরিবর্তন করে রাখলেন জুওয়াইরিয়াহ্ (স্নেহময়ী কিশোরী)। কেননা বাররাহ (পুণ্যবতী) এর নিকট হতে বের হয়ে এসেছেন- এমন বাক্য তিনি পছন্দ করতেন না। ইবনু আবূ উমার (রাযিঃ) এর হাদিসে কুরায়ব (রহঃ) সূত্রেعَنِ ابْنِ عَبَّاسٍ এর স্থানে سَمِعْتُ ابْنَ عَبَّاسٍ বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৪২১, ইসলামিক সেন্টার ৫৪৪৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": "2141",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০০, আন্তর্জাতিক নাম্বারঃ ২১৪১ ৫৫০০-(১৭/২১৪১) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনুল মুসান্না, মুহাম্মাদ ইবনু বাশশার ও উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, যাইনাব (রাযিঃ) এর আসল নাম ছিল বাররাহ্’। তাই বলা হলো, তিনি আত্মশুদ্ধি করেন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নামকরণ করলেন যাইনাব। ইবনু বাশশার ছাড়া উপরোল্লিখিত রাবীদের বর্ণিত হাদীসের হুবহু শব্দ বর্ণিত হয়েছে। তবে ইবনু আবী শাইবাহحَدَّثَنَا شُعْبَةُ এর স্থলেعَنْ شُعْبَةَ বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৪২২, ইসলামিক সেন্টার ৫৪৪৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": "2142.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০১, আন্তর্জাতিক নাম্বারঃ ২১৪২ ৫৫০১-(১৮/২১৪২) ইসহাক ইবনু ইবরাহীম ও আবূ কুরায়ব (রহঃ) ..... যাইনাব বিনতু উম্মু সালামাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, পূর্বে আমার নাম বাররাহ ছিল। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নাম রাখলেন ‘যাইনাব’। তিনি বলেন, যাইনাব বিনতু জাহশ (রাযিঃ) তার (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর) নিকট আসলো। তার (ও) নাম ছিল বাররাহ তার নামও তিনি 'যাইনাব' রেখে দিলেন। (ইসলামিক ফাউন্ডেশন ৫৪২৩, ইসলামিক সেন্টার ৫৪৪৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": "2142.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০২, আন্তর্জাতিক নাম্বারঃ ২১৪২ ৫৫০২-(১৯/...) 'আমর আন নাকিদ (রহঃ) ..... মুহাম্মাদ ইবনু আমর ইবনু আতা (রহঃ) হতে বর্ণিত। তিনি বলেন, আমার কন্যার নাম রাখলাম বাররাহ। সে সময় যাইনাব বিনতু আবূ সালামাহ্ (রাযিঃ) আমাকে বললেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ নাম রাখতে বারণ করেছেন। আমার নাম বাররাহ্- (পুণ্যবতী) রাখা হয়েছিল। তাতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা স্বয়ং আত্মা পরিশুদ্ধ বলে দাবি করো না। আল্লাহ তা'আলাই অধিকতর জানেন তোমাদের মাঝে পুণ্যবানদের সম্পর্কে। অতঃপর তারা বলল, তবে আমরা তার কি নামকরণ করবো? তিনি বললেন, তার নাম রাখো যাইনাব’। (ইসলামিক ফাউন্ডেশন ৫৪২৪, ইসলামিক সেন্টার ৫৪৪৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": "2143.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৩, আন্তর্জাতিক নাম্বারঃ ২১৪৩ ৫৫০৩-(২০/২১৪৩) সাঈদ ইবনু আমর আশ'আসী, আহমাদ ইবনু হাম্বাল ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর তা'আলার নিকট অধিকতর ঘৃণিত নাম ঐ লোকের, যার নাম 'মালিকুল আমলাক'- (বাদশার বাদশাহ) রাখা হয়। ইবনু আবূ শাইবাহ্ (রহঃ) তার বর্ণিত হাদীসে বেশি বর্ণনা করেছেন- \"আল্লাহ ছাড়া প্রকৃতপক্ষে অন্য কোন মালিকা অধিপতি\" নেই\"। আশ'আসী (রহঃ) বলেন, বর্ণনাকারী সুফইয়ান (রহঃ) বলেছেন, এ শব্দ (ফারসী ভাষায়) শাহান শাহ-এর অবিকল। আর আহমাদ ইবনু হাম্বাল (রহঃ) বলেন, আমি আবূ আমর (রহঃ) কেأَخْنَعَ এর অর্থ জানতে চাইলে তিনি বলেন,أَوْضَعَ চরম নিকৃষ্ট। (ইসলামিক ফাউন্ডেশন ৫৪২৫, ইসলামিক সেন্টার ৫৪৪৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": "2143.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৪, আন্তর্জাতিক নাম্বারঃ ২১৪৩ ৫৫০৪-(২১/…) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনাব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, এগুলো আবূ হুরাইরাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট হাদীস বর্ণনা করেছেন। তারপর তিনি কিছু হাদীস বর্ণনা করলেন। তন্মধ্যে অন্যতম একটি হলো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন। কিয়ামতের দিন আল্লাহ তা'আলার নিকটে সবচেয়ে রাগের কারণ, সবচেয়ে ঘৃণিত, অধিকতর ক্ষিপ্রতার সম্মুখীন হবে সে লোক যার নাম রাখা হয়েছে 'মালিকুল আমলাক' (রাজাধিরাজ সম্রাট), আল্লাহ ছাড়া অন্য আর কেউ মালিক (সম্রাট) নেই। (ইসলামিক ফাউন্ডেশন ৫৪২৬, ইসলামিক সেন্টার ৫৪৪৮)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": "2144.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৫, আন্তর্জাতিক নাম্বারঃ ২১৪৪ ৫৫০৫-(২২/২১৪৪) আবদুল আ'লা ইবনু হাম্মাদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু আবূ তালহাহ্ আনসারী এর জন্মকালে আমি তাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে নিয়ে গেলাম। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় গায়ে একটি আলখাল্লা জড়িয়ে তার উটের গায়ে তৈল মালিশ করছিলেন। তিনি প্রশ্ন করলেন, তোমার সাথে খেজুর আছে কি? আমি বললাম, হ্যাঁ। তারপর আমি তার হাতে কয়েকটি খেজুর দিলাম। তিনি তার মুখে জড়িয়ে দিয়ে চিবালেন। তারপর শিশুটির মুখ ফাঁক করে তার মুখের ভিতরে দিলেন। শিশুটি তা চুষতে লাগল। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ 'আনসারীদের খেজুরের প্রতি ভালবাসা' এবং তিনি তার নাম রাখলেন, ‘আবদুল্লাহ। (ইসলামিক ফাউন্ডেশন ৫৪২৭, ইসলামিক সেন্টার ৫৪৪৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": "2144.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৬, আন্তর্জাতিক নাম্বারঃ ২১৪৪ ৫৫০৬-(২৩/…) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আবূ তালহাহ্ (রাযিঃ) এর এক পুত্র সন্তান রোগগ্রস্ত ছিল। (একদিন) আবূ তালহাহ্ (রাযিঃ) (তার কর্মে) বের হলো এদিকে তার বাচ্চাটি মারা যায়। যখন আবূ তালহাহ (রাযিঃ) ফিরে আসলেন, তিনি (স্ত্রীকে) প্রশ্ন করলেন, আমার সন্তান কী করছে? (স্ত্রী) উম্মু সুলায়ম (রাযিঃ) বললেন, সে পূর্বের চেয়ে অধিকতর শান্ত। তারপর তিনি তাকে রাতের খাদ্য দিলেন, তিনি তা খেলেন, তারপর তার সাথে মিলিত হলেন। তারপর তিনি অবসর হলে উম্মু সুলায়ম (রাযিঃ) বললেন, শিশুটিকে দাফন করে এসো। যখন সকাল হলো আবূ তালহাহ্ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে এসে তাকে (সব) ঘটনা অবহিত করলেন। তিনি জিজ্ঞেস করলেন, তোমরা কি গতরাতে মিলিত হয়েছো? তিনি বললেন, হ্যাঁ। তিনি (দু’আ করে) বললেন, হে আল্লাহ তাদের দু'জনের জন্যে বারাকাত দিন। তারপর তার স্ত্রী একটি সন্তান প্রসব করলেন। সে সময় আবূ তালহাহ্ (রাযিঃ) আমাকে বললেন, তাকে (কোলে) তুলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে নিয়ে যাও। তাকে নিয়ে রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলেন। উম্মু সুলায়ম (রাযিঃ) তার সঙ্গে কতক খেজুরও দিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (শিশুটিকে) কোলে নেন এবং জিজ্ঞেস করলেন, তার সাথে কিছু আছে কি? তারা বললো, হ্যাঁ, কয়েকটি খেজুর। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেগুলো বের করলেন ও চিবালেন। তারপর তা তার মুখ হতে নিলেন এবং বাচ্চাটির মুখের মধ্যে দিলেন। এরপর তাকে তাহনীক করে তার জন্যে দু'আ করলেন এবং তার নাম রাখলেন ‘আবদুল্লাহ। (ইসলামিক ফাউন্ডেশন ৫৪২৮, ইসলামিক সেন্টার ৫৪৫০)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": "2144.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৭, আন্তর্জাতিক নাম্বারঃ ২১৪৪ ৫৫০৭-(.../...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আনাস (রাযিঃ) হতে এ ঘটনা সহকারে রাবী ইয়াযীদ (রহঃ) এর হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪২৯, ইসলামিক সেন্টার ৫৪৫১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": "2145",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৮, আন্তর্জাতিক নাম্বারঃ ২১৪৫ ৫৫০৮-(২৪/২১৪৫) আবূ বাকর ইবনু আবূ শাইবাহ, ‘আবদুল্লাহ ইবনু বাররাদ আশ'আরী ও আবূ কুরায়ব (রহঃ) ..... আবূ মূসা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার একটি পুত্র সস্তান ভূমিষ্ঠ হলে আমি তাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে উপস্থিত হলাম। তিনি তার নাম রাখলেন ইবরাহীম এবং একটি খেজুর চিবিয়ে তার মুখে দিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৩০, ইসলামিক সেন্টার ৫৪৫২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": "2146.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫০৯, আন্তর্জাতিক নাম্বারঃ ২১৪৬ ৫৫০৯-(২৫/২১৪৬) হাকাম ইবনু মূসা আবূ সালিহ্ (রহঃ) ..... উরওয়াহ্ ইবনু যুবায়র ও ফাতিমাহ বিনতু মুনযির ইবনু যুবায়র (রহঃ) হতে বর্ণিত। তারা বলেন, আসমা বিনতু আবূ বাকর (রাযিঃ) যে সময় হিজরাত করলেন, সে সময় তিনি ‘আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) কে পেটে ধারণ করছিলেন। কুবায় পৌছলে তিনি 'আবদুল্লাহকে প্রসব করলেন। তারপর প্রসবের পর তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে গেলেন যাতে তিনি তাকে (নবজাতককে) খেজুর চিবিয়ে বারাকাত দেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাচ্চাটিকে তার নিকট হতে নিয়ে নিজের কোলে রাখলেন। এরপর একটি খেজুর নিয়ে আসলেন। বর্ণনাকারী বলেন, ‘আয়িশাহ (রাযিঃ) বলেন, তা পাওয়ার আগ পর্যন্ত খুঁজে যোগাড় করতে আমাদের কিছু সময় দেরী হলো। তারপর তিনি তা চিবিয়ে নিজ মুখে থেকে তার মুখের ভিতরে দিলেন। অতএব তার পেটে প্রথম যা ঢুকল তা ছিল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর লালা। আসমা (রাযিঃ) আরও বলেছেন, তারপর তিনি তাকে হাত বুলিয়ে দিলেন এবং তার জন্য দু'আ করলেন, আর তার নাম রাখলেন আবদুল্লাহ। তারপর সাত কিংবা আট বছর বয়সে সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে বাই’আত হওয়ার জন্য এলো। (পিতা) যুবায়র (রাযিঃ) তাকে তা করার উপদেশ দিয়েছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এগিয়ে আসতে দেখে মুচকি হাসলেন। এরপর তাকে বাই’আত করে নিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৩১, ইসলামিক সেন্টার ৫৪৫৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": "2146.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১০, আন্তর্জাতিক নাম্বারঃ ২১৪৬ ৫৫১০-(২৬/...) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা (রহঃ) ..... আসমা (রাযিঃ) হতে বর্ণিত যে, তিনি মক্কায় (থাকাকালে) আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) কে গর্ভে ধারণ করেন। তিনি বলেন, আমি (মক্কাহ থেকে মদীনায় (হিজরাতের উদ্দেশে) বের হলাম। সে সময় আমার গর্ভকাল পূর্ণ হয়ে আসছে। আমি মদীনায় এসে কুবায় গমন করলাম এবং কুবায় তাকে প্রসব করলাম। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমাতে গেলাম। তিনি তাকে (নবজাতককে) তার কোলে রাখলেন, এরপর একটি খেজুর আনিয়ে তা চিবালেন, অতঃপর তার মুখ থেকে লালাসহ তার (বাচ্চাটির) মুখে দিলেন। অতএব রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর লালাই ছিল প্রথম খাদ্য, যা তার পেটে ঢুকলো। অতঃপর খেজুর চিবিয়ে তার মুখে দেয়ার পর তার জন্য দু'আ করলেন এবং তাকে বারাকাত (এর দু'আ) দিলেন। এ সন্তানই ছিল (মদীনায়) হিজরাতের পর ইসলামের প্রথম নবজাতক। (ইসলামিক ফাউন্ডেশন ৫৪৩২, ইসলামিক সেন্টার ৫৪৫৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": "2146.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১১, আন্তর্জাতিক নাম্বারঃ ২১৪৬ ৫৫১১-(…/…) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আসমা বিনতু আবূ বাকর সিদ্দীক (রাযিঃ) হতে বর্ণিত যে, তিনি আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) কে গর্ভে ধারণ করে হিজরাত করে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে পৌছলেন। অতঃপর উসামাহ্ (রাযিঃ) এর হাদীসের অবিকল উল্লেখ করেন। (ইসলামিক ফাউন্ডেশন ৫৪৩৩, ইসলামিক সেন্টার ৫৪৫৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": "2147",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১২, আন্তর্জাতিক নাম্বারঃ ২১৪৭ ৫৫১২-(২৭/২১৪৭) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে (নবজাতক) সন্তানদের নিয়ে আসা হত। তাদের জন্য তিনি বারাকাতের দু'আ করতেন এবং খেজুর চিবিয়ে তাদের মুখে দিতেন। (ইসলামিক ফাউন্ডেশন ৫৪৩৪, ইসলামিক সেন্টার ৫৪৫৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": "2148",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৩, আন্তর্জাতিক নাম্বারঃ ২১৪৮ ৫৫১৩-(২৮/২১৪৮) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, 'আবদুল্লাহ ইবনু যুবায়রকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরবারে (নবজাতক) নিয়ে আসলাম তাকে তাহনীক করার জন্য। অতঃপর আমরা একটি খেজুর চাইলাম। তবে তা সংগ্রহ করা আমাদের জন্য কঠিন হয়ে পড়লো। (ইসলামিক ফাউন্ডেশন ৫৪৩৫, ইসলামিক সেন্টার ৫৪৫৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": "2149",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৪, আন্তর্জাতিক নাম্বারঃ ২১৪৯ ৫৫১৪-(২৯/২১৪৯) মুহাম্মাদ ইবনু সাহল তামীমী ও আবূ বাকর ইবনু ইসহাক (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মুনযির ইবনু আবূ উসায়দ (রাযিঃ) কে তার জন্মের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আনা হলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার রানের উপরে তাকে রাখলেন। আবূ উসায়দ (রাযিঃ) (পাশে) উপবিষ্ট। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সামনে কোন বিষয় মনোযোগ দিলেন। আবূ উসায়দ (রাযিঃ) তার সন্তানের ব্যাপারে (কাউকে) আদেশ করলেন। তাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর রানের উপর থেকে উঠিয়ে নিয়ে তাকে ফেরত পাঠিয়ে দিলো। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সজাগ হলেন এবং বললেন, বাচ্চাটি কোথায়? আবূ উসায়দ (রাযিঃ) বললেন, হে আল্লাহর রসূল! আমরা তাকে ফেরত পাঠিয়ে দিয়েছি। তিনি প্রশ্ন করলেন, তার নাম কী? তারা বলল, 'অমুক' হে আল্লাহর রসূল! তিনি বললেন, না; বরং তার নাম মুনযির। এভাবে সেদিন থেকে তিনি তার নাম মুনযির রেখে দিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৩৬, ইসলামিক সেন্টার ৫৪৫৮)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": "2150",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৫, আন্তর্জাতিক নাম্বারঃ ২১৫০ ৫৫১৫-(৩০/২১৫০) আবূ রাবী' সুলাইমান ইবনু দাউদ আতাকী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানুষের মাঝে চরিত্রগুণে সর্বোত্তম ছিলেন। আমার এক ভাই ছিল, যাকে আবূ উমায়র বলে সম্বোধন করা হতো। বর্ণনাকারী বলেন, আমি অনুমান করি তিনি বলেছিলেন যে, সে দুধ ছাড়ানো বয়সের ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই (আমাদের ঘরে) আসতেন, তখন তাকে দেখে বলতেন, হে আবূ উমায়রা! কি করেছো নুগায়র (চড়ুইছানা)? এ কথা বলে তিনি তার সঙ্গে খেলা করতেন। (ইসলামিক ফাউন্ডেশন ৫৪৩৭, ইসলামিক সেন্টার ৫৪৫৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": "2151",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৬, আন্তর্জাতিক নাম্বারঃ ২১৫১ ৫৫১৬-(৩১/২১৫১) মুহাম্মাদ ইবনু উবায়দ গুবারী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, হে বৎস! (ইসলামিক ফাউন্ডেশন ৫৪৩৮, ইসলামিক সেন্টার ৫৪৬০)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": "2152.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৭, আন্তর্জাতিক নাম্বারঃ ২১৫২ ৫৫১৭-(৩২/২১৫২) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ও ইবনু আবূ উমার (রহঃ) ..... আল-মুগীরাহ ইবনু শু'বাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট 'দাজ্জাল' সম্বন্ধে আমার চেয়ে বেশি কেউ প্রশ্ন করেনি যত প্রশ্ন আমি করেছি। তিনি আমাকে বললেন, হে বৎস! তার কোন বিষয় তোমাকে অস্থির করেছে? সে কিছুতেই তোমার অনিষ্ট করতে পারবে না। মুগীরাহ বলেন, আমি বললাম, তারা তো ধারণা করে থাকে যে, তার সাথে পানির নহরসমূহ এবং রুটির পাহাড়সমূহ থাকবে। তিনি বললেন, তা আল্লাহর নিকট তার থেকে সহজতর। (ইসলামিক ফাউন্ডেশন ৫৪৩৯, ইসলামিক সেন্টার ৫৪৬১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": "2152.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৮, আন্তর্জাতিক নাম্বারঃ ২১৫২ ৫৫১৮-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র, সুরায়জ ইবনু ইউনুস, ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইসমাঈল (রহঃ) হতে উপরোক্ত সূত্রে হাদীস রিওয়ায়াত করেছেন। কিন্তু তাদের মাঝে ইয়াযীদ (রহঃ) বর্ণিত হাদীস ছাড়া কারো হাদীসে মুগীরাহ (রাযিঃ) এর প্রতি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উক্তিটি \"হে বৎস\" শব্দের উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ৫৪৪০, ইসলামিক সেন্টার ৫৪৬২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": "2153.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫১৯, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫১৯-(৩৩/২১৫৩) আমর ইবনু মুহাম্মাদ ইবনু বুকায়র নাকিদ (রহঃ) ..... বুসর ইবনু সাঈদ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ সাঈদ খুদরী (রাযিঃ) কে বলতে শুনেছি, আমরা মদীনার আনসারীদের একটি বৈঠকে উপবিষ্ট ছিলাম। সে সময় আবূ মূসা (রাযিঃ) অস্থির হয়ে, অথবা (বর্ণনাকারী বলেছেন) ভীত-সন্ত্রস্ত হয়ে আমাদের নিকট এলেন। আমরা বললাম, আপনার সমস্যা কি? তিনি বললেন, উমার (রাযিঃ) আমার নিকট লোক প্রেরণ করলেন, যেন আমি তার নিকট যাই। আমি তার চৌকাঠে তিনবার সালাম করলাম। তিনি আমাকে উত্তর দিলেন না। তাই আমি ফিরে আসলাম। পরে আমাকে (ডেকে নিয়ে) তিনি বললেন, আমাদের নিকট আসতে কোন বিষয় তোমাকে নিষেধ করলো। অতঃপর আমি বললাম, আমি আপনার নিকট এসেছিলাম এবং আপনার চৌকাঠে (দাঁড়িয়ে) তিনবার সালাম করেছিলাম। তবে তারা (গৃহের কেউ) আমাকে সালামের উত্তর দিলেন না। তাই আমি ফিরে গেলাম। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মাঝে যদি কেউ তিনবার অনুমতি চায়, আর তাকে অনুমতি দেয়া না হয়, তাহলে সে যেন ফিরে আসে। সে সময় উমার (রাযিঃ) বললেন, এ ব্যাপারে প্রমাণ দাও। নতুবা তোমাকে প্রহার করব। সে সময় উবাই ইবনু কা'ব (রাযিঃ) বললেন, তার সাথে গোষ্ঠীর সবচেয়ে অল্প বয়সের সন্তানই যাবে। আবূ সাঈদ (রাযিঃ) বলেন, আমি বললাম, আমি গোষ্ঠীর কনিষ্ঠতম। তিনি বললেন, তবে একে নিয়ে যাও। (ইসলামিক ফাউন্ডেশন ৫৪৪১, ইসলামিক সেন্টার ৫৪৬৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": "2153.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২০, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২০-(…/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ও ইবনু আবূ উমার (রহঃ) ..... ইয়াযীদ ইবনু খুসাইফাহ্ (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন এবং আবূ উমার (রহঃ) তার বর্ণিত হাদীসে বাড়তি বলেছেন যে, আবূ সাঈদ (রাযিঃ) বলেন, সে সময় আমি তার সাথে উঠে দাঁড়ালাম এবং উমার (রাযিঃ) এর নিকট গিয়ে সাক্ষ্য প্রদান করলাম। (ইসলামিক ফাউন্ডেশন ৫৪৪২, ইসলামিক সেন্টার ৫৪৬৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": "2153.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২১, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২১-(৩৪/...) আবূ তাহির (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা উবাই ইবনু কা'ব (রাযিঃ) এর নিকট একটি মাজলিসে ছিলাম। তখন আবূ মূসা আশ'আর (রাযিঃ) ক্রোধাম্বিত অবস্থায় এসে দাঁড়িয়ে বললেন, আমি তোমাদের আল্লাহর শপথ দিয়ে বলছি, তোমাদের মাঝে কেউ কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছ যে, অনুমতি গ্রহণ তিনবার, এতে যদি তোমাকে অনুমতি দেয়া হয়, ‘ভাল’, নতুবা-তুমি প্রত্যাবর্তন কর। উবাই (রাযিঃ) বললেন, তাতে কী হয়েছে? তিনি বললেন, গতকাল (খলীফা) উমার ইবনু খাত্তাব (রাযিঃ) এর নিকট আমি তিনবার অনুমতি চাইলাম। আমাকে অনুমতি দেয়া হয়নি। তারপর আমি প্রত্যাবর্তন করলাম। পরদিন তার নিকট গমন করলাম এবং তার নিকট প্রবেশ করে তাকে সংবাদ দিলাম যে, আমি গতকাল এসেছিলাম এবং তিনবার সালাম করে (উত্তর না পেয়ে) চলে গিয়েছিলাম। তিনি বললেন, আমরা তোমার শব্দ শুনতে পেয়েছিলাম, কিন্তু আমরা তখন ব্যস্ত ছিলাম। কিন্তু যে পর্যন্ত না তোমাকে অনুমতি দেয়া হয় সে পর্যন্ত তুমি তা চাইতে থাকলে না কেন? তিনি বললেন, আমি তো সে অনুমতি চেয়েছি, যেরূপ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি। উমার (রাঃ) বললেন, আল্লাহর শপথ! তোমার পিঠে ও পেটে আঘাত করব; অথবা তুমি এমন ব্যক্তি পেশ করবে, যে এ ব্যাপারে তোমার পক্ষে সাক্ষ্য দেবে। সে সময় উবাই ইবনু কা'ব (রাযিঃ) বললেন, আল্লাহর শপথ! আমাদের মধ্যে সবচেয়ে অল্প বয়সের লোকই তোমার সঙ্গে যাবে; তিনি বলেন, হে আবূ সাঈদ দাঁড়াও, অতঃপর আমি দাঁড়ালাম এবং উমার (রাযিঃ) এর নিকট এসে বললাম, অবশ্যই আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এ কথা বলতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৫৪৪৩, ইসলামিক সেন্টার ৫৪৬৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": "2153.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২২, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২২-(৩৫/...) নাসর ইবনু আলী আল-জাহযামী (রহঃ) ...... আবূ সাঈদ (রাযিঃ) থেকে বর্ণনা করেন যে, আবূ মূসা (রাযিঃ) উমার (রাযিঃ) এর দরজায় এসে অনুমতি চাইলেন। উমার (রাযিঃ) (শব্দ শুনে মনে মনে) বললেন, একবার হলো। অতঃপর দ্বিতীয়বার অনুমতি চাইলেন। উমার (রাযিঃ) বললেন, দু'বার হলো। অতঃপর তৃতীয়বার অনুমতি চাইলেন। উমার (রাযিঃ) বললেন, তিনবার হলো। অতঃপর তিনি প্রত্যাবর্তন করলেন। পরে ['উমার (রাযিঃ)] তার পশ্চাতে লোক প্রেরণ করে তাকে ডেকে নিয়ে বললেন, এটি যদি এমন হয়, যা তুমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে সংরক্ষণ করেছ, তাহলে তা উপস্থাপন করো। নতুবা আমি তোমাকে দৃষ্টান্তমূলক সাজা দিব। আবূ সাঈদ (রাযিঃ) বলেন, সে সময় তিনি আমাদের নিকট এসে বললেন, তোমরা কি জান না যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ 'অনুমতি গ্রহণ তিনবার' বর্ণনাকারী বলেন, লোকেরা তখন (এ কথা শুনে) হাসাহাসি করতে লাগল। বর্ণনাকারী বলেন, আমি বললাম, তোমাদের নিকট একজন মুসলিম ভাই আগমন করেছেন, যাকে ভয় দেখানো হয়েছে, আর তোমরা হাসছ? (তাকে বললাম) চলুন। এ শাস্তিতে আমি আপনার অংশীদার হবো। সে সময় তিনি (আমাকে সাথে নিয়ে) তার নিকট গিয়ে বললেন, এ যে আবূ সাঈদ... (আমার সাক্ষী)। (ইসলামিক ফাউন্ডেশন ৫৪৪৪, ইসলামিক সেন্টার ৫৪৬৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": "2153.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৩, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২৩-(.../...) মুহাম্মাদ ইবনুল মুসান্না এবং ইবনু বাশশার (রহঃ) আহমাদ ইবনু খিরাশ (রহঃ) ….. আবূ সাঈদ খুদরী (রাযিঃ) হতে আবূ মাসলামাহ্ (রহঃ) হতে নেয়া বিশর ইবনু মুফাযযাল (রহঃ) বর্ণিত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৪৫, ইসলামিক সেন্টার ৫৪৬৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": "2153.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৪, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২৪-(৩৬/…) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... উবায়দ ইবনু উমায়র (রহঃ) হতে বর্ণিত। (খলীফা) উমার (রাযিঃ) এর নিকট আবূ মূসা (রাযিঃ) তিনবার অনুমতি প্রার্থনা করলেন। তখন (উত্তর না পেয়ে) তিনি যেন তাকে ব্যতিব্যস্ত মনে করে চলে গেলেন। সে সময় উমার (রাযিঃ) বললেন, তুমি কি আবদুল্লাহ ইবনু কায়স (আবূ মূসা) এর শব্দ শোননি? তোমরা তাকে অনুমতি দাও! সে সময় তাকে উমারের নিকট ডাকা হলো। তখন তিনি তাকে বললেন, এ রকম করতে তোমাকে কোন বিষয় তোমাকে উৎসাহিত করেছে? তিনি বললেন, আমাদের এ রকম করার আদেশ করা হয়েছে। তিনি বললেন, নিশ্চয়ই তুমি এ বিষয়ে সাক্ষী হাজির করবে, নতুবা অবশ্যই আমি এমন করবো অর্থাৎ শাস্তি দিবো। তিনি বেরিয়ে গিয়ে আনসারীদের এক বৈঠকে পৌছলেন। তারা বললেন, আমাদের মধ্যে সবচেয়ে কম বয়সের লোকই এ ব্যাপারে তোমার পক্ষে সাক্ষ্য দেবে। তখন আবূ সাঈদ (রাযিঃ) উঠলেন এবং বললেন, আমাদের এরূপই নির্দেশ দেয়া হয়। তখন উমার (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ ব্যাপারটি আমার নিকট অজ্ঞাত রয়েছে। (কারণ) বাজারের বাণিজ্যে আমাকে এ ব্যাপারে উদাসীন রেখেছে। (ইসলামিক ফাউন্ডেশন ৫৪৪৬, ইসলামিক সেন্টার ৫৪৬৮)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": "2153.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৫, আন্তর্জাতিক নাম্বারঃ ২১৫৩ ৫৫২৫-(…/...) মুহাম্মাদ ইবনু বাশশার ও হুসায়ন ইবনু হুরায়স (রহঃ) ..... ইবনু জুরায়জ (রহঃ) হতে উক্ত সূত্রে হুবহু বর্ণনা করেছেন। কিন্তু বর্ণনাকারী নাযর (রহঃ) তার বর্ণিত হাদীসে বাজারের ক্রয়-বিক্রয় আমাকে এ বিষয় হতে উদাসীন রেখেছে’ বাক্যটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৪৪৭, ইসলামিক সেন্টার ৫৪৬৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": "2154.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৬, আন্তর্জাতিক নাম্বারঃ ২১৫৪ ৫৫২৬-(৩৭/২১৫৪) আবূ আম্মার হুসায়ন ইবনু হুরায়স (রহঃ) ..... আবূ বুরদাহ (রহঃ) এর সানাদে আবূ মূসা আশ'আর (রাযিঃ) হতে বর্ণিত। আবূ বুরদাহ (রহঃ) বলেন, আবূ মূসা (রাযিঃ) উমার ইবনুল খাত্তাব (রাযিঃ) এর নিকট এসে বললেন, আসসালামু 'আলাইকুম– এ (আমি) আবদুল্লাহ ইবনু কায়স। তবে তিনি তাকে অনুমতি দিলেন না। তখন (পুনরায়) বললেন, আসসালামু 'আলাইকুম- এ যে, আবূ মূসা। আসসালামু আলাইকুম-এ যে আশ'আরী। তারপর (উত্তর না পেয়ে) চলে গেলেন। সে সময় উমার (রাযিঃ) বললেন, (তাকে) আমার নিকট ডেকে নিয়ে আসো। আমার নিকট ফিরিয়ে নিয়ে আসো। প্রত্যাবর্তন শেষে তিনি বললেন, কিসে তোমাকে ফিরিয়ে দিল, হে আবূ মূসা? আমরা কোন কর্মে মশগুল ছিলাম। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমি বলতে শুনেছি— ‘অনুমতি প্রার্থনা তিনবার। এতে তোমাকে অনুমতি দেয়া হলে ভাল, নতুবা ফিরে যাবে। উমার (রাযিঃ) বললেন, এ ব্যাপারে অবশ্যই তুমি আমার নিকট প্রমাণাদি নিয়ে আসবে। নতুবা আমি এমন করব, তেমন করব, (সাজা দিব)। তখন আবূ মূসা (রাযিঃ) ফিরে গেলেন। উমার (রাযিঃ) বললেন, প্রমাণ যোগাড় করতে পারলে, বিকালে তাকে তোমরা মিম্বারের নিকট দেখতে পাবে, আর যদি প্রমাণ না পায়, তাহলে তোমরা তাকে দেখতে পাবে না। বিকালে তিনি এলে তারা তাকে (মিম্বারের নিকট দেখতে) পেল। উমার (রাযিঃ) বললেন, হে, আবূ মূসা কি বলছ? প্রমাণ পেয়েছ? তিনি বললেন, হ্যাঁ- উবাই ইবনু কা'ব! তিনি বললেন, ইনি ন্যায়পরায়ণ। তারপর উবাই ইবনু কা'ব (রাযিঃ) কে লক্ষ্য করে বললেন- হে আবূ তুফায়ল!* ইনি কী বলেন? তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এমন বলতে আমি শুনেছি হে ইবনুল খাত্তাব! আপনি কখনো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের জন্য শাস্তি স্বরূপ হয়ে পড়বেন না। তিনি বললেন, সুবহানাল্লাহ! (আমি তা কখনো চাই না)। আমি তো একটি বিষয় শোনার পর সে ব্যাপারে সুনিশ্চিত হতে আমার আগ্রহ প্রকাশ করেছি। (ইসলামিক ফাউন্ডেশন ৫৪৪৮, ইসলামিক সেন্টার ৫৪৭০) * আবূ তুফায়ল- উবাই ইবনু কা’ব (রাযিঃ) এর একটি উপনাম।",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": "2155.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৭, আন্তর্জাতিক নাম্বারঃ ২১৫৪ ৫৫২৭-(.../...) আবদুল্লাহ ইবনু উমার ইবনু মুহাম্মাদ ইবনু আ'বান (রহঃ) ..... তালহাহ ইবনু ইয়াহইয়া (রহঃ) হতে এ সানাদে হাদীস বর্ণনা করেছেন। কিন্তু তিনি বলেছেন, \"উমার (রাযিঃ) (উবাইকে উদ্দেশ্য করে) বললেন, হে আবূল মুনযির! আপনি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ কথাটি শুনেছেন? তিনি বললেন, হ্যাঁ। (তিনি আরো বলেন) হে ইবনুল খাত্তাব! আপনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের প্রতি শাস্তিদাতা স্বরূপ হবেন না। তবে তিনি উমার (রাযিঃ) এর সুবহানাল্লাহ ও পরবর্তী উক্তিটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৪৪৯, ইসলামিক সেন্টার ৫৪৭১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": "2155.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৮, আন্তর্জাতিক নাম্বারঃ ২১৫৫ ৫৫২৮-(৩৮/২১৫৫) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে এসে তাকে ডাকলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশ্ন করলেন, এ কে? আমি বললাম, আমি'। বর্ণনাকারী জাবির (রাযিঃ) বলেন, তখন তিনি বের হয়ে এলেন আর বলছিলেন, আমি! আমি!! (ইসলামিক ফাউন্ডেশন ৫৪৫০, ইসলামিক সেন্টার ৫৪৭২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": "2155.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫২৯, আন্তর্জাতিক নাম্বারঃ ২১৫৫ ৫৫২৯-(৩৯/...) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি চাইলাম। তিনি বললেন, \"এ কে? আমি বললাম, আমি’। সে সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি! আমি!! (ইসলামিক ফাউন্ডেশন ৫৪৫১, ইসলামিক সেন্টার ৫৪৭৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": "2156.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩১, আন্তর্জাতিক নাম্বারঃ ২১৫৬ ৫৫৩১-(৪০/২১৫৬) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রুমহ ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... সাহল ইবনু সা’দ আস-সাইদী (রাযিঃ) হতে বর্ণিত যে, এক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দরজার একটি ছিদ্র দিয়ে দৃষ্টি নিক্ষেপ করলেন। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট একটি (মাথার চুল আঁচড়ানো) চিরুনি ছিল, যা দ্বারা তিনি তার মাথা আচড়াচ্ছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখতে পেয়ে বললেনঃ আমি যদি জানতাম যে, তুমি আমাকে দেখছ তাহলে নিশ্চয়ই তা দ্বারা তোমার চোখে খোঁচা দিতাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বললেনঃ চোখের জন্যেই তো অনুমতির বিধান করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৪৫৩, ইসলামিক সেন্টার ৫৪৭৫)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": "2156.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩২, আন্তর্জাতিক নাম্বারঃ ২১৫৬ ৫৫৩২-(৪১/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে বর্ণনা করেন যে, সাহল ইবনু সাদ আনসারী (রাযিঃ) তাকে বলেছেন, এক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘরের একটি দরজার ছিদ্র দিয়ে দৃষ্টি নিক্ষেপ করলেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে একটি চিরুনি ছিল, যা দ্বারা তিনি তার মাথার চুল আচড়াচ্ছিলেন। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, যদি আমি জানতাম যে, তুমি দেখছো, তাহলে সেটি দ্বারা তোমার চোখে খোঁচা দিতাম। চোখের জন্যই আল্লাহ অনুমতি নেয়ার বিধান করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৫৪, ইসলামিক সেন্টার ৫৪৭৬)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5640,
			"arabicnumber": "2156.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৩, আন্তর্জাতিক নাম্বারঃ ২১৫৬ ৫৫৩৩-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ, আমর আন নাকিদ, যুহায়র ইবনু হারব, ইবনু আবূ উমার ও আবূ কামিল জাহদারী (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আল-লায়স (রহঃ) ও ইউনুস (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৫৫, ইসলামিক সেন্টার ৫৪৭৭)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5641,
			"arabicnumber": "2157",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৪, আন্তর্জাতিক নাম্বারঃ ২১৫৭ ৫৫৩৪-(৪২/২১৫৭) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ কামিল ফুযায়ল ইবনু হুসায়ন ও কুতাইবাহ্ ইবনু সাঈদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন এক হুজরার ভিতরে তাকাল। তখন তিনি তাকে দেখে একটি তীরের ফলক অথবা বর্ণনাকারীর সংশয় কয়েকটি ফলক নিয়ে দাঁড়ালেন। আমি যেন (এখনও ঐ দৃশ্য) দেখছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে খোঁচা দেয়ার উদ্দেশে সুযোগ সন্ধান করছেন। (ইসলামিক ফাউন্ডেশন ৫৪৫৬, ইসলামিক সেন্টার ৫৪৭৮)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": "2158.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৫, আন্তর্জাতিক নাম্বারঃ ২১৫৮ ৫৫৩৫-(৪৩/২১৫৮) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক কোন গোত্রের ঘরে তাদের নির্দেশ ছাড়া উকি মারে, তাহলে তার চোখে আঘাত করা তাদের জন্য জায়িয হয়। (ইসলামিক ফাউন্ডেশন ৫৪৫৭, ইসলামিক সেন্টার ৫৪৭৯)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": "2158.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৬, আন্তর্জাতিক নাম্বারঃ ২১৫৮ ৫৫৩৬-(৪৪/...) ইবনু আবূ উমার (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি বিনা অনুমতিতে তোমার প্রতি উঁকি দেয় আর তুমি তাকে পাথর মেরে তার চোখ ফুঁড়ে দাও, তাতে তোমার কোন গুনাহ হবে না। (ইসলামিক ফাউন্ডেশন ৫৪৫৮, ইসলামিক সেন্টার ৫৪৮০)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": "2159.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৭, আন্তর্জাতিক নাম্বারঃ ২১৫৯ ৫৫৩৭-(৪৫/২১৫৯) কুতাইবাহ ইবনু সাঈদ, আবূ বাকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) ...... জারীর ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আচমকা নজর পড়া ব্যাপারে প্রশ্ন করলাম। তিনি আমাকে আদেশ করলেন, যেন আমি আমার দৃষ্টি দ্রুত ফিরিয়ে নেই। (ইসলামিক ফাউন্ডেশন ৫৪৫৯, ইসলামিক সেন্টার ৫৪৮১)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": "2159.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৮, আন্তর্জাতিক নাম্বারঃ ২১৫৯ ৫৫৩৮-(…/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইউনুস (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৬০, ইসলামিক সেন্টার ৫৪৮২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 60
			}
		}
	]
}