{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5646,
			"arabicnumber": "2160",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৩৯, আন্তর্জাতিক নাম্বারঃ ২১৬০ ৫৫৩৯-(১/২১৬০) উকবাহ ইবনু মুকরাম ও মুহাম্মাদ ইবনু মারযুক (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সওয়ারী পদচারীকে, পদচারী বসে থাকা লোককে এবং কম সংখ্যক লোক বেশি সংখ্যক লোককে সালাম করবে। (ইসলামিক ফাউন্ডেশন ৫৪৬১, ইসলামিক সেন্টার ৫৪৮৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": "2161",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪০, আন্তর্জাতিক নাম্বারঃ ২১৬১ ৫৫৪০-(২/২১৬১) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইসহাক ইবনু আবদুল্লাহ ইবনু আবূ তালহার আব্বা আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা (গৃহের সম্মুখের উন্মুক্ত) উঠানে বসে গল্প-গুজব করতেছিলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলেন এবং আমাদের সম্মুখে দাঁড়িয়ে বললেন, রাস্তা-ঘাটে বসে বৈঠকে করা তোমাদের কি আচরণ? রাস্তাঘাটে মাজলিস করা তোমরা ছেড়ে দাও। আমরা বললাম, আমরা তো কাউকে কষ্ট দেয়ার উদ্দেশে বসিনি। আমরা বসে শলা-পরামর্শ ও আলোচনা করছি। তিনি বললেন, যদি তা না করলেই নয়, তাহলে রাস্তার হক আদায় করবে- আর তা হলো চোখ নিচু রাখা, সালামের উত্তর দেয়া এবং ভাল কথা বলা। (ইসলামিক ফাউন্ডেশন ৫৪৬২, ইসলামিক সেন্টার ৫৪৮৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": "2121.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪১, আন্তর্জাতিক নাম্বারঃ ২১২১ ৫৫৪১-(৩/২১২১) সুওয়াইদ ইবনু সা'ঈদ (রহঃ) ..... আবূ সা'ঈদ খুদরী (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা পথে বৈঠক করা হতে সাবধান থাকে। তারা বললেন, হে আল্লাহর রসূল! রাস্তায় বসা ব্যতীত আমাদের উপায় নেই। সেখানে আমরা আলাপচারিতায় থাকি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ নিতান্তই যদি তোমাদের বসতেই হয়, তাহলে তোমরা রাস্তার হক আদায় করবে। তারা প্রশ্ন করলেন, রাস্তার হক কি? তিনি বললেন, দৃষ্টি নিচু রাখা, (কাউকে) কষ্ট দেয়া থেকে বিরত থাকা, সালামের উত্তর দেয়া এবং সৎ কাজের নির্দেশ করা ও মন্দ কাজে বাধা প্রদান করা। (ইসলামিক ফাউন্ডেশন ৫৪৬৩, ইসলামিক সেন্টার ৫৪৮৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": "2121.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪২, আন্তর্জাতিক নাম্বারঃ ২১২১ ৫৫৪২-(…/...) ইয়াহইয়া ইবনু ইয়াহইয়া, মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... যায়দ ইবনু আসলাম (রহঃ) হতে উপরোক্ত সূত্রে হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৬৪, ইসলামিক সেন্টার ৫৪৮৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": "2162.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৩, আন্তর্জাতিক নাম্বারঃ ২১৬২ ৫৫৪৩-(৪/২১৬২) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুসলিমের প্রতি অপর মুসলিমের হক পাঁচটি। অপর বর্ণনায় আবদ ইবনু হুমায়দ (রহঃ) আবূ হুরাইরাহ (রাযিঃ) বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পাঁচটি ব্যাপারে মুসলিমের জন্যে তার ভাইয়ের সম্পর্কে ওয়াজিব। ১. সালামের উত্তর দেয়া, ২. হাঁচিদাতাকে (তার \"আলহামদু লিল্লাহ' বলার উত্তরে) ইয়ারহামুকাল্লাহ বলে দু'আ করা, ৩. দাওয়াত কবুল করা, ৪. অসুস্থকে দেখতে যাওয়া এবং ৫. জানাযার সঙ্গে শারীক হওয়া। (রাবী) আবদুর রাযযাক (রহঃ) বলেন, মা’মার (রহঃ) এ হাদীস যুহরী (রহঃ) হতে মুরসাল হিসেবে বর্ণনা করতেন, তারপর তিনি ইবনু মুসাইয়্যাব (রহঃ) এর সানাদে আবূ হুরাইরাহ (রাযিঃ) হতে পূর্ণ সানাদে রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৬৫, ইসলামিক সেন্টার ৫৪৮৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": "2162.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৪, আন্তর্জাতিক নাম্বারঃ ২১৬২ ৫৫৪৪-(৫/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ও ইবনু হুজর (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমের প্রতি মুসলিমের হক ছয়টি। প্রশ্ন করা হলো- সেগুলো কী, হে আল্লাহর রসূল! তিনি বললেন, (সেগুলো হলো-) ১. কারো সাথে তোমার দেখা হলে তাকে সালাম করবে, ২, তোমাকে দাওয়াত করলে তা তুমি কবুল করবে, ৩. সে তোমার নিকট ভাল উপদেশ চাইলে, তুমি তাকে ভাল উপদেশ দিবে, ৪. সে হাঁচি দিয়ে আলহামদু লিল্লাহ্ বললে, তার জন্যে তুমি (ইয়ারহামুকাল্লাহ্ বলে) রহমতের দু’আ করবে, ৫. সে পীড়িত হলে তার সেবা-শুশ্রুষা করবে এবং ৬. সে মৃত্যুবরণ করলে তার (জানাযার) সাথে যাবে। (ইসলামিক ফাউন্ডেশন ৫৪৬৬, ইসলামিক সেন্টার ৫৪৮৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": "2163.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৫, আন্তর্জাতিক নাম্বারঃ ২১৬৩ ৫৫৪৫-(৬/২১৬৩) ইয়াহইয়া ইবনু ইয়াহইয়া ও ইসমাঈল ইবনু সালিম (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আহলে কিতাবের কেউ যদি তোমাদের সালাম করে তোমরা (শুধু এতটুকু) বলবে- ওয়া আলাইকুম— (তোমাদের প্রতিও)। (ইসলামিক ফাউন্ডেশন ৫৪৬৭, ইসলামিক সেন্টার ৫৪৮৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": "2163.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৬, আন্তর্জাতিক নাম্বারঃ ২১৬৩ ৫৫৪৬-(৭/...) উবাইদুল্লাহ ইবনু মু'আয, ইয়াহইয়া ইবনু হাবীব, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রশ্ন করলেন, আহলে কিতাবরা তো আমাদের সালাম দিয়ে থাকে, আমরা কেমন করে তাদের উত্তর দিব? তিনি বললেন, তোমরা বলবে, \"ওয়া আলাইকুম\"। (ইসলামিক ফাউন্ডেশন ৫৪৬৮, ইসলামিক সেন্টার ৫৪৯০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": "2164.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৭, আন্তর্জাতিক নাম্বারঃ ২১৬৪ ৫৫৪৭-(৮/২১৬৪) ইয়াহইয়া ইবনু ইয়াহইয়া, ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ্ ও ইবনু হুজর (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়াহুদীরা যে সময় তোমাদের প্রতি সালাম দেয়, সে সময় তাদের কেউ বলে \"আসসামু 'আলাইকুম\" (তোমাদের মরণ হোক)। তখন তুমি বলবে 'ওয়া আলাইকা'– (তোমারও- হোক)! (ইসলামিক ফাউন্ডেশন ৫৪৬৯, ইসলামিক সেন্টার ৫৪৯১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": "2164.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৮, আন্তর্জাতিক নাম্বারঃ ২১৬৪ ৫৫৪৮-(৯/...) যুহায়র ইবনু হারব (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল হাদীস বর্ণনা করেছেন। তাছাড়া তিনি বলেছেন- তখন তোমরা বলবে \"ওয়া আলাইকুম\" অর্থাৎ তোমারও (মৃত্যু হোক)। (ইসলামিক ফাউন্ডেশন ৫৪৭০, ইসলামিক সেন্টার ৫৪৯২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": "2165.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৪৯, আন্তর্জাতিক নাম্বারঃ ২১৬৫ ৫৫৪৯-(১০/২১৬৫) আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একদা ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট (দেখা করার জন্যে) অনুমতি চাইল। তারা সে সময় বলল,السَّامُ عَلَيْكُمْ তোমাদের মরণ হোক! তখন আয়িশাহ্‌ (রাযিঃ) বললেন,بَلْ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ \"বরং তোমাদের উপরে মরণ ও লা'নাত হোক।\" তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আয়িশাহ্ আল্লাহ তা'আলা সকল বিষয়ে সহনশীলতা পছন্দ করেন। আয়িশাহ (রাযিঃ) বললেন, আপনি কি তাদের কটুক্তি শুনেননি? তিনি বললেন, আমিও তো বলে দিয়েছি \"ওয়া আলাইকুম\" (তোমাদের উপরেও)। (ইসলামিক ফাউন্ডেশন ৫৪৭১, ইসলামিক সেন্টার ৫৪৯৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": "2165.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫০, আন্তর্জাতিক নাম্বারঃ ২১৬৫ ৫৫৫০-(.../...) হাসান ইবনু আলী হুলওয়ানী আবদ ইবনু হুমায়দ ও আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। তবে এ দু'জনের বর্ণিত হাদীসে আছে যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি তো বলেছি- আলাইকুম' (তোমাদের উপরে) তারা 'و' অব্যয়টির উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫৪৭২, ইসলামিক সেন্টার ৫৪৯৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": "2165.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫১, আন্তর্জাতিক নাম্বারঃ ২১৬৫ ৫৫৫১-(১১/...) আবূ কুরায়ব (রহঃ) .... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কয়েকজন ইয়াহুদী আসলো। তারা বলল-السَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ হে আবূল কাসিম তোমার মৃত্যু হোক। তিনি বললেন,وَعَلَيْكُمْ তোমাদের উপরেও। আয়িশাহ (রাযিঃ) বলেন, আমি বললাম-بَلْ عَلَيْكُمُ السَّامُ وَالذَّامُ বরং তোমাদের মৃত্যু ও অপমান হোক। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আয়িশাহ! তুমি অশ্লীলভাষী হয়ো না। তিনি বললেন, তারা কি বলেছে, তা কি আপনি শুনেননি? তিনি বললেন, তারা যা বলেছিল, তা-ই কি আমি তাদের ফিরিয়ে দেইনি? আমি বলেছি-‘ওয়া আলাইকুম তোমাদের উপরেও। (ইসলামিক ফাউন্ডেশন ৫৪৭৩, ইসলামিক সেন্টার ৫৪৯৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": "2165.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫২, আন্তর্জাতিক নাম্বারঃ ২১৬৫ ৫৫৫২-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আ'মাশ (রহঃ) উপরোক্ত সূত্রে হাদীস বর্ণনা করেছেন। তাছাড়া তিনি বলেছেন, আয়িশাহ্ (রাযিঃ) তাদের চক্রান্ত বুঝে ফেললেন এবং তাদের বকা দিলেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, চুপ কর, হে আয়িশাহ! কারণ আল্লাহ তা'আলা অশ্লীলতা ও বেহায়াপনা পছন্দ করেন না। তিনি অতিরিক্ত বর্ণনা করেছেন। সে সময় মহামহিমান্বিত আল্লাহ অবতীর্ণ করলেন- আর যখন তারা (ইয়াহুদীরা) আপনার নিকট আসে, সে সময় তারা আপনাকে এমন (কতিপয় বাক্য বলে) সম্ভাষণ করে, যেমন (বাক্য দ্বারা) আল্লাহ আপনাকে সম্ভাষণ করেননি.....” (সূরাহ আল-মুজালাদাহ ৫৮ঃ ৮) আয়াতের শেষ পর্যন্ত। (ইসলামিক ফাউন্ডেশন ৫৪৭৪, ইসলামিক সেন্টার ৫৪৯৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": "2166",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৩, আন্তর্জাতিক নাম্বারঃ ২১৬৬ ৫৫৫৩-(১২/২১৬৬) হারূন ইবনু ‘আবদুল্লাহ ও হাজ্জাজ ইবনু শা'ইর (রহঃ) .... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, ইয়াহুদীদের কিছু লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সালাম দিল। তারা বলল- আসসামু আলাইকা ইয়া আবাল কাসিম’। তিনি বললেন, \"ওয়া আলাইকুম\"। তখন আয়িশাহ (রাযিঃ) বললেন, সে সময় তিনি ক্রোধাম্বিত হয়েছিলেন- তারা কি বলল, আপনি কি শোনেননি? তিনি বললেন- হ্যাঁ, শুনেছি এবং তাদের উপর তা ফিরিয়ে দিয়েছি। তাদের বিপক্ষে আমাদের (প্রার্থনা) মঞ্জুর করা হয় কিন্তু আমাদের বিপক্ষে তাদের (প্রার্থনা) কবুল করা হয় না। (ইসলামিক ফাউন্ডেশন ৫৪৭৫, ইসলামিক সেন্টার ৫৪৯৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": "2167.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৪, আন্তর্জাতিক নাম্বারঃ ২১৬৭ ৫৫৫৪-(১৩/২১৬৭) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়াহুদী ও নাসারাদের আগে বাড়িয়ে সালাম করো না এবং তাদের কাউকে রাস্তায় দেখলে তাকে রাস্তার পাশে চলতে বাধ্য করো। (ইসলামিক ফাউন্ডেশন ৫৪৭৬, ইসলামিক সেন্টার ৫৪৯৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": "2167.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৫, আন্তর্জাতিক নাম্বারঃ ২১৬৭ ৫৫৫৫-(.../...) মুহাম্মাদ ইবনুল মুসান্না, আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও যুহায়র ইবনু হারব (রহঃ) ..... ওয়াকী (রহঃ) বর্ণিত হাদীসে আছে- ‘যখন তোমরা ইয়াহুদীদের সাথে সাক্ষাৎ করবে...। আর শু'বাহ (রহঃ) হতে গৃহীত ইবনু জা'ফার (রহঃ) বর্ণিত হাদীসে আছে- তিনি আহলে কিতাব সম্বন্ধে বলেছেন। ... আর জারীর (রহঃ) বর্ণিত হাদীসে আছে- যখন তোমরা তাদের সাথে সাক্ষাৎ করবে’... তিনি মুশরিকদের কোন দলের নাম উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫৪৭৭, ইসলামিক সেন্টার ৫৪৯৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": "2168.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৬, আন্তর্জাতিক নাম্বারঃ ২১৬৮ ৫৫৫৬-(১৪/২১৬৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল বালকের নিকট দিয়ে যাচ্ছিলেন, সে সময় তিনি তাদের সালাম দিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৭৮, ইসলামিক সেন্টার ৫৫০০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": "2168.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৭, আন্তর্জাতিক নাম্বারঃ ২১৬৮ ৫৫৫৭-(.../...) ইসমা'ঈল ইবনু সালিম (রহঃ) সাইয়্যার (রহঃ) এর সানাদে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৭৮, ইসলামিক সেন্টার ৫৫০১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": "2168.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৮, আন্তর্জাতিক নাম্বারঃ ২১৬৮ ৫৫৫৮-(১৫/...) 'আমর ইবনু ‘আলী ও মুহাম্মাদ ইবনু ওয়ালীদ (রহঃ) ..... সাইয়্যার (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি সাবিত বুনানী (রহঃ) এর সাথে হাটতে ছিলাম। তিনি একদল কিশোরের নিকট দিয়ে গমনের সময় তাদের সালাম দিলেন এবং (তখন) সাবিত (রহঃ) হাদীস বর্ণনা করলেন যে, তিনি আনাস (রাযিঃ) এর সাথে পায়ে হেঁটে চলছিলেন। তিনি (আনাস) একদল কিশোরের নিকট দিয়ে গেলেন এবং তাদের সালাম দিলেন, আনাস (রাযিঃ) হাদীস বর্ণনা করেন যে, তিনি (একবার) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে পায়ে হেঁটে চলছিলেন, তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কিশোরদের নিকট দিয়ে চললেন এবং তাদের সালাম দিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৭৯, ইসলামিক সেন্টার ৫৫০২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": "2169.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৫৯, আন্তর্জাতিক নাম্বারঃ ২১৬৯ ৫৫৫৯-(১৬/২১৬৯) আবূ কামিল জাহদারী ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... ইবনু মাস'উদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, আমার নিকট তোমার জন্যে প্রবেশাধিকার হলো পর্দা উঠিয়ে রাখা এবং (ঘরে) আমার আলাপচারিতা শুনতে পাওয়া। যে পর্যন্ত না আমি তোমাকে বারণ করি। (ইসলামিক ফাউন্ডেশন ৫৪৮০, ইসলামিক সেন্টার ৫৫০৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": "2169.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬০, আন্তর্জাতিক নাম্বারঃ ২১৬৯ ৫৫৬০-(.../…) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... হাসান ইবনু উবাইদুল্লাহ (রহঃ) হতে উপরোক্ত সূত্রে হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৮১, ইসলামিক সেন্টার ৫৫০৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": "2170.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬১, আন্তর্জাতিক নাম্বারঃ ২১৭০ ৫৫৬১-(১৭/২১৭০) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, পর্দার বিধান আমাদের উপরে আসার পর সাওদাহ (রাযিঃ) তার প্রাকৃতিক প্রয়োজনে বের হলেন, তিনি ছিলেন স্বাস্থ্যবতী, দেহাকৃতিতে তিনি মহিলাদের উপরে থাকতেন; যারা তাকে চিনতো, তাদের নিকট নিজেকে আড়াল করতে পারতেন না। তখন উমার ইবনুল খাত্তাব (রাযিঃ) তাকে দেখতে পেয়ে বললেন, হে সাওদাহ্ আল্লাহর কসম! তুমি আমাদের নিকট আড়াল করতে পারবে না। চিন্তা করে দেখো, কিভাবে তুমি বের হচ্ছে? আয়িশাহ্ (রাযিঃ) বলেন, এ কথা শুনে তিনি ফিরে আসলেন। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার ঘরে ছিলেন এবং রাতের আহার করছিলেন। তার হাতে সে সময় গোশতের টুকরো একটি হাড় ছিল। সাওদাহ (রাযিঃ) (প্রবেশ করে বললেন,) হে আল্লাহর রসূল! আমি বের হয়েছিলাম, 'উমার আমাকে এ এ কথা বলেছে। আয়িশাহ (রাযিঃ) বলেন, সে সময় আল্লাহ তা’আলা তার প্রতি ওয়াহী অবতীর্ণ করেন। অতঃপর তার উপর হতে (ওয়াহীর) অবস্থা উঠিয়ে নেয়া হয় এবং হাড়টি তখনও তার হাতেই ছিল, তা তিনি রেখে দেননি। তখন তিনি বললেন, তোমাদের দরকারে বের হওয়ার অনুমতি প্রদান করা হয়েছে (এ বর্ণনা আবূ কুরায়ব-এর)। আর আবূ বাকর (রহঃ) বর্ণিত বর্ণনাতে রয়েছে- \"তার দেহাকৃতি নারীদের উর্ধ্বে থাকত\"। আবূ বাকর (রহঃ) তার বর্ণিত হাদীসে বেশি বর্ণনা করেছেন যে, বর্ণনাকারী হিশাম (রহঃ) বলেছেন,الْبَرَازَ অর্থাৎ- পায়খানার প্রয়োজনে। (ইসলামিক ফাউন্ডেশন ৫৪৮২, ইসলামিক সেন্টার ৫৫০৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": "2170.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৪, আন্তর্জাতিক নাম্বারঃ ২১৭০ ৫৫৬৪-(১৮/...) আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রীগণ প্রকৃতির ডাকে সাড়া দেয়ার (প্ৰস্ৰাব-পায়খানায় যাওয়ার) সময় রাতের বেলা 'মানসি' এর দিকে বেরিয়ে যেতেন। 'মানসি' হলো প্রশস্ত খোলা জায়গা। ওদিকে উমার ইবনুল খাত্তাব (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতেন আপনার স্ত্রীগণের প্রতি পর্দার বিধান আরোপ করুন। কিন্তু রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটি করেননি। একরাতে ইশার সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী সাওদাহ বিনতু যাম্'আহ (রাযিঃ) বের হলেন। তিনি ছিলেন দীর্ঘাঙ্গী নারী। উমার (রাযিঃ) তাকে ডাক দিয়ে বললেন, হে সাওদাহ্! আমরা তোমাকে চিনে ফেলেছি। পর্দার বিধান অবতীর্ণ করার প্রতি দৃঢ় প্রত্যাশায় তিনি এমন করলেন। আয়িশাহ (রাযিঃ) বলেন, তখন আল্লাহ তা'আলা পর্দা-বিধি অবতীর্ণ করলেন। (ইসলামিক ফাউন্ডেশন ৫৪৮৪, ইসলামিক সেন্টার ৫৫০৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": "2170.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৫, আন্তর্জাতিক নাম্বারঃ ২১৭০ ৫৫৬৫-(.../...) 'আমর আন্‌ নাকিদ (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৮৫, ইসলামিক সেন্টার, ৫৫০৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": "2171",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৬, আন্তর্জাতিক নাম্বারঃ ২১৭১ ৫৫৬৬-(১৯/২১৭১) ইয়াহইয়া ইবনু ইয়াহইয়া, আলী ইবনু হুজর, মুহাম্মাদ ইবনু সাব্বাহ ও যুহায়র ইবনু হারব (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হুঁশিয়ার! কোন পুরুষ কোন বয়স্কা নারীর সাথে কিছুতেই রাত্রি যাপন করবে না; তবে যদি সে তার স্বামী হয় কিংবা মাহরাম হয় (তাহলে করতে পারে)। (ইসলামিক ফাউন্ডেশন ৫৪৮৬, ইসলামিক সেন্টার ৫৫১০) [যে নারীর সঙ্গে কোন পুরুষের বিবাহ বন্ধন স্থায়ীভাবে বৈধ- ইসলামী শরীআতে সে নারীকে ঐ পুরুষের জন্য ‘আজনবিয়্যাহ’ তথা বেগানাহ বলা হয়।]",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": "2172.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৭, আন্তর্জাতিক নাম্বারঃ ২১৭২ ৫৫৬৭-(২০/২১৭২) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মদ ইবনু রুমহ (রহঃ) ..... উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হুঁশিয়ার! (বেগানাহ) নারীদের নিকট তোমরা প্রবেশ করা পরিত্যাগ করো। সে সময় আনসারীদের এক লোক বলল- দেবর সম্পর্কে আপনার কি মতামত? তিনি বললেন দেবর তো মৃত্যু তুল্য। (ইসলামিক ফাউন্ডেশন ৫৪৮৭, ইসলামিক সেন্টার ৫৫১১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": "2172.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৮, আন্তর্জাতিক নাম্বারঃ ২১৭২ ৫৫৬৮-(…/...) আবূ তাহির (রহঃ) ..... ইয়াযীদ আবূ হাবীব (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৮৮, ইসলামিক সেন্টার ৫৫১২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": "2172.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৬৯, আন্তর্জাতিক নাম্বারঃ ২১৭২ ৫৫৬৯-(২১/...) আবূ তাহির (রহঃ) ..... ইবনু ওয়াহব (রহঃ) বলেন, লায়স ইবনু সা'দ (রহঃ) কে আমি বলতে শুনেছি যে, الْحَمْوُ শব্দের অর্থ স্বামীর ভাই (দেবর-ভাসুর) এবং স্বামীর আত্মীয়-স্বজনদের মধ্যে তার (স্বামীর ভাইয়ের) সমপর্যায়ের চাচাত ভাই প্রমুখ (ইসলামিক ফাউন্ডেশন ৫৪৮৯, ইসলামিক সেন্টার ৫৫১৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": "2173",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭০, আন্তর্জাতিক নাম্বারঃ ২১৭৩ ৫৫৭০-(২২/২১৭৩) হারূন ইবনু মা’রূফ ও (বিকল্প সানাদে) আবূ তাহির (রহঃ) ..... 'আবদুল্লাহ ইবনু 'আমর ইবনুল আস (রাযিঃ) ['আব্দুর রহমান ইবনু জুবায়র (রাযিঃ)-এর নিকট] হাদীস বর্ণনা করেছেন যে, (বানু) হাশিম সম্প্রদায়ের একদল লোক আসমা বিনতু উমায়স (রাযিঃ) এর নিকট প্রবেশ করলো। তারপর আবূ বাকর সিদ্দীক (রাযিঃ)-ও (গৃহে) প্রবেশ করলেন- তখন তিনি [আসমা (রাযিঃ)], তার সহধর্মিণী ছিলেন। তাদের দেখতে পেয়ে ঐ বিষয়টি (অনুমতি ছাড়া প্রবেশ) অপছন্দ করলেন। তিনি তা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আলোচনা করলেন এবং (এ কথাও) বললেন, অকল্যাণ কিছুই দেখিনি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ অবশ্যই তাকে এ থেকে পবিত্র রেখেছেন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বারে দাঁড়িয়ে বললেন, ‘আমার আজকের এ দিনের পরে কোন পুরুষ তার সঙ্গে একজন পুরুষ বা দু'জন পুরুষ ছাড়া কোন এমন মহিলার নিকট প্রবেশ করবে না যার স্বামী উপস্থিত নেই। (ইসলামিক ফাউন্ডেশন ৫৪৯০, ইসলামিক সেন্টার ৫৫১৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5678,
			"arabicnumber": "2174",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭১, আন্তর্জাতিক নাম্বারঃ ২১৭৪ ৫৫৭১-(২৩/২১৭৪) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ...... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্ত্রীগণের কোন একজনের সাথে ছিলেন, সে সময় তার নিকট দিয়ে এক লোক যাচ্ছিল। তিনি তাকে ডাকলেন। সে (কাছে) আসলে তিনি বললেন, ওহে! এটা আমার অমুক স্ত্রী। সে বলল, হে আল্লাহর রসূল! অপর কারো সম্বন্ধে আমি মন্দ ধারণা করলেও হয়ত করতাম, কিন্তু আপনার সম্বন্ধে তো মন্দ ধারণা করতাম না। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ শাইতান মানুষের রক্ত সঞ্চারণের শিরায় শিরায় চলাফেরা করে থাকে। (ইসলামিক ফাউন্ডেশন ৫৪৯১, ইসলামিক সেন্টার ৫৫১৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5679,
			"arabicnumber": "2175.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭২, আন্তর্জাতিক নাম্বারঃ ২১৭৫ ৫৫৭২-(২৪/২১৭৫) ইসহাক ইবনু ইবরাহীম ও আবদ ইবনু হুমায়দ (রহঃ) ..... সাফিয়্যাহ্ বিনতু হুয়াই (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতিকাফরত ছিলেন। আমি রাত্রিতে তার সাথে দেখা করতে এলাম। (কিছু সময়) তার সাথে কথা বললাম, এরপর ফিরে যাওয়ার জন্যে উঠলাম। তিনিও আমাকে বিদায় দেয়ার জন্যে আমার সঙ্গে উঠলেন। (বর্ণনাকারী বলেন), সে সময় তার [সাফিয়্যাহ্ (রাযিঃ)] বাসস্থান ছিল উসামাহ্ ইবনু যায়দ (রাযিঃ) এর ঘরে। তখন (সেখান দিয়ে) আনসারীদের দু’ লোক গমন করছিলেন। তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে (এক মহিলার সঙ্গে) দেখতে পেয়ে জলদি যেতে লাগল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বললেনঃ তোমরা দু'জন আস্তে আস্তে যাও। এ কিন্তু সাফিয়্যাহ বিনতু হুয়াই (আমার স্ত্রী)। তারা দু’জন বলল, সুবহানাল্লাহ! হে আল্লাহর রসূল (আমরা তো কিছু ভাবিনি) তিনি বললেনঃ শাইতান মানুষের শিরায় শিরায় চলাফেরা করে। আর আমি আশঙ্কা করলাম যে, শাইতান তোমাদের দু'জনের মনে কোন মন্দ ধারণা ঢেলে দিবে অথবা (বর্ণনা সন্দেহ) এ বিষয়ে কোন কিছু তৈরি করতে পারে। (ইসলামিক ফাউন্ডেশন ৫৪৯২, ইসলামিক সেন্টার ৫৫১৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5680,
			"arabicnumber": "2175.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৩, আন্তর্জাতিক নাম্বারঃ ২১৭৫ ৫৫৭৩-(২৫/…) আবদুল্লাহ ইবনু ‘আবদুর রহমান আদ দারিমী (রহঃ) ..... আলী ইবনু হুসায়ন (রহঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী সাফিয়্যাহ (রাযিঃ) তার নিকট বর্ণনা করেছেন যে, রমাযানের শেষ দশকে মসজিদে (নবাবীতে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইতিকাফের সময় তিনি তার সাথে দেখা করতে গেলেন। তিনি তার সাথে কিছু সময় আলোচনা করলেন, তারপর প্রত্যাবর্তনের জন্যে উঠে দাঁড়ালেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তাকে বিদায় দিতে উঠে দাড়ালেন .....। অতঃপর (পূর্ববর্তী হাদীসের রাবী) মা'মার (রহঃ) বর্ণিত হাদীসের মর্মানুযায়ী হাদীস বর্ণনা করেছেন। তাছাড়া তিনি বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন শাইতান মানুষের রক্ত সঞ্চারণের শিরায় শিরায় পৌঁছে। \"প্রবাহিত হয়\" বলেননি। (বরং তিনি এ বর্ণনায়يَبْلُغُ مَبْلَغَ الدَّمِ বলেছেন, তিনিيَجْرِي বলেননি।) (ইসলামিক ফাউন্ডেশন, ৫৪৯২, ইসলামিক সেন্টার ৫৫১৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5681,
			"arabicnumber": "2176.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৪, আন্তর্জাতিক নাম্বারঃ ২১৭৬ ৫৫৭৪-(২৬/২১৭৬) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ ওয়াকিদ লায়সী (রাযিঃ) থেকে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে আমাদের মধ্যে বসা ছিলেন এবং তার সঙ্গে সাহাবীগণের এক দলও ছিল। এ সময় তিনজনের একটি জামা'আত সামনে আসলো। এদের দু'জন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দিকে অগ্রসর হলো, আর একজন চলে গেল। বর্ণনাকারী বলেন, তারা দু’জন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে থেমে গেল। তারপর তাদের একজন সমাবেশের মধ্যে একটু খোলা জায়গা দেখতে পেয়ে সেখানে বসে গেল, দ্বিতীয়জন তাদের (মাজলিসের) পিছনে বসল আর তৃতীয় লোক পেছনে ফিরে চলে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মজলিস) সমাপ্ত করে বললেন, শুন! তিনজনের ক্ষুদে দলটি সম্বন্ধে কি আমি তোমাদের সংবাদ দিব না? তাদের একজন তো আল্লাহর কাছে আশ্রয় নিল, আল্লাহ তা'আলাও তাকে আশ্রয় দিলেন। আর একজন লজ্জা সংকোচ করল, আল্লাহ তার লজ্জা (এর মর্যাদা) রক্ষা করলেন। আর তৃতীয়জন মুখ ফিরিয়ে নিলো, আল্লাহ তা'আলাও তার হতে দৃষ্টি ফিরিয়ে নিলেন। (ইসলামিক ফাউন্ডেশন ৫৪৯৩, ইসলামিক সেন্টার ৫৫১৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5682,
			"arabicnumber": "2176.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৫, আন্তর্জাতিক নাম্বারঃ ২১৭৬ ৫৫৭৫-(.../...) আহমাদ ইবনু আল-মুনযির ও ইসহাক ইবনু মানসূর (রহঃ) ..... ইয়াহইয়া ইবনু আবূ কাসীর (রহঃ) হতে বর্ণিত যে, ইসহাক ইবনু আবদুল্লাহ ইবনু আবূ তালহাহ্ (রহঃ) এ সূত্রে তার নিকট হুবহু অর্থের হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৯৪, ইসলামিক সেন্টার ৫৫১৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5683,
			"arabicnumber": "2177.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৬, আন্তর্জাতিক নাম্বারঃ ২১৭৭ ৫৫৭৬-(২৭/২১৭৭) কুতাইবাহ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমূহ ইবনু মুহাজির (রহঃ) ..... ইবনু উমার (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ তোমাদের কেউ যেন কখনো কোন লোককে তার বসার জায়গা হতে উঠিয়ে দিয়ে সেথায় না বসে। (ইসলামিক ফাউন্ডেশন ৫৪৯৫, ইসলামিক সেন্টার ৫৫২০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5684,
			"arabicnumber": "2177.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৭, আন্তর্জাতিক নাম্বারঃ ২১৭৭ ৫৫৭৭-(২৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া, ইবনু নুমায়র, যুহায়র ইবনু হারব, ইবনুল মুসান্না ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ... ইবনু উমর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করেন যে, তিনি বলেছেনঃ কোন লোক কোন লোককে তার বসার স্থান থেকে উঠিয়ে দিয়ে সেথায় বসবে না বরং তোমরা (বলবে) প্রশস্ত করে দাও, জায়গা বিস্তার করে দাও। (ইসলামিক ফাউন্ডেশন ৫৪৯৬, ইসলামিক সেন্টার ৫৫২১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5685,
			"arabicnumber": "2177.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৮, আন্তর্জাতিক নাম্বারঃ ২১৭৭ ৫৫৭৮-(…/...) আবূ রাবী', আবূ কামিল, ইয়াহইয়া ইবনু হাবীব, মুহাম্মাদ ইবনু রাফি ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইবনু উমর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (উপরোক্ত হাদীসের বর্ণনাকারী) লায়স (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু এদের বর্ণিত হাদীসে \"বরং তোমরা বিস্তৃত করে দাও, প্রশস্ত করে দাও\" (কথাটি) বর্ণনা করেননি। আর (তৃতীয় সানাদের) বর্ণনাকারী ইবনু জুরায়জ বর্ধিত রিওয়ায়াত করেছেন যে, আমি নাফি'কে প্রশ্ন করলাম— (এ বিধান) জুমুআর দিনের জন্য? তিনি বললেন, জুমুআহ ও অন্যান্য (সকল) দিবসের জন্যে। (ইসলামিক ফাউন্ডেশন ৫৪৯৭, ইসলামিক সেন্টার ৫৫২২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5686,
			"arabicnumber": "2177.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৭৯, আন্তর্জাতিক নাম্বারঃ ২১৭৭ ৫৫৭৯-(২৯/...) আবূ বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করেন যে, তিনি বলেছেনঃ তোমাদের মধ্যে কেউ যেন তার ভাইকে তার বসার জায়গা হতে উঠিয়ে দিয়ে সেখানে না বসে। আর ইবনু উমর (রাযিঃ) এর আচরণ ছিল যে, কোন লোক তার জন্যে নিজের বসার স্থান থেকে উঠে গেলে তিনি সেথায় বসতেন না। (ইসলামিক ফাউন্ডেশন ৫৪৯৮, ইসলামিক সেন্টার ৫৫২৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5687,
			"arabicnumber": "2177.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮০, আন্তর্জাতিক নাম্বারঃ ২১৭৭ ৫৫৮০-(.../...) আবদ ইবনু হুমায়দ (রহঃ) আবদুর রাযযাক ও মা'মার (রহঃ) হতে উপরোক্ত সূত্রে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৪৯৯, ইসলামিক সেন্টার ৫৫২৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5688,
			"arabicnumber": "2178",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮১, আন্তর্জাতিক নাম্বারঃ ২১৭৮ ৫৫৮১-(৩০/২১৭৮) সালামাহ্ ইবনু শাবীব (রহঃ) ..... জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন। তিনি বলেছেনঃ জুমুআর দিনে তোমাদের কেউ (মসজিদের কাতার হতে) তার ভাইকে উঠিয়ে দিয়ে তার বসার জায়গায় বসবে না বরং সে বলবে, 'বিস্তার করে দিন'। (ইসলামিক ফাউন্ডেশন ৫৫০০, ইসলামিক সেন্টার ৫৫২৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5689,
			"arabicnumber": "2179",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮২, আন্তর্জাতিক নাম্বারঃ ২১৭৯ ৫৫৮২-(৩১/২১৭৯) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ তোমাদের কেউ যখন (তার স্থান থেকে) (কিছু সময়ের জন্যে) উঠে যায় ..... এ বর্ণনা কুতাইবাহ (রহঃ) এর ঊর্ধ্বতন বর্ণনাকারী আবদুল আযীয (রহঃ) এর এবং অপর ঊর্ধ্বতন বর্ণনাকারী আবূ আওয়ানাহ্ (রহঃ) এর বর্ণিত হাদীসে আছে, যে লোক তার জায়গা ছেড়ে উঠে যাওয়ার পর আবার সেখানে ফিরে আসে, তাহলে সে সেই স্থানে (পুনরায় বসার ব্যাপারে) বেশি হকদার। (ইসলামিক ফাউন্ডেশন ৫৫০১, ইসলামিক সেন্টার ৫৫২৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5690,
			"arabicnumber": "2180",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৩, আন্তর্জাতিক নাম্বারঃ ২১৮০ ৫৫৮৩-(৩২/২১৮০) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব, ইসহাক ইবনু ইবরাহীম ও আবূ কুরায়ব (রহঃ) ..... উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত যে, এক হিজড়া তার নিকট বসা ছিল। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরে ছিলেন। সে উম্মু সালামাহ্ (রাযিঃ) এর ভাইকে বলতে লাগল- হে আবদুল্লাহ ইবনু আবূ উমাইয়াহ! যদি আগামী দিনে আল্লাহ তা'আলা আপনাদেরকে 'তায়িফ বিজয়ী করেন, তাহলে আমি আপনাকে গাইলান-কন্যাকে দেখাবো, সে চারটি নিয়ে সম্মুখে আসে আর আটটি নিয়ে পশ্চাৎদিকে যায়।” রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এ ধরনের কথা বলতে শুনে বললেন, এ যেন তোমাদের নিকট আর প্রবেশ না করে। (ইসলামিক ফাউন্ডেশন ৫৫০২, ইসলামিক সেন্টার ৫৫২৭) * অর্থাৎ- চলার সময় তার মেদ স্ফীত পেটের সম্মুখে থেকে চারটি ভাজ আর পেছন থেকে আটটি ভাজ পরিলক্ষিত হয়।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5691,
			"arabicnumber": "2181",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৪, আন্তর্জাতিক নাম্বারঃ ২১৮১ ৫৫৮৪-(৩৩/২১৮১) আবূদ ইবনু হুমায়দ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক হিজড়া নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণীগণের নিকট প্রবেশ করত। মানুষজন তাকে বুদ্ধি জ্ঞানহীন হিজড়াদের অন্তর্ভুক্ত মনে করত। বর্ণনাকারী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদিন গৃহে প্রবেশ করলেন, তখন সে তার কোন এক স্ত্রীর নিকট ছিল আর সে এক মহিলার (দেহ সৌষ্ঠবের) বর্ণনা দিয়ে বলছিল- ‘যখন সম্মুখে অগ্রসর হয় তখন চার (ভাজ) নিয়ে অগ্রসর হয় এবং যখন পশ্চাতে ফিরে তখন আটটি নিয়ে ফিরে যায়। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সাবধান! এ তো দেখছি এখানকার (নারী রহস্যের) বিষয়াদি বুঝে শুনে। সে যেন তোমাদের নিকট কখনো প্রবেশ না করে। তিনি [আয়িশাহ্ (রাযিঃ)] বলেন, তারপর তারা তার থেকে পর্দা করতো। (ইসলামিক ফাউন্ডেশন ৫৫০৩, ইসলামিক সেন্টার ৫৫২৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5692,
			"arabicnumber": "2182.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৫, আন্তর্জাতিক নাম্বারঃ ২১৮২ ৫৫৮৫-(৩৪/২১৮২) মুহাম্মাদ ইবনু আলা আবূ কুরায়ব হামদানী (রহঃ) ..... আসমা বিনতু আবূ বাকর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যুবায়র (রাযিঃ) আমাকে বিবাহ করলেন, সে সময় একটি ঘোড়া ব্যতীত কোন যোগ্য সম্পদ, গোলাম বা অন্য কোন কিছু দুনিয়াতে তার ছিল না। তিনি বলেন, আমি তার ঘোড়াটাকে ঘাস খাওয়াতাম, তার পারিবারিক কাজকর্মেও সঙ্গ দিতাম। আমি তার যত্ন নিতাম, তার পানিবাহী উটের জন্যে খর্জুর (খেজুর) বীচি কুড়াতাম, তাকে ঘাস খাওয়াতাম, পানি নিয়ে আসতাম, তার ঢোল ইত্যাদি মেরামত করতাম এবং (রুটির জন্য) আটা মাখতাম। তবে আমি ভাল রুটি বানাতে পারতাম না। তাই আমার কতিপয় আনসারী সাথীর মনিরা আমাকে রুটি পাকিয়ে দিত। তারা ছিল স্বার্থহীন রমণী। আমি যুবায়র এর জমি থেকে যা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জায়গীর রূপে দিয়েছিলেন (সেখান থেকে) খেজুর বীচি (কুড়িয়ে) আমার মাথায় করে বয়ে আনতাম। সে (জমি) ছিল এক ক্রোসের দু-তৃতীয়াংশ (প্রায় দু’মাইল) দূরে অবস্থিত। তিনি বলেন, আমি একদিন আসছিলাম আর বীচি ('র বোঝা) আমার মাথায় ছিল। (পথে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দেখা পেলাম, সে সময় তার সাথে সাহাবীগণের একটি ক্ষুদ্র দল ছিল। তিনি আমাকে ডাকলেন এবং (তার বাহন উটটিকে বসাবার জন্যে) ইখ ইখ (আওয়াজ) করলেন যাতে আমাকে সেটির পেছনে উঠিয়ে নিতে পারেন। তিনি আসমা (রাযিঃ) বলেন, আমি লজ্জাবোধ করলাম আর আমি ছিলাম তোমার [যুবায়র (রাযিঃ)] আত্মমর্যাদাবোধ সম্পর্কে জ্ঞাত। তিনি [যুবায়র (রাযিঃ)] বললেন, আল্লাহর শপথ! তোমার মাথায় করে বীচি বয়ে আনাটা (আমার নিকট) তার সাথে তোমার আরোহণের চাইতে অনেক কঠিন (ও কষ্টকর)। তিনি বলেন, অতঃপর (আব্বা) আবূ বাকর (রাযিঃ) আমার নিকট একটি খাদিম প্রেরণ করলেন। ঘোড়াটি দেখা-শুনার কাজে সে আমার পক্ষে যথেষ্ট হয়ে গেল। সে যেন আমাকে এ দায়িত্ব হতে মুক্ত করেছিল। (ইসলামিক ফাউন্ডেশন ৫৫০৪, ইসলামিক সেন্টার ৫৫২৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5693,
			"arabicnumber": "2182.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৬, আন্তর্জাতিক নাম্বারঃ ২১৮২ ৫৫৮৬-(৩৫/...) মুহাম্মাদ ইবনু উবায়দ আল-গুবারী (রহঃ) ..... ইবনু আবূ মুলাইকাহ্ (রহঃ) থেকে বর্ণনা করেন যে, আসমা (রাযিঃ) বলেছেন, আমি পারিবারিক কাজে যুবায়র (রাযিঃ) এর সেবা করতাম। তার একটি ঘোড়া ছিল। আমি তা দেখাশুনা করতাম। ঘোড়াটির দেখাশুনা করার চেয়ে কোন কর্ম আমার নিকট ভারী ছিল না। আমি তার জন্যে ঘাস যোগাড় করতাম, তার দেখাশুনা ও সেবা-পরিচর্যা করতে থাকতাম। বর্ণনাকারী বলেন, তারপর তিনি একটি খাদিম পেলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কিছু যুদ্ধবন্দী এলে তিনি তাকে একটি খাদিম দিলেন। তিনি [আসমা (রাযিঃ)] বলেন, সে (খাদিম) ঘোড়ার দেখাশুনায় আমার জন্যে যথেষ্ট হলো এবং আমি দায়িত্বমুক্ত হলাম। তখন এক অভাবী লোক আমার নিকট এসে বলল, হে আবদুল্লাহর মা! আমি একজন অভাবী মানুষ, আপনার গৃহের ছায়ায় বসে বেচাকেনা করার আগ্রহ প্রকাশ করেছি। তিনি বললেন, তোমাকে আমি অনুমতি দিয়ে ফেললে যুবায়র (রাযিঃ) (সম্ভবত) তা বাতিল করবে। তাই এক কাজ করো, যুবায়র (রাযিঃ) উপস্থিত থাকা অবস্থায় তুমি এসে আমার নিকট প্রস্তাব করবে। ঠিক সময় এসে সে বলল, হে আবদুল্লাহর মা! আমি একজন অভাবী মানুষ, আপনার গৃহের ছায়ায় বসে বেচাকেনা করার ইচ্ছা করেছি। তিনি বললেন, আমার গৃহ ব্যতীত তোমার জন্যে মদীনায় আর কোন স্থান নেই (কি)? সে সময় যুবায়র (রাযিঃ) তাকে বললেন, একটা অভাবী মানুষকে ক্রয়-বিক্রয় করতে দিতে তুমি বাধা হয়ে দাঁড়াচ্ছে কেন? তারপর সে (সেথায়) ক্রয়-বিক্রয় করে (বেশকিছু) আয় করল, আমি খাদিমটি তার নিকট বিক্রি করে দিলাম। এ সময় যুবায়র (রাযিঃ) আমার নিকট প্রবেশ করল— তখনও তার (বিক্রয়কৃত) মূল্য আমার কোলের উপর ছিল। সে বলল ওগুলো আমাকে দান করে দাও। তিনি বলেন, (আমি বললাম), আমি ওগুলো সদাকাহ করে দিয়েছি। (ইসলামিক ফাউন্ডেশন ৫৫০৫, ইসলামিক সেন্টার ৫৫৩০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5694,
			"arabicnumber": "2183.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৭, আন্তর্জাতিক নাম্বারঃ ২১৮৩ ৫৫৮৭-(৩৬/২১৮৩) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ...... ইবনু উমার (রাযিঃ) হতে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তিনজন থাকবে, তখন একজনকে রেখে দু’জনে কানে কানে কথা বলবে না। (ইসলামিক ফাউন্ডেশন ৫৫০৬, ইসলামিক সেন্টার ৫৫৩১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5695,
			"arabicnumber": "2183.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৮, আন্তর্জাতিক নাম্বারঃ ২১৮৩ ৫৫৮৮-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু উমর (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মালিক (রহঃ) বর্ণিত হাদীসের অর্থানুযায়ী বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫০৭, ইসলামিক সেন্টার ৫৫৩২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5696,
			"arabicnumber": "2184.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৮৯, আন্তর্জাতিক নাম্বারঃ ২১৮৪ ৫৫৮৯-(৩৭/২১৮৪) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা তিনজন হবে, তখন দু'জন আর একজনকে বাদ দিয়ে দু’জনে চুপিচুপি কথা বলবে না, যে পর্যন্ত না অন্য ব্যক্তিদের সঙ্গে মিশে যাও- এ কারণে যে, তাহলে তাকে দুর্ভাবনায় ফেলে দিবে। (ইসলামিক ফাউন্ডেশন ৫৫০৮, ইসলামিক সেন্টার ৫৫৩৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5697,
			"arabicnumber": "2184.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯০, আন্তর্জাতিক নাম্বারঃ ২১৮৪ ৫৫৯০-(৩৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শাইবাহ, ইবনু নুমায়র ও আবূ কুরায়ব (রহঃ) ..... আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা তিনজন হবে, তখন দু'জন তাদের সঙ্গীকে বাদ দিয়ে কানাঘুষা করবে না, (কারণ) তা তাকে দুর্ভাবনায় ফেলবে। (ইসলামিক ফাউন্ডেশন ৫৫০৯, ইসলামিক সেন্টার ৫৫৩৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5698,
			"arabicnumber": "2184.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯১, আন্তর্জাতিক নাম্বারঃ ২১৮৪ ৫৫৯১-(…/...) ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমর (রহঃ) ..... আল্ আ'মাশ (রহঃ) এর সানাদে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫১০, ইসলামিক সেন্টার ৫৫৩৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5699,
			"arabicnumber": "2185",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯২, আন্তর্জাতিক নাম্বারঃ ২১৮৫ ৫৫৯২-(৩৯/২১৮৫) ইবনু আবূ উমার মাক্কী (রহঃ) ..... রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ (রাযিঃ) হতে রিওয়ায়াত করেন যে, তিনি বলেছেনঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসুস্থ হয়ে পড়লে জিবরীল (আঃ) এ দু'আ পড়ে তাকে ফুঁকে দিতেন, তিনি বলতেন, আল্লাহর নামে-তিনি আপনাকে (ব্যাধি) সুস্থতা দান করুন, সব ব্যাধি থেকে আপনাকে মুক্ত করুন, আর হিংসুকের অনিষ্ট থেকে এবং যখন সে হিংসা করে এবং সকল প্রকার কুদৃষ্টি ব্যক্তির ক্ষতি হতে। (ইসলামিক ফাউন্ডেশন ৫৫১১, ইসলামিক সেন্টার ৫৫৩৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5700,
			"arabicnumber": "2186",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৩, আন্তর্জাতিক নাম্বারঃ ২১৮৬ ৫৫৯৩-(৪০/২১৮৬) বিশর ইবনু হিলাল সাওওয়াফ (রহঃ) ..... সাঈদ (রাযিঃ) হতে বর্ণনা করেন যে, জিবরীল (আঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আগমন করে বললেন, হে মুহাম্মাদ। আপনি কি অসুস্থতা বোধ করছেন? তিনি বললেন, হ্যাঁ। তিনি (জিবরীল) বললেনঃ আল্লাহর নামে আপনাকে ঝাড়-ফুঁক করছি- সে সব জিনিস হতে, যা আপনাকে কষ্ট দেয়, সব আত্মার খারাবী অথবা হিংসুকের কুদৃষ্টি হতে আল্লাহ আপনাকে মুক্তি দিন, আল্লাহর নামে আপনাকে ঝাড়-ফুঁক করছি। (ইসলামিক ফাউন্ডেশন ৫৫১২, ইসলামিক সেন্টার ৫৫৩৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5701,
			"arabicnumber": "2187",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৪, আন্তর্জাতিক নাম্বারঃ ২১৮৭ ৫৫৯৪-(৪১/২১৮৭) মুহাম্মাদ ইবনু রাফি (রাযিঃ) ..... হাম্মাম ইবনু মুনাব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, এ হলো ঐ সমস্ত (হাদীস), যা আবূ হুরাইরাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট বর্ণনা করেছেন। এরপর তিনি কয়েকটি হাদীস আলোচনা করেন। সেগুলোর অন্যতম একটি হলো- রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুদৃষ্টির পার্শ্বপ্রতিক্রিয়া বাস্তব। (ইসলামিক ফাউন্ডেশন ৫৫১৩, ইসলামিক সেন্টার ৫৫৩৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5702,
			"arabicnumber": "2188",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৫, আন্তর্জাতিক নাম্বারঃ ২১৮৮ ৫৫৯৫-(৪২/২১৮৮) 'আবদুল্লাহ ইবনু আবদুর রহমান দারিমী, হাজ্জাজ ইবনু শাইর ও আহমাদ ইবনু খিরাশ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ কুদৃষ্টির পার্শ্বপ্রতিক্রিয়া বাস্তব’। কোন বিষয় যদি ভাগ্যলিপিকে অতিক্রম করত, তাহলে কুদৃষ্টি ভাগ্যলিপিকে অতিক্রম করত এবং তোমাদের (কুদৃষ্টি সম্পন্ন লোকদের)-কে গোসল করতে বলা হলে তোমরা গোসল করাবে।* (ইসলামিক ফাউন্ডেশন ৫৫১৪, ইসলামিক সেন্টার ৫৫৩৯) * বদনয়র এর চিকিৎসারূপে বিশেষ পদ্ধতিতে বদ নযরওয়ালা ব্যক্তির বিভিন্ন অঙ্গ ধোয়া পানি দিয়ে রোগীকে বিশেষ কায়দায় গোসল করানো হয়। এটা পরীক্ষিত ও সুন্নাহ্ স্বীকৃত চিকিৎসা পদ্ধতি। এ হাদীসে সে গোসলের কথাই বলা হয়েছে।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5703,
			"arabicnumber": "2189.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৬, আন্তর্জাতিক নাম্বারঃ ২১৮৯ ৫৫৯৬-(৪৩/২১৮৯) আবূ কুরায়ব (রহঃ) ...... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, লাবীদ ইবনু আসাম নামে বানু যুৱায়ক সম্প্রদায়ের এক ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যাদু করল। তিনি বলেন, এ যাদুর কারণে এমনও হত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্মরণ হত যে কোন (পার্থিব) কাজ তিনি করছেন, অথচ (প্রকৃতভাবে) তিনি তা করছেন না। পরিশেষে একদিনে কিংবা এক রাত্রে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করলেন; আবার দুআ করলেন, আবার দুআ করলেন। অতঃপর বললেনঃ হে আয়িশাহ! তুমি কি অনুধাবন করতে পেরেছে যে, আল্লাহ আমাকে সে ব্যাপারে সমাধান দিয়েছেন, যে ব্যাপারে আমি তার নিকট সমাধান চেয়েছিলাম? (তা এভাবে যে) (দু’জন ফেরেশতা) দু’লোক (মানুষের বেশ ধরে) আমার নিকট আসলো। তাদের একজন আমার মস্তকের নিকট এবং অপরজন আমার পায়ের নিকট বসল। অতঃপর আমার মাথার নিকটের লোক পায়ের নিকটের লোককে অথবা আমার পায়ের নিকটের লোকটি আমার মাথার নিকটের লোকটিকে বলল, লোকটির ব্যাধি কি? (অপরজন) বলল, যাদুগ্রস্ত। (প্রথম জন) বলল, কে তাকে যাদু করেছে? (দ্বিতীয় জন) বলল- লাবীদ ইবনু আসাম। (প্রথমজন) বলল, কোন জিনিসে? (দ্বিতীয় জন) বলল- চিরুনি, (আঁচড়ানোর সময় চিরুনির সঙ্গে) উঠা চুল, (আরও) বলল, পুরুষ খেজুরের ফুলের বেষ্টনীতে। (প্রথমজন) বলল, তা কোথায়? (দ্বিতীয় জন) বলল- যা আরওয়ান কুয়ায়। তিনি [আয়িশাহ্ (রাযিঃ)] বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কতিপয় সাহাবীকে সাথে নিয়ে সেথায় আসলেন। তারপর (ফিরে এসে) বললেন, হে আয়িশাহ্! আল্লাহর কসম, সে (কূপের) পানি যেন মেহেদীপাতা ভিজানো (পানি) এবং সেখানকার খেজুর গাছ যেন শাইতানের মস্তিষ্ক। তিনি বলেন, তখন আমি বললাম, হে আল্লাহর রসূল! তাহলে আপনি তা (জনসমক্ষে) পুড়ে ফেললেন না কেন? তিনি বললেন, না, (আমি তা উচিত মনে করেনি)। কেননা, আল্লাহ আমাকে তো রোগমুক্ত করেছেন-আর লোকদেরকে কোন অকল্যাণে উত্তেজিত করা অপছন্দ করছি। আমি সে ব্যাপারে নির্দেশ দিলাম। ফলে মাটিতে পুঁতে ফেলা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫১৫, ইসলামিক সেন্টার ৫৫৪০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5704,
			"arabicnumber": "2189.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৭, আন্তর্জাতিক নাম্বারঃ ২১৮৯ ৫৫৯৭-(৪৪/...) আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যাদু করা হলো ..... আবূ কুরায়ব (রহঃ) এ হাদীসটি বিস্তারিত বর্ণনাসহ (উপরোক্ত) ইবনু নুমায়র (রহঃ) কর্তৃক বর্ণিত হাদীসের অর্থানুযায়ী বর্ণনা করেছেন এবং তিনি তাতে এ কথাটিও বলেছেন- পরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুপের নিকট গমন করলেন এবং সেটির (চার) দিকে লক্ষ্য করলেন। তাতে একটি খেজুর গাছ রয়েছে। তিনি ['আয়িশাহ (রাযিঃ)] আরও বলেন, আমি বললাম, হে আল্লাহর রসূল! তাহলে আপনি তা (লোকালয়ে) বের করে ফেলেন। এ বর্ণনায় জ্বালিয়ে দেয়ার অংশটি বর্ণনা করেননি এবং আমি সে সম্পর্কে নির্দেশ দিলে তা মাটিতে পুঁতে ফেলা হলো, (কথাটিও) বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৫১৬, ইসলামিক সেন্টার ৫৫৪১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5705,
			"arabicnumber": "2190.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৮, আন্তর্জাতিক নাম্বারঃ ২১৯০ ৫৫৯৮-(৪৫/২১৯০) ইয়াহইয়া ইবনু হাবীব হারিসী (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণনা করেন যে, এক ইয়াহুদী নবী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বিষ মিশানো ছাগলের গোশত নিয়ে আসলো। তিনি সেখান হতে (কিয়দংশ) খেলেন। অতঃপর তাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে আসা হলো। তিনি তার কাছে (সে কেন এমন করল) এ বিষয়ে জানতে চাইলে সে বলল, আমি আপনাকে হত্যা করার ইচ্ছা করছিলাম। তিনি বললেনঃ আল্লাহ এ বিষয়ে তোমাকে ক্ষমতা দিবেন না অথবা তিনি বললেনঃ আমার উপরে ক্ষমতা দিবেন এমন নয়। বর্ণনাকারী বলেন, তারা (সাহাবীগণ) বললেন, আমরা কি তাকে হত্যা করবো না? তিনি বললেন, না। বর্ণনাকারী বলেন, তারপর থেকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আলজিভ ও তালুতে তার পার্শ্বপ্রতিক্রিয়া আমি সর্বদা লক্ষ্য করতাম। (ইসলামিক ফাউন্ডেশন ৫৫১৭, ইসলামিক সেন্টার ৫৫৪২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5706,
			"arabicnumber": "2190.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৫৯৯, আন্তর্জাতিক নাম্বারঃ ২১৯০ ৫৫৯৯-(.../...) হারূন ইবনু আবদুল্লাহ (রহঃ) ..... হিশাম ইবনু যায়দ (রহঃ) বলেন, আমি আনাস ইবনু মালিক (রাযিঃ) কে হাদীস বর্ণনা করতে শুনেছি যে, একজন ইয়াহুদী নারী গোশতে বিষ মিশিয়ে তা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে আসলো। ..... (উপরোক্ত রিওয়ায়াতের) বর্ণনাকারী খালিদ (রহঃ) এর বর্ণিত হাদীসের অর্থানুযায়ী হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫১৮, ইসলামিক সেন্টার ৫৫৪৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5707,
			"arabicnumber": "2191.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০০, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০০-(৪৬/২১৯১) যুহায়র ইবনু হারব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমাদের কোন মানুষ পীড়িত হলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ডান হাত দ্বারা তাকে মুছে দিতেন, তারপর বলতেনঃ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا সমস্যা বিদূরিত করে দিন, হে জনগণের পালনকর্তা! আর সুস্থতা দান করুন, আপনিই সুস্থতা দানকারী। আপনার সুস্থতা ও মুক্তি ছাড়া আর কোন (প্রকৃতপক্ষে নির্ভরযোগ্য) শিফা নেই। এমন নিরাময় করুন যার পর কোন রোগব্যাধি বাকী না থাকে। পরবর্তীতে যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পীড়িত হলেন তখন অসুখে অতি দুর্বল হয়ে পড়লেন, সে সময় আমি তার হাত তুলে ধরলাম- যাতে আমিও তেমন করে (মুছে) দিতে পারি তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যেমন করে (মুছে) দিতেন। কিন্তু তিনি আমার হাত থেকে তার হাত টেনে (ছাড়িয়ে) নিলেন। অতঃপর বললেনঃ হে আল্লাহ আমাকে মাফ করুন এবং আমাকে মহান সঙ্গীর সাথে সাক্ষাৎ করিয়ে দিন! তিনি [আয়িশাহ (রাযিঃ)] বলেন, হঠাৎ আমি দেখলাম যে, তাকে উঠিয়ে নিয়েছেন (ইন্তিকাল করেছেন)। (ইসলামিক ফাউন্ডেশন ৫৫১৯, ইসলামিক সেন্টার ৫৫৪৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5708,
			"arabicnumber": "2191.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০১, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০১-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আ'মাশ (রহঃ) হতে জারীর (রহঃ) এর সূত্রে বর্ণিত। কিন্তু হুশায়ম ও শু’বাহ্ (রহঃ) বর্ণিত হাদীসে রয়েছে- তিনি তার হস্ত দ্বারা তাকে (রোগীকে) মুছে দিলেন। আর (সুফইয়ান) সাওরী (রহঃ) বর্ণিত হাদীসে রয়েছে- তিনি তার ডান হস্ত দ্বারা তাকে মুছে দিলেন। আর সুফইয়ান (রহঃ) এর সূত্রে আ'মাশ (রহঃ) হতে ইয়াহইয়া (রহঃ) বর্ণিত হাদীসের অবশিষ্টাংশে বর্ণনাকারী বলেছেন- পরে আমি এ হাদীস মানসূর (রহঃ) কে শুনালে তিনি ইবরাহীম (রহঃ) মাসরুক (রহঃ) ও আয়িশাহ (রাযিঃ) হতে হুবহু হাদীস বর্ণনা করে আমাকে শুনালেন। (ইসলামিক ফাউন্ডেশন ৫৫২০, ইসলামিক সেন্টার ৫৫৪৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5709,
			"arabicnumber": "2191.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০২, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০২-(৪৭/...) শইবন ইবনু ফারুখ (রহঃ) .... আয়িশাহ (রাযিঃ) হতে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন রোগ গ্রস্থ ব্যাক্তিকে দেখলে বলতেনঃ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ اشْفِهِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا “সমস্যা বিদূরিত করে দিন হে লোকেদের প্রতিপালনকারী! তাকে সুস্থ করে দিন, আপনিই সুস্থতা দানকারী। আপনার শিফা ব্যতীত কোন শিফা নেই- এমন শিফা, যার পরে কোন রোগ-ব্যাধি বাকী থাকে না।” (ইসলামিক ফাউন্ডেশন ৫৫২১, ইসলামিক সেন্টার ৫৫৪৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5710,
			"arabicnumber": "2191.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৩, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০৩-(৪৮/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ও যুহায়র ইবনু হারব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন রোগগ্রস্ত ব্যক্তির নিকট গেলে তার জন্য দু'আ করতেনঃ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا \"বিপদাপদ সমস্যা বিদূরিত করে দিন হে মানুষের প্রতিপালক আর আরোগ্য দান করুন। আপনিই আরোগ্যদানকারী, আপনার শিফা ছাড়া কোন শিফা নেই; এমন সুস্থতা দিন, যার পরে কোন রোগ-ব্যাধি বাকী না থাকে।\" কিন্তু আবূ বকর (রহঃ) সূত্রে বর্ণিত আছে- তার জন্যে দু'আ করতেন এবং বলতেন .....। এছাড়া তিনি বলেছেন, আর আপনিই সুস্থতা দানকারী। (ইসলামিক ফাউন্ডেশন ৫৫২২, ইসলামিক সেন্টার ৫৫৪৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5711,
			"arabicnumber": "2191.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৪, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০৪-(.../...) কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বর্ণনা (উপরোল্লিখিত) আবূ আওয়ানাহ এবং জারীর (রহঃ) এর হাদীসের অবিকল। (ইসলামিক ফাউন্ডেশন ৫৫২৩, ইসলামিক সেন্টার ৫৫৪৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5712,
			"arabicnumber": "2191.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৫, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০৫-(৪৯/...) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ... আয়িশা (রাযিঃ) হতে বর্ণনা করেন যে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দুয়া দিয়ে ঝাড় ফুঁক করতেন- \"হে জনগণের প্রতিপালক বিপদাপদ সমস্যা বিদূরিত করুন, আপনার কাছেই রয়েছে উপশম। আপনি ছাড়া আর কেউ-ই (বিপদ) দূরকারী নেই।\" (ইসলামিক ফাউন্ডেশন ৫৫২৪, ইসলামিক সেন্টার ৫৫৪৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5713,
			"arabicnumber": "2191.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৬, আন্তর্জাতিক নাম্বারঃ ২১৯১ ৫৬০৬-(.../...) আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) হিশাম (রহঃ) এর সানাদে উপরোল্লিখিত সূত্রে হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫২৫, ইসলামিক সেন্টার ৫৫৫০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5714,
			"arabicnumber": "2192.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৭, আন্তর্জাতিক নাম্বারঃ ২১৯২ ৫৬০৭-(৫০/২১৯২) সুরায়জ ইবনু ইউনুস ও ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরিবারবর্গের কেউ অসুস্থ হয়ে পড়লে তিনি মু'আববিযাত সূরাগুলো পড়ে তাকে ফুঁক দিতেন। পরবর্তীতে তিনি যখন মৃত্যুরোগে আক্রান্ত হলেন তখন আমি তাকে ফুঁক দিতে লাগলাম এবং তার-ই হাত দিয়ে তার দেহটি মুছে দিতে লাগলাম। কেননা, আমার হাতের তুলনায় তার হাত ছিল অনেক বারাকাতপূর্ণ। আর ইয়াহইয়া ইবনু আইয়্যুব মু'আববিযাত দ্বারা ঝাড়ফুঁক করতেন। (ইসলামিক ফাউন্ডেশন ৫৫২৬, ইসলামিক সেন্টার ৫৫৫১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5715,
			"arabicnumber": "2192.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৮, আন্তর্জাতিক নাম্বারঃ ২১৯২ ৫৬০৮-(৫১/…) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসুস্থ হয়ে পড়লে তিনি মু'আববিযাত পাঠ করে স্বশরীরে দম করতেন। তার ব্যাধি কঠিন রূপ ধারণ করলে আমি তা পড়ে তার হাত দ্বারা তার দেহটি মুছে দিতাম ঐ হাতের বারাকাতের আশায়। (ইসলামিক ফাউন্ডেশন ৫৫২৭, ইসলামিক সেন্টার ৫৫৫২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5716,
			"arabicnumber": "2192.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬০৯, আন্তর্জাতিক নাম্বারঃ ২১৯২ ৫৬০৯-(…/...) আবূ তাহির, হারমালাহ, ‘আবদ ইবনু হুমায়দ, মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, উকবাহ ইবনু মুকরাম ও আহমাদ ইবনু উসমান নাওফালী (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে মালিকের সূত্রে অনুরূপ হাদীস বর্ণনা করেছেন। কিন্তু মালিকের হাদীস ছাড়া তাদের কারো হাদীসে 'তার হাতের বারাকাতের আশায়' কথাটি নেই। ইউনুস (রহঃ) ও যিয়াদ (রহঃ) বর্ণিত হাদীসে আছে- নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসুস্থ হয়ে গেলে নিজেকে মু'আববিযাত দ্বারা দম করতেন এবং নিজহস্তে স্বশরীর মুছতেন। (ইসলামিক ফাউন্ডেশন ৫৫২৮, ইসলামিক সেন্টার ৫৫৫৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5717,
			"arabicnumber": "2193.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১০, আন্তর্জাতিক নাম্বারঃ ২১৯৩ ৫৬১০-(৫২/২১৯৩) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আসওয়াদ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়িশাহ্ (রাযিঃ) কে ঝাড়ফুঁক সম্বন্ধে প্রশ্ন করলাম। তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারীদের একটি পরিবারকে যে কোন বিষধর প্রাণীর বিষক্রিয়া হতে মুক্তির জন্যে ঝাড়ফুঁক করার ব্যাপারে অনুমতি দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৫২৯, ইসলামিক সেন্টার ৫৫৫৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5718,
			"arabicnumber": "2193.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১১, আন্তর্জাতিক নাম্বারঃ ২১৯৩ ৫৬১১-(৫৩/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারীদের একটি গৃহের লোকদের বিষাক্ত জন্তুর বিষক্রিয়া থেকে (রোগমুক্তি লাভের আশায়) ঝাড়ফুঁক করতে অনুমতি দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৫৩০, ইসলামিক সেন্টার ৫৫৫৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5719,
			"arabicnumber": "2194",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১২, আন্তর্জাতিক নাম্বারঃ ২১৯৪ ৫৬১২-(৫৪/২১৯৪) আবূ বাকর ইবনু আবূ শাইবাহ্, যুহায়র ইবনু হারব ও ইবনু আবূ উমার (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিয়ম করে ছিলেন যে, মানুষ তার (শরীরের) কোথাও অসুস্থতা অনুভব করলে অথবা তাতে কোন ফোঁড়া বা আঘাতপ্রাপ্ত (হয়ে) থাকলে- রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার আঙ্গুল দ্বারা এ রকম করতেন- (এ কথা বলে এভাবে করার ধরণ বুঝানোর জন্য)। বর্ণনাকার সুফইয়ান (রহঃ) তার বুড়ে আঙ্গুলটি জমিনে রাখলেন- অতঃপর তা তুলে নিলেন এবং সে সময় এ দু'আ পড়তেনبِاسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا অর্থাৎ- আল্লাহর নামে- আমাদের জমিনের ধূলামাটি আমাদের কারো (মুখের) লালার সঙ্গে (মিলিয়ে)- আমাদের পালনকর্তর আদেশে তা দিয়ে আমাদের অসুস্থ ব্যক্তির আরোগ্য লাভের উদ্দেশে (মালিশ করছি)। তবে ইবনু আবূ শাইবাহ্ (রহঃ) (তার বর্ণনাতে) বলেছেন-يُشْفَى 'শিফা দান করা হয়'। এবং যুহায়র (রহঃ) বলেছেন,لِيُشْفَى আমাদের রোগীর সুস্থতা লাভের উদ্দেশে। (ইসলামিক ফাউন্ডেশন ৫৫৩১, ইসলামিক সেন্টার ৫৫৫৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5720,
			"arabicnumber": "2195.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৩, আন্তর্জাতিক নাম্বারঃ ২১৯৫ ৫৬১৩-(৫৫/২১৯৫) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে চোখলাগা হতে (মুক্ত হওয়ার জন্য) ঝাড়ফুঁক করার আদেশ করতেন। (ইসলামিক ফাউন্ডেশন ৫৫৩২, ইসলামিক সেন্টার ৫৫৫৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5721,
			"arabicnumber": "2195.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৪, আন্তর্জাতিক নাম্বারঃ ২১৯৫ ৫৬১৪-(…/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... মিস্'আর (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৩৩, ইসলামিক সেন্টার ৫৫৫৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5722,
			"arabicnumber": "2195.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৫, আন্তর্জাতিক নাম্বারঃ ২১৯৫ ৫৬১৫-(৫৬/...) ইবনু নুমায়র (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে কুদৃষ্টি হতে (বাঁচার জন্য) ঝাড়ফুঁক করার আদেশ করতেন। (ইসলামিক ফাউন্ডেশন ৫৫৩৪, ইসলামিক সেন্টার ৫৫৫৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5723,
			"arabicnumber": "2196.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৬, আন্তর্জাতিক নাম্বারঃ ২১৯৬ ৫৬১৬-(৫৭/২১৯৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে ঝাড়ফুঁকের ব্যাপারে বর্ণিত। তিনি বলেন, বিষাক্ত জন্তুর বিষক্রিয়া, পার্শ্বঘা ও চোখলাগা থেকে (বাঁচার জন্য) ঝাড়ফুঁক করার অনুমতি দেয়া হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫৩৫, ইসলামিক সেন্টার ৫৫৬০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5724,
			"arabicnumber": "2196.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৭, আন্তর্জাতিক নাম্বারঃ ২১৯৬ ৫৬১৭-(৫৮/...) আবূ বাকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুদৃষ্টি লাগা, বিষাক্ত জন্তুর বিষক্রিয়া ও বিষাক্ত পার্শ্বঘা থেকে বেঁচে থাকতে ঝাড়ফুঁকের অনুমতি দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৫৩৬, ইসলামিক সেন্টার ৫৫৬১) সুফইয়ান ইউসুফ ইবনু আবদুল্লাহ ইবনু হারিস এর সূত্রে হাদীস বর্ণিত রয়েছে।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5725,
			"arabicnumber": "2197",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৮, আন্তর্জাতিক নাম্বারঃ ২১৯৭ ৫৬১৮-(৫৯/২১৯৭) আবূ রাবী' সুলাইমান ইবনু দাউদ (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্ত্রী উম্মু সালামাহ্ (রাযিঃ) এর গৃহে একটি বালিকার মুখমণ্ডলে (কালো বা হলুদ) দাগ লক্ষ্য করে বললেন, তার কুদৃষ্টি লেগেছে, তার জন্য ঝাড়ফুঁক করো। অর্থাৎ তার চেহারায় হলুদ দাগ পড়ার কারণে (ইসলামিক ফাউন্ডেশন ৫৫৩৭, ইসলামিক সেন্টার ৫৫৬২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5726,
			"arabicnumber": "2198",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬১৯, আন্তর্জাতিক নাম্বারঃ ২১৯৮ ৫৬১৯-(৬০/২১৯৮) উকবাহ ইবনু মুকরাম আম্মী (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাযম পরিবারকে সাপের ছোবলে আঘাতপ্রাপ্ত রোগীকে ঝাড়ফুঁক করার অনুমতি দেন এবং আসমা বিনতু উমায়স (রাযিঃ) কে বললেন, আমার ভাই জাফার (রাযিঃ) এর ছেলে-মেয়েদের কি হলো যে, তাদের শরীর আমি দুর্বল দেখতে পাচ্ছি? তাদের কি অভাব দেখা দিয়েছে? তিনি (আসমা) বললেন, না কিন্তু তাদের উপর তাড়াতাড়ি কুনযর লেগে যায়। তিনি বললেন, তুমি তাদের ঝাড়-ফুঁক কর। তিনি বললেন, তখন আমি তার নিকট (দু’আটি) উপস্থাপন করলাম। তিনি বললেন, (ঠিক আছে) তুমি তাদের ঝাড়ফুঁক করে দাও। (ইসলামিক ফাউন্ডেশন ৫৫৩৮, ইসলামিক সেন্টার ৫৫৬৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5727,
			"arabicnumber": "2199.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২০, আন্তর্জাতিক নাম্বারঃ ২১৯৯ ৫৬২০-(৬১/২১৯৯) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বানু আমরকে সাপের ছোবলে আক্রান্ত রোগীর ঝাড়ফুঁকের অনুমতি দেন। আবূ যুবায়র (রহঃ) আরও বলেছেন- আমি জাবির ইবনু আবদুল্লাহ (রাযিঃ) কে আরও বলতে শুনেছি যে, একটি বিছা আমাদের এক লোককে ছোবল দিল। আমরা সেথায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসা ছিলাম। তখন এক লোক বলল, হে আল্লাহর রসূল! আমি (তাকে) ঝেড়ে দেই? তিনি বললেন, তোমাদের মধ্যে কোন লোক যদি তার ভাইয়ের (কোনও) উপকার করতে পারে, সে যেন (তা) করে। (ইসলামিক ফাউন্ডেশন ৫৫৩৯, ইসলামিক সেন্টার ৫৫৬৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5728,
			"arabicnumber": "2199.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২১, আন্তর্জাতিক নাম্বারঃ ২১৯৯ ৫৬২১-(.../...) সা'দ ইবনু ইয়াহইয়া উমাবী (রহঃ) ..... ইবনু জুরায়জ (রহঃ) (থেকে) উপরোক্ত সূত্রে অবিকল হাদীস বর্ণনা করেন। তবে তিনি বলেছেন- তখন ব্যক্তিদের মাঝে এক লোক বলল, হে আল্লাহর রসূল! আমি তাকে ঝাড়ফুঁক করতে পারি? তিনি (শুধু) ঝাড়ফুঁক করি বলেননি (বরং 'তাকে' শব্দটিও বলেছেন)। (ইসলামিক ফাউন্ডেশন ৫৫৪০, ইসলামিক সেন্টার ৫৫৬৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5729,
			"arabicnumber": "2199.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২২, আন্তর্জাতিক নাম্বারঃ ২১৯৯ ৫৬২২-(৬২/...) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ সাঈদ আশাজ্জ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার একজন মামা ছিলেন, যিনি বিচ্ছুর ছোবলে ঝাড়ফুঁক করতেন। এ সময় (একদিন) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সব ঝাড়ফুঁক নিষিদ্ধ ঘোষণা করলেন। সে সময় তিনি (আমার মামা) তার খিদমাতে এসে বললেন, হে আল্লাহর রসূল! আপনি ঝাড়ফুঁক হারাম করে দিয়েছেন। হে আল্লাহর রসূল! আমি তো বিছার ছোবল থেকে আত্মরক্ষার্থে ঝাড়ফুঁক করে থাকি? তিনি বললেন, তোমাদের মধ্যে যে কোন ব্যক্তি তার ভাইয়ের কোন উপকার করতে সমর্থ হলে সে যেন তা করে। (ইসলামিক ফাউন্ডেশন ৫৫৪১, ইসলামিক সেন্টার ৫৫৬৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5730,
			"arabicnumber": "2199.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৩, আন্তর্জাতিক নাম্বারঃ ২১৯৯ ৫৬২৩-(.../...) উসমান ইবনু আবূ শাইবাহ্ (রহঃ) ..... আ'মাশ (রহঃ) হতে উপরোল্লিখিত সূত্রে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৪২, ইসলামিক সেন্টার ৫৫৬৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5731,
			"arabicnumber": "2199.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৪, আন্তর্জাতিক নাম্বারঃ ২১৯৯ ৫৬২৪-(৬৩/…) আবূ কুরায়ব (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (এক সময়) ঝাড়ফুঁক নিষিদ্ধ করে দিলেন। অতঃপর আমর ইবনু হাযম সম্প্রদায়ের ব্যক্তিরা এসে বলল, হে আল্লাহর রসূল! আমাদের নিকট একটি ঝাড়ফুঁক ছিল, যা দিয়ে আমরা বিচ্ছুর ছোবলে ঝাড়ফুঁক করতাম, এখন আপনি তো ঝাড়ফুঁক নিষিদ্ধ করে দিয়েছেন। বর্ণনাকারী জাবির (রাযিঃ) বলেন, তারা তা তার নিকট উপস্থাপন করল। তখন তিনি বললেন, কোন সমস্যা দেখতে পাচ্ছি না তোমাদের মধ্যে যে কেউ তার ভাইয়ের কোনও উপকার করতে সমর্থ হলে সে যেন তার উপকার করে। (ইসলামিক ফাউন্ডেশন ৫৫৪৩, ইসলামিক সেন্টার ৫৫৬৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5732,
			"arabicnumber": "2200",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৫, আন্তর্জাতিক নাম্বারঃ ২২০০ ৫৬২৫-(৬৪/২২০০) আবূ তাহির (রহঃ) ..... আওফ ইবনু মালিক আশজা'ঈ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা জাহিলী (মূর্খতার) যুগে (বিভিন্ন) মন্ত্র দিয়ে ঝাড়ফুঁক করতাম। এজন্যে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আবেদন করলাম- হে আল্লাহর রসূল! এক্ষেত্রে আপনার মতামত কি? তিনি বললেন, তোমাদের মন্ত্রগুলো আমার নিকট উপস্থাপন করো, ঝাড়ফুঁকে কোন দোষ নেই- যদি তাতে কোন শিরক (জাতীয় কথা) না থাকে। (ইসলামিক ফাউন্ডেশন ৫৫৪৪, ইসলামিক সেন্টার ৫৫৬৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5733,
			"arabicnumber": "2201.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৬, আন্তর্জাতিক নাম্বারঃ ২২০১ ৫৬২৬-(৬৫/২২০১) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) থেকে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কিছু সংখ্যক সাহাবী কোন এক সফরে ছিলেন, তারা কোন একটি আরব সম্প্রদায়ের বসতির নিকট দিয়ে রাস্তা অতিক্রমকালে তাদের নিকট মেহমানদারীর ব্যাপারে বললেন। কিন্তু তারা তাদের আতিথেয়তা করল না। পরে তাদেরকে তারা বলল, তোমাদের দলে কি কোন ঝাড়ফুঁককারী আছে? কারণ, বসতির সর্দারকে সাপে দংশন করেছে অথবা (বর্ণনাকারীর সংশয় তারা বলল-) বিপদগ্রস্ত হয়েছে। সে সময় এক লোক বলল, হ্যাঁ। তারপরে সে তার নিকট গমন করে সূরা আল-ফাতিহাহ দ্বারা ঝাড়ফুঁক করল। যার দরুন ব্যক্তিটি ভাল হয়ে গেল এবং ঝাড়ফুঁককারীকে বকরীর একটি ক্ষুদ্র পাল দেয়া হলো। সে তা নিতে আপত্তি জানালো এবং সে বলল, যতক্ষণ তা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বর্ণনা না করি— (ততক্ষণ গ্রহণ করতে পারি না)। অতঃপর সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বিষয়টি তার নিকট বর্ণনা করে সে বলল, হে আল্লাহর রসূল! আল্লাহর শপথ আমি ফাতিহাতুল কিতাব ছাড়া ভিন্ন কোন কিছু দিয়ে ঝাড়ফুঁক করিনি। সে সময় তিনি মৃদু হাসলেন এবং বললেন, তুমি কি করে বুঝলে যে, তা দিয়ে ঝাড়ফুঁক করা যায়? অতঃপর বললেন, তাদের নিকট থেকে তা নিয়ে নাও এবং তোমাদের সঙ্গে আমার জন্যও একাংশ রেখো। (ইসলামিক ফাউন্ডেশন ৫৫৪৫, ইসলামিক সেন্টার ৫৫৭০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5734,
			"arabicnumber": "2201.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৭, আন্তর্জাতিক নাম্বারঃ ২২০১ ৫৬২৭-(…/...) মুহাম্মাদ ইবনু বাশশার ও আবূ বাকর ইবনু নাফি (রহঃ) ...... আবূ বিশর (রহঃ) হতে উপরোল্লিখিত সূত্রে বর্ণিত। তিনি বলেন, যে (ওঝা) উম্মুল কুরআন- সূরা আল-ফাতিহাহ পাঠ করতে লাগল এবং তার থু-থু একত্র করে থুক দিতে লাগল। ফলে ব্যক্তিটি সুস্থ হয়ে গেল। (ইসলামিক ফাউন্ডেশন ৫৫৪৬, ইসলামিক সেন্টার ৫৫৭১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5735,
			"arabicnumber": "2201.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৮, আন্তর্জাতিক নাম্বারঃ ২২০১ ৫৬২৮-(৬৬/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা একটি স্থানে নামলাম। অতঃপর আমাদের নিকট একটি মহিলা এসে বলল, এলাকার সর্দারকে সাপে কেটেছে, তোমাদের মাঝে কি কোন ঝাড়ফুঁককারী আছে? সে সময় আমাদের এক লোক উঠে তার সাথে গেল- সে যে সুন্দর ঝাড়ফুঁক করতে পারে তা আমাদের জানা ছিল না। সে সূরা আল-ফাতিহাহ্ দ্বারা তাকে ঝাড়ফুঁক করল। এতে সে সুস্থ হয়ে গেল। তখন তারা তাকে একপাল বকরী দিল এবং আমাদের দুধ পান করাল। আমরা বললাম, তুমি কি ভাল ঝাড়ফুঁক করতে জানতে? সে বলল, আমি তো সূরা আল-ফাতিহাহ ব্যতীত আর কিছু দিয়ে তাকে ঝাড়ফুঁক করিনি। বর্ণনাকারী বলেন, তখন আমি বললাম, তোমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমন না করা পর্যন্ত ঐ বকরীগুলোকে এখান হতে নিয়ে যেও না। তারপরে আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে তার নিকট তা পেশ করলাম। তিনি বললেন, সে-কি করে বুঝল যে, এ সূরাটি দ্বারা ঝাড়ফুঁক করা যায়? তোমরা বকরীগুলো বণ্টন করে নাও এবং আমার জন্যও তোমাদের সাথে একটি অংশ রেখ। (ইসলামিক ফাউন্ডেশন ৫৫৪৭, ইসলামিক সেন্টার ৫৫৭২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5736,
			"arabicnumber": "2201.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬২৯, আন্তর্জাতিক নাম্বারঃ ২২০১ ৫৬২৯-(…/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... হিশাম (রহঃ) এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। তবে তিনি বলেছেন- সে সময় তার সঙ্গে আমাদের এক লোক উঠে দাঁড়াল- যাকে আমরা ঝাঁড়ফুক বিষয়ে (পারদর্শী) মনে করতাম না। (ইসলামিক ফাউন্ডেশন ৫৫৪৮, ইসলামিক সেন্টার ৫৫৭৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5737,
			"arabicnumber": "2202",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩০, আন্তর্জাতিক নাম্বারঃ ২২০২ ৫৬৩০-(৬৭/২২০২) আবূ তাহির ও হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... উসমান ইবনু আবূল আস-সাকাফী (রাযিঃ) হতে বর্ণনা করেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট একটি ব্যথার অভিযোগ করলেন, যা তিনি ইসলাম গ্রহণের পর থেকে তার দেহে অনুভব করছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তোমার শরীরের যে অংশ ব্যথাযুক্ত হয়, তার উপরে তোমার হাত রেখে তিনবার 'বিসমিল্লা-হ' বলবে এবং সাতবার বলবে-أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ \"আল্লাহ এবং তার ক্ষমতার আশ্রয় প্রার্থনা করছি- যা আমি অনুভব করি এবং যা ধারণা করি তার অনিষ্ট হতে।\" (ইসলামিক ফাউন্ডেশন ৫৫৫১, ইসলামিক সেন্টার ৫৫৭৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5738,
			"arabicnumber": "2203.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩১, আন্তর্জাতিক নাম্বারঃ ২২০৩ ৫৬৩১-(৬৮/২২০৩) ইয়াহইয়া ইবনু খালাফ আল-বাহিলী (রহঃ) ..... আবদুল আ'লা (রহঃ) হতে বর্ণনা করেন যে, উসমান ইবনু আবূল আস (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললেন- হে আল্লাহর রসূল! শাইতান আমার, আমার সালাত (সালাত/নামাজ/নামায) ও কিরাআতের মধ্যে বাধা হয়ে দাঁড়ায় এবং সব কিছুতে গোলমাল বাধিয়ে দেয়। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা এক (প্রকারের) শাইতান— যার নাম 'খিনযিব'। যে সময় তুমি তার উপস্থিতি বুঝতে পারবে তখন (আউয়ুবিল্লাহ পড়ে) তার অনিষ্ট হতে আল্লাহর কাছে আশ্রয় চেয়ে তিনবার তোমার বাম পাশে থুথু ফেলবে। তিনি বলেন, তারপরে আমি তা করলাম আর আল্লাহ আমার হতে তা দূর করে দিলেন। (ইসলামিক ফাউন্ডেশন ৫৫৫০, ইসলামিক সেন্টার ৫৫৭৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5739,
			"arabicnumber": "2203.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩২, আন্তর্জাতিক নাম্বারঃ ২২০৩ ৫৬৩২-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... তিনি উসমান ইবনু আবূল আস (রাযিঃ) হতে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলেন। তারপর অবিকল (হাদীস) বর্ণনা করেছেন, কিন্তু সালিম ইবনু নূহ 'তিনবার' এর কথাটি তার হাদীসে বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৫৫১, ইসলামিক সেন্টার ৫৫৭৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5740,
			"arabicnumber": "2203.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৩, আন্তর্জাতিক নাম্বারঃ ২২০৩ ৫৬৩৩-(…/...) মুহাম্মদ ইবনু রাফি (রহঃ) ..... উসমান ইবনু আবূল আস-সাকাফী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! ..... অতঃপর তাদের বর্ণিত হাদীসের অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৫২, ইসলামিক সেন্টার ৫৫৭৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5741,
			"arabicnumber": "2204",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৪, আন্তর্জাতিক নাম্বারঃ ২২০৪ ৫৬৩৪-(৬৯/২২০৪) হারূন ইবনু মা’রূফ এবং আবূ তাহির ও আহমাদ ইবনু ঈসা (রহঃ) ..... জাবির (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তিনি বলেছেন- প্রতিটি ব্যাধির প্রতিকার রয়েছে। অতএব রোগে যথাযথ ঔষধ প্রয়োগ করা হলে আল্লাহর ইচ্ছায় আরোগ্য লাভ হয়। (ইসলামিক ফাউন্ডেশন ৫৫৫৩, ইসলামিক সেন্টার ৫৫৭৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5742,
			"arabicnumber": "2205.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৫, আন্তর্জাতিক নাম্বারঃ ২২০৫ ৫৬৩৫-(৭০/২২০৫) হারূন ইবনু মা’রূফ ও আবূ তাহির (রহঃ) ..... আসিম ইবনু উমার ইবনু কাতাদাহ (রহঃ) বর্ণনা করেন যে, জাবির ইবনু আবদুল্লাহ (রাযিঃ) আল-মুকান্‌না (রহঃ) কে অসুস্থতার দরুন দেখতে গেলেন। কিছুক্ষণ পরে তিনি বললেন- যে পর্যন্ত না তুমি শিঙ্গা লাগাবে সে পর্যন্ত আমি স্থান ত্যাগ করব না। কারণ, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তাতে শিফা রয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫৫৪, ইসলামিক সেন্টার ৫৫৭৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5743,
			"arabicnumber": "2205.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৬, আন্তর্জাতিক নাম্বারঃ ২২০৫ ৫৬৩৬-(৭১/...) নাসর ইবনু ‘আলী জাহযামী (রহঃ) ..... আসিম ইবনু উমার ইবনু কাতাদাহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা জাবির ইবনু আবদুল্লাহ (রাযিঃ) আমাদের পরিবারে এলেন, তখন জনৈক লোক খুঁজলী-পাঁচড়ায় অথবা (বর্ণনা সংশয়)- তিনি বললেন, আঘাতে অসুস্থ হয়েছিল। তিনি বললেন, তুমি কি অসুস্থতাবোধ করছো? সে বলল- আমার খুজলি-পাঁচড়া আমাকে ভয়ঙ্কর অবস্থায় ফেলে দিয়েছে। তিনি তখন (খাদিমকে) বললেন, হে যুবক! আমার নিকট একজন শিঙ্গা প্রয়োগকারী (বৈদ্য) নিয়ে আসো। তখন তিনি তাকে বললেন, বৈদ্যকে দিয়ে আপনি কি করবেন, হে আবূ ‘আবদুল্লাহ? তিনি বললেন, আমি তাতে একটা শিঙ্গার নল ঝুলাতে চাই। সে বলল, আল্লাহর শপথ মাছি আমার শরীরে বসলে কিংবা কাপড়ের ছোয়া আমার শরীরে লাগলে তা-ই আমাকে বেদনা দেয় এবং আমার জন্য কঠিন হয়ে পড়ে— (তাহলে শিঙ্গার বেদনা কি করে সহ্য করবো)? তারপরে তিনি যখন ঐ ব্যাপারে তার ধৈর্যহারা লক্ষ্য করলেন তখন বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তোমাদের ব্যবস্থাপত্রের কোন কিছুতে যদি কল্যাণ থেকে থাকে তাহলে তা শিঙ্গার নল অথবা মধুর শরবত পান অথবা আগুনের সেঁকে রয়েছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আরও) বলেছেন- (নিতান্ত প্রয়োজন না পড়লে) আমি গরম লোহার সেক লাগিয়ে চিকিৎসা করা অপছন্দ করি। বর্ণনাকারী বলেন, সে একজন শিঙ্গাবিদ (বৈদ্য) নিয়ে এলো, সে তার শিঙ্গা লাগাল। ফলে ব্যথানুভূতি বিদূরিত হয়ে গেল। (ইসলামিক ফাউন্ডেশন ৫৫৫৫, ইসলামিক সেন্টার ৫৫৮০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5744,
			"arabicnumber": "2206",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৭, আন্তর্জাতিক নাম্বারঃ ২২০৬ ৫৬৩৭-(৭২/২২০৬) কুতাইবাহ্ ইবনু সাঈদ এবং মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণনা করেন যে, উম্মু সালামাহ্ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শিঙ্গা লাগানোর বিষয়ে অনুমতি চাইলেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে শিঙ্গা লাগিয়ে দেয়ার জন্য আবূ তাইবাহ (রাযিঃ)-কে নির্দেশ করলেন। বর্ণনাকারী বলেন, আমার মনে হয় যে, তিনি (ঊর্ধ্বতন বর্ণনাকারী) বলেছেন যে, সে ছিল তার দুধ ভাই অথবা নাবালক কিশোর। (ইসলামিক ফাউন্ডেশন ৫৫৫৬, ইসলামিক সেন্টার ৫৫৮১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5745,
			"arabicnumber": "2207.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৮, আন্তর্জাতিক নাম্বারঃ ২২০৭ ৫৬৩৮-(৭৩/২২০৭) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শইবাহ (রহঃ) ও আবূ কুরায়ব (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উবাই ইবনু কা'ব (রাযিঃ) এর নিকট জনৈক ডাক্তার প্রেরণ করলেন। সে তার একটি ধমনী কর্তন করে দিল, পরে লোহা গরম করে (রক্ত বন্ধ করার জন্য) তাতে সেঁক দিয়ে দিল। (ইসলামিক ফাউন্ডেশন ৫৫৫৭, ইসলামিক সেন্টার ৫৫৮২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5746,
			"arabicnumber": "2207.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৩৯, আন্তর্জাতিক নাম্বারঃ ২২০৭ ৫৬৩৯-(.../...) উসমান ইবনু আবূ শাইবাহ্ (রহঃ), ইসহাক ইবনু মানসূর (রহঃ) ..... আ'মাশ (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। কিন্তু তিনি 'সে তার একটি ধমনী কর্তন করে দিল' কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৫৫৮, ইসলামিক সেন্টার ৫৫৮৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5747,
			"arabicnumber": "2207.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪০, আন্তর্জাতিক নাম্বারঃ ২২০৭ ৫৬৪০-(৭৪/...) বিশর ইবনু খালিদ ..... আবূ সুফইয়ান (রহঃ) বলেন, আমি জাবির (রাযিঃ) কে বলতে শুনেছি যে, খন্দক যুদ্ধে উবাই (রাযিঃ) এর হাত (কিংবা পা) এর মূল ধমনীতে তীর লাগানো হলো, তাই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে লোহা গরম করে দাগ দিলেন। (ইসলামিক ফাউন্ডেশন ৫৫৫৯, ইসলামিক সেন্টার ৫৫৮৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5748,
			"arabicnumber": "2208",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪১, আন্তর্জাতিক নাম্বারঃ ২২০৮ ৫৬৪১-(৭৫/২২০৮) আহমাদ ইবনু ইউনুস ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, সা'দ ইবনু মু'আয (রাযিঃ) এর মূল রগে তীর লাগানো হলো। বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্বহস্তে একটি তীর ফলক দ্বারা তার রগ কর্তন করে দাগ দিয়ে দিলেন। তারপরে তা ফুলে উঠলে দ্বিতীয়বার দাগ দিয়ে দিলেন। (ইসলামিক ফাউন্ডেশন ৫৫৬০, ইসলামিক সেন্টার ৫৫৮৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5749,
			"arabicnumber": "1202.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪২, আন্তর্জাতিক নাম্বারঃ ১২০২ ৫৬৪২-(৭৬/১২০২) আহমাদ ইবনু সাঈদ ইবনু সাখর দারিমী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে রিওয়ায়াত করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) শিঙ্গা নিলেন ও শিঙ্গাবিদকে তার বিনিময় দিলেন এবং একবার তিনি নাকে ঔষধের ফোটা নিলেন। (ইসলামিক ফাউন্ডেশন ৫৫৬১, ইসলামিক সেন্টার ৫৫৮৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5750,
			"arabicnumber": "1577.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৩, আন্তর্জাতিক নাম্বারঃ ১৫৭৭ ৫৬৪৩-(৭৭/১৫৭৭) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আমর ইবনু আমির আনসারী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আনাস ইবনু মালিক (রাযিঃ) কে বলতে শুনেছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিঙ্গা নিয়েছিলেন- আর তিনি (যথার্থ পারিশ্রমিকও দিয়েছিলেন- কেননা, তিনি) মজুরির বিষয়ে কারো প্রতি যুলুম করতেন না। (ইসলামিক ফাউন্ডেশন ৫৫৬২, ইসলামিক সেন্টার ৫৫৮৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5751,
			"arabicnumber": "2209.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৪, আন্তর্জাতিক নাম্বারঃ ২২০৯ ৫৬৪৪-(৭৮/২২০৯) যুহায়র ইবনু হারব (রহঃ) ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করেন যে, তিনি বলেছেনঃ জ্বর হলো জাহান্নামের উত্তাপ, তাই পানি দিয়ে তাকে শীতল করো। (ইসলামিক ফাউন্ডেশন ৫৫৬৩, ইসলামিক সেন্টার ৫৫৮৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5752,
			"arabicnumber": "2209.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৫, আন্তর্জাতিক নাম্বারঃ ২২০৯ ৫৬৪৫-(.../...) ইবনু নুমায়র ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, জ্বরের প্রচণ্ডতা আসে জাহান্নামের তাপ হতে। তাই পানি দিয়ে তোমরা তাকে শীতল করবে। (ইসলামিক ফাউন্ডেশন ৫৫৬৪, ইসলামিক সেন্টার ৫৫৮৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5753,
			"arabicnumber": "2209.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৬, আন্তর্জাতিক নাম্বারঃ ২২০৯ ৫৬৪৬-(৭৯/...) হারূন ইবনু সা’ঈদ আইলী ও মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইবনু উমার (রাযিঃ) বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জ্বর জাহান্নামের সঞ্চিত উত্তাপ; তাই তাকে পানি দিয়ে নিভিয়ে দাও। (ইসলামিক ফাউন্ডেশন ৫৫৬৫, ইসলামিক সেন্টার ৫৫৯০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5754,
			"arabicnumber": "2209.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৭, আন্তর্জাতিক নাম্বারঃ ২২০৯ ৫৬৪৭-(৮০/...) আহমাদ ইবনু আবদুল্লাহ ইবনু হাকাম (রহঃ) এবং হারূন ইবনু আবদুল্লাহ (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে রিওয়ায়াত করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জ্বর জাহান্নামের সঞ্চিত উত্তাপ; তাই তাকে পানি দিয়ে শীতল করে দাও। (ইসলামিক ফাউন্ডেশন ৫৫৬৬, ইসলামিক সেন্টার ৫৫৯১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5755,
			"arabicnumber": "2210.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৮, আন্তর্জাতিক নাম্বারঃ ২২১০ ৫৬৪৮-(৮১/২২১০) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে রিওয়ায়াত করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জ্বর জাহান্নামের সঞ্চিত উত্তাপ; তাই তাকে পানি দ্বারা শীতল করো। (ইসলামিক ফাউন্ডেশন ৫৫৬৭, ইসলামিক সেন্টার ৫৫৯২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5756,
			"arabicnumber": "2210.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৪৯, আন্তর্জাতিক নাম্বারঃ ২২১০ ৫৬৪৯-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... হিশাম (রহঃ) হতে উপরোল্লিখিত সূত্রে অবিকল রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৬৮, ইসলামিক সেন্টার ৫৫৯৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5757,
			"arabicnumber": "2211.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫০, আন্তর্জাতিক নাম্বারঃ ২২১১ ৫৬৫০-(৮৬/২২১১) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আসমা (রাঃ) হতে বর্ণিত যে, তার নিকট জ্বরাক্রান্ত কোন স্ত্রীলোককে নিয়ে আসা হলে তিনি পানি নিয়ে আসতে বলতেন। এরপর তা তার বক্ষের উপর ঢেলে দিতেন এবং বলতেন- রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তাকে পানি দিয়ে শীতল করো। তিনি আরও বলেছেন, তা জাহান্নামের সঞ্চিত উত্তাপ। (ইসলামিক ফাউন্ডেশন ৫৫৬৯, ইসলামিক সেন্টার ৫৫৯৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5758,
			"arabicnumber": "2211.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫১, আন্তর্জাতিক নাম্বারঃ ২২১১ ৫৬৫১-(.../...) আবূ কুরায়ব (রহঃ) ..... হিশাম (রহঃ) হতে উপরোল্লিখিত সূত্রে হাদীস রিওয়ায়াত করেছেন। তবে [আবূ কুরায়ব (রহঃ) এর ঊর্ধ্বতন বর্ণনাকারী] ইবনু নুমায়র (রহঃ) এর বর্ণিত হাদীসে আছে 'তার (রোগিনী) ও তার জামার ফাঁকা জায়গার মধ্যে পানি প্রবাহিত করে দিতেন'। আর (অন্য ঊর্ধ্বতন বর্ণনাকারী) উসামাহ্ (রহঃ) এর হাদীসে তা জাহান্নামের সঞ্চিত তাপ কথাটি তিনি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৫৭০, ইসলামিক সেন্টার ৫৫৯৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5759,
			"arabicnumber": "2212.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫২, আন্তর্জাতিক নাম্বারঃ ২২১২ ৫৬৫২-(৮৩/২২১২) হান্নাদ ইবনু সারী (রহঃ) ..... আবায়াহ্ ইবনু রিফা'আহ্ (রহঃ) এর সানাদে তার দাদা রাফি ইবনু খাদীজ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমি বলতে শুনেছি যে, জ্বর জাহান্নামের তীব্র উত্তাপের অংশ বিশেষ, তাই তোমরা তাকে পানি দ্বারা শীতল করো। (ইসলামিক ফাউন্ডেশন ৫৫৭১, ইসলামিক সেন্টার ৫৫৯৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5760,
			"arabicnumber": "2212.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫৩, আন্তর্জাতিক নাম্বারঃ ২২১২ ৫৬৫৩-(৮৪/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... মুহাম্মাদ ইবনুল মুসান্না (রহঃ), মুহাম্মাদ ইবনু হাতিম (রহঃ) ও আবূ বাকর ইবনু নাফি’ (রহঃ) ..... রাফি ইবনু খাদীজ (রাযিঃ) রিওয়ায়াত করেন, তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, জ্বর জাহান্নামের উত্তাপ হতে (উদ্ভূত)। তাই তোমাদের পক্ষ হতে তাকে পানি দিয়ে শীতল করো। তবে বর্ণনাকারী আবূ বাকর (রহঃ) 'তোমাদের পক্ষ হতে' অংশটুকু বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৫৭২, ইসলামিক সেন্টার ৫৫৯৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5761,
			"arabicnumber": "2213",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫৪, আন্তর্জাতিক নাম্বারঃ ২২১৩ ৫৬৫৪-(৮৫/২২১৩) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অসুস্থতার সময় তার মুখের কিনারায় ঔষধ ঢেলে দিলাম; তখন তিনি ইঙ্গিত করলেন যে, আমার মুখে ওষুধ দিও না। আমরা বললাম, এটা ওষুধের প্রতি রোগীর অনীহার কারণ। অতঃপর যখন তিনি জ্ঞান ফিরে পেলেন, তখন বললেন, তোমাদের সবার মুখের কিনারায় ওষুধ ঢেলে দেয়া হবে- তবে আব্বাস ছাড়া; কেননা তিনি তোমাদের মাঝে উপস্থিত ছিলেন না। (ইসলামিক ফাউন্ডেশন ৫৫৭৩, ইসলামিক সেন্টার ৫৫৯৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5763,
			"arabicnumber": "2214.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5765,
			"arabicnumber": "287.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫৮, আন্তর্জাতিক নাম্বারঃ ২২১৪ ৫৬৫৮-(…/২৮৭) বর্ণনাকারী উবাইদুল্লাহ বলেন, তিনি আমাকে আরও জানিয়েছেন যে, তার ঐ ছেলেটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোলে প্রস্রাব করে দিল। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সামান্য পানি নিয়ে আসতে বললেন এবং তিনি প্রস্রাবের উপর ঢেলে দিলেন, কিন্তু একেবারে পুরোপুরি তা ধুলেন না। (ইসলামিক ফাউন্ডেশন ৫৫৭৫, ইসলামিক সেন্টার ৫৬০০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5766,
			"arabicnumber": "2215.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৫৯, আন্তর্জাতিক নাম্বারঃ ২২১৫ ৫৬৫৯-(৮৮/২২১৫) মুহাম্মাদ ইবনু রুমহ ইবনু মুহাজির (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) বর্ণনা করেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, কালো জিরায় সকল প্রকার রোগের উপশম আছে- তবে 'আসসাম’ ব্যতীত। আর আসসা-ম' হলো মৃত্যু। আর আল হাব্বাতুস সাওদা হলো (স্থানীয় ভাষায়) শূনীয' (অর্থাৎ কালো জিরা)। (ইসলামিক ফাউন্ডেশন ৫৫৭৬, ইসলামিক সেন্টার ৫৬০১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5767,
			"arabicnumber": "2215.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬০, আন্তর্জাতিক নাম্বারঃ ২২১৫ ৫৬৬০-(…/...) আবূ তাহির (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (পূর্বোক্ত) উকায়ল (রহঃ) এর হাদীসের অবিকল হাদীস বর্ণনা করেছেন। তবে (দ্বিতীয় সানাদে) সুফইয়ান (রহঃ) ও (প্রথম সূত্রে) ইউনুস (রহঃ) এর হাদীসে আল হাব্বাতুস সাওদা রয়েছে। (তার বিশ্লেষণে) তিনি 'শূনীয' শব্দটি বলেননি। (ইসলামিক ফাউন্ডেশন ৫৫৭৬, ইসলামিক সেন্টার ৫৬০২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5768,
			"arabicnumber": "2215.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬১, আন্তর্জাতিক নাম্বারঃ ২২১৫ ৫৬৬১-(৮৯/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ ও ইবনু হুজর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত্যু ছাড়া এমন কোন রোগ নেই কালো জিরায় যার আরোগ্যতা নেই। (ইসলামিক ফাউন্ডেশন ৫৫১৫, ইসলামিক সেন্টার ৫৬০৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5769,
			"arabicnumber": "2216",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬২, আন্তর্জাতিক নাম্বারঃ ২২১৬ ৫৬৬২-(৯০/২২১৬) “আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স ইবনু সা'দ (রহঃ) উরওয়াহ্ (রহঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়িশাহ্ (রাযিঃ) হতে বর্ণনা করেন যে, তার নীতি ছিল যে, যখন তার পরিবারের কোন ব্যক্তি মৃত্যুবরণ করতো এবং সে প্রেক্ষিতে মহিলাগণ একত্রিত হত, তারপরে পরিবারের লোক ও বিশিষ্ট (আত্মীয়) ছাড়া অবশিষ্টরা চলে যেত, তখন তিনি এক ডেকচি তালবীনা রান্না করার আদেশ দিতেন। তা রান্না করা হত; অতঃপর ‘সারীদ’ প্রস্তুত করে তালবীনাহ্ তার উপর ঢেলে দেয়া হত। অতঃপর তিনি বলতেন, এটা হতে তোমরা খাও। কারণ আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি তালবীনাহ রোগীর মনে প্রশান্তি দেয় এবং দুঃখ কিছুটা লাঘব করে। (ইসলামিক ফাউন্ডেশন ৫৫৭৮, ইসলামিক সেন্টার ৫৬০৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5770,
			"arabicnumber": "2217.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৩, আন্তর্জাতিক নাম্বারঃ ২২১৭ ৫৬৬৩-(৯১/২২১৭) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, আমার ভাইয়ের উদরাময় হচ্ছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে মধু পান করাও। সে তাকে মধুপান করালো। তারপর এসে বলল, আমি তাকে মধু পান করিয়েছি কিন্তু তার পীড়া আরও বেড়ে গেছে। তিনি এভাবে তাকে তিনবার বললেন। অতঃপর লোকটি চতুর্থবার এসে বললে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাকে মধু পান করাও। লোকটি বলল, মধুপান করিয়েছি কিন্তু উদরাময় ক্রমশই বৃদ্ধি পাচ্ছে। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আল্লাহই সত্য বলেছেন, তোমার ভাইয়ের পেটের যন্ত্রণাটি মিথ্যা। অতঃপর পুনরায় তাকে পান করালে সুস্থ হয়ে গেল। (ইসলামিক ফাউন্ডেশন ৫৫৭৯, ইসলামিক সেন্টার ৫৬০৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5771,
			"arabicnumber": "2217.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৪, আন্তর্জাতিক নাম্বারঃ ২২১৭ ৫৬৬৪-(…/...) আমর ইবনু যুররাহ্ (রহঃ) ….. আবূ সাঈদ খুদরী (রাযিঃ) বর্ণনা করেন, জনৈক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, আমার ভাইয়ের উদরাময় হয়েছে। তিনি বললেন, তাকে মধু পান করাও। ... হাদীসের বাকী অংশটুকু শু’বাহ বর্ণিত হাদীসের অর্থেই বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৫৭৯, ইসলামিক সেন্টার ৫৬০৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5772,
			"arabicnumber": "2218.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৫, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৬৫-(৯২/২২১৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আমির (রহঃ) হতে বর্ণিত। তিনি তার আব্বা সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) উসামাহ্ ইবনু যায়দ (রাযিঃ) কে এ মর্মে প্রশ্ন করতে শুনেছেন যে, আপনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্লেগ সম্বন্ধে কি শুনেছেন? তখন উসামাহ্ (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্লেগ একটি আযাব যা বনী ইসরাঈল অথবা (বর্ণনা সংশয়) যারা তোমাদের আগে ছিল তাদের উপরে প্রেরণ করা হয়েছিল। অতএব তোমরা কোন মহল্লায় প্লেগের ব্যাপারে শুনলে সেখানে যেও না। আর কোন এলাকায় প্লেগ চোখে পড়লে এবং তোমরা সেখানে অবস্থানরত থাকলে সেখান হতে বের হয়ে যাবে না। বর্ণনাকারী আবূ নাযর (রহঃ) বলেছেন, শুধু পলায়নের লক্ষ্যে সে জায়গা ছেড়ে যেও না। (ইসলামিক ফাউন্ডেশন ৫৫৮০, ইসলামিক সেন্টার ৫৬০৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5773,
			"arabicnumber": "2218.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৬, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৬৬-(৯৩/...) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... উসামাহ ইবনু যায়দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্লেগ শাস্তির প্রতীক। মহীয়ান গরীয়ান আল্লাহ তা'আলা তা দ্বারা তার বান্দাদের কতিপয় ব্যক্তিকে পরীক্ষায় ফেলেছেন। তাই কোন অঞ্চলে এর প্রভাবের খবর পেলে তোমরা সেথায় যেও না এবং তোমরা কোন অঞ্চলে অবস্থানকালে সেখানে প্লেগ লক্ষ্য করলে সেখান থেকে পালিয়ে যাবে না। এ বর্ণনা কা'নাব (রহঃ) এর। আর কুতাইবাহ্ (রহঃ) এর বর্ণনাও সে রকম। (ইসলামিক ফাউন্ডেশন ৫৫৮১, ইসলামিক সেন্টার ৫৬০৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5774,
			"arabicnumber": "2218.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৭, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৬৭-(৯৪/...) মুহাম্মাদ ইবনু ‘আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... উসামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এ প্লেগ একটি গযব, যা তোমাদের পূর্বেকার লোকদের উপরে অথবা বনী ইসরাঈলের উপরে চাপিয়ে দেয়া হয়েছিল। সুতরাং কোন অঞ্চলে তা লক্ষ্য করলে তা থেকে পালানোর জন্য সে অঞ্চল ছেড়ে যেও না এবং কোন অঞ্চলে প্লেগ লক্ষ্য করলে সেথায় অনুপ্রবেশও করো না। (ইসলামিক ফাউন্ডেশন ৫৫৮২, ইসলামিক সেন্টার ৫৬০৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5775,
			"arabicnumber": "2218.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৮, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৬৮-(৯৫/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আমির ইবনু সা'দ (রহঃ) হতে বর্ণিত। জনৈক লোক সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) কে প্লেগ সম্বন্ধে প্রশ্ন করলে উসামাহ্ ইবনু যায়দ (রাযিঃ) বললেন, আমি সে ব্যাপারে তোমাকে সংবাদ দিচ্ছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তা একটি গযব অথবা একটি মহামারী যা আল্লাহ তা'আলা বনী ইসরাঈলের একটি উপদল কিংবা তোমাদের পূর্বেকার কোন একদল ব্যক্তির উপরে প্রেরণ করেছিলেন। অতএব কোন অঞ্চলে তার কথা তোমরা জানলে সেথায় তোমরা প্রবেশ করো না; তদ্রুপ কোন অঞ্চলে তোমাদের উপর তা এসে পড়লে সেখান থেকে পালিয়ে যেও না। (ইসলামিক ফাউন্ডেশন ৫৫৮৩, ইসলামিক সেন্টার ৫৬১০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5776,
			"arabicnumber": "2218.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৬৯, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৬৯-(…/...) আবূ রাবী' সুলাইমান ইবনু দাউদ, কুতাইবাহ ইবনু সাঈদ ও আবূ বাকর ইবনু আবূ শাইবাহ (রাযিঃ) আমর ইবনু দীনার (রহঃ) হতে ইবনু জুরায়জ (রহঃ) এর সূত্রে তার বর্ণিত হাদীসের অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৮৪, ইসলামিক সেন্টার ৫৬১১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5777,
			"arabicnumber": "2218.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭০, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭০-(৯৬/...) আবূ তাহির আহমাদ ইবনু আমর ও হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... উসামাহ্ ইবনু যায়দ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করেন যে, তিনি বলেছেন, এ রোগ একটি মহামারী যা দ্বারা তোমাদের পূর্ববর্তী অনেক উম্মাতকে শাস্তি দেয়া হয়েছে। অতঃপর তা জমিনেই রয়ে গেছে, তাই এক সময় তা চলে যায় ও আরেক সময় তা ফিরে আসে। অতএব যে লোক কোন অঞ্চলে এ রোগের কথা শুনতে পায় সে যেন কোনক্রমেই সেখানে না যায়, আর যে লোক কোথাও থাকা অবস্থায় সেথায় তা এসে পড়ে সেখান হতে যেন সে পালিয়ে না যায়। (ইসলামিক ফাউন্ডেশন ৫৫৮৫, ইসলামিক সেন্টার ৫৬১২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5778,
			"arabicnumber": "2218.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭১, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭১-(.../...) আবূ কামিল জাহদারী (রহঃ) ..... যুহরী (রহঃ) হতে ইউনুস (রহঃ) এর সূত্রে তার বর্ণিত হাদীসের অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৮৬, ইসলামিক সেন্টার ৫৬১৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5779,
			"arabicnumber": "2218.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭২, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭২-(৯৭/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... হাবীব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা মদীনায় ছিলাম। তখন আমার নিকট সংবাদ আসলো যে, কুফায় প্লেগের প্রাদুর্ভাব হয়েছে। তখন 'আতা ইবনু ইয়াসার (রাযিঃ) প্রমুখ সহাবাগণ আমাকে বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তুমি কোন অঞ্চলে অবস্থান করবে সেখানে তা প্রকাশ পেলে সেখান থেকে বের হয়ো না। আর যদি তোমার নিকট খবর পৌছে যে, তা কোন অঞ্চলে রয়েছে, তাহলে সেখানে গমন করো না। বর্ণনাকারী বলেন, আমি বললাম-এ বর্ণনা কার পক্ষ হতে? তারা বললেন, 'আমির ইবনু সা'দ (রহঃ) হতে তিনি তা বর্ণনা করে থাকেন। বর্ণনাকারী বলেন, তখন আমি তার নিকট গেলাম। তারা বলল, তিনি গৃহে নেই। তখন আমি তার ভাই ইবরাহীম ইবনু সা'দ (রহঃ) এর সঙ্গে সাক্ষাৎ করে তাকে প্রশ্ন করলাম। তিনি বললেন, উসামাহ (রাযিঃ) যখন সা'দকে হাদীস শুনাচ্ছিলেন, তখন আমি উপস্থিত ছিলাম। তিনি বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, এ রোগ একটি মহামারী অথবা একটি আযাব কিংবা 'আযাবের অবশিষ্টাংশ' যা দ্বারা তোমাদের পূর্বেকার কতিপয় লোককে শাস্তি দেয়া হয়েছিল। অতএব কোন অঞ্চলে তোমাদের অবস্থানকালে যদি তা থাকে সে সময় সেখান থেকে তোমরা বের হয়ো না। আর যদি তোমাদের নিকট খবর আসে যে, তা কোন অঞ্চলে দেখা দিয়েছে, তবে সেখানে গমন করো না। হাবীব (রহঃ) বলেন, তখন আমি ইবরাহীম (রহঃ) কে বললাম, আপনি কি শুনেছেন যখন উসামাহ্ (রাযিঃ) সা'দ (রাযিঃ) এর নিকট হাদীস বর্ণনা করছিলেন, আর তিনি তা অস্বীকার করেননি? তিনি বললেন, হ্যাঁ। (ইসলামিক ফাউন্ডেশন ৫৫৮৭, ইসলামিক সেন্টার ৫৬১৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5780,
			"arabicnumber": "2218.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৩, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭৩-(…/...) উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ..... শু'বাহ্ (রহঃ) এর সূত্রে হাদীস রিওয়ায়াত করেছেন। তবে তিনি হাদীসের শুরুতে 'আতা ইবনু ইয়াসার (রহঃ) সম্পর্কিত ঘটনা পেশ করেননি। (ইসলামিক ফাউন্ডেশন ৫৫৮৮, ইসলামিক সেন্টার ৫৬১৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5781,
			"arabicnumber": "2218.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৪, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭৪-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... সা'দ ইবনু মালিক (রাযিঃ) খুযাইমাহ্ ইবনু সাবিত (রাযিঃ) ও উসামাহ্ ইবনু যায়দ (রাযিঃ) হতে বর্ণিত। তারা বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অতঃপর শু'বাহ্ (রহঃ) এর হাদীসের অনুরূপ অর্থবোধক হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৮৯, ইসলামিক সেন্টার ৫৬১৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5782,
			"arabicnumber": "2218.11",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৫, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭৫-(…/...) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ইবরাহীম ইবনু সা'দ ইবনু আবূ ওয়াক্কাস (রহঃ) হতে বর্ণিত। তিনি বলেন, উসামাহ্ ইবনু যায়দ (রাযিঃ) ও সা'দ (রাযিঃ) বসে বসে আলাপ করছিলেন। তারা উভয়ে বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (পূর্বোল্লেখিত) বর্ণনাকারীদের হাদীসের মতো। (ইসলামিক ফাউন্ডেশন ৫৫৯০, ইসলামিক সেন্টার ৫৬১৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5783,
			"arabicnumber": "2218.12",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৬, আন্তর্জাতিক নাম্বারঃ ২২১৮ ৫৬৭৬-(.../...) ওয়াহব ইবনু বাকিয়্যাহ (রহঃ) ..... ইবরাহীম ইবনু সা'দ ইবনু মালিক (রাযিঃ) তাঁর পিতা (সা’দ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোল্লিখিত বর্ণনাকারীদের হাদীসের হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৯০, ইসলামিক সেন্টার ৫৬১৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5784,
			"arabicnumber": "2219.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৭, আন্তর্জাতিক নাম্বারঃ ২২১৯ ৫৬৭৭-(৯৮/২২১৯) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) হতে রিওয়ায়াত করেন যে, উমার (রাযিঃ) শামের (সিরিয়ার) দিকে রওয়ানা হলেন। 'সারগ' নামক স্থান পর্যন্ত পৌছলে 'আজনাদ' অধিবাসীদের (প্রতিনিধি ও অধিনায়ক) আবূ উবাইদাহ ইবনু জাররাহ ও তার সহকর্মীগণ তার সাথে দেখা করলেন। তখন তারা সংবাদ দিলেন যে, শামে মহামারী আরম্ভ হয়েছে। ইবনু আব্বাস (রাযিঃ) বলেন, তখন উমার (রাযিঃ) বললেন- প্রাথমিক যুগের মুহাজিরদের আমার নিকট ডেকে আন। আমি তাদের ডেকে নিয়ে আসলে তিনি তাদেরকে সংবাদ দিলেন যে, শামে মহামারী আরম্ভ হয়ে গেছে। এ বিষয়ে তাদের কাছ থেকে পরামর্শ চাইলেন। অতঃপর তারা দ্বন্দ্বে পড়ে গেল। তাদের কেউ কেউ বলল, আপনি একটা বিশেষ কাজের উদ্দেশে বের হয়েছেন, তাই আমরা আপনার ফিরে যাওয়া যথাযথ মনে করি না। আর কেউ কেউ বললেন, আপনার সঙ্গে অনেক প্রবীণ লোক এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ রয়েছেন। তাই আমরা তাদেরকে এ মহামারীর সম্মুখে ছেড়ে দেয়া যুক্তিসঙ্গত মনে করি না। তিনি বললেন, আপনারা উঠুন! তারপর বললেন, আনসারীদের আমার নিকট ডেকে আনো। আমি তাদেরকে তার নিকট ডেকে নিয়ে আসলে তিনি তাদের কাছেও পরামর্শ চাইলেন। তারা মুহাজিরদের পন্থা অনুকরণ করলেন এবং মুহাজিরগণের মতো তাদের মধ্যেও দ্বিমত সৃষ্টি হলো। তিনি বললেন, আপনারা উঠুন। তারপর তিনি বললেন, (মক্কাহ) বিজয়ের পূর্বে হিজরতকারী কুরায়শের মুরুব্বীদের যারা এখানে আছেন, তাদের আমার নিকট পাঠাও। আমি তাদেরকে ডেকে আনলাম। তাদের দুজনও কিন্তু ভিন্নমত পোষণ করলেন না। তারা (সকলেই) বললেন, আমরা যুক্তিযুক্ত মনে করি যে, আপনি লোকদের নিয়ে ফিরে যান এবং তাদেরকে এ মহামারীর দিকে ঠেলে দিবেন না। তখন উমার (রাযিঃ) লোকদের মাঝে ঘোষণা দিলেন, আমি ভোরে সওয়ারীর উপর থাকবো, তোমরাও ভোরে সওয়ারীর উপর আরোহণ করবে। তখন আবূ উবাইদাহ ইবনু জাররাহ (রাযিঃ) বললেন, আল্লাহর তাকদীর হতে ভেগে যাওয়া? তখন উমার (রাযিঃ) বললেন, হে আবূ উবাইদাহ! তুমি ছাড়া অন্য কেউ এমন বললে, (রাবী বলেন) উমার (রাযিঃ) তার বিরুদ্ধাচরণ অপছন্দ করতেন। (তিনি বললেন) হ্যাঁ! আমরা আল্লাহর তাকদীর হতে আল্লাহরই তাকদীরের দিকে পলায়ন করছি। তোমার যদি একপাল উট থাকে আর তুমি একটি উপত্যকায় অবতীর্ণ হও যার দুটি প্রান্তর রয়েছে, যার একটু সবুজ শ্যামল, অপরটি তৃণশূন্য; সে ক্ষেত্রে তুমি যদি সবুজ শ্যামল প্রান্তরে (উট) চরাও, তাহলে আল্লাহর তাকদীরেই সেখানে চরাবে আর যদি তৃণশূন্য প্রান্তরে চরাও, তাহলেও আল্লাহর তাকদীরেই সেখানে চরাবে। রাবী বলেন, এ সময় 'আব্দুর রহমান ইবনু আওফ (রাযিঃ) এলেন, তিনি (এতক্ষণ) তার কোন প্রয়োজনে অনুপস্থিত ছিলেন। তিনি বললেন, এ বিষয়ে আমার নিকট (হাদীসের) ইলম রয়েছে। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যখন তোমরা কোন এলাকায় সেটার খবর শুনতে পাও, তখন তার উপরে (দুঃসাহস দেখিয়ে) এগিয়ে যেয়ো না। আর যখন কোন দেশে তোমাদের সেখানে থাকা অবস্থায় তা দেখা দেয়, তখন তা হতে পলায়ন করে বেরিয়ে পড়ো না। বর্ণনাকারী বলেন, তখন উমর (রাযিঃ) আল্লাহর প্রশংসা করলেন। অতঃপর চলে গেলেন। (ইসলামিক ফাউন্ডেশন ৫৫৯১, ইসলামিক সেন্টার ৫৬১৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5785,
			"arabicnumber": "2219.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৮, আন্তর্জাতিক নাম্বারঃ ২২১৯ ৫৬৭৮-(৯৯/...) ইসহাক ইবনু ইবরাহীম (রহঃ), মুহাম্মাদ ইবনু রাফি ও আবদ ইবনু হুমায়দ (রহঃ) মা'মার (রহঃ) উপরোক্ত সূত্রে মালিক (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। মা'মার (রহঃ) এর হাদীসে অতিরিক্ত বলেছেন। বর্ণনাকারী বলেন [উমার (রাযিঃ)] আবূ উবাইদাহকে আরো বললেন, বলো তো, সে যদি তৃণশূন্য উপত্যকায় চড়ায় আর সবুজ শ্যামল উপত্যকা পরিত্যাগ করে তাহলে তুমি কি তাকে ব্যর্থ সাব্যস্ত করবে? তিনি বললেন, হ্যাঁ! তিনি বললেন, তাহলে এবার চলো। বর্ণনাকারী বলেন, পরবর্তীতে সফর করে তিনি মদীনায় এসে বললেন, এটি অবস্থান স্থল অথবা তিনি বললেন, ইনশাআল্লাহ, এটি অবতরণ স্থল। (ইসলামিক ফাউন্ডেশন ৫৫৯২, ইসলামিক সেন্টার ৫৬২০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5786,
			"arabicnumber": "2219.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৭৯, আন্তর্জাতিক নাম্বারঃ ২২১৯ ৫৬৭৯-(…/...) আবূ তাহির (রহঃ) ও হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ইবনু শিহাব (রহঃ) হতে উপরোল্লিখিত সানাদে হাদীস রিওয়ায়াত করেছেন। তবে তিনি বলেছেন, আবদুল্লাহ ইবনুল হারিস এটি বর্ণনা করেছেন। তিনি বলেননি যে, আবদুল্লাহ ইবনু আবদুল্লাহ বর্ণনা করেছেন (ইসলামিক ফাউন্ডেশন ৫৫৯২, ইসলামিক সেন্টার ৫৬২১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5787,
			"arabicnumber": "2219.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮০, আন্তর্জাতিক নাম্বারঃ ২২১৯ ৫৬৮০-(১০০/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু আমির ইবনু রাবী'আহ হতে বর্ণিত যে, উমার (রাযিঃ) শামের দিকে সফরে বের হলেন, 'সারগ' পর্যন্ত গমন করলে তার নিকটে (খবর) আসল যে, শামে মহামারী লক্ষ্য করা গেছে। তখন আবদুর রহমান ইবনু আওফ (রাযিঃ) তাকে সংবাদ দিলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যখন কোন অঞ্চলে মহামারীর (সংবাদ) শুনবে, তখন তার দিকে অগ্রসর হবে না। আর যখন কোন অঞ্চলে সেটা দেখা দিবে, আর তোমরা সেখানে রয়েছো, তাহলে সেখান থেকে পালিয়ে বের হয়ে যেও না। অতঃপর উমার ইবনুল খাত্তাব (রাযিঃ) সার্‌গ হতে প্রত্যাবর্তন করলেন। সালিম ইবনু আবদুল্লাহ (ইবনু উমার) (রাযিঃ) হতে ইবনু শিহাব (রহঃ) এর বর্ণনাতে রয়েছে যে, আবদুর রহমান ইবনু ‘আওফ (রাযিঃ) এর হাদীসের অনুসরণে উমার (রাযিঃ) লোকদের নিয়ে প্রত্যাবর্তন করেছিলেন। (ইসলামিক ফাউন্ডেশন ৫৫৯৩, ইসলামিক সেন্টার ৫৬২২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5788,
			"arabicnumber": "2220.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮১, আন্তর্জাতিক নাম্বারঃ ২২২০ ৫৬৮১-(১০১/২২২০) আবূ তাহির ও হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। (এ হাদীস সে সময়ের) যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সংক্রামক ব্যাধি, ক্ষুধায় পেট কামড়ানো পোকা (বা সফর মাসের অগ্রপশ্চাৎকরণ) ও মৃত মানুষের আত্মা হতে পেচার জন্ম বলতে কিছু নেই। সে সময় জনৈক বেদুঈন বলল, হে আল্লাহর রসূল! তাহলে সে উট পালের কি অবস্থা, যা কোন বালুকাময় ভূমিতে থাকে যা ব্যাধমুক্ত, বলবান। অতঃপর সেখানে খোচ-পাঁচড়া আক্রান্ত (কোন) উট এসে তাদের মধ্যে প্রবেশ করে তাদের সবগুলোকে পাঁচড়ায় আক্রান্ত করে দেয়? তিনি বললেন, তাহলে প্রথম (উট)টিকে কে সংক্রমিত করেছিল? (ইসলামিক ফাউন্ডেশন ৫৫৯৪, ইসলামিক সেন্টার ৫৬২৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5789,
			"arabicnumber": "2220.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮২, আন্তর্জাতিক নাম্বারঃ ২২২০ ৫৬৮২-(১০২/...) মুহাম্মাদ ইবনু হাতিম ও হাসান আল হুলওয়ানী (রহঃ) আবূ সালামাহ ইবনু আবদুর রহমান ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রামক ব্যাধি, কুলক্ষণ, অনাহারে পেট কামড়ানো পোকা ও হামাহ- এসবের কোন অস্তিত্ব নেই। সে সময় জনৈক বেদুঈন আরব বলল, হে আল্লাহর রসূল! বর্ণনাকার ইউনুস (রহঃ) কর্তৃক রিওয়ায়াতকৃত হাদীসের অবিকল। (ইসলামিক ফাউন্ডেশন ৫৫৯৫, ইসলামিক সেন্টার ৫৬২৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5790,
			"arabicnumber": "2220.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৩, আন্তর্জাতিক নাম্বারঃ ২২২০ ৫৬৮৩-(১০৩/...) আবদুল্লাহ ইবনু আব্দুর রহমান দারিমী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ বলতে কিছু নেই .....। সে সময় জনৈক বেদুঈন আরব দণ্ডায়মান হলো, ..... এর পরের অংশ ইউনুস ও সালিহ্ (রহঃ) এর হাদীসের মত বর্ণনা করেছেন। (পূর্বোক্ত সূত্রে) যুহরী (রহঃ) বলেন, সায়িব ইবনু ইয়াযীদ ইবনু উখতু নামির (রহঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সংক্রামক ব্যাধি, অনাহারে পেট কামড়ানো পোকা এবং হামাহ্ বলতে কোন অস্তিত্ব নেই। (ইসলামিক ফাউন্ডেশন ৫৫৯৬, ইসলামিক সেন্টার ৫৬২৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5791,
			"arabicnumber": "2221.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৪, আন্তর্জাতিক নাম্বারঃ ২২২১ ৫৬৮৪-(১০৪/২২২১) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... আবূ সালামাহ্ ইবনু আব্দুর রহমান ইবনু আওফ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ (এর অস্তিত্ব) নেই। তিনি আরও বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ব্যাধিযুক্ত উটপালের মালিক (অসুস্থ উটগুলোকে) সুস্থ উটপালের মালিকের (উটের) ধারে কাছে আনবে না। (ইসলামিক ফাউন্ডেশন ৫৫৯৭, ইসলামিক সেন্টার ৫৬২৬) আবূ সালামাহ্ (রহঃ) বলেন, আবূ হুরাইরাহ (রাযিঃ) এ দুটি হাদীসই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে রিওয়ায়াত করতেন। অতঃপর আবূ হুরাইরাহ (রাযিঃ) তার (প্রথম হাদীসের) সংক্রমণ নেই বলা হতে চুপ থাকেন এবং অসুস্থ উটপালের মালিক সুস্থ উটপালের মালিকের নিকট আনবে না- এ বর্ণনায় অটল থাকেন। বর্ণনাকারী বলেন, (একদিন) আল হারিস ইবনু আবূ যুবাব (রহঃ) তিনি আবূ হুরাইরাহ (রাযিঃ) এর চাচাত ভাই বললেন, হে আবূ হুরাইরাহ্! আমি তো আপনাকে বলতে শুনতাম, আপনি এ হাদীসের সঙ্গে আরও একটি হাদীস আমাদের নিকট বর্ণনা করতেন, যা বর্ণনায় আপনি এখন নিচুপ রয়েছেন। আপনি বলতেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ নেই’। তখন আবূ হুরাইরাহ (রাযিঃ) অস্বীকার করলেন এবং বললেন, অসুস্থ পালের মালিক সুস্থ পালের মালিকের নিকট নিয়ে যাবে না। তখন হারিস (রহঃ) এ নিয়ে তার সাথে তর্কে লিপ্ত হলেন। ফলে আবূ হুরাইরাহ (রাযিঃ) গোস্বা হয়ে হাবশী ভাষায় কিছু একটা বললেন। তিনি হারিস (রহঃ) কে বললেন, তুমি কি বুঝতে পেরেছো আমি কি বলেছি? তিনি বললেন, না। আবূ হুরাইরাহ (রাযিঃ) বললেন, আমি বলেছি, আমি অস্বীকার করছি। আবূ সালামাহ্ (রহঃ) বলেন, আমার জীবনের কসম! আবূ হুরাইরাহ (রাযিঃ) নিশ্চয়ই আমাদের নিকট হাদীস রিওয়ায়াত করতেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন 'সংক্রমণ নেই'। এখন আমি জানি না যে, আবূ হুরাইরাহ (রাযিঃ) ভুলে গেলেন, নাকি একটি দ্বারা অপরটিকে রহিত করে দিয়েছেন।* (ইসলামিক ফাউন্ডেশন, ৫৫৯৭, ইসলামিক সেন্টার ৫৬২৬) * لاَ عَدْوَى মূলতঃ কথা হলো যে, সংক্রমণ বলতে কিছু নেই। এটাই বাস্তব সত্য ও ইসলামী আকীদাহ। তবে অসুস্থ উটপালকে সুস্থ উটপালের নিকট নিয়ে যাওয়ার নির্দেশটি সংক্রমণের প্রতি বিশ্বাস করে নয়; বরং সতর্কতা ও পরিচ্ছন্নতার প্রতি লক্ষ্য করে এ নির্দেশ দেয়া হয়েছে।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5792,
			"arabicnumber": "2221.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৫, আন্তর্জাতিক নাম্বারঃ ২২২১ ৫৬৮৫-(১০৫/...) মুহাম্মাদ ইবনু হাতিম ও আবূদ ইবনু হুমায়দ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ (এর বাস্তবতা) নেই- ঐ সঙ্গে এও বর্ণনা করতেন, পালের মালিক (তার) অসুস্থ উট অন্য মালিকের সুস্থ উটপালের নিকট নিয়ে আসবে না। অবশিষ্টাংশ বর্ণনাকারী ইউনুস (রহঃ) এর হাদীসের হুবহু। (ইসলামিক ফাউন্ডেশন ৫৫৯৮, ইসলামিক সেন্টার ৫৬২৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5793,
			"arabicnumber": "2221.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৬, আন্তর্জাতিক নাম্বারঃ ২২২১ ৫৬৮৬-(…/...) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... যুহরী (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৫৯৯, ইসলামিক সেন্টার ৫৬২৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5794,
			"arabicnumber": "2220.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৭, আন্তর্জাতিক নাম্বারঃ ২২২০ ৫৬৮৭-(১০৬/২২২০) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু হুজর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রামক ব্যাধি, কুলক্ষণে পেচা, নক্ষত্র (প্রভাবে বর্ষণ) ও (ক্ষুধায় পেট কামড়ানো) পোকা- এসবের অস্তিত্ব নেই। (ইসলামিক ফাউন্ডেশন ৫৬০০, ইসলামিক সেন্টার ৫৬২৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5795,
			"arabicnumber": "2222.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৮, আন্তর্জাতিক নাম্বারঃ ২২২২ ৫৬৮৮-(১০৭/২২২২) আহমাদ ইবনু ইউনুস ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির (রাযিঃ) বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রামক ব্যাধি, কুলক্ষণ ও (মাঠে ময়দানে পথ ভুলানো নানা রঙে রূপধারী) ভূত-প্রেত (এর অস্তিত্ব) নেই। (ইসলামিক ফাউন্ডেশন ৫৬০১, ইসলামিক সেন্টার ৫৬৩০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5796,
			"arabicnumber": "2222.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৮৯, আন্তর্জাতিক নাম্বারঃ ২২২২ ৫৬৮৯-(১০৮/...) আবদুল্লাহ ইবনু হাশিম ইবনু হাইয়্যান (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রামক ব্যাধি, পথ ভুলানো ভূত এবং ক্ষুধায় পেট কামড়ানো পোকা (এর অস্তিত্ব) নেই। (ইসলামিক ফাউন্ডেশন ৫৬০২, ইসলামিক সেন্টার ৫৬৩১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5797,
			"arabicnumber": "2222.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯০, আন্তর্জাতিক নাম্বারঃ ২২২২ ৫৬৯০-(১০৯/…) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, সংক্রামক ব্যাধি, অনাহারে পেট কামড়ানো পোকা ও পথ ভুলানো ভূত (এর অস্তিত্ব) নেই। (বর্ণনাকারী বলেন) আমি আবূ যুবায়র (রহঃ) কে তাঁর শিষ্যদের নিকট নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণী এর ব্যাখ্যা দিতে শুনেছি। আবূ যুবায়র (রহঃ) বলেছেন,الصَّفَرُ হলোدَوَابُّ الْبَطْنِ পেটের পোকা। জাবির (রাযিঃ) কে প্রশ্ন করা হলো- কি রকম? তিনি বললেন, কথিত পেটের পোকাসমূহ। বর্ণনাকারী বলেন, তিনিالْغُولَ এর বিশ্লেষণ করেননি। আবূ যুবায়র (রহঃ) বলেছেন, তা সেসব ভূত-প্রেত, যারা বিভিন্ন রূপ ধরে মানুষকে রাস্তা তুলায়। (ইসলামিক ফাউন্ডেশন ৫৬০৩, ইসলামিক সেন্টার ৫৬৩২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5798,
			"arabicnumber": "2223.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯১, আন্তর্জাতিক নাম্বারঃ ২২২৩ ৫৬৯১-(১১০/২২২৩) আবদ ইবনু হুমায়দ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমি বলতে শুনেছি, তিনি বলেন, কোন কুলক্ষণ নেই। তবে তার মাঝে উত্তম হলো ফাল তথা শুভ-লক্ষণ। বলা হলো, হে আল্লাহর রসূল! ফাল কি? তিনি বললেন, (যেমন) এমন কিছু কথা উত্তম, যা তোমাদের কেউ শুনতে পায়। (ইসলামিক ফাউন্ডেশন ৫৬০৪, ইসলামিক সেন্টার ৫৬৩৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5799,
			"arabicnumber": "2223.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯২, আন্তর্জাতিক নাম্বারঃ ২২২৩ ৫৬৯২-(.../...) আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স, ‘আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) যুহরী (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু হাদীস বর্ণনা করেছেন। তবে বর্ণনাকারী উকায়ল (রহঃ) এর হাদীসে আছে যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি 'আমি শুনেছি' বলেননি। আর রাবী শু'আয়ব (রহঃ) তার হাদীসে বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমি বলতে শুনেছি, যেমন মা'মার (রহঃ) বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৬০৫, ইসলামিক সেন্টার ৫৬৩৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5800,
			"arabicnumber": "2224.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৩, আন্তর্জাতিক নাম্বারঃ ২২২৪ ৫৬৯৩–(১১১/২২২৪) হাদ্দাব ইবনু খালিদ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন সংক্রমণ ও কুলক্ষণ বলতে কিছু নেই; তবে ফাল ও শুভলক্ষণ (অর্থাৎ- ভাল শব্দ তথা উত্তম কথা) আমাকে বিমোহিত করে। (ইসলামিক ফাউন্ডেশন ৫৬০৬, ইসলামিক সেন্টার ৫৬৩৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5801,
			"arabicnumber": "2224.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৪, আন্তর্জাতিক নাম্বারঃ ২২২৪ ৫৬৯৪–(১১২/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ও ইবনু বাশশার (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) এর সানাদে মালিক (রহঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, সংক্রমণ ও কুলক্ষণ (এর বৈধতা) নেই। তবে আমাকে আনন্দ দেয় ফল ও সুলক্ষণ। বর্ণনাকারী বলেন, তখন বলা হলো, ফাল কী? তিনি বললেন, উত্তম কথা। (ইসলামিক ফাউন্ডেশন ৫৬০৭, ইসলামিক সেন্টার ৫৬৩৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5802,
			"arabicnumber": "2223.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৫, আন্তর্জাতিক নাম্বারঃ ২২২৪ ৫৬৯৫-(১১৩/২২২৪) হাজ্জাজ ইবনু শাইর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, সংক্রমণ ও অশুভ লক্ষণ নেই। আর আমি পছন্দ করি উত্তম ফাল তথা ভাল কথা। (ইসলামিক ফাউন্ডেশন ৫৬০৮, ইসলামিক সেন্টার ৫৬৩৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5803,
			"arabicnumber": "2223.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5804,
			"arabicnumber": "2225.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৭, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৬৯৭-(১১৫/২২২৫) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অশুভ লক্ষণ আছে ঘর, নারী ও ঘোড়ায়। (ইসলামিক ফাউন্ডেশন ৫৬১০, ইসলামিক সেন্টার ৫৬৩৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5805,
			"arabicnumber": "2225.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৮, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৬৯৮-(১১৬/...) আবূ তাহির ও হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সংক্রমণ ও অশুভ বলতে কিছু নেই; তবে অশুভ লক্ষণ আছে তিনটি বস্তুতে স্ত্রী, ঘোড়া ও বাড়িতে। (ইসলামিক ফাউন্ডেশন ৫৬১১, ইসলামিক সেন্টার ৫৬৪০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5806,
			"arabicnumber": "2225.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৬৯৯, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৬৯৯-(.../...) ইবনু আবূ উমার (রাযিঃ) ..... আবদুল্লাহ (রাযিঃ) এর দু'পুত্র সালিম ও হামযাহ্ (রহঃ) তাদের পিতার সানাদেনবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, ইয়াহইয়া ইবনু ইয়াহইয়া, আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) সালিম (রহঃ) তার পিতার সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, 'আমর আন্‌ নাকিদ (রহঃ) আবদুল্লাহ ইবনু উমার (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স (রহঃ), ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) সালিম (রহঃ) তাঁর পিতার সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অশুভ লক্ষণের ব্যাপারে বর্ণনাকারী মালিক (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। বর্ণনাকার ইউনুস ইবনু ইয়াযীদ ছাড়া এদের কেউ ইবনু উমার (রাযিঃ) কর্তৃক বর্ণিত হাদীসে সংক্রমণ ও অশুভ উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৫৬১২, ইসলামিক সেন্টার ৫৬৪১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5807,
			"arabicnumber": "2225.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০০, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৭০০-(১১৭/…) আহমাদ ইবনু আবদুল্লাহ ইবনু হাকাম (রহঃ) ..... ইবনু উমার (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি বলেছেন। যদি কোন কিছুতে অশুভ বলতে কিছু থাকে, তা হবে ঘোড়া, গৃহ ও মেয়ে লোক এটা সত্য। (ইসলামিক ফাউন্ডেশন ৫৬১৩, ইসলামিক সেন্টার ৫৬৪২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5808,
			"arabicnumber": "2225.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০১, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৭০১-(.../...) হারূন ইবনু আবদুল্লাহ (রহঃ) ... শু’বাহ্ (রহঃ) উপরোল্লিখিত সূত্রে একই হাদীস বর্ণন করেছেন। কিন্তু তিনি (এটা সত্য) শব্দটি বলেননি। (ইসলামিক ফাউন্ডেশন ৫৬১৪, ইসলামিক সেন্টার ৫৬৪৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5809,
			"arabicnumber": "2225.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০২, আন্তর্জাতিক নাম্বারঃ ২২২৫ ৫৭০২-(১১৮/...) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... হামযাহ্ ইবনু আবদুল্লাহ ইবনু উমার (রহঃ) এর সানাদে তার পিতা হতে বর্ণনা করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি অশুভ লক্ষণ কোন কিছুতে থেকে থাকে, তাহলে তা রয়েছে ঘোড়া, ঘর-বাড়ি ও নারীর মাঝে। (ইসলামিক ফাউন্ডেশন ৫৬১৫, ইসলামিক সেন্টার ৫৬৪৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5810,
			"arabicnumber": "2226.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৩, আন্তর্জাতিক নাম্বারঃ ২২২৬ ৫৭০৩-(১১৯/২২২৬) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি তা থাকে তাহলে নারী, ঘোড়া ও ঘর-বাড়ি অর্থাৎ- অশুভ লক্ষণ। (ইসলামিক ফাউন্ডেশন ৫৬১৬, ইসলামিক সেন্টার ৫৬৪৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5811,
			"arabicnumber": "2226.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৪, আন্তর্জাতিক নাম্বারঃ ২২২৬ ৫৭০৪-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... সাহল ইবনু সা'দ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬১৭, ইসলামিক সেন্টার ৫৬৪৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5812,
			"arabicnumber": "2227",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৫, আন্তর্জাতিক নাম্বারঃ ২২২৭ ৫৭০৫-(১২০/২২২৭) ইসহাক ইবনু ইবরাহীম হান্‌যালী (রহঃ) আবূ যুবায়র (রহঃ) ..... জাবির (রাযিঃ) থেকে শুনেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন কিছুতে যদি (অশুভ লক্ষণ) থেকে থাকে, তাহলে ঘর (আবাসস্থল), খাদিম ও ঘোড়া (এ তিনটি জিনিসে) রয়েছে। (ইসলামিক ফাউন্ডেশন ৫৬১৮, ইসলামিক সেন্টার ৫৬৪৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5813,
			"arabicnumber": "537.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৬, আন্তর্জাতিক নাম্বারঃ ৫৩৭ ৫৭০৬-(১২১/৫৩৭) আবূ তাহির ও হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... মুআবিয়াহ্ ইবনু হাকাম সুলামী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! কিছু কর্মকাণ্ড আমরা অজ্ঞতার যুগে করতাম, (তার মধ্যে একটি হল) আমরা জ্যোতিষীদের নিকট যেতাম। তিনি বললেন, আর জ্যোতিষীর নিকটে যেয়ো না। আমি বললাম, আমরা (নানা পদ্ধতিতে) ভাগ্য গণনা করতাম। তিনি বললেন, সেটি এমন একটি জিনিস, যা তোমাদের কেউ তার মনে উপলব্ধি করে, তবে সেটি যেন তোমাদের (কাজ-কর্ম হতে) বিরত না রাখে। (ইসলামিক ফাউন্ডেশন ৫৬১৯, ইসলামিক সেন্টার ৫৬৪৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5814,
			"arabicnumber": "537.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৭, আন্তর্জাতিক নাম্বারঃ ৫৩৭ ৫৭০৭-(…/...) মুহাম্মাদ ইবনু রাফি, ইসহাক ইবনু ইবরাহীম, আবদ ইবনু হুমায়দ ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... যুহরী (রহঃ) হতে উপরোক্ত সূত্রে ইউনুস (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু বর্ণনাকারী মালিক (রহঃ) তার বর্ণিত হাদীসে 'শুভাশুভ' এর কথা উল্লেখ করেছেন। তাতে ‘জ্যোতিষী’ এর ব্যাপারটি উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ৫৬২০, ইসলামিক সেন্টার ৫৬৪৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5815,
			"arabicnumber": "537.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৮, আন্তর্জাতিক নাম্বারঃ ৫৩৭ ৫৭০৮-(.../...) মুহাম্মাদ ইবনু সাব্বাহ (রহঃ) ও আবূ বাকর ইবনু আবূ শাইবাহ, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মুআবিয়াহ ইবনু হাকাম সুলামী (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, মু'আবিয়াহ্ (রাযিঃ) হতে আবূ সালামাহ্ (রহঃ) এর সানাদে যুহরী (রহঃ) এর অবিকল বর্ণনা করেছেন। কিন্তু ইয়াহইয়া ইবনু কাসীর (রহঃ) বর্ধিত করে বলেছেন, আমি (মু'আবিয়াহ্) বললাম, আমাদের মধ্যে কিছু লোক এমন রয়েছে, যারা রেখা এঁকে (ভাগ্য নির্ধারণ) করে থাকে। তিনি বললেন, নবীদের মধ্যে একজন নবী রেখা অঙ্কন (ভাগ্য নির্ণয়) করতেন। সুতরাং যার রেখা তার (রেখার) অবিকল হবে তা সেরূপই (সত্যই)। (ইসলামিক ফাউন্ডেশন ৫৬২১, ইসলামিক সেন্টার ৫৬৫০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5816,
			"arabicnumber": "2228.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭০৯, আন্তর্জাতিক নাম্বারঃ ২২২৮ ৫৭০৯-(১২২/২২২৮) আব্‌দ ইবনু হুমায়দ (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! জ্যোতিষীরা কোন ব্যাপারে আমাদের কোন কথা বলত, অতঃপর তা আমরা বাস্তবে প্রত্যক্ষ করতাম। তিনি বললেন, সেটি একটি বাস্তব সত্য কথা, যা কোন জিন চুরি করে এনে সেটি তার দোসর ঠাকুরের কর্ণে প্রবেশ করাতো, আর সে তার সঙ্গে একশটি অবাস্তব মিথ্যা জুড়ে দিত। (ইসলামিক ফাউন্ডেশন ৫৬২২, ইসলামিক সেন্টার ৫৬৫১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5817,
			"arabicnumber": "2228.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১০, আন্তর্জাতিক নাম্বারঃ ২২২৮ ৫৭১০-(১২৩/...) সালামাহ্ ইবনু শাবীব (রহঃ) ..... উরওয়াহ্ (রহঃ) বলতেন, আয়িশাহ্ (রাযিঃ) বলেছেন, একদল লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট জ্যোতিষীদের ব্যাপারে জানতে চাইলো। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেন, ওরা (বাস্তব) কোন কিছুর উপরে (প্রতিষ্ঠিত) নয়। তারা বলল, হে আল্লাহর রসূল! তারা তো প্রায় সময় এমন কিছু বিষয়ে (আগাম) কথা বলে, যা বাস্তব হয়ে যায়। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন। ঐ (একটি) কথা বাস্তব সত্যের অন্তর্ভুক্ত, যা জিনেরা চুরি করে নিয়ে আসে এবং মুরগীর মতো কুট্‌ কুট্‌ করে তা তার দোসরের শ্রবণশক্তিতে ঢুকিয়ে দেয়। পরবর্তীতে তারা তার সঙ্গে শতাধিক মিথ্যা জুড়ে দেয়। (ইসলামিক ফাউন্ডেশন ৫৬২৩, ইসলামিক সেন্টার ৫৬৫২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5818,
			"arabicnumber": "2228.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১১, আন্তর্জাতিক নাম্বারঃ ২২২৮ ৫৭১১-(…/...) আবূ তাহির (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে উপরোল্লিখিত সূত্রে যুহরী (রহঃ) হতে মা'কিল (রহঃ) এর হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬২৪, ইসলামিক সেন্টার ৫৬৫৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5819,
			"arabicnumber": "2229.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১২, আন্তর্জাতিক নাম্বারঃ ২২২৯ ৫৭১২-(১২৪/২২২৯) হাসান ইবনু ‘আলী আল হুলওয়ানী (রহঃ) ও আবদ ইবনু হুমায়দ (রহঃ) ...... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্যে আনসারদের জনৈক ব্যক্তি আমাকে সংবাদ দিয়েছে যে, তারা এক রাত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসা ছিলেন। সে সময় একটি নক্ষত্র পতিত হলো, যার দরুন আলোকিত হয়ে উঠল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেন, এ ধরনের (তারকা) পতিত হলে অজ্ঞতার যুগে তোমরা কি বলতে? তারা বলল, আল্লাহ এবং তার রসূলই অধিক ভাল জানেন। আমরা বলতাম, আজ রাতে মনে হয় কোন মহান লোকের ভূমিষ্ঠ হয়েছে অথবা কোন মহান লোক মৃত্যুবরণ করেছেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ জেনে রাখো যে, তা কারো মৃত্যু কিংবা কারো জন্মের কারণে পতিত হয় না; কল্যাণময় ও মহান নামের অধিকারী আমাদের প্রতিপালক যখন কোন বিষয়ের সমাধান দেন, তখন আরশ বহনকারী ফেরেশতারা তাসবীহ পাঠ করে। অতঃপর তাসবীহ পাঠ করে সে আকাশের ফেরেশতারা, যারা তাদের পার্শ্ববর্তী পরিশষে তাসবীহ পাঠ এ নিকটবর্তী (পৃথিবীর) আসমানের অধিবাসীদের পর্যন্ত পৌছে। অতঃপর আরশ বহনকারীদের (ফেরেশতা) পার্শ্ববর্তী যারা তারা আরশ বহনকারীদের বলে তোমাদের প্রতিপালক কি বললেন? সে সময় তিনি তাদের যা কিছু বলেছেন, তারা সে সংবাদ বর্ণনা করে। বর্ণনাকারী বলেন, পরে আসমানসমূহের অধিবাসীরা একে অপরকে সংবাদ আদান-প্রদান করে। পরিশেষে এ নিকটবর্তী আকাশে সংবাদ পৌছে। সে সময় জিনেরা অতর্কিতে গোপন খবরটি শুনে নেয় এবং তাদের দোসর জ্যোতিষীদের নিকট পৌছিয়ে দেয়, আর সাথে অতিরিক্ত কিছু জুড়ে দেয়। ফলে যা তারা ঠিকঠাকভাবে নিয়ে আসতে পারে, তাই ঠিক হয়; তবে তারা তাতে (কথামালা) সুবিন্যস্ত ও সংযোজন করে। (ইসলামিক ফাউন্ডেশন ৫৬২৫, ইসলামিক সেন্টার ৫৬৫৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5820,
			"arabicnumber": "2229.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৩, আন্তর্জাতিক নাম্বারঃ ২২২৯ ৫৭১৩-(.../...) যুহায়র ইবনু হারব আবূ তাহির, হারমালাহ ও সালামাহ্ ইবনু শাবীব (রহঃ) ..... যুহরী (রহঃ) হতে উপরোক্ত সূত্রে বর্ণনা করেছেন। কিন্তু ইউনুস (রহঃ) বলেছেন, আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আনসার সাহাবীগণের কতিপয় লোক আমাকে বলেছেন। আর আওযাঈ (রহঃ) এর বর্ণিত হাদীসে রয়েছে, তবে তারা সেটার মধ্যে (কথামালা) সুবিন্যস্ত ও সংযোজিত করে দেয়। আর ইউনুস (রহঃ) এর হাদীসে আছে, এতে তারা অতিরিক্ত ও অতিরঞ্জিত করে। ইউনুস (রহঃ) বর্ণিত হাদীসে বাড়িয়ে বলেছেন, আল্লাহ তা'আলা বলেছেন, \"পরিশেষে যখন তাদের অন্তর হতে সংশয় দূর করে দেয়া হয, সে সময় তারা বলে, তোমাদের স্রষ্টা কি বললেন? তারা বলে, ঠিকই বলেছেন\"- (সূরাহ সাবা ৩৪ঃ ২৩)। আর মা'কিল (রহঃ) বর্ণিত হাদীসে আওযাঈ (রহঃ) যেমন বলেছেন, তবে তাতে তারা সুবিন্যস্ত ও সংযোজিত করে এরই উল্লেখ আছে। (ইসলামিক ফাউন্ডেশন ৫৬২৬, ইসলামিক সেন্টার ৫৬৫৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5821,
			"arabicnumber": "2230",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৪, আন্তর্জাতিক নাম্বারঃ ২২৩০ ৫৭১৪-(১২৫/২২৩০) মুহাম্মাদ ইবনুল মুসান্না আনায়ী (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কতক স্ত্রীর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, যে লোক আররাফ*-এর (গণকের) নিকট গেল এবং তাকে কোন ব্যাপারে প্রশ্ন করল, চল্লিশ রাত্রি তার কোন সালাত (সালাত/নামাজ/নামায) গ্রহণযোগ্য হবে না। (ইসলামিক ফাউন্ডেশন ৫৬২৭, ইসলামিক সেন্টার ৫৬৫৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5822,
			"arabicnumber": "2231",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৫, আন্তর্জাতিক নাম্বারঃ ২২৩১ ৫৭১৫-(১২৬/২২৩১) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আমর ইবনু শারীদ (রাযিঃ)-এর সানাদে তার পিতা হতে বর্ণিত। তিনি বলেন, সাকীফ সম্প্রদায়ের প্রতিনিধি দলের মধ্যে জনৈক কুষ্ঠ রোগী ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট (খবর) পাঠালেন যে, আমরা তোমাকে বাই’আত করে নিয়েছি; তুমি ফিরে যাও * (ইসলামিক ফাউন্ডেশন ৫৬২৮, ইসলামিক সেন্টার ৫৬৫৭)। * হাদীসে কুষ্ঠরোগীর সাথে একত্রে পানাহার ও উঠা বসার বিবরণ পাওয়া যায়। অতএব সুন্নাহ্ মতে, তাদের ঘৃণা ও একঘরে না করে সম্ভাব্য ও সাধারণ সতর্কতা অবলম্বন বিধেয়।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5823,
			"arabicnumber": "2232.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৬, আন্তর্জাতিক নাম্বারঃ ২২৩২ ৫৭১৬-(১২৭/২২৩২) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিষ্ঠে দু'টি শুভ্র রেখাযুক্ত বিষধর সর্প হত্যা করার আদেশ দিয়েছেন। কারণ সেটি চোখের জ্যোতি হরণ করে নেয় এবং গর্ভস্থিত সন্তানের উপর পার্শ্বপ্রতিক্রিয়া ফেলে। (ইসলামিক ফাউন্ডেশন ৫৬২৯, ইসলামিক সেন্টার ৫৬৫৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5824,
			"arabicnumber": "2232.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৭, আন্তর্জাতিক নাম্বারঃ ২২৩২ ৫৭১৭-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) হিশাম (রহঃ) ..... উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেন এবং বলেন, 'লেজবিহীন পিঠে দু'টি শুভ্র রেখাযুক্ত সৰ্প (সাপ)। (ইসলামিক ফাউন্ডেশন ৫৬৩০, ইসলামিক সেন্টার ৫৬৫৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5825,
			"arabicnumber": "2233.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭১৮, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭১৮-(১২৮/২২৩৩) আমর ইবনু মুহাম্মাদ আন নাকিদ (রহঃ) ..... সালিম (রহঃ) তার পিতা সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, এমন সব সাপ যেগুলোর পিঠে দু'টি শুভ্র রেখাযুক্ত ও লেজবিহীন সাপ মেরে ফেলে। কারণ, এ দুটি গর্ভপাত ঘটায় এবং চোখের দৃষ্টি কেড়ে নেয়। বর্ণনাকারী বলেন, তাই ইবনু উমার (রহঃ) যে কোন সৰ্প (সাপ) পেলে সাথে সাথে তাকে মেরে ফেলতেন। (একদিন) আবূ লুবাবাহ ইবনু আবদুল মুনযির (রহঃ) কিংবা যায়দ ইবনু খাত্তাব (রহঃ) তাকে লক্ষ্য করলেন যে, তিনি একটি সাপ মারার জন্য ছুটছেন। তখন তিনি [আবূ লুবাবাহ বা যায়দ (রহঃ)] বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরবাড়িতে বসবাসকারী (সাপ) হত্যা করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৩১, ইসলামিক সেন্টার ৫৬৬০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5828,
			"arabicnumber": "2233.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২১, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২১-(১৩১/...) মুহাম্মাদ ইবনু রুমহ ও কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... নাফি (রহঃ) হতে বর্ণনা করেন যে, আবূ লুবাবাহ (রাযিঃ) ইবনু উমার (রাযিঃ) এর সঙ্গে তার গৃহে তার জন্য একটি দরজা খুলে নেয়ার বিষয়ে কথা বলছিলেন- যেটা দ্বারা তিনি মসজিদের দিকে চলাচলের রাস্তা কাছাকাছি করতে পারবেন। তখন কিশোররা (দেয়াল খুড়তে গিয়ে) একটি সাপের খোলস পেল। সে সময় আবদুল্লাহ (রাযিঃ) বললেন, ওটিকে সন্ধান করে বের করে হত্যা কর। তখন আবূ লুবাবাহ (রাযিঃ) বললেন, তোমরা সেটিকে হত্যা করো না। কারণ, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘর-বাড়িতে অবস্থানকারী সাপগুলোকে হত্যা করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৩৩, ইসলামিক সেন্টার ৫৬৬৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5829,
			"arabicnumber": "2233.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২২, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২২-(১৩২/...) শাইবান ইবনু ফাররূখ (রহঃ) ..... নাফি (রহঃ) হতে বর্ণিত। তিনি বলেন, ইবনু উমার (রাযিঃ) সব ধরনের সাপ মেরে ফেলতেন। পরিশেষে আবূ লুবাবাহ ইবনু আবদুল মুন্‌যির আল-বাদ্‌রী (রাযিঃ) আমাদের হাদীস শুনালেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহের সাপগুলোকে হত্যা করতে বারণ করেছেন। অতঃপর তিনি [ইবনু উমার (রাযিঃ)] তা থেকে সংযত রইলেন। (ইসলামিক ফাউন্ডেশন ৫৬৩৪, ইসলামিক সেন্টার ৫৬৬৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5830,
			"arabicnumber": "2233.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৩, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২৩-(১৩৩/...) মুহাম্মাদ ইবনুল মুসান্না ..... নাফি' (রহঃ) খবর দিয়েছেন যে, তিনি আবূ লুবাবাহ (রাযিঃ) কে ইবনু উমার (রাযিঃ) এর নিকট (হাদীসের) সংবাদ দিতে শুনেছেন এ মর্মে যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহের (ছোট-খাটো) সাপগুলো হত্যা করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৩৫, ইসলামিক সেন্টার ৫৬৬৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5831,
			"arabicnumber": "2233.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৪, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২৪-(১৩৪/…) ইসহাক ইবনু মূসা আনসারী (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) আবূ লুবাবাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ..... (ভিন্ন সূত্রে) আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আসমা যুবাঈ (রহঃ) 'আবদুল্লাহ (রাযিঃ) হতে এ মর্মে বর্ণিত যে, আবূ লুবাবাহ (রাযিঃ) তাকে (হাদীসের) সংবাদ দিয়েছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাড়ী-ঘরে অবস্থানকারী সাপগুলো হত্যা করতে বারণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৩৬, ইসলামিক সেন্টার ৫৬৬৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5832,
			"arabicnumber": "2233.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৫, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২৫-(১৩৫/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... নাফি (রহঃ) সংবাদ দিয়েছেন যে, আবূ লুবাবাহ ইবনু আবদুল মুনযির আনসারী (রাযিঃ) কুবায় বসবাস করতেন। অতঃপর তিনি স্থান পরিবর্তন করে মদীনায় (মসজিদে নবাবীর সন্নিকটে) আসলেন। এমতাবস্থায় যে, আবদুল্লাহ ইবনু উমার (রাযিঃ) তার [আবূ লুবাবাহ (রাযিঃ)-এর] সঙ্গে উপবিষ্ট ছিলেন এবং তার জন্য ছোট আকারে একটি দরজা খুলছিলেন। অকস্মাৎ সে সময় তারা বাড়ি ঘরে অবস্থানকারী একটি সাপ লক্ষ্য করলেন। তারা ওটিকে হত্যা করতে অগ্রসর হলে আবূ লুবাবাহ (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেগুলো মেরে ফেলতে বারণ করেছেন। তিনি (ওগুলো বলে) বাড়ি-ঘরে অবস্থানকারী সাপ বুঝাতে চেয়েছেন। আর লেজকাটা ও পিঠে দু'টি সাদা দাগ বিশিষ্ট সাপ মেরে ফেলার নির্দেশ দিয়েছেন। বলা হয় যে, সে (সাপ) দুটি এমন, যারা চোখের জ্যোতি নষ্ট করে দেয় এবং নারীদের গর্ভপাত ঘটায়। (ইসলামিক ফাউন্ডেশন ৫৬৩৭, ইসলামিক সেন্টার ৫৬৬৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5833,
			"arabicnumber": "2233.09",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৬, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২৬-(১৩৬/...) ইসহাক ইবনু মানসূর (রহঃ) ..... নাফি' (রহঃ) হতে বর্ণিত। তিনি বলেন, একদিন 'আবদুল্লাহ ইবনু উমার (রাযিঃ) তার ভেঙ্গে ফেলা একটি দেয়ালের নিকট ছিলেন। অতঃপর একটি সাপের খোলস দেখতে পেয়ে বললেন, একে সন্ধান করে তা হত্যা কর। আবূ লুবাবাহ আনসারী (রাযিঃ) বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তিনি সেসব সাপ হত্যা করতে বারণ করেছেন যেগুলো বাড়ি-ঘরে অবস্থান করে; কিন্তু লেজ কাটা ও পিঠে দু'টি সাদা দাগযুক্ত সাপ (হত্যা করতে বলেছেন)। কারণ, এ দুটি এমন যারা দৃষ্টি শক্তি কেড়ে নেয় এবং স্ত্রীলোকদের গর্ভপাত ঘটায়। (ইসলামিক ফাউন্ডেশন ৫৬৩৭, ইসলামিক সেন্টার ৫৬৬৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5834,
			"arabicnumber": "2233.10",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৭, আন্তর্জাতিক নাম্বারঃ ২২৩৩ ৫৭২৭-(.../...) হারূন ইবনু সাঈদ আইলী (রহঃ) ..... নাফি' (রহঃ) হতে বর্ণিত। তিনি বলেন, একবার আবূ লুবাবাহ (রাযিঃ) ইবনু উমার (রাযিঃ) এর নিকট দিয়ে গেলেন। সে সময় তিনি উমার ইবনু খাত্তাব (রাযিঃ) এর গৃহের নিকট অবস্থিত দালানের কাছে ছিলেন। তখন তিনি একটি সাপ হত্যা করার জন্য লুকিয়ে ছিলেন। শেষাংশ লায়স ইবনু সা'দ (রাযিঃ) কর্তৃক বর্ণিত হাদীসের মতো। (ইসলামিক ফাউন্ডেশন ৫৬৩৯, ইসলামিক সেন্টার ৫৬৬৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5835,
			"arabicnumber": "2234.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৮, আন্তর্জাতিক নাম্বারঃ ২২৩৪ ৫৭২৮-(১৩৭/২২৩৪) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..… আবদুল্লাহ (রাযিঃ) হতে বৰ্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে একটি (পাহাড়ী) গুহায় ছিলাম। সে সময় কেবল وَالْمُرْسَلاَتِ عُرْفًا‏ (সূরা আল-মুরসালাত) তার উপরে অবতীর্ণ হয়েছিল, আর আমরা তার কণ্ঠ থেকে তা সতেজভাবে (সরাসরি) শুনছিলাম। অকস্মাৎ একটি সাপ আমাদের সম্মুখে বের হয়ে আসলো। তিনি বললেন, তোমরা ওটাকে হত্যা করো। আমরা হত্যা করার জন্য তার পিছনে দৌড় প্রতিযোগিতা আরম্ভ করলাম। কিন্তু সে আমাদের হারিয়ে দিয়ে পালিয়ে গেল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তা'আলা ওকে তোমাদের অনিষ্ট থেকে হিফাযাত করেছেন, যেমন তিনি তোমাদের হিফাযাত করেছেন তার অনিষ্ট হতে। (ইসলামিক ফাউন্ডেশন ৫৬৪০, ইসলামিক সেন্টার ৫৬৭০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5836,
			"arabicnumber": "2234.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭২৯, আন্তর্জাতিক নাম্বারঃ ২২৩৪ ৫৭২৯-(.../...) কুতাইবাহ ইবনু সাঈদ ও উসমান ইবনু আবূ শাইবাহ্ (রহঃ) ..... আ'মাশ (রহঃ) হতে উপরোল্লিখিত সূত্রে হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৪১, ইসলামিক সেন্টার ৫৬৭১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5837,
			"arabicnumber": "2235",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩০, আন্তর্জাতিক নাম্বারঃ ২২৩৪ ৫৭৩০-(১৩৮/২২৩৪) আবূ কুরায়ব (রহঃ) ..... আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ‘মুহরিম লোককে মিনায় একটি সাপ হত্যার নির্দেশ দিয়েছিলেন। (ইসলামিক ফাউন্ডেশন ৫৬৪২, ইসলামিক সেন্টার ৫৬৭২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5838,
			"arabicnumber": "2234.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩১, আন্তর্জাতিক নাম্বারঃ ২২৩৫ ৫৭৩১-(.../২২৩৫) উমার ইবনু হাফস ইবনু গিয়াস (রহঃ) ..... আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে একটি (পাহাড়ী) গুহায় অবস্থান করছিলাম। বাকী অংশ জারীর (রহঃ) ও আবূ মু'আবিয়াহ্ (রহঃ) বর্ণিত হাদীসের মতই। (ইসলামিক ফাউন্ডেশন ৫৬৪৩, ইসলামিক সেন্টার ৫৬৭৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5839,
			"arabicnumber": "2236.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩২, আন্তর্জাতিক নাম্বারঃ ২২৩৬ ৫৭৩২-(১৩৯/২২৩৬) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ্ (রহঃ) ..... হিশাম ইবনু যুহরাহ (রহঃ) এর মুক্ত গোলাম আবূ সায়িব (রহঃ) হতে বর্ণিত যে, তিনি আবূ সাঈদ খুদরী (রাযিঃ) এর নিকট তার গৃহে ঢুকলেন। তিনি বলেন, সে সময় আমি তাকে সালাতরত অবস্থায় পেলাম এবং তার সালাত (সালাত/নামাজ/নামায) শেষ করা পর্যন্ত তার অপেক্ষায় বসে থাকলাম। সে সময় গৃহের কোণে রেখে দেয়া খেজুর ডালের স্তুপের মাঝে কিছু একটার নড়াচড়ার শব্দ শুনতে পেলাম। আমরা দেখতে পেলাম যে, এটি একটি সাপ। আমি সেটিকে হত্যা করার জন্য লাফ দেয়ার জন্য প্রস্তুত হলাম। তখন তিনি (সালাতে থেকেই) ইঙ্গিত করলেন যে, বসে থাকো। সালাত সমাপ্ত করে গৃহের একটি ঘরের দিকে ইশারা করে বললেন, এ ঘরটি কি তুমি দেখতে পাচ্ছ? আমি বললাম, হ্যাঁ! তিনি বললেন, সেখানে নববিবাহিত আমাদের এক যুবক থাকত। বর্ণনাকারী বলেন, অতঃপর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে খন্দক যুদ্ধে বের হলাম। ঐ যুবক মধ্যাহ্নের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি চেয়ে নিত এবং তার পরিবারের নিকট ফিরে যেত। একদিন সে (যথারীতি) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অনুমতি কামনা করলে তিনি তাকে বললেন, তোমার যুদ্ধাস্ত্র তোমার সঙ্গে নিয়ে যাও। কারণ, আমি তোমার উপরে বানু কুরাইযাহ (ইয়াহুদীদের আক্রমণ) এর সংশয় করছি। ব্যক্তিটি তার অস্ত্র নিয়ে (গৃহে) প্রত্যাবর্তন করল। সেখানে সে তার (সদ্য বিবাহিতা) স্ত্রীকে দু’দরজার মাঝে দণ্ডায়মান অবস্থায় লক্ষ্য করল এবং (তার প্রতি সন্দিহান হয়ে) তাকে বল্লম দিয়ে আঘাত হানার উদ্দেশে তা তার দিকে স্থির করে ধরল। আত্মসম্মানবোধ তাকে পেয়ে বসেছিল। তখন সে (স্ত্রী) বলল, তোমার বল্লমটি নিজের নিকট সংযত রাখো এবং ঘরে প্রবেশ করো। তুমি যাতে তা দেখতে পারো, যা আমাকে বের হতে বাধ্য করেছে। সে গৃহে ঢুকেই দেখতে পেল যে, এক বিশালাকার সাপ বিছানার উপরে কুণ্ডলী পাকিয়ে রয়েছে। সে এর প্রতি বল্লম স্থির করে তার মাধ্যমে এটিকে গেঁথে ফেলল। অতঃপর বের হয়ে তা (বল্পমটি) বাড়ীর মধ্যেই পুঁতে রাখল। সে সময় তা নড়ে চড়ে তাকে ছোবল মারলো এবং (ক্ষণিকের মধ্যে) সাপ কিংবা যুবক এ দু'জনের কে বেশি দ্রুত মৃত্যুবরণকারী ছিল তা আঁচ করা গেল না। বর্ণনাকারী আবূ সাঈদ (রাযিঃ) বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে যেয়ে ঘটনাটি বিবরণ দিয়ে তাকে বললাম, আপনি আল্লাহর নিকট দু'আ করুন, তিনি যেন আমাদের মাঝে তাকে আবার তাজা করে দেন। সে সময় তিনি বললেন, তোমরা তোমাদের সঙ্গীর জন্য ক্ষমা প্রার্থনা করো। তারপর বললেন, মদীনায় কিছু জিন রয়েছে, যারা ইসলাম গ্রহণ করেছে। তাই, (সাপ ইত্যাদিরূপে) তাদের কিয়দংশ তোমরা লক্ষ্য করলে তাকে তিন দিন সাবধান সংকেত দিবে; তারপরে তোমাদের সম্মুখে (তা) প্রকাশ পেলে তাকে হত্যা করবে। কারণ, সে একটি (অবাধ্য) শাইতান, (অর্থাৎ, সে মুসলিম নয়)। (ইসলামিক ফাউন্ডেশন ৫৬৪৪, ইসলামিক সেন্টার ৫৬৭৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5840,
			"arabicnumber": "2236.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৩, আন্তর্জাতিক নাম্বারঃ ২২৩৬ ৫৭৩৩-(১৪০/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... (আবূ) সায়িব (রহঃ) হতে বর্ণিত। তিনি বলেন, আমরা আবূ সাঈদ খুদরী (রাযিঃ) এর নিকট গমন করলাম। আমরা উপবিষ্ট ছিলাম, এমতাবস্থায় অকস্মাৎ তার খাটের নীচে একটা নড়াচড়ার শব্দ শুনতে পেলাম। তাকিয়ে দেখি যে, সেটা একটা সাপ ..... ঘটনা সহ হাদীসটি (পূর্বোল্লিখিত) সাইফী (রহঃ) হতে মালিক (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু এতে তিনি বলেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এসব গৃহে আরও কতক অধিবাসী রয়েছে। সুতরাং সে রকমের কোন কিছু তোমরা লক্ষ্য করলে তাদের প্রতি তিনবার সাবধান বাণী উচ্চারণ করবে, এতে যদি (তারা) চলে যায় তো ভাল! নতুবা তোমরা তাকে হত্যা করবে। কারণ সে কাফির (অবাধ্য)। আর তিনি তাদের (মৃত ব্যক্তির অভিভাবকদের) বললেন, তোমরা চলে যাও এবং তোমাদের সঙ্গীকে দাফন করো। (ইসলামিক ফাউন্ডেশন ৫৬৪৫, ইসলামিক সেন্টার ৫৬৭৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5841,
			"arabicnumber": "2236.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৪, আন্তর্জাতিক নাম্বারঃ ২২৩৬ ৫৭৩৪-(১৪১/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদীনায় জিনদের এমন একটি দল রয়েছে, যারা ইসলাম গ্রহণ করেছে। তাই যে লোক এসব গৃহের অধিবাসী (সাপ ইত্যাদির রূপধারী) এ ধরনের কোন কিছু দেখতে পায়, সে যেন তাকে তিনবার সাবধানী সংকেত দেয়; তারপরও যদি তার সম্মুখে তা প্রকাশ পায় তবে সে যেন তা হত্যা করে ফেলে, কারণ একটা (অবাধ্য) শাইতান। (ইসলামিক ফাউন্ডেশন ৫৬৪৬, ইসলামিক সেন্টার ৫৬৭৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5842,
			"arabicnumber": "2237.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৫, আন্তর্জাতিক নাম্বারঃ ২২৩৭ ৫৭৩৫-(১৪২/২২৩৭) আবূ বাকর ইবনু আবূ শাইবাহ, ‘আমর আন নাকিদ, ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমার (রহঃ) ...... উম্মু শারীক (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কাকলাস মেরে ফেলতে নির্দেশ দিয়েছেন। কিন্তু ইবনু আবূ শাইবাহ্ (রহঃ) বর্ণিত হাদীসে (শুধু) নির্দেশ করেছেন রয়েছে, (অর্থাৎ, তাকে শব্দটি নেই)। (ইসলামিক ফাউন্ডেশন ৫৬৪৭, ইসলামিক সেন্টার ৫৬৭৭)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5843,
			"arabicnumber": "2237.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৬, আন্তর্জাতিক নাম্বারঃ ২২৩৭ ৫৭৩৬-(১৪৩/...) আবূ তাহির, মুহাম্মাদ ইবনু আহমাদ ইবনু আবূ খালাফ ও আবদ ইবনু হুমায়দ (রহঃ) ... উম্মু শারীক (রাযিঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কাকলাস হত্যা করার বিষয়ে বিধান জানতে চাইলেন, তখন তিনি তাকে তা মেরে ফেলার নির্দেশ দিলেন। উম্মু শারীক (রাযিঃ) হলেন বানু আমির ইবনু লুওয়াই সম্প্রদায়ের জনৈক স্ত্রীলোক। এ হাদীসের রিওয়ায়াতে ইবনু আবূ খালাফ ও আবদ ইবনু হুমায়দ (রহঃ) এর শব্দ অভিন্ন। আর ইবনু ওয়াহব (রহঃ) (প্রথম সূত্রে) এর বর্ণিত হাদীস (এর শব্দ) এর পাশাপাশি। (ইসলামিক ফাউন্ডেশন ৫৬৪৮, ইসলামিক সেন্টার ৫৬৭৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5844,
			"arabicnumber": "2238",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৭, আন্তর্জাতিক নাম্বারঃ ২২৩৮ ৫৭৩৭-(১৪৪/২২৩৮) ইসহাক ইবনু ইবরাহীম ও আবদ ইবনু হুমায়দ (রহঃ) ..... আমির ইবনু সাদ (রহঃ) এর পিতা সাঈদ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাকলাস হত্যা করার নির্দেশ দিয়েছেন এবং তাকে ছোট্ট ফাসিক ক্ষুদে দুষ্কৃতিকারী নাম দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৬৪৯, ইসলামিক সেন্টার ৫৬৭৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5845,
			"arabicnumber": "2239",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৮, আন্তর্জাতিক নাম্বারঃ ২২৩৯ ৫৭৩৮-(১৪৫/২২৩৯) আবূ তাহির ও হারমালাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাকলাসকে 'ছোট্ট ফাসিক' বলেছেন। হারামালাহ্ (রহঃ) বর্ধিতাকারে বর্ণনা করেন যে, তিনি [আয়িশাহ্ (রাযিঃ)] বলেছেন যে, (তবে) আমি তাকে তা হত্যা করার আদেশ দিতে শুনিনি। (ইসলামিক ফাউন্ডেশন ৫৬৫০, ইসলামিক সেন্টার ৫৬৮০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5846,
			"arabicnumber": "2240.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৩৯, আন্তর্জাতিক নাম্বারঃ ২২৪০ ৫৭৩৯-(১৪৬/২২৪০) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রথম আঘাতে যে লোক কাকলাস মারবে, তার জন্য রয়েছে এত এত পরিমাণ সাওয়াব। আর যে লোক দ্বিতীয় আঘাতে তাকে হত্যা করবে, তার জন্য এত এত পরিমাণ সাওয়াব, প্রথমবারের চাইতে কম। আর যদি তৃতীয় আঘাতে হত্যা করে ফেলে, তাহলে তার জন্য এত এত পরিমাণ সাওয়াব, তবে দ্বিতীয়বারের থেকে কম। (ইসলামিক ফাউন্ডেশন ৫৬৫১, ইসলামিক সেন্টার ৫৬৮১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5847,
			"arabicnumber": "2240.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪০, আন্তর্জাতিক নাম্বারঃ ২২৪০ ৫৭৪০-(১৪৭/...) কুতাইবাহ্ ইবনু সাঈদ, যুহায়র ইবনু হারব, মুহাম্মাদ ইবনু সাব্বাহ ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে সুহায়ল (রহঃ) হতে সংকলিত খালিদ (রহঃ) বর্ণিত হাদীসের মর্মার্থ সম্পন্ন হাদীস বর্ণনা করেছেন। কিন্তু শুধুমাত্র (অনুরূপ সানাদের) বর্ণনাকারী জাবীর (রহঃ) (এর বর্ণনায় ভিন্নতা রয়েছে), তার বর্ণিত হাদীসে আছে, যে লোক প্রথম আঘাতে কাকলাস হত্যা করবে, তার জন্য একশ' সাওয়াব লেখা হয়, আর দ্বিতীয় আঘাতে এর চেয়ে কম আর তৃতীয় আঘাতে তার থেকে কম (সাওয়াব লেখা হয়)। (ইসলামিক ফাউন্ডেশন ৫৬৫২, ইসলামিক সেন্টার ৫৬৮২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5848,
			"arabicnumber": "2240.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪১, আন্তর্জাতিক নাম্বারঃ ২২৪০ ৫৭৪১-(.../...) মুহাম্মাদ ইবনু সাব্বাহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, প্রথম আঘাতে (হত্যা করতে পারলে) সত্তরটি সাওয়াব। (ইসলামিক ফাউন্ডেশন ৫৬৫৩, ইসলামিক সেন্টার ৫৬৮৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5849,
			"arabicnumber": "2241.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪২, আন্তর্জাতিক নাম্বারঃ ২২৪১ ৫৭৪২-(১৪৮/২২৪১) আবূ তাহির ও হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, একটি পিপড়া নবীদের কোন নবীকে কামড় দিলে তিনি পিপড়ার বসতি সম্বন্ধে আদেশ দিলেন, ফলে তা জ্বলিয়ে দেয় হলো। সে সময় আল্লাহ তা'আলা তার নিকট এ প্রেক্ষিতে ওয়াহী নাযিল করলেন যে, একটি (মাত্র) পিপড়া তোমাকে কামড় দিল, তাতেই কিনা সমস্ত উম্মাত ও সৃষ্টিকূলের এমন একটি সৃষ্টি জাতিকে জ্বলিয়ে দিলে যারা আল্লাহর তাসবীহ পাঠ করছিল? (ইসলামিক ফাউন্ডেশন ৫৬৫৪, ইসলামিক সেন্টার ৫৬৮৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5850,
			"arabicnumber": "2241.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৩, আন্তর্জাতিক নাম্বারঃ ২২৪১ ৫৭৪৩-(১৪৯/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নবীদের মধ্যে কোন একজন নবী একটি বৃক্ষের নিচে অবস্থান নিলেন, সে সময় একটি পিপড়া তাকে কামড় দিল। তিনি এ ব্যাপারে নির্দেশ করলে তার আসবাবপত্র গাছতলা হতে সরিয়ে ফেলা হলো। তারপর তাদের পিপড়া সম্বন্ধে নির্দেশ দিলে তাদের বাসা জ্বলিয়ে দেয়া হলো। তখন আল্লাহ তা'আলা তার নিকট ওয়াহী প্রেরণ করলেন, এমতাবস্থায় একটি মাত্র (অপরাধী) পিপড়াকে (শাস্তি) দিলেন না কেন? (ইসলামিক ফাউন্ডেশন ৫৬৫৫, ইসলামিক সেন্টার ৫৬৮৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5851,
			"arabicnumber": "2241.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৪, আন্তর্জাতিক নাম্বারঃ ২২৪১ ৫৭৪৪-(১৫০/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, এ হলো সেসব হাদীস যা আবূ হুরাইরাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট বর্ণনা করেছেন, এ বলে তিনি কয়েকটি হাদীস বর্ণনা করলেন, (সেগুলোর একটি হলো) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নবীকূলের একজন নবী একটি বৃক্ষের নিচে অবস্থান করলেন, তখন একটি পিপড়া তাকে কামড় দিল, সে সময় তিনি তার আসবাবপত্র (বের করার) বিষয়ে আদেশ দিলে তা বৃক্ষের নিচ থেকে বের করা হলো এবং তিনি নির্দেশ দিলে পিপড়াগুলো আগুনে জ্বালিয়ে দেয়া হলো। তিনি বলেন, তখন আল্লাহ তা'আলা তার নিকট ওয়াহী প্রেরণ করলেন, এহেন অবস্থায় একটি মাত্র পিপড়াকে (শাস্তি) দিলেন না কেন? (ইসলামিক ফাউন্ডেশন ৫৬৫৬, ইসলামিক সেন্টার ৫৬৮৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5852,
			"arabicnumber": "2242.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৫, আন্তর্জাতিক নাম্বারঃ ২২৪২ ৫৭৪৫-(১৫১/২২৪২) আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আসমা যুবাঈ (রহঃ) ..... 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক স্ত্রী লোককে একটি বিড়ালের জন্য আযাব দেয়া হয় এজন্য যে, সে বিড়ালটিকে আটকে রেখেছিল, পরিশেষে সে-টি মারা গেল। যার জন্য সে জাহান্নামে গেল। যে মেয়ে লোকটি বিড়ালটিকে বেঁধে রেখেছে, নিজেও পানাহার করায়নি আর সেটিকে সে ছেড়েও দেয়নি, যাতে সে জমিনের পোকামাকড় খেয়ে বাঁচতে পারে। (ইসলামিক ফাউন্ডেশন ৫৬৫৭, ইসলামিক সেন্টার ৫৬৮৭) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। কোনো প্রাণীকে অকারণে বেঁধে রাখা এবং তাকে তার খাবার ও পান করার দ্রব্য থেকে বিরত রাখা নিষ্ঠুর ও কঠোর হৃদয়ের মানুষ হওয়ার প্রমাণ বহন করে। এবং এর সাথে সাথে সে খারাপ আচরণ এবং অভদ্রতার মানুষ হওয়ার প্রমাণ বহন করে। ২। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, অকারণে কোনো জীবজন্তু বা প্রাণীকে কোনো রকমভাবে কষ্ট দেওয়া, তার প্রতি অন্যায় করা এবং তাকে প্রহার করা ও হত্যা করা একটি মহা পাপ। তাই এই হাদীসের উল্লিখিত মহিলাটিকে জাহান্নামের আগুনে প্রবেশ করতে হয়েছে; এই জন্য যে, সে একটি বিড়ালকে বেঁধে রেখে হত্যা করেছে। ৩। মানুষ ওই সময় কোনো জীবজন্তুকে বেঁধে রাখতে পারবে, যখন সে তাকে তার খাবার ও পান করার দ্রব্য এবং জরুরি ঔষধ প্রদান করবে, আর প্রদান করবে তাকে তার জীবন রক্ষার সঠিক উপাদান। এই নিয়ম মোতাবেক মানুষ কোনো বিড়াল এবং পাখি ইত্যাদি প্রাণীকে বেঁধে রাখতে পারবে। ৪। প্রকৃত ইসলামের শিক্ষা মোতাবেক যে প্রাণীকে হত্যা করার অনুমতি নেই, সেই প্রাণীকে যে ব্যক্তি কষ্ট দিবে অথবা হত্যা করবে, সেই ব্যক্তিকে পরকালে কঠোর শাস্তি ভোগ করতে হবে।",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5853,
			"arabicnumber": "2242.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৬, আন্তর্জাতিক নাম্বারঃ ২২৪২ ৫৭৪৬-(…/...) নাসর ইবনু আলী জাহযামী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোক্ত হাদীসের সমার্থবোধক হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৫৮, ইসলামিক সেন্টার ৫৬৮৮)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5854,
			"arabicnumber": "2242.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৭, আন্তর্জাতিক নাম্বারঃ ২২৪২ ৫৭৪৭-(…/…) হারূন ইবনু আবদুল্লাহ ও আবদুল্লাহ ইবনু জাফার (রহঃ) ... ইবনু উমার (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ রকম বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৫৯, ইসলামিক সেন্টার ৫৬৮৯)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5855,
			"arabicnumber": "2243.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৮, আন্তর্জাতিক নাম্বারঃ ২২৪৩ ৫৭৪৮-(১৫২/২২৪৩) আবূ কুরায়ব (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একটি মেয়ে লোককে একটি বিড়ালের কারণে শাস্তি দেয়া হয়। সে নিজেও বিড়ালটিকে পানাহার করায়নি এবং তাকে ছেড়েও দেয়নি যাতে করে সে (নিজে) জমিনের পোকা-মাকড় খেতে পারে। (ইসলামিক ফাউন্ডেশন ৫৬৬০, ইসলামিক সেন্টার ৫৬৯০)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5856,
			"arabicnumber": "2243.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৪৯, আন্তর্জাতিক নাম্বারঃ ২২৪৩ ৫৭৪৯-(…/...) আবূ কুরায়ব ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... হিশাম (রহঃ) উপরোল্লিখিত সূত্রে হাদীস বর্ণনা করেছেন। তাদের উভয়ের বর্ণিত হাদীসে আছে, সে তাকে আটকে রাখল। (এছাড়া প্রথম সানদের) বর্ণনাকারী আবূ মু'আবিয়াহ্ (রহঃ) এর বর্ণিত হাদীসে আছে, জমিনের কীটপতঙ্গ। (অর্থাৎ-خَشَاشِ শব্দের স্থানেحَشَرَاتِ (অর্থ একই) শব্দ আছে। (ইসলামিক ফাউন্ডেশন ৫৬৬১, ইসলামিক সেন্টার ৫৬৯১)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5857,
			"arabicnumber": "2243.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫০, আন্তর্জাতিক নাম্বারঃ ২২৪৩ ৫৭৫০-(…/...) মুহাম্মাদ ইবনু রাফি ও আবদ ইবনু হুমায়দ (রহঃ) ...... আবূ হুরাইরাহ্ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (পূর্বোল্লিখিত সানাদের) বর্ণনাকারী হিশাম ইবনু উরওয়াহ্ (রহঃ) বর্ণিত হাদীসের মর্মে বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৬২, ইসলামিক সেন্টার ৫৬৯২)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5858,
			"arabicnumber": "2243.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫১, আন্তর্জাতিক নাম্বারঃ ২২৪৩ ৫৭৫১-(…/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পূর্ব বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৬৬৩, ইসলামিক সেন্টার ৫৬৯৩)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5859,
			"arabicnumber": "2244",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫২, আন্তর্জাতিক নাম্বারঃ ২২৪৪ ৫৭৫২-(১৫৩/২২৪৪) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জনৈক লোক কোন রাস্তা দিয়ে হাঁটছিল, এমতাবস্থায় সে খুব তৃষ্ণার্ত হলো। সে একটি কূপ দেখতে পেয়ে তাতে নেমে পড়ল এবং পানি পান করল। তারপর সে বেরিয়ে এলো। সে সময় দেখতে পেল যে, (তৃষ্ণায় কাতর) একটি কুকুর জিভ বের করে হাপাচ্ছে আর মাটি চাটছে। লোকটি (মনে মনে) বলল, কুকুরটিকে আমার মতো তীব্র তৃষ্ণায় পেয়েছে। তখন সে কুয়ায় নামল এবং তার (চামড়ার) মোজায় পানি ভরল। তারপরে সে তার মুখে বন্ধ করে উপরে উঠল এবং কুকুরটিকে পান করাল। মহান আল্লাহ তার (এ আমলের) কদর করলেন এবং তাকে মাফ করে দিলেন। (সাহাবীগণ) প্রশ্ন করলেন, হে আল্লাহর রসূল! তাহলে কি আমাদের জন্য এসব প্রাণীর ব্যাপারেও (সদাচরণে) সাওয়াব রয়েছে? তিনি বললেন, প্রতিটি তাজা কলিজায় সাওয়াব রয়েছে। (ইসলামিক ফাউন্ডেশন ৫৬৬৪, ইসলামিক সেন্টার ৫৬৯৪)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5860,
			"arabicnumber": "2245.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫৩, আন্তর্জাতিক নাম্বারঃ ২২৪৫ ৫৭৫৩-(১৫৪/২২৪৫) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, এক বেশ্যা নারী কোন এক গরমের দিনে একটি কুকুরকে একটি কুয়ার পাশে ঘুরতে দেখতে পেল। সেটি তৃষ্ণায় তার জিভ বের করে হাপাচ্ছিল। তখন সে তার (চামড়ার) মোজা দ্বারা তার জন্য পানি তুলে আনল এবং পান করাল। অবশেষে তাকে ক্ষমা করে দেয়া হলো। (ইসলামিক ফাউন্ডেশন ৫৬৬৫, ইসলামিক সেন্টার ৫৬৯৫)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5861,
			"arabicnumber": "2245.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৫৪, আন্তর্জাতিক নাম্বারঃ ২২৪৫ ৫৭৫৪-(১৫৫/...) আবূ তাহির (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একটি কুকুর একটি (পানি ভর্তি) কূপের চতুর্দিকে ঘুরপাক খাচ্ছিল। তৃষ্ণায় যে প্রায় মৃত্যু পথযাত্রী হয়েছিল। সে সময় বনী ইসরাঈলের পতিতাদের এক পতিতা তাকে লক্ষ্য করলো এবং (দয়ার্দ্র হয়ে) সে তার (চামড়ার) মোজা খুলে ফেলল এবং তার জন্য পানি উঠিয়ে এনে তাকে পান করিয়ে দিল। যার কারণে তাকে ক্ষমা করে দেয়া হলে। (ইসলামিক ফাউন্ডেশন ৫৬৬৬, ইসলামিক সেন্টার ৫৬৯৬)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 212
			}
		}
	]
}