{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"41": "The Book of Poetry"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5887,
			"arabicnumber": "2255.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮০, আন্তর্জাতিক নাম্বারঃ ২২৫৫ ৫৭৮০-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া ও যুহায়র ইবনু হারব (রহঃ) ..... আমর ইবনু শারীদ তার পিতা শারীদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে কবিতা আবৃতি করে শুনাতে বললেন, তারপর (উপরোক্ত) বর্ণনাকারী ইবরাহীম ইবনু মাইসারাহ (রহঃ) বর্ণিত হাদীসের অবিকল হাদীস বর্ণনা করেছেন। আর এছাড়াও তিনি বর্ধিত বলেছেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ 'সে তো মুসলিম হয়ে গিয়েছিল প্রায়। আর (অন্য সানাদের) বর্ণনাকারী ইবনু মাহদী (রহঃ) বর্ণিত হাদীসে আছে, তিনি বললেন, সে তো তার কবিতায় মুসলিম হওয়ার নিকটবর্তী হয়ে গিয়েছিল। (ইসলামিক ফাউন্ডেশন ৫৬৯০, ইসলামিক সেন্টার ৫৭২২)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5888,
			"arabicnumber": "2256.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮১, আন্তর্জাতিক নাম্বারঃ ২২৫৬ ৫৭৮১-(২/২২৫৬) আবূ জাফার মুহাম্মাদ ইবনু সাব্বাহ ও আলী ইবনু হুজর সা’দী (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, আরবদের কবিতা মালার মধ্যে সবচেয়ে বেশী কাব্যময় বাণী হচ্ছে লাবীদের এ উক্তি। যেমন أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ \"জেনে রেখ, আল্লাহ ছাড়া যা কিছু রয়েছে সব বাতিল।\" (ইসলামিক ফাউন্ডেশন ৫৬৯১, ইসলামিক সেন্টার ৫৭২৩)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5889,
			"arabicnumber": "2256.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮২, আন্তর্জাতিক নাম্বারঃ ২২৫৬ ৫৭৮২-(৩/…) মুহাম্মদ ইবনু হাতিম ইবনু মাইমুন (রহঃ) ...... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কবির কবিতার মাঝে সর্বধিক সত্য বাণী লাবীদের কথা أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ আল্লাহ ব্যতীত যা রয়েছে পৃথিবীতে সব বাতিল। আর উমাইয়াহ ইবনু আবূস্ সালত তো প্রায় মুসলিম হয়েই গিয়েছিলেন। (ইসলামিক ফাউন্ডেশন ৫৬৯২, ইসলামিক সেন্টার ৫৭২৪)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5890,
			"arabicnumber": "2256.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৩, আন্তর্জাতিক নাম্বারঃ ২২৫৬ ৫৭৮৩-(৪/...) ইবনু আবূ উমার (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন সবচেয়ে সত্য শ্লোক যা কোন কবি বলেছেন (তা হলঃ) أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ আল্লাহ ব্যতীত যা কিছু আছে, সব ব্যর্থ ও বাতিল’। আর ইবনু আবুস সালত তো প্রায় মুসলিম হয়ে গিয়েছিল। (ইসলামিক ফাউন্ডেশন ৫৬৯৩, ইসলামিক সেন্টার ৫৭২৫)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5891,
			"arabicnumber": "2256.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৪, আন্তর্জাতিক নাম্বারঃ ২২৫৬ ৫৭৮৪-(৫/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, কবিগণ যা বলেছেন, তার মধ্যে সবচেয়ে বেশী সত্য পংক্তি হলো- أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ \"জেনে রেখ, আল্লাহ ছাড়া আর যা কিছু আছে সব বাতিল ও ধ্বংসপ্রাপ্ত।\" (ইসলামিক ফাউন্ডেশন ৫৬৯৪, ইসলামিক সেন্টার ৫৭২৬)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5892,
			"arabicnumber": "2256.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৫, আন্তর্জাতিক নাম্বারঃ ২২৫৬ ৫৭৮৫-(৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি কোন কবি যা বলে তার মধ্যে অধিকতর সত্য কথা হলো লাবীদ এর কথা أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلٌ \"জেনে রেখ! আল্লাহ ব্যাতিত যা কিছু আছে তা বাতিল।\" এ রাবী এর বেশি বলেননি। (ইসলামিক ফাউন্ডেশন ৫৬৯৫, ইসলামিক সেন্টার ৫৭২৭)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5893,
			"arabicnumber": "2257",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৬, আন্তর্জাতিক নাম্বারঃ ২২৫৭ ৫৭৮৬-(৭/২২৫৭) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও আবূ সাঈদ আল আশাজ্জ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোকের পেট পুঁজ দিয়ে ভর্তি হয়ে যাওয়া যা তার পেট পচিয়ে বিনষ্ট করে দেয়, তা (পেট) কবিতায় ভর্তি হওয়ার চাইতে উত্তম। বর্ণনাকারী আবূ বাকর (রহঃ) বলেন, তবে (আমার উস্তায বর্ণনাকারী) হাফস (রহঃ) এর বর্ণনাতে يَرِيهِ তথা 'পঁচিয়ে বিনষ্ট করে দেয়' কথাটি বলেননি। (ইসলামিক ফাউন্ডেশন ৫৬৯৬, ইসলামিক সেন্টার ৫৭২৮)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5894,
			"arabicnumber": "2258",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৭, আন্তর্জাতিক নাম্বারঃ ২২৫৮ ৫৭৮৭-(৮/২২৫৮) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... সা'দ (রাযিঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, কোন লোকের পেট পুঁজ দিয়ে ভরাট হয়ে যাওয়া যা তার পেটকে পঁচিয়ে বিনষ্ট করে দেয়, তা কবিতায় ভর্তি হওয়ার চেয়ে উত্তম। (ইসলামিক ফাউন্ডেশন ৫৬৯৭, ইসলামিক সেন্টার ৫৭২৯)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5895,
			"arabicnumber": "2259",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৮, আন্তর্জাতিক নাম্বারঃ ২২৫৯ ৫৭৮৮-(৯/২২৫৯) কুতাইবাহ ইবনু সাঈদ সাকাফী (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আরজ অঞ্চলে ভ্রমণ করছিলাম। সে সময় এক কবি কবিতা আবৃতি করতে করতে আসতে লাগল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ শাইতানটাকে ধরে ফেল, অথবা (বর্ণনায় সংশয় তিনি বললেন) শাইতানটাকে বাধা দাও। কোন ব্যক্তির পেট পুঁজ ভর্তি হয়ে যাওয়া কবিতায় ভর্তি হওয়া হতে উত্তম। (ইসলামিক ফাউন্ডেশন ৫৬৯৮, ইসলামিক সেন্টার ৫৭৩০)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5896,
			"arabicnumber": "2260",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৭৮৯, আন্তর্জাতিক নাম্বারঃ ২২৬০ ৫৭৮৯-(১০/২২৬০) যুহায়র ইবনু হারব (রহঃ) ..... বুরাইদাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক পাশা খেলা খেলল, সে যেন তার হাত শুকরের গোশত ও রক্তে রঙিন করে তুলল। (ইসলামিক ফাউন্ডেশন ৫৬৯৯, ইসলামিক সেন্টার ৫৭৩১)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		}
	]
}