{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 384,
			"arabicnumber": "151.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ২৭৭, আন্তর্জাতিক নাম্বারঃ ১৫১ ২৭৭-(.../...) আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আসমা আয যুবাঈ (রহঃ) ..... সাঈদ ইবনু মুসাইয়্যাব ও আবূ উবায়দ (রহঃ) উভয়ে আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরের হাদীসের অবিকল বর্ণনা করেছেন। যেরূপ বর্ণনা করেছেন ইউনুস (রহঃ) যুহরী (রহঃ) হতে। তবে মালিক (রহঃ) তার হাদীসে কথাটির পর উল্লেখ করেন যে, \"বরং আমার অন্তরের প্রশান্তির জন্যে\"। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আয়াতটি শেষ পর্যন্ত তিলাওয়াত করেন। 'আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) থেকে মালিক এর সূত্রে বর্ণিত হাদীসের অনুরূপ বর্ণনা করেছেন। তিনি বলেন, এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আয়াতটি শেষ পর্যন্ত তিলাওয়াত করেন। (ইসলামিক ফাউন্ডেশনঃ ২৮০, ২৮১; ইসলামিক সেন্টারঃ ২৯১, ২৯২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5938,
			"arabicnumber": "2276",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩২, আন্তর্জাতিক নাম্বারঃ ২২৭৬ ৫৮৩২-(১/২২৭৬) মুহাম্মাদ ইবনু মিহরান আর রাযী ও মুহাম্মাদ ইবনু ‘আবদুর রহমান ইবনু সাহম (রহঃ) ...... আবূ আম্মার শাদ্দাদ (রহঃ) হতে বর্ণিত। তিনি ওয়াসিলাহ্ ইবনু আসকা (রহঃ) কে বলতে শুনেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ মহান আল্লাহ ইসমাঈল (আঃ) এর সন্তানদের থেকে কিনানাহ-কে চয়ন করে নিয়েছেন, আর কিনানাহ ('র বংশ) হতে, কুরায়শ' কে বাছাই করে নিয়েছেন আর কুরায়শ (বংশ) হতে বানু হাশিমকে বাছাই করে নিয়েছেন এবং বানু হাশিম হতে আমাকে বাছাই করে নিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৭৩৯, ইসলামিক সেন্টার ৫৭৭০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5939,
			"arabicnumber": "2277",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৩, আন্তর্জাতিক নাম্বারঃ ২২৭৭ ৫৮৩৩-(২/২২৭৭) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি মক্কায় একটি পাথরকে জানি, যে আমার (নবীরূপে) প্রেরিত হওয়ার আগেও আমাকে সালাম করত; আমি এখনও তাকে সন্দেহাতীতভাবে চিনতে পারি। (ইসলামিক ফাউন্ডেশন ৫৭৪০, ইসলামিক সেন্টার ৫৭৭১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5940,
			"arabicnumber": "2278",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৪, আন্তর্জাতিক নাম্বারঃ ২২৭৮ ৫৮৩৪-(৩/২২৭৮) হাকাম ইবনু মূসা আবূ সালিহ্ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কিয়ামতের দিন আদম সন্তানদের সরদার হব এবং আমিই প্রথম ব্যক্তি যার কবর খুলে যাবে এবং আমিই প্রথম সুপারিশকারী ও প্রথম সুপারিশ গৃহীত ব্যক্তি। (ইসলামিক ফাউন্ডেশন ৫৭৪১, ইসলামিক সেন্টার ৫৭৭২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5941,
			"arabicnumber": "2279.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৫, আন্তর্জাতিক নাম্বারঃ ২২৭৯ ৫৮৩৫-(৪/২২৭৯) আবূ রাবী' সুলাইমান ইবনু দাউদ আতাকী (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানি আনতে বললেন, তখন একটি প্রশস্ত তল বিশিষ্ট অগভীর বর্তন নিয়ে আসা হলো। (তিনি তাতে হাত রেখে বারাকাতের দুআ করলেন) এবং লোকেরা ওযু করতে লাগল। আমি তাদের সংখ্যা ষাট হতে আশির মাঝে ধারণা করলাম। বর্ণনাকারী বলেন, আমি পানির দিকে চেয়ে থাকলাম- যা তার আঙ্গুলসমূহের মাঝ থেকে ফোয়ারার মতো বেরিয়ে আসছিল। (ইসলামিক ফাউন্ডেশন ৫৭৪২, ইসলামিক সেন্টার ৫৭৭৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5942,
			"arabicnumber": "2279.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৬, আন্তর্জাতিক নাম্বারঃ ২২৭৯ ৫৮৩৬-(৫/...) ইসহাক ইবনু মূসা আনসারী ও আবূ তাহির (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে লক্ষ্য করলাম, তখন আসরের সালাতের সময় হয়ে গিয়েছিল আর লোকেরা ওযুর পানি সন্ধান করছিল; কিন্তু তারা খুঁজে পেল না। এ সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে কিছু ওযুর পানি আনা হলো। রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে পানির বর্তনে তার হাত রেখে দিলেন এবং লোকদের তা হতে ওযু করতে বললেন। বর্ণনাকারী বলেন, আমি দেখলাম, পানি তার অঙ্গুলিসমূহের নিচ থেকে উচ্ছল তরঙ্গের মত বেরিয়ে আসছে। তখন লোকেরা ওযু করল, এমনকি তাদের শেষ লোক পর্যন্ত সবাই ওযু করতে সক্ষম হলো। (ইসলামিক ফাউন্ডেশন ৫৭৪৩, ইসলামিক সেন্টার ৫৭৭৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5943,
			"arabicnumber": "2279.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৭, আন্তর্জাতিক নাম্বারঃ ২২৭৯ ৫৮৩৭-(৬/...) আবূ গাসসান মিসমাঈ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তার সাহাবীগণ যাওরা নামক স্থানে ছিলেন। রাবী বলেন, যাওরা হলো মদীনার বাজার ও মসজিদের সন্নিকটে একটি স্থান। সে সময় তিনি একটি পাত্র নিয়ে আসতে বললেন, যাতে অল্প পানি ছিল। তিনি তার (হাতের) মুষ্ঠি তাতে রাখলেন। তখন তার অঙ্গুলিসমূহের মধ্য হতে (পানি) উতড়িয়ে বের হতে লাগল আর তার সাহাবীগণ সবাই ওযু করলেন। বর্ণনাকারী কাতাদাহ্ (রহঃ) বলেন, আমি প্রশ্ন করলাম, হে আবূ হামযাহ (রাযিঃ)! তারা কতজন ছিলেন? তিনি বললেন, তারা ছিলেন তিনশ’ জনের মতো। (ইসলামিক ফাউন্ডেশন ৫৭৪৪, ইসলামিক সেন্টার ৫৭৭৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5944,
			"arabicnumber": "2279.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৮, আন্তর্জাতিক নাম্বারঃ ২২৭৯ ৫৮৩৮-(৭/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাওরা'য় ছিলেন। সে সময় একটি পানির পেয়ালা নিয়ে আসা হলো, যার পানিতে তার অঙ্গুলিসমূহ ডুবছিল না অথবা ঐ পরিমাণ, যা তার অঙ্গুলিসমূহ ডুবাতে পারে না। তারপর (পূর্বোল্লিখিত হাদীসের) বর্ণনাকারী হিশাম (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৪৫, ইসলামিক সেন্টার ৫৭৭৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5945,
			"arabicnumber": "2280",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৩৯, আন্তর্জাতিক নাম্বারঃ ২২৮০ ৫৮৩৯-(৮/২২৮০) সালামাহ্ ইবনু শাবীব (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত যে, উম্মু মালিক (রাযিঃ) তার একটি চামড়ার পেয়ালায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য ঘি উপঢৌকন পাঠাতেন। (কোন কোন সময়) তার ছেলেরা তার নিকট এসে (রুটি মাখাবার জন্য) তরকারি চাইত। কিন্তু তখন তাদের নিকট কিছু থাকত না। তাই তিনি (উম্মু মালিক) সে পেয়ালাটির নিকট যেতেন যাতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য উপঢৌকন প্রেরণ করতেন। তখন তিনি তাতে কিছু ঘি পেয়ে যেতেন। তারপর তা তার ঘরের (রুটি মাখাবার) তরকারির কাজ দিতে থাকল। যে পর্যন্ত না সেটি (আঙ্গুল দিয়ে মুছে) নিংড়ে ফেললেন। সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলে তিনি বললেনঃ তুমি সেটি নিংড়ে ফেলেছ? তিনি বললেন, হ্যাঁ! তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তুমি সেটিকে (না মুছে) যথাবস্থায় রেখে দিলে তা কিছু মওজুদ থেকেই যেত। (ইসলামিক ফাউন্ডেশন ৫৭৪৬, ইসলামিক সেন্টার ৫৭৭৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5946,
			"arabicnumber": "2281",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪০, আন্তর্জাতিক নাম্বারঃ ২২৮১ ৫৮৪০-(৯/২২৮১) সালামাহ ইবনু শাবীব (রহঃ) ... জাবির (রাযিঃ) হতে রিওয়ায়াত করেন যে, জনৈক লোক খাবার চাইতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলো। তিনি তাকে অর্ধ ওয়াস্‌ক যব খাবার জন্য দিলেন। লোকটি তা থেকে আহার করতে থাকল আর তার স্ত্রী এবং তাদের (দু’জনের) মেহমানরাও। পরিশেষে সে (একদিন) তা মেপে দেখল। ফলে তা ফুরিয়ে গেলে। তারপরে সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট (অভিযোগ নিয়ে) আসল। তিনি বললেন, যদি তুমি তা মেপে না দেখতে, তাহলে তোমরা তা থেকে আহার করতে থাকতে এবং তা তোমাদের জন্য (দীর্ঘ সময়) বিদ্যমান থাকত। (ইসলামিক ফাউন্ডেশন ৫৭৪৭, ইসলামিক সেন্টার ৫৭৭৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5947,
			"arabicnumber": "706.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪১, আন্তর্জাতিক নাম্বারঃ ৭০৬ ৫৮৪১-(১০/৭০৬) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... মুআয ইবনু জাবাল (রাযিঃ) হতে বর্ণিত। তিনি বলেন, তাবুক যুদ্ধের বছর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে (যুদ্ধে) বের হলাম। (এ সফরে) তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সালাত (সালাত/নামাজ/নামায) একসাথে আদায় করতেন। অর্থাৎ, যুহর ও আসর একসাথে আদায় করতেন, আর মাগরিব ও ইশা একত্রে আদায় করতেন। পরিশেষে একদিন (এমন) হলো যে, সালাত (সালাত/নামাজ/নামায) দেরিতে আদায় করলেন। তারপর বের হয়ে এসে যুহর ও আসর একসাথে আদায় করলেন, তারপর (তাঁবুতে) ঢুকলেন। অতঃপর আবার বেরিয়ে এলেন এবং মাগরিব ও ইশা একসাথে আদায় করলেন। অতঃপর বললেন, ইনশাআল্লাহ তোমরা আগামীকাল তাবুক জলাশয়ে পৌছবে, তবে চাশতের সময় না হওয়া পর্যন্ত তোমরা সেখানে পৌছতে পারবে না। তোমাদের মাঝে যে (ই) সেখানে (প্রথমে) পৌছবে সে যেন তার পানির কিছুই স্পর্শ না করে- যতক্ষণ না আমি এসে পৌছি। আমরা (ঠিক সময়েই) সেখানে পৌঁছলাম। (কিন্তু) ইতোমধ্যে দু’ লোক আমাদের পূর্বে সেখানে পৌছে গিয়েছিল। আর প্রসবণটিতে জুতার ফিতার ন্যায় ক্ষীণ ধারায় সামান্য পানি বের হচ্ছিল। মুআয বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ দু'জনকে প্রশ্ন করলেন, তোমরা তা হতে কিছু পানি ছুয়েছে কি? ... তারা উভয়ে বলল, হ্যাঁ! তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের দু'জনকে ভৎসনা করলেন। আর আল্লাহর যা ইচ্ছা তাই তাদের বললেন। বর্ণনাকারী বলেন, এরপর লোকেরা তাদের হাত দিয়ে অঞ্জলি ভরে ভরে প্রসবণ হতে অল্প অল্প করে (পানি) তুলল, পরিশেষে তা একটি পাত্রে কিছু পরিমাণ জমা হলো। বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মাঝে তার দু'হাত এবং মুখ ধুলেন এবং তারপরে তা (পানি) তাতে (প্রসবণে) উল্টিয়ে (ঢেলে) দিলেন। ফলে পানির প্রসবণটি প্রবল পানি ধারায় কিংবা বর্ণনাকারী বলেছেন, অধিক পরিমাণে প্রবাহিত হতে লাগল। আবূ আলী (রহঃ) সন্দেহ করেছেন যে, বর্ণনাকারী এর মধ্যে কোনটি বলেছেন। এবার লোকেরা পানি প্রয়োজন মতো পান করল। পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে মুআয! তুমি যদি দীর্ঘায়ু হও, তবে আশা করা যায় যে, তুমি দেখতে পাবে প্রসবণের এ জায়গাটি বাগানে ভরে গেছে। (ইসলামিক ফাউন্ডেশন ৫৭৪৮, ইসলামিক সেন্টার ৫৭৭৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5948,
			"arabicnumber": "1392.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪২, আন্তর্জাতিক নাম্বারঃ ১৩৯২ ৫৮৪২-(১১/১৩৯২) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... আবূ হুমায়দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে তাবুক যুদ্ধের জন্য বের হলাম। আমরা ‘ওয়াদিল কুরা' এলাকায় এক মহিলার একটি বাগানের নিকট পৌছলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা এর পরিমাণ ধারণা করো। আমরা এর পরিমাণ অনুমান করলাম। আর রসূলুল্লাহ দশ ওয়াস্‌ক (প্রায় পঞ্চাশ মণ) পরিমাণ ধারণা করলেন এবং (মেয়ে লোকটিকে) বললেন, ইনশাআল্লাহ আমরা তোমার এখানে ফিরে আসা পর্যন্ত এ পরিমাণ ধরে রাখো। তারপরে আমরা অগ্রসর হলাম এবং তাবুকে পৌছে গেলাম। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আজ রাতে প্রচণ্ড বায়ু প্রবাহ তোমাদের উপর দিয়ে বয়ে যাবে। তাই তোমাদের কেউ যেন তার মধ্যে দাড়িয়ে না থাকে এবং যার উট আছে সে যেন তার দড়ি মজবুত করে বেঁধে রাখে। অতঃপর দেখা গেল, অনেক বাতাস প্রবাহিত হলো। জনৈক লোক দাঁড়ালে বাতাস তাকে তুলে নিয়ে পরিশেষে তাই নামক পাহাড়ে ফেলে দিল। আর (ঐ সময় নিকটবর্তী) আয়লার অঞ্চল প্রধান (শাসক) ইবনুল আলমা'-র দূত রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট একটি পত্র নিয়ে আসলো এবং তিনি তাকে একটি সাদা খচ্চর উপটৌকন পাঠালেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তার নিকট চিঠি লিখে পাঠালেন এবং তাকে একটি চাদর উপটৌকন হিসেবে প্রেরণ করলেন। এরপর আমরা এগিয়ে চলতে চলতে ‘ওয়াদিল কুরা পৌঁছলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্ত্রীলোকটিকে (বাগানের মালিক) তার বাগান সম্পর্কে প্রশ্ন করলেন যে, তার ফল কি পরিমাণে পৌছেছে? সে বলল, দশ ওয়াস্‌ক। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি দ্রুত যাচ্ছি। তোমাদের মাঝে যার ইচ্ছা হয় সে আমার সাথে অবিলম্বে যেতে পারে। আর যার ইচ্ছা সে থেকে যেতে পারে। অতঃপর আমরা বেরিয়ে গেলাম। পরিশেষে মদীনার নিকটবর্তী এলাকায় পৌছলাম। সে সময় তিনি বললেন, এ (মদীনাহ) হলো 'তাবা' পবিত্র ও উত্তম জায়গা। আর এ হলো উহুদ। আর তা এমন পর্বত, যে আমাদের ভালবাসে এবং আমরাও তাকে ভালবাসি। এরপর বললেন, আনসারীদের শ্রেষ্ঠ পরিবার বানু নাজ্জার, এরপর বানু আবদুল আশহাল, তারপর বানূ হারিস ইবনু খাযরাজ, অতঃপর বানু সাইদাহ পরিবার। আর আনসারদের প্রতিটি সম্প্রদায়ই ভাল। সাদ ইবনু উবাদাহ্ (রাযিঃ) আমাদের সঙ্গে এসে একত্রিত হলে (তার সম্প্রদায়ের) আবূ উসায়দ (রাযিঃ) তাকে বললেন, আপনি কি দেখেননি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসার সম্প্রদায়েরগুলোর মাঝে ধারাবাহিকভাবে শ্রেষ্ঠত্ব বর্ণনা করেছেন এবং আমাদের সম্প্রদায়কে তালিকার শেষে রেখেছেন। তখন সা'দ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে গেলেন এবং বললেন, হে আল্লাহর রসূল! আপনি আনসার সম্প্রদায়গুলোর শ্রেষ্ঠত্ব বর্ণনা করেছেন এবং আমাদের শেষে রেখেছেন! তখন তিনি বললেন, শ্রেষ্ঠ তালিকাতে অন্তর্ভুক্ত হওয়াও কি তোমাদের জন্য যথেষ্ঠ নয়? (ইসলামিক ফাউন্ডেশন ৫৭৪৯, ইসলামিক সেন্টার ৫৭৮০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5949,
			"arabicnumber": "1392.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৩, আন্তর্জাতিক নাম্বারঃ ১৩৯২ ৫৮৪৩-(১২/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রাযিঃ) ..... আমর ইবনু ইয়াহইয়া (রহঃ) উল্লেখিত সূত্রে আনসারদের প্রতিটি সম্প্রদায়ের কল্যাণ আছে পর্যন্ত বর্ণনা করেছেন। তিনি পরবর্তী অংশ– সা'দ ইবনু উবাদাহ (রাযিঃ) সম্বন্ধে বর্ণনা উল্লেখ করেননি। তবে উহায়ব (রহঃ) তার বর্ণিত হাদীসে বেশি উল্লেখ করেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার (ইবনুল আলমা)-র জন্য তাদের জনপদগুলো লিখে দিলেন। উহায়ব (রহঃ) এর বর্ণিত হাদীসে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তার নিকট চিঠি লিখে প্রেরণ করলেন- উক্তিটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৭৫০, ইসলামিক সেন্টার ৫৭৮১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5950,
			"arabicnumber": "843.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৪, আন্তর্জাতিক নাম্বারঃ ৮৪৩ ৫৮৪৪-(১৩/৮৪৩) আবদ ইবনু হুমায়দ, আবূ ইমরান মুহাম্মাদ ইবনু জাফর ইবনু যিয়াদ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে নাজদ এর দিকে একটি জিহাদে গেলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (পেছন হতে এসে) একটি কাটাবন যুক্ত উপত্যকায় আমাদের পেলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি গাছের তলায় অবতরণ করলেন এবং তার তলোয়ারটি সে বৃক্ষের একটি শাখায় লটকিয়ে রাখলেন। বর্ণনাকারী জাবির (রাযিঃ) বলেন, আর লোকেরা গাছের ছায়ায় আশ্রয় নেয়ার জন্য প্রান্তরে ছড়িয়ে পড়ল। বর্ণনাকারী বলেন, পরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ জনৈক লোক আমার নিকট আসলো তখন আমি ঘুমন্ত। সে তলোয়ারটি হাতে নিল। আমি জেগে উঠলাম, আর সে আমার মাথার কাছে দণ্ডায়মান। আমি কিছু বুঝে না উঠতেই (দেখি) উন্মুক্ত তলোয়ারটি তার হাতে নিয়ে দাঁড়িয়ে। অতঃপর সে আমাকে বলল, কে তোমাকে আমা হতে রক্ষা করবে? তিনি বলেন, আমি বললাম, আল্লাহ! সে দ্বিতীয় বার বলল, তোমাকে আমার হাত থেকে কে রক্ষা করবে? তিনি বলেন, আমি বললাম, আল্লাহ! রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে তখন তলোয়ারটি ভিতরে ঢুকিয়ে রাখল। আর ওই যে সে বসে আছে। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কিছুই বললেন না। (ইসলামিক ফাউন্ডেশন ৫৭৫১, ইসলামিক সেন্টার ৫৭৮২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5951,
			"arabicnumber": "843.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৫, আন্তর্জাতিক নাম্বারঃ ৮৪৩ ৫৮৪৫-(১৪/...) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী ও আবূ বাকর ইবনু ইসহাক (রহঃ) ..... সিনান ইবনু আবূ সিনান দুওয়ালী ও আবূ সালামাহ্ ইবনু আবদুর রহমান (রহঃ) হতে হাদীস রিওয়ায়াত করেন যে, জাবির ইবনু আবদুল্লাহ আনসারী (রাযিঃ) ..... তিনি ছিলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একজন সাহাবী। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে নাজদ অভিমুখে একটি মিশনে গেলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ফিরে এলেন তখন তিনিও তার সাথে ফিরে আসেন। এরপর দুপুরের বিশ্রামকালে সকলে উপস্থিত হলো .....। তারপর ইবরাহীম ইবনু সা'দ ও মা'মার (রহঃ) বর্ণিত হাদীসের হুবহু উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৫২, ইসলামিক সেন্টার ৫৭৮৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5952,
			"arabicnumber": "843.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৬, আন্তর্জাতিক নাম্বারঃ ৮৪৩ ৫৮৪৬-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে এগিয়ে চললাম। পরিশেষে আমরা যখন যাতুর রিকা'য় পৌঁছলাম .....। এরপর যুহরী (রহঃ) বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু তিনি তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আর কোন কিছু বলেননি উক্তটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৭৫৩, ইসলামিক সেন্টার ৫৭৮৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5953,
			"arabicnumber": "2282",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৭, আন্তর্জাতিক নাম্বারঃ ২২৮২ ৫৮৪৭-(১৫/২২৮২) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ আমির আশ'আরী ও মুহাম্মাদ ইবনু আলা (রহঃ) ..... আবূ বুরদাহ (রাযিঃ) ও আবূ মূসা (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, আল্লাহ তা'আলা আমাকে যে হিদায়াত ও ইলম সহকারে প্রেরণ করেছেন; তার দৃষ্টান্ত সে বৃষ্টির মত যা কোন ভূমিতে বর্ষিত হলো, আর সে ভূমির উৎকৃষ্ট কতকাংশ পানি গ্রহণ করে এবং প্রচুর তরতাজা ঘাস-পাতা উৎপাদন করে। আর কতকাংশ হলো শক্ত মাটি, যা পানি আবদ্ধ রাখে, ফলে আল্লাহ তা'আলা তা দ্বারা মানুষের উপকার করেন এবং তারা তা থেকে পান করেন, (অন্যদের) পান করায় ও পশু চড়ায়। আর বৃষ্টি সে জমির আরও কিয়দংশ বর্ষিত হলো- যা উঁচু অনুর্বর, যা কোন পানি আবদ্ধ করে রাখে না আর কোন লতা-পাতাও উৎপাদিত করে না। সে উদাহরণ হলো সেসব লোকের- যারা আল্লাহর দীনের জ্ঞান অর্জন করে এবং আল্লাহ তাদের সেসব বস্তু দিয়ে উপকৃত করেন যা নিয়ে আল্লাহ আমাকে প্রেরণ করেছেন। ফলে সে ইলম অর্জন করে অন্যকেও শিক্ষা দেয়। আর তৃতীয় উদাহরণ হলো ঐ লোকদের যারা তার প্রতি মাথা উঁচু করেও তাকায় না এবং আল্লাহর ঐ হিদায়াতও কবুল করে না, যা নিয়ে আমি প্রেরিত হয়েছি। (ইসলামিক ফাউন্ডেশন ৫৭৫৪, ইসলামিক সেন্টার ৫৭৮৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5954,
			"arabicnumber": "2283",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৮, আন্তর্জাতিক নাম্বারঃ ২২৮৩ ৫৮৪৮–(১৬/২২৮৩) আবদুল্লাহ ইবনু বাররাদ আশ'আরী ও আবূ কুরায়ব (রহঃ) ..... আবূ মূসা (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উদাহরণ এবং আল্লাহ যা দিয়ে আমাকে প্রেরণ করেছেন তার উদাহরণ সে ব্যক্তির উপমার মতো যে তার স্বজাতির নিকট এসে বলে, হে আমার গোত্র! আমি আমার দু’ চোখে (শত্রু) সেনা দেখে এসেছি, আর আমি (সুস্পষ্ট) সতর্ককারী। সুতরাং আত্মরক্ষা করো। তখন তার গোত্রের একদল তার কথা মেনে নিল এবং রাতের অন্ধকারে সুযোগে (জায়গা ত্যাগ করে) চলে গেল। আর এক দল তাকে মিথ্যাবাদী সাব্যস্ত করে ভোর পর্যন্ত স্ব-স্থান হতে চলে গেল। ফলে (শত্রু) বাহিনী সকালে তাদের হামলা করল এবং তাদের সমূলে ধ্বংস করে দিল। সুতরাং এ হলো তাদের উপমা যারা আমার আনুগত্য করল এবং আমি যা নিয়ে এসেছি তার অনুকরণ করল এবং ওদের উদাহরণ যারা আমার অবাধ্য হলো এবং যে সত্য আমি নিয়ে এসেছি তাকে মিথ্যা প্রতিপন্ন করল। (ইসলামিক ফাউন্ডেশন ৫৭৫৫, ইসলামিক সেন্টার ৫৭৮৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5955,
			"arabicnumber": "2284.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৪৯, আন্তর্জাতিক নাম্বারঃ ২২৮৪ ৫৮৪৯-(১৭/২২৮৪) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উপমা ও আমার উম্মাতের উপমা সে ব্যক্তির উপমার মতো, যে অগ্নি প্রজ্জ্বলন করেছে ফলে মাকড় ও কীট-পতঙ্গ তাতে জুলতে লাগল। আমি তোমাদের কোমরবন্ধ ধরে (তোমাদের রক্ষার জন্যে) টানছি আর তোমরা সবাই যেন তাতে পড়তে যাচ্ছো। (ইসলামিক ফাউন্ডেশন ৫৭৫৬, ইসলামিক সেন্টার ৫৭৮৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5956,
			"arabicnumber": "2284.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫০, আন্তর্জাতিক নাম্বারঃ ২২৮৪ ৫৮৫০-(…/…) 'আমর আন্‌ নাকিদ ও ইবনু আবূ উমার (রহঃ) ..... আবূ যিনাদ (রহঃ) হতে উপরোক্ত সূত্রে হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৫৭, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5957,
			"arabicnumber": "2284.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫১, আন্তর্জাতিক নাম্বারঃ ২২৮৪ ৫৮৫১-(১৮/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... হাম্মাম ইবনু মুনাব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, এগুলো হলো সেসব (হাদীস), যা আবূ হুরাইরাহ্ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমাদের নিকট রিওয়ায়াত করেছেন। এরপর সেগুলো হতে তিনি কিছু হাদীস বর্ণনা করেন। তার একটি হলো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার অবস্থা সে লোকের অবস্থার মতো যে আগুন জ্বলিয়েছিল, তখন তাতে তার চতুষ্পার্শ্ব আলোকিত হলো, তখন পতঙ্গ ও সেসব জন্তু যা আগুনে পড়ে থাকে, তাতে পড়তে লাগল আর সে লোক সেগুলোকে বাধা দিতে লাগল। তবে তারা তাকে হারিয়ে দিয়ে তাতে ঢুকে পড়তে লাগল। তিনি বললেন, এটাই হলো তোমাদের অবস্থা আর আমার অবস্থা। আমি আগুন থেকে রক্ষার জন্য তোমাদের কোমরবন্ধগুলো ধরে টানি ও বলি যে, আগুন হতে দূরে থাকো, আগুন থেকে দূরে থাকো এবং তোমরা আমাকে পরাস্ত করে তার মধ্যে ঢুকে পড়ছে। (ইসলামিক ফাউন্ডেশন ৫৭৫৮, ইসলামিক সেন্টার ৫৭৮৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5958,
			"arabicnumber": "2285",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫২, আন্তর্জাতিক নাম্বারঃ ২২৮৫ ৫৮৫২-(১৯/২২৮৫) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উপমা ও তোমাদের উপমা সে লোকের উপমার মতো যে আগুন জ্বালালো, ফলে ফড়িং দল আর পতঙ্গ তাতে ঝাপিয়ে পড়তে লাগল আর সে লোক তাদের তা থেকে বিতাড়িত করতে লাগল। আমিও আগুন থেকে রক্ষার জন্য তোমাদের কোমরবন্ধ ধরে টানছি, আর তোমরা আমার হাত থেকে ছুটে যাচ্ছ। (ইসলামিক ফাউন্ডেশন ৫৭৫৯, ইসলামিক সেন্টার ৫৭৮৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5959,
			"arabicnumber": "2286.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৩, আন্তর্জাতিক নাম্বারঃ ২২৮৬ ৫৮৫৩-(২০/২২৮৬) আমর ইবনু মুহাম্মাদ আন্‌ নাকিদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার দৃষ্টান্ত এবং নবীগণের দৃষ্টান্ত সে লোকের দৃষ্টান্তের সাথে তুলনীয়, যে একটি অট্টালিকা প্রস্তুত করল এবং সে তা সুন্দর ও সুদৃশ্যপূর্ণ করল। পরে (তা দর্শনে আগত) লোকেরা তার চারদিকে ঘুরে দেখতে লাগল (এবং) বলতে লাগল যে, এর চাইতে সুন্দর কোন অট্টালিকা আমরা দেখিনি। কিন্তু এ একটি ইটের স্থান সমাপ্ত হয়নি। [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন] আমিই হলাম সে ইটখানি। (ইসলামিক ফাউন্ডেশন ৫৭৬০, ইসলামিক সেন্টার ৫৭৯০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5960,
			"arabicnumber": "2286.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৪, আন্তর্জাতিক নাম্বারঃ ২২৮৬ ৫৮৫৪-(২১/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনাব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, এ হলো সে সব হাদীস, যা আবূ হুরাইরাহ্ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট উল্লেখ করেছেন। তারপর তিনি কয়েকটি হাদীস বর্ণনা করেন। তার একটি হলো, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমার দৃষ্টান্ত ও আমার পূর্বেকার নবীগণের দৃষ্টান্ত সে লোকের উপমার মতো, যে কতকগুলো গৃহ বানালো, তা সুন্দর করল ও সুদৃশ্য করল এবং পূর্ণাঙ্গ করল; কিন্তু তার কোন একটির কোণে একটি ইটের স্থান ছাড়া (খালি রাখল)। লোকেরা সে ঘরগুলোর চারদিকে চক্কর দিতে লাগল আর সে ঘরগুলো তাদের মুগ্ধ করতে লাগল। পরিশেষে তারা বলতে লাগল, এখানে একখানি ইট লাগালেন না কেন? তাহলে তো আপনার অট্টালিকা পূর্ণাঙ্গ হত। অতঃপর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যে, আমি-ই হলাম সে ইটখানি। (ইসলামিক ফাউন্ডেশন ৫৭৬১, ইসলামিক সেন্টার ৫৭৯১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5961,
			"arabicnumber": "2286.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৫, আন্তর্জাতিক নাম্বারঃ ২২৮৬ ৫৮৫৫-(২২/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ও ইবনু হুজর (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমার উপমা এবং আমার পূর্ববর্তী নবীগণের উপমা সে লোকের উপমার মতো, যে একটি অট্টালিকা বানালো এবং তা সুন্দর ও সুচারুরূপে গড়ে তুলল, তবে তার কোণগুলোর কোন এক কোণায় একটি ইটের স্থান ব্যতীত। লোকেরা তার চারদিকে ঘুরে ঘুরে দেখতে লাগল আর তা দেখে আশ্চর্য হতে লাগল এবং পরস্পর বলতে লাগল, ঐ ইটখানি স্থাপন করা হলো না কেন? [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেনঃ আমি-ই সে ইটখানি আর আমি নবীগণের মোহর ও শেষ নবী। (ইসলামিক ফাউন্ডেশন ৫৭৬২, ইসলামিক সেন্টার ৫৭৯২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5962,
			"arabicnumber": "2286.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৬, আন্তর্জাতিক নাম্বারঃ ২২৮৬ ৫৮৫৬-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আবূ সাঈদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ আমার উপমা এবং নবীগণের উপমা ..... তারপর পূর্বোল্লিখিত হাদীসের অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৬৩, ইসলামিক সেন্টার ৫৭৯৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5963,
			"arabicnumber": "2287.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৭, আন্তর্জাতিক নাম্বারঃ ২২৮৭ ৫৮৫৭-(২৩/২২৮৭) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... জাবির (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উপমা এবং নবীগণের উপমা সে লোকের উপমা তুল্য, যে একটি বাড়ি তৈরি করল এবং সে তা সম্পূর্ণ ও পূর্ণাঙ্গ করল, তবে একটি ইটের স্থান ছাড়া। লোকেরা তাতে ঢুকতে লাগল এবং তা দেখে আশ্চর্য হতে লাগল এবং বলাবলি করতে থাকল, যদি এ একখানি ইটের স্থান খালি না থাকত (তবে কতই না উত্তম হত)। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমি হলাম সে ইটের স্থানে। আমি আগমন করলাম এবং নবীগণের পরম্পরা শেষ করলাম। (ইসলামিক ফাউন্ডেশন ৫৭৬৪, ইসলামিক সেন্টার ৫৭৯৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5964,
			"arabicnumber": "2287.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৮, আন্তর্জাতিক নাম্বারঃ ২২৮৭ ৫৮৫৮-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... সালীম ইবনু হাইয়ান (রহঃ) সূত্রে হুবহু হাদীস রিওয়ায়াত করেছেন। তবে তিনিأَتَمَّهَا (পরিপূর্ণ করেছে)-এর স্থলেأَحْسَنَهَا (সুন্দর করেছে) বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৬৪, ইসলামিক সেন্টার ৫৭৯৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5965,
			"arabicnumber": "2288",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৫৯, আন্তর্জাতিক নাম্বারঃ ২২৮৮ ৫৮৫৯-(২৪/২২৮৮) (ইমাম মুসলিম বলেন), আবূ উসামাহ্ (রহঃ) সূত্রে এ হাদীসটি আমার নিকট রিওয়ায়াত করা হয়েছে, আবূ মূসা (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ মহান আল্লাহ তা'আলা বলেন, আল্লাহ তা'আলা যখন তার বান্দাদের মধ্যে কোন উম্মাতের প্রতি রহমতের ইচ্ছা করেন, তখন তাদের নবীকে তাদের পূর্বেই তুলে নেন এবং তাকে তাদের যুগের অগ্রগণ্য ও পূর্ববর্তী করেন। আর যখন কোন উম্মাতকে বিনাশ করার ইচ্ছা করেন, তখন তাদের নবীর জীবিতাবস্থায় তাদের শাস্তি দেন এবং এ অবস্থায় তাদের বিনাশ করেন যে, তিনি (নবী) তা দেখতে পান। এরপর তাদের ধ্বংস দেখে তার চোখ শান্ত করেন, যেহেতু তারা তাকে অমান্য করেছিল ও তার আদর্শ অস্বীকার করেছিল (ইসলামিক ফাউন্ডেশন ৫৭৬৫, ইসলামিক সেন্টার ৫৭৯৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5966,
			"arabicnumber": "2289.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬০, আন্তর্জাতিক নাম্বারঃ ২২৮৯ ৫৮৬০-(২৫/২২৮৯) আহমাদ ইবনু ‘আবদুল্লাহ ইবনু ইউনুস (রহঃ) ..... জুনদাব (রাযিঃ) হতে বর্ণিত। তনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমি বলতে শুনেছি, আমি ‘হাওয’ এর নিকট তোমাদের জন্য অগ্রগামী হব। (ইসলামিক ফাউন্ডেশন ৫৭৬৬, ইসলামিক সেন্টার ৫৭৯৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5967,
			"arabicnumber": "2289.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬১, আন্তর্জাতিক নাম্বারঃ ২২৮৯ ৫৮৬১-(.../...) আবূ বাকর ইবনু আবূ শইবাহ আবূ কুরায়ব, উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ও মুহাম্মদ ইবনুল মুসান্না (রহঃ) ..... জুনদাব (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৬৭, ইসলামিক সেন্টার ৫৭৯৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5969,
			"arabicnumber": "2291.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5970,
			"arabicnumber": "2291.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬৪, আন্তর্জাতিক নাম্বারঃ ২২৯১ ৫৮৬৪-(…/...) হারূন ইবনু সাঈদ আইলী (রহঃ) ..... আবূ হাযিম (রহঃ) এর মাধ্যমে সাহল (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এবং নু'মান ইবনু আবূ 'আইয়্যাশ (রহঃ) এর মাধ্যমে আবূ সাঈদ খুদরী (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (পূর্ববর্তী) ইয়াকুব (রহঃ) এর হাদীসের অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৬৯, ইসলামিক সেন্টার ৫৮০০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5972,
			"arabicnumber": "2293",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬৬, আন্তর্জাতিক নাম্বারঃ ২২৯৩ ৫৮৬৬-(.../২২৯৩) বর্ণনাকারী (ইবনু আবূ মুলাইকাহ) বলেন, আর আসমা বিনতু আবূ বাকর (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি হাওযের সন্নিকটে থাকব, যাতে দেখতে পারি যে, তোমাদের মাঝে কারা আমার নিকট আসলো। আর আমার সম্মুখ থেকে কতক ব্যক্তিকে আটকানো হবে, তখন আমি বলব- ইয়া রাব! এরা তো আমার লোক এবং আমার উম্মাত। তখন বলা হবে, আপনি কি জানেন না যে, আপনার পরে এরা কি করেছে? আল্লাহর শপথ! এরা আপনার পরে এদের পিছনের দিকেই প্রত্যাবর্তন করেছে। বর্ণনাকারী (নাফি') বলেন, তাই বর্ণনাকারী ইবনু আবূ মুলাইকাহ্ (রহঃ) বলতেন, হে আল্লাহ! আমরা আপনার আশ্রয় চাচ্ছি, আমাদের পশ্চাতে ফিরে যাওয়া হতে এবং আমাদের দীনের বিষয়ে ফিতনায় আপতিত হওয়া থেকে। (ইসলামিক ফাউন্ডেশন ৫৭৭০, ইসলামিক সেন্টার ৫৮০১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5973,
			"arabicnumber": "2294",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬৭, আন্তর্জাতিক নাম্বারঃ ২২৯৪ ৫৮৬৭-(২৮/২২৯৪) ইবনু আবূ উমার (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তার সাহাবীগণের সামনে বলতে শুনেছি যে, আমি 'হাওয’-এর নিকট তোমাদের মধ্য হতে যারা আমার নিকট আসবে তাদের প্রতীক্ষায় থাকব। আল্লাহর শপথ! আমার কাছ থেকে অবশ্যই কিছু ব্যক্তিকে আলাদা করে দেয়া হবে। তখন আমি বলব, হে রব্ব! (এরা তো) আমার-ই এবং আমার উম্মাতেরই (লোক)। আল্লাহ বলবেন, আপনি অবশ্যই জানেন না, তারা আপনার পরে কি আমল করেছে। তারা তো তাদের পশ্চাতের দিকেই প্রত্যাবর্তন করেছে। (ইসলামিক ফাউন্ডেশন ৫৭৭১, ইসলামিক সেন্টার ৫৮০২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5974,
			"arabicnumber": "2295.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬৮, আন্তর্জাতিক নাম্বারঃ ২২৯৫ ৫৮৬৮-(২৯/২২৯৫) ইউনুস ইবনু আবদুল আ'লা সাদাফী (রহঃ) ..... রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি হাওযের (কাওসারের) ব্যাপারে লোকদেরকে আলোচনা করতে শুনতাম। কিন্তু আমি (নিজে) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ সম্পর্কে কিছু শুনিনি। পরে যখন একদিন ঐ ব্যাপারে আলোচনা আসলো- এ সময় একটি মেয়ে আমার চুল আঁচড়িয়ে দিচ্ছিল, তখন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সম্বোধন করতে শুনলাম, হে লোক সকল .....! তখন স্ত্রীলোকটিকে আমি বললাম, তুমি আমার হতে দূরে চলে যাও। সে বলল, তিনি তো পুরুষদের ডাক দিয়েছেন এবং স্ত্রীলোকদের ডাকেননি। আমি বললাম, আমিও তো লোকদের একজন। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি তোমাদের জন্য 'হাওয’ এর নিকট অগ্রগামী হব। তাই হুঁশিয়ার! আমার নিকট তোমাদের এমন কেউ যেন না আসে, যাকে আমার নিকট হতে দূরে সরিয়ে দেয়া হয়, যেমন হারানো উটকে ভাগিয়ে দেয়া হয়। আর আমি বলতে থাকব, কেন তাদের তাড়ানো হচ্ছে? তখন বলা হবে আপনি তো জানেন না, তারা আপনার পরে কী নতুন বিষয়ের আবিষ্কার করেছে? তখন আমিও বলব, দূর হও! (ইসলামিক ফাউন্ডেশন ৫৭৭২, ইসলামিক সেন্টার ৫৮০৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5975,
			"arabicnumber": "2295.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৬৯, আন্তর্জাতিক নাম্বারঃ ২২৯৫ ৫৮৬৯-(.../...) আবূ মা'ন রাকাশী, আবূ বাকর ইবনু নাফি’ ও ‘আবদ ইবনু হুমায়দ (রহঃ) ..... 'আবদুল্লাহ ইবনু রাফি হতে বর্ণিত। তিনি বলেন, উম্মু সালামাহ্ (রাযিঃ) বর্ণনা করতেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মিম্বারে দাঁড়িয়ে বলতে শুনলেন, হে লোক সকল .....। এ সময় উম্মু সালামাহ্ (রাযিঃ) চুল আঁচড়াচ্ছিলেন, তখন তিনি কেশ বিন্যাসকারিণীকে বললেন, আমার মাথা আঁচড়ানো বন্ধ রাখো। ..... অবশিষ্টাংশ বর্ণনাকারী কাসিম ইবনু আব্বাস (রাযিঃ) এর সানাদে বুকায়র (রহঃ) বর্ণিত হাদীসের অবিকল। (ইসলামিক ফাউন্ডেশন ৫৭৭৩, ইসলামিক সেন্টার ৫৮০৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5976,
			"arabicnumber": "2296.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭০, আন্তর্জাতিক নাম্বারঃ ২২৯৬ ৫৮৭০-(৩০/২২৯৬) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদিন বাইরে এসে উহুদবাসীদের জন্য জানাযার সালাতের মতো সালাত (সালাত/নামাজ/নামায) আদায় করলেন। তারপর মিম্বারের দিকে ফিরে এসে বললেন, আমি তোমাদের জন্য অগ্রগামী এবং তোমাদের ব্যাপারে সাক্ষী। আল্লাহর শপথ আমি এ মুহুর্তে আমার হাওয দেখতে পাচ্ছি। আর আমাকে অবশ্যই দুনিয়ার ধন-ভাণ্ডারসমূহের চাবিকাঠি কিংবা বলেছেন, দুনিয়ার চাবিসমূহ দেয়া হয়েছে। আল্লাহর শপথ আমি তোমাদের সম্বন্ধে এ আশঙ্কা করি না যে, তোমরা আমার পরে শিরকে জড়িয়ে পড়বে। তবে, আমি তোমাদের সম্বন্ধে এ সংশয় করি যে, তোমরা দুনিয়ার প্রাচুর্যের প্রতিযোগিতায় জড়িয়ে পড়বে। (ইসলামিক ফাউন্ডেশন ৫৭৭৪, ইসলামিক সেন্টার ৫৮০৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5977,
			"arabicnumber": "2296.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭১, আন্তর্জাতিক নাম্বারঃ ২২৯৬ ৫৮৭১-(৩১/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... উকবাহ ইবনু আমির (রাযিঃ) হতে বর্ণিত। তিনি বলেন, (একদিন) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদের শহীদগণের জন্য সালাত (সালাত/নামাজ/নামায) আদায় করলেন তারপর মিম্বারে চড়ে জীবিতদের ও মৃতদের বিদায় দানকারীর মতো বলেনঃ আমি হাওযের দিকে তোমাদের অগ্রগামী। আর জেনে রাখো! তার প্রস্থ যেমন আয়লা হতে জুহফার ব্যবধান। আমি তোমাদের সম্বন্ধে ভয় করি না যে, তোমরা আমার পরে শিরকে লিপ্ত হবে। তবে, আমি তোমাদের সম্বন্ধে দুনিয়াকে ভয় করি যে, তা অর্জনের প্রতিযোগিতায় তোমরা জড়িয়ে পড়বে এবং হানাহানি করবে; ফলে তোমরা ধ্বংস হয়ে যাবে। যেমন, তোমাদের পূর্ববর্তীরা ধ্বংস হয়েছে। উকবাহ্ (রাযিঃ) বলেন, এ ছিল মিম্বারের উপরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আমার সর্বশেষ দেখা। (ইসলামিক ফাউন্ডেশন ৫৭৭৫, ইসলামিক সেন্টার ৫৮০৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5978,
			"arabicnumber": "2297.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭২, আন্তর্জাতিক নাম্বারঃ ২২৯৭ ৫৮৭২-(৩২/২২৯৭) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ কুরায়ব ও ইবনু নুমায়র (রহঃ) ..... আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি 'হাওযে’র নিকট তোমাদের অগ্রগামী। আর আমি অবশ্যই কিছু দলের সম্বন্ধে বাক-বিতণ্ডা করব এবং আমি অবশ্যই তাদের ব্যাপারে পরাজিত হয়ে যাব। তখন আমি বলব, হে রব! (এরা তো) আমার সহচর, আমার সঙ্গী। তখন বলা হবে, আপনি তো জানেন না যে, তারা আপনার পরে কি নিত্য-নতুন (বিষয়াদি) আবিষ্কার করেছে? (ইসলামিক ফাউন্ডেশন ৫৭৭৬, ইসলামিক সেন্টার ৫৮০৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5979,
			"arabicnumber": "2297.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৩, আন্তর্জাতিক নাম্বারঃ ২২৯৭ ৫৮৭৩-(.../…) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আ’মাশ (রহঃ) হতে উপরোক্ত সূত্রে বর্ণনা করেছেন। কিন্তু তিনি আমার সহচর, আমার সঙ্গী-উক্তিটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৭৭৭, ইসলামিক সেন্টার ৫৮০৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5980,
			"arabicnumber": "2297.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৪, আন্তর্জাতিক নাম্বারঃ ২২৯৭ ৫৮৭৪-(.../...) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম এবং ইবনুল মুসান্না (রহঃ) ..... আবূ ওয়ায়িল (রহঃ) হতে আবদুল্লাহ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে ..... পূর্বোল্লিখিত আ'মাশ (রহঃ) এর হাদীসের হুবহু রিওয়ায়াত করেছেন। কিন্তু শু'বাহ্ (রহঃ) বর্ণিত হাদীসে মুগীরাহ (রাযিঃ) এর সানাদে রয়েছে ... আমি আবূ ওয়ায়িল (রহঃ) কে বলতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৫৭৭৮, ইসলামিক সেন্টার ৫৮০৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5981,
			"arabicnumber": "2297.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৫, আন্তর্জাতিক নাম্বারঃ ২২৯৭ ৫৮৭৫-(…/...) সাঈদ ইবনু আমর আশ'আসী ও আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ... হুযাইফাহ্ (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুগীরাহ ও আ’মাশ (রাযিঃ) এর বর্ণিত হাদীসের হুবহু হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৭৯, ইসলামিক সেন্টার ৫৮১০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5982,
			"arabicnumber": "2298.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৬, আন্তর্জাতিক নাম্বারঃ ২২৯৮ ৫৮৭৬-(৩৩/২২৯৮) মুহাম্মাদ ইবনু ‘আবদুল্লাহ ইবনু বাযী’ (রহঃ) ..... হারিসাহ (রাযিঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন যে, তার হাওয মদীনাহ এবং সান’আর মাঝামাঝি ব্যবধানের সমান। অতঃপর মুসতাওরিদ (রহঃ) তাকে বললেন, আপনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পাত্রের ব্যাপারে আলোচনা শুনেছেন কি? হারিসাহ (রাযিঃ) উত্তর দিলেন, না। তখন মুসতাওরিদ (রহঃ) বললেন, সেখানে তারকার মতো পাত্রসমূহ লক্ষ্য করা যাবে। (ইসলামিক ফাউন্ডেশন ৫৭৮০, ইসলামিক সেন্টার ৫৮১১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5983,
			"arabicnumber": "2298.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৭, আন্তর্জাতিক নাম্বারঃ ২২৯৮ ৫৮৭৭-(.../...) ইবরাহীম ইবনু মুহাম্মাদ ইবনু 'আর'আরাহ (রহঃ) ..... হারিসাহ ইবনু ওয়াহব খুযা'ঈ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি এবং তিনি অবিকলরূপে হাওযের বিবরণ দিলেন। কিন্তু তিনি মুসতাওরিদ ও তার উক্তির বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৭৮১, ইসলামিক সেন্টার ৫৮১২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5984,
			"arabicnumber": "2299.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৮, আন্তর্জাতিক নাম্বারঃ ২২৯৯ ৫৮৭৮-(৩৪/২২৯৯) আবূ রাবী যাহরানী এবং আবূ কামিল জাহদারী (রহঃ) ..... ইবনু উমার (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের সম্মুখে একটি হাওয থাকবে যার উভয় দিকের ব্যবধান হবে জারবা ও আযরুহার মাঝামাঝি জায়গার সমান। (ইসলামিক ফাউন্ডেশন ৫৭৮২, ইসলামিক সেন্টার ৫৮১৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5985,
			"arabicnumber": "2299.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৭৯, আন্তর্জাতিক নাম্বারঃ ২২৯৯ ৫৮৭৯-(…/...) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনুল মুসান্না ও উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ... ইবনু উমার (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের সম্মুখে এমন একটি হাওয থাকবে যার প্রশস্ততা জারবা এবং আযরূহার মাঝামাঝি ব্যবধানের সমান। ইবনুল মুসান্নার বর্ণনা মতে, ‘আমার 'হাওয' বর্ণিত হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৭৮৩, ইসলামিক সেন্টার ৫৮১৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5986,
			"arabicnumber": "2299.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮০, আন্তর্জাতিক নাম্বারঃ ২২৯৯ ৫৮৮০-(…/...) ইবনু নুমায়র ও আবূ বাকর (রহঃ) উভয়ে উবাইদুল্লাহ (রহঃ) হতে উপরোল্লিখিত হাদীসের হুবহু হাদীস রিওয়ায়াত করেছেন। তবে উবাইদুল্লাহ (রহঃ) বর্ধিত রিওয়ায়াত করেন। উবাইদুল্লাহ (রহঃ) বলেন, আমি তাকে [নাফি' (রহঃ)-কে] (জারবা ও আযরূহা সম্বন্ধে) জিজ্ঞেস করলাম, তখন তিনি বললেন, শাম (সিরিয়া) দেশের সন্নিকটে দুটি গ্রামের নাম, উভয়ের মধ্যবর্তী ব্যবধান তিন রাতের রাস্তার সমান দূরত্ব। আর ইবনু বিশরের বর্ণনাতে তিন দিনের রাস্তা'। (ইসলামিক ফাউন্ডেশন ৫৭৮৪, ইসলামিক সেন্টার ৫৮১৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5987,
			"arabicnumber": "2299.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮১, আন্তর্জাতিক নাম্বারঃ ২২৯৯ ৫৮৮১-(.../...) সুওয়াইদ ইবনু সা’ঈদ (রহঃ) ..... এর বর্ণনা মতে, ইবনু উমার (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উবাইদুল্লাহর বর্ণিত হাদীসের হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৮৫, ইসলামিক সেন্টার ৫৮১৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5988,
			"arabicnumber": "2299.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮২, আন্তর্জাতিক নাম্বারঃ ২২৯৯ ৫৮৮২-(৩৫/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) .... আবদুল্লাহ (রাযি) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের সম্মুখে একটা হাওয হবে যার প্রশস্ততা জারবা ও আযরূহার মাঝামাঝি ব্যবধানের সমান। সেখানে আকাশে তারকার ন্যায় অনেক পাত্র থাকবে। যে লোক এখানে এসে ঐ হাওযের পানি পান করবে, পরবর্তীতে সে কক্ষনো তৃষ্ণার্ত হবে না। (ইসলামিক ফাউন্ডেশন ৫৭৮৬, ইসলামিক সেন্টার ৫৮১৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5989,
			"arabicnumber": "2300",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮৩, আন্তর্জাতিক নাম্বারঃ ২৩০০ ৫৮৮৩-(৩৬/২৩০০) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আবূ যার গিফারী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রশ্ন করেছি, হে আল্লাহর রসূল! হাওযের পাত্র কত হবে? তিনি বললেন, যার কবজায় আমার জীবন তার শপথ! সে হাওযের পাত্র মেঘবিহীন আঁধার রাতের আকাশের নক্ষত্র ও তারকারাজির চাইতেও বেশী। সে সব পাত্র জান্নাতেরই পাত্র। যে ঐ পাত্র হতে পান করবে শেষ পর্যন্ত আর তৃষ্ণার্ত হবে না। ঐ হাওযের মধ্যে জান্নাত হতে প্রবাহিত দু’টো নালার সংমিশ্রণ রয়েছে। যে লোক ঐ হাওয হতে পান করবে সে আর তৃষ্ণার্ত হবে না, সে হাওযের দৈর্ঘ্য ও প্রস্থ সমান হবে। সে হাওযের প্রশস্থতা আম্মান থেকে আয়লার মাঝামাঝি ব্যবধানের সমতুল্য। তার পানি দুধের চেয়েও সাদা এবং মধুর চেয়েও বেশি মিষ্ট। (ইসলামিক ফাউন্ডেশন ৫৭৮৭, ইসলামিক সেন্টার ৫৮১৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5992,
			"arabicnumber": "2301.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮৬, আন্তর্জাতিক নাম্বারঃ ২৩০১ ৫৮৮৬-(.../…) মুহাম্মাদ ইবনু বাশশার (রহঃ) বর্ণনা করেন ..... সাওবান (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাওযের হাদীস রিওয়ায়াত করেছেন। তারপর তিনি ইয়াহইয়া ইবনু হাম্মাদ (রহঃ) কে বললেন, আমি আবূ আওয়ানাহ্ (রাযিঃ) হতেও এ হাদীস শুনেছি। ইয়াহইয়া ইবনু হাম্মাদ (রহঃ) বললেন, আমি শু'বাহ্ (রাযিঃ) হতে এ হাদীস শুনেছি। তারপর আমি বললাম যে, আপনি এ হাদীস সম্বন্ধে আমাকে একটু সময় দিন, তিনি আমাকে সময় দিলেন এবং আমাকে হাদীসটি শুনালেন। (ইসলামিক ফাউন্ডেশন ৫৭৮৯, ইসলামিক সেন্টার ৫৮২১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5993,
			"arabicnumber": "2302.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮৭, আন্তর্জাতিক নাম্বারঃ ২৩০২ ৫৮৮৭-(৩৮/২৩০২) আবদুর রহমান ইবনু সাল্লাম জুমাহী (রহঃ) .... আবূ হুরাইরা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয়ই আমি আমার হাওয থেকে কতক সংখ্যক ব্যক্তিকে সরিয়ে দেব, যেরূপে অচেনা উটকে সরিয়ে দেয়া হয়। (ইসলামিক ফাউন্ডেশন ৫৭৯০, ইসলামিক সেন্টার ৫৮২২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5994,
			"arabicnumber": "2302.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৮৮, আন্তর্জাতিক নাম্বারঃ ২৩০২ ৫৮৮৮-(…/...) উবাইদুল্লাহ ইবনু মু'আয (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পূর্বেকার হাদীসের হুবহু হাদীস বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৭৯০, ইসলামিক সেন্টার ৫৮২৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6004,
			"arabicnumber": "2306.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৯৮, আন্তর্জাতিক নাম্বারঃ ২৩০৬ ৫৮৯৮-(৪৬/২৩০৬) আবূ বাকর ইবনু আবূ শাইবাহ ও আবূ উসামাহ্ (রহঃ) ..... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি উহুদ যুদ্ধে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ডানে এবং বামে দু’ লোককে দেখতে পাই তাদের গায়ে সাদা পোশাক ছিল। এর আগে বা পরে আমি তাদেরকে আর কক্ষনো দেখিনি। আসলে তারা ছিলেন জিবরীল ও মীকাঈল (আঃ)। (ইসলামিক ফাউন্ডেশন ৫৭৯৯, ইসলামিক সেন্টার ৫৮৩৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6005,
			"arabicnumber": "2306.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৮৯৯, আন্তর্জাতিক নাম্বারঃ ২৩০৬ ৫৮৯৯-(৪৭/...) ইসহাক ইবনু মানসূর (রহঃ) ..... সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, উহুদ যুদ্ধে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ডানে ও বামে দু’ লোককে দেখতে পাই, যাদের গায়ে ছিল সাদা বস্ত্র। তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষে কঠিনভাবে যুদ্ধ করছিলেন। এর আগে ও পরে আমি তাদের দেখিনি। (ইসলামিক ফাউন্ডেশন ৫৮০০, ইসলামিক সেন্টার ৫৮৩৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6006,
			"arabicnumber": "2307.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০০, আন্তর্জাতিক নাম্বারঃ ২৩০৭ ৫৯০০-(৪৮/২৩০৭) ইয়াহইয়া ইবনু ইয়াহইয়া তামীমী, সাঈদ ইবনু মানসূর, আবূ রাবী' আতাকী ও আবূ কামিল (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সব লোকের মাঝে অতি সুন্দর, অতি দানশীল এবং শ্রেষ্ঠ বীর ছিলেন। কোন এক রাত্রে মদীনাবাসীরা ভীত হয়ে পড়েছিল। অতঃপর যেদিক থেকে শব্দ আসছিল, লোকেরা সেদিকে ছুটে চলল। রাস্তায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে তাদের দেখা হয়, তখন তিনি ফিরে আসছিলেন। কারণ শব্দের দিকে প্রথম তিনিই দৌড়ে গিয়েছিলেন। তখন তিনি আবূ তালহাহ (রাযিঃ) এর গদিবিহীন ঘোড়ায় চড়ে ছিলেন। তার কাঁধে তলোয়ার ছিল। তিনি বলছিলেন, তোমরা শঙ্কিত হয়ো না, তোমরা শঙ্কিত হয়ে না। তিনি আরো বললেনঃ আমি এ ঘোড়াকে পেয়েছি সমুদ্রের মতো। কিংবা বললেন, এ তো সমুদ্র। ইতোপূর্বে এ ঘোড়ার গতি ছিল ক্ষীণ। (ইসলামিক ফাউন্ডেশন ৫৮০১, ইসলামিক সেন্টার ৫৮৩৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6007,
			"arabicnumber": "2307.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০১, আন্তর্জাতিক নাম্বারঃ ২৩০৭ ৫৯০১-(৪৯/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সময় মদীনায় ভয়ের কারণ সৃষ্টি হয়েছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ তালহাহ্ (রাযিঃ) এর একটি ঘোড়া চেয়ে নিলেন। এটিকে 'মানদূব' বলা হত। তিনি তার উপর সওয়ার হলেন। অতঃপর বললেন, আমি ঘাবড়ানোর কোন কারণ দেখতে পাইনি। আর এ ঘোড়াটিকে সমুদ্রের মতো পেয়েছি। (ইসলামিক ফাউন্ডেশন ৫৮০২, ইসলামিক সেন্টার ৫৮৩৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6008,
			"arabicnumber": "2307.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০২, আন্তর্জাতিক নাম্বারঃ ২৩০৭ ৫৯০২-(.../...) মুহাম্মাদ ইবনুল মুসান্না, ইবনু বাশশার ও ইয়াহইয়া ইবনু হাবীব (রহঃ) ..... শু’বাহ (রহঃ) থেকে উপরোক্ত সূত্রে এ হাদীস রিওয়ায়াত করেন। ইবনু জাফারের হাদীসে আমাদের ঘোড়ার কথা বলা হয়েছে, আবূ তালহাহ্ (রাযিঃ) এর কথা বলা হয়নি। কাতাদাহ্ (রহঃ) এর সূত্রে খালিদ (রহঃ) বর্ণিত হাদীসে বলা হয়েছে, আমি আনাস (রাযিঃ) হতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৫৮০৩, ইসলামিক সেন্টার ৫৮৩৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6009,
			"arabicnumber": "2308.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৩, আন্তর্জাতিক নাম্বারঃ ২৩০৮ ৫৯০৩-(৫০/২৩০৮) মানসূর ইবনু আবূ মুযাহিম ও আবূ ইমরান মুহাম্মাদ ইবনু জাফার ইবনু যিয়াদ (রহঃ) ...... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানুষের মাঝে দানশীলতায় সবচেয়ে বেশী অগ্রগামী ছিলেন। তবে রমযান মাসে তিনি আরো অধিক দানশীল হতেন। কারণ জিবরীল (আঃ) প্রতি বছর রমযান মাসে তার সাথে দেখা করতেন। রমযান শেষ হওয়া পর্যন্ত রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সম্মুখে কুরআন পাঠ করে শোনাতেন। যখন জিবরীল (আঃ) তার সাথে দেখা করতেন তখন তিনি বিক্ষিপ্ত বাতাসের চাইতেও বেশি দানশীল হতেন। (ইসলামিক ফাউন্ডেশন ৫৮০৪, ইসলামিক সেন্টার ৫৮৩৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6010,
			"arabicnumber": "2308.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৪, আন্তর্জাতিক নাম্বারঃ ২৩০৮ ৫৯০৪-(.../...) আবূ কুরায়ব ও আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) হতে হুবহু রিওয়ায়াত করেন। (ইসলামিক ফাউন্ডেশন ৫৮০৪, ইসলামিক সেন্টার ৫৮৩৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6011,
			"arabicnumber": "2309.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৫, আন্তর্জাতিক নাম্বারঃ ২৩০৯ ৫৯০৫-(৫১/২৩০৯) সাঈদ ইবনু মানসূর ও আবূ রাবী’ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি দশ বছর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমত করেছি। আল্লাহর শপথ তিনি কখনো আমাকে 'উহ' শব্দও বলেননি এবং কোন সময় আমাকে ‘এটা কেন করলে’, ‘ওটা কেন করনি তাও বলেননি। আবূ রাবী’ (রহঃ) বর্ধিত বলেছেন, 'কোন বিষয় সম্পর্কে যা খাদিমের করা ঠিক নয়' এবং তার রিওয়ায়াতে আল্লাহর শপথের বর্ণনা নেই। (ইসলামিক ফাউন্ডেশন ৫৮০৫, ইসলামিক সেন্টার ৫৮৪০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6012,
			"arabicnumber": "2309.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৬, আন্তর্জাতিক নাম্বারঃ ২৩০৯ ৫৯০৬-(.../...) শাইবান ইবনু ফাররূখ (রহঃ) ..... আনাস (রাযিঃ) হতে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮০৬, ইসলামিক সেন্টার ৫৮৪১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6013,
			"arabicnumber": "2309.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৭, আন্তর্জাতিক নাম্বারঃ ২৩০৯ ৫৯০৭-(৫২/...) আহমাদ ইবনু হাম্বাল ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদীনায় আসেন তখন আবূ তালহাহ্ (রাযিঃ) হাতে ধরে আমাকে নিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে উপস্থিত হলেন। অতঃপর বললেন, হে আল্লাহর রসূল! আনাস অত্যন্ত বুদ্ধিমান ছেলে, সে আপনার সেবা করবে। আনাস (রাযিঃ) বলেন, আমি তার খিদমাত করেছি সফর ও ইকামাত অবস্থায়। আল্লাহর শপথ! আমি যে কোন কাজই করেছি, তিনি আমাকে বলেননি যে, কেন এমনটি করলে? আর যে কোন কাজই আমি করিনি, কেন তুমি এটি করনি, এ রকমও বলেননি। (ইসলামিক ফাউন্ডেশন ৫৮০৭, ইসলামিক সেন্টার ৫৮৪২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6014,
			"arabicnumber": "2309.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯০৮, আন্তর্জাতিক নাম্বারঃ ২৩০৯ ৫৯০৮-(৫৩/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নয় বছর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সেবা করেছি। আমার জানা নেই, তিনি কখনো আমায় বলেছেন, কেন তুমি এ কাজ করলে? এবং কোন ব্যাপারে আমাকে কক্ষনো দোষারোপও করেননি। (ইসলামিক ফাউন্ডেশন ৫৮০৮, ইসলামিক সেন্টার ৫৮৪৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6016,
			"arabicnumber": "2309.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১০, আন্তর্জাতিক নাম্বারঃ ২৩০৯ ৫৯১০-(…/২৩০৯) আনাস (রাযিঃ) বলেন, আল্লাহর শপথ আমি নয় বছর তার সেবায় ছিলাম, কিন্তু আমার জানা নেই, কোন কাজ আমি করেছি সে ব্যাপারে বলেননি এরূপ কেন করলে কিংবা কোন কাজ করিনি, সে ব্যাপারে বলেননি, কেন অমুক অমুক কাজ করলে না? (ইসলামিক ফাউন্ডেশন ৫৮০৯, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6017,
			"arabicnumber": "2310.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১১, আন্তর্জাতিক নাম্বারঃ ২৩১০ ৫৯১১-(৫৫/২৩১০) শাইবান ইবনু ফাররূখ ও আবূ রাবী’ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সমস্ত লোকের মাঝে সর্বোত্তম চরিত্রের অধিকারী ছিলেন। (ইসলামিক ফাউন্ডেশন ৫৮১০, ইসলামিক সেন্টার ৫৮৪৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6018,
			"arabicnumber": "2311.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১২, আন্তর্জাতিক নাম্বারঃ ২৩১১ ৫৯১২-(৫৬/২৩১১) আবূ বাকর ইবনু আবূ শাইবাহ ও আমর আন নাকিদ (রহঃ) ..... জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কেউ কিছু কামনা করলে কোন দিন তিনি 'না' বলেননি। (ইসলামিক ফাউন্ডেশন ৫৮১১, ইসলামিক সেন্টার ৫৮৪৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6019,
			"arabicnumber": "2311.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৩, আন্তর্জাতিক নাম্বারঃ ২৩১১ ৫৯১৩-(.../...) আবূ কুরায়ব ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... মুহাম্মাদ ইবনু মুনকাদিরের সানাদে জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে হুবহু রিওয়ায়াত করেন। (ইসলামিক ফাউন্ডেশন ৫৮১২, ইসলামিক সেন্টার ৫৮৪৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6020,
			"arabicnumber": "2312.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৪, আন্তর্জাতিক নাম্বারঃ ২৩১২ ৫৯১৪-(৫৭/২৩১২) আসিম ইবনু নায্‌র তাইমী (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ইসলাম গ্রহণ করার পর কেউ কিছু চাইলে তিনি অবশ্যই তা দিয়ে দিতেন। আনাস (রাযিঃ) বলেন, জনৈক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলো। তিনি তাকে এত বেশী ছাগল দিলেন যাতে দু’ উপত্যকার মাঝামাঝি স্থান পরিপূর্ণ হয়ে যাবে। এরপর সে লোক তার গোত্রের নিকট গিয়ে তাদের বলল, হে আমার জাতি ভাইয়েরা! তোমরা ইসলাম কবুল কর। কারণ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভাবের আশঙ্কা না করে দান করতেই থাকেন। (ইসলামিক ফাউন্ডেশন ৫৮১৩, ইসলামিক সেন্টার ৫৮৪৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6021,
			"arabicnumber": "2312.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৫, আন্তর্জাতিক নাম্বারঃ ২৩১২ ৫৯১৫-(৫৮/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে দু' পাহাড়ের মাঝামাঝি ছাগলগুলো চাইলে তিনি তাকে তা দিয়ে দিলেন। অতঃপর সে লোক তার গোত্রের নিকট প্রত্যাবর্তন শেষে বলল, হে আমার জাতি ভাইয়েরা! তোমরা ইসলাম কবুল কর। আল্লাহর শপথ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভাবের আশঙ্কা না করে দান করেন। আনাস (রাযিঃ) বলেন, যদিও মানুষ শুধু ইহকালের উদ্দেশেই ইসলাম গ্রহণ করে তবুও ইসলাম গ্রহণ করতে না করতেই ইসলাম তার কাছে পৃথিবী এবং পৃথিবীর সকল প্রাচুর্যের চাইতে অধিকতর প্রিয় হয়ে যায়। (ইসলামিক ফাউন্ডেশন ৫৮১৪, ইসলামিক সেন্টার ৫৮৪৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6022,
			"arabicnumber": "2313",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৬, আন্তর্জাতিক নাম্বারঃ ২৩১৩ ৫৯১৬-(৫৯/২৩১৩) আবূ তাহির আহমাদ ইবনু আমর ইবনু সারহ্ (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কাহ্ বিজয়ের যুদ্ধ করেন। এরপর তার সাথে যে সব মুসলিম ছিলেন তাদের নিয়ে তিনি বের হন। আর তারা সবাই হুনায়নের যুদ্ধ করেন। এ যুদ্ধে মহান আল্লাহ তা'আলা তার দীনের এবং মুসলিমদের সাহায্য করেন। সেদিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফওয়ান ইবনু উমাইয়াহকে একশ' উট দান করেন। এরপর একশ' উট, পুনরায় আরও একশ’ উট প্রদান করেন। ইবনু শিহাব (রহঃ) বলেন, সাঈদ ইবনু মুসাইয়্যিব (রহঃ) আমাকে বলেছেন যে, সাফওয়ান (রাযিঃ) বলেন, আল্লাহর শপথ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দান করলেন এবং এমন পরিমাণে আমাকে দান করলেন যে, তিনি আমার কাছে সবচেয়ে নিম্নপ্রকৃতির লোক ছিলেন। অতঃপর তিনি আমাকে অবিরাম দান করতে থাকলেন এমনকি আমার নিকটে সবচেয়ে পছন্দের লোক হয়ে গেলেন। (ইসলামিক ফাউন্ডেশন ৫৮১৫, ইসলামিক সেন্টার ৫৮৫০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6023,
			"arabicnumber": "2314.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৭, আন্তর্জাতিক নাম্বারঃ ২৩১৪ ৫৯১৭-(৬০/২৩১৪) আমর আন্‌ নাকিদ, ইসহাক ও ইবনু আবূ উমর (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমাদের নিকট যদি বাহরাইন হতে মাল আসে তাহলে তোমাকে এই, এই, এই পরিমাণ দিব এবং তিনি উভয় হাত একত্র করলেন। এরপর বাহরাইন থেকে মাল আসার আগেই রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পরলোক গমন করেন। তারপর আবূ বাকর (রাযিঃ) এর কাছে বাহরাইন হতে মাল আসে। তিনি একজন ঘোষককে এ মর্মে ঘোষণা দেয়ার আদেশ দিলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর যার কিছু ওয়াদা অথবা ঋণ রয়েছে সে যেন (আমার) নিকট আসে। তখন আমি দাঁড়িয়ে বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছিলেন যে, বাহরাইন থেকে যদি আমাদের কাছে মাল আসে তবে তোমাকে এই, এই, এই পরিমাণ দিব। এ কথা শুনে আবূ বাকর (রাযিঃ) এক অঞ্জলি উঠালেন এবং বললেন, গুনে দেখো। আমি তা গুনে দেখলাম তাতে পাঁচশ' আছে। অতঃপর তিনি বললেন, এর চেয়ে আরো দ্বিগুণ তুমি নিয়ে নাও। (ইসলামিক ফাউন্ডেশন ৫৮১৬, ইসলামিক সেন্টার ৫৮৫১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6024,
			"arabicnumber": "2314.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৮, আন্তর্জাতিক নাম্বারঃ ২৩১৪ ৫৯১৮-(৬১/...) মুহাম্মাদ ইবনু হাতিম ইবনু মাইমুন (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইন্তিকাল করলেন এবং আবূ বকর (রাযিঃ) এর নিকট আলা ইবনু হাযরামীর তরফ হতে মাল আসলো। তখন আবূ বাকর (রাযিঃ) ঘোষণা দিলেন, যার জন্য রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ঋণ রয়েছে কিংবা তার তরফ হতে কোন ওয়া’দা রয়েছে, সে যেন আমার কাছে চলে আসে। অবশিষ্টাংশ হাদীস ইবনু উয়াইনার অবিকল। (ইসলামিক ফাউন্ডেশন ৫৮১৭, ইসলামিক সেন্টার ৫৮৫২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6025,
			"arabicnumber": "2315",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯১৯, আন্তর্জাতিক নাম্বারঃ ২৩১৫ ৫৯১৯-(৬২/২৩১৫) হাদ্দাব ইবনু খালিদ ও শাইবান ইবনু ফাররূখ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রাত্রে আমার একটি সন্তান ভূমিষ্ঠ হয়, আমি তার নাম আমার পিতা ইব্রাহীম (আঃ) এর নামে রাখি। এরপর তিনি উম্মু সায়ফ নামক একজন মহিলাকে ঐ সন্তানটি দিলেন। তিনি একজন কর্মকারের সহধর্মিণী। কর্মকারের নাম আবূ সায়ফ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদিন আবূ সায়ফ এর নিকট যাচ্ছিলেন আর আমিও তার সঙ্গে যাচ্ছিলাম। যখন আমরা আবূ সায়ফের গৃহে উপস্থিত হই তখন সে তার হাপর বা ফুকনীতে ফুঁক দিচ্ছিল, সারা গৃহ ধুয়ায় ভরপুর ছিল। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আগে দৌড়ে গিয়ে আবূ সায়ফকে বললাম, তুমি একটু থামো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসছেন। সে থামলো। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছেলেকে ডাকলেন এবং তাকে জড়িয়ে ধরে আদর করলেন এবং যা আল্লাহর ইচ্ছা রয়েছে তা বললেন। আনাস (রাযিঃ) বলেন, আমি এ ছেলেকে দেখলাম, সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে বড় বড় শ্বাস ফেলছিল। তা দেখে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু' নয়ন অশ্রু ভিজে গেল। আর তিনি বললেনঃ চোখ কাঁদছে, মন কাতর হচ্ছে, মুখে আমরা তাই বলব রব্বুল আলামীন যা পছন্দ করেন। হে ইবরাহীম! আল্লাহর শপথ! আমরা তোমার জন্য খুবই ব্যথিত। (ইসলামিক ফাউন্ডেশন ৫৮১৮, ইসলামিক সেন্টার ৫৮৫৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6026,
			"arabicnumber": "2316",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২০, আন্তর্জাতিক নাম্বারঃ ২৩১৬ ৫৯২০-(৬৩/২৩১৬) যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু ‘আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চাইতে শিশুদের প্রতি বেশী দয়াশীল আর কাউকে আমি দেখিনি। তিনি বলেন, (রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ছেলে) ইবরাহীম (রাযিঃ) মদীনার গ্রামাঞ্চলে দুধ পান করতেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখার জন্য সেখানে যেতেন আর আমরাও তার সাথে যেতাম। তিনি দাইয়ের গৃহে ঢুকতেন, আর সেখানে ধুয়ায় আচ্ছন্ন থাকত। কেননা, তার দুধপিতা কর্মকার (কামার) ছিল। তিনি ছেলেকে কোলে তুলে চুমু খেতেন। পরে তিনি প্রত্যাবর্তন করতেন। আমর ইবনু সাঈদ (রাযিঃ) বলেন, যখন ইবরাহীম (রাযিঃ) মৃত্যুবরণ করেন তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন ইবরাহীম আমার পুত্র, দুধ পান করা অবস্থায় মৃত্যুবরণ করেছে। তার জন্য দুধপিতা ও দুধমাতা রয়েছে, যারা জান্নাতে তাকে দুধ পান করার সময়-সীমা পর্যন্ত দুধ পান করাবে। (ইসলামিক ফাউন্ডেশন ৫৮১৯, ইসলামিক সেন্টার ৫৮৫৪) আনাস (রাযিঃ) বলেন, আমি এ ছেলেকে দেখলাম, সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে বড় বড় শ্বাস ফেলছিল। তা দেখে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু' নয়ন অশ্রু ভিজে গেল। আর তিনি বললেনঃ চোখ কাঁদছে, মন কাতর হচ্ছে, মুখে আমরা তাই বলব রববুল আলামীন যা পছন্দ করেন। হে ইবরাহীম! আল্লাহর শপথ! আমরা তোমার জন্য খুবই ব্যথিত। (ইসলামিক ফাউন্ডেশন ৫৮১৮, ইসলামিক সেন্টার ৫৮৫৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6027,
			"arabicnumber": "2317",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২১, আন্তর্জাতিক নাম্বারঃ ২৩১৭ ৫৯২১-(৬৪/২৩১৭) আবূ বাকর ইবনু শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গেয়ো আরবীয় লোক আসলো। তারা প্রশ্ন করল, আপনারা কি আপনাদের বাচ্চাদের চুমু দেন? উপস্থিত সবাই বললেন, হ্যাঁ। তখন তারা বললেন, কিন্তু আল্লাহর শপথ! আমরা তো তাদের চুমু দেই না। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি কি করবো, আল্লাহ যদি তোমাদের হতে দয়া দূর করে নিয়ে থাকেন। ইবনু নুমায়রের বর্ণনাতে আছে, তোমার অন্তর হতে .....। (ইসলামিক ফাউন্ডেশন ৫৮২০, ইসলামিক সেন্টার ৫৮৫৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6028,
			"arabicnumber": "2318.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২২, আন্তর্জাতিক নাম্বারঃ ২৩১৮ ৫৯২২-(৬৫/২৩১৮) আমর আন্‌ নাকিদ ও ইবনু আবূ উমর (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আকরা ইবনু হাবিস (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখলেন যে, তিনি হাসান (রাযিঃ) কে চুমু দিচ্ছেন। তখন আকরা ইবনু হাবিস (রাযিঃ) বলেন, হে আল্লাহর রসূল! আমার দশটি সন্তান রয়েছে। আমি তাদের কাউকে চুমু দেইনি। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যারা দয়া করে না (আল্লাহ কর্তৃক) তাদের প্রতি দয়া করা হবে না। (ইসলামিক ফাউন্ডেশন ৫৮২১, ইসলামিক সেন্টার ৫৮৫৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6029,
			"arabicnumber": "2318.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৩, আন্তর্জাতিক নাম্বারঃ ২৩১৮ ৫৯২৩-(.../...) আবদ ইবনু হুমায়দ ..... আবূ হুরাইরাহ্ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮২২, ইসলামিক সেন্টার ৫৮৫৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6030,
			"arabicnumber": "2319.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৪, আন্তর্জাতিক নাম্বারঃ ২৩১৯ ৫৯২৪-(৬৬/২৩১৯) যুহায়র ইবনু হারব (রহঃ) ..... জারীর ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক মানুষের প্রতি দয়া প্রদর্শন করে না (কিয়ামতের দিন) আল্লাহও তার প্রতি দয়া প্রদর্শন করবেন না। (ইসলামিক ফাউন্ডেশন ৫৮২৩, ইসলামিক সেন্টার ৫৮৫৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6031,
			"arabicnumber": "2319.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৫, আন্তর্জাতিক নাম্বারঃ ২৩১৯ ৫৯২৫-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... জারীর (রাযিঃ) হতে আমাশের হাদীসের হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮২৪, ইসলামিক সেন্টার ৫৮৫৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6032,
			"arabicnumber": "2320",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৬, আন্তর্জাতিক নাম্বারঃ ২৩২০ ৫৯২৬-(৬৭/২৩২০) উবাইদুল্লাহ ইবনু মুআয (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্দানশীল কুমারী মহিলার চাইতেও অধিক লজ্জাশীল ছিলেন। আর যখন তিনি কোন জিনিসকে অপছন্দ করতেন আমরা তার মুখায়ব হতে তা বুঝতে পারতাম। (ইসলামিক ফাউন্ডেশন ৫৮২৫, ইসলামিক সেন্টার ৫৯৬০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6033,
			"arabicnumber": "2321.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৭, আন্তর্জাতিক নাম্বারঃ ২৩২১ ৫৯২৭-(৬৮/২৩২১) যুহায়র ইবনু হারব (রহঃ) ..... মাসরুক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমরা 'আবদুল্লাহ ইবনু 'আমর (রাযিঃ) এর নিকট গিয়েছিলাম যখন মু'আবিয়াহ্ (রাযিঃ) কুফায় এসেছিলেন। মুআবিয়াহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্বন্ধে বর্ণনা দিয়ে বললেন, তিনি অশ্লীল ছিলেন না এবং অশ্লীল কথা বলতেন না। মু'আবিয়াহ্ (রাযিঃ) আরো বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মাঝে উত্তম সে লোক যার চরিত্র উত্তম। (ইসলামিক ফাউন্ডেশন ৫৮২৬, ইসলামিক সেন্টার ৫৯৬১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6034,
			"arabicnumber": "2321.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৮, আন্তর্জাতিক নাম্বারঃ ২৩২১ ৫৯২৮-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আ'মাশ (রাযিঃ) হতে একই সূত্রে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮২৭, ইসলামিক সেন্টার ৫৮৬২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6035,
			"arabicnumber": "2322",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯২৯, আন্তর্জাতিক নাম্বারঃ ২৩২২ ৫৯২৯-(৬৯/২৩২২) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সিমাক ইবনু হারব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি জাবির ইবনু সামুরাহ্ (রাযিঃ) কে জিজ্ঞেস করলাম, আপনি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসতেন? তিনি বললেন, হ্যাঁ অনেকবার। তিনি ফজরের সালাত (সালাত/নামাজ/নামায) যেখানে আদায় করতেন সূর্যোদয়ের পূর্ব পর্যন্ত সেখান হতে উঠতেন না। এরপর যখন সূর্যোদয় হতো তখন তিনি উঠে দাঁড়াতেন। লোকেরা কথাবার্তা বলতো, জাহিলী যুগের ব্যাপার নিয়ে আলোচনা করতো এবং হাসতো আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও মুচকি হাসতেন। (ইসলামিক ফাউন্ডেশন ৫৮২৮, ইসলামিক সেন্টার ৫৮৬৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6036,
			"arabicnumber": "2323.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6037,
			"arabicnumber": "2323.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6038,
			"arabicnumber": "2323.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6039,
			"arabicnumber": "2323.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6040,
			"arabicnumber": "2323.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৪, আন্তর্জাতিক নাম্বারঃ ২৩২৩ ৫৯৩৪-(৭৩/...) ইবনুল মুসান্না (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একজন সুমধুর কণ্ঠের গায়ক ছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ওহে আন্‌জাশাহ! আস্তে চলো, কাঁচপাত্রগুলো ভেঙ্গে ফেলো না অর্থাৎ- দুর্বল নারীদের (কষ্ট দিও না)। (ইসলামিক ফাউন্ডেশন ৫৮৩৩, ইসলামিক সেন্টার ৫৮৬৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6041,
			"arabicnumber": "2323.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৫, আন্তর্জাতিক নাম্বারঃ ২৩২৩ ৫৯৩৫-(…/…) ইবনু বাশশার (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে রিওয়ায়াত করেছেন, তবে 'সুললিত কষ্ঠের গায়ক' উক্তিটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৮৩৪, ইসলামিক সেন্টার ৫৮৬৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6042,
			"arabicnumber": "2324",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৬, আন্তর্জাতিক নাম্বারঃ ২৩২৪ ৫৯৩৬-(৭৪/২৩২৪) মুজাহিদ ইবনু মূসা, আবূ বাকর ইবনু নাযর ইবনু আবূ নাযর এবং হারূন ইবনু 'আবদুল্লাহ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ভোরের সালাত (সালাত/নামাজ/নামায) আদায় করতেন তখন মদীনার খাদিমরা তাদের পাত্রে করে পানি নিয়ে আসত আর তার নিকট কোন পাত্র আনা হলেই তিনি তাতে হাত ডুবিয়ে দিতেন। আর শীতের ঠাণ্ডা সকালেও মাঝে মাঝে তিনি হাত ডুবিয়ে দিতেন। (ইসলামিক ফাউন্ডেশন ৫৮৩৫, ইসলামিক সেন্টার ৫৮৭০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6043,
			"arabicnumber": "2325",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৭, আন্তর্জাতিক নাম্বারঃ ২৩২৫ ৫৯৩৭-(৭৫/২৩২৫) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি দেখেছি নাপিত রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল ছাটছে আর সাহাবীরা তার চতুস্পার্শ ঘিরে রেখেছেন। তারা চাইতেন যে, কোন চুল যেন মাটিতে না পড়ে তা যেন কারো না কারো হাতে পড়ে। (ইসলামিক ফাউন্ডেশন ৫৮৩৬, ইসলামিক সেন্টার ৫৮৭১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6044,
			"arabicnumber": "2326",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৮, আন্তর্জাতিক নাম্বারঃ ২৩২৬ ৫৯৩৮-(৭৬/২৩২৬) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) .... আনাস (রাযিঃ) হতে বর্ণিত যে, এক মহিলার বিবেকে (জ্ঞানে) কিছু বিকৃতি ছিল। সে বলল, হে আল্লাহর রসূল! আপনার সঙ্গে আমার একটা দরকার আছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে অমুকের মা! তোমার ইচ্ছামত কোন রাস্তায় তুমি অপেক্ষা কর যাতে করে আমি তোমার প্রয়োজন পুরো করতে পারি। তারপর তিনি কোন একটা জনপথে তার সাথে জনমানবশূন্য এলাকায় আলাপ করেন এবং মহিলাটি প্রয়োজনমুক্ত হয়। (ইসলামিক ফাউন্ডেশন ৫৮৩৭, ইসলামিক সেন্টার ৫৮৭২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6045,
			"arabicnumber": "2327.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৩৯, আন্তর্জাতিক নাম্বারঃ ২৩২৭ ৫৯৩৯-(৭৭/২৩২৭) কুতাইবাহ ইবনু সাঈদ ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহধর্মিণী আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দু’টো বিষয়ের কোন একটি গ্রহণের স্বাধীনতা দেয়া হত তখন তিনি সহজটি সাদরে গ্রহণ করতেন, যদি না তা দোষের হত। আর যদি তা দূষণীয় হতো তবে তা হতে তিনি সবার চেয়ে দূরে থাকতেন। নিজের জন্য তিনি কোন দিন প্রতিশোধ গ্রহণ করতেন না, তবে আল্লাহর মর্যাদা হানি হলে (প্রতিশোধ নিতেন)। (ইসলামিক ফাউন্ডেশন ৫৮৩৮, ইসলামিক সেন্টার ৫৮৭৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6046,
			"arabicnumber": "2327.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪০, আন্তর্জাতিক নাম্বারঃ ২৩২৭ ৫৯৪০-(…/...) যুহায়র ইবনু হারব, আহমাদ ইবনু আবদাল্লাহ্ (রহঃ) ..... আয়িশাহ (রাযিঃ) উপরোক্ত সূত্রে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৩৯, ইসলামিক সেন্টার ৫৮৭৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6047,
			"arabicnumber": "2327.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪১, আন্তর্জাতিক নাম্বারঃ ২৩২৭ ৫৯৪১-(.../...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) উপরোল্লিখিত একাধিক সূত্রের বর্ণনাকারীগণ এ সূত্রে মালিকের হাদীসের হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৩৯, ইসলামিক সেন্টার ৫৮৭৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6048,
			"arabicnumber": "2327.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪২, আন্তর্জাতিক নাম্বারঃ ২৩২৭ ৫৯৪২-(৭৮/...) আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে এমন দু’টো বিষয়ের স্বাধীনতা দেয়া হত যার একটি অপরটির তুলনায় সহজ তখন তিনি সহজটিকেই গ্রহণ করতেন, যদি সেটি দোষের না হত। আর দূষণীয় হলে তিনি তা হতে সর্বাধিক দূরে থাকতেন। (ইসলামিক ফাউন্ডেশন ৫৮৪০, ইসলামিক সেন্টার ৫৮৭৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6049,
			"arabicnumber": "2327.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6050,
			"arabicnumber": "2328.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪৪, আন্তর্জাতিক নাম্বারঃ ২৩২৮ ৫৯৪৪-(৭৯/২৩২৮) আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্বহস্তে কোন দিন কাউকে আঘাত করেননি, কোন নারীকেও না, খাদিমকেও না, আল্লাহর রাস্তায় জিহাদ ব্যতীত। আর যে তার অনিষ্ট করেছে তার থেকে প্রতিশোধও নেননি। তবে আল্লাহর মর্যাদা ক্ষুন্ন হয় এমন বিষয়ে তিনি তার প্রতিশোধ নিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৮৪২, ইসলামিক সেন্টার ৫৮৭৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6051,
			"arabicnumber": "2328.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6052,
			"arabicnumber": "2329",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪৬, আন্তর্জাতিক নাম্বারঃ ২৩২৯ ৫৯৪৬-(৮০/২৩২৯) আমর ইবনু হাম্মাদ ইবনু তালহাহ কান্নাদ (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যুহরের সালাত (সালাত/নামাজ/নামায) আদায় করলাম। এরপর তিনি তার বাড়ীর উদ্দেশে বের হলেন, আমিও তার সাথে বের হলাম। সম্মুখে কয়েকটি শিশু আসলো। তিনি একজন একজন করে এদের সবার গালে হাত স্পর্শ করলেন। বর্ণনাকারী বলেন, তিনি আমার গালেও হাত বুলালেন। আমি তার হাতে এমন ঠাণ্ড পরশ ও সুগন্ধি পেয়েছি (মনে হলো) যেন তিনি খুশবুওয়ালার পাত্র হতে হাত বের করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৪৪, ইসলামিক সেন্টার ৫৮৭৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6053,
			"arabicnumber": "2330.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪৭, আন্তর্জাতিক নাম্বারঃ ২৩৩০ ৫৯৪৭-(৮১/২৩৩০) কুতাইবাহ ইবনু সাঈদ ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর (দেহের) চেয়ে অধিক সুগন্ধময় কোন আম্বার, মিশক বা ভিন্ন কোন বস্তুর ঘ্রান আমি গ্রহণ করিনি এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর (দেহের) চাইতে কোমল রেশম বা নরম বস্ত্র আমি ছুয়ে দেখিনি। (ইসলামিক ফাউন্ডেশন ৫৮৪৫, ইসলামিক সেন্টার ৫৮৮০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6054,
			"arabicnumber": "2330.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪৮, আন্তর্জাতিক নাম্বারঃ ২৩৩০ ৫৯৪৮-(৮২/...) আহমাদ ইবনু সাঈদ ইবনু সাখ্‌র দারিমী (রহঃ) ... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন শুভ্র উজ্জ্বল বর্ণের। তার ঘাম যেন মুক্তার মতো। তিনি চলার সময় সম্মুখ পানে ঝুঁকে চলতেন। আমি নরম কাপড় বা রেশমকেও তার হাতের তালুর মতো নরম পাইনি এবং মিশক ও আম্বারের মাঝেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শরীরের চেয়ে অধিক সুগন্ধ পাইনি। (ইসলামিক ফাউন্ডেশন ৫৮৪৬, ইসলামিক সেন্টার ৫৮৮১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6055,
			"arabicnumber": "2331.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৪৯, আন্তর্জাতিক নাম্বারঃ ২৩৩১ ৫৯৪৯-(৮৩/২৩৩১) যুহায়র ইবনু হারব (রহঃ) ...... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের গৃহে আসলেন এবং আরাম করলেন। তিনি ঘর্মাক্ত হলেন, আর আমার মা একটি ছোট বোতল নিয়ে মুছে তাতে ভরতে লাগলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জাগ্রত হলেন। তিনি প্রশ্ন করলেন, হে উম্মু সুলায়ম! একি করছ? আমার মা বললেন, এ হচ্ছে আপনার ঘাম, যা আমরা সুগন্ধির সঙ্গে মেশাই, আর এ তো সব সুগন্ধির সেরা সুগন্ধি। (ইসলামিক ফাউন্ডেশন ৫৮৪৭, ইসলামিক সেন্টার ৫৮৮২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6056,
			"arabicnumber": "2331.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫০, আন্তর্জাতিক নাম্বারঃ ২৩৩১ ৫৯৫০-(৮৪/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু সুলায়মের গৃহে যেতেন এবং তার বিছানায় আরাম করতেন আর উম্মু সুলায়ম তখন গৃহে থাকত না। আনাস (রাযিঃ) বলেন, একদিন তিনি এলেন এবং তার বিছানায় ঘুমালেন। উম্মু সুলায়মকে বলা হলো, ইনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমার গৃহে, তোমার বিছানায় ঘুমিয়ে গেছেন। আনাস (রাযিঃ) বলেন, উম্মু সুলায়ম গৃহে প্রবেশ করলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন ঘর্মাক্ত হয়েছেন, আর তার ঘাম চামড়ার বিছানার উপর জমে গেছে, উম্মু সুলায়ম তার কৌটা খুললেন এবং সে ঘাম মুছে মুছে ছোট একটি বোতলে ভরতে লাগলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হঠাৎ উঠে গেলেন এবং বললেন, হে উম্মু সুলায়ম! তুমি কি করছ? তিনি বললেন, হে আল্লাহর রসূল! আমাদের শিশুদের জন্য তার বারাকাত নিচ্ছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ভাল করেছ। (ইসলামিক ফাউন্ডেশন ৫৮৪৮, ইসলামিক সেন্টার ৫৮৮৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6057,
			"arabicnumber": "2332",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫১, আন্তর্জাতিক নাম্বারঃ ২৩৩২ ৫৯৫১-(৮৫/২৩৩২) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... উম্মু সুলায়ম (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট আসতেন এবং বিশ্রাম নিতেন, উম্মু সুলায়ম তার জন্য একটা চামড়ার বিছানা বিছিয়ে দিলে তিনি তার উপর কায়লুলা* করতেন। তিনি প্রচণ্ড ঘামতেন আর উম্মু সুলায়ম তা একত্র করতেন এবং সুগন্ধির বোতলে তা মিশিয়ে রাখতেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হে উম্মু সুলায়ম! এ কী করছ? তিনি বললেন, আপনার ঘাম, আমি সেটা সুগন্ধির সঙ্গে মিশিয়ে রাখি। (ইসলামিক ফাউন্ডেশন ৫৮৪৯, ইসলামিক সেন্টার ৫৮৮৪) * দুপুরের খাবারের পর কিছুক্ষণ শুয়ে বিশ্রাম করাকে 'কায়লুলা' বলে।",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6058,
			"arabicnumber": "2333.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫২, আন্তর্জাতিক নাম্বারঃ ২৩৩৩ ৫৯৫২-(৮৬/২৩৩৩) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা (রহঃ) ..... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, শীতের দিনে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ওয়াহী অবতীর্ণ হত আর তার কপাল বেয়ে ঘাম পড়তো। (ইসলামিক ফাউন্ডেশন ৫৮৫০, ইসলামিক সেন্টার ৫৮৮৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6059,
			"arabicnumber": "2333.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৩, আন্তর্জাতিক নাম্বারঃ ২৩৩৩ ৫৯৫৩-(৮৭/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ‘আয়িশাহ্ (রাযিঃ) হতে বর্ণিত যে, হারিস ইবনু হিশাম (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলেন, আপনার নিকট ওয়াহী নাযিল হয় কীভাবে? তিনি বললেনঃ কখনো তা আসে ঘণ্টার ধ্বনির মতো শব্দ করে আর তা আমার জন্য অনেক কষ্টকর হয়। এরপর ওয়াহী থেমে যায়, আর আমি মুখস্থ করে নেই। আবার কখনো (ওয়াহী নিয়ে) পুরুষের ছদ্মবেশে একজন ফেরেশতা আসেন এবং তিনি যা বলেন আমি তা মুখস্থ করে নেই। (ইসলামিক ফাউন্ডেশন ৫৮৫১, ইসলামিক সেন্টার ৫৮৮৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6060,
			"arabicnumber": "2334",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৪, আন্তর্জাতিক নাম্বারঃ ২৩৩৪ ৫৯৫৪-(৮৮/২৩৩৪) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... উবাদাহ্ ইবনু সামিত (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর যখন ওয়াহী অবতীর্ণ হতো তখন তার খুব কষ্ট হত এবং তার মুখায়ব কেমন যেন শুকিয়ে যেত। (ইসলামিক ফাউন্ডেশন ৫৮৫২, ইসলামিক সেন্টার ৫৮৮৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6061,
			"arabicnumber": "2335",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৫, আন্তর্জাতিক নাম্বারঃ ২৩৩৫ ৫৯৫৫-(৮৯/২৩৩৫) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... উবাদাহ্ ইবনু সামিত (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর যখন ওয়াহী অবতীর্ণ হতো তখন তিনি শীর নত করে ফেলতেন এবং তার সাহাবীরাও শীর নত করতেন। অতঃপর যখন ওয়াহী নাযিল শেষ হয়ে আসত তিনি তার মাথা উঠাতেন। (ইসলামিক ফাউন্ডেশন ৫৮৫৩, ইসলামিক সেন্টার ৫৮৮৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6062,
			"arabicnumber": "2336.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৬, আন্তর্জাতিক নাম্বারঃ ২৩৩৬ ৫৯৫৬-(৯০/২৩৩৬) মানসূর ইবনু আবূ মুযাহিম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আহলে কিতাবরা তাদের চুল কপালের সামনে ঝুলিয়ে রাখতো এবং মুশরিকরা সিথি কাটতো। যে বিষয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি কোন নির্দেশ আসতো না, সে বিষয়ে তিনি আহলে কিতাবদের মতো পালন করা পছন্দ করতেন। তাই তিনি তার চুল কপালে (প্রথমে) বুলিয়ে রাখেন এবং পরবর্তী সময় সিথি কাটতে থাকেন। (ইসলামিক ফাউন্ডেশন ৫৮৫৪, ইসলামিক সেন্টার ৫৮৮৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6063,
			"arabicnumber": "2336.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৭, আন্তর্জাতিক নাম্বারঃ ২৩৩৬ ৫৯৫৭-(.../...) আবূ তাহির (রহঃ) ইবনু শিহাব (রহঃ) এর সূত্রে এ সানাদে হুবহু হাদীস রিওয়ায়াত করেন। (ইসলামিক ফাউন্ডেশন ৫৮৫৪, ইসলামিক সেন্টার ৫৮৯০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6064,
			"arabicnumber": "2337.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৮, আন্তর্জাতিক নাম্বারঃ ২৩৩৭ ৫৯৫৮-(৯১/২৩৩৭) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... বারা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন মাঝারি আকৃতির পুরুষ। তার দুই কাঁধের ব্যবধান ছিল অধিক (অর্থাৎ তার কাঁধ ও বক্ষ প্রশস্ত ছিল)। চুল ছিল কানের লতিকা পর্যন্ত লম্বিত। তার গায়ে লাল পোশাক পড়া ছিল। তার চাইতে অতি সুন্দর কোন কিছু আমি কক্ষনো প্রত্যক্ষ করিনি। (ইসলামিক ফাউন্ডেশন ৫৮৫৫, ইসলামিক সেন্টার ৫৮৯১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6065,
			"arabicnumber": "2337.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৫৯, আন্তর্জাতিক নাম্বারঃ ২৩৩৭ ৫৯৫৯-(৯২/...) 'আমর আন্‌ নাকিদ ও আবূ কুরায়ব (রহঃ) ..... বারা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, চুলওয়ালা, লাল পোশাক পরিহিত কোন লোককে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চেয়ে সুন্দর দেখিনি। তার চুল কাঁধ স্পর্শ করতো। উভয় কাঁধের মধ্যে বেশ দূরত্ব ছিল। তিনি লম্বাও ছিলেন না, বেঁটেও ছিলেন না। আবূ কুরায়ব (রহঃ) বলেন, 'তার চুল ছিল'। (ইসলামিক ফাউন্ডেশন ৫৮৫৬, ইসলামিক সেন্টার ৫৮৯২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6066,
			"arabicnumber": "2337.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬০, আন্তর্জাতিক নাম্বারঃ ২৩৩৭ ৫৯৬০-(৯৩/...) আবূ কুরায়ব মুহাম্মাদ ইবনু 'আলা (রহঃ) ..... বারা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সবচেয়ে সুন্দর মুখায়বের অধিকারী ছিলেন। আর তিনি সবচেয়ে উত্তম চরিত্রের অধিকারী ছিলেন। তিনি খুব লম্বাও ছিলেন না এবং বেঁটেও ছিলেন না। (ইসলামিক ফাউন্ডেশন ৫৮৫৭, ইসলামিক সেন্টার ৫৮৯৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6067,
			"arabicnumber": "2338.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬১, আন্তর্জাতিক নাম্বারঃ ২৩৩৮ ৫৯৬১-(৯৪/২৩৩৮) শাইবান ইবনু ফাররূখ (রহঃ) ..... কাতাদাহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আনাস ইবনু মালিক (রাযিঃ) কে প্রশ্ন করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কেমন চুলের অধিকারী ছিল? তিনি বললেন, তিনি মধ্যম ধরনের চুলের অধিকারী ছিলেন, চুলগুলো একেবারে কোকড়ানোও ছিল না আর একেবারে সোজাও ছিল না, তা ছিল দু’কাঁধ এবং দু’কানের মাঝ বরাবর। (ইসলামিক ফাউন্ডেশন ৫৮৫৮, ইসলামিক সেন্টার ৫৮৯৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6068,
			"arabicnumber": "2338.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬২, আন্তর্জাতিক নাম্বারঃ ২৩৩৮ ৫৯৬২-(৯৫/...) যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল তার দু’কাঁধ স্পর্শ করত। (ইসলামিক ফাউন্ডেশন ৫৮৫৯, ইসলামিক সেন্টার ৫৮৯৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6069,
			"arabicnumber": "2338.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৩, আন্তর্জাতিক নাম্বারঃ ২৩৩৮ ৫৯৬৩-(৯৬/...) ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ কুরায়ব (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল তার দু’ কানের অর্ধেক পর্যন্ত ঝুলানো ছিল। (ইসলামিক ফাউন্ডেশন ৫৮৬০, ইসলামিক সেন্টার ৫৮৯৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6070,
			"arabicnumber": "2339",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৪, আন্তর্জাতিক নাম্বারঃ ২৩৩৯ ৫৯৬৪-(৯৭/২৩৩৯) মুহাম্মাদ ইবনুল মুসান্না এবং মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশস্ত চেহারার অধিকারী ছিলেন, টানাটানা নয়ন এবং সুষম গোড়ালি বিশিষ্ট আকৃতির অধিকারী ছিলেন। রাবী শুবাহ্ (রহঃ) কে জিজ্ঞেস করলেন, প্রশস্ত চেহারা কেমন? তিনি বললেন, বড় মুখায়ব। শু'বাহ বলেন, আমি বললাম, টানা চোখ কেমন? তিনি বললেন, চোখ দু’টো দীঘল দীর্ঘ ডাগর। তিনি বলেন যে, আমি বললাম, সুষম গোড়ালি কেমন? তিনি বললেন, হাল্কা গোড়ালি। (ইসলামিক ফাউন্ডেশন ৫৮৬১, ইসলামিক সেন্টার ৫৮৯৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6071,
			"arabicnumber": "2340.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৫, আন্তর্জাতিক নাম্বারঃ ২৩৪০ ৫৯৬৫-(৯৮/২৩৪০) সাঈদ ইবনু মানসূর (রহঃ) ..... জুরাইরী সূত্রে আবূ তুফায়ল (রাযিঃ) হতে বর্ণিত। তিনি (জুরাইরী) বলেন, আমি তাকে (আবূ তুফায়লকে) প্রশ্ন করলাম যে, আপনি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রত্যক্ষ করেছেন? তিনি বললেন, হ্যাঁ! তিনি ছিলেন ফর্সা, লাবণ্যময়, উজ্জ্বল চেহারার অধিকারী। মুসলিম ইবনুল হাজ্জাজ (রহঃ) বলেন, একশ' হিজরীতে আবূ তুফায়ল (রাযিঃ) মৃত্যুবরণ করেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের মাঝে সর্বশেষে তিনিই ইন্তিকাল করেন। (ইসলামিক ফাউন্ডেশন ৫৮৬২, ইসলামিক সেন্টার ৫৮৯৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6072,
			"arabicnumber": "2340.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৬, আন্তর্জাতিক নাম্বারঃ ২৩৪০ ৫৯৬৬-(৯৯/...) উবাইদুল্লাহ ইবনু উমার কাওয়ারীরী (রহঃ) ..... আবূ তুফায়ল (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখেছি। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছেন আমি ব্যতীত এমন কেউ পৃথিবীতে আর বাকী নেই। বর্ণনাকারী বলেন, আমি বললাম, তাকে কেমন দেখেছেন? তিনি বললেন, ফর্সা, লাবণ্যময় এবং মধ্যমাকৃতির। (ইসলামিক ফাউন্ডেশন ৫৮৬৩, ইসলামিক সেন্টার ৫৮৯৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6073,
			"arabicnumber": "2341.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৭, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৬৭-(১০০/২৩৪১) আবূ বাকর ইবনু আবূ শাইবাহ, ইবনু নুমায়র ও আমর আন নাকিদ (রহঃ) হতে বর্ণিত। তিনি বলেন, আনাস (রাযিঃ) কে জিজ্ঞেস করা হলো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি খিযাব (কলপ) লাগাতেন? তিনি বললেনঃ এতটুকু বার্ধক্য তার মধ্যে লক্ষ্য করা যায়নি। কিন্তু ইবনু ইদরীস (রহঃ) বলেন, তিনি যেন সামান্য করছিলেন। তবে আবূ বাকর ও উমার (রাযিঃ) মেহেদী এবং কাতাম দ্বারা কলপ লাগিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৮৬৪, ইসলামিক সেন্টার ৫৯০০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6074,
			"arabicnumber": "2341.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৮, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৬৮-(১০১/...) মুহাম্মাদ ইবনু বুকায়ল (রহঃ) ..... ইবনু সীরীন (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আনাস ইবনু মালিক (রাযিঃ) কে জিজ্ঞেস করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি খিযাব লাগিয়েছিলেন? উত্তরে আনাস (রাযিঃ) বললেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) খিযাব লাগানোর বয়সে পৌছেননি। এরপর তিনি বললেন, তার (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর) দাঁড়িতে কিছু সাদা লোম ছিল মাত্র। ইবনু সীরীন (রহঃ) বলেন, আমি তাকে জিজ্ঞেস করলাম, আবূ বাকর (রাযিঃ) লাগাতেন কি? তিনি বললেন, হ্যাঁ। মেহেদী ও কাতাম দ্বারা খিযাব লাগাতেন। (ইসলামিক ফাউন্ডেশন ৫৮৬৫, ইসলামিক সেন্টার ৫৯০১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6075,
			"arabicnumber": "2341.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৬৯, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৬৯-(১০২/...) হাজ্জাজ ইবনু শাইর (রহঃ) বর্ণনা করেন যে, ইবনু সীরীন (রহঃ) আনাস ইবনু মালিক (রাযিঃ) কে জিজ্ঞেস করলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কলপ দিতেন? তিনি বললেন, তার মধ্যে কিছু মাত্র বার্ধক্য দেখা দিয়েছিল। (ইসলামিক ফাউন্ডেশন ৫৮৬৬, ইসলামিক সেন্টার ৫৯০২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6076,
			"arabicnumber": "2341.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭০, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৭০-(১০৩/...) আবূ রাবী' আতাকী (রহঃ) রিওয়ায়াত করেন যে, আনাস ইবনু মালিক (রাযিঃ) কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কলপ সম্পর্কে জিজ্ঞেস করা হলো। তিনি বলেন, আমি যদি ইচ্ছা করতাম তাহলে তার মাথার শুভ্র চুল গুনে ফেলতে পারতাম। তিনি বলেন, তিনি কলপ দেননি। তবে আবূ বাকর (রাযিঃ) মেহেদী এবং কাতাম (ঘাস জাতীয় এক ধরনের উদ্ভিদ) দ্বারা কলপ মেখেছেন এবং উমার (রাযিঃ) কেবল মেহেদী দ্বারা কলপ লাগিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৮৬৭, ইসলামিক সেন্টার ৫৯০৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6077,
			"arabicnumber": "2341.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭১, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৭১-(১০৪/...) নাসর ইবনু আলী জাহযামী (রহঃ) ... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, কারো চুল ও দাড়ির সাদা চুল উঠিয়ে ফেলা মাকরূহ এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কক্ষনো কলপ দেননি। কিছু সাদা তার অধরের* নীচের ছোট দাড়িতে ছিল, তার কানপট্টিতে কিছু আর মাথায় কিছু ছিল। (ইসলামিক ফাউন্ডেশন ৫৮৬৮, ইসলামিক সেন্টার ৫৯০৪) * নিচের ঠোঁট ও চিবুকের মধ্যবর্তী ক্ষুদ্র কেশগুচ্ছকে عَنْفَقَتِهِ (অধর) বলা হয়।",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6078,
			"arabicnumber": "2341.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭২, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৭২-(…/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) এ সূত্রেই হাদীসটি রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৬৮, ইসলামিক সেন্টার ৫৯০৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6079,
			"arabicnumber": "2341.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৩, আন্তর্জাতিক নাম্বারঃ ২৩৪১ ৫৯৭৩-(১০৫/...) মুহাম্মাদ ইবনুল মুসান্না, ইবনু বাশশার, আহমাদ ইবনু ইবরাহীম দাওরাকী ও হারূন ইবনু আবদুল্লাহ (রহঃ) এরা সবাই রিওয়ায়াত করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বার্ধক্যের ব্যাপারে আনাস (রাযিঃ) কে জিজ্ঞেস করা হলে তিনি বললেন, আল্লাহ তাকে বার্ধক্য দিয়ে সৌন্দর্যহীন করেননি। (ইসলামিক ফাউন্ডেশন ৫৮৬৯, ইসলামিক সেন্টার ৫৯০৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6080,
			"arabicnumber": "2342",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৪, আন্তর্জাতিক নাম্বারঃ ২৩৪২ ৫৯৭৪-(১০৬/২৩৪২) আহমাদ ইবনু ইউনুস ও ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) .....আবূ জুহাইফাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এতটুকু সাদা হতে দেখেছি। আর যুহায়র (রহঃ) এ কথা বলার সময় তার কতক অঙ্গুলি ছোট দাড়ির উপর রাখলেন। পরে লোকেরা আবূ জুহাইফাহকে বলল, আপনি তখন কেমন বয়সের ছিলেন? তিনি বললেন, আমি তীর তৈরি করা ও তাতে পাখা লাগানোর বয়সে উপনীত হয়েছি। (ইসলামিক ফাউন্ডেশন ৫৮৭০, ইসলামিক সেন্টার ৫৯০৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6081,
			"arabicnumber": "2343.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৫, আন্তর্জাতিক নাম্বারঃ ২৩৪৩ ৫৯৭৫-(১০৭/২৩৪৩) ওয়াসিল ইবনু আবদুল আ'লা (রহঃ) ..... আবূ জুহাইফাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখেছি, তার রং ছিল শুভ্র, তিনি প্রায় বার্ধক্যেই উপনীত হয়েছিলেন, হাসান ইবনু ‘আলী (রাযিঃ) দেখতে তার মতোই ছিল। (ইসলামিক ফাউন্ডেশন ৫৮৭১, ইসলামিক সেন্টার ৫৯০৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6082,
			"arabicnumber": "2343.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৬, আন্তর্জাতিক নাম্বারঃ ২৩৪৩ ৫৯৭৬-(.../...) সাঈদ ইবনু মানসূর ও ইবনু নুমায়র (রহঃ) ..... আবূ জুহাইফাহ্ (রাযিঃ) হতে এ হাদীসটিই রিওয়ায়াত করেছেন; তবে এর বর্ণনাকারীরা \"ফর্সা এবং প্রায় বৃদ্ধ হয়ে গিয়েছিলেন\" এ কথাগুলো বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৫৮৭২, ইসলামিক সেন্টার ৫৯০৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6083,
			"arabicnumber": "2344.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৭, আন্তর্জাতিক নাম্বারঃ ২৩৪৪ ৫৯৭৭-(১০৮/২৩৪৪) মুহাম্মদ ইবনুল মুসান্না (রহঃ) ..... সিমাক ইবনু হারব (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি জাবির ইবনু সামুরাহ (রাযিঃ) হতে শুনেছি, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বার্ধক্যের ব্যাপারে জিজ্ঞেস করা হলে তিনি বললেন, যখন তিনি মাথায় তেল মাখতেন তখন সাদা বর্ণ দেখা যেত না। কিন্তু যখন তেল মাখতেন না তখন দেখা যেত। (ইসলামিক ফাউন্ডেশন ৫৮৭৩, ইসলামিক সেন্টার ৫৯০৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6084,
			"arabicnumber": "2344.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৮, আন্তর্জাতিক নাম্বারঃ ২৩৪৪ ৫৯৭৮-(১০৯/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চুল এবং দাড়ির সামনের অংশ সাদা হয়ে গিয়েছিল। তিনি যখন তেল দিতেন (সাদা চুল) তখন দেখা যেত না, আর যখন চুল অগোছালো হত তখন (সাদা) দেখা যেত। তার দাড়ি প্রচুর ঘন ছিল। জনৈক লোক বলল, তার চেহারা ছিল তরবারির ন্যায়। জাবির (রাযিঃ) বললেন, না, তার চেহারা ছিল সূর্য ও চন্দ্রের ন্যায় (উজ্জ্বল) গোলাকার। আমি তাঁর পিঠের উপরিভাগে কবুতরের ডিম সদৃশ নুবুওয়াতের মোহর দেখেছি। এটির রং ছিল তার গায়ের রংয়ের মতো। (ইসলামিক ফাউন্ডেশন ৫৮৭৪, ইসলামিক সেন্টার ৫৯১০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6085,
			"arabicnumber": "2344.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭৯, আন্তর্জাতিক নাম্বারঃ ২৩৪৪ ৫৯৭৯-(১১০/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিঠে মোহরে নুবুওয়াত দেখেছি- যেন তা দেখতে কবুতরের ডিমের ন্যায়। (ইসলামিক ফাউন্ডেশন ৫৮৭৫, ইসলামিক সেন্টার ৫৯১১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6086,
			"arabicnumber": "2344.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮০, আন্তর্জাতিক নাম্বারঃ ২৩৪৪ ৫৯৮০-(…/...) ইবনু নুমায়র (রহঃ) ..... সিমাক (রহঃ) হতে এ সূত্রে অনুরূপ হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৭৬, ইসলামিক সেন্টার ৫৯১২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6087,
			"arabicnumber": "2345",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮১, আন্তর্জাতিক নাম্বারঃ ২৩৪৫ ৫৯৮১-(১১১/২৩৪৫) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মদ ইবনু আব্বাদ (রহঃ) .... সায়িব ইবনু ইয়াযীদ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমার খালা আমাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে গেলেন। তিনি বললেন, হে আল্লাহর রসূল! এটি আমার বোনের পুত্র। সে রোগগ্রস্তু। তখন তিনি আমার মাথায় হাত বুলিয়ে দিলেন এবং আমার জন্য বারাকাতের দু'আ করলেন। তারপর তিনি ওযু করলেন। আমি তার ওযুর পানি হতে পান করলাম। অতঃপর তাঁর পশ্চাতে দাঁড়ালাম এবং তার দু’কাঁধের মাঝে মোহরে নুবুওয়াত প্রত্যক্ষ করলাম হজালার ডিমের ন্যায়। (ইসলামিক ফাউন্ডেশন ৫৮৭৭, ইসলামিক সেন্টার ৫৯১৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6088,
			"arabicnumber": "2346",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮২, আন্তর্জাতিক নাম্বারঃ ২৩৪৬ ৫৯৮২-(১১২/২৩৪৬) আবূ কামিল সুওয়াইদ ইবনু সাঈদ ও হামিদ ইবনু উমার আল-বাকরাভী (রহঃ) ..... আবদুল্লাহ ইবনু সারজিস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেখেছি এবং তার সাথে গোশত ও রুটি খেয়েছি কিংবা বলেছেন, সারদ খেয়েছি। তিনি বলেন যে, আমি তাকে বললাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি আপনার জন্য ক্ষমা প্রার্থনা করেছেন তিনি বললেন, হ্যাঁ তোমার জন্যও। অতঃপর এ আয়াতটি তিলাওয়াত করলেন, \"তোমার পাপের জন্য মার্জনা চাও এবং ঈমানদার পুরুষ ও ঈমানদার নারীদের জন্য\"- (সূরা মুহাম্মদ ৪৭ঃ ১৯)। আবদুল্লাহ বলেন, এরপর আমি ঘুরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে গেলাম। আর মোহরে নুবুওয়াত দেখলাম, যা দু’কাঁধের মধ্যবর্তী বাম দিকের বাহুর হাড়ের নিকট অঙ্গুলির ন্যায়, যাতে তিলক ছিল। (ইসলামিক ফাউন্ডেশন ৫৮৭৮, ইসলামিক সেন্টার ৫৯১৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6089,
			"arabicnumber": "2347.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৩, আন্তর্জাতিক নাম্বারঃ ২৩৪৭ ৫৯৮৩-(১১৩/২৩৪৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেশি লম্বাও ছিলেন না এবং বেশি খাটোও ছিলেন না। আবার একেবারে সাদাও ছিলেন না এবং অতিরঞ্জিত সাদা কালো মিশ্রিতও ছিলেন না। তার চুল বেশি কোঁকড়ানোও ছিল না এবং একেবারে সোজাও ছিল না। চল্লিশ বছর বয়সে আল্লাহ তা'আলা তাকে নুবুওয়াত দান করেন। অতঃপর তিনি মক্কায় দশ বছর অবস্থান করেন এবং মদীনায় দশ বছর। ষাট বছরের মাথায় আল্লাহ তা'আলা তাকে ওফাত দান করেন। এ সময় তার মাথায় ও দাড়িতে বিশটি কেশও সাদা ছিল না। (ইসলামিক ফাউন্ডেশন ৫৮৭৯, ইসলামিক সেন্টার ৫৯১৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6090,
			"arabicnumber": "2347.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৪, আন্তর্জাতিক নাম্বারঃ ২৩৪৭ ৫৯৮৪-(.../…) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ আলী ইবনু হুজর ও কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে মালিক ইবনু আনাস বর্ণিত হাদীসের অবিকল রিওয়ায়াত করেছেন। তারা তাদের হাদীসে \"উজ্জ্বল সাদা বর্ণের ছিলেন\" বর্ধিত বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৮০, ইসলামিক সেন্টার ৫৯১৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6091,
			"arabicnumber": "2348",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৫, আন্তর্জাতিক নাম্বারঃ ২৩৪৮ ৫৯৮৫-(১১৪/২৩৪৮) আবূ গাসসান আর রাযী ও মুহাম্মদ ইবনু আমর (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাত হয়েছে তেষট্টি বছর বয়সে, আবূ বাকর সিদ্দিক (রাযিঃ)-এরও তেষট্টি বছর বয়সে, উমার (রাযিঃ)-এরও তেষট্টি বছর বয়সে। (ইসলামিক ফাউন্ডেশন ৫৮৮১, ইসলামিক সেন্টার ৫৯১৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6092,
			"arabicnumber": "2349.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৬, আন্তর্জাতিক নাম্বারঃ ২৩৪৯ ৫৯৮৬-(১১৫/২৩৪৯) আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স (রহঃ) … আয়িশাহ (রাযিঃ) হতে বর্ণিত যে, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাত হলো, তখন তার বয়স তেষট্টি বছর হয়েছিল। ইবনু শিহাব (রহঃ) বলেন, সাঈদ ইবনু মুসাইয়্যিব (রহঃ)-ও আমাকে অনুরূপ জানিয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৮৮২, ইসলামিক সেন্টার ৫৯১৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6093,
			"arabicnumber": "2349.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৭, আন্তর্জাতিক নাম্বারঃ ২৩৪৯ ৫৯৮৭-(.../...) উসমান ইবনু আবূ শাইবাহ ও আব্বাদ ইবনু মূসা (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে দু'টো সূত্রের মাধ্যমে উকায়ল এর হাদীসের হুবহু রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৮৩, ইসলামিক সেন্টার ৫৯১৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6094,
			"arabicnumber": "2350.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৮, আন্তর্জাতিক নাম্বারঃ ২৩৫০ ৫৯৮৮-(১১৬/২৩৫০) আবূ মা'মার ইসমাঈল ইবনু ইবরাহীম হুযালী (রহঃ) ..... 'আমর (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি উরওয়াহকে প্রশ্ন করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় কতদিন ছিলেন তিনি বললেন, দশ বছর। বর্ণনাকারী বলেন, আমি বললাম, ইবনু আব্বাস (রাযিঃ) তো বলেন, তেরো বছর। (ইসলামিক ফাউন্ডেশন ৫৮৮৪, ইসলামিক সেন্টার ৫৯২০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6095,
			"arabicnumber": "2350.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৮৯, আন্তর্জাতিক নাম্বারঃ ২৩৫০ ৫৯৮৯-(…/...) ইবনু আবূ উমার (রহঃ) ...... আমর (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি উরওয়াকে প্রশ্ন করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাকায় কত দিন অবস্থান করেছিলেন তিনি বললেন, দশ বছর। বর্ণনাকারী বলেন, আমি বললাম, ইবনু আব্বাস তো বলেন, দশ বছরের বেশি। বর্ণনাকারী বলেন, তিনি ইবনু আব্বাসের জন্য দুআ করে বললেন, তিনি এ তত্ত্ব কবিদের থেকে গ্রহণ করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৮৫, ইসলামিক সেন্টার ৫৯২১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6096,
			"arabicnumber": "2351.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯০, আন্তর্জাতিক নাম্বারঃ ২৩৫১ ৫৯৯০-(১১৭/২৩৫১) ইসহাক ইবনু ইবরাহীম ও হারূন ইবনু আবদুল্লাহ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত যে, মক্কায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তের বছর ছিলেন এবং তেষট্টি বছর বয়সে তিনি ইন্তিকাল করেন। (ইসলামিক ফাউন্ডেশন ৫৮৮৬, ইসলামিক সেন্টার ৫৯২২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6097,
			"arabicnumber": "2351.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯১, আন্তর্জাতিক নাম্বারঃ ২৩৫১ ৫৯৯১-(১১৮/…) ইবনু আবূ উমার (রহঃ) .... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় তের বছর অবস্থান করেছিলেন, সে সময় তার উপর ওয়াহী অবতীর্ণ হয় এবং মদীনায় দশ বছর ছিলেন। আর তার যখন ওফাত হয়, তখন তার বয়স ছিল তেষট্টি বছর। (ইসলামিক ফাউন্ডেশন ৫৮৮৭, ইসলামিক সেন্টার ৫৯২৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6098,
			"arabicnumber": "2352.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯২, আন্তর্জাতিক নাম্বারঃ ২৩৫২ ৫৯৯২-(১১৯/২৩৫২) আবদুল্লাহ ইবনু উমার ইবনু মুহাম্মদ ইবনু আবান আল-জু’ফী (রহঃ) ...... আবূ ইসহাক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি 'আবদুল্লাহ ইবনু 'উতবাহ (রাযিঃ) এর সাথে উপবিষ্ট ছিলাম। তখন মানুষেরা রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বয়স নিয়ে আলচনায় লিপ্ত হল। তাদের মধ্যে কেউ কেউ বলল, আবূ বাকর (রাযিঃ) (বয়সে) রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর তুলনায় বড় ছিলেন। 'আবদুল্লাহ (রাযিঃ) বললেন, যখন রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকাল হয় তখন তার বয়স হয়েছিল তেষট্টি বছর। আর আবূ বাকর (রাযিঃ) এর যখন ওফাত হয়, তখন তার বয়সও তেষট্টি বছর হয়েছিল। আর 'উমার (রাযিঃ) যখন শাহদাত বরণ করেন তখন তার বয়স হয়েছিল তেষট্টি বছর। বর্ণনাকারী বলেন, লোকদের মাঝে 'আমর ইবনু সা'দ নামধারী একজন বলল, জারীর আমাকে বলেছেন যে, আমরা মু’আবিয়াহ (রাযিঃ) এর নিকট বসা ছিলাম। মানুষেরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বয়সের বর্ণনা করল। সে সময় মু’আবিয়াহ (রাযিঃ) বললেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকাল হয় তখন তাঁর বয়স ছিল তেষট্টি বছর। আর যখন আবূ বাকর (রাযিঃ) ইস্তিকাল করেন তখন তাঁর বয়স ছিল তেষট্টি বছর এবং যখন উমার (রাযিঃ) শাহাদাতপ্রাপ্ত হন তখন তার বয়সও তেষট্টি বছর ছিল। (ইসলামিক ফাউন্ডেশন ৫৮৮৮, ইসলামিক সেন্টার ৫৯২৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6099,
			"arabicnumber": "2352.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৩, আন্তর্জাতিক নাম্বারঃ ২৩৫২ ৫৯৯৩-(১২০/…) ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ...... জারীর (রাযিঃ) হতে বর্ণিত যে, তিনি মু’আবিয়াহ (রাযিঃ) কে খুতবাহ দিতে শুনেছেন। মু'আবিয়াহ্ (রাযিঃ) বললেন, যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাত হয়, তখন তাঁর বয়স ছিল তেষট্টি বছর। আবূ বাকর (রাযিঃ) উমার (রাযিঃ)-ও তেষট্টি বছর (বয়সে ইন্তিকাল করেন) এবং আমি তেষট্টি বছর (বয়সের)। (ইসলামিক ফাউন্ডেশন ৫৮৮৯ ইসলামিক সেন্টার ৫৯২৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6100,
			"arabicnumber": "2353.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৪, আন্তর্জাতিক নাম্বারঃ ২৩৫৩ ৫৯৯৪-(১২১/২৩৫৩) ইবনু মিনহাল যারীর (রাযিঃ) ...... বানু হাশিমের মুক্তদাস আম্মার (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু আব্বাস (রাযিঃ)-কে প্রশ্ন করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যখন ওফাত হয় তখন তার (বয়স) কত ছিল? ইবনু আব্বাস (রাযিঃ) বললেন, আমি চিন্তা করিনি যে, তুমি তার গোত্রের ব্যক্তি হয়েও এ কথাটা অজানা রইবে। আমি বললাম, আমি লোকদের প্রশ্ন করেছি, তারা ভিন্ন মতাবলম্বন করেছেন। তাই এ ব্যাপারে আপনার বক্তব্য জানা আমি বেশি ভাল মনে করলাম। ইবনু আব্বাস (রাযিঃ) বললেন, তুমি কি হিসাব করতে জানো? তিনি বলেন, আমি বললাম, হ্যাঁ। তিনি বললেন, আচ্ছা চল্লিশ স্মরণ রেখ। এ সময় তিনি রসূল হন। এর সাথে পনের বছর যোগ করো, মক্কায় যখন অবস্থান করেন ভয় এবং নিরাপত্তায়। আরো দশ হিজরাতের পর হতে মদীনায়। (ইসলামিক ফাউন্ডেশন ৫৮৯০, ইসলামিক সেন্টার ৫৯২৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6101,
			"arabicnumber": "2353.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৫, আন্তর্জাতিক নাম্বারঃ ২৩৫৩ ৫৯৯৫-(…/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... ইউনুস (রাযিঃ) হতে উপরোক্ত সূত্রে ইয়াযীদ ইবনু যুরাই এর হাদীসের অবিকল রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৯১, ইসলামিক সেন্টার ৫৯২৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6102,
			"arabicnumber": "2353.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৬, আন্তর্জাতিক নাম্বারঃ ২৩৫৩ ৫৯৯৬-(১২২/...) নাসর ইবনু আলী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম* পঁয়ষট্টি বছর বয়সে ইন্তিকাল করেন। (ইসলামিক ফাউন্ডেশন ৫৮৯২, ইসলামিক সেন্টার ৫৯২৮) * উল্লেখ্য যে, যারা ভাঙ্গা বছরকেও গণনায় ধরেছেন তারা ৬৫ কিংবা ৬৪ বছর বলেছেন। আর যারা বাদ দিয়েছেন তাদের নিকট ৬৩ বছর গণনায় আসছে। আর এটাই প্রসিদ্ধ মত।",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6103,
			"arabicnumber": "2353.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৭, আন্তর্জাতিক নাম্বারঃ ২৩৫৩ ৫৯৯৭-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) এ সূত্রে খালিদ হতে রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৯২, ইসলামিক সেন্টার ৫৯২৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6104,
			"arabicnumber": "2353.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৮, আন্তর্জাতিক নাম্বারঃ ২৩৫৩ ৫৯৯৮-(১২৩/…) ইসহাক ইবনু ইবরাহীম হানযালী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় পনের বছর থাকেন, সাত বছর শব্দ শুনতেন এবং আলো দেখতে পেতেন, কিন্তু ভিন্ন কিছু দেখতেন না। আর আট বছর তার নিকট ওয়াহী আসত। অতঃপর মদীনায় দশ বছর থাকেন। (ইসলামিক ফাউন্ডেশন ৫৮৯৩, ইসলামিক সেন্টার ৫৯৩০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6105,
			"arabicnumber": "2354.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৯৯, আন্তর্জাতিক নাম্বারঃ ২৩৫৪ ৫৯৯৯-(১২৪/২৩৫৪) যুহায়র ইবনু হারব, ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমার (রহঃ) ... জুবায়র ইবনু মুত'ইম (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন। আমি মুহাম্মদ (প্রশংসিত), আমি আহমদ (অত্যধিক প্রশংসাকারী), আমি আল-মাহী’ (বিলুপ্তকারী) এমন লোক যে, আমার মাধ্যমে কুফুরকে নিঃশেষ করা হবে। আমি আল-হাশির (একত্রকারী) এমন ব্যক্তি যে, আমার পেছনে লোকেদের একত্রিত করা হৰে! আমি আল-আকিব' (সর্বশেষ) আর আল-আকীব, ঐ লোক যার পর আর কোন নবী নেই। (ইসলামিক ফাউন্ডেশন ৫৮৯৪, ইসলামিক সেন্টার ৫৯৩১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6106,
			"arabicnumber": "2354.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০০, আন্তর্জাতিক নাম্বারঃ ২৩৫৪ ৬০০০-(১২৫/...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ...... জুবায়র ইবনু মুতাইম (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার বহু নাম রয়েছে। আমি মুহাম্মদ, আমি আহমদ, আমি আল-মাহী’ (বিলোপ সাধনকারী) ঐ লোক যে, আমার মাধ্যমে আল্লাহ কুফুরকে নিঃশেষ করবেন, আমি আল-হাশির (একত্রকারী) এমন লোক যে, আমার পায়ের নিকট লোকেদের একত্রিত করা হবে। আমি আল-আকীব' (শেষ) এমন লোক যার পর কেউ (নবী) নেই এবং আল্লাহ তার নাম রেখেছেন রউফ ও রহীম। ইসলামিক ফাউন্ডেশন ৫৮৯৫, ইসলামিক সেন্টার ৫৯৩২",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6107,
			"arabicnumber": "2354.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০১, আন্তর্জাতিক নাম্বারঃ ২৩৫৪ ৬০০১-(.../...) আবদুল মালিক ইবনু শু'আয়ব ইবনু লায়স, আবদ ইবনু হুমায়দ ও আবদুল্লাহ ইবনু 'আবদুর রহমান দারিমী (রহঃ) ..... যুহরী (রহঃ) হতে এ সূত্রে হাদীস রিওয়ায়াত করেছেন। শু'আয়ব এবং মা'মার (রহঃ) বর্ণিত হাদীসে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি তিনি বর্ণনা করেছেন। আর মা'মারের হাদীসে আছে, তিনি বলেন, আমি যুহরী (রহঃ) কে প্রশ্ন করলাম, আল-আকিব কী? তিনি বললেন, এমন লোক যার পর আর নবী নেই। মা’মার ও উকায়ল এর হাদীসে রয়েছে 'আল-কাফারাতা', আর শুআয়ব এর হাদীসে আছে আল-কুফুর। (ইসলামিক ফাউন্ডেশন ৫৮৯৬, ইসলামিক সেন্টার ৫৯৩৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6108,
			"arabicnumber": "2355",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০২, আন্তর্জাতিক নাম্বারঃ ২৩৫৫ ৬০০২-(১২৬/২৩৫৫) ইসহাক ইবনু ইবরাহীম হানযালী (রহঃ) ... আবূ মুসা আশ'আরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট তাঁর নিজের নামগুলো রিওয়ায়াত করেছেন। তিনি বলেছেন, আমি মুহাম্মাদ, আহমদ, আল-মুকাফ্‌ফী (সর্বশেষ), আল-হাশির (একত্রকারী), তাওবার নবী ও রহমতের নবী। (ইসলামিক ফাউন্ডেশন ৫৮৯৭, ইসলামিক সেন্টার ৫৯৩৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6109,
			"arabicnumber": "2356.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৩, আন্তর্জাতিক নাম্বারঃ ২৩৫৬ ৬০০৩-(১২৭/২৩৫৬) যুহায়র ইবনু হারব (রহঃ) .... আয়িশাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, একটি কাজ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করলেন এবং এটি জারি রাখলেন। এ খবর তার কিছু সহাবার নিকট পৌছলে তারা এ কাজটি পছন্দ করলেন না এবং এ থেকে বিরত রইলেন। এ কথা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানতে পেরে দাঁড়িয়ে বক্তৃতা দিলেন। তিনি বললেনঃ জনগণের কি হলো, তাদের নিকট এ খবর পৌছেছে যে, একটা কাজে, আমি সম্মতি দিয়েছি, তারপরও তারা একে নিকৃষ্ট মনে করছে এবং এ থেকে বিরত থাকছে। আল্লাহর শপথ আল্লাহ সম্পর্কে আমি বেশি জানি এবং আল্লাহকে তাদের তুলনায় অতধিক ভয় করি। (ইসলামিক ফাউন্ডেশন ৫৮৯৮, ইসলামিক সেন্টার ৫৯৩৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6110,
			"arabicnumber": "2356.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৪, আন্তর্জাতিক নাম্বারঃ ২৩৫৬ ৬০০৪-(…/…) আবূ সাঈদ আশাজ্জ ইসহাক ইরনু ইবরাহীম (রহঃ) ...... আ'মাশ (রহঃ) হতে এ সূত্রে জারীর (রাযিঃ) এর হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৮৯৯, ইসলামিক সেন্টার ৫৯৩৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6111,
			"arabicnumber": "2356.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৫, আন্তর্জাতিক নাম্বারঃ ২৩৫৬ ৬০০৫-(১২৮/...) আবূ কুরায়ব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি কাজকে জায়িয করলেন, অন্য কিছু লোক তো খারাপ মনে করল। এ কথা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট পৌছলে তিনি রেগে গেলেন; এমনকি তার মুখায়বে রাগ প্রকাশ পেল। তখন তিনি বললেনঃ লোকদের কী হলো যে, আমার জন্য বৈধ একটা কাজে তারা আগ্রহ প্রকাশ করছে না। আল্লাহর শপথ! আমি অবশ্যই আল্লাহ সম্পর্কে তাদের চেয়ে অধিক জানি এবং তাকে অধিক ভয় করি। (ইসলামিক ফাউন্ডেশন ৫৯০০, ইসলামিক সেন্টার ৫৯৩৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6112,
			"arabicnumber": "2357",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৬, আন্তর্জাতিক নাম্বারঃ ২৩৫৭ ৬০০৬-(১২৯/২৩৫৭) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবদুল্লাহ ইবনু যুবায়র (রাযিঃ) হতে বর্ণিত যে, আনসারদের জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে যুবায়র (রাযিঃ) এর সাথে পানি সেচের নালা নিয়ে বিতর্ক করল যা থেকে তারা খেজুর গাছে পানি দিত। আনসার ব্যক্তিটি বললেন, পানি ছেড়ে দাও, তা প্রবাহিত হতে থাকুক। যুবায়র (রাযিঃ) তা মানলেন না। শেষ অবধি সকলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে তর্ক করলে তিনি যুবায়রকে বললেন, হে যুবায়র! তোমার পানি নেয়া হলে তোমার প্রতিবেশীর জন্য ছেড়ে দাও। সে সময় আনসার ব্যক্তিটি রাগাম্বিত স্বরে বলল, ইয়া রসূলাল্লাহ! যুবায়র তো আপনার ফুফাতো ভাই। এতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চেহারার রং পাল্টে গেলো। তিনি বললেন, হে যুবায়রা নিজের বৃক্ষগুলোকে পানি দাও এবং পানি আটকিয়ে রাখো, যে পর্যন্ত না পানি বাধ পর্যন্ত পৌছে যায়। যুবায়র (রাযিঃ) বলেন, আল্লাহর শপথ আমার ধারণা হয় এ আয়াত সে ব্যাপারেই নাযিল হয়ঃ \"তোমার প্রতিপালকের কসম! ততক্ষণ পর্যন্ত তারা মু'মিন হতে পারবে না .....\"— (সুরাহ আন নিসা ৪ঃ ৭৫)। (ইসলামিক ফাউন্ডেশন ৫৯০১, ইসলামিক সেন্টার ৫৯৩৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6113,
			"arabicnumber": "1337.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৭, আন্তর্জাতিক নাম্বারঃ ১৩৩৭ ৬০০৭-(১৩০/১৩৩৭) হারমালাহ ইবনু ইয়াহইয়া তুজীবী (রহঃ) ..... আবদুর রহমান ও সাঈদ ইবনু মুসাইয়্যিব (রহঃ) হতে বর্ণিত। তারা দু’জনে বলেন, আবূ হুরাইরাহ (রাযিঃ) বলতেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, আমি তোমাদের যা বারণ করেছি তা হতে বিরত থাকো এবং যা তোমাদের নির্দেশ করেছি তা যা সম্ভব পালন করো। কেননা, অধিক জিজ্ঞাসা ও স্বীয় নবীগণের সঙ্গে মতবিরোধ তোমাদের পূর্ববর্তীদের ধ্বংস করেছে। (ইসলামিক ফাউন্ডেশন ৫৯০২, ইসলামিক সেন্টার ৫৯৩৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6114,
			"arabicnumber": "1337.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৮, আন্তর্জাতিক নাম্বারঃ ১৩৩৭ ৬০০৮-(…/…) মুহাম্মাদ ইবনু আহমাদ ইবনু আবূ খালাফ (রহঃ) ..... ইবনু শিহাব (রহঃ) হতে এ সূত্রে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯০৩, ইসলামিক সেন্টার ৫৯৪০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6115,
			"arabicnumber": "1337.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০০৯, আন্তর্জাতিক নাম্বারঃ ১৩৩৭ ৬০০৯-(১৩১/...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তারা সবাই বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “আমি তোমাদের জন্য যা ছেড়ে দিয়েছি তোমরাও আমাকে সে বিষয়ে ছেড়ে দাও” (অর্থাৎ সে বিষয়ে আমাকে প্রশ্ন করো না)। হাম্মাম (রহঃ) এর হাদীসে আছে, “যে বিষয়ে তোমাদের ছাড় দেয়া হয়েছে।” কারণ তোমাদের পূর্ববর্তীরা ধ্বংস হয়েছে, এরপর তারা আবূ হুরাইরাহ হতে যুহরী এবং আবূ সালামাহ্ (রহঃ) এর হাদীসের অবিকল রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯০৪, ইসলামিক সেন্টার ৫৯৪১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6116,
			"arabicnumber": "2358.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১০, আন্তর্জাতিক নাম্বারঃ ২৩৫৮ ৬০১০-(১৩২/২৩৫৮) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের মাঝে সর্বাধিক দোষী ঐসব লোক, যে এমন ব্যাপারে জিজ্ঞেস করে, যা মুসলিমদের জন্য হারাম বা নিষিদ্ধ ছিল না। আর তার জিজ্ঞেস করার কারণে সে ব্যাপারটি মুসলিমদের উপর হারাম করে দেয়া হয়। (ইসলামিক ফাউন্ডেশন ৫৯০৫, ইসলামিক সেন্টার ৫৯৪২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6117,
			"arabicnumber": "2358.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১১, আন্তর্জাতিক নাম্বারঃ ২৩৫৮ ৬০১১-(১৩৩/…) আবূ বাকর ইবনু আবূ শাইবাহ, ইবনু আবূ উমার ও মুহাম্মাদ ইবনু আব্বাদ (রহঃ) ..... সা'দ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের মধ্যে সর্বাধিক অপরাধী মুসলিম সে-ই, যে মুসলিমদের জন্য যা অবৈধ নয়, এমন ব্যাপারে জিজ্ঞেস করে, আর সে ব্যাপারটি তার জিজ্ঞেস করার কারণে লোকদের উপর অবৈধ ঘোষণা দেয়া হয়। (ইসলামিক ফাউন্ডেশন ৫৯০৬, ইসলামিক সেন্টার ৫৯৪৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6118,
			"arabicnumber": "2358.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১২, আন্তর্জাতিক নাম্বারঃ ২৩৫৮ ৬০১২-(.../...) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ইউনুস থেকে এবং আবদ ইবনু হুমায়দ মা'মার থেকে, উভয়ে উক্ত সানাদে যুহরী (রহঃ) হতে রিওয়ায়াত করেন। তবে মা'মার এর হাদীসে যুহরীর রিওয়ায়াতে বর্ধিত আছে- “কোন লোক কোন ব্যাপারে জিজ্ঞেস করে এবং তৎসম্পর্কে অধিক জিজ্ঞেস করে”। ইবনু সা'দ (রহঃ) থেকে বর্ণিত ইউনুসের হাদীসে আছে যে, যুহরী (রহঃ) বলেছেন, তিনি আমির ইবনু সাদ হতে শুনেছেন। (ইসলামিক ফাউন্ডেশন ৫৯০৬, ইসলামিক সেন্টার ৫৯৪৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6119,
			"arabicnumber": "2359.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৩, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৩-(১৩৪/২৩৫৯) মাহমুদ ইবনু গাইলান, মুহাম্মাদ ইবনু কুদামাহ সুলামী এবং ইয়াহইয়া ইবনু মুহাম্মাদ লু'লুঈ (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, তার সাহাবীদের কোন কথা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট পৌছল। তখন তিনি এক বক্তৃতা দিলেন এবং বললেনঃ আমার সামনে জান্নাত ও জাহান্নাম উপস্থিত করা হয়। আজকের মতো ভাল এবং মন্দ আমি আর কখনো দেখিনি। আমি যা জানতে পেরেছি, তা যদি তোমরা জানতে, তবে তোমরা অবশ্যই খুবই কম হাসতে এবং বেশী কাঁদতে। আনাস (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের উপর এর চাইতে বিভীষিকাময় কোন দিন আর আসেনি। তারা নিজেদের মাথা আবৃত করল এবং তাদের ভেতর হতে কান্নার আওয়াজ আসতে লাগল। আনাস (রাযিঃ) বলেন, তারপর উমার (রাযিঃ) দাঁড়িয়ে বললেন, আমরা সন্তুষ্টচিত্তে আল্লাহকে রব, ইসলামকে দীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নবী হিসেবে মেনে নিলাম। অতঃপর এক লোক দাঁড়িয়ে বলল, আমার পিতা কে? তিনি বললেনঃ তোমার পিতা অমুক। তখন এ আয়াত নাযিল হলোঃ “হে মু’মিনগণ! তোমরা সেসব ব্যাপারে জিজ্ঞেস করো না, যা উন্মোচিত হলে তোমরা বেদনার্ত হবে”— (সূরাহ্ আল মায়িদাহ ৫ঃ ১০১)। (ইসলামিক ফাউন্ডেশন ৫৯০৭, ইসলামিক সেন্টার ৫৯৪৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6120,
			"arabicnumber": "2359.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৪, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৪-(১৩৫/...) মুহাম্মাদ ইবনু মা'মার ইবনু রিব'বঈ কায়সী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত। তিনি বলেন, জনৈক লোক বলল, হে আল্লাহর রসূল! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা অমুক। আর তখনই নাযিল হয়ঃ হে মুমিনগণ! তোমরা সেসব ব্যাপারে জিজ্ঞেস করো না যা উন্মোচিত হলে তোমরা বেদনার্ত হবে”..... আয়াতের শেষাংশ পর্যন্ত। (ইসলামিক ফাউন্ডেশন ৫৯০৮, ইসলামিক সেন্টার ৫৯৪৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6121,
			"arabicnumber": "2359.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৫, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৫-(১৩৬/...) হারমালাহ্ ইবনু ইয়াহইয়া ইবনু ‘আবদুল্লাহ ইবনু হারমালাহ্ ইবনু ‘ইমরান তুজীবী (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য ঢলে যাওয়ার পর বের হলেন এবং লোকদের নিয়ে যুহরের সালাত (সালাত/নামাজ/নামায) আদায় করলেন। যখন সালাম ফিরালেন তখন মিম্বারে দাঁড়িয়ে কিয়ামতের আলোচনা করে বর্ণনা করলেন যে, এর পূর্বে বহু বড় বড় বিষয় ঘটবে। তারপর বললেনঃ তোমাদের মাঝে যে লোক আমাকে কোন ব্যাপারে জিজ্ঞেস করতে চায় সে যেন ঐ সম্বন্ধে আমাকে জিজ্ঞেস করে। আল্লাহর শপথ! যতক্ষণ পর্যন্ত আমি এ স্থানে রয়েছি ততক্ষণ তোমরা আমাকে যে বিষয়েই জিজ্ঞেস করবে আমি তা বলে দিব। আনাস ইবনু মালিক (রাযিঃ) বলেন, এ কথা শুনে লোকেরা অনেক চিৎকার আরম্ভ করে দিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারবার বলতে থাকলেন, আমাকে জিজ্ঞেস করো। তখন আবদুল্লাহ ইবনু হুযাফাহ (রাযিঃ) দাঁড়িয়ে বললেন, আমার পিতা কে? হে আল্লাহর রসূল! তিনি বললেন; তোমার পিতা হুযাফাহ। তারপর যখন রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারবার বলতে থাকলেন, আমাকে জিজ্ঞেস করো। তখন উমার (রাযিঃ) হাঁটু গেড়ে বসে বললেন, সন্তুষ্টচিত্তে আমরা আল্লাহকে রব, ইসলামকে দীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রসূল হিসেবে মেনে নিয়েছি। আনাস ইবনু মালিক (রাযিঃ) বলেন, যখন উমার (রাযিঃ) এ কথা বললেন, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেমে গেলেন। বর্ণনাকারী বলেন, তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বিপদ সন্নিকটবর্তী। মুহাম্মাদের জীবন যার হাতে তার শপথ! এ দেয়ালটির পাশে এখনই আমার সামনে জান্নাত ও জাহান্নাম দেখানো হয়েছে। অতএব, আজকের মতো ভাল এবং খারাবী আমি আর দেখিনি। ইবনু শিহাব (রহঃ) বলেন, উবাইদুল্লাহ ইবনু আবদুল্লাহ ইবনু উতবাহ আমাকে বলেছেন, তিনি বলেন, আবদুল্লাহ ইবনু হুযাফার মা আবদুল্লাহ ইবনু হুযাফাহকে বলেছেন, তোর চাইতে অধিক অবাধ্য কোন সন্তানের ব্যাপারে আমি শুনিনি। তুই কি এ কথা হতে নিশ্চিন্ত ছিলি যে, তোর মাও হয়ত এমন কোন পাপ করে বসেছে যা জাহিলী যুগের নারীরা করত, আর তুই তোর মাকে লোকদের সম্মুখে অপমান করতিস? আবদুল্লাহ ইবনু হুযাফাহ (রাযিঃ) জবাবে বললেন, আল্লাহর শপথ আমাকে যদি একটা কালো হাবশীর সঙ্গেও সম্পর্কিত করতেন তাহলে আমি তা মেনে নিতাম। (ইসলামিক ফাউন্ডেশন ৫৯০৯, ইসলামিক সেন্টার ৫৯৪৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6122,
			"arabicnumber": "2359.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৬, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৬-(.../...) আবদ ইবনু হুমায়দ ও আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীস রিওয়ায়াত করেছেন। উবাইদুল্লাহর হাদীসটিও এর সাথে রয়েছে, তবে শু'আয়ব যুহরীর সূত্রে তিনি আবদুল্লাহ থেকে, তিনি জনৈক আহলে ইলম থেকে শুনেছেন— ‘আবদুল্লাহ ইবনু হুযাফার মা ইউনুসের হাদীসের অনুরূপ বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৯১০, ইসলামিক সেন্টার ৫৮৪৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6123,
			"arabicnumber": "2359.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৭, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৭-(১৩৭/...) ইউসুফ ইবনু হাম্মাদ মা’নী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত যে, লোকেরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করতে লাগল। এমনকি তারা তাকে প্রশ্ন করে জর্জরিত করে ফেলল, একদা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হয়ে এসে মিম্বারে দাড়িয়ে বললেনঃ আমাকে প্রশ্ন করো, যে কোন ব্যাপারে তোমরা আমাকে প্রশ্ন করবে, আমি অবশ্যই তোমাদের নিকট তা বর্ণনা করে দিব। লোকেরা এ কথা শুনে তাকে জিজ্ঞেস করা হতে মুখ বন্ধ রাখল এবং ঘাবড়িয়ে গেল, না জানি সামনে কোন ঘটনা সামনে এসে পড়ে। আনাস (রাযিঃ) বলেন, আমি ডানে বামে দেখতে লাগলাম। সকল লোক স্ব স্ব মাথা আবৃত করে কান্নাকাটি করছিল। তখন মসজিদ হতে জনৈক ব্যক্তি উঠল যার সাথে ঝগড়া লাগলে তার পিতা ছাড়া অন্যের দিকে তাকে সম্পর্কিত করা হতো। সে বলল, হে আল্লাহর নবী! কে আমার পিতা? তিনি বললেন, তোমার পিতা হুযাফাহ। তারপর উমার (রাযিঃ) দাঁড়িয়ে বললেন, (আমরা আন্তরিকতার সাথে) আল্লাহকে রব, ইসলামকে দীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রসূল হিসেবে মেনে নিলাম। আর আল্লাহর আশ্রয় প্রার্থনা করি ফিতনার অকল্যাণ থেকে। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আজকের মতো ভাল এবং খারাপ আমি কক্ষনো দেখিনি। আমার সামনে জান্নাত ও জাহান্নামের চিত্র তুলে ধরা হয়েছে। তাই আমি উভয়টিকে এ দেয়ালের পাশে দেখতে পাই। (ইসলামিক ফাউন্ডেশন ৫৯১১, ইসলামিক সেন্টার ৫৯৪৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6124,
			"arabicnumber": "2359.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৮, আন্তর্জাতিক নাম্বারঃ ২৩৫৯ ৬০১৮-(.../…) ইয়াহইয়া ইবনু হাবীব, মুহাম্মাদ ইবনু বাশশার ও আসিম ইবনু নাযর তাইমী (রহঃ) ..... আনাস (রাযিঃ) হতে এ বিবরণই রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯১২, ইসলামিক সেন্টার ৫৯৫০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6125,
			"arabicnumber": "2360",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০১৯, আন্তর্জাতিক নাম্বারঃ ২৩৬০ ৬০১৯-(১৩৮/২৩৬০) আবদুল্লাহ ইবনু বাররাদ আশ'আরী ও মুহাম্মাদ ইবনু আলী হামদানী (রহঃ) ..... আবূ মূসা (রাযিঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এমন কতক ব্যাপারে জিজ্ঞেস করা হলো যা তিনি অপছন্দ করেন। যখন এ রকম প্রশ্ন বারবার করা হলো, তিনি রাগাম্বিত হয়ে লোকদেরকে বললেনঃ যা ইচ্ছে তোমরা আমাকে প্রশ্ন করো। জনৈক লোক বলল, আমার পিতা কে? তিনি বললেন, তোমার পিতা হুযাফাহ। আরেক লোক দাঁড়িয়ে বলল, হে আল্লাহর রসূল! আমার পিতা কে? তিনি বললেন; তোমার পিতা শাইবার গোলাম সালিম। উমার (রাযিঃ) যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখমণ্ডলে রাগের লক্ষণ দেখতে পেলেন, তখন বললেন, হে আল্লাহর রসূল! আমরা আল্লাহর নিকট তওবা করছি। আবূ কুরায়ব (রহঃ) এর বর্ণনায় (কেবল এটুকু) আছে, বলল, কে আমার পিতা, হে আল্লাহর রসূল! তিনি বললেন, তোমার পিতা শাইবার দাস সালিম। (ইসলামিক ফাউন্ডেশন ৫৯১৩, ইসলামিক সেন্টার ৫৯৫১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6126,
			"arabicnumber": "2361",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২০, আন্তর্জাতিক নাম্বারঃ ২৩৬১ ৬০২০-(১৩৯/২৩৬১) কুতাইবাহ ইবনু সাঈদ সাকাকী ও আবূ কামিল জাহদারী (রহঃ) ..... তালহাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে খর্জুর (খেজুর) বৃক্ষের মাথায় দাঁড়ানো একদল লোকের নিকট দিয়ে যাচ্ছিলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এরা কি করছে? মানুষেরা বলল, এরা খেজুর গাছের পরাগায়ণ করছে। নরকে মাদীর (কেশর) সংমিশ্রণ করে, ফলে তা গর্ভ ধারণ করে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার মনে হয় না এতে কোন লাভ হয়। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এ বক্তব্য সহাবাদের নিকট পৌছলে তারা প্রজনন কর্ম থেকে বিরত থাকেন। তারপর এ সংবাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দেয়া হলো। তিনি বললেন, এতে যদি তাদের লাভ হয়ে থাকে তবে তারা করুক। আমি তো ধারণাপ্রসূত এ কথা বলেছি। তাই তোমরা আমার অনুমানকে ধরে রেখো না। কিন্তু আমি যদি আল্লাহর তরফ হতে কোন কথা বলি, তবে সেটার উপর আমল করো। কারণ আমি আল্লাহর উপর কখনই মিথ্যা অপবাদ দেই না। (ইসলামিক ফাউন্ডেশন ৫৯১৪, ইসলামিক সেন্টার ৫৯৫২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6127,
			"arabicnumber": "2362",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২১, আন্তর্জাতিক নাম্বারঃ ২৩৬২ ৬০২১-(১৪০/২৩৬২) আবদুল্লাহ ইবনু রূমী ইয়ামামী, ‘আব্বাস ইবনু ‘আবদুল আযম আম্বারী ও আহমাদ ইবনু জাফার মাকিরী (রহঃ) ..... রাফি ইবনু খাদীজ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় আসলেন। সে সময় লোকেরা খেজুর বৃক্ষ তাবীর করত। বর্ণনাকারী বলেন, অর্থাৎ- খেজুর বৃক্ষকে পরাগায়ন করাত। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা কি করছ? তারা বলল, আমরা তো এমন করে আসছি। তিনি বললেন, (আমার মনে হয়) তোমরা এমন না করলেই ভাল হয়। তাই তারা তা ছেড়ে দিল। আর এতে করে খেজুর ঝরে পড়ল কিংবা বর্ণনাকারী বলেছেন, তার উৎপাদন হ্রাস পেল। বর্ণনাকারী বলেন, মানুষেরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ ঘটনা ব্যক্ত করল। তখন তিনি বললেন, আমি তো একজন মানুষ মাত্র এতে কোন সন্দেহ নেই। দীনের ব্যাপারে যখন তোমাদের আমি কোন নির্দেশ দেই তোমরা তখন তা পালন করবে, আর যখন কোন কথা আমি আমার ধ্যান-ধারণা থেকে বলি, তখন (বুঝতে হবে) আমি একজন মানুষ মাত্র। বর্ণনাকারী ইকরামাহ্ (রহঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুরূপ বলেছেন। আর মা'কিরী (রহঃ) নিঃসন্দেহে শুধু নাফাযাত’ (ঝরে পড়ল) বলেছেন। (ইসলামিক ফাউন্ডেশন ৫৯১৫, ইসলামিক সেন্টার ৫৯৫৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6128,
			"arabicnumber": "2363",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২২, আন্তর্জাতিক নাম্বারঃ ২৩৬৩ ৬০২২-(১৪১/২৩৬৩) আবূ বাকর ইবনু আবূ শাইবাহ ও আমর আন্‌ নাকিদ (রহঃ) ..... আয়িশাহ্ (রাযিঃ) হতে বিভিন্ন সানাদে আনাস (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যারা খেজুর বৃক্ষ তাবীর করত এদের কতক ব্যক্তির নিকট দিয়ে যাচ্ছিলেন। তিনি বললেন, এটি যদি না করতে তাহলে তোমাদের ভাল হতো। লোকেরা বিরত থাকল। এতে চিটা খেজুর উৎপন্ন হলো। তারপরে কোন এক সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিকট দিয়ে যাচ্ছিলেন, তখন তিনি প্রশ্ন করলেন, তোমাদের খেজুর বৃক্ষের কি হলো? ব্যক্তিরা বলল, আপনি এরূপ এরূপ বলেছিলেন (সেটি করায় এমন হয়েছে)। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের দুনিয়াবী ব্যাপারে তোমরাই ভাল জানো। (ইসলামিক ফাউন্ডেশন ৫৯১৬, ইসলামিক সেন্টার ৫৯৫৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6129,
			"arabicnumber": "2364",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৩, আন্তর্জাতিক নাম্বারঃ ২৩৬৪ ৬০২৩-(১৪২/২৩৬৪) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... হাম্মাম ইবনু মুনাব্বিহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ হুরাইরাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমাদের নিকট রিওয়ায়াত করেছেন, তার মাঝ হতে একটি হাদীস হলো এই যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার হাতে মুহাম্মাদের জীবন তার শপথ! তোমাদের উপর এমন এক মুহূর্ত আসবে যখন তোমরা আমার সাক্ষাৎ পাবে না; আর আমার সাক্ষাৎ লাভ তোমাদের নিকট তখন তোমাদের ধন-সম্পদ ও পরিবার-পরিজনের চেয়েও অধিক আকাঙ্ক্ষার বস্তু হবে। আবূ ইসহাক বলেন, হাদীসের শব্দের মধ্যে কিছু তাকদীম ও তাখীর হয়েছে। আমার মতে, হাদীসের অর্থ হল \"আমাকে তাদের সাথে দেখতে পাওয়াটা তাদের নিকট তাদের পরিবার-পরিজন ও ধন-সম্পদের চেয়ে অধিক প্রিয় হবে।\" (ইসলামিক ফাউন্ডেশন ৫৯১৭, ইসলামিক সেন্টার ৫৯৫৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6130,
			"arabicnumber": "2365.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৪, আন্তর্জাতিক নাম্বারঃ ২৩৬৫ ৬০২৪-(১৪৩/২৩৬৫) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, আমি মারইয়ামের পুত্রের সর্বাধিক কাছাকাছি। নবীগণ একে অপরের ভাইয়ের মতো এবং আমার ও তার মাঝে কোন নবী নেই। (ইসলামিক ফাউন্ডেশন ৫৯১৮, ইসলামিক সেন্টার ৫৯৫৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6131,
			"arabicnumber": "2365.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৫, আন্তর্জাতিক নাম্বারঃ ২৩৬৫ ৬০২৫-(১৪৪/...) আবূ বকর ইবনু শাইবাহ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ঈসা (আঃ) এর সর্বাধিক কাছাকাছি। নবীগণ একে অপরের (বৈমাত্রেয় ভাইয়ের) পিতৃসন্তানের মতো এবং আমার ও ঈসার মধ্যবর্তী সময়ে কোন নবী নেই। (ইসলামিক ফাউন্ডেশন ৫৯১৯, ইসলামিক সেন্টার ৫৯৫৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6132,
			"arabicnumber": "2365.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৬, আন্তর্জাতিক নাম্বারঃ ২৩৬৫ ৬০২৬-(১৪৫/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে রিওয়ায়াত করেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, দুনিয়া ও আখিরাতে আমি ঈসা (আঃ) এর সর্বাধিক নিকটবর্তী। লোকেরা বলল, এটি কিভাবে হে আল্লাহর রসূল? তখন তিনি বললেনঃ নবীগণ একই পিতার সন্তানের মতো। তাদের মাতা ভিন্ন। তাদের দীন একটিই। আর তার এবং আমার মাঝে কোন নবীও নেই। (ইসলামিক ফাউন্ডেশন ৫৯২০, ইসলামিক সেন্টার ৫৯৫৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6133,
			"arabicnumber": "2366.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৭, আন্তর্জাতিক নাম্বারঃ ২৩৬৬ ৬০২৭-(১৪৬/২৩৬৬) আবূ বাকর ইবনু আবূ শাইবাহ (রহ) ..... আবূ হুরাইরা (রাযিঃ) হতে বর্ণিত। রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন এমন কোন নবভূমিষ্ঠ সন্তান নেই যাকে শয়তান স্পর্শ করে না। আর সে নবজাত সন্তান শাইতানের স্পর্শে কান্নাকাটি শুরু করে, কেবল মারইয়াম পুত্র এবং তার মা ব্যতীত। তারপর আবূ হুরাইরাহ (রাযিঃ) বলেন, তোমাদের ইচ্ছে হলে পড়োঃ \"অবশ্যই আমি অভিশপ্ত শাইতান থেকে তার ও তার বংশধরদের জন্য তোমার শরণাপন্ন হচ্ছি\"- (সূরা আ-লি ইমারান ৩ঃ ৩৬)। (ইসলামিক ফাউন্ডেশন ৫৯২১, ইসলামিক সেন্টার ৫৯৫৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6134,
			"arabicnumber": "2366.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৮, আন্তর্জাতিক নাম্বারঃ ২৩৬৬ ৬০২৮-(…/...) মুহাম্মাদ ইবনু রাফি’ ও ‘আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... যুহরী (রহঃ) হতে উপরোক্ত সূত্রে রিওয়ায়াত করেছেন, “জন্মের সময় সে তাকে স্পর্শ করে, তখন শাইতানের স্পর্শে সে কান্নাকাটি শুরু করে দেয়।” শু'আয়বের হাদীসে আছে \"শাইতানের স্পর্শ\"। (ইসলামিক ফাউন্ডেশন ৫৯২১, ইসলামিক সেন্টার ৫৯৬০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6135,
			"arabicnumber": "2366.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০২৯, আন্তর্জাতিক নাম্বারঃ ২৩৬৬ ৬০২৯-(১৪৭/...) আবূ তাহির (রহঃ) ..... আবূ হুরাইরা (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেন, প্রত্যেক বানী আদমকেই শাইতান স্পর্শ করে, যেদিন তার মা তাকে প্রসব করে, কেবল মারইয়াম ও তাঁর পুত্র ঈসা (আঃ) এর ব্যতিক্রম। (ইসলামিক ফাউন্ডেশন ৫৯২২, ইসলামিক সেন্টার ৫৯৬১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6136,
			"arabicnumber": "2367",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩০, আন্তর্জাতিক নাম্বারঃ ২৩৬৭ ৬০৩০-(১৪৮/২৩৬৭) শাইবান ইবনু ফারুখ (রহঃ) ..... আবূ হুরাইয়াহ্ (রাযি) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ভূমিষ্ঠ হওয়ার প্রাক্কালে বাচ্চার চিৎকার শাইতানের খোঁচার কারণে হয়। (ইসলামিক ফাউন্ডেশন ৫৯২৩, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6137,
			"arabicnumber": "2368",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩১, আন্তর্জাতিক নাম্বারঃ ২৩৬৮ ৬০৩১-(১৪৯/২৩৬৮) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ মারইয়াম পুত্র ঈসা (আঃ) জনৈক লোককে চুরি করতে দেখলেন। সে সময় তিনি তাকে বললেন, তুমি চুরি করেছো। সে বলল, কক্ষনো না। যিনি ছাড়া প্রকৃতপক্ষে আর কোন মা'বূদ নেই, তার কসম! (আমি চুরি করিনি)। তখন ঈসা (আঃ) বললেন, আল্লাহর উপর বিশ্বাস স্থাপন করলাম আর আমি নিজেকে মিথ্যাবাদী প্রতিপন্ন করলাম। (ইসলামিক ফাউন্ডেশন ৫৯২৪, ইসলামিক সেন্টার ৫৯৬২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6138,
			"arabicnumber": "2369.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩২, আন্তর্জাতিক নাম্বারঃ ২৩৬৯ ৬০৩২ -(১৫০/২৩৬৯) আবূ বাকর ইবনু আবূ শাইবা ও আলী ইবনু হুজর সা’দী (রহঃ) …. আনাস ইবনু মালিক (রহঃ) হতে বর্ণিত। তিনি বলেন, জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, হে সৃষ্টির সেরা! তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন। তিনি (সৃষ্টির সেরা) তো ইব্রাহীম (আঃ) (ইসলামিক ফাউন্ডেশন ৫৯২৫, ইসলামিক সেন্টার ৫৯৬৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6139,
			"arabicnumber": "2369.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৩, আন্তর্জাতিক নাম্বারঃ ২৩৬৯ ৬০৩৩-(…/...) আবূ কুরায়ব (রহঃ) ..... আনাস (রাযি) হতে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯২৬, ইসলামিক সেন্টার ৫৯৬৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6140,
			"arabicnumber": "2369.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৪, আন্তর্জাতিক নাম্বারঃ ২৩৬৯ ৬০৩৪-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ...... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯২৭, ইসলামিক সেন্টার ৫৯৬৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6141,
			"arabicnumber": "2370",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৫, আন্তর্জাতিক নাম্বারঃ ২৩৭০ ৬০৩৫-(১৫১/২৩৭০) কুতাইবাহ ইবনু সাঈদ (রহঃ) ...... আবূ হুরাইরাহ (রাযি) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইব্রাহীম (আঃ) খৎনা করেছেন কুড়ালজাত অস্ত্র দ্বারা, সে সময় তার বয়স হয়েছিল আশি বছর। (ইসলামিক ফাউন্ডেশন ৫৯২৮, ইসলামিক সেন্টার ৫৯৬৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6142,
			"arabicnumber": "151.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৬, আন্তর্জাতিক নাম্বারঃ ১৫১ ৬০৩৬-(১৫২/১৫১) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) .... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমরা ইবরাহীম (আঃ)-এর চেয়ে সর্বাধিক সন্দেহপরায়ণ। যখন তিনি বলেছিলেনঃ হে আমার প্রতিপালক আপনি মৃতকে কিভাবে জীবিত করেন, আমাকে দেখান। তিনি বললেনঃ তবে কি তুমি বিশ্বাস করো না? তিনি বললেনঃ কেন করব না, তবে তা শুধু আমার আত্মার প্রশান্তির জন্য। লুত (আঃ) কে আল্লাহ রহম করুন, তিনি মজবুত-কঠিন স্তম্ভের আশ্রয় প্রার্থনা করতেন। আমি যদি ইউসুফ (আঃ)-এর মত দীর্ঘ সময় জেলখানায় কারাবদ্ধ হতাম তবে আহবানকারীর ডাক শুনামাত্র সাড়া দিতাম। (ইসলামিক ফাউন্ডেশন ৫৯২৯, ইসলামিক সেন্টার ৫৯৬৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6143,
			"arabicnumber": "151.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৭, আন্তর্জাতিক নাম্বারঃ ১৫১ ৬০৩৭-(…/...) ইনশা-আল্লা-হ 'আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আসমা (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) এর সানাদে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে ইউনুস তার সানাদে যুহরী (রহঃ) হতে বর্ণিত হাদীসের মর্মে হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯৩০, ইসলামিক সেন্টার ৫৯৬৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6145,
			"arabicnumber": "2371",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৩৯, আন্তর্জাতিক নাম্বারঃ ২৩৭১ ৬০৩৯-(১৫৪/২৩৭১) আবূ তাহির (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন নবী ইবরাহীম (আঃ) কক্ষনো মিথ্যা বলেননি; তিনবার ছাড়া। দু'বার আল্লাহ সম্পর্কিত। একবার তো তিনি বলেছিলেন, “আমি রোগগ্রস্ত’, আর তার কথা, “বরং এদের বড়টাই এ কাজ করেছে\"। অন্যটা সারা সম্বন্ধে। যে সময় তিনি এক যালিম শাসকের দেশে গিয়েছিলেন, সারাও তার সাথে ছিলেন। সারা ছিলেন সুন্দরীদের সেরা। সে সময় ইবরাহীম (আঃ) সারাকে বললেন, এ যালিম শাসক যদি অবহিত হন যে, তুমি আমার সহধর্মিণী তবে তোমাকে জোরপূর্বক নিয়ে নেবে। সুতরাং তোমাকে যদি কেউ জিজ্ঞেস করে, তুমি বলবে যে, তুমি আমার বোন। ইসলামের দিক দিয়ে তুমি তো আমার বোনই হও। কারণ তুমি আর আমি ব্যতীত দুনিয়াতে আর কোন মুসলিম রয়েছে বলে আমার জানা নেই। যখন ইবরাহীম (আঃ) সে যালিম শাসকের দেশে পৌছলেন, তখন শাসকের লোকজন তার নিকট সারাকে দেখতে পেয়ে শাসকের নিকট এসে বলল, আপনার ভূমিতে এমন একজন নারী এসেছে, আপনিই কেবল তার উপযুক্ত। শাসক সারাকে ডেকে পাঠালে ইবরাহীম (আঃ) সালাতে দাঁড়িয়ে গেলেন। যখন সারা শাসকের নিকট পৌছলেন, সে বেহুশের মতো সারার দিকে হাত বাড়াতেই তার হাত মুষ্টিবদ্ধ হয়ে এটে গেল। শাসক বলল, তুমি আল্লাহর নিকট আমার হাত খুলে যাওয়ার দু'আ করো। আমি তোমাকে বিরক্ত করব না। তিনি দু'আ করলেন। আবার সে হাত বাড়াল, তখন প্রথম মুষ্টির চেয়ে অধিক শক্ত হয়ে হাত মুষ্টিবদ্ধ হয়ে গেল। সারাকে সে আগের মতই বলল। তিনি দুআ করলেন। পুনরায় সে হাত বাড়াল। তখন প্রথম দু’বারের চেয়ে আরো বেশি শক্তভাবে তার হাত মুষ্টিবদ্ধ হয়ে গেল। তখন শাসক বলল, তুমি আল্লাহর কাছে আমার হাত খুলে দেয়ার জন্য দু'আ করো, আল্লাহর শপথ! তোমাকে আমি উত্যক্ত করব না। তিনি দু'আ করলেন। তার হাত খুলে গেল। তখন সে ঐ ব্যক্তিটিকে ডাকলো যে সারাকে এনেছিল। বলল, তুই তো আমার নিকট শাইতান নিয়ে এসেছিস, মানুষ আনিসনি। একে আমার ভূমি হতে বের করে দে। সঙ্গে হাজেরাকে দিয়ে দে। রাবী বলেন, সারা এগিয়ে চললেন। ইবরাহীম (আঃ) তাকে দেখে এগিয়ে আসলেন এবং তাকে প্রশ্ন করলেন, কি ঘটল? তিনি বললেন, ভালই। আল্লাহ তা'আলা আমার উপর হতে এ দুস্কৃতির হাতকে ফিরিয়ে রেখেছেন। আর একটা সেবিকাও দিয়েছেন। আবূ হুরাইরাহ (রাযিঃ) বলেন, এ সেবিকাই তোমাদের মা, হে আকাশের পানির সন্তানেরা। (ইসলামিক ফাউন্ডেশন ৫৯৩২. ইসলামিক সেন্টার ৫৯৭০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6146,
			"arabicnumber": "339.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪০, আন্তর্জাতিক নাম্বারঃ ৩৩৯ ৬০৪০-(১৫৫/৩৩৯) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বনী ইসরাঈলরা বস্ত্রবিহীন অবস্থায় গোসল করত। তারা পরস্পরের গুপ্তাঙ্গ দেখত। আর মূসা (আঃ) একাকী গোসল করতেন। লোকেরা বলত, মূসা আমাদের সঙ্গে গোসল করে না। কেননা [মূসা (আঃ) এর] অণ্ডকোষে রোগ আছে। বর্ণনাকারী বলেন, একদা মূসা (আঃ) পাথরের উপর কাপড় রেখে গোসল দিচ্ছিলেন। সে সময় পাথরটি তার বস্র নিয়ে ছুটতে লাগল। তখন মূসা (আঃ) \"ও পাথর। আমার কাপড় দে\", \"হে পাথর। আমার কাপড় দে” বলে পাথরটির পিছু পিছু দৌড়াতে লাগলেন, এতে বনী ইসরাঈল (প্রকাশ্যে) তার গুপ্তাঙ্গ দেখে ফেলল এবং বলল, আল্লাহর শপথ! মূসার তো কোন রোগ নেই। তারপর পাথরটি থেমে গেল, যখন ভালভাবে তা দৃষ্টিপাত হলো। মূসা (আঃ) কাপড় নিলেন এবং পাথরটিকে মারতে শুরু করলেন। আবূ হুরাইরাহ (রাযিঃ) বলেন, আল্লাহর কসম! এ পাথরটির গায়ে মূসা (আঃ) এর ছয় থেকে সাতটি মারের চিহ্ন রয়েছে। (ইসলামিক ফাউন্ডেশন ৫৯৩৩, ইসলামিক সেন্টার ৫৯৭১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6147,
			"arabicnumber": "339.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪১, আন্তর্জাতিক নাম্বারঃ ৩৩৯ ৬০৪১-(১৫৬/...) ইয়াহইয়া ইবনু হাবীব হারিসী (রহঃ) ...... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মূসা (আঃ) অতি লজ্জাশীল লোক ছিলেন। বর্ণনাকারী বলেন, তাকে কেউ বস্ত্রহীন অবস্থায় দেখেনি। বনী ইসরাঈলরা বলতেছিল, মূসার অণ্ডকোষ রোগগ্রস্ত। একদা তিনি পানিতে গোসল করতে গিয়ে কাপড়গুলো একটা পাথরের উপর রাখলেন। পাথরটি (কাপড়সহ) দৌড়ে পালাতে লাগলো। তিনি তার লাঠি হাতে পাথরটিকে মারতে মারতে এর পশ্চাতে ছুটলেন। বলতে লাগলেন, (হে পাথর) আমার কাপড়, হে পাথর! আমার কাপড়। পাথরটি বনী ইসরাঈলের এক জনসমাবেশে গিয়ে থামলো। এ প্রসঙ্গে এ আয়াত নাযিল হলোঃ \"হে মুমিনগণ! তোমরা তাদের ন্যায় হয়ো না যারা মূসা (আঃ) কে অপবাদ দিয়েছে। তাদের দেয়া অপবাদ হতে আল্লাহ তাকে পবিত্র করে দিয়েছেন এবং তিনি আল্লাহর নিকট ছিলেন সম্মানিত\"- (সূরা আল আহযাব ২৩ঃ ৬৯)। (ইসলামিক ফাউন্ডেশন ৫৯৩৪, ইসলামিক সেন্টার ৫৯৭২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6148,
			"arabicnumber": "2372.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪২, আন্তর্জাতিক নাম্বারঃ ২৩৭২ ৬০৪২-(১৫৭/২৩৭২) মুহাম্মাদ ইবনু রাফি এবং আবদ ইবনু হুমায়দ (রহঃ) ...... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, মালাকুল মাওতকে মূসা (আঃ) এর নিকট প্রেরণ করা হয়েছিল। যখন ফেরেশতা তার নিকট আসলেন তখন মূসা (আঃ) তাকে একটা চড় মারলেন। তাতে তার একটা চোখ নষ্ট হয়ে গেল। তারপর তিনি আল্লাহর নিকট ফিরে গেলেন এবং বললেন, আপনি আমাকে এমন এক বান্দার নিকট পাঠিয়েছেন যে মরতে চায় না। বর্ণনাকারী বলেন, আল্লাহ তা'আলা ফেরেশতার দৃষ্টি পুনর্বহাল করে দিয়ে বললেন, পুনরায় তার কাছে যাও এবং তাকে বলে, সে যেন তার হাত একটি বলদের পৃষ্ঠের উপর রাখে। এতে যতগুলো লোম তার হাতের নীচে পড়বে প্রতিটি লোমের পরিবর্তে সে এক বছর হায়াত পাবে। মূসা (আঃ) বললেন, তারপর কি হবে? আল্লাহ বললেন, তারপর মরণ। মূসা (আঃ) বললেন, তাহলে এখনই। তিনি বললেন, হে আল্লাহ আমাকে পবিত্র ভূমির এক ঢিলের কাছাকাছি করুন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি যদি সেখানে থাকতাম তাহলে পথের পাশে লাল বালির স্তুপের নিকট মুসা (আঃ) এর কবর দেখিয়ে দিতাম। (ইসলামিক ফাউন্ডেশন ৫৯৩৫, ইসলামিক সেন্টার ৫৯৭৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6149,
			"arabicnumber": "2372.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৩, আন্তর্জাতিক নাম্বারঃ ২৩৭২ ৬০৪৩-(১৫৮/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একদা মালাকুল মাওত মূসা (আঃ) এর নিকট এসে বলল, মূসা তোমার প্রতিপালকের নিকট চলো। বর্ণনাকারী বলেন, তখন তার চোখের উপর মূসা (আঃ) তাকে একটা চপেটাঘাত করলেন, এতে তার চোখ নষ্ট হয়ে গেল। তারপর ফেরেশতা আল্লাহর নিকট ফিরে গিয়ে বললেন, আপনি আমাকে আপনার এমন এক বান্দার নিকট পাঠিয়েছেন যে মরতে চায় না এবং সে আমার চোখ নষ্ট করে দিয়েছে। আল্লাহ তার চোখ ঠিক করে দিলেন এবং বললেন, আমার বান্দার নিকট আবার যাও এবং বলো, তুমি কি আরও দীর্ঘায়ু চাও? যদি তা চাও তবে তোমার হাত একটি বলদের পৃষ্ঠের উপর রাখো। এতে তোমার হাতের নিচে যতগুলো পশম পড়বে, তত বছর তুমি জীবিত থাকবে। মূসা বললেন, তারপর কি? আল্লাহ বললেন, তারপর মৃত্যুবরণ করবে। মূসা (আঃ) বললেন, তবে এখনই ভাল। হে আল্লাহ আমাকে পবিত্র ভূমির একটি পাথরের টিলের দূরত্বে নিয়ে মৃত্যু দান করুন। রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন আল্লাহর কসম! যদি আমি সেখানে থাকতাম পাথরের কিনারে লাল বালুকা স্তুপের পাশে তার কবর তোমাদের দেখিয়ে দিতাম। (ইসলামিক ফাউন্ডেশন ৫৯৩৬, ইসলামিক সেন্টার ৫৯৭৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6150,
			"arabicnumber": "2372.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৪, আন্তর্জাতিক নাম্বারঃ ২৩৭২ ৬০৪৪-(.../...) আবূ ইসহাক, মা'মার (রহঃ) হতে অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯৩৬, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6151,
			"arabicnumber": "2373.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৫, আন্তর্জাতিক নাম্বারঃ ২৩৭৩ ৬০৪৫-(১৫৯/২৩৭৩) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন যে, এক ইয়াহুদী কিছু মাল বিক্রি করছিল, দাম দেয়া হলে সে তাতে মনোতুষ্ট হলো না, কিংবা এটাকে খারাপ মনে করল, সে বলল, না হবে না, তার কসম যিনি মূসা (আঃ) কে লোকদের জন্য মনোনীত করেছেন। এ কথা এক আনসারী শুনতে পেয়ে ইয়াহুদীর গালে একটি চড় মারলেন এবং বললেন, তুই বলিস, মূসা (আঃ) কে লোকদের মধ্য হতে মনোনীত করেছেন অথচ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিদ্যমান রয়েছেন। ঐ ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, হে আবূল কাসিম! আমি জিম্মি এবং মুসলিম দেশের নিরাপত্তাপ্রাপ্ত মানুষ, আমাকে অমুক লোক চড় মেরেছে। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশ্ন করলেন, কেন তুমি তার গালে চড় দিলে? আনসারী বললেন, সে বলেছে যিনি মানুষের মধ্যে মূসা (আঃ) কে মনোনীত করেছেন অথচ আপনি আমাদের মাঝে বিদ্যমান। আবূ হুরাইরাহ (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুব ক্রোধাম্বিত হলেন। রাগের চিহ্ন তার মুখমণ্ডলে ফুটে উঠল। আর বললেনঃ নবীদের মাঝে একজনকে অপর জনের উপর মর্যাদা দিও না। কারণ যখন কিয়ামতের দিন শিঙ্গায় ফুৎকার দেয়া হবে তখন আসমান ও জমিনের সবাই বেহুশ হয়ে পড়বে, কেবল আল্লাহ যাদের চাইবেন তারা ব্যতীত। তারপরে দ্বিতীয়বার যখন ফুৎকার দেয়া হবে তখন সর্বপ্রথম আমিই উত্থিত হব এবং দেখতে পাব যে, মূসা (আঃ) আরশ ধরে রয়েছেন। আমার জানা নেই যে, তুর পাহাড়ে তার বেহুশ হওয়াটাই তার এখনকার বেহুশ না হওয়ার কারণ, না আমার আগেই তাকে চেতনা ফিরিয়ে দেয়া হয়েছে? আর আমি এ কথাও বলি না যে, কোন পয়গম্বর ইউনুস ইবনু মাত্তা (আঃ) এর তুলনায় অনেক মর্যাদাবান। (ইসলামিক ফাউন্ডেশন ৫৯৩৭, ইসলামিক সেন্টার ৫৯৭৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6152,
			"arabicnumber": "2373.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৬, আন্তর্জাতিক নাম্বারঃ ২৩৭৩ ৬০৪৬-(…/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবদুল আযীয ইবনু আবূ সালামাহ (রাযিঃ) হতে একই সূত্রে হুবহু হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯৩৭, ইসলামিক সেন্টার ৫৯৭৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6153,
			"arabicnumber": "2373.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৭, আন্তর্জাতিক নাম্বারঃ ২৩৭৩ ৬০৪৭-(১৬০/...) যুহায়র ইবনু হারব এবং আবূ বাকর ইবনু নায্‌র (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক ইয়াহুদী ও এক মুসলিম পরস্পর গলাগলি করল। মুসলিম বলল, তার কসম! যিনি সারা দুনিয়ার মাঝে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নির্বাচিত করেছেন। ইয়াহুদী বলল, কসম তার যিনি মূসা (আঃ) কে নির্বাচিত করেছেন সারা দুনিয়ার মাঝে! বর্ণনাকারী বলেন, এমন সময় মুসলিম হাত তুলল এবং ইয়াহুদীর গালে চড় মারল। অতঃপর ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গেল এবং তার ও মুসলিমের ঘটনা বলল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা আমাকে মূসা (আঃ) এর উপর মর্যাদা দিও না। কেননা মানুষেরা যখন বেহুশ হবে। সর্বপ্রথম আমি হুশ ফিরে পাব, তখন দেখতে পাব যে, মূসা (আঃ) আরশের কিনারা ধরে রয়েছেন। জানি না, তিনি কি বেহুশ হয়ে আমার আগেই হুশ ফিরে পেয়েছেন, নাকি যারা বেহুশ হননি তিনি তাদের মাঝে রয়েছেন। (ইসলামিক ফাউন্ডেশন ৫৯৩৮, ইসলামিক সেন্টার ৫৯৭৭)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6154,
			"arabicnumber": "2373.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৮, আন্তর্জাতিক নাম্বারঃ ২৩৭৩ ৬০৪৮-(১৬১/...) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী এবং আবূ বাকর ইবনু ইসহাক (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক মুসলিম ও এক ইয়াহুদী পরস্পর গালাগালি করল তারপর ইবরাহীম ইবনু সাঈদ ইবনু শিহাব হতে বর্ণিত হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯৩৯, ইসলামিক সেন্টার ৫৯৭৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6155,
			"arabicnumber": "2374.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৪৯, আন্তর্জাতিক নাম্বারঃ ২৩৭৪ ৬০৪৯-(১৬২/২৩৭৪) আমর আন্‌ নাকিদ (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, এক ইয়াহুদী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল তার গালে চড় দেয়া হয়েছে- যুহরীর হাদীসের মর্মানুযায়ী হাদীস রিওয়ায়াত করেছেন। কিন্তু তিনি শুধু এ কথাই বলেছেন যে, \"জানি না তিনি কি অচেতন হয়ে আমার পূর্বেই হুশ ফিরে পেয়েছেন, না-কি তুরের অচেতনই তার জন্য যথেষ্ট হয়েছে।\" (ইসলামিক ফাউন্ডেশন ৫৯৪০, ইসলামিক সেন্টার ৫৯৭৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6156,
			"arabicnumber": "2374.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫০, আন্তর্জাতিক নাম্বারঃ ২৩৭৪ ৬০৫০-(১৬৩/...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নবীদের মাঝে একের উপরে অন্যকে প্রাধান্য দিও না। (ইসলামিক ফাউন্ডেশন ৫৯৪১, ইসলামিক সেন্টার ৫৯৮০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6157,
			"arabicnumber": "2375.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫১, আন্তর্জাতিক নাম্বারঃ ২৩৭৫ ৬০৫১-(১৬৪/২৩৭৫) হাদ্দাব ইবনু খালিদ এবং শাইবান ইবনু ফাররূখ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) হতে রিওয়ায়াত করেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে রাত্রে আমার মি'রাজ হয়েছিল সে রাত্রে আমি মূসা (আঃ) এর নিকট দিয়ে যাচ্ছিলাম। লাল বালুকা স্তুপের নিকট তার কবরে তিনি দাঁড়িয়ে সালাত (সালাত/নামাজ/নামায) আদায় করছিলেন। (ইসলামিক ফাউন্ডেশন ৫৯৪২, ইসলামিক সেন্টার ৫৯৮১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6158,
			"arabicnumber": "2375.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫২, আন্তর্জাতিক নাম্বারঃ ২৩৭৫ ৬০৫২-(১৬৫/...) আলী ইবনু খাশরাম, উসমান ইবনু আবূ শাইবাহ ও আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আনাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি মূসা (আঃ) এর নিকট দিয়ে যাচ্ছিলাম তখন তিনি তার কবরে সালাত (সালাত/নামাজ/নামায) আদায় করছিলেন। ঈসার হাদীসে বর্ধিত আছে যে, “আমাকে যে রাত্রে মি'রাজে নিয়ে যাওয়া হয়েছিল, সে রাত্রে আমি যাচ্ছিলাম।” (ইসলামিক ফাউন্ডেশন ৫৯৪৩, ইসলামিক সেন্টার ৫৯৮২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6159,
			"arabicnumber": "2376",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৩, আন্তর্জাতিক নাম্বারঃ ২৩৭৬ ৬০৫৩-(১৬৬/২৩৭৬) আবূ বাকর ইবনু আবূ শাইবাহ, মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তাবারাকা ওয়া তা’আলা বলেছেন, আমার কোন বান্দার ক্ষেত্রেই এ কথা বলা ঠিক নয় যে, “ইউনুস ইবনু মাত্তা হতে আমি উত্তম।” (ইসলামিক ফাউন্ডেশন ৫৯৪৪, ইসলামিক সেন্টার ৫৯৮৩)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6160,
			"arabicnumber": "2377",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৪, আন্তর্জাতিক নাম্বারঃ ২৩৭৭ ৬০৫৪-(১৭৬/২৩৭৭) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চাচাত ভাই ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বান্দার ক্ষেত্রেই এ কথা বলা ঠিক নয়, “আমি ইউনুস ইবনু মাত্তা হতে উত্তম।” ইউনুস (আঃ) কে এখানে তার পিতা মাত্তার সঙ্গে সম্পর্কিত করা হয়েছে। (ইসলামিক ফাউন্ডেশন ৫৯৪৫, ইসলামিক সেন্টার ৫৯৮৪)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6161,
			"arabicnumber": "2378",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৫, আন্তর্জাতিক নাম্বারঃ ২৩৭৮ ৬০৫৫-(১৬৮/২৩৭৮) যুহায়র ইবনু হারব, মুহাম্মাদ ইবনুল মুসান্না ও উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করা হলো, হে আল্লাহর রসূল! মানুষের মাঝে সবচাইতে সম্মানিত ব্যক্তি কে? তিনি বললেনঃ তাদের মাঝে সর্বোত্তম মুত্তাকী ব্যক্তি। প্রশ্নকারীরা বললেন, আমরা এ ব্যাপারে আপনাকে প্রশ্ন করছি না। তিনি বললেনঃ তবে ইউসুফ (আঃ) আল্লাহর নবী এবং আল্লাহর নবীর সন্তান, যিনি আল্লাহর খলীলের পুত্র। তারা বলল, এ ব্যাপারেও আমরা আপনাকে জিজ্ঞেস করিনি। তিনি বললেনঃ তবে কি তোমরা আরবের বংশ-উৎস সম্বন্ধে প্রশ্ন করছ? জাহিলী যুগে যারা তাদের মাঝে উত্তম ছিল ইসলামের পরও তারাই উত্তম বলে গণ্য, তারা যদি দীনের ইলম অর্জন করে (ইসলামিক ফাউন্ডেশন ৫৯৪৬, ইসলামিক সেন্টার ৫৯৮৫)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6162,
			"arabicnumber": "2379",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৬, আন্তর্জাতিক নাম্বারঃ ২৩৭৯ ৬০৫৬-(…/...) হাদ্দাব ইবনু খালিদ (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যাকারিয়্যা (আঃ) কাঠমিস্ত্রী ছিলেন। (ইসলামিক ফাউন্ডেশন ৫৯৪৭, ইসলামিক সেন্টার ৫৯৮৬)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6163,
			"arabicnumber": "2380.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৭, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৫৭-(১৭০/২৩৮০) আমর ইবনু মুহাম্মাদ নাকিদ, ইসহাক ইবনু ইবরাহীম হান্‌যালী, উবাইদুল্লাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু আবূ উমার মাক্কী (রহঃ) ..... সাঈদ ইবনু জুবায়র (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) কে জিজ্ঞেস করলাম, নাওফ বিকালী বলেন যে, বনী ইসরাঈলের নবী মূসা খাযির (আঃ) এর সঙ্গী মূসা নন। ইবনু আব্বাস (রাযিঃ) বলেন, আল্লাহর শত্রু মিথ্যারোপ করেছে। আমি উবাই ইবনু কা'ব (রাযিঃ) হতে শুনেছি, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, মূসা (আঃ) বনী ইসরাঈলের মধ্যে বক্তৃতা দিতে দাঁড়ালেন। তাকে জিজ্ঞেস করা হলো, কোন লোক সর্বাধিক জ্ঞানী? তিনি জবাব দিলেন, \"আমি সর্বাধিক জ্ঞানী।\" আল্লাহ তা'আলা (এ উত্তরে) তার প্রতি অসন্তোষের বহিঃপ্রকাশ করলেন। কেননা, মূসা (আঃ) জ্ঞানকে আল্লাহর প্রতি ন্যস্ত করেননি। তারপর আল্লাহ তার প্রতি ওয়াহী প্রেরণ করলেন যে, দু'সাগরের মধ্যস্থলে আমার বান্দাদের মাঝে এক বান্দা আছে, যে তোমার তুলনায় বেশি জ্ঞানী। মূসা (আঃ) জিজ্ঞেস করলেন, হে প্রতিপালক! আমি কিভাবে তার সন্ধান পাব? তাকে বলা হলো, থলের ভেতর একটি মাছ নাও। মাছটি যেখানে হারিয়ে যাবে সেখানেই তাকে পাবে। তারপর তিনি রওনা হলেন। তার সাথে তার খাদিম ইউশা' ইবনু নূনও চললেন এবং মূসা (আঃ) একটি মাছ ব্যাগে নিয়ে নিলেন। তিনি ও তার খাদিম চলতে চলতে একটি চটানে উপস্থিত হলেন। এখানে মূসা (আঃ) শুয়ে পড়লেন। তার সঙ্গীও শুয়ে পড়ল। মাছটি নড়েচড়ে ব্যাগ হতে বের হয়ে সমুদ্রে ঝাপিয়ে পড়ল। এদিকে আল্লাহ তা'আলা পানির গতিরোধ করে দিলেন। এমনকি একটি গর্তের মতো হয়ে গেল এবং মাছটির জন্য একটি সুড়ঙ্গের ন্যায় হয়ে গেল। মূসা (আঃ) ও তার খাদিমের জন্য এটি একটি আশ্চর্যের বিষয় হলো। তারপর তারা আবার দিবা-রাত্রি চললেন। মূসা (আঃ) এর সঙ্গী সংবাদটি দিতে ভুলে গেল। যখন সকাল হলো মূসা (আঃ) তার খাদিমকে বললেন, আমাদের নাশতা বের করো। আমরা তো এ সফরে ক্লান্ত হয়ে পড়েছি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আদেশকৃত জায়গা অতিক্রম করে না যাওয়া পর্যন্ত তারা ক্লান্ত হননি। খাদিম বলল, আপনি কি জানেন, যখনই আমরা বড় পাথরটার নিকট বিশ্রাম নিয়েছিলাম তখন আমি মাছের কথাটি ভুলে গেলাম? আর শইতানই আমাকে আপনাকে বলার কথা ভুলিয়ে দিয়েছে এবং বিস্ময়করভাবে মাছটি সমুদ্রে তার নিজের পথ বের করে চলে গেছে। মূসা (আঃ) বললেন, এ স্থানটিই তো আমরা সন্ধান করছি। তারপর দু'জনেই নিজ নিজ পায়ের চিহ্ন অনুকরণ করে বড় পাথর পর্যন্ত পৌছলেন। সেখানে চাদরে আচ্ছাদিত জনৈক লোককে দেখতে পেলেন। মূসা (আঃ) তাকে সালাম দিলেন। খাযির (আঃ) বললেন, তোমাদের এ ভূমিতে সালাম কথেকে আসলো? মূসা (আঃ) বললেন, আমি মূসা। তিনি প্রশ্ন করলেন, বনী ইসরাঈলের মূসা? তিনি বললেন, হ্যাঁ। খাযির বললেন, আল্লাহ তার ইলম হতে এমন এক ইলম তোমাকে দিয়েছেন যা আমি জানি না এবং আল্লাহ তার ইলম হতে এমন এক ইলম আমাকে দিয়েছেন যা তুমি জান না। মূসা (আঃ) বললেন, আমি আপনার সঙ্গে থাকতে চাই যেন আপনার মতো ইলম আমাকে দান করেন। খাযির (আঃ) বললেন, তুমি আমার সঙ্গে ধৈর্য ধারণ করতে পারবে না। আর কী করেই তুমি ধৈর্য ধারণ করবে, যা সম্বন্ধে তুমি অজ্ঞাত? মূসা (আঃ) বললেন, ইনশাআল্লহ, আপনি আমাকে ধৈর্যশীল অবস্থায় পাবেন। আর আপনার কোন আদেশ আমি অমান্য করব না। খাযির (আঃ) বললেন, আচ্ছা তুমি যদি আমার অনুকরণ করে তবে আমি নিজে কিছু বর্ণনা না করা পর্যন্ত কোন ব্যাপারে আমাকে জিজ্ঞেস করবে না। মূসা (আঃ) বললেন, আচ্ছা। খাযির এবং মূসা (আঃ) দু’জনে সমুদ্রের তীর ধরে পথ চলতে লাগলেন। সামনে দিয়ে একটি নৌকা আসলো। তারা নৌকাওয়ালাকে তাদের তুলে নিতে বললেন। তারা খাযির (আঃ) কে চিনে ফেলল, তাই দু’জনকেই বিনা ভাড়ায় উঠিয়ে নিল। কিছুক্ষণ পর খাযির (আঃ) নৌকার একটি তক্তার প্রতি দৃষ্টিপাত করলেন এবং তা উঠিয়ে ফেললেন। (তা দেখে) মূসা (আঃ) বললেন, তারা তো এমন ব্যক্তি যে, আমাদের বিনা ভাড়ায় উঠিয়ে নিয়েছে; আর আপনি তাদের নৌকাটি ছিদ্র করে দিলেন যাতে নৌকা ডুবে যায়? আপনি তো সাংঘাতিক কাজ করেছেন। খাযির (আঃ) বললেন, আমি কি তোমায় বলিনি যে, তুমি আমার সাথে ধৈর্য ধরে থাকতে সক্ষম হবে না। মূসা (আঃ) বললেন, আপনি আমার এ ভুল মাফ করে দিবেন। আর আমাকে কঠিন অবস্থায় ফেলবেন না। তারপর নৌকার বাইরে এলেন এবং উভয়ে সমুদ্র তীর ধরে চলতে লাগলেন। হঠাৎ একটি বালকের সম্মুখীন হলেন, যে অন্যান্য বালকদের সাথে খেলা করছিল। খাযির (আঃ) তার মাথাটা হাত দিয়ে ধরে ছিড়ে ফেলে হত্যা করলেন। মূসা (আঃ) তাকে বললেন, আপনি কোন প্রাণের বিনিময় ব্যতীত একটা নিম্পাপ প্রাণকে শেষ করে দিলেন? আপনি তো বড়ই মন্দ কাজ করলেন। খাযির (আঃ) বললেন, আমি কি তোমাকে বলিনি যে, আমার সঙ্গে তুমি ধৈর্য ধারণ করতে পারবে না এবং এ ভুল প্রথমটার তুলনায় আরো মারাত্মক। মূসা (আঃ) বললেন, হ্যাঁ! তারপর যদি আর কোন ব্যাপারে জিজ্ঞেস করি তাহলে আমাকে সাথে রাখবেন না। নিঃসন্দেহে আপনার প্রতি আমার ক্রটি চরমে পৌছেছে। তারপর দু’জনেই পথ চলতে লাগলেন এবং একটি গ্রামে পৌছে গ্রামবাসীর নিকট খাদ্য কামনা করলেন। তারা তাদের আতিথেয়তা করতে আপত্তি জানালেন। তারপর তারা একটি দেয়াল পেলেন, যেটি ভেঙ্গে পড়ার উপক্রম হয়েছে অর্থাৎ- ঝুঁকে পড়েছে। খাযির (আঃ) আপন হাতে সেটি ঠিক করে সোজা করে দিলেন। মূসা (আঃ) বললেন, আমরা এ গোত্রের নিকট আসলে তারা আমাদের মেহমানদারী করেনি এবং খেতে দেয়নি। আপনি চাইলে এদের কাছ থেকে মজুরি নিতে পারতেন। খাযির (আঃ) বললেন, এবার আমার ও তোমার মাঝে ব্যবধান সূচিত হলো। এখন আমি তোমাকে এসব মর্মার্থ বলছি, যে সবের উপর তুমি ধৈর্যধারণ করতে সক্ষম হওনি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ মূসা (আঃ) এর উপর রহম করুন, আমার ইচ্ছা হয় যে, যদি তিনি ধৈর্যধারণ করতেন তাহলে আমাদের নিকট তাদের আরো ঘটনাসমূহের বর্ণনা দেয়া হতো। বর্ণনাকারী বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ প্রথমটা মূসা (আঃ) ভুলবশত করেছিলেন। এ-ও বলেছেন, একটা চড়ুই পাখি এসে নৌকার কিনারে বসে সমুদ্রে চঞ্চু মারল। সে সময় খাযির (আঃ) মূসাকে বলেন, আমার ও তোমার জ্ঞান আল্লাহর জ্ঞানের চেয়ে ততই কম, যতটি সমুদ্রের পানি হতে এ চড়ুইটি কমিয়েছে। সাঈদ ইবনু জুবায়র (রাযিঃ) বলেন, আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) পড়তেনঃ وَكَانَ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا (এদের সামনে একজন বাদশাহ ছিল, যে সকল ভাল নৌকা কেড়ে নিত) তিনি আরো পড়তেন, وَكَانَ الْغُلاَمُ فَكَانَ كَافِرًا (আর সে বালকটি কাফির ছিল)। ইসলামিক ফাউন্ডেশন ৫৯৪৮, ইসলামিক সেন্টার ৫৯৮৭",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6164,
			"arabicnumber": "2380.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৮, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৫৮-(১৭১/...) মুহাম্মাদ ইবনু আবদুল আ'লা কায়সী (রহঃ) ..... সাঈদ ইবনু জুবায়র (রাযিঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) কে বলা হলো, নাওফ দাবী করে যে, মূসা (আঃ) যিনি জ্ঞান অনুসন্ধানে বেরিয়ে ছিলেন, তিনি বনী ইসরাঈলের মূসা নন। ইবনু আব্বাস (রাযিঃ) বলেন, হে সাঈদ। তুমি কি তাকে এ কথা বলতে শুনেছ? আমি বললাম, হ্যাঁ! তিনি বললেন, নাওফ মিথ্যারোপ করেছে। (ইসলামিক ফাউন্ডেশন ৫৯৪৯, ইসলামিক সেন্টার ৫৯৮৮)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6165,
			"arabicnumber": "2380.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৫৯, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৫৯-(১৭২/...) উবাই ইবনু কা'ব (রাযিঃ) আমাদের নিকট রিওয়ায়াত করেছেন যে, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, মূসা (আঃ) একদা তার গোষ্ঠীর সম্মুখে আল্লাহ তা'আলার নিআমাত এবং বালা-মুসীবাত মনে করিয়ে উপদেশ দিচ্ছিলেন। কথা প্রসঙ্গে তিনি বলে ফেললেন, দুনিয়াতে আমার তুলনায় উত্তম এবং অধিক জ্ঞানী কোন লোক আছে বলে আমার জানা নেই। আল্লাহ মূসা (আঃ) এর প্রতি ওয়াহী পাঠালেনঃ আমি জানি মূসার চাইতে উত্তম কে বা কার নিকট কল্যাণ রয়েছে। পৃথিবীতে অবশ্যই এক লোক রয়েছে যে, তোমার তুলনায় অধিক জ্ঞানী। মূসা (আঃ) বললেন, হে আমার প্রতিপালক! আমাকে তার পথ জানিয়ে দিন। তাকে বলা হলো, লবণাক্ত একটি মাছ সাথে নিয়ে যাও। এ মাছটি যেখানে হারিয়ে যাবে খানেই সে, ব্যক্তি আছে। মূসা (আঃ) এবং তার খাদিম রওনা হলেন, পরিশেষে তারা একটি বড় পাথরের নিকট পৌছলেন। সে সময় মূসা (আঃ) তার সঙ্গীকে রেখে গোপনে চলে গেলেন। তারপর মাছটি ছটফট করে পানিতে নেমে গেল এবং পানিও ছিদ্রের মতো রয়ে গেল, মাছের রাস্তায় সংমিশ্রণ হলো না। মূসা (আঃ) এর খাদিম বললেন, হ্যাঁ, আমি আল্লাহর নবীর সঙ্গে মিলিত হয়ে তাকে এ বিবরণ দিব। তারপরে তিনি ভুলে গেলেন। তারা যখন আরো সম্মুখে চলে গেলেন। তখন মূসা (আঃ) বললেন, আমার নাশতা দাও, এ সফরে তো আমরা ক্লান্ত হয়ে পড়েছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যতক্ষণ তারা এ জায়গাটি ত্যাগ করার পূর্ব মুহূর্ত পর্যন্ত তাদের ক্লান্তি আসেনি। তার সাথীর যখন স্মরণে আসলো তখন বলল, আপনি কি জানেন যখন আমরা পাথরের নিকট আশ্রয় নিয়েছিলাম, তখন আমি মাছের কথা ভুলে গেছি। আর শাইতানই আমাকে আপনার নিকট বলার কথা ভুলিয়ে দিয়েছে এবং অবাক করার মতো মাছটি সমুদ্রে তার রাস্তা করে নিয়েছে। মূসা (আঃ) বললেন, এ-ই তো ছিল আমাদের উদ্দেশ্য। সুতরাং তারা পথ অনুসরণ করে প্রত্যাবর্তন করলেন। তখন তার খাদিম মাছের জায়গাটি তাকে দেখালো। মূসা (আঃ) বললেন, এ জায়গার বর্ণনাই আমাকে দেয়া হয়েছিল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারপর মূসা (আঃ) সন্ধান করছিলেন, এমতাবস্থায় তিনি কাপড়ে ঢাকা খাযির (আঃ) কে গলদেশের উপর চীৎ হয়ে ঘুমানো দেখতে পেলেন। কিংবা অন্য বর্ণনায়, গলদেশের উপর সোজাসুজি। মূসা (আঃ) বললেন, আসসালামু 'আলাইকুম। খাযির (আঃ) মুখ থেকে কাপড় সরিয়ে বললেন, ওয়া আলাইকুমুসসালাম, তুমি কে? মূসা (আঃ) বললেন, আমি মূসা। তিনি বললেন, কোন মূসা? মূসা (আঃ) উত্তর দিলেন, বনী ইসরাঈলের মূসা। খাযির (আঃ) বললেন, তোমার এ মহান আগমন কিসের জন্য? মূসা (আঃ) বললেন, আমি এসেছি যেন আপনাকে যে জ্ঞান দান করা হয়েছে তা হতে আপনি আমায় কিছু শিক্ষা দেন। খাযির (আঃ) বললেন, আমার সাথে তুমি ধৈর্য ধরতে পারবে না। আর এমন ব্যাপারে কেমন করে তুমি ধৈর্য ধরবে, যার ইলম তোমাকে দেয়া হয়নি। এরূপ বিষয় হতে পারে যা করতে আমাকে নির্দেশ দেয়া হয়েছে, তুমি যখন তা দেখবে তখন তুমি ধৈর্য ধারণ করবে না। মূসা (আঃ) বললেন, ইনশাআল্লাহ্ আপনি আমাকে ধৈর্যশীলদের মধ্যেই পাবেন। আর আমি আপনার কোন আদেশ অমান্য করব না। খাযির (আঃ) বললেন, তুমি যদি আমার অনুগামী হও তবে আমাকে কোন ব্যাপারে জিজ্ঞেস করো না, যতক্ষণ না আমি নিজেই এ ব্যাপারে বর্ণনা করি। তারপর উভয়ই চললেন, পরিশেষে একটি নৌকায় চড়লেন। তখন খাযির (আঃ) নৌকার একাংশ ভেঙ্গে ফেললেন। মূসা (আঃ) তাকে বললেন, আপনি কি নৌকাটি ভেঙ্গে ফেললেন, নৌকারোহীদের ডুবিয়ে ফেলার জন্যে? আপনি তো বড় মারাত্মক কাজ করেছেন। খাযির (আঃ) বললেন, আমি কি তোমাকে বলিনি যে, তুমি আমার সাথে ধৈর্য ধরতে পারবে না? মূসা (আঃ) বললেন, আমি ভুলে গিয়েছি, আপনি আমাকে দোষী সাব্যস্ত করবেন না। আমার ব্যাপারটিকে আপনি কঠিন করবেন না। পুনরায় উভয়ে চলতে লাগলেন। এক স্থানে দেখতে পেলেন বালকরা খেলায় লিপ্ত। খাযির (আঃ) অবলীলাক্রমে একটি শিশুর নিকট গিয়ে তাকে হত্যা করলেন। এতে মূসা (আঃ) খুব ঘাবড়ে গিয়ে বললেন, আপনি প্রাণ বিনিময় ছাড়াই একটি নিষ্পাপ প্রাণকে হত্যা করলেন? আপনি বড়ই নৃশংস কাজ করেছেন। এমতাবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ রহমত বর্ষণ করুন আমাদের ও মূসা (আঃ) এর উপর তিনি যদি জলদি না করতেন তাহলে অবাক হওয়ার আরো মতো অনেক ঘটনা দেখতে পেতেন। তবে তিনি খাযির (আঃ) এর সম্মুখে লজ্জিত হয়ে বললেন, তারপর যদি আমি আপনাকে আর কোন কিছু জিজ্ঞেস করি তবে আপনি আমায় সাথে রাখবেন না। সত্যিই আমার ব্যাপার খুবই আপত্তিকর হয়েছে। যদি মূসা (আঃ) ধৈর্য ধরতেন তাহলে আরো বিস্ময়কর ব্যাপার দেখতে পেতেন। যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন নবীর বর্ণনা করতেন, প্রথমে নিজকে দিয়ে আরম্ভ করতেন আর বলতেন, আল্লাহ আমাদের উপর রহম করুন এবং আমার অমুক ভাইয়ের উপরও। এভাবে নিজেদের উপর আল্লাহর রহমত কামনা করতেন। অতঃপর দু'জনে চললেন এবং মন্দ লোকদের একটি লোকালয়ে গিয়ে উঠলেন। তারা লোকদের অসংখ্য জায়গায় ঘুরে তাদের নিকট খাবার চাইলেন। তারা তাদের মেহমানদারী করতে অস্বীকার করল। তারপর তারা ধ্বসে পড়ার উপক্রম একটা দেয়াল দেখতে পেলেন। খাযির (আঃ) সেটি মেরামত করে দিলেন। মূসা (আঃ) বললেন, আপনি চাইলে এর বিনিময়ে মজুরি নিতে পারতেন। খাযির (আঃ) বললেন, এখানেই আমার আর তোমার মাঝে সম্পর্কচ্ছেদ। খাযির (আঃ) মূসা (আঃ)-এর বস্ত্র ধরে বললেন, তুমি যেসব বিষয়ের উপর ধৈর্যহারা হয়ে পড়েছিলে সে সবের ঘটনা বলে দিচ্ছি। নৌকাটি ছিল কিছু গরীব লোকের যারা সমুদ্রে কাজ করত’- আয়াতের শেষ পর্যন্ত পড়লেন। তারপর যখন এটাকে দখল করতে লোক আসলো, তখন ছিদ্রযুক্ত (অচলাবস্থা) দেখে ছেড়ে দিল। অতঃপর নৌকাওয়ালারা একটা কাঠ দ্বারা নৌকাটি মেরামত করে নিলো। আর বালকটি সূচনালগ্নেই ছিল কাফির। তার মা-বাবা তাকে বড়ই আদর করত। সে বড় হলে ওদের দু’জনকেই অবাধ্যতা ও কুফুরীর দিকে নিয়ে যেত। অতএব আমি আকাঙ্ক্ষা করলাম, আল্লাহ যেন তাদেরকে এর বিনিময়ে আরো উত্তম পবিত্র স্বভাবের ও অধিক স্নেহভাজন ছেলে দান করেন। আর দেয়ালটি ছিল শহরের দু'টো ইয়াতীম বালকের’- আয়াতের শেষ পর্যন্ত। (ইসলামিক ফাউন্ডেশন ৫৯৪৯, ইসলামিক সেন্টার ৫৯৮৯)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6166,
			"arabicnumber": "2380.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৬০, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৬০-(.../...) আবদুল্লাহ ইবনু আবদুর রহমান দারিমী (রহঃ) ..... আবূ ইসহাক (রহঃ) হতে এর অবিকল হাদীস রিওয়ায়াত করেছেন। (ইসলামিক ফাউন্ডেশন ৫৯৫০, ইসলামিক সেন্টার ৫৯৯০)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6167,
			"arabicnumber": "2380.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৬১, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৬১-(১৭৪/...) আমর আন নাকিদ (রহঃ) ..... উবাই ইবনু কা'ব (রাযিঃ) হতে রিওয়ায়াত করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামلا تخذت এর স্থলে لَتَخِذْتَ عَلَيْهِ أَجْرًا এরূপও পড়েছেন (দু’টোর অর্থ একই)। (ইসলামিক ফাউন্ডেশন ৫৯৫১, ইসলামিক সেন্টার ৫৯৯১)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6168,
			"arabicnumber": "2380.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬০৬২, আন্তর্জাতিক নাম্বারঃ ২৩৮০ ৬০৬২-(১৭৪/...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) হতে বর্ণনা করেন, ইবনু আব্বাস এবং কায়স ইবনু হিসন, মূসা (আঃ) এর সঙ্গী সম্পর্কে তর্ক করলেন। ইবনু আব্বাস (রাযিঃ) বললেন, সঙ্গীটি খাযির (আঃ) ছিলেন। অতঃপর সেখানে উবাই ইবনু কা'ব (রাযিঃ) আসলেন, ইবনু আব্বাস (রাযিঃ) তাকে বললেন, হে আবূ তুফায়ল! এদিকে আসুন, আমি এবং সে তর্ক করছি— মূসা (আঃ) এর সঙ্গীর সম্বন্ধে যার নিকট তিনি গিয়েছিলেন। আপনি কি এ সম্বন্ধে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে কিছু জেনেছেন? উবাই ইবনু কা'ব (রাযিঃ) বললেন, আমি রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, মূসা (আঃ) এক সমাবেশে কিছু বলছিলেন, এমতাবস্থায় একটা লোক এসে জিজ্ঞেস করল, আপনার চেয়ে অধিক জ্ঞানী কোন লোক সম্বন্ধে কি আপনার জানা আছে? মূসা (আঃ) বললেন, না। তখন আল্লাহ ওয়াহী প্রেরণ করলেন, আমার বান্দা খাযির তোমার তুলনায় অধিক জানেন। মূসা (আঃ) খাযির (আঃ) এর সাথে দেখার করার উপায় জানতে চাইলেন। আল্লাহ তা'আলা মাছকে নমুনা হিসেবে চিহ্নিত করলেন এবং আদেশ করা হলো, যখন তুমি মাছটি হারিয়ে ফেলবে তখন ফিরবে আর তার দর্শনও পাবে। মূসা (আঃ) আল্লাহর ইচ্ছা মতো চললেন। তারপর তার সঙ্গীকে বললেন, আমাদের নাস্তা বের করো। খাদিম বলল, আপনার কি জানা আছে যে, যখন আমরা সাখরাহ্ (পাথরের নিকট) পৌঁছলাম তখন মাছের কথা ভুলে গিয়েছি; আর শাইতানই আমাদের ভুলে দেয়ার কারণ। মূসা (আঃ) বললেন, এটাই তো আমরা প্রত্যাশা করতাম। সুতরাং দু’জনেই পদাঙ্ক অনুসরণ করে ফিরলেন এবং খাযির (আঃ) কে পেলেন। পরবর্তী ঘটনা আল্লাহ তা'আলা তার গ্রন্থে বর্ণনা করেছেন। কিন্তু ইউনুস (রহঃ) এর বর্ণনায় বলা হয়েছে যে, তারা সমুদ্রগামী মাছটির নিদর্শন অনুসরণ করে ফিরলেন'। (ইসলামিক ফাউন্ডেশন ৫৯৫২, ইসলামিক সেন্টার ৫৯৯২)",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 226
			}
		}
	]
}