{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6775,
			"arabicnumber": "2665",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৬৮, আন্তর্জাতিক নাম্বারঃ ২৬৬৫ ৬৬৬৮-(১/২৬৬৫) আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কা'নাব (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিলাওয়াত করলেনঃ “তিনিই তোমার প্রতি এ কিতাবকে অবতীর্ণ করেছেন, যার কতক আয়াত সুস্পষ্ট মজবুত সাংবিধানিক; এগুলো কিতাবের মূলনীতি আর অন্যগুলো অস্পষ্ট। যাদের হৃদয়ে বক্রতা রয়েছে, শুধু তারাই ফিতনাহ এবং ভুল ব্যাখ্যার জন্য যা অস্পষ্টতার অনুকরণ করে। মূলতঃ আল্লাহ ভিন্ন অন্য কেউ এর ব্যাখ্যা জানে না; আর যারা ইলমে সুগভীর তারা বলে, আমরা এতে বিশ্বাস করি, সবই আমাদের রবের নিকট থেকে সত্য এবং বুদ্ধিমান ছাড়া আর কেউ উপদেশ গ্রহণ করে না”— (সূরা আ-লি ইমরান ৩ঃ ৭)। তিনি (আয়িশাহ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন তোমরা সেসব লোকদের দেখতে পাবে যারা অস্পষ্ট আয়াতের অর্থের অনুসরণ করে, এরাই সে সব ব্যক্তি, যাদের কথা আল্লাহ আলোচনা করেছেন, সুতরাং তোমরা তাদের থেকে সতর্ক থাক। (ইসলামিক ফাউন্ডেশন ৬৫৩৩, ইসলামিক সেন্টার ৬৫৮৫)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": "2666",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৬৯, আন্তর্জাতিক নাম্বারঃ ২৬৬৬ ৬৬৬৯-(২/২৬৬৬) আবূ কামিল, ফুযায়ল ইবনু হুসায়ন আল জাহদারী (রহঃ) ..... আবদুল্লাহ ইবনু আমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, কোন একদিন ভোরে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলাম। তিনি বলেন, একদা তিনি কুরআনের একটি আয়াতের ব্যাপারে দু' লোকের মতপার্থক্যের আওয়াজ শুনতে পেয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মাঝে আসলেন, এ অবস্থায় তার চেহারায় রাগের বহিঃপ্রকাশ হচ্ছিল। তিনি বললেন, তোমাদের পূর্ববর্তীরা একমাত্র আল্লাহর কিতাবে দ্বিমত করার কারণে ক্ষতিগ্রস্ত হয়ে গেছে। (ইসলামিক ফাউন্ডেশন ৬৫৩৪, ইসলামিক সেন্টার ৬৫৮৬)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": "2667.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭০, আন্তর্জাতিক নাম্বারঃ ২৬৬৭ ৬৬৭০-(৩/২৬৬৭) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জুনদুব ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কুরআন পাঠ করতে থাকো যতক্ষণ পর্যন্ত তোমাদের হৃদয়ে তার প্রতি আকর্ষণ থাকে। আর যখন তোমরা তাতে মতভেদ করবে তখন উঠে যাবে। (ইসলামিক ফাউন্ডেশন ৬৫৩৫, ইসলামিক সেন্টার ৬৫৮৭)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": "2667.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭১, আন্তর্জাতিক নাম্বারঃ ২৬৬৭ ৬৬৭১-(৪/...) ইসহাক ইবনু মানসূর (রহঃ) ..... জুনদুব ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যতক্ষণ পর্যন্ত তোমাদের মনের মধ্যে আকর্ষণ থাকে ততক্ষণ কুরআন পাঠ করো। আর যখন (মন) বিকর্ষিত হয়ে পড়ে তখন উঠে যাবে। (ইসলামিক ফাউন্ডেশন ৬৫৩৬, ইসলামিক সেন্টার ৬৫৮৮)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": "2667.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭২, আন্তর্জাতিক নাম্বারঃ ২৬৬৭ ৬৬৭২-(…/...) আহমাদ ইবনু সাঈদ ইবনু সাখর আদ দারিমী (রহঃ) ..... আবু ইমরান (রহঃ) হতে বর্ণিত। তিনি বলেন, ছোটবেলা আমরা কুফাতে ছিলাম। তখন জুনদুব (রাযিঃ) বলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন তোমরা কুরআন পাঠ করতে থাকো ..... তাদের দু’জনের হাদীসের ন্যায়। (ইসলামিক ফাউন্ডেশন ৬৫৩৭, ইসলামিক সেন্টার ৬৫৮৯)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": "2668",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৩, আন্তর্জাতিক নাম্বারঃ ২৬৬৮ ৬৬৭৩-(৫/২৬৬৮) আবূ বাকর ইবনু আবূ শইবাহ্ (রহঃ) ...... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর নিকট সর্বাপেক্ষা মন্দ সে লোক, যে সর্বাপেক্ষা বাক-বিতণ্ডাকারী। (ইসলামিক ফাউন্ডেশন ৬৫৩৮, ইসলামিক সেন্টার ৬৫৯০)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": "2669.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৪, আন্তর্জাতিক নাম্বারঃ ২৬৬৯ ৬৬৭৪-(৬/২৬৬৯) সুওয়াইদ ইবনু সাঈদ (রহঃ) ..... আবু সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের আগের লোকের নীতি-আদৰ্শ পুরোপুরিভাবে অনুকরণ করবে, এক বিঘত এক বিঘতের সঙ্গে ও হাত হাতের সঙ্গে, এমনকি তারা যদি গোসাপের গর্তে ঢুকে থাকে তবুও তোমরা তাদের অনুকরণ করবে। আমরা আবেদন করলাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! তারা কি ইয়াহুদী ও নাসারা? তিনি বলেন, তবে আর কারা? (ইসলামিক ফাউন্ডেশন ৬৫৩৯, ইসলামিক সেন্টার ৬৫৯১)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": "2669.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৫, আন্তর্জাতিক নাম্বারঃ ২৬৬৯ ৬৬৭৫-(…/...) সাঈদ ইবনু আবূ মারইয়াম (রহঃ) ..... যায়দ ইবনু আসলাম (রহঃ) হতে আমাদের কিছু সংখ্যক সহাবা (রাযিঃ) এ সূত্রে তার হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৩৯, ইসলামিক সেন্টার ৬৫৯২)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": "2669.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৬, আন্তর্জাতিক নাম্বারঃ ২৬৬৯ ৬৬৭৬-(…/...) আবু ইসহাক ইবরাহীম ইবনু মুহাম্মদ (রহঃ) ..... আতা ইবনু ইয়াসার (রহঃ) এর সানাদে যায়দ ইবনু আসলাম (রহঃ) তার হুবহু হাদীস উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৩৯, ইসলামিক সেন্টার ৬৫৯৩)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": "2670",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৭, আন্তর্জাতিক নাম্বারঃ ২৬৭০ ৬৬৭৭-(৭/২৬৭০) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ‘আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অতিরিক্ত চাটুকারীরা ধ্বংসপ্রাপ্ত হয়ে গেছে। তিনি এ কথাটি তিনবার বলেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৪০, ইসলামিক সেন্টার ৬৫৯৪)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": "2671.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৮, আন্তর্জাতিক নাম্বারঃ ২৬৭১ ৬৬৭৮-(৮/২৬৭১) শাইবান ইবনু ফাররূখ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের নিদর্শনসমূহের অন্যতম নিদর্শন হলো ইলম উঠে যাওয়া, অজ্ঞতা সাব্যস্ত হওয়া, মদ্যপান ও যিনার প্রসার ঘটা। (ইসলামিক ফাউন্ডেশন ৬৫৪১, ইসলামিক সেন্টার ৬৫৯৫)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": "2671.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৭৯, আন্তর্জাতিক নাম্বারঃ ২৬৭১ ৬৬৭৯-(৯/...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি কি তোমাদের নিকট এমন একটি হাদীস আলোচনা করব, যা আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি এবং আমার পরে এমন কেউ তা তোমাদের নিকট উল্লেখ করবে না যিনি সরাসরি তার কাছ থেকে তা শুনতে পেয়েছে? আমি তার নিকট শুনেছি যে, কিয়ামতের নিদর্শনসমূহের অন্যতম হচ্ছে ইলম উঠিয়ে দেয়া, অজ্ঞতার বহিঃপ্রকাশ, ব্যভিচার প্রসার হবে, মদ্যপান প্রচলিত হবে, পুরুষ (-এর সংখ্যা) হ্রাস পাবে, নারীরা অবশিষ্ট থাকবে, এমনকি পঞ্চাশজন নারী একজন পুরুষের তত্ত্বাবধানে থাকবে। (ইসলামিক ফাউন্ডেশন ৬৫৪২, ইসলামিক সেন্টার ৬৫৯৬)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": "2671.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮০, আন্তর্জাতিক নাম্বারঃ ২৬৭১ ৬৬৮০-(…/...) আবু বাকর ইবনু আবূ শাইবাহ ও আবু কুরায়ব (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হুবহু হাদীস রিওয়ায়াত করেছেন। ইবনু বিশর ও আবদাহ্ (রহঃ) এর বর্ণিত হাদীসে রয়েছে, ‘তা তোমাদের নিকট আমার পরে কেউ উল্লেখ করবে না। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, ..... এরপর তিনি (আবদাহ্) তার হুবহু হাদীস উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৪৩,ইসলামিক সেন্টার ৬৫৯৭)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": "2672.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮১, আন্তর্জাতিক নাম্বারঃ ২৬৭২ ৬৬৮১-(১০/২৬৭২) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র ও আবু সাঈদ আল আশাজ্জ (রহঃ) ..... আবূ ওয়ায়িল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ ও আবু মূসা আশ’আরী (রাযিঃ) এর সাথে বসে ছিলাম। তারা উভয়ে বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের সন্নিকটকালে এমন কিছু সময় আসবে যখন ইলম তুলে নেয়া হবে। সে সময় অজ্ঞতা নেমে আসবে এবং হারজ বৃদ্ধি পাবে। হারজ মানে হত্যা। (ইসলামিক ফাউন্ডেশন ৬৫৪৪, ইসলামিক সেন্টার ৬৫৯৮)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": "2672.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮২, আন্তর্জাতিক নাম্বারঃ ২৬৭২ ৬৬৮২-(…/...) আবু বকর ইবনু নাযর ইবনু আবূ নাযর (রহঃ) ..... আবদুল্লাহ ও আবু মূসা আল আশ’আরী (রাযিঃ) থেকে বর্ণিত। উভয়ে বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমনই বলেছেন। কাসিম ইবনু যাকারিয়্যা (রহঃ) ..... শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ (রাযিঃ) ও আবু মূসা আশ’আরী (রাযিঃ) এর সাথে বসে ছিলাম। এহেন মুহুর্তে হাদীস বর্ণনা করছিলেন। তারা উভয়ে বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ..... এরপর তারা ওয়াকী ও ইবনু নুমায়র (রহঃ) এর হাদীসের হুবহু হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৬৫৪৫, ইসলামিক সেন্টার ৬৫৯৯)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": "2672.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৩, আন্তর্জাতিক নাম্বারঃ ২৬৭২ ৬৬৮৩-(…/...) আবু বাকর ইবনু আবু শাইবাহ, আবু কুরায়ব, ইবনু নুমায়র ও ইসহাক আল হানযালী (রহঃ) ..... আবূ মূসা (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৪৬, ইসলামিক সেন্টার ৬৬০০)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": "2672.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৪, আন্তর্জাতিক নাম্বারঃ ২৬৭২ ৬৬৮৪-(…/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবু ওয়ায়িল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ (রাযিঃ) ও আবু মূসা (রাযিঃ) এর সাথে বসে ছিলাম। এমন সময় তারা হাদীস বর্ণনা করছিলেন। তখন আবু মূসা (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হুবহু হাদীস বলেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৪৭, ইসলামিক সেন্টার ৬৬০১)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": "157.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৬, আন্তর্জাতিক নাম্বারঃ ১৫৭ ৬৬৮৬-(.../...) আবদুল্লাহ ইবনু আবদুর রহমান আদ দারিমী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যামানা সন্নিকটবর্তী হবে, ইলম উঠিয়ে নেয়া হবে। তারপর তার হুবহু হাদীস উল্লেখ করেন। (ইসলামিক ফাউন্ডেশন ৬৫৪৯, ইসলামিক সেন্টার ৬৬০৩)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": "157.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৭, আন্তর্জাতিক নাম্বারঃ ১৫৭ ৬৬৮৭-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবু হুরাইরাহ থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যামানা সন্নিকটবর্তী হলে ইলম তুলে নেয়া হবে। তারপর মা'মার (রহঃ) তাদের [ইউনুস ও শু’আয়ব (রহঃ)-এর] হাদীসের হুবহু বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৬৫৫০, ইসলামিক সেন্টার ৬৬০৪)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": "157.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৮, আন্তর্জাতিক নাম্বারঃ ১৫৭ ৬৬৮৮-(…/...) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ও ইবনু হুজর, ইবনু নুমায়র, আবূ কুরায়ব ও আমর আন নাকিদ, মুহাম্মদ ইবনু রাফি ও আবু তাহির (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, যুহরী হুমায়দ হতে আবূ হুরাইরাহ (রাযিঃ) এর সনদে বর্ণিত হাদীসের অবিকল। তবে সালিম, হাম্মাম ও আবু ইউনুস (রহঃ) (কৃপণতা বিস্তৃত হয়ে পড়বে) কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৫১, ইসলামিক সেন্টার ৬৬০৫)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": "2673.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৮৯, আন্তর্জাতিক নাম্বারঃ ২৬৭৩ ৬৬৮৯-(১৩/২৬৭৩) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... উরওয়াহ্ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) কে বলতে শুনেছি। তিনি বলেন যে, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি। তিনি বলেছেন, নিশ্চয় আল্লাহ তা’আলা মানুষের হৃদয় হতে ইলম ছিনিয়ে নেবেন না। তবে তিনি ‘আলিম সম্প্রদায়কে কবয করে ইলম উঠিয়ে নিবেন। এমনকি যখন একজন আলিমও থাকবে না তখন মানুষেরা মূৰ্খ মানুষদেরকে নেতা বানিয়ে নিবে। মানুষ তাদের নিকট সমাধান চাইবে, এরপর তারা না জেনে ফাতাওয়া প্রদান করবে। ফলে তারা নিজেরাও গোমরাহ হবে এবং মানুষদেরও গুমরাহ করবে। (ইসলামিক ফাউন্ডেশন ৬৫৫২, ইসলামিক সেন্টার ৬৬০৬)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": "2673.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯০, আন্তর্জাতিক নাম্বারঃ ২৬৭৩ ৬৬৯০-(…/...) আবু রাবী আল আতাকী’, ইয়াহইয়া ইবনু ইয়াহইয়া, আবু বাকর ইবনু আবু শাইবাহ, যুহায়র ইবনু হারব, আবু কুরায়ব, ইবনু আবূ উমার, মুহাম্মাদ ইবনু হাতিম, আবু বাকর ইবনু নাফি’ ও ‘আবদ ইবনু হুমায়দ (রহঃ) ..... আবদুল্লাহ ইবনু আমর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে জারীর এর হাদীসের অবিকল বর্ণিত। হিশাম ইবনু উরওয়াহ (রহঃ) উমর ইবনু আলী (রহঃ) এর বর্ণিত হাদীসে এ অংশটুকু বর্ধিত বলেছেন- এরপর আমি (ইবনু উরওয়াহ্) এক বৎসরের মাথায় (পরে) ‘আবদুল্লাহ ইবনু আমর (রাযিঃ) এর সাথে সাক্ষাৎ করলাম এবং তাকে প্রশ্ন করলাম; এরপর তিনি হাদীসটি যেমন বর্ণনা দিয়েছিলেন, আমাকে হুবহু হাদীসটি বর্ণনা করলেন। তিনি বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি। (ইসলামিক ফাউন্ডেশন ৬৫৫৩, ইসলামিক সেন্টার ৬৬০৭)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": "2673.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯১, আন্তর্জাতিক নাম্বারঃ ২৬৭৩ ৬৬৯১-(.../...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ‘আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) এর সানাদে নবী হতে সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হিশাম ইবনু উরওয়াহ বর্ণিত হাদীসের অনুরূপ। (ইসলামিক ফাউন্ডেশন ৬৫৫৪, ইসলামিক সেন্টার ৬৬০৮)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": "2673.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯২, আন্তর্জাতিক নাম্বারঃ ২৬৭৩ ৬৬৯২-(১৪/…) হারমালাহ্ ইবনু ইয়াহইয়া আত তুজীবী (রহঃ) ..... উরওয়াহ ইবনু যুবায়র (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমাকে আয়িশাহ (রাযিঃ) বললেন, হে আমার বোনের ছেলে! আমার নিকট সংবাদ এসেছে যে, ‘আবদুল্লাহ ইবনু আমর (রাযিঃ) আমাদের সাথে হাজ্জব্রত পালনে এসেছেন। তার সাথে তুমি দেখা করে প্রশ্ন করো। কেননা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে তিনি বহু জ্ঞানার্জন করেছেন। তিনি (উরওয়াহ্) বলেন, এমন সময় আমি তার সাথে দেখা করে এমন বহু ব্যাপারে প্রশ্ন করলাম, যা তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উল্লেখ করেছেন। উরওয়াহ (রহঃ) বলেন, যা তিনি আলোচনা করেছিলেন সে সকল বিষয়ের মধ্যে একটি ছিল এই যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা’আলা মানুষের নিকট থেকে ইলম কেড়ে নিবেন না। তবে তিনি আলিমদের উঠিয়ে নিয়ে যাবেন। সুতরাং তাদের সাথে ইলমও উঠে যাবে। আর মানুষের মধ্যে অবশিষ্ট থাকবে মূর্খ নেতাকর্মীরা। তারা না জেনে-শুনে মানুষদের ফাতাওয়া দিবে। ফলে তারা পথভ্রষ্ট হবে এবং তাদেরও পথভ্রষ্ট করবে। উরওয়াহ্ (রহঃ) বলেন, আমি যখন এ হাদীসটি আয়িশাহ (রাযিঃ)-এর নিকট বর্ণনা করলাম তখন তিনি হাদীসটিকে গুরুত্বপূর্ণ মনে করলেন এবং বিরক্তিভাব প্রকাশ করে বললেন, তিনি [আবদুল্লাহ ইবনু ‘আমর (রাযিঃ)] কি তোমার কাছে হাদীস বর্ণনা করেছেন যে, তিনি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এটি বলতে শুনেছেন? উরওয়াহ্ (রহঃ) বললেন, এমনকি পরবর্তী বৎসর হজ্জের সময় এসে গেলো তখন তিনি তাকে [উরওয়াহ (রহঃ) কে] বললেন, অবশ্যই ইবনু আমর (রাযিঃ) (হাজ্জে) গমন করেছেন। তার সাথে দেখা করো। তারপর তাকে তুমি সে হাদীসের ব্যাপারে প্রশ্ন করো ইলম সম্পর্কে তিনি তোমার নিকট আলোচনা করেছেন। উরওয়াহ (রহঃ) বললেন, তখন আমি তার সাথে সাক্ষাৎ করে তাকে প্রশ্ন করলাম। তখন তিনি তা আমার নিকটে আলোচনা করলেন, যেমন তিনি প্রথমবার আমার কাছে বর্ণনা করেছিলেন। ‘উরওয়াহ বলেন, যখন আমি তাকে [আয়িশাহ (রাযিঃ) কে] বিষয়টি অবহিত করলাম তখন তিনি বললেন, আমি আবদুল্লাহ ইবনু আমর (রাযিঃ) কে সত্য কথা বলে এমনটি মনে করি এবং তিনি এ হাদীসে বিন্দুমাত্র বেশি কিংবা কম করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৫৫, ইসলামিক সেন্টার ৬৬০৯)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": "1017.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৩, আন্তর্জাতিক নাম্বারঃ ১০১৭ ৬৬৯৩-(১৫/১০১৭) যুহায়র ইবনু হারব (রহঃ) ..... জারীর ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, কিছু সংখ্যক যাযাবর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে আসলো। তাদের পরনে পশমী পোশাক ছিল। তিনি তাদের নিকৃষ্ট অবস্থা দেখলেন। তাদের অভাবে আক্রমণ করেছে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মানুষদের (তাদেরকে) দান-সদাকাহ করার জন্যে উৎসাহিত করলেন। মানুষেরা দান-সদাকাহ দিতে ইতস্তত করছিল। এমনকি এর প্রতিক্রিয়া তার চেহারায় দেখা গেল। রাবী বলেন, তারপর একজন আনসারী লোক একটি রূপার (টাকার) ব্যাগ নিয়ে আসলেন। তারপর অন্যজন আসলেন। তারপর পর্যায়ক্রমে আসতে লাগলেন, পরিশেষে তার মুখে আনন্দের চিহ্ন দেখা গেল। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যে লোক ইসলামে কোন সুন্নাত চালু করলো এবং পরবর্তীকালে সে অনুসারে ‘আমল করা হলো তাহলে আমলকারীর প্রতিদানের সমান প্রতিদান তার জন্য লিখিত হবে। এতে তাদের প্রতিদানে কোন ঘাটতি হবে না, আর যে লোক ইসলামে কোন অশুভ নীতি চালু করলো এবং তারপরে সে অনুযায়ী ‘আমল করা হলো তাহলে ঐ \"আমলকারীর খারাপ প্রতিদানের সমান গুনাহ তার জন্য লিখিত হবে। এতে তাদের পাপ সামান্য ঘাটতি হবে না। (ইসলামিক ফাউন্ডেশন ৬৫৫৬, ইসলামিক সেন্টার ৬৬১০)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": "1017.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৪, আন্তর্জাতিক নাম্বারঃ ১০১৭ ৬৬৯৪-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবু বাকর ইবনু আবূ শাইবাহ ও আবূ কুরায়ব (রহঃ) ..... জারীর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবাহ দিলেন এবং মানুষদেরকে দান করার জন্য উৎসাহ প্রদান করলেন। এরপর জারীর বর্ণিত হাদীসের হুবহু বর্ণনানুযায়ী। (ইসলামিক ফাউন্ডেশন ৬৫৫৭, ইসলামিক সেন্টার ৬৬১১)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": "1017.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৫, আন্তর্জাতিক নাম্বারঃ ১০১৭ ৬৬৯৫-(…/...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... জারীর ইবনু আবদুল্লাহ (রাযিঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক কোন ভাল কর্মের প্রবর্তন করে না, যা পরবর্তীকালে কাজে পরিণত করা হয়। তারপর তিনি সম্পূর্ণ হাদীসটি বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৬৫৫৮, ইসলামিক সেন্টার ৬৬১২)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": "1017.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৬, আন্তর্জাতিক নাম্বারঃ ১০১৭ ৬৬৯৬-(.../...) উবাইদুল্লাহ ইবনু উমার আল কাওয়ারীরী, আবূ কামিল ও মুহাম্মাদ ইবনু আবদুল মালিক আল উমাবী ..... জারীর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। মুহাম্মাদ ইবনুল মুসান্না, আবূ বাকর ইবনু আবু শাইবাহ ও উবাইদুল্লাহ ইবনু মু’আয (রহঃ) ..... জারীর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৫৯, ইসলামিক সেন্টার ৬৬১৩)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": "2674",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৭, আন্তর্জাতিক নাম্বারঃ ২৬৭৪ ৬৬৯৭-(১৬/২৬৭৪) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ ও ইবনু হুজর (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক সঠিক পথের দিকে ডাকে তার জন্য সে পথের অনুসারীদের প্রতিদানের সমান প্রতিদান রয়েছে। এতে তাদের প্রতিদান হতে সামান্য ঘাটতি হবে না। আর যে লোক বিভ্রান্তির দিকে ডাকে তার উপর সে রাস্তার অনুসারীদের পাপের অনুরূপ পাপ বর্তাবে। এতে তাদের পাপরাশি সামান্য হালকা হবে না। (ইসলামিক ফাউন্ডেশন ৬৫৬০, ইসলামিক সেন্টার ৬৬১৪)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 30
			}
		}
	]
}