{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6805,
			"arabicnumber": "2675.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৮, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৬৯৮-(১/২৬৭৫) কুতাইবাহ ইবনু সাঈদ ও যুহায়র ইবনু হারব (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ জাল্লা শানুহু বলেন, আমি বান্দার ধারণা অনুযায়ী নিকটে আছি। যখন সে আমার যিকর (স্মরণ) করে সে সময় আমি তার সাথে থাকি। বান্দা আমাকে একাকী স্মরণ করলে আমিও তাকে একাকী স্মরণ করি। আর যদি সে আমাকে কোন সভায় আমার কথা স্মরণ করে তাহলে আমি তাকে তার চেয়ে উত্তম সভায় স্মরণ করি। যদি সে আমার দিকে এক বিঘত অগ্রসর হয় তাহলে আমি তার দিকে এক হাত এগিয়ে আসি। যদি সে আমার দিকে হেঁটে আসে আমি তার দিকে দৌড়িয়ে আসি। (ইসলামিক ফাউন্ডেশন ৬৫৬১, ইসলামিক সেন্টার ৬৬১৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": "2675.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৬৯৯, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৬৯৯-(…/...) আবু বাকর ইবনু আবু শাইবাহ ও আবু কুরায়ব (রহঃ) ..... আ'মাশ (রহঃ) হতে এ সূত্রে অবিকল বর্ণনা করেছেন। 'যদি সে আমার দিকে এক হাত এগিয়ে আসে তাহলে আমি তার দিকে এক গজ অগ্রসর হই' তিনি এ কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৬২, ইসলামিক সেন্টার ৬৬১৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": "2675.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০০, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৭০০-(৩/...) মুহাম্মাদ ইবনু রাফি’ (রহঃ) ..... হাম্মাম ইবনু মুনাব্বিহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, এগুলো আমাদের নিকট রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আবু হুরাইরাহ (রাযিঃ) হাদীস বর্ণনা করেছেন। তারপর তিনি কিছু হাদীস উল্লেখ করেন। তন্মধ্যে একটি হাদীস এই, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা’আলা বলেন, যখন কোন বান্দা আমার দিকে এক বিঘত অগ্রসর হয় তখন আমি তার পানে এক হাত অগ্রসর হই। আর যখন সে একহাত অগ্রসর হয় আমি তখন একগজ অগ্রসর হই। যখন সে দু’হাত অগ্রসর হয় তখন আমি তার কাছে অতি তাড়াতাড়ি আসি। (ইসলামিক ফাউন্ডেশন ৬৫৬৩, ইসলামিক সেন্টার ৬৬১৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": "2676",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০১, আন্তর্জাতিক নাম্বারঃ ২৬৭৬ ৬৭০১-(৪/২৬৭৬) উমাইয়্যাহ ইবনু বিসতাম আল আইশী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার পথে চলতে থাকেন। অতঃপর ‘জুমদান’ নামে একটি পর্বতের কাছে গেলেন। এরপর তিনি বললেন, তোমরা এ জুমদান পর্বতে সফর করো। মুফার্‌রিদগণ অগ্রগামী হয়েছে। মানুষেরা প্রশ্ন করল, মুফার্‌রিদ কারা! হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম? তিনি বললেন, বেশি বেশি আল্লাহর যিকরে নিয়োজিত পুরুষ ও নারী। (ইসলামিক ফাউন্ডেশন ৬৫৬৪, ইসলামিক সেন্টার ৬৬১৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": "2677.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০২, আন্তর্জাতিক নাম্বারঃ ২৬৭৭ ৬৭০২-(৫/২৬৭৭) আমর আন নাকিদ, যুহায়র ইবনু হারব ও ইবনু আবু উমর (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আল্লাহ তা’আলার নিরানব্বইটি নাম রয়েছে। যে লোক এ নামগুলো সংরক্ষণ করবে সে জান্নাতে প্রবেশ করবে। নিশ্চয়ই আল্লাহ তা’আলা বেজোড়। তিনি বেজোড় ভালবাসেন। ইবনু আবু উমর (রহঃ) এর বর্ণনায়مَنْ حَفِظَهَا (সংরক্ষণ করে) এর স্থলে مَنْ أَحْصَاهَا (যে তা আয়ত্ত করে) বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন ৬৫৬৫, ইসলামিক সেন্টার ৬৬১৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": "2677.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৩, আন্তর্জাতিক নাম্বারঃ ২৬৭৭ ৬৭০৩-(৬/...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেছেন, অবশ্যই আল্লাহ তা’আলার নিরানব্বইটি নাম অর্থাৎ- এক কমে একশটি নাম রয়েছে। যে লোক তা আয়ত্ত করবে সে জান্নাতে গমন করবে। হাম্মাম (রহঃ) আবু হুরাইরাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এটুকু বাড়িয়ে বলেছেন যে, তিনি বেজোড় এবং তিনি বেজোড় পছন্দ করেন। (ইসলামিক ফাউন্ডেশন ৬৫৬৬, ইসলামিক সেন্টার ৬৬২০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": "2678",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৪, আন্তর্জাতিক নাম্বারঃ ২৬৭৮ ৬৭০৪-(৭/২৬৭৮) আবু বাকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) …. আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন দুআ করে সে যেন দৃঢ়তা প্রকাশের সাথে দুআ করে। আর সে যেন না বলে, “হে আল্লাহ! যদি তুমি ইচ্ছা কর তবে আমাকে দান কর”। কেননা মহান ও সর্বশক্তিমান আল্লাহর জন্য কোন বাধ্যকারী নেই। (ইসলামিক ফাউন্ডেশন ৬৫৬৭, ইসলামিক সেন্টার ৬৬২১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": "2679.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৫, আন্তর্জাতিক নাম্বারঃ ২৬৭৯ ৬৭০৫-(৮/২৬৭৯) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ও ইবনু হুজর (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ যখন দুআ করে তখন সে যেন না বলে اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ (হে আল্লাহ! আপনি যদি চান আমাকে মাফ করুন)। কিন্তু সে যেন দৃঢ়তার সাথে দুআ করে। সে যেন আগ্রহ নিয়ে দুআ করে। কেননা আল্লাহ তা’আলা তাকে যা দান করেন তা আল্লাহ তা’আলার নিকট তেমন কোন বিশাল জিনিস নয়। (ইসলামিক ফাউন্ডেশন ৬৫৬৮, ইসলামিক সেন্টার ৬৬২২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": "2679.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৬, আন্তর্জাতিক নাম্বারঃ ২৬৭৯ ৬৭০৬-(৯/...) ইসহাক ইবনু মূসা আল আনসারী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ যেন কখনো এ কথা না বলে যে, \"হে আল্লাহ! আপনি যদি চান আমাকে মাফ করুন, হে আল্লাহ! আপনি যদি চান আমার প্রতি রহমত করুন।\" সে যেন অবশ্যই দৃঢ়তার সাথে দুআ প্রার্থনা করে। কেননা, আল্লাহ তা’আলা মহান কারিগর, তিনি যা চান তাই করেন। তার উপর বাধ্যবাধকতা করার কেউ নেই। (ইসলামিক ফাউন্ডেশন ৬৫৬৯, ইসলামিক সেন্টার ৬৬২৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": "2680.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৭, আন্তর্জাতিক নাম্বারঃ ২৬৮০ ৬৭০৭-(১০/২৬৮০) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ যেন বিপদে পড়ার কারণে মৃত্যু আকাঙ্খা না করে। তবে মৃত্যু তার কামনা হয় তাহলে সে যেন বলে- \"হে আল্লাহ! আপনি আমাকে জীবিত রাখুন যতক্ষণ পর্যন্ত আমার হায়াত আমার জন্য কল্যাণকর হয়। আর যদি আমার জন্য মৃত্যু কল্যাণকর হয়, তবে আমাকে মৃত্যু দিয়ে দিন।\" (ইসলামিক ফাউন্ডেশন ৬৫৭০, ইসলামিক সেন্টার ৬৬২৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6815,
			"arabicnumber": "2680.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৮, আন্তর্জাতিক নাম্বারঃ ২৬৮০ ৬৭০৮-(.../...) ইবনু আবু খালাফ ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু হাদীস বর্ণনা করেছেন। তাছাড়া তিনি لِضُرٍّ نَزَلَ بِهِ (তার উপর আপতিত বিপদের কারণে) এর স্থলে مِنْ ضُرٍّ أَصَابَهُ (যে বিপদ তার উপর পতিত হয়েছে) বলেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৭১, ইসলামিক সেন্টার ৬৬২৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": "2680.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭০৯, আন্তর্জাতিক নাম্বারঃ ২৬৮০ ৬৭০৯-(১১/...) হামিদ ইবনু উমর (রহঃ) ..... নাযর ইবনু আনাস (রাযিঃ) থেকে বর্ণিত। আনাস তখন জীবিত ছিলেন। তিনি (নাযর) বলেন, আনাস (রাযিঃ) বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যদি না বলতেন, \"তোমাদের মধ্যে কেউ কখনো মৃত্যুর আশা করবে না\"। তাহলে অবশ্যই আমি মৃত্যু কামনা করতাম। (ইসলামিক ফাউন্ডেশন ৬৫৭২,ইসলামিক সেন্টার ৬৬২৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": "2681.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১০, আন্তর্জাতিক নাম্বারঃ ২৬৮১ ৬৭১০-(১২/২৬৮১) আবু বকর ইবনু আবু শাইবাহ্ (রহঃ) ..... কায়স ইবনু আবূ হযিম (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমরা খাব্বাব (রাযিঃ) এর নিকটে প্রবেশ করলাম। তিনি তার উদরে সাতবার লোহা গরম করে সেক দিয়েছিলেন। সে সময় তিনি বললেন, যদি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মৃত্যু কামনা করে দু’আ করতে বারণ না করতেন তাহলে অবশ্যই আমি মৃত্যুর জন্য দু’আ করতাম। (ইসলামিক ফাউন্ডেশন ৬৫৭৩, ইসলামিক সেন্টার ৬৬২৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": "2681.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১১, আন্তর্জাতিক নাম্বারঃ ২৬৮১ ৬৭১১-(.../...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... অপর সানাদে ইবনু নুমায়র, উবাইদুল্লাহ ইবনু মুআয ও ইয়াহইয়া ইবনু হাবীব ও মুহাম্মাদ ইবনু রাফি (রহঃ) ইসমাঈল (রহঃ) থেকে এ সূত্রে অবিকল হাদীস আলোচনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৭৪, ইসলামিক সেন্টার ৬৬২৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": "2682",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১২, আন্তর্জাতিক নাম্বারঃ ২৬৮২ ৬৭১২-(১৩/২৬৮২) মুহাম্মাদ ইবনু রাফি’ (রহঃ) ..... হাম্মাম ইবনু মুনব্বিহ (রহঃ) থেকে বর্ণিত। তিনি আবু হুরাইরাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট যা বর্ণনা করেছেন, অতঃপর তিনি কয়েকটি হাদীস বর্ণনা করলেন। তার অন্যতম একটি এই যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন মৃত্যু কামনা না করে এবং মৃত্যু আসার আগে যেন মৃত্যুর জন্য দুআ না করে। কেননা তোমাদের মধ্যে কেউ মারা গেলে তার আমল বন্ধ হয়ে যায়। আর মুমিন লোকের বয়স তার কল্যাণই বাড়িয়ে থাকে। (ইসলামিক ফাউন্ডেশন ৬৫৭৫, ইসলামিক সেন্টার ৬৬২৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": "2683.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৩, আন্তর্জাতিক নাম্বারঃ ২৬৮৩ ৬৭১৩-(১৪/২৬৮৩) হাদ্দাব ইবনু খালিদ (রহঃ) .... উবাদাহ্ ইবনু সামিত (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহর সাক্ষাৎ ভালোবাসেন আল্লাহ তার সাক্ষাৎ ভালোবাসেন। আর যে লোক আল্লাহর সাক্ষাৎ ভালোবাসেন না আল্লাহও তার সাক্ষাৎ ভালোবাসেন না। (ইসলামিক ফাউন্ডেশন ৬৫৭৬, ইসলামিক সেন্টার ৬৬৩০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": "2683.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৪, আন্তর্জাতিক নাম্বারঃ ২৬৮৩ ৬৭১৪-(.../…) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... উবাদাহ ইবনু সামিত (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৭৭, ইসলামিক সেন্টার ৬৬৩১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": "2684.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৫, আন্তর্জাতিক নাম্বারঃ ২৬৮৪ ৬৭১৫-(১৫/২৬৮৪) মুহাম্মাদ ইবনু আবদুল্লাহ আর রুযয়ী (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আল্লাহর সাক্ষাৎ ভালোবাসেন আল্লাহও তার সাক্ষাৎ ভালোবাসেন। আর যে লোক আল্লাহর সাক্ষাৎ অপছন্দ করেন তো আল্লাহও তার সাক্ষাৎ অপছন্দ করেন। তখন আমি বললাম, হে আল্লহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! এটা কি মরণকে অপছন্দ করা আমরা সবাই তো তা অপছন্দ করি? তিনি বলেন, বিষয়টি এরূপ নয়। তবে যখন একজন মুমিনকে আল্লাহর রহমত, তার রিযামন্দির ও জান্নাতের সুসংবাদ দেয়া হয় তখন সে আল্লাহর সাক্ষাৎ ভালোবাসেন এবং আল্লাহও তার সাক্ষাৎ ভালোবাসেন। আর যখন কাফিরকে আল্লাহর আযাব ও তার অসন্তুষ্টির সংবাদ দেয়া হয় তখন সে আল্লাহর সাক্ষাৎ ভালোবাসেন না এবং আল্লাহও তার সাক্ষাৎ ভালোবাসেন না। (ইসলামিক ফাউন্ডেশন ৬৫৭৮, ইসলামিক সেন্টার ৬৬৩২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": "2684.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৬, আন্তর্জাতিক নাম্বারঃ ২৬৮৪ ৬৭১৬-(.../...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... কাতাদাহ্ (রহঃ) থেকে এ সূত্রে হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৭৯, ইসলামিক সেন্টার ৬৬৩৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": "2684.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৭, আন্তর্জাতিক নাম্বারঃ ২৬৮৪ ৬৭১৭-(১৬/...) আবু বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... ‘আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহর সাক্ষাৎ ভালোবাসেন আল্লাহও তার সাক্ষাৎ ভালোবাসেন। তার যে লোক আল্লাহর সাক্ষাৎ ভালোবাসেন না আল্লাহও তার সাক্ষাৎ ভালোবাসেন না। আর মৃত্যু আল্লাহর সাথে সাক্ষাতের পূর্বে (সংঘটিত হয়)। (ইসলামিক ফাউন্ডেশন ৬৫৮০, ইসলামিক সেন্টার ৬৬৩৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": "2684.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৮, আন্তর্জাতিক নাম্বারঃ ২৬৮৪ ৬৭১৮-(…/…) ইসহাক ইবনু ইবরাহীম (রহঃ) ... শুরায়হ ইবনু হানী (রাযিঃ) হতে বর্ণিত। ‘আয়িশাহ (রাযিঃ) তাকে অবহিত করেছেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হাদীসের হুবহু বলেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৮১, ইসলামিক সেন্টার ৬৬৩৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6826,
			"arabicnumber": "2685.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭১৯, আন্তর্জাতিক নাম্বারঃ ২৬৮৫ ৬৭১৯-(১৭/২৬৮৫) সাঈদ ইবনু আমর আল আশ’আসী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহর সাথে সাক্ষাৎ ভালোবাসেন আল্লাহ তার সাক্ষাৎ ভালোবাসেন। আর যে লোক আল্লাহর সাথে সাক্ষাৎ ভালোবাসেন না আল্লাহও তার সাক্ষাৎ ভালোবাসেন না। তিনি (শুরায়হ) বলেন, অতঃপর আমি আয়িশাহ (রাযিঃ) এর নিকট আসলাম এবং বললাম, হে মু’মিনদের জননী! আমি আবু হুরাইরাহ (রাযিঃ) কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একটি হাদীস বর্ণনা করতে শুনেছি। যদি বিষয়টি এমন হয় তাহলে আমরা ক্ষতিগ্রস্ত হয়েছি। তখন তিনি [‘আয়িশাহ্ (রাযিঃ)] বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা অনুযায়ী যে লোক ক্ষতিগ্রস্ত হয়েছে, সে প্রকৃতভাবেই ক্ষতিগ্রস্ত হয়েছে। বিষয়টি কী? তিনি (রাবী) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহর সাক্ষাৎ পছন্দ করে আল্লাহ তার সাক্ষাৎ পছন্দ করেন। আর যে ব্যক্তি আল্লাহর সাক্ষাৎ ভালোবাসে না আল্লাহও তার সাক্ষাৎ ভালোবাসেন না আর আমাদের মধ্যে এমন কেউ নেই, যে মৃত্যুকে অপছন্দ করে না। তখন তিনি (আয়িশাহ (রাযিঃ) বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথাই বলেছেন। তবে তুমি যা বুঝেছ বিষয়টি ঠিক তা নয়। মূলতঃ যখন অপলক দৃষ্টিতে তাকাবে, শ্বাস বুকে থমকে যাবে, শরীরের পশম খাড়া হয়ে যাবে এবং আঙ্গুলগুলো খিচে যাবে ঐ সময় যে লোক আল্লাহর সাক্ষাৎ ভালোবাসে আল্লাহও তার সাক্ষাৎ ভালোবাসেন এবং সে সময় যে আল্লাহর সাক্ষাৎ পছন্দ করবে না আল্লাহও তার সাক্ষাৎ পছন্দ করবেন না। (ইসলামিক ফাউন্ডেশন ৬৫৮২, ইসলামিক সেন্টার ৬৬৩৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6827,
			"arabicnumber": "2685.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২০, আন্তর্জাতিক নাম্বারঃ ২৬৮৫ ৬৭২০-(…/...) ইসহাক ইবনু ইবরাহীম আল হানযালী (রহঃ) ..... মুতাররিফ (রহঃ) এর সূত্রে আবসার (রহঃ) এর বর্ণিত হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৮৩, ইসলামিক সেন্টার ৬৬৩৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": "2686",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২১, আন্তর্জাতিক নাম্বারঃ ২৬৮৬ ৬৭২১-(১৮/২৬৮৬) আবু বকর ইবনু আবূ শাইবাহ, আবু আমির আল আশ’আরী ও আবু কুরায়ব (রহঃ) ...... আবু মূসা (রাযিঃ) সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেন, যে লোক আল্লাহর সাক্ষাৎ পছন্দ করে আল্লাহ তার সাক্ষাৎ পছন্দ করেন। আর যে লোক আল্লাহর সাথে সাক্ষাৎ পছন্দ করে না আল্লাহও তার সাথে সাক্ষাৎ পছন্দ করেন না। (ইসলামিক ফাউন্ডেশন ৬৫৮৪, ইসলামিক সেন্টার ৬৬৩৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": "2675.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২২, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৭২২-(১৯/২৬৭৫) আবূ কুরায়ব, মুহাম্মাদ ইবনুল আলা (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা’আলা বলেছেন, আমার বান্দার ধারণা অনুযায়ী আমি আছি। আর যখন সে আমাকে ডাকে আমি তার ডাকে সাড়া দেই। (ইসলামিক ফাউন্ডেশন ৬৫৮৫, ইসলামিক সেন্টার ৬৬৩৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": "2675.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৩, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৭২৩-(২০/...) মুহাম্মাদ ইবনু বাশশার ইবনু উসমান আল আবদী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, আল্লাহ জাল্লা শানুহু বলেন, যখন আমার বান্দা আমার প্রতি এক বিঘত এগিয়ে আসে তখন আমি তার প্রতি এক হাত এগিয়ে আসি। আর যখন সে আমার প্রতি এক হাত অগ্রসর হয় তখন আমি তার প্রতি এক গজ অগ্রসর হই। আর যখন সে আমার প্রতি হেঁটে আসে তখন আমি তার প্রতি দৌড়ে আসি। (ইসলামিক ফাউন্ডেশন ৬৫৮৬, ইসলামিক সেন্টার ৬৬৩৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6831,
			"arabicnumber": "2675.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৪, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৭২৪-(…/...) মুহাম্মদ ইবনু আবদুল আ’লা আল কায়সী (রহঃ) ..... মু’তামির (রহঃ) তার পিতার সানাদে এ সূত্রে অবিকল হাদীস বর্ণনা করেন। তবে তিনি তার বর্ণনায় إِذَا أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً (যখন সে পায়ে হেঁটে আসে তখন আমি তার দিকে দৌড়ে আসি) উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৮৭, ইসলামিক সেন্টার ৬৬৩৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": "2675.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৫, আন্তর্জাতিক নাম্বারঃ ২৬৭৫ ৬৭২৫-(২১/...) আবূ বাকর ইবনু আবূ শাইবাহ ও আবু কুরায়ব (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ জাল্লা শানুহ ইরশাদ করেনঃ আমি আমার বান্দার নিকট তার ধারণা অনুযায়ী থাকি। যখন সে আমার স্মরণ করে তখন আমি তার সাথী হয়ে যাই। যখন সে একাকী আমার স্মরণ করে তখন আমি একাকী তাকে স্মরণ করি। যখন সে কোন সভায় আমার স্মরণ করে তখন আমি তাকে তার চেয়েও উত্তম সভায় স্মরণ করি। যদি সে আমার প্রতি এক বিঘত অগ্রসর হয় আমি তার দিকে এক হাত এগিয়ে আসি। যদি সে আমার দিকে এক হাত অগ্রসর হয় তাহলে আমি তার দিকে এক গজ (দু’হাত) অগ্রসর হই। যদি সে আমার প্রতি পায়ে হেঁটে আসে আমি তার প্রতি দৌড়ে আসি। (ইসলামিক ফাউন্ডেশন ৬৫৮৮, ইসলামিক সেন্টার ৬৬৪০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": "2687.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৬, আন্তর্জাতিক নাম্বারঃ ২৬৮৭ ৬৭২৬-(২২/২৬৮৭) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ যার (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ জাল্লা শানুহু ইরশাদ করেন, যে লোক একটি নেক কাজ করবে তার জন্যে রয়েছে দশগুণ প্রতিদান; আর আমি তাকে আরও বৃদ্ধি করে দিব। আর যে লোক একটি খারাপ কর্ম করবে তার প্রতিদান সে কর্মের সমান অথবা আমি তাকে মাফ করে দিব। যে লোক আমার প্রতি এক বিঘত এগিয়ে আসে আমি তার প্রতি এক হাত অগ্রসর হই। আর যে লোক আমার প্রতি এক হাত এগিয়ে আসে আমি তার দিকে দু' হাত (এক গজ) অগ্রসর হই। যে লোক আমার নিকট পায়ে হেঁটে আসে আমি তার প্রতি দৌড়িয়ে আসি। যে লোক আমার সাথে কাউকে কোন বিষয়ে অংশীদার স্থাপন ব্যতীত পৃথিবী তুল্য গুনাহ নিয়েও আমার সাথে সাক্ষাৎ করে তাহলে আমি তার সাথে অনুরূপ পৃথিবী তুল্য মার্জনা নিয়ে সাক্ষাৎ করি। ইবরাহীম বলেন, হাসান ইবনু বিশর হাদীসটি ওয়াকী সানাদে অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৮৯, ইসলামিক সেন্টার ৬৬৪১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": "2687.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৭, আন্তর্জাতিক নাম্বারঃ ২৬৮৭ ৬৭২৭-(.../...) আবু কুরায়ব (রহঃ) ..... আমাশ (রহঃ) এর সানাদে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। তবে পার্থক্য এই যে, তিনি বলেছেন, তার জন্যে রয়েছে দশগুণ প্রতিদান কিংবা আমি আরও বৃদ্ধি করে দিব। (ইসলামিক ফাউন্ডেশন ৬৫৯০, ইসলামিক সেন্টার ৬৬৪২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6835,
			"arabicnumber": "2688.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৮, আন্তর্জাতিক নাম্বারঃ ২৬৮৮ ৬৭২৮-(২৩/২৬৮৮) আবুল খাত্তাব, যিয়াদ ইবনু ইয়াহইয়া আল হাস্‌সানী (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একজন মুসলিম রোগীকে সেবা করতে গেলেন। সে (অসুখে কাতর হয়ে) অত্যন্ত দুর্বল হয়ে পড়েছিল, এমনকি সে পাখির ছানার মতো হয়ে গেল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তুমি কি কোন বিষয় প্রার্থনা করছিলে অথবা আল্লাহর নিকট বিশেষভাবে কিছু চেয়েছিল? সে বলল, হ্যাঁ। আমি বলেছিলাম, হে আল্লাহ! আপনি পরকালে আমাকে যে সাজা দিবেন তা এ ইহকালেই দিয়ে দিন। সে সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সুবহানাল্লাহ! তোমার এমন সামর্থ্য নেই যে, তা বহন করবে, অথবা তুমি তা সহ্য করতে পারবে না। তুমি এমনটি বললে না কেন? হে আল্লাহ! আমাদের কল্যাণ দাও পৃথিবীতে এবং কল্যাণ দান করো পরকালেও। আর জাহান্নাম হতে আমাদেরকে রক্ষা করো। তিনি (রাবী) বলেন, তখন তিনি তার জন্য আল্লাহর নিকট দুআ করেন। আর আল্লাহ তাকে সুস্থ করে দেন। (ইসলামিক ফাউন্ডেশন ৬৫৯১, ইসলামিক সেন্টার ৬৬৪৩) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। যে ব্যক্তি জেনে শুনে প্রকৃত ইসলাম ধর্মের শিক্ষা মোতাবেক সততা ও একনিষ্ঠতার সহিত ঈমান, আমল এবং চরিত্র ঠিক রাখতে পারবে, সে ব্যক্তি দুনিয়াতে এবং পরকালে সুখ, শান্তি এবং নিরাপত্তা লাভ করতে পারবে। ২। এই দোয়টির মধ্যে সর্ব প্রকার মঙ্গল নিহিত রয়েছে; তাই মুসলিম ব্যক্তি যেন এই দোয়াটি অধিকতর পাঠ করে। এবং হারাম ও সন্দেহের বিষয়গুলি থেকে নিজেকে রক্ষা করে।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": "2688.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭২৯, আন্তর্জাতিক নাম্বারঃ ২৬৮৮ ৬৭২৯-(.../...) আসিম ইবনু আন্‌ নায্‌র আত তাইমী (রহঃ) ..... হুমায়দ (রহঃ) এর সূত্রে 'জাহান্নাম থেকে আমাদেরকে রক্ষা কর’ পর্যন্ত বর্ণনা করেছেন। এর অতিরিক্ত অংশ তিনি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৯২, ইসলামিক সেন্টার ৬৬৪৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6837,
			"arabicnumber": "2688.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩০, আন্তর্জাতিক নাম্বারঃ ২৬৮৮ ৬৭৩০-(২৪/...) যুহায়র ইবনু হারব (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সহাবাদের মধ্য থেকে এক রোগীকে সেবা করতে যান। সে ভীষণ কাতর হয়ে পাখির ন্যায় হয়ে গিয়েছিল। হুমায়দ এর হাদীসের অর্থানুযায়ী বর্ণনা করেন। কিন্তু তার হাদীসে আছে যে, \"আল্লাহর সাজা সহ্য করার মতো সামর্থ্য তোমার নেই\" আর এরপর “তিনি আল্লাহর নিকট দু’আ করলেন এবং আল্লাহ তাকে সুস্থ করলেন” কথাটি তিনি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৬৫৯৩, ইসলামিক সেন্টার ৬৬৪৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": "2688.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩১, আন্তর্জাতিক নাম্বারঃ ২৬৮৮ ৬৭৩১-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৫৯৪, ইসলামিক সেন্টার ৬৬৪৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": "2689",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩২, আন্তর্জাতিক নাম্বারঃ ২৬৮৯ ৬৭৩২-(২৫/২৬৮৯) মুহাম্মাদ ইবনু হাতিম ইবনু মাইমূন (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, আল্লাহ তা’আলার এক গ্রুপ ভ্রাম্যমান বর্ধিত ফেরেশতা রয়েছে। তারা যিকরের বৈঠকসমূহ সন্ধান করে বেড়ায়। তারা যখন কোন যিকরের বৈঠক পায় তখন সেখানে তাদের (যিকরকারীদের) সাথে বসে যায়। আর পরস্পর একে অপরকে বাহু দ্বারা ঘিরে ফেলেন। এমনকি তারা তাদের মাঝে ও নিকটতম আকাশের ফাঁকা জায়গা পূরণ করে ফেলে। আল্লাহর যিকরকারীগণ যখন পৃথক হয়ে যায় তখন তারা আকাশমণ্ডলীতে আরোহণ করে। তিনি বলেন, তখন আল্লাহ সুবহানাহু ওয়াতা’আলা তাদেরকে জিজ্ঞেস করেন, তোমরা কোথকে আসছে? অথচ তিনি তাদের ব্যাপারে সবচেয়ে বেশী অবহিত। তখন তারা বলতে থাকেন, আমরা ভূমণ্ডলে অবস্থানকারী আপনার বান্দাদের কাছ হতে আসছি, যারা আপনার তাসবীহ পড়ে, তাকবীর পড়ে, তাহলীল বলে (লা-ইলা-হা ইল্লাল্লা-হ’-এর) যিকর করে, আপনার প্রশংসা করে এবং আপনার নিকট তাদের প্রত্যাশিত বিষয় প্রার্থনা করে। তখন আল্লাহ বলেন, আমার বান্দারা আমার নিকট কি প্রার্থনা করে? তারা বলেন, তারা আপনার নিকট আপনার জান্নাত প্রত্যাশা করে। তিনি বলেন, তারা কি আমার জান্নাত প্রত্যক্ষ করেছে? তারা বলেন, না; হে আমাদের প্রভু! তিনি বলেন, তারা যদি আমার জান্নাত প্রত্যক্ষ করত তাহলে তারা কী করত? তারা বলেন, তারা আপনার নিকট আশ্রয় চায়। তিনি বলেন, কি বিষয় হতে তারা আমার নিকট আশ্রয় চায়? তারা বলেন, হে আমাদের প্রভু! আপনার জাহান্নাম হতে (মুক্তির জন্য)। তিনি বলেন, তারা কি আমার জাহান্নাম প্রত্যক্ষ করেছে? তারা বলেন, না; তারা প্রত্যক্ষ করেনি। তিনি বলেন, তারা যদি আমার জাহান্নাম প্রত্যক্ষ করত তাহলে কী করত? তারা বলেন, তারা আপনার নিকট ক্ষমা প্রার্থনা করে। তিনি বলেন, তখন আল্লাহ বলবেন, আমি তাদের মার্জনা করে দিলাম এবং তারা যা প্রার্থনা করছিল আমি তা তাদের প্রদান করলাম। আর তারা যা হতে আশ্রয় চেয়েছিল আমি তা থেকে তাদের মুক্তি দিলাম। অতঃপর তারা বলবে, হে আমাদের রব! তাদের মাঝে তো অমুক পাপী বান্দা ছিল, যে তাদের সাথে বৈঠকের নিকট দিয়ে যাওয়ার প্রাক্কালে বসেছিল। তিনি বলেন, তখন আল্লাহ বলবেন, আমি তাকেও মাফ করে দিলাম। তারা তো এমন একটি কওম যাদের সঙ্গীরা দুর্ভাগা হয় না। (ইসলামিক ফাউন্ডেশন ৬৫৯৫, ইসলামিক সেন্টার ৬৬৪৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": "2690.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩৩, আন্তর্জাতিক নাম্বারঃ ২৬৯০ ৬৭৩৩-(২৬/২৬৯০) যুহায়র ইবনু হারব (রহঃ) ..... আবদুল আযীয ইবনু সুহায়ব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, কাতাদাহ্ আনাস (রাযিঃ) কে জিজ্ঞেস করলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন দুআ সর্বাধিক পড়তেন? তিনি বললেন, তিনি যে দু’আ দ্বারা সর্বাধিক দু’আ করতেন তাতে বলতেনঃ “আল্ল-হুম্মা আ-তিনা- ফিদ্‌দুনইয়া হাসানাতাও ওয়াফিল আ-খিরতি হাসানাতাও ওয়াকিনা- ‘আযা-বান না-র”। অর্থাৎ- \"হে আল্লাহ! আমাদেরকে দুনিয়ায় কল্যাণ দান কর এবং আখিরাতে কল্যাণ দান কর। আর আমাদেরকে জাহান্নামের শাস্তি হতে বঁচিয়ে রাখো।\" রাবী বলেন, আনাস (রাযিঃ) যখনই কোন দু’আ করার সংকল্প করতেন তখন তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ন্যায়) দুআ করতেন। তারপর যখন তিনি কোন ব্যাপারে দু’আ করার সংকল্প করতেন তখন তাতে এ দু’আ পড়তেন। (ইসলামিক ফাউন্ডেশন ৬৫৯৬, ইসলামিক সেন্টার ৬৬৪৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": "2690.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩৪, আন্তর্জাতিক নাম্বারঃ ২৬৯০ ৬৭৩৪-(২৭/...) উবাইদুল্লাহ ইবনু মুআয (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু’আ পাঠ করতেনঃ \"রব্বনা- আ-তিনা- ফিদ্‌দুনইয়া- হাসানাতাও ওয়াফিল আ-খিরতি হাসানাতাও ওয়াকিনা- ‘আযা-বান্‌ না-র\"। অর্থাৎ- হে আমাদের রব! আমাদের পার্থিব জীবনে কল্যাণ দান করো, আখিরাতে কল্যাণ দান করো। আর জাহান্নামের শাস্তি হতে আমাদের বাঁচাও। (ইসলামিক ফাউন্ডেশন ৬৫৯৭, ইসলামিক সেন্টার ৬৬৪৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6842,
			"arabicnumber": "2691",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩৫, আন্তর্জাতিক নাম্বারঃ ২৬৯১ ৬৭৩৫-(২৮/২৬৯১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ \"লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা- শারীকা লাহু লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুয়া আলাকুল্লি শাইয়্যিন কদীর।\" অর্থাৎ- আল্লাহ ছাড়া কোন ইলাহ নেই; তিনি অদ্বিতীয়, তার কোন অংশীদার নেই, তারই রাজত্ব, তারই যাবতীয় প্রশংসা; তিনিই সব বিষয়ের উপর শক্তিধর- যে লোক এ দু’আ প্রতিদিনে একশ’ বার পাঠ করে সে দশজন গোলাম মুক্ত করার পুণ্য অর্জন হয়, তার (আমলনামায়) একশ’ নেকী লেখা হয় এবং তার হতে একশ’ পাপ মিটিয়ে দেয়া হয়। আর তা ঐ দিন বিকাল পর্যন্ত শাইতান (শয়তান) (তার কুমন্ত্রণা) হতে তার জন্যে রক্ষাকারী হয়ে যায়। সেদিন সে যা পুণ্য অর্জন করেছে তার চেয়ে বেশি পুণ্যবান কেউ হবে না। তবে কেউ তার চাইতে বেশি ‘আমল করলে তার কথা আলাদা। আর যে লোক দিনে একশ’ বার \"সুবহা-নাল্ল-হি ওয়াবিহামদিহী\"। অর্থাৎ- ‘আমি আল্লাহর সপ্রশংসা সহ তার পবিত্রতা বর্ণনা করছি পাঠ করবে, তার সমস্ত পাপ মিটিয়ে দেয়া হবে, যদিও তা সমুদ্রের ফেনার সমপরিমাণ হয়। (ইসলামিক ফাউন্ডেশন ৬৫৯৮, ইসলামিক সেন্টার ৬৬৫০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": "2692",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩৬, আন্তর্জাতিক নাম্বারঃ ২৬৯২ ৬৭৩৬-(২৯/২৬৯২) মুহাম্মাদ ইবনু আবদুল মালিক আল উমাবী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক সকালে ও সন্ধ্যায় \"সুবহা-নাল্ল-হি ওয়াবি হামদিহী\", অর্থাৎ- আল্লাহ পবিত্র ও সমস্ত প্রশংসা তারই একশ’ বার পড়ে আখিরাতের দিবসে তার তুলনায় উত্তম আমল নিয়ে কেউ আসবে না। তবে সে ব্যক্তি ব্যতীত, যে লোক তার সমান আমল করে অথবা তার তুলনায় বেশি আমল করে। (ইসলামিক ফাউন্ডেশন ৬৫৯৯, ইসলামিক সেন্টার ৬৬৫১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": "2694",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৩৯, আন্তর্জাতিক নাম্বারঃ ২৬৯৪ ৬৭৩৯-(৩১/২৬৯৪) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, যুহায়র ইবনু হারব, আবূ কুরায়ব ও মুহাম্মাদ ইবনু তারীফ আল বাজালী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন দু’টি কালিমাহ জিহ্বার উপর (উচ্চারণে) খুবই হালকা, মীযানের পাল্লায় খুবই ভারী, রহমান (পরম দয়ালু আল্লাহ) এর নিকট অত্যন্ত প্রিয়। তা হলো \"সুবহা-নাল্ল-হি ওয়াবি হামদিহী সুবহা-নাল্ল-হিল আযীম\", অর্থাৎ আমি আল্লাহ তা’আলার সমস্ত প্রশংসা, পবিত্রতা জ্ঞাপন করছি, আমি মহান আল্লাহর পবিত্রতা ঘোষণা করছি।’ (ইসলামিক ফাউন্ডেশন ৬৬০১, ইসলামিক সেন্টার ৬৬৫৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": "2695",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪০, আন্তর্জাতিক নাম্বারঃ ২৬৯৫ ৬৭৪০-(৩২/২৬৯৫) আবূ বাকর ইবনু আবূ শাইবাহ ও আবু কুরায়ব (রহঃ) ...... আবু হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি বলি- \"সুবহা-নাল্ল-হি ওয়াল হামদু লিল্লা-হি ওয়ালাইলা-হা ইল্লাল্ল-হু ওয়াল্ল-হু আকবার\"। অর্থাৎ- \"আল্লাহ পবিত্র, সমস্ত প্রশংসা আল্লাহর এবং আল্লাহ ভিন্ন কোন মা’বূদ নেই, আল্লাহ মহান\" পড়া আমার নিকট বেশি প্রিয়- সে সব বিষয়ের চেয়ে, যার উপর সূর্য উদিত হয়। (ইসলামিক ফাউন্ডেশন ৬৬০২, ইসলামিক সেন্টার ৬৬৫৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": "2696",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪১, আন্তর্জাতিক নাম্বারঃ ২৬৯৬ ৬৭৪১-(৩৩/২৬৯৬) আবূ বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... মুসআব ইবনু সা’দ (রাযিঃ) তার পিতা হতে বর্ণনা করেন। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট জনৈক গ্রাম্য লোক এসে বলল, আমাকে একটি কালাম শিক্ষা দিন, যা আমি নিয়মিত পাঠ করব। তিনি বললেন, তুমি বলো \"লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা-শারীকা লাহু আল্ল-হু আকবার কাবীরা ওয়াল হামদু লিল্লা-হি কাসীরা সুবহানাল্লা-হি রব্বিল আ-লামীনা লা- হাওলা ওয়ালা- কুত্ত্বওয়াতা ইল্লা-বিল্লা-হিল আযীযিল হাকীম\"। অর্থাৎ- \"আল্লাহ ভিন্ন কোন মা’বূদ নেই, তিনি অদ্বিতীয়, তার কোন অংশীদার নেই, আল্লাহ মহান, সবচেয়ে মহান, আল্লাহর জন্য সমস্ত প্রশংসা এবং আমি আল্লাহ রাব্বুল আলামীনের পবিত্রতা ঘোষণা করছি। পরাক্রমশালী বিজ্ঞানময় আল্লাহর সাহায্য ছাড়া ভাল কাজ করার এবং খারাপ কাজ হতে বিরত থাকার সাধ্য কারো নেই।\" সে বলল, এসব তো আমার রবের জন্য। আমার জন্যে কি? তিনি বললেন, বলো, হে আল্লাহ! আপনি আমাকে মাফ করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথ দেখিয়ে দিন এবং আমাকে জীবিকা দান করুন। মূসা (রহঃ) বলেন, (আমার মনে হয়) তিনি عَافِنِي (আ-ফিনী) \"আমাকে মাফ করুন\" কথাটি বলেছেন। তবে আমি তাতে সংশয় আছি এবং আমি জানি না। আর ইবনু আবু শাইবাহ (রহঃ) তার হাদীসে মূসার উক্তি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৬৬০৩, ইসলামিক সেন্টার ৬৬৫৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": "2697.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪২, আন্তর্জাতিক নাম্বারঃ ২৬৯৭ ৬৭৪২-(৩৪/২৬৯৭) আবূ কামিল আল জাহদারী (রহঃ) ..... আবু মালিক আল আশজাঈ (রহঃ) তার পিতার সানাদে বর্ণিত। তিনি বলেন, কোন লোক ইসলাম কবুল করলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এ দু’আ বলতে শিখিয়ে দিতেন, “আল্লা-হুম্মাগ ফিরলী ওয়ারহামনী ওয়াহ্‌দিনী ওয়ারযুকনী”। অর্থাৎ- হে আল্লাহ। আপনি আমাকে মাফ করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথপ্রদর্শন করুন এবং আমাকে জীবিকা দান করুন। (ইসলামিক ফাউন্ডেশন ৬৬০৪, ইসলামিক সেন্টার ৬৬৫৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": "2697.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪৩, আন্তর্জাতিক নাম্বারঃ ২৬৯৭ ৬৭৪৩-(৩৫/...) সাঈদ ইবনু আযহার আল ওয়াসিতী (রহঃ) ..... আবু মালিক আল আশজাঈ এর পিতার সানাদে বর্ণিত। তিনি বলেন, যখন কোন ব্যক্তি ইসলামে দীক্ষা গ্রহণ করত তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে প্রথমে সালাত আদায়ের শিক্ষা দিতেন। তারপর তিনি তাকে এ কালিমাসমূহ পাঠ করার নির্দেশ দিতেন, \"আল্লা-হুম্মাগ ফিরলী ওয়ারহামনী ওয়াহ্‌দিনী ওয়া’আ-ফিনী ওয়ারযুকনী।\" অর্থাৎ- \"হে আল্লাহ! আমাকে মাফ করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথপ্রদর্শন করুন, আমাকে সুস্থতা দান করুন এবং আমার জীবিকা উপকরণ দান করুন।\" (ইসলামিক ফাউন্ডেশন ৬৬০৫, ইসলামিক সেন্টার ৬৬৫৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": "2697.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪৪, আন্তর্জাতিক নাম্বারঃ ২৬৯৭ ৬৭৪৪-(৩৬/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ মালিক (রাযিঃ) এর পিতার সানাদে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছেন যে, তার নিকট এক লোক এসে বলল, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমি যখন আমার প্রতিপালকের নিকট দু’আ করব তখন কিভাবে তা প্রকাশ করব? তিনি বললেন, তুমি বলে, “আল্ল-হুম্মাগ ফিরলী ওয়ারহামনী ওয়াআ-ফিনী ওয়ারযুকনী।” অর্থাৎ- “হে আল্লাহ! আপনি আমাকে মাফ করে দিন, আমার প্রতি দয়া করুন, আমাকে মাফ করে দিন এবং আমাকে জীবিকা দান করুন।” আর তিনি বৃদ্ধাঙ্গুলি ছাড়া সব আঙ্গুল একত্র করে বললেন, এ শব্দগুলো তোমাকে দুনিয়া ও আখিরাত উভয়টাকে একসাথে করে দিবে। (ইসলামিক ফাউন্ডেশন ৬৬০৬, ইসলামিক সেন্টার ৬৬৫৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": "2698",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪৫, আন্তর্জাতিক নাম্বারঃ ২৬৯৮ ৬৭৪৫-(৩৭/২৬৯৮) আবূ বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... মুসআব ইবনু সা’দ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমার পিতা (সা'দ) আমাকে হাদীস শুনিয়েছেন যে, তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে (বসা) ছিলাম। তখন তিনি বললেন, তোমাদের মাঝে কেউ কি প্রতিদিন এক হাজার পুণ্য হাসিল করতে অপারগ হয়ে যাবে? তখন সেখানে বসে থাকাদের মধ্য থেকে এক প্রশ্নকারী প্রশ্ন করল, আমাদের কেউ কিভাবে এক হাজার পুণ্য হাসিল করবে? তিনি বললেন, সে একশ’ তাসবীহ (সুবহানাল্লা-হ) পাঠ করলে তার জন্যে এক হাজার পুণ্য লিখিত হবে এবং তার (আমলনামা) হতে এক হাজার পাপ মুছে দেয়া হবে। (ইসলামিক ফাউন্ডেশন ৬৬০৭, ইসলামিক সেন্টার ৬৬৬০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": "2699.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪৬, আন্তর্জাতিক নাম্বারঃ ২৬৯৯ ৬৭৪৬-(৩৮/২৬৯৯) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামীমী, আবু বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনুল আলা আল হামদানী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক কোন ঈমানদারের দুনিয়া থেকে কোন মুসীবাত দূর করে দিবে, আল্লাহ তা’আলা বিচার দিবসে তার থেকে মুসীবাত সরিয়ে দিবেন। যে লোক কোন দুঃস্থ লোকের অভাব দূর করবে, আল্লাহ তাআলা দুনিয়া ও আখিরাতে তার দুরবস্থা দূর করবেন। যে লোক কোন মুসলিমের দোষ-ত্রুটি লুকিয়ে রাখবে আল্লাহ তা’আলা দুনিয়া ও আখিরাতে তার দোষ-ত্রুটি লুকিয়ে রাখবেন। বান্দা যতক্ষণ তার ভাই এর সহযোগিতায় আত্মনিয়োগ করে আল্লাহ ততক্ষণ তার সহযোগিতা করতে থাকেন। যে লোক জ্ঞানার্জনের জন্য রাস্তায় বের হয়, আল্লাহ এর বিনিময়ে তার জন্য জান্নাতের পথ সহজ করে দেন। যখন কোন সম্প্রদায় আল্লাহর গৃহসমূহের কোন একটি গৃহে একত্রিত হয়ে আল্লাহর কিতাব পাঠ করে এবং একে অপরের সাথে মিলে (কুরআন) অধ্যয়নে লিপ্ত থাকে তখন তাদের উপর শান্তিধারা অবতীর্ণ হয়। রহমত তাদেরকে আচ্ছন্ন করে ফেলে এবং ফেরেশতাগণ তাদেরকে পরিবেষ্টন করে রাখেন। আর আল্লাহ তা’আলা তার নিকটবর্তীদের (ফেরেশতাগণের) মধ্যে তাদের কথা আলোচনা করেন। আর যে লোককে আমলে পিছনে সরিয়ে দিবে তার বংশ (মর্যাদা) তাকে অগ্রসর করে দিবে না* (ইসলামিক ফাউন্ডেশন ৬৬০৮, ইসলামিক সেন্টার ৬৬৬১) * যে ব্যক্তিকে তার আমলে দূর সরিয়ে রাখে। তাকে তার সমৃদ্ধ বংশ মর্যাদা এগিয়ে নিতে পারবে না। সুতরাং যার আমল কম সে কখনো অধিক সৎকর্মশীল লোকের মর্যাদায় উন্নীত হতে পারবে না। সেক্ষেত্রে তার উচিত হবে যে, স্বল্প ‘আমল, বাপ-দাদাদের কৃতিত্ব ও বংশ মর্যাদার উপর ভরসা না করে সর্বদা নেক আমলে জড়িয়ে থাকা।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": "2699.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৪৭, আন্তর্জাতিক নাম্বারঃ ২৬৯৯ ৬৭৪৭-(…/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র ও নাসর ইবনু আলী আল জাহযামী (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ..... আবূ মু’আবিয়াহ্ (রহঃ) এর হাদীসের অবিকল। তবে আবু উসামার হাদীসে \"দুঃস্থ লোকের অভাব লাঘব করার\" বর্ণনা নেই। (ইসলামিক ফাউন্ডেশন ৬৬০৯, ইসলামিক সেন্টার ৬৬৬২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": "2701",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫০, আন্তর্জাতিক নাম্বারঃ ২৭০১ ৬৭৫০-(৪০/২৭০১) আবূ বাকর ইবনু আবু শাইবাহ্ (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, মু’আবিয়াহ্ (রাযিঃ) মসজিদে একটি হালকা’র উদ্দেশে বের হলেন। অতঃপর তিনি বললেন, কিসে তোমাদেরকে এখানে বসিয়েছে (তোমরা এখানে বসেছ কেন)? তারা বলল, আমরা আল্লাহর যিকর করতে বসেছি। তিনি বললেন, আল্লাহর শপথ! এছাড়া আর কোন বিষয় তোমাদেরকে বসায়নি? (তোমরা কি শুধু এ জন্যেই বসেছ?) তারা বলল, আল্লাহর শপথ! এছাড়া অন্য কোন বিষয় আমাদেরকে বসায়নি। তিনি বললেন, আমি তোমাদেরকে অপবাদ দেয়ার উদ্দেশে শপথ প্রার্থনা করিনি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দৃষ্টিতে আমার যে সম্মান ছিল সে অনুযায়ী আমার চেয়ে কম হাদীস বর্ণনাকারী কেউ নেই। একবার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সহাবাদের একটি ‘হালকা’র নিকটে গিয়ে বললেন, কিসে তোমাদের বসিয়েছে? তারা বলল, আমরা বসেছি আল্লাহর স্মরণ ও তার কৃতজ্ঞতা প্রকাশের জন্য। যেহেতু তিনি আমাদেরকে ইসলামের দিকে পথ দেখিয়েছেন এবং আমাদের উপর তিনি ইহসান করেছেন। তিনি বললেন, আল্লাহর শপথ! তোমাদেরকে কি শুধু এ বিষয়েই বসিয়েছে? তারা বলল, আল্লাহর শপথ! আমাদেরকে একমাত্র ঐ বিষয় বসিয়েছে। তিনি বললেন, আমি তোমাদেরকে অপবাদ দেয়ার জন্যে শপথ করতে বলিনি; বরং আমার নিকট জিবরীল (আঃ) এসে আমাকে অবহিত করেছেন যে, আল্লাহ সুবহানাহু ওয়াতা’আলা ফেরেশতাগণের নিকট তোমাদের মর্যাদা সম্পর্কে আলোচনা করছেন। (ইসলামিক ফাউন্ডেশন ৬৬১১, ইসলামিক সেন্টার ৬৬৬৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": "2702.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫১, আন্তর্জাতিক নাম্বারঃ ২৭০২ ৬৭৫১-(৪১/২৭০২) ইয়াহইয়া ইবনু ইয়াহইয়া, কুতাইবাহ ইবনু সাঈদ ও আবু রাবী আল আতাকী (রহঃ) ...... রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহাবা আগার আল মুযানী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার অন্তরে কখনো কখনো অলসতা দেখা দেয়, তাই আমি দৈনিক একশ’ বার আল্লাহর নিকট ক্ষমা প্রার্থনা করে থাকি। (ইসলামিক ফাউন্ডেশন ৬৬১২, ইসলামিক সেন্টার ৬৬৬৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6859,
			"arabicnumber": "2702.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫২, আন্তর্জাতিক নাম্বারঃ ২৭০২ ৬৭৫২-(৪২/...) আবু বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবূ বুরদাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহাবা আগার (রাযিঃ) হতে শুনেছি, তিনি ইবনু উমর (রাযিঃ) এর নিকট হাদীস বর্ণনা করতে গিয়ে বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে লোক সকল! তোমরা আল্লাহর নিকট তওবা্ করো। কেননা আমি আল্লাহর নিকট প্রতিদিন একশ’ বার তওবা করে থাকি। (ইসলামিক ফাউন্ডেশন ৬৬১৩, ইসলামিক সেন্টার ৬৬৬৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": "2702.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৩, আন্তর্জাতিক নাম্বারঃ ২৭০২ ৬৭৫৩-(.../...) উবাইদুল্লাহ ইবনু মুআয ও ইবনুল মুসান্না (রহঃ) ..... শু’বাহ (রহঃ) এর সানাদে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬১৪, ইসলামিক সেন্টার ৬৬৬৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6861,
			"arabicnumber": "2703",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৪, আন্তর্জাতিক নাম্বারঃ ২৭০৩ ৬৭৫৪-(৪৩/২৭০৩) আবু বকর ইবনু আবূ শাইবাহ, ইবনু নুমায়র, আবু সাঈদ আশাজ্জ, আবূ খায়সামাহ যুহায়র ইবনু হারব (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক পশ্চিম আকাশে সূর্যোদয় হওয়ার আগে তওবা করবে আল্লাহ তা’আলা তার তওবা কবুল করবেন।* (ইসলামিক ফাউন্ডেশন ৬৬১৫, ইসলামিক সেন্টার ৬৬৬৯) * কিয়ামাতের প্রাক্কালে সূর্য পশ্চিমাকাশে উদিত হবে। পশ্চিম দিকে সূর্যোদয় হওয়ার পরে আর কারো তাওবাহ আল্লাহ তা’আলা কবুল করবেন না। * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত ইসলাম ধর্মে তওবার পারিভাষিক সংজ্ঞা: তওবা হলো: প্রকৃত ইসলাম ধর্মের বিধান অনুযায়ী কতকগুলি নির্দিষ্ট নিয়ম মোতাবেক যে কোনো পাপ থেকে আল্লাহর আনুগত্যের দিকে প্রত্যাবর্তন করার নাম। এই হাদীসটি প্রতিটি মানুষকে সমস্ত প্রকারের পাপ ত্যাগ করে মহান আল্লাহর বিরুদ্ধাচরণ করা থেকে তাঁর আনুগত্যের দিকে প্রত্যাবর্তন করার প্রতি উৎসাহ প্রদান করে। তবে আল্লাহর নিকটে তওবা কবুল হওয়ার কতকগুলি শর্ত বা আনুষঙ্গিক বিষয় রয়েছে, সেই বিষয়গুলি যেন প্রত্যেক ব্যক্তির তওবাতে পাওয়া যায়, উক্ত বিষয়গুলি নিম্নরূপ: ১। তওবা শুধু মাত্র আল্লাহর সন্তুষ্টিলাভের উদ্দেশ্যে হতে হবে, পার্থিব জগতের উদ্দেশ্যে বা মানুষের প্রশংসা লাভের নিমিত্তে হওয়া বৈধ নয়। ২। পাপ সম্পূর্ণরূপে বর্জন করতে হবে। ৩। পাপ সংঘটিত হওয়ার কারণে অনুতপ্ত বা লজ্জিত হতে হবে। ৪। যে পাপ থেকে তওবা করা হচ্ছে, সেই পাপের দিকে পুনরায় না যাওয়ার দৃঢ় সংকল্প স্থির করতে হবে। ৫। পাপ যদি অন্যের অধিকারের সাথে সম্পৃক্ত হয়, তাহলে সেই অধিকার তাকে ফেরত দিতে হবে। ৬। তওবা কেয়ামতের পূর্বে পশ্চিম দিক থেকে সূর্যোদয় হওয়ার পূর্বে হতে হবে। ৭। তওবা মৃত্যুবরণের নিদর্শন প্রকাশ পাওয়ার আগেই করতে হবে। ২। যে ব্যক্তির দ্বারা কোনো পাপ সংঘটিত হয়ে যাবে, সে ব্যক্তির জন্য পাপ ত্যাগ করে আল্লাহর আনুগত্যের দিকে ফিরে আসা ওয়াজেব বা অপরিহার্য হয়ে যাবে। যদিও তার দ্বারা পাপ বারবার সংঘটিত হয়ে থাকে। কেননা যে ব্যক্তি সঠিকভাবে সমস্ত পাপ থেকে তওবা করে মহান আল্লাহর দিকে প্রত্যাবর্তন করবে, মহান আল্লাহ তার তওবা অবশ্যই গ্রহণ করবেন। ৩। পশ্চিম দিক থেকে সূর্যোদয়ের বিষয়টি হলো মহান আল্লাহর অনেক নিদর্শনের মধ্যে থেকে একটি মহা নিদর্শন। এই নিদর্শনটির দ্বারা এটা সাব্যস্ত হয় যে, মহান আল্লাহ নিশ্চয় সর্ববিষয়ে সর্বশক্তিমান। আর পশ্চিম দিক থেকে সূর্যোদয়ের বিষয়টি হলো মহা প্রলয় বা কেয়ামত সংঘটিত হওয়ারও একটি মহা নিদর্শন। আর এই বিষয়টি পৃথিবীর আবর্তনের প্রভাবের কারণে নয়, যেমনকি কতকগুলি লোক এই ধারণাটি তাদের মনের মধ্যে পোষণ করে থাকে।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6862,
			"arabicnumber": "2704.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৫, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৫৫-(৪৪/২৭০৪) আবু বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবু মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা কোন এক সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তখন মানুষেরা উচ্চঃস্বরে তাকবীর পাঠ করতেছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে মানব জাতি! তোমরা তোমাদের জীবনের উপর সদয় হও। কেননা তোমরা তো কোন বধির অথবা অনুপস্থিত সত্তাকে ডাকছে না। নিশ্চয়ই তোমরা ডাকছো সর্বশ্রোতা, নিকটবর্তী সত্তাকে যিনি তোমাদের সাথেই আছেন। আবু মূসা (রাযিঃ) বলেন, আমি তার পিছে ছিলাম। তখন আমি বলছিলাম, আল্লাহর সহযোগিতা ছাড়া কোন ভাল কাজের দিকে এগিয়ে যাওয়ার এবং মন্দ কর্ম থেকে ফিরে আসার সামর্থ্য নেই। তখন তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, হে আবদুল্লাহ ইবনু কায়স আমি কি তোমাকে জান্নাতের গুপ্ত ধনসমূহের মধ্যে কোন একটি গুপ্তধনের কথা জানিয়ে দিব? আমি বললাম, অবশ্যই হে আল্লাহর রসূল! অতঃপর তিনি বললেন, لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ সহযোগিতা ছাড়া কারো (ভাল কর্মের দিকে) এগিয়ে যাওয়া এবং (খারাপ কর্ম থেকে) ফিরে আসার সামর্থ্য নেই’। (ইসলামিক ফাউন্ডেশন ৬৬১৬, ইসলামিক সেন্টার ৬৬৭০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6863,
			"arabicnumber": "2704.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৬, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৫৬-(…/...) ইবনু নুমায়র, ইসহাক ইবনু ইবরাহীম ও আবু সাঈদ আল আশাজ্জ (রহঃ) ...... আসিম (রহঃ) এর সানাদে এ সূত্রে তার হুবহু হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬১৭, ইসলামিক সেন্টার ৬৬৭১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6864,
			"arabicnumber": "2704.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৭, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৫৭-(৪৫/...) আবু কামিল ফুযায়ল ইবনু হুসায়ন (রহঃ) ..... আবু মূসা (রাযিঃ) থেকে বর্ণিত। তারা (সহাবাগণ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলেন এবং তারা একটি উঁচু টিলায় আরোহণ করতেছিলেন। তিনি বলেন, লোক যখনই কোন টিলার উপরে উঠত তখন উচ্চকণ্ঠে \"লা-ইলা-হা ইল্লাল্ল-হু ওয়াল্ল-হু আকবার\" (আল্লাহ ছাড়া প্রকৃতপক্ষে কোন ইলাহ নেই এবং আল্লাহ মহান) বলত। তিনি (রাবী) বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা তো অবশ্যই কোন বধির কিংবা অনুপস্থিত সত্তাকে ডাকছো না। তিনি বলেন, এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আবূ মূসা অথবা হে আবদুল্লাহ ইবনু কায়স! আমি কি তোমাকে এমন এক কালিমাহ সম্পর্কে জানিয়ে দিব না যা জান্নাতের গুপ্তধন? আমি বললাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা কি? তিনি বললেন, \"লা- হাওলা ওয়ালাকুওয়াতা ইল্লা- বিল্লা-হ\" অর্থাৎ- (আল্লাহর সহযোগিতা ছাড়া কারো ভাল কর্ম করার এবং খারাপ কর্ম থেকে বিরত থাকার সামর্থ্য নেই)। (ইসলামিক ফাউন্ডেশন ৬৬১৮, ইসলামিক সেন্টার ৬৬৭২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6865,
			"arabicnumber": "2704.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৮, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৫৮-(…/...) মুহাম্মাদ ইবনু আবদুল আ’লা (রহঃ) ..... আবু মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট আগমন করলেন। এরপর তিনি তার হুবহু হাদীস উল্লেখ করেন। (ইসলামিক ফাউন্ডেশন ৬৬১৯, ইসলামিক সেন্টার ৬৬৭৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6866,
			"arabicnumber": "2704.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৫৯, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৫৯-(.../...) খালাফ ইবনু হিশাম ও আবু রাবী’ (রহঃ) ..... আবু মূসা (রাযিঃ) থেকে বর্ণিত। কোন এক যুদ্ধে আমরা রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তারপর তিনি আসিম এর হাদীসের অবিকল হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৬৬২০, ইসলামিক সেন্টার ৬৬৭৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6867,
			"arabicnumber": "2704.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬০, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৬০-(৪৬/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবু মূসা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে কোন এক যুদ্ধাভিযানে ছিলাম। তারপর তিনি সম্পূর্ণ হাদীস বর্ণনা করেন। তিনি তার বর্ণনায় বলেছেন, “ঐ সত্তার শপথ, তোমরা যাকে ডাকছো তিনি তোমাদের উটের গর্দানের চেয়েও অতি নিকটবর্তী।” তবে তার হাদীসে \"লা- হাওলা ওয়ালা- কুওয়াতা ইল্লা-বিল্লা-হ\" কথাটির উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ৬৬২১, ইসলামিক সেন্টার ৬৬৭৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6868,
			"arabicnumber": "2704.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬১, আন্তর্জাতিক নাম্বারঃ ২৭০৪ ৬৭৬১-(৪৭/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবু মূসা আল আশ’আর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনঃ আমি কি তোমাকে এমন একটি কালিমাহ সম্পর্কে জানিয়ে দিব না যা জান্নাতের গুপ্তধন? কিংবা তিনি বলেছেন, জান্নাতের গুপ্ত ধনসমূহের মধ্য হতে একটি গুপ্তধনের কথা কি বলব না? তখন আমি বললাম, হ্যাঁ। তারপর তিনি বললেন, \"লা- হাওলা ওয়ালা- কুওয়াতা ইল্লা- বিল্লা-হ\" অর্থাৎ (আল্লাহর সহযোগিতা ছাড়া কারো ভাল কর্ম করার এবং খারাপ কর্ম থেকে ফিরে আসার সামর্থ্য নেই)। (ইসলামিক ফাউন্ডেশন ৬৬২২, ইসলামিক সেন্টার ৬৬৭৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6869,
			"arabicnumber": "2705.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬২, আন্তর্জাতিক নাম্বারঃ ২৭০৫ ৬৭৬২-(৪৮/২৭০৫) কুতাইবাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... আবু বাকর (রাযিঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বললেন, আপনি আমাকে এমন একটি দু’আ শিখিয়ে দিন, যা দ্বারা আমি আমার সালাতে দু’আ করব। তিনি বললেন, তুমি বলো, \"আল্ল-হুম্মা ইন্নী যলামতু নাফসী যুলমান কাবীরা\" অর্থাৎ হে আল্লাহ! আমি আমার নিজের উপর বড় যুলুম করেছি। কুতাইবাহ (রহঃ) বলেন, \"কাসীরা, ওয়ালা- ইয়াগফিরুয়ু যুনুবা ইল্লা-আনতা ফাগফিরলী মাগফিরাতাম মিন ইনদিকা ওয়ার হামনী ইন্নাকা আনতাল গফুরুর রহীম\" অর্থাৎ- অনেক। আপনি ছাড়া কেউ পাপরাশি মার্জনা করতে পারে না। সুতরাং আপনি আপনার পক্ষ থেকে আমাকে মাফ করুন এবং আমার উপর দয়া করুন। অবশ্যই আপনি একমাত্র ক্ষমাশীল, পরম দয়ালু।\" (ইসলামিক ফাউন্ডেশন ৬৬২৩, ইসলামিক সেন্টার ৬৬৭৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6870,
			"arabicnumber": "2705.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৩, আন্তর্জাতিক নাম্বারঃ ২৭০৫ ৬৭৬৩-(.../...) আবু তাহির (রহঃ) ..... আবুল খায়র (রহঃ) থেকে বর্ণিত। তিনি আবদুল্লাহ ইবনু আমর ইবনুল আস (রাযিঃ) কে বলতে শুনেছেন যে, আবু বকর সিদ্দীক (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বললেন, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনি আমাকে এমন একটি দু’আ শিখিয়ে দিন যার সাহায্যে আমি আমার সালাতে ও গৃহে নিয়মিত দুআ পড়তে পারি। তারপর তিনি লায়স এর হাদীসের অবিকল হাদীস বর্ণনা করেছেন। তাছাড়া হাদীসে রয়েছে যে, তিনি ظُلْمًا كَثِيرًا বলেছেন। (ইসলামিক ফাউন্ডেশন ৬৬২৩, ইসলামিক সেন্টার ৬৬৭৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6871,
			"arabicnumber": "589.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৪, আন্তর্জাতিক নাম্বারঃ ৫৮৯ ৬৭৬৪-(৪৯/৫৮৯) আবু বকর ইবনু আবু শাইবাহ ও আবু কুরায়ব (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু’আসমূহ পাঠের মাধ্যমে দুআ করতেন, \"আল্ল-হুম্মা ফাইন্নী আউযুবিকা মিন্‌ ফিতনাতিন না-রি ওয়া ‘আযা-বিন্‌ না-রি ওয়া ফিতনাতিল কবরি ওয়া ‘আযা-বিল্‌ কবরি ওয়ামিন শাররি ফিতনাতিল গিনা ওয়ামিন শার্‌রি ফিতনাতিল ফাক্‌রি ওয়া আউযুবিকা মিন্‌ শাররি ফিতনাতিল মাসীহিদ দাজ্জা-ল, আল্ল-হুম্মাগসিল খতা-ইয়া-ইয়া বিমা-য়িস্ সালজি ওয়াল বারাদ, ওয়ানক্কি কলবী মিনাল খতা-ইয়া- কামানাক্কাইতাস্ সাওবাল আবইয়াযা মিনাদ দানাস ওয়া বা-ইদ বাইনী ওয়া বাইনা খতা- ইয়া-ইয়া কামা-বা-’আদতা বাইনাল মাশরিকি ওয়াল মাগরিব, আল্ল-হুম্মা ফা-ইন্নী আউযুবিকা মিনাল কাসালি ওয়াল হারামি ওয়াল মা’সামি ওয়াল মাগ্রাম।\" অর্থাৎ- \"হে আল্লাহ! আমি আপনার নিকট জাহান্নামের ফিতনাহ থেকে আশ্রয় চাই, জাহান্নামের শাস্তি হতে আশ্রয় চাই, কবরের ফিতনাহ, কবর শাস্তি ও ধন-সম্পদের ফিতনাহ এবং অসচ্ছলতার ফিতনার খারাবী হতে আপনার নিকট আশ্রয় চাই। আমি আপনার নিকট মাসীহ দাজ্জালের ফিতনার বিভ্রান্তির অপকারিতা থেকে আশ্রয় চাই। হে আল্লাহ আমার গুনাহসমূহ বরফ ও কুয়াশার স্নিগ্ধ-শীতল পানি দিয়ে ধুয়ে মুছে পরিষ্কার করে দিন। আমার অন্তর পবিত্র করে দিন যেভাবে আপনি সাদা কাপড় ময়লা হতে পরিষ্কার করে দেন। আমি ও আমার গুনাহসমূহের মাঝে দূরত্ব করে দিন যেমন আপনি পূর্ব ও পশ্চিমের মাঝে দূরত্ব সৃষ্টি করেছেন। হে আল্লাহ! আমি আপনার নিকট অলসতা, বার্ধক্য, গুনাহ ও ধার-কৰ্জ হতে আশ্রয় চাই।\" (ইসলামিক ফাউন্ডেশন ৬৬২৪, ইসলামিক সেন্টার ৬৬৭৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6872,
			"arabicnumber": "589.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৫, আন্তর্জাতিক নাম্বারঃ ৫৮৯ ৬৭৬৫-(.../...) আবু কুরায়ব (রহঃ) ..... হিশাম (রহঃ) এর সানাদে এ সূত্রে হুবহু হাদীস বর্ণিত। (ইসলামিক ফাউন্ডেশন ৬৬২৫, ইসলামিক সেন্টার ৬৬৮০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6873,
			"arabicnumber": "2706.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৬, আন্তর্জাতিক নাম্বারঃ ২৭০৬ ৬৭৬৬-(৫০/২৭০৬) ইয়াহইয়া ইবনু আইয়্যুব (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ \"আল্ল-হুম্মা ইন্নী আউয়ুবিকা মিনাল আজ্‌যি ওয়াল কাসালি ওয়াল জুব্‌নি ওয়াল হারামি ওয়াল বুখলি ওয়া আউয়ুবিকা মিন আযা-বিল কবরি ওয়ামিন ফিতনাতিল মাহইয়া- ওয়াল মামা-ত\"। অর্থাৎ- \"হে আল্লাহ! আমি আপনার কাছে অক্ষমতা, অলসতা, কাপুরুষতা, বার্ধক্য, বখিলতা থেকে আশ্রয় চাচ্ছি। আমি আপনার নিকট আরও আশ্রয় চাচ্ছি কবরের শাস্তি, জীবন ও মরণের ফিতনার খারাবী থেকে।\" (ইসলামিক ফাউন্ডেশন ৬৬২৬, ইসলামিক সেন্টার ৬৬৮১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6874,
			"arabicnumber": "2706.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৭, আন্তর্জাতিক নাম্বারঃ ২৭০৬ ৬৭৬৭-(…/...) আবূ কামিল ও মুহাম্মাদ ইবনু আবদুল আ’লা (রহঃ) ..... আনাস (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তার অবিকল হাদীস বর্ণিত। তবে ইয়াযীদ বর্ণিত হাদীসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণী ‘জীবন ও মরণের ফিতনার খারাবী হতে কথাটি উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ৬৬২৭, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6875,
			"arabicnumber": "2706.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৮, আন্তর্জাতিক নাম্বারঃ ২৭০৬ ৬৭৬৮-(৫১/...) আবু কুরায়ব মুহাম্মাদ ইবনু আলী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি আশ্রয় চেয়েছেন বর্ণিত বিষয়সমূহ থেকে এবং বখিলত হতে। (ইসলামিক ফাউন্ডেশন ৬৬২৮, ইসলামিক সেন্টার ৬৬৮২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6876,
			"arabicnumber": "2706.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৬৯, আন্তর্জাতিক নাম্বারঃ ২৭০৬ ৬৭৬৯-(৫২/...) আবু বকর ইবনু নাফি আল আবদী (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু’আসমূহ পাঠ করতেনঃ “আল্ল-হুম্মা ইন্নী আউযুবিকা মিনাল বুখ্‌লি ওয়াল কাসালি ওয়া আরযালিল উমুরি ওয়া আযা-বিল কবরি ওয়া ফিতনাতিল মাহইয়া- ওয়াল মামা-ত”। অর্থাৎ- \"হে আল্লাহ! আমি আপনার নিকটে বখিলতা, অলসতা, নিকৃষ্ট জীবন-যাপন, কবরের শাস্তি এবং জীবন ও মৃত্যুর ফিতনাহ থেকে আশ্রয় চাই।\" (ইসলামিক ফাউন্ডেশন ৬৬২৯, ইসলামিক সেন্টার ৬৬৮৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6877,
			"arabicnumber": "2707",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭০, আন্তর্জাতিক নাম্বারঃ ২৭০৭ ৬৭৭০-(৫৩/২৭০৭) ‘আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ...... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশ্রয় প্রার্থনা করতেন অদৃষ্ট্রের অনিষ্ট থেকে, দুঃখ পাওয়া থেকে, শত্রুদের আনন্দ থেকে এবং বালা-মুসীবাতের কষ্ট থেকে। আমর তার হাদীসে বলেছেন যে, সুফইয়ান (রহঃ) বলেছেন, আমি সন্দেহ করছি, এর মধ্যে একটি বাড়িয়ে বলেছি। (ইসলামিক ফাউন্ডেশন ৬৬৩০, ইসলামিক সেন্টার ৬৬৮৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6878,
			"arabicnumber": "2708.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭১, আন্তর্জাতিক নাম্বারঃ ২৭০৮ ৬৭৭১-(৫৪/২৭০৮) কুতাইবাহ্ ইবনু সাঈদ, মুহাম্মাদ ইবনু রুমহ্ (রহঃ) ..... খাওলা বিনতু হাকীম আস্ সুলামিয়্যাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, তিনি বলেছেনঃ যে লোক কোন ঘাটিতে নেমে এ দু’আ পড়ে, \"আউযু বিকালিমাতিল্‌ লা-হিত তা-মা-তি মিন্‌ শাররি মা- খলাক\"। অর্থাৎ- “আমি আল্লাহর পরিপূর্ণ কালাম দিয়ে তাঁর নিকট তাঁর সৃষ্টির খারাবী হতে আশ্রয় চাই।\" সে ঐ ঘাটি হতে অন্য ঘাটিতে রওনা না হওয়া পর্যন্ত তাকে কোন কিছুই কোন ক্ষতি সাধন করতে পারবে না। (ইসলামিক ফাউন্ডেশন ৬৬৩১, ইসলামিক সেন্টার, ৬৬৮৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6880,
			"arabicnumber": "2709.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৩, আন্তর্জাতিক নাম্বারঃ ২৭০৯ ৬৭৭৩-(.../২৭০৯) ইয়াকুব (রহঃ) বলেন, কা'কা ইবনু হাকীম (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! গত রাতে একটি বিছু আমাকে দংশন করার কারণে আমি বড় কষ্ট পেয়েছি। তিনি বললেন, যদি তুমি সন্ধ্যায় এ দু’আটি পড়তে \"আউযু বিকালিমাতিল্লা-হিত তা-ম্মা-তি মিন শাররি মা- খলাক\" অৰ্থাৎ- ‘আমি পূর্ণাঙ্গ কালিমাহ দ্বারা আল্লাহর নিকট তার সৃষ্টির খারাবী থেকে পানাহ চাই’। তাহলে সে তোমাকে ক্ষতি করতে পারত না। (ইসলামিক ফাউন্ডেশন ৬৬৩২, ইসলামিক সেন্টার ৬৬৮৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6881,
			"arabicnumber": "2709.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৪, আন্তর্জাতিক নাম্বারঃ ২৭০৯ ৬৭৭৪-(…/...) ঈসা ইবনু হাম্মাদ আল মিসরী (রহ) ...... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। (তিনি বলেন,) এক লোক বলল, হে আল্লাহর রসূল! আমাকে একটি বিচ্ছু দংশন করেছে। এরপর ইবনু ওয়াহব এর হাদীসের অবিকল। (ইসলামিক ফাউন্ডেশন ৬৬৩৩, ইসলামিক সেন্টার ৬৬৮৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6882,
			"arabicnumber": "2710.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৫, আন্তর্জাতিক নাম্বারঃ ২৭১০ ৬৭৭৫-(৫৬/২৭১০) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) থেকে বর্ণিত। (তিনি বলেন) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তুমি তোমার বিছানা গ্রহণ করবে তখন সালাতের ওযুর মতো তুমি ওযু করে নিবে। এরপর তুমি তোমার ডান কাতে শুয়ে পড়বে। তারপর তুমি বলবে, “হে আল্লাহ! আমি আমার চেহারাকে তোমার প্রতি সমর্পণ করলাম, আমার কাজ-কর্ম তোমার নিকট অর্পণ করলাম। আমি প্রতিদান পাওয়ার প্রত্যাশায় এবং শাস্তির ভয় পূর্বক তোমার নিকট আশ্রয় চাইলাম। তুমি ব্যতীত নেই কোন আশ্রয়স্থল ও নেই কোন মুক্তির স্থান। তুমি যে কিতাব অবতীর্ণ করেছ তার উপর বিশ্বাস আনলাম, তুমি যে নবীকে পাঠিয়েছ তার প্রতি বিশ্বাস আনলাম।” আর এ বাক্যগুলোকে তোমার শেষ কথা বলে গণ্য করে নাও। এরপর যদি তুমি ঐ রাতে মারা যাও তাহলে তুমি ফিতরাতের উপরই মৃত্যুবরণ করলে। বারা (রাযিঃ) বলেন, আমি এ দু’আ গুলো মনে রাখার জন্যে বার বার পড়তে গিয়ে আমি বললাম, (হে আল্লাহ) আমি আপনার রসূলের প্রতি বিশ্বাস স্থাপন করেছি যাকে আপনি প্রেরণ করেছেন। অর্থাৎ- (তোমার নবীর স্থানে তোমার রসূল’ বললাম)। তিনি বললেন, তুমি বলো, আমি বিশ্বাস স্থাপন করেছি তোমার নবীর প্রতি যাকে তুমি প্রেরণ করেছ। (ইসলামিক ফাউন্ডেশন ৬৬৩৪, ইসলামিক সেন্টার ৬৬৮৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6883,
			"arabicnumber": "2710.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৬, আন্তর্জাতিক নাম্বারঃ ২৭১০ ৬৭৭৬-(…/...) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীসটি বর্ণনা করেছেন। তিনি মানসূর বর্ণিত হাদীসটি সম্পূর্ণ বর্ণনা করেছেন। আর হুসায়ন এর হাদীসে যদি সে সকালে উপনীত হয় তাহলে সে কল্যাণপ্রাপ্ত হবে’ কথাটি বর্ধিত বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৩৫, ইসলামিক সেন্টার ৬৬৮৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6884,
			"arabicnumber": "2710.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৭, আন্তর্জাতিক নাম্বারঃ ২৭১০ ৬৭৭৭-(৫৭/...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক লোককে আদেশ করলেন রাত্রে সে শয্যা গ্রহণ করবে তখন সে বলবে- \"আল্ল-হুম্মা আসলামতু নাফসী ইলাইকা ওয়া ওয়াজজাহ্‌তু ওয়াজহি ইলাইকা ওয়া আল জা'তু যাহরী ইলাইকা ওয়াফাও ওয়ায্‌তু আমরী ইলাইকা রাগবাতান ওয়া রাহবাতান ইলাইকা লা- মালজাআ ওয়ালা- মান্‌জা- মিনকা ইল্লা-ইলাইকা আ-মানতু বিকিতা-বিকাল্লাযী আন্‌যালতা ওয়াবি রসূলিকাল্লাযী আরসালতা, ফা-ইন মা-তা মা-তা ‘আলাল ফিতরাহ\"। অর্থাৎ- “হে আল্লাহ। আমি আমার আত্মাকে আপনার নিকট সমর্পণ করলাম। আমার মুখমণ্ডল আপনার দিকে ফিরালাম। আমার পিঠকে আপনার নিকট দিলাম পুরস্কারের আশায় ও শাস্তির ভয়ে; আপনি ভিন্ন নেই কোন আশ্রয়স্থল আর নেই কোন মুক্তির পথ। আমি বিশ্বাস স্থাপন করেছি আপনার কিতাবের উপর যা আপনি অবতীর্ণ করেছেন এবং আপনার রসূলের প্রতি (বিশ্বাস স্থাপন করেছি) যাকে আপনি পাঠিয়েছেন।” এরপর যদি সে লোক ঐ রাতে মারা যায় তাহলে ফিতরাতের উপরই মৃত্যুবরণ করেছে (বলে গণ্য হবে)। ইবনু বাশশার (রহঃ) তার বর্ণিত হাদীসে مِنَ اللَّيْلِ রাত্রিকালে কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৬৬৩৬ ইসলামিক সেন্টার ৬৬৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6885,
			"arabicnumber": "2710.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৮, আন্তর্জাতিক নাম্বারঃ ২৭১০ ৬৭৭৮-(৫৮/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... বারা ইবনু ‘আযিব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক লোককে বললেন, ‘হে অমুক যখন তুমি তোমার বিছানায় আশ্রয় গ্রহণ করবে। এরপর আমর ইবনু মুররাহ বর্ণিত হাদীসের অবিকল বর্ণনা করলেন। কিন্তু পার্থক্য এই যে, তিনি বলেছেন, “ওয়াবি নাবিয়্যিকাল্লায়ী আরসালতা\" অর্থাৎ- “এবং আপনার সে নবীর উপর বিশ্বাস স্থাপন করেছি, যাকে আপনি প্রেরণ করেছেন।” যদি তুমি সে রাত্রে মৃত্যুবরণ করো তাহলে ফিতরাতের উপরই মৃত্যুবরণ করলে। আর যদি ভোরে উপনীত হও তবে তুমি কল্যাণপ্রাপ্ত হবে। (ইসলামিক ফাউন্ডেশন ৬৬৩৭, ইসলামিক সেন্টার ৬৬৯১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6886,
			"arabicnumber": "2710.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৭৯, আন্তর্জাতিক নাম্বারঃ ২৭১০ ৬৭৭৯-(.../...) ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) থেকে বর্ণিত। তিনি বলেছেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক লোককে আদেশ করলেন। তারপর তার অবিকল। কিন্তু তিনি \"যদি তুমি ভোরে উপনীত হও তবে তুমি কল্যাণপ্রাপ্ত হবে\" কথাটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৬৬৩৮, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6887,
			"arabicnumber": "2711",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮০, আন্তর্জাতিক নাম্বারঃ ২৭১১ ৬৭৮০-(৫৯/২৭১১) উবাইদুল্লাহ ইবনু মুআয (রহঃ) ..... বারা ইবনু আযিব (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শয্যগ্রহণ করতেন তখন তিনি বলতেন, \"আল্লা-হুম্মা বিসমিকা আহইয়া- ওয়া বিসমিকা আমুতু\" অর্থাৎ- \"হে আল্লাহ! আমি তোমার নামেই জীবিত আছি আর তোমার নামেই মৃত্যুবরণ করছি।\" আর যখন তিনি ঘুম হতে সজাগ হতেন তখন বলতেন, \"আলহামদু লিল্লা-হিল্লায়ী আহইয়া-না- বা’দা মা- আমা-তানা- ওয়া ইলাইহিন নুশুর\" অর্থাৎ- \"সকল প্রশংসা আল্লাহর জন্যই যিনি আমাদেরকে মৃত্যুবরণের পর জীবিত করছেন। আর তার দিকেই প্রত্যাবর্তন।\" (ইসলামিক ফাউন্ডেশন ৬৬৩৯, ইসলামিক সেন্টার ৬৬৯২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6888,
			"arabicnumber": "2712",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮১, আন্তর্জাতিক নাম্বারঃ ২৭১২ ৬৭৮১-(৬০/২৭১২) উকবাহ ইবনু মুকরিম আল আম্মী ও আবু বাকর ইবনু নাফি’ (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। তিনি এক লোককে আদেশ করলেন, যখন শয্যগ্রহণ করবে তখন বলবে, \"আল্ল-হুম্মাখ লাকতা নাফসী ওয়া আনতা তাওয়াফ্‌ফা-হা- লাকা মামা-তুহা ওয়া মাহইয়া-হা ইন্‌ আহ ইয়াইতাহা- ফাহফাযহা- ওয়া ইন্‌ আমাত্‌তাহা- ফাগফির লাহা- আল্ল-হুম্মা ইন্নী আস্আলুকাল আ-ফিয়াহ\" অর্থাৎ- \"হে আল্লাহ! আপনি আমার জীবন সৃষ্টি করেছেন এবং আপনিই তাকে (আমার জীবনকে) মৃত্যুদান করেন। আপনার কাছে (নাফসের) জীবন ও মরণ। যদি আপনি একে জীবিত রাখেন তাহলে আপনি এর হিফাযাত করুন। আর যদি আপনি এর মৃত্যু দান করেন তাহলে একে ক্ষমা করে দিন। হে আল্লাহ! আমি আপনার কাছে সুস্থতা প্রার্থনা করছি\"। তখন সে লোকটি তাকে জিজ্ঞেস করলেন, আপনি তা উমর (রাযিঃ) হতে শুনছেন? তিনি বললেন, উমার এর চেয়ে যিনি উত্তম (অর্থাৎ-) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি। ইবনু নাফি’ (রহঃ) তার বর্ণনায় বলেছেন, আবদুল্লাহ ইবনু হারিস (রহঃ) হতে এবং তিনি سَمِعْتُ (আমাকে শুনেছি) শব্দটি বলেননি। (ইসলামিক ফাউন্ডেশন ৬৬৪০, ইসলামিক সেন্টার ৬৬৯৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6889,
			"arabicnumber": "2713.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮২, আন্তর্জাতিক নাম্বারঃ ২৭১৩ ৬৭৮২-(৬১/২৭১৩) যুহায়র ইবনু হারব (রহঃ) ..... সুহায়ল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবু সালিহ আমাদেরকে আদেশ করতেন, যখন আমাদের কেউ ঘুমাতে যায় সে যেন ডান পার্শ্বে কাত হয়ে শয্যগ্রহণ করে। এরপর যেন বলে, \"আল্ল-হুম্মা রব্বাস সামা-ওয়া-তি ওয়া রব্বাল আরযি ওয়া রব্বাল আরশিল আযীম, রব্বানা ওয়া রব্বা কুল্লি শাইয়িন্‌ ফা-লিকাল হাব্বি ওয়ান্‌ নাওয়া ওয়া মুনযিলাত তাওরা-তি ওয়াল ইনজীলি ওয়াল ফুরকানি আউযুবিকা মিন শাররি কুল্লি শাইয়িন আনতা আ-খিযুন বিনা-সিয়াতিহি, আল্ল-হুম্মা আন্‌তাল আওওয়ালু ফালাইসা কাবলাকা শাইউন ওয়া আনতাল আ-খিরু ফালাইসা বা'দাকা শাইউন ওয়া আনতায যা-হিরু ফালাইসা ফাওকাকা শাইউন ওয়া আনতাল বা-তিনু ফালাইসা দূনাকা শাইউন ইকযি আন্নাদ দাইনা ওয়া আগনিনা- মিনাল ফাক্‌রি\" অর্থাৎ- \"হে আল্লাহ! আপনি আকাশমণ্ডলী, জমিন ও মহান আরশের রব। আমাদের রব ও সব কিছুর পালনকর্তা। আপনি শস্য ও বীজের সৃষ্টিকর্তা, আপনি তাওরাত, ইনজীল ও কুরআনের অবতীর্ণকারী। আমি আপনার নিকট সকল বিষয়ের খারাবী হতে আশ্রয় চাই। আপনিই একমাত্র সব বিষয়ের পরিচর্যাকারী। হে আল্লাহ! আপনিই শুরু, আপনার আগে কোন কিছুর অস্তিত্ব নেই এবং আপনিই শেষ, আপনার পরে কোন কিছু নেই। আপনিই প্রকাশ, আপনার উর্ধ্বে কেউ নেই। আপনিই বাতিন, আপনার অগোচরে কিছু নেই। আমাদের ঋণকে আদায় করে দিন এবং অভাব থেকে আমাদেরকে সচ্ছলতা দিন।\" তিনি (আবু সালিহ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আবূ হুরাইরাহ্ (রাযিঃ) এর সূত্রেও এ হাদীসটি রিওয়ায়াত করতেন। (ইসলামিক ফাউন্ডেশন ৬৬৪১, ইসলামিক সেন্টার ৬৬৯৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6890,
			"arabicnumber": "2713.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৩, আন্তর্জাতিক নাম্বারঃ ২৭১৩ ৬৭৮৩-(৬২/...) আবদুল হামীদ ইবনু বায়ান আল ওয়াসিতী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের আদেশ করতেন যে, যখন আমরা শয্যাগ্রহণ করি তখন যেন পড়ি। তারপর জারীর এর হাদীসের হুবহু হাদীস। আর তিনি বলেছেন, সকল জীবের অকল্যাণ হতে যাদের ধারণকারী আপনিই। (ইসলামিক ফাউন্ডেশন ৬৬৪২, ইসলামিক সেন্টার ৬৬৯৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6891,
			"arabicnumber": "2713.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৪, আন্তর্জাতিক নাম্বারঃ ২৭১৩ ৬৭৮৪-(৬৩/...) আবু বাকর ইবনু আবু শাইবাহ ও আবু কুরায়ব মুহাম্মাদ ইবনুল আলা (রহঃ) ..... আবূ হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ফাতিমাহ্ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে একজন খাদিমের জন্য আবেদন করলেন। তখন তিনি তাকে বললেনঃ তুমি বলো, \"সাত আসমানের রব হে আল্লাহ! .....\" (তারপর) সুহায়ল এর পিতা থেকে বর্ণিত হাদীসের অবিকল উল্লেখ করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৪৩, ইসলামিক সেন্টার ৬৬৯৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6892,
			"arabicnumber": "2714.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৫, আন্তর্জাতিক নাম্বারঃ ২৭১৪ ৬৭৮৫-(৬৪/২৭১৪) ইসহাক ইবনু মূসা আল আনসারী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন তার শয্যগ্রহণ করতে বিছানায় আসে, সে যেন তার কাপড়ের আঁচল দিয়ে বিছানাটা ঝাড়া দিয়ে নেয় এবং বিসমিল্লাহ’ পাঠ করে নেয়। কেননা সে জানে না যে, বিছানা ছাড়ার পর তার বিছানায় কি আছে। তারপর যখন সে শয্যগ্রহণ করতে ইচ্ছা করে তখন যেন ডান কাত হয়ে শয্যগ্রহণ করে। এরপর সে যেন বলে, \"সুবহা- নাকাল্লা-হুম্মা রব্বী বিকা ওয়া যা’তু জামবী ওয়াবিকা আর ফা'উহু ইন্‌ আমসাক্‌তা নাফসী ফাগফির লাহা- ওয়া ইন্‌ আরসালতাহা- ফাহফাযহা- বিমা- তাহফাযু বিহি ইবা-দাকাস সলিহীন\" অর্থাৎ- \"আপনার পবিত্রতা ঘোষণা করছি, হে আমার প্রতিপালক! আপনার নামেই আমি আমার পার্শ্ব (দেহ) রাখলাম, আপনার নামেই তা তুলব। আপনি যদি আমার প্রাণ আটকিয়ে রাখে তাহলে আমাকে মাফ করে দিন। আর যদি আপনি তাকে উঠবার অবকাশ দেন তাহলে তাকে রক্ষা করুন, যেমন আপনি আপনার নেক বান্দাদের রক্ষা করে থাকেন।\" (ইসলামিক ফাউন্ডেশন ৬৬৪৪, ইসলামিক সেন্টার ৬৬৯৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6893,
			"arabicnumber": "2714.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৬, আন্তর্জাতিক নাম্বারঃ ২৭১৪ ৬৭৮৬-(.../...) আবূ কুরায়ব (রহঃ) ..... উবাইদুল্লাহ ইবনু উমর (রহঃ) এ সূত্রে হুবহু হাদীস বর্ণনা করেছেন। তিনি বলেছেন, এরপর সে যেন বলে, “বিস্‌মিকা রব্বী ওয়াযা'তু জামবী ফা ইন্‌ আহ ইয়াইতা নাফসী ফারহামহা” অর্থাৎ- \"হে আমার রব! তোমার নামে আমার পার্শ্ব রাখলাম। যদি আপনি আমাকে জীবিত রাখেন তাহলে তার উপর দয়া করুন।\" (ইসলামিক ফাউন্ডেশন ৬৬৪৫, ইসলামিক সেন্টার ৬৬৯৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6894,
			"arabicnumber": "2715",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৭, আন্তর্জাতিক নাম্বারঃ ২৭১৫ ৬৭৮৭-(৬৪/২৭১৫) আবু বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বিছানায় আশ্রয় গ্রহণ করতেন তখন তিনি বলতেন, আলহামদু লিল্লা-হিল্লাযী আত- আমানা ওয়া সাকা-না- ওয়া কাফা-না- ওয়া আ-ওয়া-না- ফাকাম মিম্মান লা-কা-ফিয়া লাহু ওয়ালা- মু’বিয়া\" অর্থাৎ “সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদের জীবিকা দিয়েছেন, পানি পান করিয়েছেন, তিনি আমাদেরকে দায়িত্ব বহন করেছেন, আমাদের আশ্রয় দিয়েছেন। এমন অনেক আছে যাদের জন্য কোন দায়িত্ব বহনকারী নেই, আশ্রয় দাতাও নেই।\" (ইসলামিক ফাউন্ডেশন ৬৬৪৬, ইসলামিক সেন্টার ৬৬৯৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6895,
			"arabicnumber": "2716.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৮, আন্তর্জাতিক নাম্বারঃ ২৭১৬ ৬৭৮৮-(৬৫/২৭১৬) ইয়াহইয়া ইবনু ইয়াহইয়া, ইসহাক ইবনু ইবরাহীম (রহঃ) ..... ফারওয়াহ্ ইবনু নাওফাল আল আশজাঈ থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে প্রশ্ন করলাম, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর নিকট কি কি দুআ করতেন? তিনি আয়িশাহ (রাযিঃ) জবাব দিলেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলতেন, \"আল্লহুম্মা ইন্নী আউযুবিকা মিন শাররি মা- আমিলতু ওয়ামিন শারি মা- লাম আমল\" অর্থাৎ- “হে আল্লাহ! আমি আপনার নিকট সেসব কর্মের খারাবী থেকে আশ্রয় চাই যা আমি করেছি এবং তাথেকেও যা আমি করিনি।\" (ইসলামিক ফাউন্ডেশন ৬৬৪৭, ইসলামিক সেন্টার ৬৭০০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6896,
			"arabicnumber": "2716.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৮৯, আন্তর্জাতিক নাম্বারঃ ২৭১৬ ৬৭৮৯-(…/...) আবু বকর ইবনু আবূ শাইবাহ ও আবু কুরায়ব (রহঃ) ..... ফারওয়াহ ইবনু নাওফাল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আয়িশাহ (রাযিঃ) কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দু’আ সম্পর্কে প্রশ্ন করলাম। তিনি [আয়িশাহ (রাযিঃ)] বললেন, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলতেনঃ আল্ল-হুম্মা ইন্নী আউযুবিকা মিন শাররি মা আমিলতু ওয়া মিন শাররি মা- লাম আ’মাল” অর্থাৎ- “হে আল্লাহ! আমি আপনার নিকট সেসব আমলের খারাবী হতে আশ্রয় চাই যা আমি করেছি এবং যা আমি করিনি।\" (ইসলামিক ফাউন্ডেশন ৬৬৪৮, ইসলামিক সেন্টার ৬৭০১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6897,
			"arabicnumber": "2716.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯০, আন্তর্জাতিক নাম্বারঃ ২৭১৬ ৬৭৯০-(.../...) মুহাম্মাদ ইবনুল মুসান্না, ইবনু বাশশার ও মুহাম্মাদ ইবনু আমর ইবনু জাবালাহ্ (রহঃ) ..... হুসায়ন (রহঃ) হতে এ সূত্রে অবিকল বর্ণনা করেছেন। তবে মুহাম্মাদ ইবনু জাফারের হাদীসে \"ওয়া মিন্‌ শারি মা- লাম আমল\" অর্থাৎ- \"এবং আমি যা করিনি তার খারাবী হতে\" কথাটি উল্লেখ নেই। (ইসলামিক ফাউন্ডেশন ৬৬৪৯, ইসলামিক সেন্টার ৬৭০২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6898,
			"arabicnumber": "2716.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯১, আন্তর্জাতিক নাম্বারঃ ২৭১৬ ৬৭৯১-(৬৬/...) ‘আবদুল্লাহ ইবনু হাশিম (রহঃ) ..... আয়িশাহ্ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি তাঁর দু’আয় বলতেন, \"আল্ল-হুম্মা ইন্নী আউযুবিকা মিন্‌ শাররি মা- আমিলতু ওয়া মিন্‌ শারি মা লাম আ'মাল\" অর্থাৎ- \"হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই সেসব কর্মের খারাবী হতে, যা আমি করেছি এবং যা আমি করিনি তা থেকেও।\" (ইসলামিক ফাউন্ডেশন ৬৬৫০, ইসলামিক সেন্টার ৬৭০৩) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। প্রকৃত মুসলিম ব্যক্তির উচিত যে, সে যেন সকল প্রকারের পাপ বর্জন করে। কেননা পাপ হলো তার অমঙ্গল ও দুর্ভাগ্য সৃষ্টি করার উপাদান। ২। মানুষ নিজের পাপের অমঙ্গল হতে সুরক্ষিত হওয়ার জন্য পরাক্রমশালী আল্লাহর শরণ নেওয়ার প্রতি এই হাদীসটি উৎসাহ প্রদান করে। কেননা মানুষ তো তার সমস্ত অবস্থায় তার সৃষ্টিকর্তা আল্লাহর মুখাপেক্ষী। ৩। এই হাদীসটির দ্বারা প্রমাণিত হয় যে, মঙ্গলদায়ক আশ্রয়স্থল হলো এক মাত্র পরাক্রমশালী মহান আল্লাহ, সৃষ্টি জগতের অন্য কোনো ব্যক্তি বা বস্তু নয়।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6899,
			"arabicnumber": "2717",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯২, আন্তর্জাতিক নাম্বারঃ ২৭১৭ ৬৭৯২-(৬৭/২৭১৭) হাজ্জাজ ইবনু শাইর (রহঃ) .... ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ “আল্ল-হুম্মা লাকা আসলামতু ওয়াবিকা আ-মানতু ওয়া আলাইকা তাওয়াক্কালতু ওয়া ইলাইকা আনাব্‌তু ওয়াবিকা খ-সামতু আল্ল-হুম্মা ইন্নী আউযু বিইয্‌যাতিকা লা- ইলা-হা ইল্লা- আনতা আন তুযিল্লানী আনতাল হাইয়্যুল্লায়ী লা- ইয়ামতু ওয়াল জিননু ওয়াল ইন্‌সু ইয়ামূতুন\", অর্থাৎ- \"হে আল্লাহ! আমি আপনার কাছেই আত্মসমর্পণ করেছি, আপনার প্রতিই বিশ্বাস স্থাপন করেছি, আপনার উপরই ভরসা করেছি, আপনার দিকেই ফিরে যাচ্ছি এবং আপনার সহযোগিতায়ই শত্রুদের বিপক্ষে যুদ্ধ করেছি। হে আল্লাহ! আপনার সম্মানের নিকট আশ্রয় চাচ্ছি। আপনি ছাড়া কোন মা’বূদ নেই। আপনি আমাকে বিভ্রান্তির পথ থেকে বাঁচান। আপনি চিরঞ্জীব সত্তা, যার মৃত্যু নেই। আর জিন জাতি ও মানব জাতি মারা যাবে।\" (ইসলামিক ফাউন্ডেশন ৬৬৫১, ইসলামিক সেন্টার ৬৭০৪)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6900,
			"arabicnumber": "2718",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৩, আন্তর্জাতিক নাম্বারঃ ২৭১৮ ৬৭৯৩-(৬৮/২৭১৮) আবূ তাহির (রহঃ) ….. আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। (তিনি বলেন,) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ভ্রমণে থাকতেন তখন সকালবেলা বলতেন, “সামি’আ সা-মিউন বিহামদিল্লা-হি ওয়া হুসনি বালা-য়িহি ‘আলাইনা- রব্বানা- স-হিব্‌না- ওয়া আফযিল আলাইনা- 'আ-য়িযান্‌ রিল্লা-হি মিনান্না-র\" অর্থাৎ- “শ্রবণকারী শ্রবণ করুক এবং আল্লাহর দেয়া কল্যাণ ও নি’আমাতের উপর আমাদের প্রশংসার সাক্ষী থাকুক। হে আমাদের রব! আপনি আমাদের সাখী হোন এবং আমাদের উপর অনুগ্রহ দান করুন। আমি মহান আল্লাহর নিকট জাহান্নাম হতে আশ্রয় চাই।\" (ইসলামিক ফাউন্ডেশন ৬৬৫২, ইসলামিক সেন্টার ৬৭০৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6901,
			"arabicnumber": "2719.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৪, আন্তর্জাতিক নাম্বারঃ ২৭১৯ ৬৭৯৪-(৭০/২৭১৯) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... আবু মূসা আল আশ’আরী (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি এ দু’আর মাধ্যমে আল্লাহর নিকট প্রার্থনা করতেন, “আল্ল-হুম্মাগ ফির্‌লী খতীআতী ওয়া জাহ্‌লী ওয়া ইসরা-ফী কী আমরী ওয়ামা- আনতা আ’লামু বিহি মিন্নী, আল্ল-হুম্মাগ ফিরলী জিদ্দী ওয়া হাযলী ওয়া খতায়ী ওয়া আমদী ওয়া কুল্লু যালিকা ইন্‌দী, আল্ল-হুম্মাগ ফিরলী মা- কদ্দামতু ওয়ামা- আখখারতু ওয়ামা- আসরারতু ওয়ামা- আ’লানতু ওয়ামা- আনতা আ’লামু বিহি মিন্নী আনতাল মুকাদ্দিমু ওয়া আন্‌তাল মুয়াখখিরু ওয়া আনতা আলা- কুল্লি শাইয়িন কদীর\" অর্থাৎ- \"হে আল্লাহ! আপনি আমার পাপ, আমার অজ্ঞতা ও আমার কাজের সীমালঙ্ঘনকে মার্জনা করে দিন। আপনি এ বিষয়ে আমার চেয়ে সর্বাধিক জ্ঞাত। হে আল্লাহ! আমাকে মাফ করে দিন আমার আন্তরিকতাপূর্ণ ও রসিকতামূলক অপরাধ এবং আমার ইচ্ছাকৃত ও ভুলক্রমে সব রকমের অপরাধগুলো (যা আমি করেছি)। হে আল্লাহ! মাফ করে দিন যা আমি আগে করে ফেলেছি এবং যা আমি পরে করব, যা আমি গোপনে করেছি এবং যা প্রকাশ্যে করেছি। আর আপনি আমার চাইতে আমার সম্পর্কে সর্বাধিক জ্ঞাত। আপনিই একমাত্র অগ্রবর্তী এবং আপনিই একমাত্র পরবর্তী। আপনি সব বিষয়ের উপর ক্ষমতাবান।\" (ইসলামিক ফাউন্ডেশন ৬৬৫৩, ইসলামিক সেন্টার ৬৭০৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6902,
			"arabicnumber": "2719.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৫, আন্তর্জাতিক নাম্বারঃ ২৭১৯ ৬৭৯৫-(.../...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... শুবাহ (রহঃ) এর সানাদে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৫৪, ইসলামিক সেন্টার ৬৭০৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6903,
			"arabicnumber": "2720",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৬, আন্তর্জাতিক নাম্বারঃ ২৭২০ ৬৭৯৬-(৭১/২৭২০) ইবরাহীম ইবনু দীনার (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ “আল্ল-হুম্মা আসলিহলী দীনিয়াল্লিয়ী হুওয়া ইসমাতু আমরী ওয়া আস্‌লিহলী দুন্‌ইয়াল্লাতী ফীহা মা’আ-শী ওয়া আসলিহলী আ-খিরতিল্লাতী ফীহা মাআ-দী ওয়াজ আলিল হায়া-তা যিয়া-দাতান্‌ লী ফী কুল্লি খইরি ওয়াজ আলিল মাওতা রা-হাতান মিন্‌ কুল্লি শাররিন\" অর্থাৎ- \"হে আল্লাহ! আপনি আমার দীন পরিশুদ্ধ করে দিন, যে দীনই আমার নিরাপত্তা। আপনি শুদ্ধ করে দিন আমার দুনিয়াকে, যেথায় আমার জীবনোপকরণ রয়েছে। আপনি সংশোধন করে দিন আমার আখিরাতকে, যেখানে আমাকে প্রত্যাবর্তন করতে হবে। আপনি আমার আয়ুষ্কালকে বৃদ্ধি করে দিন প্রত্যেকটি ভালো কর্মের জন্য এবং আপনি আমার মরণকে বিশ্রামাগার বানিয়ে দিন সব প্রকার খারাবী হতে।\" (ইসলামিক ফাউন্ডেশন ৬৬৫৫, ইসলামিক সেন্টার ৬৭০৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6904,
			"arabicnumber": "2721.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৭, আন্তর্জাতিক নাম্বারঃ ২৭২১ ৬৭৯৭-(৭২/২৭২১) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আবদুল্লাহ (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি এ বলে দুআ করতেন, “আল্ল-হুম্মা ইন্নী আস্আলুকাল হুদা ওয়াত তুকা ওয়াল “আফা-ফা ওয়াল গিনা” অর্থাৎ- \"হে আল্লাহ! আমি আপনার নিকট পথনির্দেশ, আল্লাহভীতি, চারিত্রিক উৎকর্ষতা ও সচ্ছলতার জন্য দুআ করছি।\" (ইসলামিক ফাউন্ডেশন ৬৬৫৬, ইসলামিক সেন্টার ৬৭০৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6905,
			"arabicnumber": "2721.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৮, আন্তর্জাতিক নাম্বারঃ ২৭২১ ৬৭৯৮-(.../...) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ...... ইবনু ইসহাক (রহঃ) এর সানাদে এ সূত্রে হুবহু হাদীস বর্ণনা করেছেন। কিন্তু পার্থক্য এটুকু যে, ইবনুল মুসান্না তার বর্ণিত হাদীসে এর স্থলে (হারাম থেকে পবিত্রতা) শব্দ বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৫৭, ইসলামিক সেন্টার ৬৭১০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6906,
			"arabicnumber": "2722",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৭৯৯, আন্তর্জাতিক নাম্বারঃ ২৭২২ ৬৭৯৯-(৭৩/২৭২২) আবূ বাকর ইবনু আবূ শাইবাহ্, ইসহাক ইবনু ইব্রাহীম ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... যায়দ ইবনু আরকাম (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি তোমাদের নিকট তেমনই বলব যেমনটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলতেনঃ \"আল্ল-হুম্মা ইন্নী আউযুবিকা মিনাল আজ্‌যি ওয়াল কাসালি ওয়াল জুৱ্‌নি ওয়াল বুখ্‌লি ওয়াল হারামি ওয়া আযা-বিল কবরি, আল্ল-হুম্মা আ-তি নাফসী তাকওয়া-হা ওয়াযাক্কিহা- আনতা খইরু মান্‌ যাককা-হা আনতা ওয়ালী ইউহা- ওয়া মাওলা-হা-, আল্ল-হুম্মা ইন্নী আউযুবিকা মিন ইলমিন লা- ইয়ান্‌ফা'উ ওয়ামিন কলবিনু লা- ইয়াখশাউ ওয়ামিন নাফসিন লা- তাশবাউ ওয়ামিন দা’ওয়াতিন লা- ইউসতাজা-বু লাহা-” অর্থাৎ- \"হে আল্লাহ! আমি আপনার নিকট পানাহ চাই অপারগতা, অলসতা, ভীরুতা, বখিলতা, বার্ধক্যতা এবং কবরের শাস্তি থেকে। হে আল্লাহ! আপনি আমার অন্তরে পরহেযগারিতা দান করুন এবং একে সংশোধন করে দিন। আপনি একমাত্র সর্বোত্তম সংশোধনকারী এবং আপনিই একমাত্র তার মালিক ও আশ্রয়স্থল। হে আল্লাহ! আমি আপনার নিকট পানাহ চাই এমন ইলম হতে যা কোন উপকারে আসবে না ও এমন অন্তঃকরণ থেকে যা আল্লাহর ভয়ে ভীত হয় না; এমন আত্মা থেকে যা কক্ষনও তৃপ্ত হয় না। আর এমন দু’আ থেকে যা কবুল হয় না।\" (ইসলামিক ফাউন্ডেশন ৬৬৫৮, ইসলামিক সেন্টার ৬৭১১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6907,
			"arabicnumber": "2723.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০০, আন্তর্জাতিক নাম্বারঃ ২৭২৩ ৬৮০০-(৭৪/২৭২৩) কুতাইবাহ্ ইবনু সাঈদ (রহঃ) ..... আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন সন্ধ্যা হত তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ “আম্‌সাইনা- ওয়া আম্‌সাল মুল্‌কু লিল্লা-হি ওয়াল হাম্‌দু লিল্লা-হি লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা-শারীকা লাহু”, অর্থাৎ- “আমরা সন্ধ্যায় উপনীত হয়েছি এবং আল্লাহর রাজ্যও, প্রশংসা একমাত্র আল্লাহর জন্য, তিনি ছাড়া কোন মা’বুদ নেই। তিনি একক সত্তা, তার কোন শারীক নেই।” হাসান (রহঃ) বলেন, আমাকে যুবায়দ (রহঃ) হাদীস বর্ণনা করেন যে, তিনি ইবরাহীম (রহঃ) হতে এ দু’আটি মুখস্থ করেছেনঃ “লাহুল মুল্‌কু ওয়ালাহুল হাম্‌দু ওয়াহুয়া আলা- কুল্লি শাইয়িন কদীর, আল্ল-হুম্মা আসআলুকা খইরা হা-যিহিল লাইলাতি ওয়া আউযুবিকা মিন্‌ শাররি হা-যিহিল লাইলাতি ওয়া শাররি মা-বাদাহা আল্ল-হুম্মা ইন্নী আউযুবিকা মিনাল কাসালি ওয়া সূয়িল কিবারি, আল্ল-হুম্মা ইন্নী আউযুবিকা মিন আযা-বিন ফিন্না-রি ওয়া আযা-বিন ফিল কবরি।” অর্থাৎ, “রাজত্ব তার মালিকানাধীন, সকল প্রশংসা তারই, তিনিই সকল কিছুর উপর ক্ষমতবান। হে আল্লাহ! আমি আপনার নিকট এ রাতের কল্যাণ প্রত্যাশা করি এবং আশ্রয় চাই এ রাতের খারাবী হতে এবং এর পরবর্তী রাতের অনিষ্ট থেকেও। হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই অলসতা থেকে ও অহংকারের খারাবী থেকে। হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই জাহান্নামের শাস্তি থেকে এবং কবরের শাস্তি থেকে।\" (ইসলামিক ফাউন্ডেশন ৬৬৫৯, ইসলামিক সেন্টার ৬৭১২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6908,
			"arabicnumber": "2723.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০১, আন্তর্জাতিক নাম্বারঃ ২৭২৩ ৬৮০১-(৭৫/...) উসমান ইবনু আবু শাইবাহ (রহঃ) ..... ‘আবদুল্লাহ (রায়িঃ) থেকে বর্ণিত। তিনি বলেন, যখন সন্ধ্যা হয়ে যেত সে সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ “আম্‌সাইনা- ওয়া আমসাল মুল্‌কু লিল্লা-হি ওয়াল হামদু লিল্লা-হি লা- ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা- শারীকা লাহু”, অর্থাৎ- “আমরা সন্ধ্যায় উপনীত হয়েছি এবং আল্লাহর রাজ্যও সন্ধ্যায় উপনীত হয়েছে। আল্লাহর জন্যই সকল কৃতজ্ঞতা। আল্লাহ ছাড়া প্রকৃতপক্ষে কোন মা’বুদ নেই। তিনি অদ্বিতীয়, তার কোন অংশীদার নেই।” রাবী বলেন যে, তিনি তার দু’আর মধ্যে বলেছেন, \"লাহুল মুলকু ওয়ালাহুল হাম্‌দু ওয়াহুয়া আলা- কুল্লি শাইয়িন কদীর, রব্বি আস্আলুকা খইরা মা- ফী হা-যিহিল লাইলাতি ওয়া খইরা মা- বাদাহা- ওয়া আউযুবিকা মিন শাররি মা- ফী হাযিহিল লাইলাতি ওয়া শাররি মা- বাদাহা- রব্বি আউযুবিকা মিনাল কাসালি ওয়া সুয়িল কিবারি রব্বি আউযুবিকা মিন আযা-বিন ফিন্‌না-রি ওয়া আযা-বিন ফিল কবরি”, অর্থাৎ- “রাজত্ব তারই, প্রশংসা তারই এবং তিনিই সব বিষয়ের উপর ক্ষমতাবান। হে আমার রব! আমি আপনার নিকট কল্যাণ চাই এ রাতের এবং পরবর্তী রাতেরও। আর আমি আপনার নিকট আশ্রয় চাই এ রাত্রের খারাবী হতে এবং এর পরবর্তী রাতের খারাবী হতেও। হে আমার প্রতিপালক! আমি আপনার নিকট আশ্রয় চাই অলসতা, অহঙ্কারের অশুভ পরিণতি থেকে। হে আমার প্রতিপালক! আমি আপনার নিকট আশ্রয় চাই জাহান্নাম ও কবরের শাস্তি হতে।\" আর যখন ভোর হতো, তিনি বলতেনঃ “আসবাহনা- ওয়া আসবাহাল মুলকু লিল্লা-হি\", অর্থাৎ “আমরা ভোরে পৌছেছি এবং আল্লাহর রাজ্যও ভোরে পৌছেছে।\" (ইসলামিক ফাউন্ডেশন ৬৬৬০, ইসলামিক সেন্টার ৬৭১৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6909,
			"arabicnumber": "2723.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০২, আন্তর্জাতিক নাম্বারঃ ২৭২৩ ৬৮০২-(৭৬/...) আবু বকর ইবনু আবূ শাইবাহ (রহঃ) ..... ‘আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, যখন সন্ধ্যা হতো তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ \"أَمْسَيْـنَا وَأَمْسَـى الْمُـلْكُ لِلَّهِ، وَالحَمْدُ لِلَّهِ، لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ، لاَ شَرِيْكَ لَهُ، اَللَّهُمََّ! إِنِّيْ أَسْأَلُكَ مِنْ خَيْرِ هَذِهِ اللَّيْلَةِ وخَـيْرِ مَا فِيْهَا، وَأَعـوْذُ بِكَ مِنْ شَـرِّها وَشَرِّ مَا فِيْهَـا، اَللَّهُمََّ! إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَالْهَرَمِ، وَسُوْءِ الْكِبَرِ، وَفِتْنَةِ الدُّنْيَا، وَعَذَابِ الْقَبْرِ\". “আমসাইনা- ওয়া আমসাল মুল্‌কু লিল্লা-হি ওয়াল হামদু লিল্লা-হি লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা- শারীকা লাহু, আল্ল-হুম্মা ইন্নী আস্আলুকা মিন্‌ খইরি হাযিহিল লাইলাতি ওয়া খইরি মা- ফীহা- ওয়া আউযুবিকা মিন্‌ শাররিহা- ওয়া শাররি মা- ফীহা- আল্ল-হুম্মা ইন্নী আউযুবিকা মিনাল কাসালি ওয়াল হারামি ওয়া সুয়িল কিবারি ওয়া ফিতনাতিদ দুনইয়া ওয়া আযা-বিন ফিল কবরি\", অর্থাৎ- \"আমরা সন্ধ্যায় পৌছেছি এবং পৃথিবী আল্লাহর জন্য সন্ধ্যায় পৌছেছে। সকল প্রকার প্রশংসা আল্লাহরই। আল্লাহ ছাড়া কোন মা’বূদ নেই। তিনি অদ্বিতীয়, তার কোন অংশীদার নেই। হে আল্লাহ! আমি আপনার নিকট কল্যাণ চাই এ রাত্রের ও তার পরবর্তী রাত্রের এবং আমি আপনার নিকট আশ্রয় চাই এ রাত্র ও এর পরবর্তী রাত্রের খারাবী হতে। হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই অলসতা, বার্ধক্য, অহঙ্কারের খারাবী দুনিয়ার ফিতনাহ্ ও কবরের শাস্তি হতে।” হাসান ইবনু উবাইদুল্লাহ (রহঃ) বলেছেন, যুবায়দ (রহঃ) আবদুল্লাহ (রাযিঃ) এর সানাদে মারফু সূত্রে একটু বর্ধিত বলেছেন। তিনি বলেন, “লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু লা- শারীকা লাহু লাহুল মুল্‌কু ওয়ালাহুল হামদু ওয়াহুয়া আলা- কুল্লি শাইয়িন কদীর\", অর্থাৎ \"আল্লাহ ভিন্ন অন্য কোন মা’বূদ নেই। তিনি অদ্বিতীয়, তার কোন অংশীদার নেই। রাজত্ব তারই, প্রশংসা তারই এবং তিনিই সকল বিষয়ের উপর ক্ষমতাবান।\" (ইসলামিক ফাউন্ডেশন ৬৬৬১, ইসলামিক সেন্টার ৬৭১৪) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। মুসলিম ব্যক্তির উচিত যে, সে যেন রাত এবং দিনে উপনীত হয় আল্লাহর জিকিরের মাধ্যমে। এবং সে যেন রাত এবং দিন শেষও করে আল্লাহর জিকিরের মাধ্যমে। কেননা এরই উপর নির্ভর করে মানুষের স্বাস্থ্য, সুখ, শান্তি এবং অনাময় ও সুস্থতা। তাই মুসলিম ব্যক্তি যেন প্রতিদিন সকাল এবং সন্ধ্যার সময় পঠনীয় জিকিরগুলি পাঠ করে। ২। সন্ধ্যার পঠনীয় জিকিরগুলি সন্ধ্যার সময় পাঠ করতে হয়। আর সকালের পঠনীয় জিকিরগুলি প্রভাতে পাঠ করতে হয়। ৩। সন্ধাবেলায় পঠনীয় জিকিরগুলি পাঠ করার সময়ের ব্যাপারে কতকগুলি উক্তি রয়েছে। সেই উক্তিগুলির মধ্যে থেকে একটি উক্তি হলো এই যে, সন্ধাবেলায় পঠনীয় জিকিরগুলি পাঠ করার সময় হলো সূর্যাস্তের পর। মনে হচ্ছে এই উক্তিটিই বেশি সঠিক যেহেতু উল্লিখিত জিকিরটির মধ্যে বলা হয়েছে “এই রাতের” কথা। অর্থাৎ هَذِهِ اللَّيْلَةِ বলা হয়েছে: এই রাতের, সুতরাং “এই ” শব্দটি নির্দেশকারী বা নির্দেশক সর্বনাম। “এই ” শব্দটির দ্বারা একটি নির্দিষ্ট বস্তুর প্রতি ইঙ্গিত করা হয়। কেননা নির্দেশকারী বা নির্দেশক সর্বনামের দ্বারা কোনো একটি নির্দিষ্ট বস্তুর প্রতি ইঙ্গিত করা হয়। এবং সেই বস্তুটি বর্তমানে উপস্থিত আছে বলে তার অবস্থা উল্লেখ করা হয়। যেমন বলা হয়: এটি আল্লাহর উষ্ট্রী। এই ব্যাকরণটির মাধ্যমে বুঝা যায় যে, উল্লিখিত জিকিরটি ওই সময় পাঠ করতে হবে, যে সময় সন্ধাবেলার সূচনা হয়ে যাবে বা দিবাভাগ শেষ হয়ে যাবে এবং রাত্রি শুরু হয়ে যাবে ও উপস্থিত হয়ে যাবে। এই অর্থের সমর্থনে একটি বর্ণনায় এসেছে আল্লাহর রাসূল [সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] একজন সাহাবীকে বলেছেন: “তুমি যখন রমাজান মাসে উপস্থিত হয়ে যাবে, তখন রোজা রাখবে। এবং যখন সন্ধাবেলায় উপনীত হয়ে যাবে তখন রোজা ইফতার করবে। [দেখতে পারা যায় আল্লামা আল হাজিমির কিতাব: আল ইতিবার ফী আন নাসিখি ওয়াল মানসূখি মিনাল আসার, রোজার অধ্যায়, সুবহু সদিকের পর সাহারী খাওয়ার পরিচ্ছেদ]। উক্ত হাদীসে সন্ধাবেলায় উপনীত হওয়ার পর রোজা ইফতার করার উপদেশ এসেছে। তাই এর দ্বারা প্রমাণিত হয় যে, সন্ধা বলা হয় ওই সময়কে যে সময়ে সূর্যাস্তের পরে রাত্রির আরম্ভ হয়। এই বিষয়ে মহান আল্লাহই অধিক জানেন।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6910,
			"arabicnumber": "2724",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৩, আন্তর্জাতিক নাম্বারঃ ২৭২৪ ৬৮০৩-(৭৭/২৭২৪) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ “লা-ইলা-হা ইল্লাল্ল-হু ওয়াহদাহু আ ‘আযযা জুন্‌দাহু ওয়া নাসারা ‘আবদাহু ওয়া গলাবাল আহযাবা ওয়াহদাহু ফালা- শাইয়া বাদাহু\", অর্থাৎ- \"আল্লাহ ছাড়া প্রকৃতপক্ষে কোন মা’বূদ নেই। তিনি অদ্বিতীয়, তিনি তার সৈনিকদের সম্মান দিয়েছেন এবং তার বান্দাকে সহযোগিতা করেছেন। আর তিনি একাই অসংখ্য কাফির বাহিনীর উপর বিজয়ী হয়েছেন। এরপরে আর কোন কিছু নেই।\" (ইসলামিক ফাউন্ডেশন ৬৬৬২, ইসলামিক সেন্টার ৬৭১৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6911,
			"arabicnumber": "2725.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৪, আন্তর্জাতিক নাম্বারঃ ২৭২৫ ৬৮০৪-(৭৮/২৭২৫) আবূ কুরায়ব, মুহাম্মাদ ইবনুল আলী (রহঃ) ...... আলী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনঃ তুমি বলো- \"আল্ল-হুম্মাহ্‌দিনী ওয়া সাদ্‌দিদ্‌নী ওয়ায্‌কুর বিলহুদা হিদা-ইয়াতাকাত তারীকা ওয়াস্ সাদা-দি সাদা-দাস্ সাহ্‌ম\", অর্থাৎ- “হে আল্লাহ! আপনি আমাকে সঠিক পথপ্রদর্শন করুন, আমাকে সোজা পথে পরিচালিত করুন।\" তিনি আমাকে আরও বলেছেন, “আপনার হিদায়াতকে সঠিক পথের মাধ্যমে এবং তীর সোজা করাকে সরলতার মাধ্যমে স্মরণ করুন।\" (ইসলামিক ফাউন্ডেশন ৬৬৬৩, ইসলামিক সেন্টার ৬৭১৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6912,
			"arabicnumber": "2725.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৫, আন্তর্জাতিক নাম্বারঃ ২৭২৫ ৬৮০৫-(…/...) ইবনু নুমায়র (রহঃ) ..... আসিম ইবনু কুলায়ব (রাযিঃ) এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এ রকম বলতে বলেছেনঃ “আল্ল-হুম্মা ইন্নী আস্আলুকাল হুদা ওয়াস্ সাদা-দ\", অর্থাৎ- “হে আল্লাহ! আমি আপনার নিকট হিদায়াত ও সরলপথ প্রার্থনা করছি।\" অতঃপর তিনি তার মতই হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৬৪, ইসলামিক সেন্টার ৬৭১৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6913,
			"arabicnumber": "2726.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৬, আন্তর্জাতিক নাম্বারঃ ২৭২৬ ৬৮০৬-(৭৯/২৭২৬) কুতাইবাহ ইবনু সাঈদ, আমর আন্‌ নাকিদ, ইবনু আবূ উমর (রহঃ) ..... জুওয়াইরিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভোরবেলা ফজরের সালাত আদায় করে তার নিকট থেকে বের হলেন। ঐ সময় তিনি সালাতের স্থানে বসাছিলেন। এরপর তিনি চাশতের পরে ফিরে আসলেন। এমতাবস্থায়ও তিনি উপবিষ্ট ছিলেন। তিনি বললেন, আমি তোমাকে যে অবস্থায় ছেড়ে গিয়েছিলাম তুমি সে অবস্থায়ই আছ। তিনি বললেন, হ্যাঁ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি তোমার নিকট হতে রওনার পর চারটি কালিমাহ তিনবার পড়েছি। আজকে তুমি এ পর্যন্ত যা বলেছ তার সাথে ওযন করা হলে এ কালিমাহ চারটির ওযনই ভারী হবে। কালিমাগুলো এই— “সুবহা-নাল্লা-হি ওয়াবি হামদিহি আদাদা খল্‌কিহি ওয়া রিযা- নাফসিহি ওয়াযিনাতা আরশিহি ওয়ামি দা-দা কালিমা-তিহি\", অর্থাৎ- “আমি আল্লাহর প্রশংসার সাথে তার পবিত্রতা বর্ণনা করছি তার মাখলুকের সংখ্যার পরিমাণ, তার সন্তুষ্টির পরিমণ, তার আরশের ওযন পরিমাণ ও তার কালিমাসমূহের সংখ্যার পরিমাণ।\" (ইসলামিক ফাউন্ডেশন ৬৬৬৫, ইসলামিক সেন্টার ৬৭১৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6914,
			"arabicnumber": "2726.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৭, আন্তর্জাতিক নাম্বারঃ ২৭২৬ ৬৮০৭-(…/...) আবূ বাকর ইবনু আবূ শাইবাহ, আবু কুরায়ব ও ইসহাক (রহঃ) ..... জুওয়াইরিয়াহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ফজরের সালাতের সময় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট আসলেন অথবা ফজরের সালাতের পরে সকালে তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আসলেন। তারপর রাবী তার হুবহু হাদীস বর্ণনা করেন। কিন্তু তাতে পার্থক্য শুধু এই যে, তিনি বলেছেন, “সুবহা-নাল্লা-হি আদাদা খলকিহি সুবহা-নাল্ল-হি রিযা- নাফসিহি সুবহা-নাল্ল-হি যিনাতা আরশিহি সুবহা-নাল্ল-হি মিদা-দা কালিমা-তিহি\", অর্থাৎ- “আমি আল্লাহর প্রশংসার সাথে পবিত্রতা বর্ণনা করছি তার অসংখ্য মাখলুকের পরিমাণ, তার সন্তুষ্টির সমান, তার আরশের ওযন পরিমাণ এবং তার কালিমাসমূহের সংখ্যার সমান।\" (ইসলামিক ফাউন্ডেশন ৬৬৬৬, ইসলামিক সেন্টার ৬৭১৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6915,
			"arabicnumber": "2727.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৮, আন্তর্জাতিক নাম্বারঃ ২৭২৭ ৬৮০৮-(৮০/২৭২৭) মুহাম্মাদ ইবনুল মুসান্না ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আলী (রাযিঃ) থেকে বর্ণিত যে, ফাতিমাহ (রাযিঃ) চাক্কি ঘুরাতে গিয়ে তার হাতে ব্যথা অনুভব করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বন্দি এসেছিল। তাই তিনি বন্দি হতে একজন খাদিমের জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গেলেন, কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পেলেন না। তিনি আয়িশাহ (রাযিঃ) এর সাথে দেখা করে তাকে ব্যাপারটি অবহিত করলেন। অতঃপর যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আগমন করলেন তখন আয়িশাহ্ (রাযিঃ) তার নিকট ফাতিমাহ্ (রাযিঃ) এর তার নিকট আগমনের বিষয়টি অবহিত করলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট আসলেন। এমন সময় আমরা আমাদের শয্যাগ্ৰহণ করেছিলাম। অতঃপর আমরা উঠতে লাগলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, \"তোমরা তোমাদের যথাস্থানে থাকো। অতঃপর তিনি আমাদের দু’জনের মাঝে বসলেন। এমনকি আমি তার পা মুবারকের শীতলতা আমার সীনার মধ্যে অনুভব করলাম। অতঃপর তিনি বললেন, আমি কি তোমাদের এমন বিষয় শিখিয়ে দিব না, যা তোমরা প্রার্থনা করছিলে তার চেয়ে উত্তম? যে সময় তোমরা তোমাদের শয্যাগ্রহণ করবে তখন ৩৪ বার আল্ল-হু আকবার, ৩৩ বার সুবহা-নাল্ল-হ’ এবং ৩৩ বার আল হামদুলিল্লা-হ’ পড়ে নিবে। এটি তোমাদের জন্যে খাদিমের চেয়ে উত্তম।\" (ইসলামিক ফাউন্ডেশন ৬৬৬৭, ইসলামিক সেন্টার ৬৭২০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6916,
			"arabicnumber": "2727.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮০৯, আন্তর্জাতিক নাম্বারঃ ২৭২৭ ৬৮০৯-(…/...) আবূ বকর ইবনু আবূ শাইবাহ উবাইদুল্লাহ ইবনু মুআয ও ইবনুল মুসান্না (রহঃ) শুবাহ (রহঃ) এর সানাদে এ সূত্রে হুবহু হাদীস বর্ণনা করেছেন। কিন্তু মুআয-এর হাদীসেمِنَ اللَّيْلِ (রাতে) শব্দটি রয়েছে। (ইসলামিক ফাউন্ডেশন ৬৬৬৮, ইসলামিক সেন্টার ৬৭২১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6917,
			"arabicnumber": "2727.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১০, আন্তর্জাতিক নাম্বারঃ ২৭২৭ ৬৮১০-(.../...) যুহায়র ইবনু হারব ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র ও উবায়দ ইবনু ইয়া’ঈশ (রহঃ) ..... আলী (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ইবনু আবু লাইলা সানাদে হাকাম এর হাদীসের অবিকল হাদীস বর্ণনা করেছেন। হাকাম (রহঃ) তার বর্ণিত হাদীসে এটুকু বর্ধিত বলেছেন যে, আলী (রাযিঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শ্রবণ করার পর থেকে আমি কক্ষনো তা ছাড়িনি। তাকে প্রশ্ন করা হলো, সিফফীনের রাতেও কি? তিনি বললেন, সিফফীনের রাতে নয়। ইবনু আবূ লাইলা এর সানাদে আতা বর্ণিত হাদীসে তিনি বলেছেন, আমি তাকে জিজ্ঞেস করলাম, \"সিফফীনের রাত্রেও কি ছেড়ে দেননি?\" (ইসলামিক ফাউন্ডেশন ৬৬৬৯, ইসলামিক সেন্টার ৬৭২২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6920,
			"arabicnumber": "2729",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৩, আন্তর্জাতিক নাম্বারঃ ২৭২৯ ৬৮১৩-(৮২/২৭২৯) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সময় তোমরা মোরগের ডাক শুনতে পাবে তখন আল্লাহর কাছে অনুগ্রহ প্রার্থনা করবে। কেননা সে ফেরেশতা দেখতে পায়। আর যে সময় তোমরা গাধার বিকট ডাক শুনতে পাবে তখন আল্লাহর নিকট শাইতান (শয়তান) থেকে আশ্রয় চাইবে। কেননা সে শাইতান (শয়তান) দেখতে পায়। (ইসলামিক ফাউন্ডেশন ৬৬৭১, ইসলামিক সেন্টার ৬৭২৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6921,
			"arabicnumber": "2730.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৪, আন্তর্জাতিক নাম্বারঃ ২৭৩০ ৬৮১৪-(৮৩/২৭৩০) মুহাম্মাদ ইবনুল মুসান্না, ইবনু বাশশার ও উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। (তিনি বলেন,) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কঠিন বিপদাপদের সময় বলতেনঃ “লা-ইলা-হা ইল্লাল্ল-হুল আযীমুল হালীমু লা ইলাহা ইল্লাল্ল-হু রব্বুল আরশিল আযীমি লা ইলাহা ইল্লাল্ল-হু রব্বুস সামা ওয়া-তি ওয়া রব্বুল আরযি ওয়া রব্বুল আরশিল কারীম\", অর্থাৎ- “মহান, ধৈর্যশীল আল্লাহ ছাড়া কোন মা’বুদ নেই। মহান আরশের পালনকর্তা আল্লাহ ছাড়া কোন মা’বূদ নেই। আকাশমণ্ডলী ও পৃথিবীর রব এবং সম্মানিত আরশের রব আল্লাহ ছাড়া কোন মা’বূদ নেই।\" (ইসলামিক ফাউন্ডেশন ৬৬৭২, ইসলামিক সেন্টার ৬৭২৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6922,
			"arabicnumber": "2730.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৫, আন্তর্জাতিক নাম্বারঃ ২৭৩০ ৬৮১৫-(…/...) আবু বকর ইবনু আবূ শাইবাহ্ (রহঃ) .... হিশাম (রহঃ) এর সানাদে এ সূত্রে হুবহু হাদীস বর্ণনা করেছেন। আর মুআয ইবনু হিশামের বর্ণিত হাদীসটি অধিক পরিপূর্ণ। (ইসলামিক ফাউন্ডেশন ৬৬৭৩, ইসলামিক সেন্টার ৬৭২৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6923,
			"arabicnumber": "2730.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৬, আন্তর্জাতিক নাম্বারঃ ২৭৩০ ৬৮১৬-(.../...) আবদ ইবনু হুমায়দ (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ বাক্যগুলোর সাহায্যে দু’আ করতেন এবং কঠিন বিপদাপদের সময় এগুলো পড়তেন। তারপর তিনি কাতাদাহ্ (রহঃ) এর সানাদে মুআয ইবনু হিশামের হাদীসের অবিকল বর্ণনা করেছেন। তবে তিনি বলেছেন, “রাব্বুস সামা ওয়া-তি ওয়াল আরযি\", অর্থাৎ \"আকাশমণ্ডলী ও পৃথিবীর প্রতিপালক\"। (ইসলামিক ফাউন্ডেশন ৬৬৭৪, ইসলামিক সেন্টার ৬৭২৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6924,
			"arabicnumber": "2730.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৭, আন্তর্জাতিক নাম্বারঃ ২৭৩০ ৬৮১৭-(…/...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন গুরুত্বপূর্ণ কর্ম (বিপদ) তার সামনে আসতো তখন তিনি বলতেন .....। এরপর তিনি মুআয এর বাবার বর্ণিত হাদীসের অবিকল বর্ণনা করেছেন এবং এর সঙ্গে “লা-ইলা-হা ইল্লাল্ল-হু রব্বুল ‘আরশিল কারীম\", অর্থাৎ- \"মহান আরশের প্রতিপালক আল্লাহ ব্যতীত কোন মা’বুদ নেই\" বর্ধিত বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৭৫, ইসলামিক সেন্টার ৬৭২৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6925,
			"arabicnumber": "2731.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৮, আন্তর্জাতিক নাম্বারঃ ২৭৩১ ৬৮১৮-(৮৪/২৭৩১) যুহায়র ইবনু হারব (রহঃ) ..... আবূ যার (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে প্রশ্ন করা হলো কোন কালাম সবচেয়ে উত্তম? তিনি বললেন, আল্লাহ তা’আলা তার ফেরেশতা কিংবা তার বান্দাদের জন্য যে কালাম নির্বাচন করেছেন, আর তা হলো, \"সুবহা-নাল্ল-হি ওয়াবি হামদিহি\" অর্থাৎ- \"আমি আল্লাহ তা’আলার প্রশংসা ও পবিত্রতা ঘোষণা করছি\"। (ইসলামিক ফাউন্ডেশন ৬৬৭৬, ইসলামিক সেন্টার ৬৭৩০) * এই হাদীস হতে শিক্ষণীয় বিষয়: ১। এই হাদীসটি \"سُبْحَانَ اللهِ وَبَحِمْدِهِ\" বাক্যটির দ্বারা আল্লাহর প্রশংসার সহিত তাঁর পবিত্রতা ঘোষণা করার মর্যাদা বর্ণনা করে। ২। মহান আল্লাহর স্মরণে মগ্ন থাকার বিষয়টি হলো মানসিক শান্তি এবং আত্মিক আনন্দের উপাদান। ৩। এই হাদীসটি \"سُبْحَانَ اللهِ وَبَحِمْدِهِ\" বাক্যটির দ্বারা আল্লাহকে অধিকতর স্মরণ করার প্রতি উৎসাহ প্রদান করে।",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6926,
			"arabicnumber": "2731.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮১৯, আন্তর্জাতিক নাম্বারঃ ২৭৩১ ৬৮১৯-(৮৫/…) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... আবু যার (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আবূ যার! আমি কি তোমাকে আল্লাহর নিকট সবচেয়ে প্রিয় কালামটি অবহিত করব না? আমি বললাম, হে আল্লাহর রসূল! আল্লাহর নিকট সবচেয়ে প্রিয় কালামটি আমাকে বলে দিন। তারপর তিনি বললেন, আল্লাহর নিকট সবচেয়ে প্রিয় কালাম হলো, \"সুবহা-নাল্ল-হি ওয়াবি হামদিহি\" অর্থাৎ \"আমি আল্লাহর প্রশংসা ও পবিত্রতা ঘোষণা করছি।\" (ইসলামিক ফাউন্ডেশন ৬৬৭৭, ইসলামিক সেন্টার ৬৭৩১)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6927,
			"arabicnumber": "2732.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২০, আন্তর্জাতিক নাম্বারঃ ২৭৩২ ৬৮২০-(৮৬/২৭৩২) আহমাদ ইবনু ‘উমার ইবনু হাফস্ আল ওয়াকী’ঈ (রহঃ) ..... আবূ দারদা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিম বান্দা তার ভাইয়ের অনুপস্থিতিতে তার জন্য দুআ করলে একজন ফেরেশতা তার জবাবে বলে \"আর তোমার জন্যও অনুরূপ\"। (ইসলামিক ফাউন্ডেশন ৬৬৭৮, ইসলামিক সেন্টার ৬৭৩২)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6928,
			"arabicnumber": "2732.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২১, আন্তর্জাতিক নাম্বারঃ ২৭৩২ ৬৮২১-(৮৭/…) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... উম্মু দারদা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমার নেতা (স্বামী) আমার নিকট বর্ণনা করেছেন যে, তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, তিনি বলেছেন, যে লোক তার ভাইয়ের অনুপস্থিতিতে তার জন্য দু’আ করে, তার জন্য একজন নিয়োজিত ফেরেশতা 'আমীন' বলতে থাকে আর বলে, তোমার জন্যও অনুরূপ। (ইসলামিক ফাউন্ডেশন ৬৬৭৯, ইসলামিক সেন্টার ৬৭৩৩)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6930,
			"arabicnumber": "2732.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6931,
			"arabicnumber": "2732.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৪, আন্তর্জাতিক নাম্বারঃ ২৭৩২ ৬৮২৪-(…/...) আবু বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবদুল মালিক ইবনু আবূ সুলাইমান (রাযিঃ) থেকে এ সানাদে হুবহু বর্ণনা করেছেন এবং তিনি বলেছেন, সাফওয়ান ইবনু আবদুল্লাহ ইবনু সাফওয়ান (রহঃ) এর সানাদে। (ইসলামিক ফাউন্ডেশন ৬৬৮১, ইসলামিক সেন্টার ৬৭৩৫)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6932,
			"arabicnumber": "2734.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৫, আন্তর্জাতিক নাম্বারঃ ২৭৩৪ ৬৮২৫-(…/...) আবু বকর ইবনু আবূ শাইবাহ ও ইবনু নুমায়র (রহঃ) ...... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অবশ্যই আল্লাহ তা’আলা সে বান্দার উপর সম্ভষ্ট, যে খাদ্য গ্রহণের পরে তার জন্য আল হামদু লিল্লা-হ’ পড়ে এবং পানীয় পান করার পরে তার কৃতজ্ঞতা (স্বীকার) করে আল হামদু লিল্লা-হ’ বলে। (ইসলামিক ফাউন্ডেশন ৬৬৮২, ইসলামিক সেন্টার ৬৭৩৬)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6933,
			"arabicnumber": "2734.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৬, আন্তর্জাতিক নাম্বারঃ ২৭৩৪ ৬৮২৬-(…/...) যুহায়র ইবনু হারব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৬৮২, ইসলামিক সেন্টার ৬৭৩৭)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6934,
			"arabicnumber": "2735.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৭, আন্তর্জাতিক নাম্বারঃ ২৭৩৫ ৬৮২৭-(৯০/২৭৩৫) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো দুআ তখনই গৃহীত হয় যখন সে তাড়াহুড়া না করে। (তাড়াতাড়ি করে দুআ করার পর) সে তো বলতে থাকে, আমি দুআ করলাম; অথচ তিনি আমার দুআ গৃহীত হল না। (ইসলামিক ফাউন্ডেশন ৬৬৮৩, ইসলামিক সেন্টার ৬৭৩৮)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6935,
			"arabicnumber": "2735.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৮, আন্তর্জাতিক নাম্বারঃ ২৭৩৫ ৬৮২৮-(৯১/...) আবদুল মালিক ইবনু শু’আয়ব ইবনু লায়স (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো দুআ তখনই গৃহীত হয় যখন সে তাড়াহুড়া না করে। সে বলতে থাকে, আমি আমার প্রভুকে আহবান করলাম আর আমার আহবানে সাড়া দেয়া হল না। (ইসলামিক ফাউন্ডেশন ৬৬৮৪, ইসলামিক সেন্টার ৬৭৩৯)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6936,
			"arabicnumber": "2735.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৮২৯, আন্তর্জাতিক নাম্বারঃ ২৭৩৫ ৬৮২৯-(৯২/...) আবু তাহির (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেছেন, বান্দার দু’আ সর্বদা গৃহীত হয় যদি না সে অন্যায় কাজ অথবা আত্মীয়তার সম্পর্কচ্ছেদ করার জন্য দুআ করে এবং (দুআয়) তাড়াহুড়া না করে। জিজ্ঞেস করা হলো, হে আল্লাহর রসূল! (দু’আয়) তাড়াহুড়া করা কি? তিনি বললেন, সে বলতে থাকে, আমি দুআ তো করেছি, আমি দুআ তো করেছি; কিন্তু আমি দেখতে পেলাম না যে, তিনি আমার দু’আ কবুল করেছেন। তখন সে ক্লান্ত হয়ে পড়ে, আর দু’আ করা পরিত্যাগ করে। (ইসলামিক ফাউন্ডেশন ৬৬৮৫, ইসলামিক সেন্টার ৬৭৪০)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 127
			}
		}
	]
}