{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"51": "Characteristics of The Hypocrites And Rulings Concerning Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7024,
			"arabicnumber": "2772",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯১৭, আন্তর্জাতিক নাম্বারঃ ২৭৭২ ৬৯১৭-(১/২৭৭২) আবু বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ...... যায়দ ইবনু আরকাম (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে কোন এক সফরে আমরা বের হলাম। এ সফরে মানুষজন অনেক কষ্টে পড়ে। সে সময় ‘আবদুল্লাহ ইবনু উবাই তার সাখীদেরকে বলল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথীদের জন্যে তোমরা কিছু ব্যয় করো না, যাতে তারা তার কাছ হতে দূরে চলে যায়। যুহায়র (রহঃ) বলেন, এ হলো ঐ লোকের তিলাওয়াত যে, من حوله শব্দের পরিবর্তে مِنْ حَوْلِهِ পড়ে শক্তিশালীগণ বেশি দুর্বলগণকে বহিষ্কার করে দিবে। আর সে এটাও বলল, আমরা মদীনায় ফিরে আসলে সেখান থেকে নিশ্চয়ই বেশি দুর্বলকে বহিষ্কৃত করবে শক্তিশালী ব্যক্তি। এ কথা শুনে আমি রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে তার এ কথাবার্তার ব্যাপারে তাকে জানালাম। তখন তিনি আবদুল্লাহ ইবনু উবাইকে ডেকে পাঠালেন এবং তাকে এ ব্যাপারে প্রশ্ন করলেন। সে জোরদার শপথ করে বলল যে, সে এমন কর্ম করেনি। আর বলল, যায়দ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে মিথ্যা কথা বলেছে। যায়দ (রাযিঃ) বলেন, তাদের এ কথায় আমি মনে কঠিন কষ্ট পেলাম। তখন আল্লাহ তা’আলা আমার সততার পক্ষে অবতীর্ণ করেন, إِذَا جَاءَكَ الْمُنَافِقُونَ তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে এজন্য আহ্বান করলে যে, তিনি তাদের জন্যে মার্জনা প্রার্থনা করবেন। তিনি বলেন, তখন তারা তাদের মাথা ঘুরিয়ে নিল। আল্লাহ তা’আলা তাদের ব্যাপারে বলেছেন,كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ‏ তারা দেয়ালে ভর দেয়া কাঠের স্তম্ভ সরূপ। যায়দ (রাযিঃ) বলেন, বাহ্যিকভাবে তারা ছিল খুবই সুন্দর মানুষ। (ইসলামিক ফাউন্ডেশন ৬৭৬৭, ইসলামিক সেন্টার ৬৮২২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": "2773.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯১৮, আন্তর্জাতিক নাম্বারঃ ২৭৭৩ ৬৯১৮-(২/২৭৭৩) আবূ বাকর ইবনু আবূ শাইবাহ, যুহায়র ইবনু হারব ও আহমাদ ইবনু আবদাল্লাহ আয যাব্বী (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুল্লাহ ইবনু উবাই এর কবরের কাছে আসলেন এবং তাকে তার কবর থেকে উঠিয়ে নিজ হাঁটুর উপর রাখলেন এবং তিনি তার উপর থুথু দিলেন এবং তাকে নিজ জামা পরিয়ে দিলেন। আল্লাহই এ ব্যাপারে পূর্ণ অবগত। (ইসলামিক ফাউন্ডেশন ৬৭৬৮, ইসলামিক সেন্টার ৬৮২৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": "2773.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯১৯, আন্তর্জাতিক নাম্বারঃ ২৭৭৩ ৬৯১৯-(…/...) আহমাদ ইবনু ইউসুফ আল আযদী (রহঃ) ..... জাবির ইবনু ‘আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু উবাইকে কবরে ঢুকানোর পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছে আসছেন। হাদীসের পরবর্তী অংশটুকু সুফইয়ান এর হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৭৬৯, ইসলামিক সেন্টার ৬৮২৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": "2774.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২০, আন্তর্জাতিক নাম্বারঃ ২৭৭৪ ৬৯২০-(৩/২৭৭৪) আবু বকর ইবনু আবূ শাইবাহ (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু উবাই এর মৃত্যুর পর তার সন্তান আবদুল্লাহ ইবনু আবদুল্লাহ (রাযিঃ) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলেন এবং তাঁর পিতার কাফনের জন্যে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জামাটি চাইলেন। তিনি তাঁকে জামাটি দিয়ে দিলেন। তারপর তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর পিতার সালাতে জানাযা আদায়ের জন্যে অনুরোধ করলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জানাযার সালাত আদায়ের জন্য দাঁড়ালেন। এমতাবস্থায় উমর (রাযিঃ) দাঁড়িয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাপড় টেনে ধরে বললেন, হে আল্লাহর রসূল! তার জানাযা কি আপনি আদায় করাবেন? আর আল্লাহ তা’আলা তার সালাতে জানাযা আদায় করাতে আপনাকে বারণ করেছেন। এ কথা শুনে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ ব্যাপারে তো আল্লাহ তা’আলা আমাকে এ কথা বলে স্বাধীনতা দিয়েছেন যে, আপনি তাদের জন্য ক্ষমা প্রার্থনা করুন অথবা তাদের জন্যে ক্ষমা প্রার্থনা না করুন- উভয়ই সমান, আপনি সত্তরবারও যদি তাদের জন্যে ক্ষমা প্রার্থনা করেন- সবই সমান। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি সত্তরের উপরে বাড়িয়ে আল্লাহর কাছে ক্ষমা প্রার্থনা করব। উমর (রাযিঃ) বললেন, হে আল্লাহর রসূল! সে তো কপট ছিল। এরপরও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সালাতে জানাযা আদায় করলেন। তখন আল্লাহ তা’আলা অবতীর্ণ করলেন- \"তাদের মাঝে কারো মৃত্যু হলে আপনি কখনো তার জন্যে জানাযার সালাত আদায় করবেন না এবং তার কবরের পাশেও দণ্ডায়মান হবেন না\"— (সূরা আত তওবা্ ৯ঃ ৮৪)। (ইসলামিক ফাউন্ডেশন ৬৭৭০, ইসলামিক সেন্টার ৬৮২৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7028,
			"arabicnumber": "2774.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২১, আন্তর্জাতিক নাম্বারঃ ২৭৭৪ ৬৯২১-(৪/...) মুহাম্মাদ ইবনুল মুসান্না ও উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ..... উবাইদুল্লাহ (রহঃ) হতে উক্ত সূত্রে অনুরূপ হাদীস বর্ণনা করেছেন। এতে বর্ধিত রয়েছে যে, তারপর হতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুনাফিকদের সালাতে জানাযা আদায় করা পরিপূর্ণরূপে পরিত্যাগ করলেন। (ইসলামিক ফাউন্ডেশন ৬৭৬৭১, ইসলামিক সেন্টার ৬৮২৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": "2775.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২২, আন্তর্জাতিক নাম্বারঃ ২৭৭৫ ৬৯২২-(৫/২৭৭৫) মুহাম্মাদ ইবনু আবু উমার মাক্কী (রহঃ) ..... ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, বাইতুল্লাহর কাছে তিন লোক একত্রিত হলো। এদের দু’জন কুরাইশী এবং একজন সাকাফী অথবা দু’জন সাকাফী এবং একজন কুরাইশী ছিল। তাদের অন্তরে সূক্ষ্মজ্ঞান খুব কমই ছিল। তবে পেটে অনেক চর্বি ছিল। তাদের একজন বলল, আমরা যা বলি আল্লাহ সব শুনেন, এ কথা কি তোমরা মনে করো? তখন দ্বিতীয় ব্যক্তি বলল, আমরা উচ্চ আওয়াজে কথা বললে আল্লাহ তা শুনে থাকেন। তবে নিম্নস্বরে কথা বললে আল্লাহ তা শুনেন না। তখন তৃতীয় ব্যক্তি বলল, উচ্চ আওয়াজে কথা বললে যদি তিনি শুনে থাকেন তবে নিম্নস্বরে কথা বললেও তিনি তা শুনতে পাবেন। এ প্রেক্ষিতেই আল্লাহ তা’আলা অবতীর্ণ করলেন, “তোমরা গোপন করতে পারবে না এজন্য যে, তোমাদের কান, চোখ এবং ত্বক তোমাদের বিপক্ষে সাক্ষ্য দিবে”— (সূরা ফুসসিলাত ৪১ঃ ২২)। (ইসলামিক ফাউন্ডেশন ৬৭৭২, ইসলামিক সেন্টার ৬৮২৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7030,
			"arabicnumber": "2775.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৩, আন্তর্জাতিক নাম্বারঃ ২৭৭৫ ৬৯২৩-(…/...) আবূ বাকর ইবনু খাল্লাদ আল বাহিলী ও ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ (রাযিঃ) থেকে অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৭৭৩, ইসলামিক সেন্টার ৬৮২৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": "2776.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৪, আন্তর্জাতিক নাম্বারঃ ২৭৭৬ ৬৯২৪-(৬/২৭৭৬) উবাইদুল্লাহ ইবনু মু’আয আল আম্বারী (রহঃ) ..... যায়দ ইবনু সাবিত (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদ যুদ্ধের জন্যে বের হলেন। এমন সময় কতক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সফরসঙ্গী হয়েও ফিরে আসলো। তাদের সম্পর্কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহাবাগণ দু’দলে ভাগ হয়ে গেল। কেউ বলল, আমরা তাদেরকে হত্যা করে ফেলব; আর কেউ বলল, আমরা তাদের হত্যা করব না। তখন অবতীর্ণ হলো, \"তোমাদের কি হলো যে, তোমরা মুনাফিকদের ব্যাপারে দু’দলে ভাগ হয়ে গেলে?\" (সূরা আন নিসা ৪ঃ ৮৮)। (ইসলামিক ফাউন্ডেশন ৬৭৭৪, ইসলামিক সেন্টার ৬৮২৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": "2776.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৫, আন্তর্জাতিক নাম্বারঃ ২৭৭৬ ৬৯২৫-(…/...) যুহায়র ইবনু হারব ও আবু বকর ইবনু নাফি (রহঃ) ...... শু'বাহ হতে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৭৭৫, ইসলামিক সেন্টার ৬৮৩০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": "2777",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৬, আন্তর্জাতিক নাম্বারঃ ২৭৭৭ ৬৯২৬-(৭/২৭৭৭) হাসান ইবনু আলী আল হুলওয়ানী ও মুহাম্মাদ ইবনু সাহল আত তামীমী (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জীবিতাবস্থায় কতক মুনাফিক লোকের অভ্যাস এই ছিল যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন যুদ্ধের জন্যে বের হতেন তখন তারা পিছনে গা ঢাকা দিয়ে থাকতো এবং রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিরুদ্ধে অবস্থান করাতেই তারা উচ্ছাস প্রকাশ করত। এরপর যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে আসতেন তখন তারা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গিয়ে বিভিন্ন অজুহাত পেশ করত, কসম করত এবং প্রত্যাশা করত যেন তারা প্রশংসিত হয় এমন কার্যের উপর যা তারা করেনি। তখন অবতীর্ণ হলোঃ “যারা নিজেরা যা করেছে তাতে আনন্দোল্লাস করে এবং যা নিজেরা করেনি এমন কর্মের জন্য প্রশংসিত হতে পছন্দ করে, তারা আযাব থেকে রেহাই পাবে- আপনি কক্ষনো এমন মনে করবেন না। তাদের জন্যে আছে কঠিন আযাব”— (সূরাহ্ আ-লি ইমরান ৩ঃ ১৮৮)। (ইসলামিক ফাউন্ডেশন ৬৭৭৬, ইসলামিক সেন্টার ৬৮৩১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": "2778",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৭, আন্তর্জাতিক নাম্বারঃ ২৭৭৮ ৬৯২৭-(৮/২৭৭৮) যুহায়র ইবনু হারব ও হারূন ইবনু আবদুল্লাহ (রহঃ) ..... হুমায়দ ইবনু আবদুর রহমান ইবনু আওফ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা মারওয়ান তার দারোয়ান রাফি’কে বললেন, তুমি ইবনু আব্বাস (রাযিঃ) এর কাছে যাও এবং বলো, নিজে যা করেছে তাতে খুশী হয় এবং যা করেনি তাতে প্রশংসিত হতে চেয়ে আমাদের মধ্যে কেউ যদি আযাব পায় তবে আমরা সবাই ‘আযাবে পড়ব। ইবনু আব্বাস (রাযিঃ) বললেন, এ আয়াতের সঙ্গে তোমাদের কি সম্পর্ক? এ আয়াত তো আহলে কিতাব সম্বন্ধে নাযিল হয়েছে। এরপর ইবনু আব্বাস (রাযিঃ) এ আয়াত পাঠ করলেন- “স্মরণ করো, যাদেরকে কিতাব দেয়া হয়েছিল। আল্লাহ তাদের থেকে অঙ্গীকার নিয়েছিলেন- তোমরা মানুষের কাছে সুস্পষ্টভাবে প্রকাশ করবে এবং তা গোপন করবে না।” তারপর ইবনু আব্বাস (রাযি) পড়লেন, \"যারা নিজের যা করেছে তাতে আনন্দ প্রকাশ করে এবং যা নিজেরা করেনি তার জন্য প্রশংসিত হতে ভালবাসে, তারা শাস্তি হতে মুক্তি পাবে, এরূপ আপনি কক্ষনো মনে করবেন না। তাদের জন্য রয়েছে মর্মম্ভদ ‘আযাব।\" তারপর ইবনু আব্বাস (রাযিঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিতাবীদের নিকট কোন ব্যাপারে জানতে চাইলে তারা তা গোপন করলো এবং তার উত্তরে ভিন্ন কথা বলে দিল। তারপর তারা এমন ভনিতা করে বের হলো যে, জিজ্ঞাসিত বিষয়ের যথাযথ জবাব তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দিয়েছে। তারা এতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে প্রশংসা কামনা করেছিল এবং জিজ্ঞাসিত বিষয়টি গোপন করার মাধ্যমে তারা খুবই আনন্দিত হয়েছিল। (ইসলামিক ফাউন্ডেশন ৬৭৭৭, ইসলামিক সেন্টার ৬৮৩২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": "2779.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৮, আন্তর্জাতিক নাম্বারঃ ২৭৭৯ ৬৯২৮-(৯/২৭৭৯) আবু বকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... কায়স (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আম্মার (রাযিঃ) কে প্রশ্ন করলাম, তোমরা আমাকে সে সিদ্ধান্ত সম্পর্কে অবহিত করো যা তোমরা আলী (রাযিঃ) এর ব্যাপারে গ্রহণ করেছে। একি তোমাদের সিদ্ধান্ত না এ সম্পর্কে রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে কোন আদেশ দিয়েছেন? তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বসাধারণকে যে কথা বলেননি, এমন কোন কথা তিনি আমাদেরকেও বলে যাননি। তবে হুযাইফাহ্ (রাযিঃ) আমাকে বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার সহাবাদের মাঝে বারোজন মুনাফিক লোক আছে। এদের আটজনের জান্নাতে প্রবেশ করা এমনিভাবে অসম্ভব যেমনিভাবে সূচের ছিদ্র দিয়ে উষ্ট্রের প্রবেশ করা অসম্ভব। দুবাইলাহ্ (এক প্রকার বড় ধরনের ফোড়া) আটজন লোককে শেষ করে দিবে। আসওয়াদ (রহঃ) বলেন, বাকী চার লোক সম্বন্ধে শুবাহ কি বলেছেন, আমার তা মনে নেই। (ইসলামিক ফাউন্ডেশন ৬৭৭৮, ইসলামিক সেন্টার ৬৮৩৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7036,
			"arabicnumber": "2779.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯২৯, আন্তর্জাতিক নাম্বারঃ ২৭৭৯ ৬৯২৯-(১০/...) মুহাম্মাদ ইবনুল মুসান্না এবং মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... কায়স ইবনু উবাদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা আম্মার (রাযিঃ) কে প্রশ্ন করলাম, আপনাদের এ সংগ্রামের ব্যাপারে বলুন তো, তা কি আপনাদের স্বীয় মতের ভিত্তিতে? যা ভুলও হতে পারে, সঠিকও হতে পারে। কিংবা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক্ষেত্রে বিশেষভাবে আপনাদের আদেশ দিয়েছেন? তিনি বললেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বসাধারণকে যে আদেশ দেননি, এমন কিছু তিনি বিশেষভাবে আমাদেরকেও বলেননি। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উম্মাতের মাঝে বর্ণনাকারী শুবাহ (রহঃ) বলেন, আমার মনে হয়, তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আমার উম্মাতের মাঝে বারোজন মুনাফিক হবে। তাদের জান্নাতে ঢুকা এবং জান্নাতের ঘ্রাণও পাওয়া তেমন অসম্ভব যেমন সূচের ছিদ্রপথে উষ্ট্রের ঢুকা অসম্ভব। তাদের মাঝে আটজনের (ধ্বংসের) জন্য দুবাইলাহা যথেষ্ট হবে। দুবাইলাহ হলো অগ্নিশিখা, যা কাঁধের মাঝে প্রকাশ পেয়ে অন্তঃকরণকে ছেয়ে ফেলবে। (ইসলামিক ফাউন্ডেশন ৬৭৭৯,ইসলামিক সেন্টার ৬৮৩৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": "2779.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩০, আন্তর্জাতিক নাম্বারঃ ২৭৭৯ ৬৯৩০-(১১/...) যুহায়র ইবনু হারব (রহঃ) ..... আবু তুফায়ল (বাযিঃ) থেকে বর্ণিত। তিনি বলেন, ‘আকাবায় উপস্থিত এক ব্যক্তির সাথে হুযাইফাহ্ (রাযিঃ) এর মাঝে মানুষের মধ্যে যেমন মনোমালিন্য হয়ে থাকে তেমন কিছু ছিল। সে তাকে জিজ্ঞেস করল, তোমাকে আল্লাহর শপথ করে বলছি, বলো, ‘আকাবায় উপস্থিত লোকেদের সংখ্যা কত ছিল? হুযইফাহ্ (রাযিঃ) কে লোকেরা অনুরোধ করল, সে যেহেতু প্রশ্ন করেছে, তাই আপনি বলে দিন। তিনি বললেন, আমাদের অবহিত করা হয়েছে যে, তাদের সংখ্যা ছিল চোদ্দ। আর যদি তুমিও তাদের মধ্যে হয়ে থাকো, তবে তাদের সংখ্যা হবে পনের। আমি আল্লাহর কসম করে বলছি যে, এদের বারোজন দুনিয়া এবং আখিরাতের জীবনে আল্লাহ এবং তার রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শত্রু। বাকী তিনজন অজুহাত পেশ করে বলল, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘোষকের আওয়াজ শুনিনি এবং কওমের লোকেদের প্রয়াসও আমাদের জানা ছিল না। আল্লাহ ও তার রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রস্তরময় মাঠে ছিলেন। অতঃপর তিনি সেখান থেকে এগিয়ে চললেন এবং বললেন, (আমাদের গন্তব্যস্থলের) পানি অতি সামান্য। কেউ আমার পূর্বে সেখানে যাবে না। কিন্তু তিনি সেখানে গিয়ে দেখলেন যে, কতক লোক তার আগমনের পূর্বেই চলে এসেছে। সেদিন তিনি তাদের প্রতি অভিশাপ দিয়েছেন। (ইসলামিক ফাউন্ডেশন ৬৭৮০, ইসলামিক সেন্টার ৬৮৩৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": "2780.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩১, আন্তর্জাতিক নাম্বারঃ ২৭৮০ ৬৯৩১-(১২/২৭৮০) উবাইদুল্লাহ ইবনু মুআয আল ‘আম্বারী (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুরার টিলাতে কে আরোহণ করবে? যে আরোহণ করে, তার পাপসমূহ ক্ষমা করে দেয়া হবে, যেমনভাবে বনী ইসরাঈলকে ক্ষমা করে দেয়া হয়েছিল। জাবির (রাযিঃ) বলেন, প্রথমে ঐ টিলাতে আরোহণ করল আমাদের বানী খাযরাজের ঘোড়াগুলো। তারপর অন্য লোকেরা তাদের পিছনে আসল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের সকলকেই ক্ষমা করে দেয়া হয়েছে, লাল উষ্ট্রের মালিক ছাড়া। তখন আমরা ঐ লোকটির নিকট গিয়ে বললাম, এসো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমার জন্য ক্ষমা কামনা করবেন। সে বলল, আমি যদি আমার হারানো উটটি পেয়ে যাই তবে তা অবশ্য আমার জন্য তোমাদের সঙ্গীর দু’আ থেকে উত্তম। জাবির (রাযিঃ) বলেন, এ লোকটি তার হারানো উষ্ট্রির সন্ধানে ছিল। (ইসলামিক ফাউন্ডেশন ৬৭৮১, ইসলামিক সেন্টার ৬৮৩৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": "2780.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩২, আন্তর্জাতিক নাম্বারঃ ২৭৮০ ৬৯৩২-(১৩/...) ইয়াহইয়া ইবনু হাবীব আল হারিসী (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কে আরোহণ করবে মুরার টিলাতে? পরবর্তী অংশটুকু মুআয এর হাদীসের অনুরূপ। তবে এতে বর্ধিত রয়েছে যে, তখন তিনি এক বেদুঈনকে দেখলেন, সে তার হারানো উট সন্ধান করে আসছে। (ইসলামিক ফাউন্ডেশন ৬৭৮২, ইসলামিক সেন্টার ৬৮৩৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": "2781",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৩, আন্তর্জাতিক নাম্বারঃ ২৭৮১ ৬৯৩৩-(১৪/২৭৮১) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, বানী নাজ্জার এর এক লোক আমাদের সাথে ছিল। সে সূরাহ্ আল-বাকারাহ এবং সূরাহ্ আ-লি ইমরান তিলাওয়াত করেছিল। সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষ থেকে কাতিবে ওয়াহীর দায়িত্ব পালন করত। পরে পালিয়ে গিয়ে সে কিতাবীদের সাথে মিলে যায়। রাবী বলেন, তারা তাকে খুব সমাদর করল এবং বলল, এ ব্যক্তিটি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাতিব ছিল। এতে তারা খুবই আনন্দিত হলো। এরপর বেশি দেরী হয়নি, আল্লাহ তা’আলা তাদের মাঝেই তাকে ধ্বংস করে দিলেন। তারপর তারা তার জন্য গর্ত করে তাকে ঢেকে দিলো। সকালে দেখা গেল যে, জমিন তার লাশ বের করে উপরে ফেলে দিয়েছে। তারপর আবার তারা গর্ত করে তাকে পুতে দিলো। সকালে দেখা গেল যে, জমিন তার লাশটি বের করে উপরে ফেলে দিয়েছে। তারপর পুনরায় তারা তার জন্য গর্ত করে তাকে তাতে পুঁতে বালু সকলে দেখা গেল, এবারও জমিন তার লাশ বের করে মাটির উপর ফেলে দিয়েছে। কাজেই তারা তাকে নিক্ষিপ্ত অবস্থায় পরিত্যাগ করলো। (ইসলামিক ফাউন্ডেশন ৬৭৮৩, ইসলামিক সেন্টার ৬৮৩৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": "2782",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৪, আন্তর্জাতিক নাম্বারঃ ২৭৮২ ৬৯৩৪-(১৫/২৭৮২) আবূ কুরায়ব মুহাম্মাদ ইবনু ‘আলা (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। (তিনি বলেন) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক ভ্রমণ থেকে প্রত্যাগমন করে মদীনার সন্নিকটবর্তী স্থানে পৌছলে এমনভাবে প্রচণ্ডবেগে বায়ু প্রবাহিত হয় যে, মনে হচ্ছিল যেন আরোহীকে ধূলায় ঢেকে ফেলবে। রাবী বলেন, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন মুনাফিকের মৃত্যুর কারণে এ বায়ু প্রবাহিত হয়েছে। যখন তিনি মদীনায় পৌছলেন, তখন দেখা গেল, একজন বড় মুনাফিকের মৃত্যু ঘটেছে। ইসলামিক ফাউন্ডেশন ৬৭৮৪, ইসলামিক সেন্টার ৬৮৩৯",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": "2783",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৫, আন্তর্জাতিক নাম্বারঃ ২৭৮৩ ৬৯৩৫-(১৬/২৭৮৩) আব্বাস ইবনু আবদুল আযীম আল আম্বারী (রহঃ) ..... ইয়াস (রহঃ) বলেন যে, আমার পিতা বর্ণনা করেছেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জ্বরে আক্রান্ত এক লোকের সেবা-শুশ্রুষা করতে গেলাম। আমি আমার হাত তার শরীরে রেখে বললাম, আল্লাহর শপথ! আজকের মতো এমন তাপে আক্রান্ত আর কোন লোক আমি দেখিনি। এ কথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কিয়ামতের দিন এর থেকেও অধিক তাপে আক্রান্ত লোকের খবর আমি কি তোমাদের দিব না? তারা ঐ দু’জন আরোহী যারা ঘাড় ফিরিয়ে চলে যাচ্ছে। এ কথা তিনি বললেন, সে সময়কার তার সাথীদের মধ্য থেকে দু’জনের দিকে লক্ষ্য করে। (ইসলামিক ফাউন্ডেশন ৬৭৮৫, ইসলামিক সেন্টার ৬৮৪০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": "2784.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৬, আন্তর্জাতিক নাম্বারঃ ২৭৮৪ ৬৯৩৬-(১৭/২৭৮৪) মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র, আবু বাকর ইবনু আবূ শাইবাহ ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ইবনু উমর (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, মুনাফিকের দৃষ্টান্ত ঐ বকরীর মতো, যা দু’ পালের মধ্যে উদ্ভ্রান্তের মতো ঘুরপাক করে। একবার এদিকে আবার অন্যদিকে। (ইসলামিক ফাউন্ডেশন ৬৭৮৬, ইসলামিক সেন্টার ৬৮৪১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": "2784.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৭, আন্তর্জাতিক নাম্বারঃ ২৭৮৪ ৬৯৩৭-(…/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... ইবনু উমার থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল হাদীস বর্ণনা করেছেন। কিন্তু এতে রয়েছে, একবার আসে এ পালে আবার যায় অন্য পালে। (ইসলামিক ফাউন্ডেশন ৬৭৮৭, ইসলামিক সেন্টার, নেই)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		}
	]
}