{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7045,
			"arabicnumber": "2785",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৮, আন্তর্জাতিক নাম্বারঃ ২৭৮৫ ৬৯৩৮-(১৮/২৭৮৫) আবূ বাকর ইবনু ইসহাক (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) এর সূত্রে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেছেন, কিয়ামতের ময়দানে মোটা-তাজা লোক উপস্থিত হবে, কিন্তু আল্লাহর নিকট তার ওযন মশার ডানার ন্যায়ও হবে না। তোমরা পড়ে নাও \"কিয়ামতের দিন আমি তাদের জন্য কোন পরিমাপক স্থাপন করব না\"- (সূরা আল কাহফ ১৮ঃ ১০৫)। (ইসলামিক ফাউন্ডেশন ৬৭৮৮, ইসলামিক সেন্টার ৬৮৪২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7046,
			"arabicnumber": "2786.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৩৯, আন্তর্জাতিক নাম্বারঃ ২৭৮৬ ৬৯৩৯-(১৯/২৭৮৬) আহমাদ ইবনু আবদুল্লাহ ইবনু ইউনুস (রহঃ) ..... আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা এক ইয়াহুদী পাদরী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে সম্বোধন করে বলল, হে মুহাম্মাদ! অথবা (বলল) হে আবুল কাসিম \"কিয়ামতের দিন আল্লাহ তা’আলা আকাশমণ্ডলীকে এক আঙ্গুলে, জমিনসমূহকে এক আঙ্গুলে, পাহাড় ও গাছপালাকে এক আঙ্গুলে; পানি ও মাটি এক আঙ্গুলে এবং সকল প্রকার সৃষ্টিকে এক আঙ্গুলে তুলে ধরবেন। তারপর এগুলো দুলিয়ে বলবেন, আমিই বাদশাহ, আমিই অধিপতি।\" পাদরীর কথা শুনে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিস্ময়ের সাথে তার সত্যায়ন স্বরূপ হাসলেন। অতঃপর তিনি পাঠ করলেনঃ (অর্থ) \"তারা আল্লাহর যথোপযুক্ত সম্মান প্রদর্শন করেনি। কিয়ামতের দিন সমস্ত পৃথিবী তার হাতের মুষ্টিতে এবং আকাশমণ্ডলী থাকবে তার ডান হাতের মুঠোয়। পবিত্র ও মহান তিনি, তারা যাকে অংশীদার স্থাপন করে, তিনি তার থেকে অনেক উর্ধ্বে\"- (সূরা আয যুমার ৩৯ঃ ৬৭)। (ইসলামিক ফাউন্ডেশন ৬৭৮৯ ইসলামিক সেন্টার ৬৮৪৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7047,
			"arabicnumber": "2786.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪০, আন্তর্জাতিক নাম্বারঃ ২৭৮৬ ৬৯৪০-(২০/…) উসমান ইবনু আবু শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মানসূর (রহঃ) থেকে উক্ত সূত্রে বলেছেন যে, জনৈক ইয়াহুদী পাদরী লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলো, পরবর্তী অংশ ফুযায়ল এর হাদীসের অনুরূপ। তবে তিনি এগুলো দুলিয়েছেন কথাটির উল্লেখ করেননি। এতে এ-ও রয়েছে যে, তার কথায় বিস্মিত হয়ে তার সত্যায়নে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি এমনভাবে হাসতে দেখেছি যে, তার মাড়ির দাঁত মুবারক প্রকাশিত হয়ে গিয়েছিল। তারপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিলাওয়াত করলেন, (অর্থ) \"তারা আল্লাহর যথোপযুক্ত সম্মান প্রদর্শন করেনি\" ..... পূর্ণ আয়াত তিলাওয়াত করেন। (ইসলামিক ফাউন্ডেশন ৬৭৯০, ইসলামিক সেন্টার ৬৮৪৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7048,
			"arabicnumber": "2786.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪১, আন্তর্জাতিক নাম্বারঃ ২৭৮৬ ৬৯৪১-(২১/...) উমর ইবনু হাফস ইবনু গিয়াস (রহঃ) .... ‘আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। আহলে কিতাবদের জনৈক লোক রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, হে আবুল কাসিম! আল্লাহ তা’আলা আকাশমণ্ডলী এক আঙ্গুলে, ভূমণ্ডল এক আঙ্গুলে, গাছপালা ও আর্দ্র মাটি এক আঙ্গুলে এবং সকল সৃষ্টি এক আঙ্গুলে তুলে ধরবেন। এরপর তিনি বলবেন, আমিই বাদশাহ্, আমিই রাজা। রাবী বলেন, তখন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এমনভাবে হাসতে দেখলাম যে, তার মাড়ি মুবারকের দাঁতগুলো প্রকাশ পেলো। এরপর তিলাওয়াত করলেন, (অর্থ) \"তারা আল্লাহর যথোপযুক্ত সম্মান প্রদর্শন করেনি।\" (ইসলামিক ফাউন্ডেশন ৬৭৯১, ইসলামিক সেন্টার ৬৮৪৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7049,
			"arabicnumber": "2786.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪২, আন্তর্জাতিক নাম্বারঃ ২৭৮৬ ৬৯৪২-(২২/...) আবু বকর ইবনু আবূ শাইবাহ, আবু কুরায়ব, ইসহাক ইবনু ইবরাহীম, আলী ইবনু খাশরাম ও উসমান ইবনু আবূ শাইবাহ (রহঃ) ... আ'মাশ (রহঃ) এর সূত্রে উক্ত সানাদে বর্ণনা করেছেন। তবে তাদের সকলের বর্ণনাতেই রয়েছে যে, বৃক্ষরাজি এক আঙ্গুলে এবং আর্দ্র মাটি এক আঙ্গুলো। তবে জারীর এর হাদীসে \"সকল প্রকার সৃষ্টি এক আঙ্গুলে\" কথাটি উল্লেখ নেই। অবশ্য তার হাদীসে \"পাহাড়সমূহ এক আঙ্গুলে\" কথাটি রয়েছে। জারীর (রাযিঃ) এর হাদীসে বর্ধিত রয়েছে যে, তার কথায় অবাক হয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সমর্থন করেন। (ইসলামিক ফাউন্ডেশন ৬৭৯২, ইসলামিক সেন্টার ৬৮৪৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7050,
			"arabicnumber": "2787",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৩, আন্তর্জাতিক নাম্বারঃ ২৭৮৭ ৬৯৪৩-(২৩/২৭৮৭) হারমালাহ্ ইবনু ইয়াহইয়া (রহঃ) ...... আবু হুরাইরাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন আল্লাহ তা’আলা সারা পৃথিবী তার হাতের মুষ্টিতে নিয়ে নিবেন এবং আকাশমণ্ডলী ভাঁজ করে তার ডান হাতের মুঠোয় নিবেন। তারপর তিনি বলবেন, “আমিই বাদশাহ্। পৃথিবীর বাদশাহগণ কোথায়?” (ইসলামিক ফাউন্ডেশন ৬৭৯৩, ইসলামিক সেন্টার ৬৮৪৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7051,
			"arabicnumber": "2788.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৪, আন্তর্জাতিক নাম্বারঃ ২৭৮৮ ৬৯৪৪-(২৪/২৭৮৮) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন আল্লাহ তা’আলা আকাশমণ্ডলী পেচিয়ে নিবেন। তারপর তিনি আকাশমণ্ডলীকে ডান হস্তে ধরে বলবেন, আমিই বাদশাহ। কোথায় শক্তিশালী লোকেরা! কোথায় অহংকারীরা? এরপর তিনি বাম হস্তে গোটা পৃথিবী গুটিয়ে নিবেন এবং বলবেন, আমিই বাদশাহ। কোথায় অত্যাচারী লোকেরা, কোথায় বড়ত্ব প্রদর্শনকারীরা? (ইসলামিক ফাউন্ডেশন ৬৭৯৪, ইসলামিক সেন্টার ৬৮৪৮)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7052,
			"arabicnumber": "2788.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৫, আন্তর্জাতিক নাম্বারঃ ২৭৮৮ ৬৯৪৫-(২৫/...) সাঈদ ইবনু মানসূর (রহঃ) .... উবাইদুল্লাহ ইবনু মিকসাম (রহঃ) থেকে বর্ণিত। তিনি আবদুল্লাহ ইবনু উমর (রাযিঃ) এর দিকে তাকিয়ে থাকলেন, কিভাবে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা বর্ণনা করছেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা’আলা আকাশমণ্ডলী ও সারা পৃথিবী তার হস্তদ্বয়ে তুলে ধরবেন এবং বলবেন, আমিই আল্লাহ। তিনি স্বীয় আঙ্গুল সংকোচন ও সম্প্রসারণ করে বলবেন, আমিই বাদশাহ। আবদুল্লাহ ইবনু উমর (রাযিঃ) বলেন, এমনকি তখন আমি দেখতে পাচ্ছিলাম যে, মিম্বারের নিম্নাংশের কিছু দুলছিল। তখন আমি ভাবছিলাম, মিম্বারটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নিয়ে পড়ে যায় কিনা? (ইসলামিক ফাউন্ডেশন ৬৭৯৫, ইসলামিক সেন্টার ৬৮৪৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7053,
			"arabicnumber": "2788.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৬, আন্তর্জাতিক নাম্বারঃ ২৭৮৮ ৬৯৪৬-(২৬/...) সাঈদ ইবনু মানুসূর (রহঃ) ..... ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মিম্বারের উপর এমন অবস্থায় দেখেছি যে, তিনি বলছেন, মহাপরাক্রমশালী সত্তা আকাশমণ্ডলী ও গোটা পৃথিবী স্বীয় হস্তদ্বয়ে তুলে ধরবেন। পরবর্তী অংশ ইয়াকুব এর হাদীসের অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৭৯৬, ইসলামিক সেন্টার ৬৮৫০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7054,
			"arabicnumber": "2789",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৭, আন্তর্জাতিক নাম্বারঃ ২৭৮৯ ৬৯৪৭-(২৭/২৭৮৯) সুরায়জ ইবনু ইউনুস ও হারূন ইবনু ‘আবদুল্লাহ (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার হাত ধরে বললেন, আল্লাহ তা’আলা শনিবার দিন মাটি সৃষ্টি করেন এবং এতে পর্বত সৃষ্টি করেন রবিবার দিন। সোমবার দিন তিনি বৃক্ষরাজি সৃষ্টি করেন। মঙ্গলবার দিন তিনি বিপদাপদ সৃষ্টি করেন। তিনি নূর সৃষ্টি করেন বুধবার দিন। তিনি বৃহস্পতিবার দিন পৃথিবীতে পশু-পাখি ছড়িয়ে দেন এবং জুমুআর দিন আসরের পর জুমুআর দিনের শেষ মুহূর্তে অর্থাৎ আসর থেকে নিয়ে রাত পর্যন্ত সময়ের মধ্যবর্তী সময়ে সর্বশেষ মাখলুক আদম (আঃ) কে সৃষ্টি করেন। (ইসলামিক ফাউন্ডেশন ৬৭৯৭,ইসলামিক সেন্টার ৬৮৫১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7055,
			"arabicnumber": "2790",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৮, আন্তর্জাতিক নাম্বারঃ ২৭৯০ ৬৯৪৮-(২৮/২৭৯০) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... সাহল ইবনু সা’দ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লোকেদেরকে কিয়ামতের দিন ময়দার রুটির ন্যায় (গোল) লালচে সাদা জমিনের উপরে জমায়েত করা হবে। সেখানে কারো কোন বিশেষ নিদর্শন মওজুদ থাকবে না। (ইসলামিক ফাউন্ডেশন ৬৭৯৮, ইসলামিক সেন্টার ৬৮৫২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7056,
			"arabicnumber": "2791",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৪৯, আন্তর্জাতিক নাম্বারঃ ২৭৯১ ৬৯৪৯-(২৯/২৭৯১) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে আল্লাহর বাণীঃ (অর্থ) \"যেদিন এ পৃথিবী পরিবর্তিত হয়ে অন্য পৃথিবী হয়ে যাবে এবং আকাশমণ্ডলীও\"- (সূরা ইবরা-হীম ১৪ঃ ৪৮) সম্পর্কে প্রশ্ন করলাম, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! তবে সেদিন লোকেরা কোথায় থাকবে? তিনি বললেন, (জাহান্নামের উপরে নির্মিত) সেতুর উপরে অবস্থান করবে। (ইসলামিক ফাউন্ডেশন ৬৭৯৯, ইসলামিক সেন্টার ৬৮৫৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7057,
			"arabicnumber": "2792",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫০, আন্তর্জাতিক নাম্বারঃ ২৭৯২ ৬৯৫০-(৩০/২৭৯২) আবদুল মালিক ইবনু শু’আয়ব ইবনুল লায়স (রহঃ) ..... আবু সাঈদ আল খুদরী (রাযিঃ) এর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, সমস্ত ভূখণ্ড কিয়ামতের দিন একটি রুটির মতো হয়ে যাবে। আল্লাহ সেটি নিজ হাতে এপাশ-ওপাশ করবেন, যেমন তোমাদের মাঝে কেউ সফরের সময় নিজ রুটি এপাশ-ওপাশ করে। এ দিয়ে হবে জান্নাতবাসীর জন্য আতিথেয়তা। এমন সময় এক ইয়াহুদী লোক এসে বলল, হে আবুল কাসিম! রহমান আপনার প্রতি বারাকাত দান করুন। কিয়ামতের দিন জান্নাতবাসীদের আতিথেয়তা সম্পর্কে আপনাকে জানাব কি? তিনি বললেন, হ্যাঁ। ইয়াহুদী বলল, এ পৃথিবীটি একটি রুটির রূপ ধারণ করবে, যেমন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। রাবী বলেন, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের দিকে লক্ষ্য করে এমনভাবে হেসে দিলেন যে, তার মাড়ির মুবারক দাঁত প্রকাশিত হয়ে পড়েছিল। ইয়াহুদী বলল, তাদের তরকারি কি হবে তা কি আপনাকে বলব? তিনি বললেন, হ্যাঁ। সে বলল, বালাম এবং নূন। সহাবাগণ প্রশ্ন করলেন, তা কি? সে বলল, ষাড় এবং মাছ- যাদের কলিজার বাড়তি অংশ থেকে সত্তর হাজার লোক আহার করতে পারবে। (ইসলামিক ফাউন্ডেশন ৬৮০০, ইসলামিক সেন্টার ৬৮৫৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7058,
			"arabicnumber": "2793",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫১, আন্তর্জাতিক নাম্বারঃ ২৭৯৩ ৬৯৫১-(৩১/২৭৯৩) ইয়াহইয়া ইবনু হাবীব আল হারিসী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দশজন ইয়াহুদী ব্যক্তি যদি আমার অনুসরণ করতো তাহলে এ ভূখণ্ডে মুসলিম হওয়া ছাড়া কোন ইয়াহুদী আর অবশিষ্ট থাকত না। (ইসলামিক ফাউন্ডেশন ৬৮০১, ইসলামিক সেন্টার ৬৮৫৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7059,
			"arabicnumber": "2794.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫২, আন্তর্জাতিক নাম্বারঃ ২৭৯৪ ৬৯৫২-(৩২/২৭৯৪) উমর ইবনু হাফস্ ইবনু গিয়াস (রহঃ) ..... আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক ফসলি জমিতে চলছিলাম। সে সময় তিনি একটি খেজুর শাখার ছড়ির উপর ভর দিয়ে যাচ্ছিলেন। হঠাৎ তিনি ইয়াহুদীদের একটি দলের পাশ দিয়ে অতিক্রম করলেন। তখন তারা একজন আরেকজনকে বলাবলি করতে লাগল, রূহ সম্বন্ধে তাকে প্রশ্ন করো। তাদের কেউ বলল, কি সন্দেহ তৈরি হয়েছে তোমাদের যে, তোমরা তাকে প্রশ্ন করবে? তোমাদের যেন এমন কথার সম্মুখীন না হতে হয়, যা তোমরা অপছন্দ করো। এরপরও তারা বলল, তাকে অবশ্যই প্রশ্ন করো। পরিশেষে তাদের কেউ উঠে গিয়ে তাকে রূহ সম্বন্ধে প্রশ্ন করল। রাবী বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ রইলেন। তার কোন উত্তর দিলেন না। আমি বুঝতে পারলাম, তার উপর ওয়াহী অবতীর্ণ হচ্ছে। রাবী বলেন, আমি নিজের স্থানে দাঁড়িয়ে রইলাম। এরপর ওয়াহী অবতীর্ণ শেষ হলে তিনি বললেন, \"তোমাকে তারা রূহ সম্পর্কে জিজ্ঞেস করে; বলো, রূহ আমার প্রতিপালকের একটি আদেশ মাত্র এবং তোমাদের অতি নগণ্য জ্ঞান দেয়া হয়েছে\" (সূরা আল ইসরা ১৭ঃ ৮৫)। (ইসলামিক ফাউন্ডেশন ৬৮০২, ইসলামিক সেন্টার ৬৮৫৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7060,
			"arabicnumber": "2794.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৩, আন্তর্জাতিক নাম্বারঃ ২৭৯৪ ৬৯৫৩-(৩৩/…) আবু বাকর ইবনু আবূ শাইবাহ ও আবু সাঈদ আল আশাজ্জ, ইসহাক ইবনু ইবরাহীম আল হানযালী এবং আলী ইবনু খাশরাম (রহঃ) ..... আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মদীনার একটি ফসলি জমিতে হাঁটছিলাম। তারপর তিনি হাফসের অবিকল হাদীস বর্ণনা করেছেন। তবে ওয়াকী এর হাদীসে আছেوَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاًআর খাশরামের সূত্রে বর্ণিত ঈসার হাদীসে রয়েছে وَمَا أُوتُوا (ইসলামিক ফাউন্ডেশন ৬৮০৩, ইসলামিক সেন্টার ৬৮৫৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7061,
			"arabicnumber": "2794.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৪, আন্তর্জাতিক নাম্বারঃ ২৭৯৪ ৬৯৫৪-(৩৪/...) আবূ সাঈদ আল আশাজ্জ (রহঃ) ..... ‘আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক খেজুর বাগানে খেজুর ডালের লাঠির উপর ভর করে চলছিলেন। এরপর তিনি আ'মাশ হতে বর্ণিত হাদীসের হুবহু বর্ণনা করেছেন। কিন্তু তার বর্ণনার মধ্যে রয়েছে অর্থাৎ- \"এ বিষয়ে তোমাদেরকে সামান্য জ্ঞানই দান করা হয়েছে\"। (ইসলামিক ফাউন্ডেশন ৬৮০৪, ইসলামিক সেন্টার ৬৮৫৮)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7062,
			"arabicnumber": "2795.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৫, আন্তর্জাতিক নাম্বারঃ ২৭৯৫ ৬৯৫৫-(৩৫/২৭৯৫) আবু বাকর ইবনু আবূ শাইবাহ ও আবদুল্লাহ ইবনু সাঈদ আল আশাজ্জ (রহঃ) ..... খাব্বাব (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আস ইবনু ওয়ায়িল এর কাছে আমার কিছু পাওনা ছিল। এর উসূলান্তে আমি তার নিকট গেলাম। সে বলল, যে পর্যন্ত তুমি মুহাম্মাদকে অস্বীকার না করবে ততক্ষণ পর্যন্ত তোমার পাওনা দিব না। এ কথা শুনে আমি তাকে বললাম, আমি কক্ষনো মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে অস্বীকার করব না, তুমি মরার পর আবার জীবিত হয়ে আসলেও। সে বলল, আমি কি মৃত্যুর পর আবার জীবিত হয়ে উঠব? তাহলে তখনই আমি আমার সম্পদ এবং সন্তানাদি লাভ করে তোমার পাওনা পরিশোধ করব। তখন এ আয়াতটি অবতীর্ণ হয়, \"আপনি কি দেখেছেন তাকে যে আমার আয়াতসমূহ উপেক্ষা করে এবং বলে, আমাকে তো ধন-সম্পদ ও সন্তানাদি দেয়া হবে।\" \"..... আর সে আমার কাছে একাকী আসবে\"— তখন এ আয়াতটি নাযিল হয়। (ইসলামিক ফাউন্ডেশন ৬৮০৫, ইসলামিক সেন্টার ৬৮৫৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7063,
			"arabicnumber": "2795.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৬, আন্তর্জাতিক নাম্বারঃ ২৭৯৫ ৬৯৫৬-(৩৬/…) আবূ কুরায়ব, ইবনু নুমায়র, ইসহাক ইবনু ইবরাহীম ও ইবনু আবূ উমার, ..... আমাশ (রহঃ) এর সানাদে এ সূত্রে ওয়াকী’র হাদীসের অবিকল বর্ণনা করেছেন। তবে জারীর এর হাদীসের মধ্যে অতিরিক্ত আছে যে, খাব্বাব (রাযিঃ) বলেন, জাহিলী যুগে আমি কর্মকার ছিলাম। তখন আস ইবনু ওয়ায়িলকে আমি একটি কাজ করে দিয়েছিলাম। এরপর আমি তা আদায় করার জন্য তার কাছে গেলাম। (ইসলামিক ফাউন্ডেশন ৬৮০৬, ইসলামিক সেন্টার ৬৮৬০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7064,
			"arabicnumber": "2796",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৭, আন্তর্জাতিক নাম্বারঃ ২৭৯৬ ৬৯৫৭-(৩৭/২৭৯৬) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা আবু জাহল বলল, \"হে আল্লাহ! এটা যদি তোমার তরফ থেকে সত্য হয়, তাহলে আমাদের উপর আকাশ থেকে প্রস্তর বর্ষণ করো অথবা আমাদের কঠিন ‘আযাব দাও।\" তখন অবতীর্ণ হলোঃ \"আল্লাহ এমন নন যে, আপনি তাদের মাঝে অবস্থান করবেন আর তিনি তাদের আযাব দিবেন এবং আল্লাহ এমনও নন যে, তারা মার্জনা প্রার্থনা করবে আর তিনি তাদের আযাব দিবেন। আর তাদের কি বা বলার আছে যে, আল্লাহ তাদের আযাব দিবেন না, যদিও তারা লোকেদের মসজিদুল হারাম হতে নিবৃত্ত করে?\" (সূরা আল আনফাল ৮ঃ ৩৩-৩৪) ..... আয়াতের শেষ পর্যন্ত। (ইসলামিক ফাউন্ডেশন ৬৮০৭, ইসলামিক সেন্টার ৬৮৬১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7065,
			"arabicnumber": "2797",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৮, আন্তর্জাতিক নাম্বারঃ ২৭৯৭ ৬৯৫৮-(৩৮/২৭৯৭) উবাইদুল্লাহ ইবনু মুআয (রহঃ) এবং মুহাম্মাদ ইবনু আবদুল আ’লা আল কায়সী (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবু জাহল বলেছিল, মুহাম্মদ কি তোমাদের মাঝে তার মুখমণ্ডল জমিনের উপর রাখে? লোকেরা বলল, হ্যাঁ রাখে। তখন সে বলল, আমি লাত এবং উয্যার শপথ করে বলছি, আমি যদি তাকে এমন করতে দেখি তবে নিশ্চয়ই আমি তার ঘাড় পদদলিত করব, অথবা তার মুখমণ্ডল আমি মাটিতে মেখে দিব। (নাউযুবিল্লাহ) তারপর একদা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায়ে রত ছিলেন। এমন সময় আবূ জাহল রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গর্দানকে পদদলিত করার উদ্দেশে তার কাছে আসলো। একটু অগ্রসর হয়ে অকস্মাৎ সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে মুখ ফিরিয়ে দ্রুত পিছনে সরে আসল এবং দু' হাত দিয়ে নিজেকে বাঁচাতে লাগল। এ দেখে তাকে প্রশ্ন করা হলো, তোমার কি হয়েছে? উত্তরে সে বলল, আমি দেখেছি যে, আমার এবং তার মধ্যে আগুনের একটি প্রকাণ্ড খাদক, ভয়াবহ অবস্থা এবং কতগুলো ডানা। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সে যদি আমার নিকটে আসত, তবে ফেরেশতাগণ তার অঙ্গ-প্রত্যঙ্গকে ছিন্নবিচ্ছিন্ন করে ফেলতো। রাবী বলেন, অতঃপর আল্লাহ তা’আলা অবতীর্ণ করলেন। রাবী (আবু হাযিম) বলেন, আবু হুরাইরাহ (রাযিঃ) এর হাদীসের মধ্যে এ অবতীর্ণ আয়াতটি আছে, না এ মর্মে তার কাছে কোন খবর পৌছেছে, তা আমাদের জানা নেই। “কক্ষনো ঠিক নয়, মানুষ তো সীমালঙ্ঘন করেই থাকে, কেননা সে নিজেকে স্বয়ংসম্পূর্ণ মনে করছে। আপনার প্রতিপালকের কাছে ফিরে যেতে হবে এটা সুনিশ্চিত। আপনি বলুন তো সে ব্যক্তি সম্পর্কে যে বাধা দেয় এক বান্দাকে যখন সে সালাত আদায় করে। আপনি বলুন তো যদিও সে সালাত আদায়কারী ব্যক্তিটি সৎপথে থাকে এবং তাকওয়ার আদেশ করে এমন ব্যক্তিকে কি বাধা দেয়া ব্যক্তি তবে সে কি জানে না যে, আল্লাহ প্রত্যক্ষ করেন? সাবধান, সে যদি বিরত না হয়, তবে আমি অবশ্যই তাকে হেঁচড়িয়ে নিয়ে যাব মস্তকের অগ্রভাগের কেশগুচ্ছ ধরে, সেটি মিথ্যাচারী পাপিষ্ঠের কেশগুচ্ছ। অতএব সে তার নাসিয়াহ অর্থাৎ- তার সম্প্রদায়কে আহবান করুক। আমি যবনিয়াকে (সম্প্রদায়কে) আহবান করব। কক্ষনো তুমি তার অনুকরণ করো না”— (সূরা আল ‘আলাক ৯৬ঃ ৬-১৯)। উবাইদুল্লাহ তার হাদীসে এতটুকু বাড়িয়েছেনঃ রাবী আবু হুরাইরাহ (রাযিঃ) বলেন, তার (রসূল) আদেশ আল্লাহর নির্দেশ অনুযায়ী (প্রযোজ্য)। ইবনু আবদুল আ’লা বৃদ্ধি করেছেন فَلْيَدْعُ نَادِيَهُ অর্থাৎقَوْمَهُ ও তার সম্প্রদায়কে ডাকুক। (ইসলামিক ফাউন্ডেশন ৬৮০৮, ইসলামিক সেন্টার ৬৮৬২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7066,
			"arabicnumber": "2798.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৫৯, আন্তর্জাতিক নাম্বারঃ ২৭৯৮ ৬৯৫৯-(৩৯/২৭৯৮) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... মাসরুক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমরা ‘আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) এর কাছে উপবিষ্ট ছিলাম। এ সময় তিনি আমাদের মাঝে এক পার্শ্বদেশ হয়ে ঘুমিয়েছিলেন। এমতাবস্থায় তার কাছে জনৈক লোক এসে বলল, হে আবু আবদুর রহমান। কিনদা দ্বারপ্রান্তে এক বক্তা বলছেন, কুরআনে বর্ণিত ধোয়ার কাহিনীটি ভবিষ্যতে সংঘটিত হবে। তা প্রবাহিত হয়ে কাফিরদের শ্বাসরুদ্ধ করে দিবে এবং এতে মুমিনদের সর্দির মতো অবস্থা হবে। এ কথা শুনে তিনি গোস্বা হয়ে বসলেন এবং বললেন, হে লোক সকল! তোমরা আল্লাহকে ভয় কর। তোমাদের কেউ কোন কথার জ্ঞান থাকলে সে যেন তা-ই বলে। আর যে না জানে সে যেন বলে- আল্লাহই সবচেয়ে ভাল জানে। কেননা প্রকৃত জ্ঞানের কথা হচ্ছে এই যে, যে বিষয়ে তার জ্ঞান নেই সে বিষয়ে বলবে, আল্লাহই অধিক ভাল জানেন। কারণ আল্লাহ তা’আলা তার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলেছেন, \"বলো, আমি এর জন্য তোমাদের কাছে কোন প্রতিফল চাই না এবং আমি মিথ্যা দাবীদারদের অন্তর্ভুক্ত নই।\" প্রকৃত অবস্থা তো এই যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন লোকেদের মাঝে দীন বিমুখ দেখলেন, তখন তিনি বলেছিলেন, হে আল্লাহ ইউসুফ (আঃ) এর সময়ের ন্যায় অভাব-অনটনের সাতটি বছর তাদের উপর আপতিত কর। তারপর তাদের উপর অভাব-অনটন এমনভাবে পতিত হলো যে, তা সব কিছুকে নিঃশেষ করে দিল। ফলে ক্ষুধার জ্বালায় তারা চামড়া ও মৃত দেহ খাদ্য উপকরণ হিসেবে গ্রহণ করলো। এমনকি তাদের কোন লোক আকাশের দিকে তাকালে শুধু ধোয়ার মতই দেখতে পেত। অতঃপর আবু সুফইয়ান রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলল, হে মুহাম্মাদ! আপনি তো আল্লাহর আনুগত্যের আদেশ করেন এবং আত্মীয়তার হক আদায় করার আদেশ দিয়ে আসছেন, অথচ আপনার সম্প্রদায় তো ধ্বংস হয়ে গেলো। আপনি তাদের জন্য আল্লাহর কাছে দুআ করুন। (এ প্রসঙ্গে) আল্লাহ তা’আলা বললেনঃ “অতএব আপনি অপেক্ষা করুন সে দিনের, যেদিন স্পষ্ট ধূম্রাচ্ছন্ন হবে আকাশ এবং সেটা আবৃত করে ফেলবে মানব জাতিকে। এ হবে কঠিন শাস্তি। ... তোমরা তো তোমাদের পূর্বাবস্থায় ফিরে যাবে।\" এ পর্যন্ত তিলাওয়াত করলেন। (সূরাহ্ আদ দুখান ৪৪ঃ ১০-১২) ‘আবদুল্লাহ (রাযিঃ) বলেন, আখিরাতের শাস্তি কি লাঘব করা হবে? (আল্লাহ তা’আলা আরো বলেছেন), \"যেদিন আমি তোমাদের সুদৃঢ়ভাবে পাকড়াও করব, অবশ্যই সেদিন আমি তোমাদের নিকট থেকে প্রতিশোধ নিব।\" (সূরাহ্ আদ দুখান ৪৪ঃ ১৬) অনুরূপ এ আয়াতে বাতশাহ্ দ্বারা বদরের যুদ্ধ উদ্দেশ্য করা হয়েছে। কাজেই দুখান (ধোয়ার নিদর্শন), আল বাতশাহ্ (পাকড়াও), লিযাম (আবশ্যিক শাস্তি) এবং রূম (রোমকদের পরাজয়ের কাহিনী) এসব অতীত হয়ে গেছে। (ইসলামিক ফাউন্ডেশন ৬৮০৯, ইসলামিক সেন্টার ৬৮৬৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7067,
			"arabicnumber": "2798.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬০, আন্তর্জাতিক নাম্বারঃ ২৭৯৮ ৬৯৬০-(৪০/...) আবূ বাকর ইবনু আবূ শাইবাহ, আবূ সাঈদ আল আশাজ্জ, উসমান ইবনু আবু শাইবাহ, ইয়াহইয়া ইবনু ইয়াহইয়া ও আবূ কুরায়ব (রহঃ) ..... মাসরুক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবদুল্লাহ (রাযিঃ) এর কাছে এক লোক এসে বলল, আমি মসজিদে এক লোককে দেখে এসেছি, সে কুরআনের ইচ্ছামাফিক তাফসীর করছে। সে يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ এ আয়াতের ব্যাখ্যায় বলছে যে, কিয়ামতের দিন ধোয়া এসে লোকেদের আবৃত করে ফেলবে ও তাদের শ্বাসরুদ্ধ করে ফেলবে, এমনকি এতে লোকেদের সর্দির ন্যায় অবস্থা হয়ে যাবে। এ কথা শুনে আবদুল্লাহ (রাযিঃ) বললেন, যে ব্যক্তি যে বিষয়ে জানে সে তা বর্ণনা করবে। আর যে না জানে তার বলা উচিত, আল্লাহই অধিক জ্ঞাত। কেননা অজানা বিষয় সম্বন্ধে আল্লাহই অধিক জ্ঞাত, এ কথা বলাই মানুষের পরিপূর্ণ জ্ঞানের লক্ষণ। কারণ এ বিষয়টি তখনই সংঘটিত হয়েছিল, যখন কুরায়শরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অবাধ্যতা করেছিল। তখন তিনি তাদের বিরুদ্ধে দুআ করেন যেন ইউসুফ (আঃ) এর সময়ের সাত বছরের মতো অভাব-অনটন তাদের উপর নিপতিত হয়। এরপর তাদের উপর অভাব-অনটন এবং ক্ষুধার কষ্ট এমনভাবে নিপতিত হলো যে, কেউ আকাশের দিকে তাকালে সে ধূম্ৰাচ্ছন্ন দেখত, এমনকি তারা হাড্ডি খাওয়া শুরু করল। তখন জনৈক লোক এসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলল, হে আল্লাহর রসূল! মুযার গোত্রের জন্য আল্লাহর কাছে মার্জনা প্রার্থনা করুন। তারা নিশ্চয় ধ্বংস হয়ে গেল। তিনি বললেন, মুযার গোত্রের জন্য তুমি তো দুর্দান্ত সাহসী। রাবী বলেন, তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জন্য আল্লাহর কাছে দুআ করলেন। তখন আল্লাহ তা’আলা অবতীর্ণ করলেন, “আমি তোমাদের শাস্তি কিছু সময়ের জন্য বিরত রেখেছি। তোমরা তো তোমাদের আগের অবস্থায়ই প্রত্যাবর্তন করবে\"- (সূরাহ্ আদ দুখান ৪৪ঃ ১৫)। রাবী বলেন, অতঃপর তাদের উপর অনবরত বৃষ্টি হলো। এরপর তাদের যখন স্বচ্ছলতা ফিরে এলো তখন তারা আবার আগের অবস্থায় প্রত্যাবর্তন করল। তখন আল্লাহ তা’আলা অবতীর্ণ করলেন, \"অতএব আপনি অপেক্ষা করুন সেদিনের, যেদিন ধূম্রাচ্ছন্ন হবে আকাশ এবং সেটা মানব জাতিকে ঢেকে ফেলবে। এ হবে কঠিন শাস্তি\"- (সুরাহ্ আদ দুখান ৪৪ঃ ১০-১১)। যেদিন আমি তোমাদের শক্তভাবে পাকড়াও করব, সেদিন আমি তোমাদেরকে আযাব দিবই\"- (সূরাহ্ আদ দুখান ৪৪ঃ ১৬)। রাবী বলেন, অর্থাৎ- বদরের দিন। (ইসলামিক ফাউন্ডেশন ৬৮১০, ইসলামিক সেন্টার ৬৮৬৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7068,
			"arabicnumber": "2798.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬১, আন্তর্জাতিক নাম্বারঃ ২৭৯৮ ৬৯৬১-(৪১/…) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, পাঁচটি বিষয় অতীত হয়ে গেছেঃ ধোঁয়া, শাস্তি, রোম এর পরাজয়, পাকড়াও এবং চন্দ্রের নিদর্শন অর্থাৎ বিদীর্ণ হওয়া। (ইসলামিক ফাউন্ডেশন ৬৮১১, ইসলামিক সেন্টার ৬৮৬৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7069,
			"arabicnumber": "2798.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬২, আন্তর্জাতিক নাম্বারঃ ২৭৯৮ ৬৯৬২-(…/...) আবু সাঈদ আল আশাজ্জ, ওয়াকী (রহঃ) এর সূত্রে আ'মাশ (রহঃ) হতে এ সানাদে অবিকল হাদীস বর্ণনা করেন। (ইসলামিক ফাউন্ডেশন ৬৮১১, ইসলামিক সেন্টার ৬৮৬৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7070,
			"arabicnumber": "2799",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৩, আন্তর্জাতিক নাম্বারঃ ২৭৯৯ ৬৯৬৩-(৪২/২৭৯৯) মুহাম্মাদ ইবনুল মুসান্না, মুহাম্মাদ ইবনু বাশশার ও আবু বকর ইবনু আবূ শাইবাহ (রহঃ) ... উবাই ইবনু কা'ব (রাযিঃ) আল্লাহর বাণী- “বড় বড় শাস্তির পূর্বে তাদের আমি অবশ্যই ছোট ছোট শাস্তি আস্বাদন করাব”— (সুরা আস্ সিজদা ৩২ঃ ২১) এ আয়াতের ব্যাখ্যায় বলেছেনঃ উদ্দেশ্য হলো পার্থিব বিপদাপদ, রোমের পরাজয়, পাকড়াও অথবা ধোঁয়া। পাকড়াও না ধোঁয়া’ এ সম্পর্কে শুবাহ সন্দেহ প্রকাশ করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮১৩, ইসলামিক সেন্টার ৬৮৬৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7071,
			"arabicnumber": "2800.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৪, আন্তর্জাতিক নাম্বারঃ ২৮০০ ৬৯৬৪-(৪৩/২৮০০) আমর আন নাকিদ ও যুহায়র ইবনু হারব (রহঃ) ..... আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময় চন্দ্ৰ দু’টুকরো হয়েছিল। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেনঃ তোমরা সাক্ষী থাকো। (ইসলামিক ফাউন্ডেশন ৬৮১৪, ইসলামিক সেন্টার ৬৮৬৮)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7072,
			"arabicnumber": "2800.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৫, আন্তর্জাতিক নাম্বারঃ ২৮০০ ৬৯৬৫-(৪৪/...) আবু বাকর ইবনু আবু শাইবাহ, আবু কুরায়ব, ইসহাক ইবনু ইবরাহীম, ‘উমার ইবনু হাফস ইবনু গিয়াস ও মিন্‌জাব ইবনুল হারিস আত তামীমী (রহঃ) ..... আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, মিনায় আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। এমতাবস্থায় অকস্মাৎ চাঁদ দু'টুকরো হয়ে গেল। এক টুকরো পাহাড়ের পিছনে পতিত হল এবং অপর টুকরো পাহাড়ের সামনে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বললেন, তোমরা সাক্ষী থাকো। (ইসলামিক ফাউন্ডেশন ৬৮১৫, ইসলামিক সেন্টার ৬৮৬৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7073,
			"arabicnumber": "2800.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৬, আন্তর্জাতিক নাম্বারঃ ২৮০০ ৬৯৬৬-(৪৫/...) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... ‘আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময় চন্দ্র ফেটে দু’টুকরো হয়ে যায়। এর এক টুকরোকে পাহাড় আড়াল করে ফেলেছে এবং অপর এক টুকরো পাহাড়ের উপর পরিলক্ষিত হয়েছে। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আল্লাহ! তুমি সাক্ষী থাকো। (ইসলামিক ফাউন্ডেশন ৬৮১৬, ইসলামিক সেন্টার ৬৮৭০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7074,
			"arabicnumber": "2801.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৭, আন্তর্জাতিক নাম্বারঃ ২৮০১ ৬৯৬৭-(.../২৮০১) উবাইদুল্লাহ ইবনু মুআয (রহঃ) ..... ইবনু উমর (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হুবহু বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮১৭, ইসলামিক সেন্টার ৬৮৭১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7075,
			"arabicnumber": "2801.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৬৮, আন্তর্জাতিক নাম্বারঃ ২৮০১ ৬৯৬৮-(…/...) বিশর ইবনু খালিদ ও মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... শুবাহ হতে অবিকল বর্ণনা করেছেন। তবে ইবনু আবু আদী (রহঃ) এর হাদীসের মধ্যে রয়েছে যে, তারপর তিনি বললেনঃ তোমরা সাক্ষী থাকো, তোমরা সাক্ষী থাকো। (ইসলামিক ফাউন্ডেশন ৬৮১৭, ইসলামিক সেন্টার ৬৮৭২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7078,
			"arabicnumber": "2802.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭১, আন্তর্জাতিক নাম্বারঃ ২৮০২ ৬৯৭১-(৪৭/…) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, চাঁদ দু'টুকরো হয়েছে। তবে আবু দাউদ (রহঃ) এর হাদীসে রয়েছে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময় চাঁদ দু'টুকরো হয়েছে। (ইসলামিক ফাউন্ডেশন ৬৮১৯, ইসলামিক সেন্টার ৬৮৭৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7079,
			"arabicnumber": "2803",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭২, আন্তর্জাতিক নাম্বারঃ ২৮০৩ ৬৯৭২-(৪৮/২৮০৩) মূসা ইবনু কুরায়শ আত তামীমী (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময় চাঁদ দু'টুকরো হয়েছে। (ইসলামিক ফাউন্ডেশন ৬৮২০, ইসলামিক সেন্টার ৬৮৭৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7082,
			"arabicnumber": "2804.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭৫, আন্তর্জাতিক নাম্বারঃ ২৮০৪ ৬৯৭৫-(৫০/...) উবাইদুল্লাহ ইবনু সাঈদ (রহঃ) ..... ‘আবদুল্লাহ ইবনু কায়স (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কষ্টকর কোন কথা শোনার পর আল্লাহর চেয়ে বেশি ধৈর্যশীল আর কেউ নেই। কেননা মানুষ আল্লাহর সঙ্গে অংশীদার স্থাপন করে এবং তার জন্য সন্তান সাব্যস্ত করে, এতদসত্ত্বেও তিনি তাদের জীবিকা নির্বাহ করেন, তাদেরকে মাফ করেন এবং তাদেরকে প্রয়োজনীয় সব কিছু প্রদান করেন। (ইসলামিক ফাউন্ডেশন ৬৮২৩, ইসলামিক সেন্টার ৬৮৭৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7083,
			"arabicnumber": "2805.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭৬, আন্তর্জাতিক নাম্বারঃ ২৮০৫ ৬৯৭৬-(৫১/২৮০৫) উবাইদুল্লাহ ইবনু মুআয আল আম্বারী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, জাহান্নামীদের মাঝে যার শাস্তি সবচেয়ে কম হবে, আল্লাহ তা’আলা তাকে বলবেন, পৃথিবী এবং পৃথিবীর মাঝে যা কিছু আছে সব কিছু যদি তোমার হয়ে যায়, তবে কি তুমি এসব কিছু মুক্তিপণ হিসেবে প্রদান করে নিজেকে আযাব থেকে রক্ষা করবে? সে বলবে, হ্যাঁ, অবশ্যই। তখন তিনি বলবেন, তুমি আদমের পৃষ্ঠে থাকা অবস্থায় আমি তো তোমার কাছে এর থেকেও সহজ জিনিস আশা করেছিলাম। তা হলো, তুমি শিরক করবে না। রাবী বলেন, আমার মনে হয়, তিনি বলেছেনঃ তাহলে আমি তোমাকে জাহান্নামে প্রবেশ করাব না। কিন্তু তুমি তা উপেক্ষা করে শিরকে জড়িয়ে পড়েছে। (ইসলামিক ফাউন্ডেশন ৬৮২৪, ইসলামিক সেন্টার ৬৮৮০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7084,
			"arabicnumber": "2805.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭৭, আন্তর্জাতিক নাম্বারঃ ২৮০৫ ৬৯৭৭-(…/…) মুহাম্মদ ইবনু বাশার (রহ:) ...... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অবিকল বর্ণনা করেছেন। তবে তিনি وَلاَ أُدْخِلَكَ النَّارَ কথাটি উল্লেখ করেননি। (ইসলামিক ফাউন্ডেশন ৬৮২৫, ইসলামিক সেন্টার ৬৮৮১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7085,
			"arabicnumber": "2805.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭৮, আন্তর্জাতিক নাম্বারঃ ২৮০৫ ৬৯৭৮-(৫২/...) উবাইদুল্লাহ ইবনু আল কাওয়ারিরী, ইসহাক ইবনু ইবরাহীম, মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কিয়ামতের দিন কাফিরদেরকে বলা হবে, তুমি কি বলো, যদি তুমি পৃথিবী সমতুল্য স্বর্ণের মালিক হও, তাহলে মুক্তিপণ হিসেবে তা প্রদান করে তুমি কি নিজেকে শাস্তি হতে রক্ষা করবে? সে বলবে, হ্যাঁ অবশ্যই। তখন তাকে বলা হবে, তোমার নিকট হতে তো এর থেকে অধিক সহজ বিষয় কামনা করা হয়েছিল। (ইসলামিক ফাউন্ডেশন ৬৮২৬, ইসলামিক সেন্টার ৬৮৮২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7086,
			"arabicnumber": "2805.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৭৯, আন্তর্জাতিক নাম্বারঃ ২৮০৫ ৬৯৭৯-(৫৩/...) আবদ ইবনু হুমায়দ ও আম্বর ইবনু যুবরাহ (রহঃ) .... আনাস (রাযিঃ) এর সানদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল হাদীস বর্ণনা করেছেন। তবে এতে রয়েছে যে, তাকে বলা হবে, তুমি মিথ্যা বলেছ। তোমার কাছে তো এর থেকে সহজ বিষয় কামনা করা হয়েছিল। (ইসলামিক ফাউন্ডেশন ৬৮২৭, ইসলামিক সেন্টার ৬৮৮৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7087,
			"arabicnumber": "2806",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮০, আন্তর্জাতিক নাম্বারঃ ২৮০৬ ৬৯৮০-(৫৪/২৮০৬) যুহায়র ইবনু হারব ও আবদ ইবনু হুমায়দ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, এক লোক জিজ্ঞেস করল, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! কিয়ামত দিবসে কাফিরদেরকে নিম্নমুখী করে কিরূপে উথিত হবে? তিনি বললেন, যিনি দুনিয়াতে উভয় পায়ের উপর ভর করে চালিত করেছেন, তিনি কি কিয়ামতের দিন তাদেরকে মুখের উপর ভর করে চালাতে সক্ষম হবেন না? এ হাদীস শুনে কাতাদাহ্ বললেন, আমার রবের মর্যাদার শপথ অবশ্যই তিনি সক্ষম হবেন। (ইসলামিক ফাউন্ডেশন ৬৮২৮, ইসলামিক সেন্টার ৬৮৮৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7088,
			"arabicnumber": "2807",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮১, আন্তর্জাতিক নাম্বারঃ ২৮০৭ ৬৯৮১-(৫৫/২৮০৭) ‘আমর আন নাকিদ (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামের উপযোগী-দুনিয়ায় সর্বাধিক সচ্ছল ও ধন-সম্পদের অধিকার লোককে কিয়ামতের দিন উপস্থিত করা হবে। এরপর তাকে জাহান্নামের আগুনে একবার অবগাহন করিয়ে বলা হবে, হে আদম সন্তান! দুনিয়াতে আরাম-আয়েশ কখনো তুমি ভোগ করেছে কি? কখনো তুমি স্বাচ্ছদ্য অবস্থায় দিন অতিবাহিত করেছে কি? সে বলবে, আল্লাহর শপথ হে আমার প্রতিপালক না, কক্ষনো করিনি। এরপর জান্নাতের উপযোগী দুনিয়ায় সর্বাধিক দুরাবস্থা সম্পন্ন লোককে আনা হবে। এরপর তাকে জান্নাতে একবার অবগাহন করিয়ে জিজ্ঞেস করা হবে, হে আদম সন্তান! কখনো তুমি কষ্টে দিনাতিপাত করেছে কি? হৃদয় বিদারক এবং ভয়াবহ অবস্থায় দিনাতিপাত করেছে কি? সে বলবে, আল্লাহর কসম, হে আমার প্রতিপালক! কক্ষনো আমি কষ্টের সাথে দিনাতিপাত করিনি এবং দুঃখ কক্ষনো দেখিনি। (ইসলামিক ফাউন্ডেশন ৬৮২৯, ইসলামিক সেন্টার ৬৮৮৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7089,
			"arabicnumber": "2808.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮২, আন্তর্জাতিক নাম্বারঃ ২৮০৮ ৬৯৮২-(৫৬/২৮০৮) আবূ বাকর ইবনু আবূ শাইবাহ ও যুহায়র ইবনু হারব (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একটি নেকীর ক্ষেত্রেও আল্লাহ তা’আলা কোন মুমিন বান্দার প্রতি অত্যাচার করবেন না। বরং তিনি এর ফলাফল দুনিয়াতে দান করবেন এবং আখিরাতেও দান করবেন। আর কাফির লোক পার্থিব জগতে আল্লাহর উদ্দেশে যে সৎ ‘আমল করে এর প্রতিদান স্বরূপ তিনি তাকে জীবিকা নির্বাহ করেন। পরিশেষে আখিরাতে প্রতিফল দেয়ার মতো তার কাছে কোন সৎ আমলই থাকবে না। (ইসলামিক ফাউন্ডেশন ৬৮৩০, ইসলামিক সেন্টার ৬৮৮৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7090,
			"arabicnumber": "2808.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৩, আন্তর্জাতিক নাম্বারঃ ২৮০৮ ৬৯৮৩-(৫৭/...) আসিম ইবনু নাযর আত তামীমী (রহঃ) ..... আনাস ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে রিওয়ায়াত করেছেন যে, কাফির যদি দুনিয়াতে কোন সৎ আমল করে তবে এর প্রতিদান স্বরূপ দুনিয়াতেই তাকে জীবনোপকরণ প্রদান করা হয়ে থাকে। আর মুমিনদের নেকী আল্লাহ তা’আলা আখিরাতের জন্য জমা করে রেখে দেন এবং আনুগত্যের প্রতিফল স্বরূপ আল্লাহ তা’আলা তাদেরকে পৃথিবীতেও জীবিকা নির্বাহ করে থাকেন। (ইসলামিক ফাউন্ডেশন ৬৮৩১, ইসলামিক সেন্টার ৬৮৮৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7091,
			"arabicnumber": "2808.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৪, আন্তর্জাতিক নাম্বারঃ ২৮০৮ ৬৯৮৪-(.../...) মুহাম্মাদ ইবনু আবদুল্লাহ আর রুয্‌য়ী (রহঃ) ..... আনাস (রাযিঃ) এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮৩২, ইসলামিক সেন্টার ৬৮৮৮)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7092,
			"arabicnumber": "2809.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৫, আন্তর্জাতিক নাম্বারঃ ২৮০৯ ৬৯৮৫-(৫৮/২৮০৯) আবূ বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিনের দৃষ্টান্ত শস্যক্ষেতের মতো। বাতাস সবসময় তাকে আন্দোলিত করে। অনুরূপভাবে মুমিনের উপরও সবসময় বিপদাপদ আসতে থাকে। আর মুনাফিকের দৃষ্টান্ত দেবদারু গাছের মতো। মূল উৎপাটন হয়ে যায়; কিন্তু সেটা আন্দোলিত হয় না। (ইসলামিক ফাউন্ডেশন ৬৮৩৩, ইসলামিক সেন্টার ৬৮৮৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7093,
			"arabicnumber": "2809.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৬, আন্তর্জাতিক নাম্বারঃ ২৮০৯ ৬৯৮৬-(.../...) মুহাম্মাদ ইবনু রাফি ও আবদ ইবনু হুমায়দ (রহঃ) ..... যুহরী (রহঃ) থেকে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। তবে আবদুর রাযযাক এর হাদীসে تُمِيلُهُ এর স্থলে تُفِيئُهُ উল্লেখ রয়েছে (উভয়ের অর্থ একই, অর্থাৎ আন্দোলিত করে)। (ইসলামিক ফাউন্ডেশন ৬৮৩৪, ইসলামিক সেন্টার ৬৮৯০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7094,
			"arabicnumber": "2810.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৭, আন্তর্জাতিক নাম্বারঃ ২৮১০ ৬৯৮৭-(৫৯/২৮১০) আবু বাকর ইবনু আবূ শাইবাহ্ (রহঃ) ..... কা'ব ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মু'মিনের দৃষ্টান্ত নরম চারাগাছের মতো। বাতাস সেটাকে দুলাতে থাকে কখনো তাকে নুইয়ে ফেলে আবার কখনো একেবারে সোজা করে ফেলে। এমনিভাবে অবশেষে সেটা পূর্ণতা লাভ করে শুকিয়ে যায়। আর কাফিরদের দৃষ্টান্ত হচ্ছে স্বীয় কাণ্ডে দাঁড়ানো দেবদার গাছের মতো। কোন কিছুই তাকে নাড়াতে পারে না। কিন্তু এটা একেবারেই মূলোৎপাটিত হয়ে যায়। (ইসলামিক ফাউন্ডেশন ৬৮৩৫, ইসলামিক সেন্টার ৬৮৯১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7095,
			"arabicnumber": "2810.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৮৮, আন্তর্জাতিক নাম্বারঃ ২৮১০ ৬৯৮৮-(৬০/...) যুহায়র ইবনু হারব (রহঃ) ..... কা'ব ইবনু মালিক (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিনের দৃষ্টান্ত নরম চারাগাছের মতো। বাতাস তাকে আন্দোলিত করে। বাতাস কখনো তাকে নুইয়ে দেয়, আবার কখনো একেবারে সোজা দাঁড় করিয়ে দেয়। এমনি করে তার মৃত্যুক্ষণ এসে উপস্থিত হয়। আর মুনাফিকের দৃষ্টান্ত দাঁড়ানো দেবদারু গাছের মতো, কোন কিছুই তাকে নত করতে পারে না। পরিশেষে তাকে একেবারেই মূলোচ্ছেদ করে দেয়। (ইসলামিক ফাউন্ডেশন ৬৮৩৬, ইসলামিক সেন্টার ৬৮৯১[ক)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7096,
			"arabicnumber": "2810.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7097,
			"arabicnumber": "2810.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7098,
			"arabicnumber": "2811.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯১, আন্তর্জাতিক নাম্বারঃ ২৮১১ ৬৯৯১-(৬৩/২৮১১) ইয়াহইয়া ইবনু আইয়্যুব, কুতাইবাহ ইবনু সাঈদ ও আলী ইবনু হুজর আস্ সাদী (রহঃ) ..... ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, গাছ-গাছালির মধ্যে এমন একটি গাছ আছে, যার পাতা ঝরে পড়ে না এবং তা হলো মুমিনের দৃষ্টান্ত। তোমরা আমাকে বলতে পার, সেটা কোন গাছ? তারপর লোকজনের ধারণা জঙ্গলের কোন গাছের প্রতি নিবদ্ধ হল। আবদুল্লাহ (রাযিঃ) বলেন, আমার মনে হতে লাগল যে, তা হলো খর্জুর বৃক্ষ। কিন্তু আমি লজ্জাবোধ করলাম। সহাবায়ে কিরাম (রাযিঃ) বললেন, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনিই আমাদের তা বলে দিন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা হলো খর্জুর বৃক্ষ। ‘আবদুল্লাহ (রাযিঃ) বলেন, এরপর আমি আমার পিতাকে আমার মনে যা এসেছিল তা বললাম। তিনি বললেন, তুমি যদি তখন তা বলে দিতে যে, সেটা হলো খর্জুর বৃক্ষ, তবে আমি অমুক অমুক জিনিস লাভ করার চাইতেও অধিক খুশী হতাম। (ইসলামিক ফাউন্ডেশন ৬৮৩৮, ইসলামিক সেন্টার ৬৮৯৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7099,
			"arabicnumber": "2811.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯২, আন্তর্জাতিক নাম্বারঃ ২৮১১ ৬৯৯২-(৬৪/…) মুহাম্মাদ ইবনু উবাইদুল্লাহ আল গুবারী (রহঃ) ..... ইবনু উমার (রাযিঃ) থেকে বর্ণিত। একদা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সহাবাগণকে বললেন, এমন একটি গাছ আছে, যার দৃষ্টান্ত মুমিনের মতো, এ গাছটি কি গাছ, তোমরা কি আমাকে বলতে পার? তখন লোকেরা জঙ্গলের গাছসমূহ থেকে এক একটি গাছের কথা বর্ণনা করল। ইবনু উমার (রাযিঃ) বলেন, আমার মনে হতে লাগল, তা হলো খেজুর গাছ। তখন আমি বলার ইচ্ছা করলাম। কিন্তু সেখানে যেহেতু সমাজের বয়োবৃদ্ধ ব্যক্তিগণও ছিলেন, তাই আমি কথা বলতে ভয় পাচ্ছিলাম। লোকজন চুপ হলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তা হলো খেজুর গাছ। (ইসলামিক ফাউন্ডেশন ৬৮৩৯, ইসলামিক সেন্টার ৬৮৯৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7100,
			"arabicnumber": "2811.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৩, আন্তর্জাতিক নাম্বারঃ ২৮১১ ৬৯৯৩-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ ও ইবনু আবূ উমার (রহঃ) ..... মুজাহিদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি মদীনায় ইবনু উমর (রাযিঃ) এর সাথে ছিলাম। একটি হাদীস ছাড়া রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে কোন হাদীস বর্ণনা করতে তাকে আমি শুনিনি। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসা ছিলাম। তখন তার নিকট খেজুর গাছের মাথি আনা হলো। তারপর তিনি পূর্বোক্ত হাদীস দুটোর মতো এ হাদীসটি বর্ণনা করলেন। (ইসলামিক ফাউন্ডেশন ৬৮৪০, ইসলামিক সেন্টার ৬৮৯৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7101,
			"arabicnumber": "2811.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৪, আন্তর্জাতিক নাম্বারঃ ২৮১১ ৬৯৯৪-(.../...) ইবনু নুমায়র (রহঃ) ..... মুজাহিদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু উমার (রাযিঃ) কে বলতে শুনেছি যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে খেজুর গাছের মাথি আনা হলো। তারপর তিনি পূর্বোক্তদের অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮৪১, ইসলামিক সেন্টার ৬৮৯৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7102,
			"arabicnumber": "2811.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৫, আন্তর্জাতিক নাম্বারঃ ২৮১১ ৬৯৯৫-(.../...) আবূ বাকর ইবনু আবূ শাইবাহ (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপবিষ্ট ছিলাম। এ সময় তিনি বললেন, এমন একটি গাছ আছে যা মুসলিম লোকের ন্যায়, যার পাতা কখনো ঝরে পড়ে না, গাছটি কি গাছ তোমরা কি আমাকে বলতে পার? ইবরাহীম ইবনু সুফইয়ান (রহঃ) বলেন, সম্ভবতঃ ইমাম মুসলিম (রহঃ) বলেছেন, وَتُؤْتِي أُكُلَهَا كُلَّ حِينٍ যা প্রত্যেক মৌসুমে ফল প্রদান করে। তবে আমি ছাড়া অন্যান্যদের বর্ণনায়ও আমি পেয়েছি وَلاَ تُؤْتِي أُكُلَهَا كُلَّ حِينٍ অর্থাৎ- لاَ ছাড়া। ইবনু উমর (রাযিঃ) বলেন, আমার মনে হতে লাগল, তা হলো খেজুর গাছ। কিন্তু তখন আমি দেখলাম যে, আবূ বাকর ও উমর (রাযিঃ) কিছুই বলছেন না। তাই কোন কথা বা কিছু বলা আমার ভালো লাগলো না। কিন্তু উমার (রাযিঃ) এ কথা শুনে বললেন, যদি তুমি বলে দিতে তবে অমুক অমুক জিনিস লাভ করা হতেও আমি বেশি খুশী হতাম। (ইসলামিক ফাউন্ডেশন ৬৮৪২, ইসলামিক সেন্টার ৬৮৯৮)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7103,
			"arabicnumber": "2812.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৬, আন্তর্জাতিক নাম্বারঃ ২৮১২ ৬৯৯৬-(৬৫/২৮১২) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি, তিনি বলেন, আরব ভূখণ্ডে মুসল্লীগণ শাইতানের (শয়তানের) উপাসনা করবে, এ বিষয়ে শাইতান (শয়তান) নিরাশ হয়ে পড়েছে। তবে তাদের একজনকে অন্যের বিরুদ্ধে উসকিয়ে দেয়ার ব্যাপারে নিরাশ হয়নি। (ইসলামিক ফাউন্ডেশন ৬৮৪৩, ইসলামিক সেন্টার ৬৮৯৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7104,
			"arabicnumber": "2812.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৭, আন্তর্জাতিক নাম্বারঃ ২৮১২ ৬৯৯৭-(…/...) আবু বাকর ইবনু আবু শাইবাহ, আবু কুরায়ব (রহঃ) ..... আ'মাশ (রহঃ) হতে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮৪৪, ইসলামিক সেন্টার ৬৯০০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7105,
			"arabicnumber": "2813.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৮, আন্তর্জাতিক নাম্বারঃ ২৮১৩ ৬৯৯৮-(৬৬/২৮১৩) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি। তিনি বলেন, নিশ্চয়ই ইবলীসের আরশ সমুদ্রের উপর স্থিরকৃত। সে লোকেদেরকে ফিতনায় নিপতিত করার উদ্দেশে তার বাহিনী পাঠায়। শাইতানের (শয়তানের) কাছে সবচেয়ে বড় সে-ই, যে সবচেয়ে বেশি ফিতনাহ সৃষ্টিকারী। (ইসলামিক ফাউন্ডেশন ৬৮৪৫, ইসলামিক সেন্টার ৬৯০১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7106,
			"arabicnumber": "2813.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৬৯৯৯, আন্তর্জাতিক নাম্বারঃ ২৮১৩ ৬৯৯৯-(৬৭/...) আবু কুরায়ব, মুহাম্মাদ ইবনুল আলী ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইবলীস পানির উপর তার আরশ স্থাপন করতঃ তার বাহিনী প্রেরণ করে। তন্মধ্যে তার সর্বাধিক নৈকট্য অর্জনকারী সে-ই যে সবচেয়ে বেশী ফিতনাহ সৃষ্টিকারী। তাদের একজন এসে বলে, আমি অমুক অমুক কাজ করেছি। সে বলে, তুমি কিছুই করনি। অতঃপর অন্যজন এসে বলে, অমুকের সাথে আমি সকল প্রকার ধোকার আচরণই করেছি। এমনকি তার থেকে তার স্ত্রীকে আলাদা করে দিয়েছি। তারপর শাইতান (শয়তান) তাকে তার নিকটবর্তী করে নেয় এবং বলে হ্যাঁ, তুমি খুব ভাল। রাবী আ'মাশ বলেন, আমার মনে হয় তিনি বলেছেনঃ অতঃপর শাইতান (শয়তান) তার সাথে আলিঙ্গন করে। (ইসলামিক ফাউন্ডেশন ৬৮৪৬, ইসলামিক সেন্টার ৬৯০২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7107,
			"arabicnumber": "2813.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০০, আন্তর্জাতিক নাম্বারঃ ২৮১৩ ৭০০০-(৬৮/…) সালামাহ ইবনু শাবীব (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, শাইতান (শয়তান) তার সৈন্য বাহিনীকে পাঠিয়ে লোকেদেরকে ফিতনায় নিপতিত করে। তন্মধ্যে সে-ই তার নিকট সবচেয়ে বেশি মর্যাদার অধিকারী যে অধিক ফিতনাহ সৃষ্টিকারী। (ইসলামিক ফাউন্ডেশন ৬৮৪৭ ইসলামিক সেন্টার ৬৯০৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7108,
			"arabicnumber": "2814.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০১, আন্তর্জাতিক নাম্বারঃ ২৮১৪ ৭০০১-(৬৯/২৮১৪) উসমান ইবনু আবূ শাইবাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের প্রত্যেকের সাথেই একটি শাইতান (শয়তান) নির্ধারিত আছে। সহাবাগণ প্রশ্ন করলেন, হে আল্লাহর রসূল! আপনার সাথেও কি? তিনি বললেন, হ্যাঁ, আমার সাথেও ৷ তবে তার মুকাবিলায় আল্লাহ আমাকে সাহায্য করেছেন। এখন আমি তার সম্পর্কে সম্পূর্ণরূপে নিরাপদ। এখন সে আমাকে কল্যাণকর বিষয় ছাড়া কক্ষনো অন্য কিছুর নির্দেশ দেয় না। (ইসলামিক ফাউন্ডেশন ৬৮৪৮, ইসলামিক সেন্টার ৬৯০৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7109,
			"arabicnumber": "2814.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০২, আন্তর্জাতিক নাম্বারঃ ২৮১৪ ৭০০২-(.../...) ইবনুল মুসান্না, ইবনু বাশশার (রহঃ) ও আবু বকর ইবনু শাইবাহ (রহঃ) ..... মানসূর (রহঃ) এর সূত্রে জারীর থেকে অবিকল হাদীস বর্ণনা করেছেন। তবে সুফইয়ান (রহঃ) এর হাদীসের মধ্যে রয়েছে যে, প্রত্যেক মানুষের সাথে একটি শাইতান (শয়তান) সঙ্গীরূপে এবং একজন ফেরেশতা সঙ্গীরূপে নিযুক্ত রয়েছে। (ইসলামিক ফাউন্ডেশন ৬৮৪৯, ইসলামিক সেন্টার ৬৯০৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7110,
			"arabicnumber": "2815",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০৩, আন্তর্জাতিক নাম্বারঃ ২৮১৫ ৭০০৩-(৭০/২৮১৫) হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশাহ সিদ্দীকা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, কোন এক রজনীতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কাছ থেকে বের হলেন। তিনি বলেন, এতে আমার মনে কিছুটা অহমিকা আসল। তারপর তিনি এসে আমার অবস্থা অবলোকন করে বললেন, হে আয়িশাহ! তোমার কি হয়েছে? তুমি কি ঈর্ষাপরায়ণ হয়েছ? উত্তরে আমি বললাম, আমার ন্যায় মহিলা আপনার ন্যায় স্বামীর প্রতি কেন ঈৰ্ষাপরায়ণ হবে না? এ কথা শুনে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার শাইতান (শয়তান) মনে হয় তোমার কাছে এসেছে? তখন তিনি বললেন, হে আল্লাহর রসূল! আমার সঙ্গেও কি শাইতান (শয়তান) রয়েছে? তিনি বললেন, হ্যাঁ, অবশ্যই। তারপর আমি বললাম, প্রত্যেক মানুষের সাথেই কি শাইতান (শয়তান) রয়েছে? তিনি বললেন, হ্যাঁ। অতঃপর আমি বললাম, হে আল্লাহর রসূল! আপনার সঙ্গেও কি রয়েছে? তিনি বললেন, হ্যাঁ, আমার সঙ্গেও। তবে আল্লাহ তা’আলা তার মুকাবিলায় আমাকে সাহায্য করেছেন। এখন তার ব্যাপারে আমি সম্পূর্ণরূপে নিরাপদ। (ইসলামিক ফাউন্ডেশন ৬৮৫০, ইসলামিক সেন্টার ৬৯০৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7113,
			"arabicnumber": "2816.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০৬, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০০৬-(৭২/...) কুতাইবাহ ইবনু সাঈদ (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের মাঝে এমন কোন লোক নেই, যার আমল তাকে জান্নাতে দাখিল করাতে পারে। অতঃপর তাকে জিজ্ঞেস করা হলো, হে আল্লাহর রসূল! আপনিও কি নন? তিনি বললেন, হ্যাঁ আমিও নই। তবে আল্লাহ যদি তার অনুগ্রহ দ্বারা আমাকে আবৃত করে নেন। (ইসলামিক ফাউন্ডেশন ৬৮৫২, ইসলামিক সেন্টার ৬৯০৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7114,
			"arabicnumber": "2816.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০৭, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০০৭-(৭৩/...) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের মাঝে এমন কোন লোক নেই, যার আমল তাকে নাযাত দিতে পারে। সহাবাগণ জিজ্ঞেস করলেন, হে আল্লাহর রসূল! আপনিও কি নন? জবাবে তিনি বললেন, আমিও নই। তবে যদি আল্লাহ তা’আলা আমাকে তার মার্জনা ও করুণা দ্বারা ঢেকে নেন। রাবী ইবনু আওন (রহঃ) নিজ হাত দ্বারা নিজ মাথার দিকে ইশারা করে বললেন, আমিও না। হ্যাঁ, যদি আল্লাহ তা’আলা তার মার্জনা ও করুণা দ্বারা আমাকে ঢেকে ফেলেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৩, ইসলামিক সেন্টার ৬৯১০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7115,
			"arabicnumber": "2816.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০৮, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০০৮-(৭৪/...) যুহায়র ইবনু হারব (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এমন কোন লোক নই, যার আমল তাকে মুক্তি দিতে পারে। তারা বললেন, হে আল্লাহর রসূল! আপনিও কি নন? তিনি বলেন, আমিও নই। একমাত্র প্রত্যাশা এই যে, যদি আল্লাহ তা’আলা আমাকে তার করুণা দ্বারা সহায়তা করেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৪, ইসলামিক সেন্টার ৬৯১১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7116,
			"arabicnumber": "2816.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০০৯, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০০৯-(৭৫/…) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের কারো আমল তাকে জান্নাতে প্রবেশ করাতে পারবে না। সহাবগণ বললেন, হে আল্লাহর রসূল! আপনিও কি নন? তিনি বললেনঃ আমিও নই। তবে যদি আল্লাহ তা’আলা আমাকে তাঁর অনুগ্রহ ও করুণা দ্বারা ঢেকে নেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৫, ইসলামিক সেন্টার ৬৯১২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7117,
			"arabicnumber": "2816.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১০, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০১০-(৭৬/…) মুহাম্মদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) .... আবু হুরাইরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সঠিক পথে কায়িম থাকো এবং কমপক্ষে তার কাছাকাছি থাক। নিশ্চিতভাবে তোমরা জেনে রাখো, তোমাদের কেউ আমলের দ্বারা মুক্তি পাবে না। সহাবাগণ বললেন, হে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনিও নন? তিনি বললেন, হ্যাঁ, আমিও নই। তবে আল্লাহ তা’আলা যদি স্বীয় রহমত ও অনুগ্রহ দ্বারা আমাকে ঢেকে রাখেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৬, ইসলামিক সেন্টার ৬৯১৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7118,
			"arabicnumber": "2817.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১১, আন্তর্জাতিক নাম্বারঃ ২৮১৭ ৭০১১-(…/২৮১৭) ইবনু নুমায়র (রহঃ) ..... জাবির (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৭, ইসলামিক সেন্টার ৬৯১৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7119,
			"arabicnumber": "2817.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১২, আন্তর্জাতিক নাম্বারঃ ২৮১৭ ৭০১২-(…/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আ'মাশ (রহঃ) এর সানাদে ইবনু নুমায়র (রহঃ) এর অবিকল বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশন ৬৮৫৮, ইসলামিক সেন্টার ৬৯১৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7120,
			"arabicnumber": "2816.08",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৩, আন্তর্জাতিক নাম্বারঃ ২৮১৬ ৭০১৩-(.../২৮১৬) আবূ বাকর ইবনু আবূ শাইবাহ ও আবু কুরায়ব (রহঃ) ... আবু হুরাইরাহ (রাযিঃ) এর সানাদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অবিকল বর্ণনা করেছেন, তবে তাতে বর্ধিত আছে। অর্থাৎ- তোমরা সুসংবাদ গ্রহণ কর। (ইসলামিক ফাউন্ডেশন ৬৮৫৯, ইসলামিক সেন্টার ৬৯১৬)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7121,
			"arabicnumber": "2817.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৪, আন্তর্জাতিক নাম্বারঃ ২৮১৭ ৭০১৪-(৭৭/২৮১৭) সালামাহ্ ইবনু শাবীব (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তোমাদের কোন লোক তার আমল দ্বারা জান্নাতে প্রবেশ করতে পারবে না এবং জাহান্নাম থেকে মুক্তি পাবে না। আর আল্লাহর রহমত ব্যতীত আমি নিজেও বাঁচতে পারব না। (ইসলামিক ফাউন্ডেশন ৬৮৬০, ইসলামিক সেন্টার ৬৯১৭)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7122,
			"arabicnumber": "2818.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৫, আন্তর্জাতিক নাম্বারঃ ২৮১৮ ৭০১৫-(৭৮/২৮১৮) ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মধ্যম পন্থা অবলম্বন কর, এর কাছাকাছি পথে থেকো এবং সুসংবাদ গ্রহণ কর, কারো আমলই তাকে জান্নাতে দাখিল করাতে পারবে না। সহাবাগণ জিজ্ঞেস করলেন, হে আল্লাহর রসূল! আপনিও কি নন? তিনি বললেন, আমিও নই। তবে হ্যাঁ, যদি আল্লাহ তা’আলা আমাকে তার রহমত দ্বারা ঢেকে নেন। তোমরা জেনে রাখো, নিয়মিত ‘আমলই আল্লাহর কাছে সবচেয়ে বেশী পছন্দের আমল, যদিও তা পরিমাণে কম হয়। (ইসলামিক ফাউন্ডেশন ৬৮৬১, ইসলামিক সেন্টার ৬৯১৮) হাসান আল হুলওয়ানী (রহঃ) ..... মূসা ইবনু উকবাহ (রাযিঃ) থেকে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। কিন্তু তাতে তারা وَأَبْشِرُوا (সুসংবাদ গ্রহণ কর) শব্দটি বর্ণনা করেননি। (ইসলামিক ফাউন্ডেশন ৬৮৬২, ইসলামিক সেন্টার ৬৯১৯)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7123,
			"arabicnumber": "2818.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7124,
			"arabicnumber": "2819.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৬, আন্তর্জাতিক নাম্বারঃ ২৮১৯ ৭০১৬-(৭৯/২৮১৯) কুতাইবাহ্ ইবনু সাঈদ (রহঃ) ..... মুগীরাহ ইবনু শুবাহু (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমনভাবে সালাত আদায় করেছেন যে, তার দু’পা ফুলে যেত। এ দেখে তাকে বলা হলো, আপনি এত কষ্ট করছেন কেন? আপনার তো পূর্বাপর যাবতীয় ত্রুটি-বিচ্যুতি মাফ করে দেয়া হয়েছে। এ কথার প্রত্যুত্তরে তিনি বললেন, আমি কি শুকরগুজার বান্দা হিসেবে পরিণত হব না? (ইসলামিক ফাউন্ডেশন ৬৮৬৩, ইসলামিক সেন্টার ৬৯২০)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7125,
			"arabicnumber": "2819.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৭, আন্তর্জাতিক নাম্বারঃ ২৮১৯ ৭০১৭-(৮০/…) আবু বকর ইবনু আবু শাইবাহ ও ইবনু নুমায়র (রহঃ) ..... মুগীরাহ ইবনু শুবাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতে এমনভাবে দাঁড়িয়ে থাকতেন যে, এতে তার দু’পা ফুলে যেতো। এ দেখে সহাবাগণ বললেন, আল্লাহ তো আপনার আগের ও পরের যাবতীয় ত্রুটি-বিচ্যুতি মাফ করে দিয়েছেন। এ কথা শুনে তিনি বললেন, আমি কি শুকরগুজার বান্দা হব না? (ইসলামিক ফাউন্ডেশন ৬৮৬৪, ইসলামিক সেন্টার ৬৯২১)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7126,
			"arabicnumber": "2820",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৮, আন্তর্জাতিক নাম্বারঃ ২৮২০ ৭০১৮-(৮১/২৮২০) হারূন ইবনু মা’রূফ ও হারূন ইবনু সাঈদ আল আইলী (রহঃ) ..... আয়িশাহ্ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাত আদায় করতেন তখন এত বেশি দাঁড়িয়ে থাকতেন যে এতে তার দু’পা ফুলে যেত। এ দেখে আয়িশাহ্ (রাযিঃ) বললেন, হে আল্লাহর রসূল! আপনি এরূপ করছেন অথচ আপনার পূর্বাপর যাবতীয় ত্রুটি-বিচ্যুতি মাফ করে দেয়া হয়েছে। এ কথা শুনে তিনি বললেন, হে ‘আয়িশাহ আমি কি শুকরগুজার বান্দা হব না? (ইসলামিক ফাউন্ডেশন ৬৮৬৫, ইসলামিক সেন্টার ৬৯২২)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7127,
			"arabicnumber": "2821.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০১৯, আন্তর্জাতিক নাম্বারঃ ২৮২১ ৭০১৯-(৮২/২৮২১) আবূ বাকর ইবনু আবূ শাইবাহ, ইবনু নুমায়র (রহঃ) ..... শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবদুল্লাহ (রাযিঃ) এর অপেক্ষায় আমরা তার (বাড়ীর) দ্বারপ্রান্তে বসা ছিলাম। এ সময় ইয়াযীদ ইবনু মুআবিয়াহ্ নাখাঈ (রহঃ) আমাদের পাশ দিয়ে অতিক্রম করতে লাগলেন। আমরা তাকে বললাম, আপনি তাকে আমাদের অবস্থানের সংবাদটি দিন। তিনি ভেতরে তার নিকট গেলেন। আমনি দেরী না করে আবদুল্লাহ (রাযিঃ) আমাদের সম্মুখে বেরিয়ে আসলেন। তারপর তিনি বললেন, তোমাদের অবস্থানের সংবাদ আমাকে পৌছানো হয়েছে। তবে তোমাদের কাছে আসতে এ জিনিসই আমাকে নিষেধ করেছে যে, আমি যেন তোমাদেরকে বিরক্ত না করে ফেলি। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের উদ্দেশে নির্ধারিত দিনে উপদেশ দিতেন, আমাদের মধ্যে যাতে বিরক্ত ভাব সৃষ্টি না হয়। (ইসলামিক ফাউন্ডেশন ৬৮৬৬, ইসলামিক সেন্টার ৬৯২৩)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7128,
			"arabicnumber": "2821.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০২০, আন্তর্জাতিক নাম্বারঃ ২৮২১ ৭০২০-(.../...) আবূ সাঈদ আল আশাজ্জ ও মিনজাব ইবনুল হারিস আত তামীমী, ইসহাক ইবনু ইবরাহীম ও আলী ইবনু খাশরাম (রহঃ), ইবনু আবূ উমর (রহঃ) ..... আমাশ (রহঃ) হতে এ সূত্রে অবিকল হাদীস বর্ণনা করেছেন। মিনজাব আরও উল্লেখ করেছেন যে, ইবনু মুসহির হতে। তিনি বলেন, আ'মাশ বলেছেন, ‘আমর ইবনু মুররাহ হতে, তিনি শাকীক হতে, তিনি আবদুল্লাহ হতে। (ইসলামিক ফাউন্ডেশন ৬৮৬৭ ইসলামিক সেন্টার ৬৯২৪)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7129,
			"arabicnumber": "2821.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০২১, আন্তর্জাতিক নাম্বারঃ ২৮২১ ৭০২১-(৮৩/...) ইসহাক ইবনু ইবরাহীম, ইবনু আবূ উমর (রহঃ) ..... ওয়ায়িল এর পিতা শাকীক (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবদুল্লাহ (রাযিঃ) প্রত্যেক বৃহস্পতিবার দিন আমাদেরকে উপদেশ দিতেন। এক লোক তাকে বললেন, হে আবদুর রহমানের পিতা! আমরা আপনার কাছ থেকে হাদীস বর্ণনা শুনতে ভালো লাগে এবং ইচ্ছা পোষণ করি যে, আপনি আমাদের কাছে প্রত্যেক দিন হাদীস বর্ণনা করেন। এ কথা শুনে তিনি বললেন, এ কাজ হতে আমাকে যা বিরত রাখে তা হলো, আমি তোমাদেরকে বিরক্ত করা পছন্দ করি না, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবস্থার প্রতি লক্ষ্য রেখে নির্ধারিত দিনে উপদেশ দিতেন, আমরা যাতে বিরক্ত না হই। (ইসলামিক ফাউন্ডেশন ৬৮৬৮, ইসলামিক সেন্টার ৬৯২৫)",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 82
			}
		}
	]
}