{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1951,
			"arabicnumber": "844.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৩৬, আন্তর্জাতিক নাম্বারঃ ৮৪৪ ১৮৩৬-(১/৮৪৪) ইয়াহইয়া ইবনু ইয়াহইয়া আত তামিমী ও মুহাম্মাদ ইবনু রুমূহ ইবনু মুহাজির, কুতায়বাহ (রহঃ) ..... আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ তোমাদের কেউ জুমুআর সালাতে আসতে মনস্থ করলে সে যেন গোসল করে। (ইসলামী ফাউন্ডেশন ১৮২১, ইসলামীক সেন্টার ১৮২৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": "844.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৩৭, আন্তর্জাতিক নাম্বারঃ ৮৪৪ ১৮৩৭-(২/...) কুতায়বাহ ইবনু সাঈদ, ইবনু রুমূহ (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বারের উপর দাঁড়ানো অবস্থায় বলেনঃ তোমাদের মধ্যে যে ব্যক্তি জুমুআর সালাতে যায় সে যেন গোসল করে। (ইসলামী ফাউন্ডেশন ১৮২২, ইসলামীক সেন্টার ১৮২৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": "844.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৩৮, আন্তর্জাতিক নাম্বারঃ ৮৪৪ ১৮৩৮-(.../...) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ১৮২৩, ইসলামীক সেন্টার ১৮৩০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": "844.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৩৯, আন্তর্জাতিক নাম্বারঃ ৮৪৪ ১৮৩৯-(.../...) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি ..... পূর্বোক্ত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন, ১৮২৪, ইসলামীক সেন্টার ১৮৩১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": "845.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪০, আন্তর্জাতিক নাম্বারঃ ৮৪৫ ১৮৪০-(৩/৮৪৫) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত একদা জুমুআর দিন উমর ইবনুল খাত্ত্বাব (রাযিঃ) জনগণের উদ্দেশে খুতবাহ দিচ্ছিলেন। এমতাবস্থায় রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্যকার জনৈক ব্যক্তি প্রবেশ করলে উমর (রাযিঃ) তাকে ডেকে বলেন, এটা কোন সময়? তিনি বলেন, আমি আজ খুব ব্যস্ত ছিলাম এবং বাড়ীতে যাওয়ার অবসর পাইনি। এমতাবস্থায় আযান শুনতে পেলাম। তাই আমি ওযুর অতিরিক্ত কিছুই করতে পারিনি। উমর (রাযিঃ) বলেন, শুধু ওযুও চলে, তবে তুমি জান যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গোসল করার নির্দেশ দিতেন। (ইসলামী ফাউন্ডেশন ১৮২৫, ইসলামীক সেন্টার ১৮৩২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": "845.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪১, আন্তর্জাতিক নাম্বারঃ ৮৪৫ ১৮৪১-(৪/...) ইসহাক্‌ ইবনু ইবরাহীম (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা জুমুআর দিন উমার ইবনুল খাত্ত্বাব (রাযিঃ) লোকদের উদ্দেশে ভাষণ দিচ্ছিলেন। তখন উসমান ইবনু আফফান (রাযিঃ) প্রবেশ করেন। উমর (রাযিঃ) তার প্রতি ইঙ্গিত করে বলেন, লোকদের কী হ’ল যে, তারা আযানের পরও (মসজিদে আসতে) বিলম্ব করে। উসমান (রাযিঃ) বলেন, হে আমীরুল মু'মিনীন! আমি আযান শোনার পর ওযু করা ছাড়া অতিরিক্ত আর কিছু করিনি, অতঃপর এসে পৌছেছি। উমর (রাযিঃ) বলেন, ওযুও চলে তবে আপনারা কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেননি, তোমাদের কেউ যখন জুমু'আর সালাতে আসে সে যেন গোসল করে? (ইসলামী ফাউন্ডেশন, ১৮২৬, ইসলামীক সেন্টার ১৮৩৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": "846.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪২, আন্তর্জাতিক নাম্বারঃ ৮৪৬ ১৮৪২-(৫/৮৪৬) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রত্যেক প্রাপ্তবয়স্ক ব্যক্তির জুমুআর দিন গোসল করা অপরিহার্য। (ইসলামী ফাউন্ডেশন ১৮২৭, ইসলামীক সেন্টার ১৮৩৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": "847.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৩, আন্তর্জাতিক নাম্বারঃ ৮৪৭ ১৮৪৩-(৬/৮৪৭) হারূন ইবনু সাঈদ আল আয়লী ও আহমাদ ইবনু ঈসা (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, লোকজন তাদের বাড়ি-ঘর থেকে এবং মদীনার উপকণ্ঠ থেকে জুমুআর সালাত আদায় করতে আসত। তারা আবা (এক প্রকার ঢিলা পোশাক) পরিধান করে আসত এবং তাতে ময়লা লেগে যেত। এতে তাদের দেহ নিৰ্গত ঘাম থেকে দুর্গন্ধ ছড়াত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা যদি তোমাদের দিনটিতে অধিক পবিত্রতা অর্জন করতে, তোমরা যদি এ দিনে পবিত্রতা অর্জন করতে! (ইসলামী ফাউন্ডেশন, ১৮২৮, ইসলামীক সেন্টার ১৮৩৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": "847.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৪, আন্তর্জাতিক নাম্বারঃ ৮৪৭ ১৮৪৪-(.../...) মুহাম্মাদ ইবনু রুমূহ (রহঃ) ..... আয়িশাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, লোকজন ছিল শ্রমজীবী। তাদের কাজের জন্য বিকল্প লোক ছিল না। তাদের (ঘৰ্মাক্ত) দেহে দুৰ্গন্ধ ছড়াত। তাই তাদের বলা হ'ল, তোমরা যদি জুমুআর দিন গোসল করতে! (ইসলামী ফাউন্ডেশন, ১৮২৯, ইসলামীক সেন্টার ১৮৩৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": "846.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৫, আন্তর্জাতিক নাম্বারঃ ৮৪৬ ১৮৪৫-(৭/৮৪৬) আমর ইবনু সাওওয়াদ আল আমির (রহঃ) ..... আবূ সাঈদ আল খুদরী (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জুমু'আর দিন প্রত্যেক প্রাপ্তবয়স্ক ব্যক্তির গোসল ও মিসওয়াক করা কর্তব্য এবং সামর্থ্য থাকলে সে যেন সুগন্ধি ব্যবহার করে। অধস্তন বর্ণনাকারী বুকায়র আবদুর রহমান-এর উল্লেখ করেননি এবং সুগন্ধির ব্যাপারে তার বর্ণনায় আছেঃ \"এমনকি স্ত্রীর সুগন্ধি থেকে হলেও।” (ইসলামী ফাউন্ডেশন ১৮৩০, ইসলামীক সেন্টার ১৮৩৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": "848.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৬, আন্তর্জাতিক নাম্বারঃ ৮৪৮ ১৮৪৬-(৮/৮৪৮) হাসান আল হুলওয়ানী, মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। তিনি জুমুআর দিন গোসল সম্পর্কে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণী উল্লেখ করেছেন। তাউস (রহঃ) বলেন, আমি ইবনু আব্বাস (রাযিঃ) কে বললাম, সে সুগন্ধি ব্যবহার করবে, না তৈল ব্যবহার করবে, যদি তা তার পরিবারের মওজুদ থাকে? তিনি বলেন, আমি তা জানি না। (ইসলামী ফাউন্ডেশন ১৮৩১, ইসলামীক সেন্টার ১৮৩৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": "848.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৭, আন্তর্জাতিক নাম্বারঃ ৮৪৮ ১৮৪৭-(.../...) ইসহাক ইবনু ইবরাহীম, হারূন ইবনু আবদুল্লাহ (রহঃ) ..... উভয়ে একই সানাদে ইবনু জুরায়জ (রাযিঃ) থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ১৮৩২, ইসলামীক সেন্টার ১৮৩৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": "849",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৮, আন্তর্জাতিক নাম্বারঃ ৮৪৯ ১৮৪৮-(৯/৮৪৯) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন প্রত্যেক মুসলিমদের ওপর আল্লাহর অধিকার এই যে, সে প্রতি সাতদিন অন্তর গোসল করবে, মাথা ও দেহ ধৌত করবে। (ইসলামী ফাউন্ডেশন ১৮৩৩, ইসলামীক সেন্টার ১৮৪০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": "850.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৪৯, আন্তর্জাতিক নাম্বারঃ ৮৫০ ১৮৪৯-(১০/৮৫০) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি জুমুআর দিন জানাবাতের (ফরয গোসল) গোসলের মতো গোসল করল, অতঃপর দিনের প্রথমভাগে মসজিদে এলো, সে যেন একটি উট কুরবানী করল। অতঃপর যে ব্যক্তি আসলো সে যেন একটি গরু কুরবানী করল, অতঃপর যে ব্যক্তি আসলো সে যেন একটি ভেড়া কুরবানী করল, অতঃপর যে ব্যক্তি আসলো সে যেন একটি মুরগী কুরবানী করল, অতঃপর যে ব্যক্তি আসলো সে যেন একটি ডিম কুরবানী করল। অতঃপর ইমাম যখন খুতবাহ দিতে (দাঁড়ালেন) তখন মালাকগণ খুতবাহ শোনার জন্য উপস্থিত হন। (ইসলামী ফাউন্ডেশন ১৮৩৪, ইসলামীক সেন্টার ১৮৪১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": "851.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫০, আন্তর্জাতিক নাম্বারঃ ৮৫১ ১৮৫০-(১১/৮৫১) কুতায়বাহ ইবনু সাঈদ ও মুহাম্মদ ইবনু রুমূহ ইবনু মুহাজির (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইমামের খুতবাহ দানরত অবস্থায় তুমি যদি তোমার সাথীকে বল, 'চুপ কর' তবে তুমি অনৰ্থক কাজ করলে। (ইসলামী ফাউন্ডেশন ১৮৩৫, ইসলামীক সেন্টার ১৮৪২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": "851.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫১, আন্তর্জাতিক নাম্বারঃ ৮৫১ ১৮৫১-(.../...) আবদুল মালিক ইবনু শু'আয়ব ইবনুল লায়স (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে শুনেছি ..... পূর্বোক্ত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৩৬, ইসলামীক সেন্টার ১৮৪৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": "851.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫২, আন্তর্জাতিক নাম্বারঃ ৮৫১ ১৮৫২-(.../...) মুহাম্মাদ ইবনু হাতিম (রহঃ) ..... ইবনু শিহাব (রহঃ) থেকে উভয় সানাদ সূত্রে এ হাদীস পূর্বোক্ত সানাদে বর্ণিত হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে ইবনু জুরায়জ (রহঃ) ইবরাহীম ইবনু আবদুল্লাহ ইবনু কারিয' বলেছেন (আবদুল্লাহ ইবনু ইবরাহীম ইবনু কারিয স্থলে)। (ইসলামী ফাউন্ডেশন ১৮৩৭, ইসলামীক সেন্টার ১৮৪৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": "851.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৩, আন্তর্জাতিক নাম্বারঃ ৮৫১ ১৮৫৩-(১২/...) ইবনু আবূ উমর (রাযিঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জুমুআর দিন ইমামের খুতবাহ চলাকালে তুমি তোমার সার্থীকে যদি বল \"চুপ কর\" তবে, তুমি অনৰ্থক কাজ করলে। আবূয যিনাদ (রহঃ) বলেন, لَغِيتَ আবূ হুরায়রাহ (রাযিঃ) এর গোত্রের ভাষায়, আসলে তা হবে لَغَوْتَ (ইসলামী ফাউন্ডেশন. ১৮৩৮, ইসলামীক সেন্টার ১৮৪৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": "852.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৪, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৪-(১৩/৮৫২) ইয়াহইয়া ইবনু ইয়াহইয়া, কুতীয়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন সম্পর্কে আলোচনা প্রসঙ্গে বলেনঃ তাতে এমন একটি মুহুর্ত আছে যখন কোন মুসলিম বান্দা সালাতরত অবস্থায় আল্লাহর নিকট কিছু প্রার্থনা করলে অবশ্যই তিনি তাকে তা দান করেন। কুতায়বাহ (রাযিঃ)-এর বর্ণনায় আরো আছেঃ তিনি তার হাত দ্বারা মুহুর্তটির স্বল্পতার প্রতি ইঙ্গিত করেন। (ইসলামী ফাউন্ডেশন ১৮৩৯, ইসলামীক সেন্টার ১৮৪৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": "852.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৫, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৫-(১৪/...) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমুআর মধ্যে অবশ্যই এমন একটি মুহুর্ত আছে যখন কোন মুসলিম সালাতরত অবস্থায় আল্লাহর নিকট কল্যাণ প্রার্থনা করে তিনি নিশ্চয়ই তাকে তা দান করেন। তিনি তার হাত দ্বারা সে মুহুর্তটির স্বল্পতার প্রতি ইঙ্গিত করেন। (ইসলামী ফাউন্ডেশন ১৮৪০, ইসলামীক সেন্টার ১৮৪৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": "852.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৬, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৬-(.../...) ইবনুল মুসান্না (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন ..... পূর্বোক্ত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৪১, ইসলামীক সেন্টার ১৮৪৮০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": "852.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৭, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৭-(.../...) হুমায়দ ইবনু মাস'আদাহ আল বাহিলী (রহঃ) ... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন ... পূর্বোক্ত হাদীসের অনুরূপ।",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": "852.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৮, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৮-(১৫/...) আবদুর রহমান ইবনু সাল্লাম আল জুমাহী (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, জুমুআর দিনের মধ্যে অবশ্যই এমন একটি মুহুর্ত আছে যখন কোন মুসলিম আল্লাহর নিকট কল্যাণ প্রার্থনা করে নিশ্চয়ই তিনি তাকে তা দান করেন। তিনি বলেনঃ সে মুহুর্তটি অতি স্বল্প। (ইসলামী ফাউন্ডেশন ১৮৪৩, ইসলামীক সেন্টার ১৮৫০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": "852.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৫৯, আন্তর্জাতিক নাম্বারঃ ৮৫২ ১৮৫৯-(.../....) মুহাম্মাদ ইবনু রাফি (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এ সানাদ সূত্রে \"সে মুহুর্তটি স্বল্প\" কথাটি উল্লেখ নেই। (ইসলামী ফাউন্ডেশন ১৮৪৪, ইসলামীক সেন্টার ১৮৫১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": "853",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬০, আন্তর্জাতিক নাম্বারঃ ৮৫৩ ১৮৬০-(১৬/৮৫৩) আবুত তহির, আলী ইবনু খশরাম, হারূন ইবনু সাঈদ আল আয়লী ও আহমাদ ইবনু ঈসা (রহঃ) ... আবূ মূসা আল আশ'আর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আবদুল্লাহ ইবনু উমর (রাযিঃ) আমাকে জিজ্ঞেস করলেন, তুমি কি তোমার পিতাকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে জুমুআর দিনের বিশেষ মুহুর্তটি সম্পর্কে হাদীস বর্ণনা করতে শুনেছ? বর্ণনাকারী বলেনঃ আমি বললাম, হ্যাঁ। আমি পিতাকে বলতে শুনেছি, তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ ইমামের বসা থেকে সালাত শেষ করার মধ্যবর্তী সময়ের মধ্যে সে মুহুর্তটি নিহিত। (ইসলামী ফাউন্ডেশন ১৮৪৫, ইসলামীক সেন্টার ১৮৫২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": "854.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬১, আন্তর্জাতিক নাম্বারঃ ৮৫৪ ১৮৬১-(১৭/৮৫৪) হারমালাহ ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সূর্য উদিত হওয়ার দিনগুলোর মধ্যে জুমুআর দিন সর্বোত্তম। এ দিন আদম (আঃ)-কে সৃষ্টি করা হয়েছে, এ দিন তাকে জান্নাতে দাখিল করা হয়েছে এবং এ দিন তাঁকে জান্নাত থেকে বের করে দেয়া হয়। (ইসলামী ফাউন্ডেশন ১৮৪৬, ইসলামীক সেন্টার ১৮৫৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": "854.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬২, আন্তর্জাতিক নাম্বারঃ ৮৫৪ ১৮৬২-(১৮/...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন সূর্য উদিত হওয়ার দিনগুলোর মধ্যে জুমুআর দিন সর্বোত্তম। এ দিন আদম (আঃ) কে সৃষ্টি করা হয়েছে, এ দিন তাকে জান্নাতে প্রবেশ করানো হয়েছে এবং এ দিন সেখান থেকে তাকে বের করে দেয়া হয়েছে, জুমুআর দিনই কিয়ামত সংঘটিত হবে। (ইসলামী ফাউন্ডেশন ১৮৪৭, ইসলামীক সেন্টার, ১৮৫৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": "855.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৩, আন্তর্জাতিক নাম্বারঃ ৮৫৫ ১৮৬৩-(১৯/৮৫৫) 'আমর আন নাকিদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা সর্বশেষ উম্মাত কিন্তু কিয়ামতের দিন আমরা হব অগ্রগামী। যদিও সকল উম্মাতকে কিতাব দেয়া হয়েছে আমাদের পূর্বে, আর আমাদের কিতাব দেয়া হয়েছে সকল উম্মাতের শেষে অতঃপর যে দিনটি আল্লাহ আমাদের জন্য নির্ধারণ করেছেন, সেদিন সম্পর্কে তিনি আমাদের হিদায়াতও দান করেছেন। সেদিনের ব্যাপারে অন্যান্যরা আমাদের পিছনে রয়েছে, (যেমন) ইয়াহুদীরা (আমাদের) পরের দিন এবং খৃষ্টানরা তাদেরও পরেন দিন। (ইসলামী ফাউন্ডেশন ১৮৪৮, ইসলামীক সেন্টার ১৮৫৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": "855.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৪, আন্তর্জাতিক নাম্বারঃ ৮৫৫ ১৮৬৪-(.../...) ইবনু আবূ উমর (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা সবশেষে আগত উম্মাত এবং আমরা কিয়ামতের দিন হ’ব অগ্রবর্তী ... পূর্বোক্ত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৪৯, ইসলামীক সেন্টার ১৮৫৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": "855.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৫, আন্তর্জাতিক নাম্বারঃ ৮৫৫ ১৮৬৫-(২০/...) কুতায়বাহ ইবনু সাঈদ ও যুহারর ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা সবশেষে আগত উম্মাত, কিন্তু কিয়ামতের দিন আমরা হব সর্বগ্রবর্তী, আমরাই প্রথম জান্নাতে প্রবেশ করব। অথচ তাদেরকে কিতাব দেয়া হয়েছে আমাদের পূর্বে এবং আমাদেরকে তা দেয়া হয়েছে তাদের পরে। তারা বিরোধে লিপ্ত হয়ে পড়ল কিন্তু তারা যে সত্য দীনের ব্যাপারে বিরোধে লিপ্ত হয়েছিল, আল্লাহ আমাদেরকে সে দিন সম্পর্কে হিদায়াত দান করেছেন। তিনি বলেনঃ আমাদের জন্য আজকে জুমুআর দিন আর ইয়াহুদীদের জন্য পরের দিন এবং খৃষ্টানদের জন্য তারও পরের দিন। (ইসলামী ফাউন্ডেশন ১৮৫০, ইসলামীক সেন্টার ১৮৫৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": "855.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৬, আন্তর্জাতিক নাম্বারঃ ৮৫৫ ১৮৬৬-(২১/...) মুহাম্মাদ ইবনু রাফি' (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমরা সবশেষে আগত উম্মাত কিন্তু হিদায়াতের দিন থাকব সবার অগ্রবর্তী। অথচ তাদেরকে কিতাব দেয়া হয়েছে আমাদের আগে এবং আমাদেরকে কিতাব দেয়া হয়েছে তাদের পরে। এটি তাদের সেদিন যা তাদের জন্য নির্ধারিত করা হয়েছিল, কিন্তু তারা এ দিনটি সম্পর্কে মতভেদে লিপ্ত হ'ল। আল্লাহ আমাদেরকে দিনটির ব্যাপারে হিদায়াত দান করেছেন। অতএব, তারা আমাদের পশ্চাদগামী, ইয়াহুদীরা পরের দিন (শনিবার) এবং খৃষ্টানরা তারও পরের দিন (রবিবার)। (ইসলামী ফাউন্ডেশন ১৮৫১, ইসলামীক সেন্টার ১৮৫৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": "856.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৭, আন্তর্জাতিক নাম্বারঃ ৮৫৬ ১৮৬৭-(২২/৮৫৬) আবূ কুরায়ব ও ওয়াসিল ইবনু আবদুল আ'লা (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তারা বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ আমাদের পূর্ববতীদেরকে জুমুআর দিন সম্পর্কে সঠিক পথের সন্ধান দেননি বিরোধে লিপ্ত হওয়ার কারণে। তাই ইয়াহুদীদের জন্য শনিবার এবং খৃষ্টানদের জন্য রবিবার জুমুআহ নির্ধারিত হয়েছে। আল্লাহ আমাদেরকে (পৃথিবীতে) আনলেন এবং আমাদেরকে জুমুআর দিনের সঠিক সন্ধান দিলেন। অতএব তিনি জুমু'আর দিন, শনিবার ও রবিবার এভাবে (বিন্যাস) করলেন, এভাবে তারা কিয়ামতের দিন আমাদের পশ্চাদবর্তী হবে। আমরা পৃথিবীবাসীর মধ্যে শেষে আগমনকারী উম্মত এবং কিয়ামতের দিন হ’ব সর্বপ্রথম। যাদের সমগ্র সৃষ্টির সর্বপ্রথম বিচার অনুষ্ঠিত হবে। অধস্তন বর্ণনাকার ওয়াসিল এর বর্ণনায় আছে \"সকলের মধ্যে\"। (ইসলামী ফাউন্ডেশন ১৮৫২, ইসলামীক সেন্টার ১৮৫৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": "856.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৮, আন্তর্জাতিক নাম্বারঃ ৮৫৬ ১৮৬৮-(২৩/...) আবূ কুরায়ব (রহঃ) ..... হুযায়ফাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমাদেরকে জুমুআর দিন সম্পর্কে সঠিক পথের সন্ধান দেয়া হয়েছে এবং আল্লাহ আমাদের পূর্ববর্তীদেরকে সঠিক পথের সন্ধান দেননি। ..... হাদীসের অবশিষ্ট বর্ণনা বর্ণনাকারী ইবনু ফুযায়ল এর বর্ণনার অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৫৩, ইসলামীক সেন্টার ১৮৬০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": "850.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৬৯, আন্তর্জাতিক নাম্বারঃ ৮৫০ ১৮৬৯-(২৪/৮৫০) আবূত ত্বহির, হারমালাহ ও আমর ইবনু সাওওয়াদ আল আমির (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমুআর দিন এলে মসজিদে যতগুলো দরজা আছে তার প্রতিটিতে মালাকগণ (ফেরেশতারা) নিযুক্ত হন এবং তারা আগমনকারীদের নাম ক্রমানুসারে নথি বন্ধ করেন। ইমাম যখন (মিম্বারে) বসেন তখন তারা নথিপত্র গুটিয়ে নিয়ে আলোচনা শোনায় চলে আসেন মসজিদে সর্বপ্রথম আগমনকারী মুসল্লী উট কুরবানীকারীর সমতুল্য, তৎপরে আগমনকারী গরু কুরবানীকারীর সমতুল্য, তৎপরে আগমনকারী মেষ কুরবানীকারীর সমতুল্য, অতঃপর আগমনকারী মুরগী কুরবানীকারীর সমতুল্য, তৎপরে আগমনকারী ডিম দানকারীর সমতুল্য নেকী পাবে। (ইসলামী ফাউন্ডেশন ১৮৫৪, ইসলামীক সেন্টার ১৮৬১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": "850.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭০, আন্তর্জাতিক নাম্বারঃ ৮৫০ ১৮৭০-(.../...) ইয়াহইয়া ইবনু ইয়াহইয়া ও আমর আন নাকিদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) নবী থেকে অনুরূপ বর্ণনা করেছেন। (ইসলামী ফাউন্ডেশন ১৮৫৫, ইসলামীক সেন্টার ১৮৬২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": "850.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭১, আন্তর্জাতিক নাম্বারঃ ৮৫০ ১৮৭১-(২৫/...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মসজিদের দরজাগুলোর প্রতিটিতে একজন করে মালায়িকাহ নিয়োজিত থাকেন। তিনি আগমনকারীদের নাম (তাদের আগমনের) ক্রমানুসারে লিপিবদ্ধ করেন। মসজিদে সর্বপ্রথম আগমনকারী উট কুরবানীকারীর সমতুল্য ..... এভাবে পর্যায়ক্রমে তুলনা করা হয়েছে, এমনকি একটি ডিমের মতো ক্ষুদ্র বস্তু দানের তুলনা দিয়েছেন। ইমাম যখন (খুতবাহ দেয়ার উদ্দেশে মিম্বারে) বলেন তখন নথিপত্র গুটিয়ে ফেলা হয় এবং মালাকগণ (ফেরেশতামণ্ডলী) খুতবার আলোচনা শুনতে হাজির হন। (ইসলামী ফাউন্ডেশন ১৮৫৬, ইসলামীক সেন্টার ১৮৬৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": "857.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭২, আন্তর্জাতিক নাম্বারঃ ৮৫৭ ১৮৭২-(২৬/৮৫৭) উমাইয়্যাহ ইবনু বিস্তাম (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি গোসল করে জুমুআর সালাতে আসল, অতঃপর সাধ্যমত (সুন্নাত) সালাত আদায় করল, অতঃপর ইমামের খুতবাহ শেষ হওয়া পর্যন্ত নীরব থাকল, অতঃপর ইমামের সাথে (জুমুআর) সালাত আদায় করল, এতে তার দু' জুমুআর মধ্যকার দিনসমূহের এবং আরো তিন দিনের পাপ ক্ষমা করে দেয়া হয়। (ইসলামী ফাউন্ডেশন ১৮৫৭, ইসলামীক সেন্টার ১৮৬৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": "857.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৩, আন্তর্জাতিক নাম্বারঃ ৮৫৭ ১৮৭৩-(২৭/...) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি উত্তমরূপে ওযু করার পর জুমুআর সালাতে এলো, নীরবে মনোযোগ সহকারে খুতবাহ শুনল, তার পরবর্তী জুমুআহ পর্যন্ত এবং আরো অতিরিক্ত তিন দিনের পাপ ক্ষমা করে দেয়া হয়। আর যে ব্যক্তি (অহেতুক) কঙ্কর স্পর্শ করল সে অনর্থক, বাতিল, ঘৃণিত ও প্রত্যাখ্যানযোগ্য কাজ করল। (ইসলামী ফাউন্ডেশন ১৮৫৮, ইসলামীক সেন্টার ১৮৬৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": "858.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৪, আন্তর্জাতিক নাম্বারঃ ৮৫৮ ১৮৭৪-(২৮/৮৫৮) আবূ বকর ইবনু আবূ শায়বাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জুমুআর সালাত আদায় করতাম, অতঃপর ফিরে আসতাম এবং আমাদের উষ্ট্রীগুলোকে বিশ্রাম দিতাম। অধস্তন বর্ণনাকারী হাসান বলেন, আমি উধ্বতন বর্ণনাকারী জাফার কে বললাম, সেটা কোন সময় হ’ত? তিনি বলেন, সূর্য চলে যাওয়ার সময়। (ইসলামী ফাউন্ডেশন ১৮৫৯, ইসলামীক সেন্টার ১৮৬৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": "858.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৫, আন্তর্জাতিক নাম্বারঃ ৮৫৮ ১৮৭৫-(২৯/...) কাসিম ইবনু যাকারিয়্যা, আবদুল্লাহ ইবনু আবদুর রহমান আদ দারিমী (রহঃ) ..... আবূ জাফার (রহঃ) থেকে বর্ণিত। তিনি জাবির ইবনু আবদুল্লাহ (রাযিঃ) কে জিজ্ঞেস করেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন মুহুর্তে জুমুআর সালাত আদায় করতেন? তিনি বলেন, তিনি সালাত শেষ করার পর আমরা আমাদের উটের পালের নিকট যেতাম এবং সেগুলোকে বিশ্রাম দিতাম। অধস্তন বর্ণনাকারী আবদুল্লাহ (রহঃ) এর বর্ণনায় আরো আছেঃ যখন সূর্য ঢলে যেত, অর্থাৎ- পানিবাহী উটগুলো (বিশ্রাম নিত)। (ইসলামী ফাউন্ডেশন ১৮৬০, ইসলামীক সেন্টার ১৮৬৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": "859",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৬, আন্তর্জাতিক নাম্বারঃ ৮৫৯ ১৮৭৬-(৩০/৮৫৯) 'আবদুল্লাহ ইবনু মাসলামাহ ইবনু কা'নব ইয়াহইয়া ইবনু ইয়াহইয়া ও ‘আলী ইবনু হুজর (রহঃ) ..... সাহল (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা জুমুআর সালাত আদায়ের পরই বিশ্রাম গ্রহণ করতাম এবং দুপুরের আহার করতাম। ইবনু হুজর (রহঃ) এর বর্ণনায় আরো আছে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে। (ইসলামী ফাউন্ডেশন ১৮৬১, ইসলামীক সেন্টার ১৮৬৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": "860.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৭, আন্তর্জাতিক নাম্বারঃ ৮৬০ ১৮৭৭-(৩১/৮৬০) ইয়াহইয়া ইবনু ইয়াহইয়া ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... সালামাহ ইবনু আকওয়া (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, সূর্য ঢলে যাওয়ার পর আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জুমুআর সালাত আদায় করতাম, অতঃপর ছায়া অনুসরণ করতে করতে ফিরে আসতাম। (ইসলামী ফাউন্ডেশন ১৮৬২, ইসলামীক সেন্টার ১৮৬৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": "860.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৮, আন্তর্জাতিক নাম্বারঃ ৮৬০ ১৮৭৮-(৩২/...) ইসহাক ইবনু ইবরাহীম (রহঃ) ..... সালামাহ ইবনু আকওয়া (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জুমুআর সালাত আদায়ের পর যখন ফিরে আসতাম তখন আমাদের ছায়া গ্রহণের উপযোগী প্রাচীরের কোন ছায়া পড়ত না (অর্থাৎ সূর্য ঢলে যাওয়ার পরপরই সালাত আদায় করা হত)। (ইসলামী ফাউন্ডেশন ১৮৬৩, ইসলামীক সেন্টার ১৮৭০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": "861",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৭৯, আন্তর্জাতিক নাম্বারঃ ৮৬১ ১৮৭৯-(৩৩/৮৬১) উবায়দুল্লাহ ইবনু উমার আল কাওয়ারীরী ও আবূ কামিল আল জাহদারী (রহঃ) ..... ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন দাঁড়িয়ে খুতবাহ দিতেন, অতঃপর বসতেন, অতঃপর দাঁড়াতেন, যেমন আজকাল তোমরা করে থাক। (ইসলামী ফাউন্ডেশন ১৮৬৪, ইসলামীক সেন্টার ১৮৭১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": "862.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮০, আন্তর্জাতিক নাম্বারঃ ৮৬২ ১৮৮০-(৩৪/৮৬২) ইয়াহইয়া ইবনু ইয়াহইয়া, হাসান ইবনুর রাবী' ও আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) .... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি খুতবাহ দিতেন, উভয় খুতবার মাঝখানে বসতেন এবং (খুতবায়) কুরআন পড়তেন এবং জনগণকে উপদেশ দিতেন*। (ইসলামী ফাউন্ডেশন ১৮৬৫, ইসলামীক সেন্টার ১৮৭২) * খুতবাতে আল্লাহর প্রশংসা, নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি দরূদ, সমবেত জনতার জন্য প্রয়োজনীয় নাসীহাত এবং দু'আ থাকতে হবে। এতদ্ভিন্নতা খুতবাহ হবে না। (মুসলিম শারহে নবাবী, ১ম খণ্ড ২৮৪ পৃষ্ঠা) উল্লেখ্য যে, যে নসীহাত জনগণের বোধগম্য ভাষায় হয় না তা কিছুতেই খুতবাহ হবে না। আল্লাহ প্রত্যেক রসূলকে আপন জাতির ভাষার উপরই পাঠিয়েছেন যেন তাদের বর্ণনা দিয়ে বুঝাতে পারেন। (সূরাহ ইবরাহীম ১৪ঃ ৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": "862.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮১, আন্তর্জাতিক নাম্বারঃ ৮৬২ ১৮৮১-(৩৫/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ানো অবস্থায় খুতবাহ দিতেন, অতঃপর বসতেন, অতঃপর দাঁড়িয়ে আবার (দ্বিতীয়) খুতবাহ দিতেন। যে ব্যক্তি তোমাকে অবহিত করেছে যে, তিনি বসা অবস্থায় খুতবাহ দিতেন, সে মিথ্যা বলেছে। আল্লাহর শপথ! আমি নিশ্চয়ই তার সাথে দু'হাজারেরও অধিকবার সালাত আদায় করেছি (জুমু'আর পাঁচ ওয়াক্ত সালাত)। (ইসলামী ফাউন্ডেশন ১৮৬৬, ইসলামীক সেন্টার ১৮৭৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": "863.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮২, আন্তর্জাতিক নাম্বারঃ ৮৬৩ ১৮৮২-(৩৬/৮৬৩) উসমান ইবনু আবূ শায়বাহ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ানো অবস্থায় জুমুআর দিন খুতবাহ দিতেন। একদা জুমুআর সালাতের খুতবাহ চলাকালে সিরিয়ার একটি বণিক এসে পৌছলে বারোজন লোক ব্যতীত সকলে তাদের নিকট ছুটে চলে গেল। তখন সূরাহ জুমুআর এ আয়াত অবতীর্ণ হয়ঃ (অর্থ) \"যখন তারা দেখল ব্যবসা ও কৌতুকের বিষয়, তখন তারা তোমাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল\"- (সূরাহ আল জুমুআহ ৬২ঃ ১১)। (ইসলামী ফাউন্ডেশন ১৮৬৭, ইসলামীক সেন্টার ১৮৭৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": "863.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৩, আন্তর্জাতিক নাম্বারঃ ৮৬৩ ১৮৮৩-(.../...) আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ... হুসায়ন (রহঃ) থেকে একই সানাদে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবাহ দিতেন এবং তিনি \"দাঁড়ানো অবস্থায়\" কথাটুকু উল্লেখ করেননি। (ইসলামী ফাউন্ডেশন ১৮৬৮, ইসলামীক সেন্টার ১৮৭৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": "863.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৪, আন্তর্জাতিক নাম্বারঃ ৮৬৩ ১৮৮৪-(৩৭/...) রিফা'আহ ইবনু হায়সাম আল ওয়াসিতী (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমরা জুমুআর দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। এমতাবস্থায় কিছু ছাতুর চালান এসে পৌছল। বর্ণনাকারী বলেন, লোকজন সেদিকে চলে গেল এবং বারোজন ব্যতীত আর কেউ ছিল না। আমি এদের সাথে ছিলাম। বর্ণনাকারী বলেন, তখন আল্লাহ অবতীর্ণ করেন (অনুবাদঃ) \"যখন তারা দেখল ব্যবসা ও কৌতুকের বিষয়, তখন তারা তোমাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল .....\"- (সূরাহ আল জুমুআহ ৬২ঃ ১১) আয়াতের শেষ পর্যন্ত। (ইসলামী ফাউন্ডেশন ১৮৬৯, ইসলামীক সেন্টার ১৮৭৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": "863.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৫, আন্তর্জাতিক নাম্বারঃ ৮৬৩ ১৮৮৫-(৩৮/...) ইসমাঈল ইবনু সালিম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা এক জুমুআর দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ানো অবস্থায় ছিলেন (জুমুআর খুতবাহ দিচ্ছিলেন)। এমতাবস্থায় একটি বণিক দল মদীনায় এসে পৌছল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ সেদিকে ছুটে গেলেন। এমনকি বারোজন ব্যতীত আর কেউ অবশিষ্ট ছিলেন না। আবূ বাকর ও উমর (রাযিঃ)-ও এদের অন্তর্ভুক্ত ছিলেন। বর্ণনাকারী বলেন, তখন এ আয়াত অবতীর্ণ হয়ঃ \"যখন তারা দেখল ব্যবসা ও কৌতুকের বিষয় তখন তারা তোমাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল- (সূরাহ জুমুআহ ৬২ঃ ১১)\" (ইসলামী ফাউন্ডেশন ১৮৭০, ইসলামীক সেন্টার ১৮৭৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": "864",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৬, আন্তর্জাতিক নাম্বারঃ ৮৬৪ ১৮৮৬-(৩৯/৮৬৪) মুহাম্মাদ ইবনুল মুসান্না ও ইবনু বাশশার (রহঃ) ..... কা'ব ইবনু উজরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, তিনি মসজিদে প্রবেশ করলেন এবং তখন আবদুর রহমান ইবনুল হাকাম বসা অবস্থায় খুতবাহ দিচ্ছিলেন। কা'ব (রাযিঃ) বলেন, তোমরা এ নরাধমের প্রতি লক্ষ্য কর, সে বসে বসে খুতবাহ দিচ্ছে*। অথচ আল্লাহ তা'আলা বলেনঃ \"এবং যখন তারা দেখল ব্যবসা ও কৌতুকের বিষয়, তখন তারা তোমাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল- (সূরাহ আল জুমুআহ ৬২ঃ ১১)।\" (ইসলামী ফাউন্ডেশন ১৮৭১, ইসলামীক সেন্টার ১৮৭৮) * এ হাদীস এবং পূর্বোক্ত হাদীস জুমুআর দিনে বসে খুতবাহ দানকারী ইমামের জন্য হুশিয়ারী যারা একই সাথে দু'টো বিদ’আত জড়ো করেছেন (১) খুতবার পূর্বে বয়ান করা, (২) বসে বসে বয়ান করা।",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": "865",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৭, আন্তর্জাতিক নাম্বারঃ ৮৬৫ ১৮৮৭-(৪০/৮৬৫) হাসান ইবনু আলী আল হুলওয়ানী (রহঃ) ..... আবদুল্লাহ ইবনু উমার ও আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তারা উভয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তার মিম্বারের সিড়িতে দাঁড়িয়ে বলতে শুনেছেনঃ যারা জুমুআর সালাত ত্যাগ করে তাদেরকে এ অভ্যাস বর্জন করতে হবে। নতুবা আল্লাহ তাদের অন্তরে সীল মেরে দিবেন, অতঃপর তারা গাফিলদের অন্তর্ভুক্ত হয়ে যাবে। (ইসলামী ফাউন্ডেশন ১৮৭২, ইসলামীক সেন্টার ১৮৭৯০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": "866.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৮, আন্তর্জাতিক নাম্বারঃ ৮৬৬ ১৮৮৮-(৪১/৮৬৬) হাসান ইবনুর রাবী’ ও আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সালাত আদায় করতাম। তার সালাত ও খুতবাহ ছিল মধ্যম (দীর্ঘও নয় অতি সংক্ষিপ্তও নয়)। (ইসলামী ফাউন্ডেশন ১৮৭৩, ইসলামীক সেন্টার ১৮৮০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": "866.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৮৯, আন্তর্জাতিক নাম্বারঃ ৮৬৬ ১৮৮৯-(৪২/...) আবূ বকর ইবনু আবূ শায়বাহ ও ইবনু নুমায়র (রহঃ) ..... জাবির ইবনু সামুরাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বহু ওয়াক্ত সালাত আদায় করেছি। তার সালাতও ছিল সংক্ষিপ্ত এবং তার খুতবাহও ছিল মধ্যম। অধস্তন বর্ণনাকারী আবূ বাকর যাকারিয়্যা-এর বর্ণনায় আছেঃ সিমাক থেকে। (ইসলামী ফাউন্ডেশন ১৮৭৪, ইসলামীক সেন্টার ১৮৮১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": "867.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯০, আন্তর্জাতিক নাম্বারঃ ৮৬৭ ১৮৯০-(৪৩/৮৬৭) মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খুতবাহ (ভাষণ) দিতেন যখন তার চক্ষুদ্বয় রক্তিম বর্ণ ধারণ করত, কণ্ঠস্বর জোরালো হ'ত এবং তার রাগ বেড়ে যেত, এমনকি মনে হ’ত, তিনি যেন শত্রুবাহিনী সম্পর্কে সতর্ক করছেন আর বলছেনঃ তোমরা ভোরেই আক্রান্ত হবে, তোমরা সন্ধ্যায়ই আক্রান্ত হবে। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আরো বলতেনঃ আমি ও কিয়ামত এ দুটির ন্যায় (স্বল্প ব্যবধান) প্রেরিত হয়েছি, তিনি মধ্যম ও তর্জনী আঙ্গুল মিলিয়ে দেখাতেন। তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আরো বলতেনঃ অতঃপর উত্তম বাণী হ'ল- আল্লাহর কিতাব এবং উত্তম পথ হ’ল মুহাম্মাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রদর্শিত পথ। অতীব নিকৃষ্ট বিষয় হ’ল (ধর্মের মধ্যে) নতুন উদ্ভাবন (বিদ'আত)। প্রতিটি বিদ'আদ ভ্রষ্ট। তিনি আরো বলতেনঃ আমি প্রত্যেক মু'মিন ব্যক্তির জন্য তার নিজের থেকে অধিক উত্তম (কল্যাণকামী)। কোন ব্যক্তি সম্পদ রেখে গেলে তা তার পরিবার-পরিজনের প্রাপ্য। আর কোন ব্যক্তি ঋণ অথবা অসহায় সন্তান রেখে গেলে সেগুলোর দায়িত্ব আমার। (ইসলামী ফাউন্ডেশন ১৮৭৫, ইসলামীক সেন্টার ১৮৮৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": "867.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯১, আন্তর্জাতিক নাম্বারঃ ৮৬৭ ১৮৯১-(৪৪/...) আবদ ইবনু হুমায়দ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন আল্লাহর প্রশংসা ও তার গুণগান করে তার খুতবাহ (ভাষণ) শুরু করতেন, অতঃপর প্রয়োজনীয় কথা বলতেন। (ভাষণে) তাঁর কণ্ঠস্বর জোরালো হ’ত ..... হাদীসের অবশিষ্ট বর্ণনা পূর্ববৎ। (ইসলামী ফাউন্ডেশন ১৮৭৬, ইসলামীক সেন্টার. ১৮৮৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": "867.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯২, আন্তর্জাতিক নাম্বারঃ ৮৬৭ ১৮৯২-(৪৫/...) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের উদ্দেশে প্রদত্ত খুতবায় আল্লাহর যথোপযুক্ত প্রশংসা ও গুণগান করতেন, অতঃপর বলতেনঃ আল্লাহ যাকে হিদায়াত দান করেন তাকে কেউ বিপথগামী করতে পারে না এবং তিনি যাকে বিপথগামী করেন তাকে কেউ হিদায়াত করতে পারে না। সর্বোত্তম বাণী হ’ল আল্লাহর কিতাব, ... অতঃপর হাদীসের অবশিষ্ট বর্ণনা সাকাফী বর্ণিত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৭৭, ইসলামীক সেন্টার ১৮৮৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": "868",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৩, আন্তর্জাতিক নাম্বারঃ ৮৬৮ ১৮৯৩-(৪৬/৮৬৮) ইসহাক ইবনু ইবরাহীম ও মুহাম্মাদ ইবনুল মুসান্না (রহঃ) ..... ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। যিমাদ মক্কায় আগমন করেন। তিনি আযদ শানুয়াহ গোত্রের সদস্য। তিনি বাতাস লাগার ঝাড়ফুঁক করতেন। তিনি মক্কার কতক নির্বোধকে বলতে শুনলেন, মুহাম্মাদ নিশ্চয়ই উম্মাদ। যিমাদ বলেন, আমি যদি লোকটিকে দেখতাম তাহলে আল্লাহ হয়ত আমার হাতে তাকে আরোগ্য দান করতেন। বর্ণনাকারী বলেন, তিনি তার সাথে সাক্ষাত করে বলেন, হে মুহাম্মাদ! আমি এসব বাতাস লাগার ঝাড়ফুঁক করি। আল্লাহ যাকে চান তাকে আমার হাতে আরোগ্য দান করেন। আপনি কি ঝাড়ফুক করাতে চান? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নিশ্চয়ই সমস্ত প্রশংসা আল্লাহর। আমি তার প্রশংসা করি, তার সাহায্য প্রার্থনা করি। আল্লাহ যাকে হিদায়াত দান করেন, কেউ তাকে বিপথগামী করতে পারে না এবং তিনি যাকে বিপথগামী করেন, কেউ তাকে হিদায়াত দান করতে পারে না। আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নেই, তিনি একক, তার কোন শারীক নেই এবং নিশ্চয়ই মুহাম্মাদ তার বান্দা ও রসূল। অতঃপর বর্ণনাকারী বলেন, যিমাদ বললেন, আপনি এ কথাগুলো আমাকে পুনরায় শুনান। অতএব, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে কথাগুলো তাকে তিনবার পুনরাবৃত্তি করে শুনান। বর্ণনাকারী বলেন, যিমাদ বলল, আমি অনেক গণক, যাদুকর ও কবির কথা শুনেছি, কিন্তু আপনার এ কথাগুলোর অনুরূপ কথা আমি শুনিনি। এ কথাগুলো সমুদ্রের গভীরে পৌছে গেছে। বর্ণনাকারী বলেন, যিমাদ বলেন, আপনার হাত প্রসারিত করুন, আমি আপনার নিকট ইসলামের বায়’আত গ্রহণ করব। বর্ণনাকারী বলেন, তিনি তাকে বায়’আত করালেন (ইসলাম গ্রহণ করালেন)। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার সম্প্রদায়ের ক্ষেত্রেও কি (বায়’আত প্রযোজ্য)? যিমাদ বলেন, আমার সম্প্রদায়ের ক্ষেত্রেও। বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি ক্ষুদ্র সামরিক বাহিনী (সারিয়্যা) প্রেরণ করলে তারা তার সম্প্রদায়ের এলাকা দিয়ে অতিক্রম করে। তখন বাহিনী প্রধান সৈন্যবাহিনীকে বলেন, তোমরা কি এদের থেকে কিছু গ্রহণ করেছ? দলের একজন বলল, আমি তাদের থেকে একটি পানি পাত্র নিয়েছি। সেনা নায়ক বলেন, তোমরা সেটি ফেরত দাও। কারণ তারা যিমাদ-এর সম্প্রদায় (তাদের কিছুই গ্রহণ করা বৈধ হবে না। কেননা যিমাদ নিজে এবং নিজের সম্প্রদায়ের পক্ষ থেকে বায়’আত গ্রহণ করেছেন)। (ইসলামী ফাউন্ডেশন ১৮৭৮, ইসলামীক সেন্টার ১৮৮৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": "869",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৪, আন্তর্জাতিক নাম্বারঃ ৮৬৯ ১৮৯৪-(৪৭/৮৬৯) সুরায়জ ইবনু ইউনুস (রহঃ) ..... আবূ ওয়ায়িল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আম্মার (রাযিঃ) আমাদের উদ্দেশে সংক্ষেপে একটি সারগর্ভ ভাষণ দিলেন। তিনি মিম্বার থেকে নামলে আমরা বললাম, হে আবূল ইয়াকযান। আপনি অত্যন্ত সংক্ষিপ্ত ও সারগর্ভ ভাষণ দিয়েছেন, তবে যদি তা কিছুটা দীর্ঘ করতেন। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ কোন ব্যক্তির দীর্ঘ সালাত ও সংক্ষিপ্ত ভাষণ তার প্রজ্ঞার পরিচায়ক। অতএব, তোমরা সালাতকে দীর্ঘ এবং ভাষণকে সংক্ষিপ্ত কর। অবশ্যই কোন কোন ভাষণে যাদুকরি প্রভাব থাকে। (ইসলামী ফাউন্ডেশন ১৮৭৯, ইসলামীক সেন্টার ১৮৮৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": "870",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৫, আন্তর্জাতিক নাম্বারঃ ৮৭০ ১৮৯৫-(৪৮/৮৭০) আবূ বকর ইবনু আবূ শায়বাহ ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু নুমায়র (রহঃ) ..... আদী ইবনু হাতিম (রাযিঃ) থেকে বর্ণিত। জনৈক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে ভাষণ দিল। সে বলল, যে ব্যক্তি আল্লাহ ও তার রসূলের আনুগত্য করে সে সঠিক পথ পেল। আর যে ব্যক্তি তাদের অবাধ্যচরণ করল, সে পথভ্রষ্ট হ'ল। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তুমি নিকৃষ্ট বক্তা, তুমি এভাবে বল, \"যে ব্যক্তি আল্লাহর অবাধ্যতা করল ও রসূলের অবাধ্যতা করল।\" ইবনু নুমায়র বলেন, \"পথভ্রষ্ট হ'ল\"। (ইসলামী ফাউন্ডেশন ১৮৮০, ইসলামীক সেন্টার ১৮৮৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": "871",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৬, আন্তর্জাতিক নাম্বারঃ ৮৭১ ১৮৯৬-(৪৯/৮৭১) কুতায়বাহ ইবনু সাঈদ, আবূ বকর ইবনু আবূ শারবাহ ও ইসহাক আল হান্‌যালী (রহঃ) ...... সফওয়ান ইবনু ইয়া'লা ইবনু উমাইয়্যাহ (রাযিঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মিম্বারের উপর থেকে পাঠ করতে শুনলেনঃ \"তারা চিৎকার করে বলবে, হে মালিক (জাহান্নামের দারোগা)\"- (সূরাহ যুখরুফ ৪৩ঃ ৭৭)। (ইসলামী ফাউন্ডেশন ১৮৮১, ইসলামীক সেন্টার ১৮৮৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": "872.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৭, আন্তর্জাতিক নাম্বারঃ ৮৭২ ১৮৯৭-(৫০/৮৭২) আবদুল্লাহ ইবনু আবদুর রহমান আদ দারিমী (রহঃ) ..... আমরাহ বিনতু আবদুর রহমান (রাযিঃ) থেকে তার এক বোনের সূত্রে বর্ণিত। তিনি বলেন, আমি জুমুআর দিন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখ থেকে শুনে সূরাহ কাফ মুখস্থ করেছি। তিনি প্রতি জুমুআর দিন মিম্বারে দাঁড়িয়ে এ সূরাহ পড়তেন। (ইসলামী ফাউন্ডেশন ১৮৮২, ইসলামীক সেন্টার ১৮৯০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": "872.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৮, আন্তর্জাতিক নাম্বারঃ ৮৭২ ১৮৯৮-(.../...) আবুত তহির (রহঃ) ..... 'আমরাহ (রাযিঃ) তার এক বোনের সূত্রে বর্ণিত। যিনি তার বয়োজ্যেষ্ঠা ছিলেন। ..... সুলায়মান ইবনু বিলালের হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৮৩, ইসলামীক সেন্টার ১৮৯১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": "873.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৮৯৯, আন্তর্জাতিক নাম্বারঃ ৮৭৩ ১৮৯৯-(৫১/৮৭৩) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... হারিস ইবনু নুমান (রাযিঃ) এর এক কন্যার সূত্রে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখ থেকে শুনেই সূরাহ কাফ মুখস্থ করেছি। তিনি প্রতি জুমুআর খুতবায় এ সূরাহ পড়তেন। বর্ণনাকার আরো বলেন, আমাদের ও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একই রন্ধনশালা ছিল। (ইসলামী ফাউন্ডেশন ১৮৮৪, ইসলামীক সেন্টার ১৮৯২-ক)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": "873.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০০, আন্তর্জাতিক নাম্বারঃ ৮৭৩ ১৯০০-(৫২/...) আমর আন নাকিদ (রহঃ) ..... উম্মু হিশাম বিনতু হারিসাহ ইবনু নু'মান (রাযিঃ) এর জনৈকা কন্যার সূত্রে বর্ণিত। তিনি বলেন, দেড়-দুই বছর যাবৎ আমাদের ও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একই রান্না ঘর ছিল। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখ থেকে শুনেইق وَالْقُرْآنِ الْمَجِيدِ‏ সূরাটি মুখস্থ করেছি। তিনি প্রতি জুমুআর দিন মিম্বারে দাঁড়িয়ে জনগণের উদ্দেশে প্রদত্ত খুতবায় এ সূরাটি পড়তেন। (ইসলামী ফাউন্ডেশন ১৮৮৫, ইসলামীক সেন্টার ১৮৯২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": "873.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০১, আন্তর্জাতিক নাম্বারঃ ৮৭৪ ১৯০১-(৫৩/৮৭৪) আবূ বাকর ইবনু আবূ শায়বাহ (রহঃ) ..... উমারাহ ইবনু রুয়াইবাহ (রাযিঃ) থেকে বর্ণিত। তিনি বিশর ইবনু মারওয়ানকে মিম্বারে দাঁড়িয়ে তার উভয় হাত উত্তোলন করতে দেখে বলেন, আল্লাহ এ হাত দুটিকে ধ্বংস করুন। আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তার আঙ্গুল দ্বারা ইশারা করা ব্যতীত আর কিছু দেখিনি। বর্ণনাকারী তার তর্জনী দ্বারা ইশারা করেন। (ইসলামী ফাউন্ডেশন ১৮৮৬, ইসলামীক সেন্টার ১৮৯৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": "874",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০২, আন্তর্জাতিক নাম্বারঃ ৮৭৪ ১৯০২-(.../...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... হুসায়ন ইবনু আবদুর রহমান (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি জুমুআর দিন বিশর ইবনু মারওয়ানকে তার দু' হাত উপরে তুলতে দেখলাম। উমারাহ ইবনু রুয়াইবাহ বলেন ..... পূর্বোক্ত হাদীসের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৮৭, ইসলামীক সেন্টার ১৮৯৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": "875.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৩, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৩-(৫৪/৮৭৫) আবুর রাবী' আয যাহরানী ও কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন খুতবাহ দিচ্ছিলেন। তখন জনৈক ব্যক্তি উপস্থিত হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ হে অমুক! তুমি কি সালাত আদায় করেছ? সে বলল, না। তিনি বলেনঃ উঠে দাঁড়িয়ে সালাত আদায় কর (তাহিয়্যাতুল মাসজিদ)। (ইসলামী ফাউন্ডেশন ১৮৮৮, ইসলামীক সেন্টার ১৮৯৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": "875.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৪, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৪-(.../...) আবূ বাকর ইবনু আবূ শায়বাহ ও ইয়াকুব আদ দাওরাকী (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। ..... পূর্বোক্ত হাদীসের অনুরূপ। তবে এ বর্ণনায় দু' রাকাআত সালাতের উল্লেখ নেই। (ইসলামী ফাউন্ডেশন ১৮৮৯, ইসলামীক সেন্টার ১৮৯৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": "875.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৫, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৫-(৫৫/...) কুতায়বাহ ইবনু সাঈদ ও ইসহাক ইবনু ইবরাহীম (রহঃ) ..... আমর (রহঃ) থেকে বর্ণিত। তিনি জাবির ইবনু আবদুল্লাহ (রাযিঃ) কে বলতে শুনেছেনঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন জিজ্ঞেস করলেনঃ তুমি (তাহিয়াতুল মাসজিদ) সালাত আদায় করেছ? সে বলল, না। তিনি বললেনঃ ওঠো এবং দু'রাকাআত সালাত আদায় কর। কুতায়বার বর্ণনায় আছে, তিনি বললেনঃ তুমি দু' রাকাআত সালাত আদায় কর। (ইসলামী ফাউন্ডেশন ১৮৯০, ইসলামীক সেন্টার ১৮৯৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": "875.04",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৬, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৬-(৫৬/...) মুহাম্মাদ ইবনু রাফি' ও 'আবদ ইবনু হুমায়দ (রহঃ) ..... আমর ইবনু দীনার (রহঃ) থেকে বর্ণিত। তিনি জাবির ইবনু আবদুল্লাহ (রাযিঃ) কে বলতে শুনেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন মিম্বারের উপর খুতবাহ দানরত অবস্থায় জনৈক ব্যক্তি মসজিদে এসে উপস্থিত হ'ল। তিনি তাকে জিজ্ঞেস করেন, তুমি কি দু’রাকাআত সালাত আদায় করেছ? সে বলল, না। তিনি বলেন, সালাত আদায় কর। (ইসলামী ফাউন্ডেশন ১৮৯১, ইসলামীক সেন্টার ১৮৯৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": "875.05",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৭, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৭-(৫৭/...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... আমর (রহঃ) থেকে বর্ণিত। তিনি জাবির ইবনু 'আবদুল্লাহ (রাযিঃ) কে বলতে শুনেছেনঃ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবাহ দিচ্ছিলেন। তিনি বললেন, তোমাদের কেউ জুমু'আর দিনে (মসজিদে) এলো আর তখন যদি ইমাম (হুজরা থেকে) বের হয়ে থাকেন, তবে সে দু' রাকাআত সালাত আদায় করে নিবে। (ইসলামী ফাউন্ডেশন ১৮৯২, ইসলামীক সেন্টার ১৮৯৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": "875.06",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৮, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৮-(৫৮/...) কুতায়বাহ ইবনু সাঈদ ও মুহাম্মাদ ইবনু রুমহ (রহঃ) ..... জাবির (রাযিঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন মিম্বারে উপবিষ্ট থাকা অবস্থায় সুলায়ক আল গাত্বাফানী মসজিদে এসে (তাহিয়্যাতুল মসজিদ) সালাত আদায় করার আগেই বসে পড়ল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ তুমি কি দু' রাকাআত সালাত আদায় করেছো? সে বলল, না। তিনি বলেন, তুমি উঠে দু' রাকাআত সালাত আদায় কর। (ইসলামী ফাউন্ডেশন ১৮৯৩, ইসলামীক সেন্টার ১৯০০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": "875.07",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯০৯, আন্তর্জাতিক নাম্বারঃ ৮৭৫ ১৯০৯-(৫৯/...) ইসহাক ইবনু ইবরাহীম ও ‘আলী ইবনু খশরাম (রহঃ) ..... জাবির ইবনু আবদুল্লাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, জুমুআর দিন সুলায়ক আল গাত্বাফানী এসে উপস্থিত হ’ল, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন খুতবাহ দিচ্ছিলেন। সে বসে পড়লে তিনি তাকে বলেনঃ হে সুলায়ক উঠে সংক্ষেপে দু' রাকাআত সালাত আদায় কর। ..... অতঃপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, জুমুআর দিন তোমাদের কেউ যখন আসে এমতাবস্থায় যে, ইমাম খুতবাহ দিচ্ছেন তখন সে যেন সংক্ষেপে দু' রাকাআত সালাত আদায় করে ... (ইসলামী ফাউন্ডেশন ১৮৯৪, ইসলামীক সেন্টার ১৯০১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2025,
			"arabicnumber": "876",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১০, আন্তর্জাতিক নাম্বারঃ ৮৭৬ ১৯১০-(৬০/৮৭৬) শায়বান ইবনু ফাররূখ (রহঃ) ..... আবূ রিফা'আহ (রাযিঃ) বলেন, আমি যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট পৌঁছলাম, তখন তিনি খুতবাহ দিচ্ছিলেন। বর্ণনাকার বলেন, আমি বললাম, হে আল্লাহর রসূল! এক আগন্তুক তার দীন সম্পর্কে জিজ্ঞেস করতে এসেছে। সে জানে না তার দীন কি? বর্ণনাকারী বলেন, একটি চেয়ার আনা হ’ল, মনে হয় এর পায়াগুলো ছিল লোহার। বর্ণনাকারী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাতে বসে আল্লাহ তাকে যা শিখিয়েছেন তা আমাকে শিক্ষা দিতে লাগলেন, অতঃপর এসে তার অবশিষ্ট খুতবাহ শেষ করেন। (ইসলামী ফাউন্ডেশন ১৮৯৫, ইসলামীক সেন্টার ১৯০২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": "877.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১১, আন্তর্জাতিক নাম্বারঃ ৮৭৭ ১৯১১-(৬১/৮৭৭) 'আবদুল্লাহ ইবনু মাসলামাহ্ ইবনু কানাব (রহঃ) ..... ইবনু আবূ রাফি (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবূ হুরায়রাহ (রাযিঃ) কে মারওয়ান মদীনাহর প্রশাসক নিয়োগ করে মক্কায় চলে যান। আবূ হুরায়রাহ (রাযিঃ) আমাদেরকে নিয়ে জুমু'আর সালাত আদায় করতেন। তিনি সূরাহ জুমুআর পর দ্বিতীয় রাকাতে إِذَا جَاءَكَ الْمُنَافِقُونَ সুরাহ পড়েন। (সালাত শেষে) আবূ হুরায়রা (রাযীঃ) বলেন নিশ্চয় আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জুমুআর দিন এ সূরাহ দু'টি পাঠ করতে শুনেছি। (ইসলামী ফাউন্ডেশন ১৮৯৬, ইসলামীক সেন্টার ১৯০৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": "877.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১২, আন্তর্জাতিক নাম্বারঃ ৮৭৭ ১৯১২-(.../...) কুতায়বাহ ইবনু সাঈদ, আবূ বাকর ইবনু শায়বাহ, কুতায়বাহ (রহঃ) ..... উবায়দুল্লাহ ইবনু আবূ রাফি (রহঃ) থেকে বর্ণিত। মারওয়ান আবূ হুরায়রাহ (রাযিঃ)-কে প্রশাসক নিয়োগ করলেন ..... পূর্বোক্ত হাদীসের অনুরূপ। তবে অধস্তন বর্ণনাকারী হাতিম (রহঃ) এর বর্ণনায় আছে, তিনি প্রথম রাকাআতে সূরাহ আল জুমুআহ এবং দ্বিতীয় রাকাআতে \"ইযা- জা-আকাল মুনাফিকূন\" (সূরাহ আল মুনাফিকুন) পাঠ করেন। 'আবদুল আযীয (রহঃ) এর রিওয়ায়াতে সুলায়মান ইবনু বিলাল (রহঃ)-এর রিওয়ায়াতের অনুরূপ। (ইসলামী ফাউন্ডেশন ১৮৯৭, ইসলামীক সেন্টার ১৯০৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": "878.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৩, আন্তর্জাতিক নাম্বারঃ ৮৭৮ ১৯১৩-(৬২/৮৭৮) ইয়াহইয়া ইবনু ইয়াহইয়া, আবূ বকর ইবনু আবূ শায়বাহ ও ইসহাক (রহঃ) ..... নু'মান ইবনু বাশীর (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু' ঈদের সালাতে ও জুমুআর সালাতে “সাব্বিহিসমা রব্বিকাল আ'লা-\" ও \"হাল আতা-কা হাদীসুল গ-শিয়াহ\" সূরাদ্বয় পাঠ করতেন। বর্ণনাকারী বলেন, ঈদ ও জুমুআহ একই দিন হলেও তিনি উভয় সালাতে ঐ সূরাদ্বয় পাঠ করতেন। (ইসলামী ফাউন্ডেশন ১৮৯৮, ইসলামীক সেন্টার ১৯০৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": "878.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৪, আন্তর্জাতিক নাম্বারঃ ৮৭৮ ১৯১৪-(.../...) কুতায়বাহ ইবনু সাঈদ (রহঃ) ..... ইব্রাহীম ইবনু মুহাম্মাদ ইবনুল মুনতাশির (রহঃ) সানাদ একই সূত্রে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ১৮৯৯, ইসলামীক সেন্টার ১৯০৬)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": "878.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৫, আন্তর্জাতিক নাম্বারঃ ৮৭৮ ১৯১৫-(৬৩/...) 'আমর আন নাকিদ (রহঃ) ..... উবায়দুল্লাহ ইবনু আবদুল্লাহ (রহঃ) থেকে বর্ণিত। তিনি বলেন, যহহাক ইবনু কায়স (রাযিঃ) নু'মান ইবনু বাশীর (রাযিঃ) কে চিঠি লিখে জিজ্ঞেস করলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন সূরাহ জুমুআহ ব্যতীত আর কোন সূরাহ পাঠ করতেন? তিনি বলেন, তিনি \"হাল আতা-কা হাদীসুল গ-শিয়াহ\" সূরাহ পাঠ করতেন। (ইসলামী ফাউন্ডেশন ১৯০০, ইসলামীক সেন্টার ১৯০৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": "879.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৬, আন্তর্জাতিক নাম্বারঃ ৮৭৯ ১৯১৬-(৬৪/৮৭৯) আবূ বকর ইবনু আবূ শায়বাহ (রহঃ) ..... আবদুল্লাহ ইবনু আব্বাস (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন ফজরের সালাতে \"আলিফ লা~ম মী~ম তানীলুস সাজুদাহ\" (সূরাহ আস সিজদা) ও \"হাল আতা- আলাল ইনসা-নি হীনুম নিনাদ দাহর” (সূরাহ্ আদ দাহর) এবং জুমুআর সালাতে সূরাতুল জুমুআহ ও সূরাহ মুনাফিকুন পাঠ করতেন। (ইসলামী ফাউন্ডেশন ১৯০১, ইসলামীক সেন্টার ১৯০৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": "879.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৭, আন্তর্জাতিক নাম্বারঃ ৮৭৯ ১৯১৭-(.../...) ইবনু নুমায়র, আবূ কুরায়ব (রহঃ) ..... সুফইয়ান (রহঃ) থেকে একই সূত্রে অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ১৯০২, ইসলামীক সেন্টার ১৯০৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": "879.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৮, আন্তর্জাতিক নাম্বারঃ ৮৭৯ ১৯১৮-(.../...) মুহাম্মাদ ইবনু বাশশার (রহঃ) ..... মুখাওওয়াল (রহঃ) থেকে একই সানাদ সূত্রে ঈদ ও জুমুআর সালাতের সূরাহ সম্পর্কে সুফইয়ান (রহঃ) এর অনুরূপ বর্ণিত হয়েছে। (ইসলামী ফাউন্ডেশন ১৯০৩, ইসলামীক সেন্টার ১৯১০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": "880.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯১৯, আন্তর্জাতিক নাম্বারঃ ৮৮০ ১৯১৯-(৬৫/৮৮০) যুহায়র ইবনু হারব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন ফজরের সালাতে \"আলিফ লা~ম মী~ম তানীল\" ও \"হাল আতা-\" সূরাদ্বয় পাঠ করতেন। (ইসলামী ফাউন্ডেশন ১৯০৪, ইসলামীক সেন্টার ১৯১১)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": "880.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২০, আন্তর্জাতিক নাম্বারঃ ৮৮০ ১৯২০-(৬৬/...) আবূত তহির (রহঃ) ..... আবূ হুরাররাহ (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর দিন ফজরের সালাতে প্রথম রাকাআতে \"আলিফ লা~ম মী~ম তানীল\" (সূরাহ আস সিজদা) এবং দ্বিতীয় রাক'আতে \"হাল আতা আলাল ইনসা-নি হীনুম মিনাদ দাহরি লাম ইয়াকুন শায়আম মাযকুরা\" (সূরা দাহর) সূরাদ্বয় পাঠ করতেন। (ইসলামী ফাউন্ডেশন ১৯০৫, ইসলামীক সেন্টার ১৯১২)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": "881.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২১, আন্তর্জাতিক নাম্বারঃ ৮৮১ ১৯২১-(৬৭/৮৮১) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন জুমুআর সালাত আদায় করে, তখন সে যেন তার পরে চার রাকাআত (সুন্নাত) সালাত আদায় করে। (ইসলামী ফাউন্ডেশন ১৯০৬, ইসলামীক সেন্টার ১৯১৩)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": "881.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২২, আন্তর্জাতিক নাম্বারঃ ৮৮১ ১৯২২-(৬৮/...) আবূ বকর ইবনু আবূ শায়বাহ ও আমর আন নাকিদ (রহঃ) ... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা জুমুআর সালাতের পর আরো সালাত আদায় করলে চার রাকাআত (সুন্নাত) আদায় কর। আমর (রহঃ) তার রিওয়ায়াতে আরো বলেন, ইবনু ইদরীস বলেছেন যে, সুহায়ল (রহঃ) বলেন, তোমরা তাড়াহুড়ায় থাকলে মসজিদে দু' রাকাআত এবং (বাড়িতে) ফিরে গিয়ে দু' রাক’আত আদায় করো। (ইসলামী ফাউন্ডেশন ১৯০৭, ইসলামীক সেন্টার ১৯১৪)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": "881.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৩, আন্তর্জাতিক নাম্বারঃ ৮৮১ ১৯২৩-(৬৯/...) যুহায়র ইবনু হারব, আমর আন নাকিদ ও আবূ কুরায়ব (রহঃ) ..... আবূ হুরায়রাহ (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ জুমুআর সালাতের পর সালাত আদায় করতে চাইলে সে যেন চার রাকাআত আদায় করে। জারীর (রাযিঃ) এর রিওয়ায়াতে 'তোমাদের মধ্যে' কথাটুকু যুক্ত হয়নি। (ইসলামী ফাউন্ডেশন ১৯০৮, ইসলামীক সেন্টার ১৯১৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": "882.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৪, আন্তর্জাতিক নাম্বারঃ ৮৮২ ১৯২৪-(৭০/৮৮২) ইয়াহইয়া ইবনু ইয়াহইয়া ও মুহাম্মাদ ইবনু রুমহ, কুতায়বাহ (ইবনু সাঈদ) (রহঃ) .....আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি জুমুআর সালাত আদায় করে ফিরে এসে নিজ বাড়িতে দু’রাকাআত (সুন্নাত) সালাত আদায় করতেন। তিনি পুনরায় বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাই করতেন। (ইসলামী ফাউন্ডেশন ১৯০৯, ইসলামীক সেন্টার ১৯১৫)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": "882.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৫, আন্তর্জাতিক নাম্বারঃ ৮৮২ ১৯২৫-(৭১/...) ইয়াহইয়া ইবনু ইয়াহইয়া (রহঃ) ..... 'আবদুল্লাহ ইবনু উমর (রাযিঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নফল সালাতের বর্ণনা দিতে গিয়ে বলেন, তিনি জুমুআর সালাতের পর ফিরে না আসা পর্যন্ত সালাত আদায় করতেন না, অতঃপর নিজ বাড়িতে দু' রাকাআত সালাত আদায় করতেন। ইয়াহইয়া (রহঃ) বলেন, মনে হয় আমি আদায় করেছি (বর্ণনা করেছি), তিনি সালাত আদায় করতেন অথবা অবশ্যই (সালাত আদায় করতেন)। (ইসলামী ফাউন্ডেশন ১৯১০, ইসলামীক সেন্টার ১৯১৭)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": "882.03",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৬, আন্তর্জাতিক নাম্বারঃ ৮৮২ ১৯২৬-(৭২/...) আবূ বকর ইবনু আবূ শায়বাহ, যুহায়র ইবনু হারব ও ইবনু নুমায়র (রহঃ) ..... আবদুল্লাহ ইবনু উমার (রাযিঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমুআর সালাতের পর দু'রাকাআত সালাত আদায় করতেন। (ইসলামী ফাউন্ডেশন ১৯১১, ইসলামীক সেন্টার ১৯১৮)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": "883.01",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৭, আন্তর্জাতিক নাম্বারঃ ৮৮৩ ১৯২৭-(৭৩/৮৮৩) আবূ বাকর ইবনু আবূ শায়বাহ্ (রহঃ) ..... উমর ইবনু আতা ইবনু আবূল খুওয়ার (রহঃ) থেকে বর্ণিত। নাফি ইবনু জুবায়র (রহঃ) তাকে নামির-এর ভাগ্নে সায়িব-এর নিকট একটি বিষয়ে জিজ্ঞেস করতে পাঠান যা মু'আবিয়াহ (রাযিঃ) তার সালাতের ব্যাপারে লক্ষ্য করেছেন। তিনি বলেন, হ্যাঁ, আমি মাকসূরায় দাঁড়িয়ে তার সাথে জুমুআর সালাত আদায় করলাম। ইমামের সালাম ফিরানোর পর আমি আমার জায়গায় দাঁড়িয়ে (সুন্নাত) সালাত আদায় করলাম। তিনি প্রবেশ করে আমাকে ডেকে পাঠালেন। তিনি বললেন, তুমি যা করেছে তার পুনরাবৃত্তি করো না। তুমি জুমুআর সালাত আদায় করার পর কথা না বলা পর্যন্ত অথবা বের না হয়ে যাওয়া পর্যন্ত কোনরূপ সালাত আদায় করো না। কারণ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এরূপ নির্দেশ দিয়েছেন যে, আমরা কথা না বলা অথবা বের হয়ে না যাওয়া পর্যন্ত যেন সালাত না আদায় করি। (ইসলামী ফাউন্ডেশন ১৯১২, ইসলামীক সেন্টার ১৯১৯)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": "883.02",
			"text": "হাদিস একাডেমি নাম্বারঃ ১৯২৮, আন্তর্জাতিক নাম্বারঃ ৮৮৩ ১৯২৮-(.../...) হারূন ইবনু আবদুল্লাহ (রহঃ) ..... 'উমার ইবনু আত্বা (রহঃ) থেকে বর্ণিত। নাফি ইবনু জুবায়র (রহঃ) তাকে নামির এর ভাগ্নে সারিব ইবনু ইয়াযীদ এর নিকট পাঠান। ..... হাদীসের অবশিষ্ট বর্ণনা পূর্বের ন্যায়। তবে তিনি বলেনঃ তিনি সালাম ফিরালে আমি আমার জায়গায় গিয়ে দাঁড়িয়ে গেলাম। এ সূত্রে ইমাম' শব্দটি যুক্ত হয়নি। (ইসলামী ফাউন্ডেশন ১৯১৩, ইসলামীক সেন্টার, ১৯২০)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 93
			}
		}
	]
}