{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin 'Abdullah] bahwasanya ia mendengar [Abu Musa] berkata; \"Sesungguhnya Nabi Allah Shallallahu'alaihi wasallam pernah berkhutbah di hadapan kami, beliau menjelaskan sunnah dan mengajarkan kami cara shalat, beliau berkata: 'Jika kalian shalat maka luruskan barisan kalian. Hendaklah salah seorang dari kalian menjadi imam. Bila imam bertakbir maka bertakbirlah kalian dan bila imam mengucapkan, \"Ghairil maghdluubi 'alahim waladl-dlaalliin (Bukan orang-orang yang dimurkai dan bukan orang-orang yang sesat) \" maka hendaklah kalian mengucapkan, \"Aamiin (semoga Allah mengabulkan) niscaya Allah akan mengabulkan kalian\". Jika imam bertakbir dan ruku' maka bertakbirlah dan ruku'lah, sesungguhnya imam ruku' dan mengangkat kepala dari ruku' sebelum kalian'. Lalu Nabi Shallallahu'alaihi wasallam bersabda: 'Hendaklah gerakan imam itu kalian ikuti sesudahnya'. Dan jika ia mengangkat kepala dari ruku dengan mengucapkan, \"Sami'allaahu It man lamidah (Allah mendengar orang yang memuji-Nya) \" maka ucapkanlah, \"Allahumma rabbanaa wa lakal hamdu (Wahai Rabb kami, untuk-Mu segala pujian) \" niscaya Allah mendengar kalian. Sesungguhnya Allah berfirman melalui lisan Nabi-Nya, \"Sami'alladhu liman hamidah \". Bila imam bertakbir dan sujud maka ikutlah bertakbir dan sujud, sesungguhnya imam bertakbir dan sujud sebelum kalian'. Lalu Rasulullau Shallallahu'alaihi wasallam bersabda: -'Hendaklah gerakan imam itu kalian ikuti sesudahnya - dan jika ia duduk maka yang pertama kali diucapkan oleh salah seorang dari kalian adalah -doa yang artinya-: \"Ucapan selamat yang baik dan shalawat bagi Allah, semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan semoga juga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya\" -ini adalah tujuh kalimat sebagai tahiyyat shalat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		}
	]
}