{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Bazi'] dia berkata; telah menceritakan kepada kami ['Abdul A'la bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami ['Ubaidullah bin 'Umar] dari [Abu Hazim] dari [Sahl bin Sa'ad] dia berkata; Pernah Rasulullah Shallallahu'alaihiwasallam pergi untuk mendamaikan Bani Amru bin Auf yang mempunyai suatu masalah. Ketika' tiba waktu shalat, muadzin datang kepada Abu Bakar dan menyuruhnya mengumpulkan orang-orang dan mengimami mereka. Kemudian datang Rasulullah Shallallahu'alaihiwasallam melalui celah-celah barisan shalat hingga beliau Shallallahu'alaihiwasallam berdiri di barisan terdepan. Orang-orang lalu mulai menepukkan tangannya kepada Abu Bakar untuk memberitahu keberadaan Rasulullah Shallallahu'alaihiwasallam, namun Abu Bakar tidak menoleh dalam shalatnya. Setelah orang-orang banyak yang menepukkan tangannya (sebagai isyarat), Abu Bakar tahu bahwa mereka mengingatkan sesuatu, maka ia menoleh dan mendapati Rasulullah Shallallahu'alaihiwasallam. Rasulullah Shallallahu'alaihiwasallam mengisyaratkan kepadanya untuk terus melanjutkan shalatnya. Maka Abu Bakar mengangkat kedua tangannya dan memuji Allah dengan ucapan Rasulullah Shallallahu'alaihiwasallam lantas mundur ke belakang, maka Rasulullah Shallallahu'alaihiwasallam maju untuk menjadi imam. Setelah selesai shalat beliau Shallallahu'alaihiwasallam bertanya kepada Abu Bakar, 'Wahai Abu Bakar, apakah yang menghalangimu untuk shalat menjadi imam bagi manusia saat kuisyaratkan demikian? ' Abu Bakar berkata; 'Tidaklah pantas bagi Ibnu Quhafah untuk mengimami shalat Rasulullah Shallallahu'alaihi wasallam'. Kemudian beliau Shallallahu'alaihiwasallam bersabda kepada orang-orang: 'Wahai manusia sekalian, kenapa kalian bertepuk tangan. Tepuk tangan hanya untuk wanita. Jika terjadi sesuatu dalam shalat kalian, maka ucapkan, \"Subhanallah (Maha suci Allah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		}
	]
}