{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"1": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "Telah mengabarkan kepada kami [Amru bin Manshur] dia berkata; telah menceritakan kepada kami [Adam bin Abu Iyas] berkata; telah menceritakan kepada kami [Al laits yaitu Ibnu Sa'id] dia berkata; telah menceritakan kepada kami [Mu'awiyah bin Shalih] dia berkata; Telah mengabarkan kepadaku [Abu Yahya Sulaim bin Amir] dan [Dhamrah bin Habib] dan [Abu Thalhah Nu'aim bin Ziyad] mereka telah berkata; kami telah mendengar dari [Abu Umamah Al Bahili] dia berkata, \" Aku mendengar [Amru bin Abasah] berkata, Aku pernah bertanya, \" Wahai Rasulullah shallallahu 'alaihi wasallam bagaimana cara berwudlu?\" Beliau menjawab, \"Adapun wudlu, apabila kamu melakukan wudlu dan membasuh kedua telapak tanganmu lalu kamu mensucikan keduanya, maka keluarlah kesalahan-kesalahan dari celah-celah kuku-kukumu dan ujung jari-jarimu. Bila kamu berkumur dan memasukkan air ke dalam hidung. Serta membasuh mukamu dan kedua tanganmu sampai ke siku-siku dan mengusap kepalamu, dan membasuh kedua tanganmu sampai ke siku-siku dan mengusap kepalamu, kemudian membasuh kedua sampai ke kedua mata kaki, maka kamu membersihkan kesalahanmu. Jika kamu meletakkan mukamu ke hadapan Allah Azza wa Jalla, maka kamu keluar dari kesalahanmu seperti kamu baru dilahirkan ibumu.\"Abu Umamah berkata: \"Aku berkata, 'wahai Amru bin Abasah! Lihat yang kamu katakan, apakah ini diberikan dalam satu majlis? 'dia menjawab, 'demi Allah, umurku sudah tua dan ajal semakin dekat, apa gunanya aku berdusta atas nama Rasulullah shallallahu 'alaihi wasallam. Sungguh, kedua telingaku mendengar dari Rasulullah shallallahu 'alaihi wasallam dan hatiku masih sangat sadar bahwa itu dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 148
			}
		}
	]
}