{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"16": "The Book of Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "Telah mengabarkan kepada kami [Hilal bin Al 'Ala bin Hilal] dia berkata; Telah menceritakan kepada kami [Al Husain bin 'Ayyasy] dia berkata; Telah menceritakan kepada kami [Zuhair] dia berkata; Telah menceritakan kepada kami [Al Aswad bin Qais] dia berkata; Telah menceritakan kepadaku [Tsa'labah bin 'Abbad Al 'Abdi] -dari penduduk Bashrah- bahwasanya suatu hari ia menyaksikan khutbah [Samurah bin Jundub], didalam khutbahnya dia menyebutkan sebuah Hadits dari Rasulullah shallallahu 'alaihi wasallam, dia berkata; \"Tatkala kami dan seorang anak kecil melemparkan tombak kami pada dua sasaran di masa Rasulullah, tiba-tiba matahari -yang kelihatannya berada seukuran dua tombak atau tiga tombak- diatas kami berwarna hitam. Lalu salah seorang diantara kami berkata; 'Mari kita pergi ke masjid bersama kami, demi Allah kita akan melihat Rasulullah shallallahu 'alaihi wasallam dalam menyikapi keadaan seperti ini. Samurah berkata; 'Maka kami pun ingin pergi ke masjid'. Dia berkata lagi; 'Kami mendapatkan Rasulullah shallallahu 'alaihi wasallam sedang keluar menuju sekumpulan manusia. Kemudian beliau maju, lalu shalat dengan memperlama berdirinya, sepertinya shalat ini yang paling paling panjang beliau lakukan bersama kami, dan kami tidak mendengar suara dari beliau. Kemudian beliau ruku' dengan ruku' yang panjang dan kami tidak mendengar suara dari beliau, kemudian beliau sujud dengan sujud yang panjang yang belum pernah beliau lakukan sebelumnya bersama kami, dan kamipun tidak mendengar suara dari beliau. Dan beliau melakukan hal yang sama pada raka'at kedua. Dia berkata; 'Duduk beliau pada raka'at kedua bersamaan dengan terangnya matahari.' Kemudian beliau mengucapkan salam dan memuji Allah, bersaksi bahwa tiada ilah yang berhak disembah selainNya dan bersaksi bahwa beliau utusanNya. (secara ringkas)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		}
	]
}