{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"17": "The Book of Praying for Rain (Al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il bin Ja'far] dia berkata; telah menceritakan kepada kami [Syarik bin 'Abdullah] dari [Anas bin Malik]; \"Ada seorang lelaki yang datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, sedangkan beliau sedang khutbah sambil berdiri, lalu dia menghadap kepada beliau sambil berdiri lantas berkata; 'Wahai Rasulullah, harta benda telah hancur dan jalan-jalan telah terputus, maka berdoalah kepada Allah Azza wa Jalla agar Dia menolong kami'. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya dan berdoa: 'Ya Allah, tolonglah kami. Ya Allah, tolonglah kami'.\" Anas berkata; \"Tidak, demi Allah, kami tidak melihat awan di langit, juga tidak ada mendung, padahal tidak ada rumah di antara kami dan gunung Sala' (sebuah gunung di Madinah), lalu muncul awan laksana perisai, dan setelah awan berada di tengah-tengah langit maka awan itu menyebar, sehingga turun menjadi hujan. Demi Allah, kami tidak melihat matahari selama satu pekan.\" Anas melanjutkan, \"Kemudian pada hari Jum'at berikutnya seorang lelaki datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam dari pintu tadi ketika beliau Shalallahu 'Alaihi Wa Sallam sedang khutbah sambil berdiri, lalu orang tadi berkata; 'Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, harta benda telah hancur dan jalan-jalan telah terputus, maka berdoalah kepada Allah agar Dia menahan hujan dari kami'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya sambil berdoa, 'Ya Allah (turunkan hujan) di sekitar kami dan jangan di atas kami. Ya Allah, turunkan di bukit-bukit, gunung-gunung, lubuk lembah, serta di tempat tumbuhnya pepohonan'. Maka awan pun lenyap, lalu kami keluar dan berjalan di bawah teriknya matahari.\" Syarik berkata; \"Aku bertanya kepada Anas; `Apakah dia lelaki yang pertama tadi? ' la menjawab, 'Bukan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 15
			}
		}
	]
}