{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dari ['Abdul A'la] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Al Hasan] dari [Sa'ad bin Hisyam bin 'Amir] dia berkata; \"Aku datang ke Madinah lalu aku menemui [Aisyah] Radliallahu? nha, kemudian ia berkata; 'Siapa kamu? ' Aku menjawab; 'Sa'ad bin Hisyam bin Amir'. ia lalu berkata; 'Semoga Allah memberikan rahmat kepada ayahmu! ' Aku berkata lagi, 'Kabarkanlah kepadaku tentang cara shalat Rasulullah shallallahu 'alaihi wasallam? ' la menjawab; `Rasulullah shallallahu 'alaihi wasallam dulu begini dan begitu'. Aku berkata; \"Tentu'. Aisyah berkata; 'Rasulullah shallallahu 'alaihi wasallam shalat Isya' pada malam hari, kemudian kembali ke tempat tidurnya, lalu tidur. Pada tengah malam beliau bangun untuk hajatnya dan bersuci, lalu berwudlu dan masuk ke masjid, kemudian shalat delapan rakaat. Terbayang olehku bahwa beliau menyamakan (lama) bacaannya dan ruku' serta sujudnya. Setelah itu shalat witir satu rakaat, kemudian shalat dua rakaat sambil duduk. Kemudian beliau berbaring miring. Kadangkala Bilal datang dan mengumandangkan adzan untuk shalat sebelum beliau tidur atau sedang tidur. Mungkin juga aku ragu apakah beliau sudah tidur atau belum tidur! hingga Bilal mengumandangkan adzan untuk shalat. Begitulah cara Rasulullah shallallahu 'alaihi wasallam shalat hingga beliau tua dan bertambah gemuk.' Aisyah menceritakan daging (gemuk) nya Rasulullah shallallahu 'alaihi wasallam masya Allah. dia berkata; 'Rasulullah shallallahu 'alaihi wasallam shalat Isya' bersama para sahabat kemudian kembali ke tempat tidurnya. Pada tengah malam beliau bangun ke tempat bersucinya dan hajatnya, lalu berwudhu, kemudian masuk ke masjid lalu shalat enam rakaat. Terbayang olehku bahwa beliau menyamakan bacaannya, ruku'nya, serta sujudnya. Beliau juga shalat witir satu rakaat. Kemudian shalat dua rakaat sambil duduk, lalu berbaring miring. Kadangkala Bilal datang lalu mengumandangkan adzan untuk shalat sebelum beliau tidur atau sedang tidur. Aku juga ragu apakah beliau sudah tidur? Hingga Bilal mengumandangkan adzan untuk shalat.' Aisyah berkata; 'Maka senantiasa seperti itulah cara shalat Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		}
	]
}