{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Qatadah] dari [Zurarah bin Aufa] bahwasanya [Sa'd bin Hisyam bin 'Amir] setelah datang kepada kami mengabarkan, bahwa dia pernah datang kepada Ibnu Abbas lalu bertanya tentang cara shalat witir Rasulullah shallallahu 'alaihi wasallam, maka (Ibnu Abbas) berkata; \"Maukah aku beri tahu penghuni bumi ini yang sangat mengetahui cara shalat witir Rasulullah shallallahu 'alaihi wasallam\"?\" Dia menjawab, \"Siapa?\" Ibnu Abbas berkata, 'Aisyah.\" Lalu kami datang dengan mengucapkan salam kepadanya kemudian masuk dan bertanya; \"Wahai Ummul Mukminin, kabarkanlah kepadaku tentang -cara- shalat witir Rasulullah shallallahu 'alaihi wasallam?\" [Aisyah] lalu berkata; \"Kami dulu mempersiapkan siwak dan air wudlunya. lalu Allah Azza Wa Jalla membangunkannya sekehendak-Nya pada malam hari. Kemudian beliau shallallahu 'alaihi wasallam bersiwak dan berwudlu, lalu mengerjakan shalat sembilan rakaat tanpa ada duduk kecuali pada rakaat kedelapan. Beliau memuji Allah, berdzikir, dan berdoa kepada-Nya, lalu bangkit tanpa salam. Kemudian shalat rakaat yang kesembilan, lalu duduk dan memuji Allah, berdzikir, serta berdoa kepada-Nya, kemudian mengucapkan salam yang diperdengarkan kepada kami. Setelah itu beliau shalat lagi dua rakaat sambil duduk, sehingga shalatnya berjumlah sebelas rakaat. Setelah Rasulullah shallallahu 'alaihi wasallam mencapai umur senja dan bertambah gemuk. beliau mengerjakan witir tujuh rakaat, lalu shalat dua rakaat sambil duduk setelah salam, sehingga semuanya berjumlah sembilan rakaat. Wahai anakku, bila Rasulullah shallallahu 'alaihi wasallam mengerjakan suatu shalat, maka beliau senang untuk melakukannya secara kontinyu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		}
	]
}