{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"21": "The Book of Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Telah mengabarkan kepada kami ['Ubaidullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; [bapakku] telah menceritakan kepadaku dari [Qatadah] dari [Qasamah bin Zuhair] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila seorang mukmin telah mendekati ajalnya, para malaikat rahmat datang menemuinya dengan membawa sutera putih. Mereka berkata; 'kaluarlah kamu (ruh) dengan ridla dan diridlai menuju rahmat Allah, bau harum dan Rabb yang tidak murka'. Lalu ia keluar dengan bau misik yang paling harum, hingga sebagian mereka berebut dengan sebagian yang lain untuk mendapatkannya, kemudian mereka membawanya hingga pintu langit. Mereka (penduduk langit) berkata; 'Alangkah harumnya bau yang kalian bahwa ini dari bumi! '. Lalu mereka datang dengannya menemui ruh-ruh kaum mukminin. Mereka lebih bergembira (kedatangan) nya daripada seorang di antara kalian yang di datangi orang yang sudah lama tidak bertemu. Lalu mereka bertanya kepadanya; 'Apa yang telah dilakukan oleh si Fulan? Apa yang telah dilakukan si Fulan? ' Mereka berkata; 'Biarlah ia, karena dahulu ia terlena dengan kehidupan di dunia'. Jika ada yang bertanya, 'Tidakkah ia datang menemui kalian? ' mereka menjawab; 'Ia dibawa ke tempat asalnya yang dalam (Neraka Hawiyah), dan seorang yang kafir jika telah datang ajalnya, para malaikat Adzab datang membawa kain kasar. Mereka berkata; 'keluarlah kamu dengan murka dan dimurkai menuju siksa Allah -Azza wa Jalla-. Lalu ia keluar seperti bau bangkai yang paling busuk, kemudian mereka membawanya hingga pintu bumi. Lalu mereka berkata; 'Alangkah busuknya bau ini! ' lalu mereka membawanya menemui ruh orang-orang kafir",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		}
	]
}