{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"21": "The Book of Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Hujain bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah] dari ['Abdullah bin 'Abbas] dari ['Umar bin Al Khaththab] dia berkata; Setelah Abdullah bin Ubai bin Salul meninggal dunia, Rasulullah shallallahu 'alaihi wasallam diundang untuk menshalatinya. Setelah Rasulullah shallallahu 'alaihi wasallam berdiri untuk melaksanakan Shalat, aku meloncat ke arah beliau, lalu aku berkata, \"Wahai Rasulullah shallallahu 'alaihi wasallam, engkau menshalati Ibnu Ubbay, padahal ia telah mengatakan hari ini dan itu begini dan itu begitu?! Aku menyebut kejelekannya, Rasulullah shallallahu 'alaihi wasallam tersenyum seraya bersabda: \"Tundalah -perkataanmu- dariku wahai Umar!\" setelah aku mengulang menyebut-nyebut kejelekannya, beliau bersabda: \" Aku telah diberikan pilihan, aku memilih. Andaikata aku tahu, kalau aku menambahnya lebih dari tujuh puluh ia akan diampuni, niscaya aku menambahnya!.\"Lalu Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat atasnya, kemudian beliau pergi dan tidak berada di tempat itu kecuali hanya sejenak, hingga turun dua ayat dari surah Bara'ah, \"(Dan janganlah kamu sekali-kali menshalatkan (jenazah) seorang yang mati di antara mereka, dan janganlah kamu berdiri (mendo'akan) di kuburnya. mereka telah kafir kepada Allah dan RasulNya dan mereka mati dalam keadaan fasik.\" (Qs. At-Taubah 9: 84). Setelah itu aku heran atas keberanianku terhadap Rasulullah shallallahu 'alaihi wasallam ketika itu. Dan hanya Allah dan Rasul-Nya yang lebih mengatahui",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 149
			}
		}
	]
}