{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"21": "The Book of Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah mengabarkan kepada kami [Waki'] dari [Wahb bin Jarir] dan [Abu Dawud] dari [Syu'bah] dari [Al Mughirah bin An Nu'man] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri untuk memberikan nasihat, lalu beliau bersabda: \"Wahai manusia, kalian akan dihimpun menuju kepada Allah Azza wa Jalla - dalam keadaan telanjang-. Abu Daud berkata; \"Dalam keadaan tidak beralas kaki serta tidak berkhitan.\" Waki' dan Wahab berkata dengan redaksi; \"Dalam keadaan telanjang serta tidak berkhitan. Sebagaimana Kami telah memulai penciptaan pertama, begitulah Kami akan mengulanginya.\" Beliau bersabda: \"Orang yang pertama kali diberi pakaian pada hari kiamat adalah Ibrahim -Alaihis Salam- dan pakaian tersebut akan diberikan. [Abu Daud] berkata; beliau bersabda: \"Didatangkan\" [Wahab] dan [Waki'] berkata; \"Mereka dikenai hukuman sebagai golongan sebelah kiri (karena kemurtadan setelah masa kenabian). Aku lalu berkata; \"Wahai Rabbku! Sahabatku\". Lantas ada suara; \"Kamu tidak tahu apa yang mereka lakukan setelahmu\" lantas kuucapkan sebagaimana ucapan seorang hambna yang shalih; \"Dan aku menjadi saksi terhadap mereka, selama aku berada di antara mereka. Maka setelah Engkau wafatkan aku...\" (Qs. Al Maaidah 4: 117) sampai firman-Nya, \"dan jika Engkau mengampuni mereka…\" (Qs. Al Maaidah 4: 118). Dan seterusnya. Lalu dikatakan, \" mereka masih tetap berpaling.\" Abu Daud berkata; \"Mereka murtad semenjak engkau berpisah dengan mereka",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 270
			}
		}
	]
}