{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"22": "The Book of Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "Telah mengabarkan kepada kami ['Ubaidullah bin Sa'd bin Ibrahim] dalam kitabnya, dia berkata; telah menceritakan kepada kami [pamanku], dia berkata; telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepada kami [Ibnu 'Ajlan] dan selainnya dari saudara-saudara kami, dari [Sa'id Al Maqburi] dari [Syarik bin 'Abdullah bin Abu Namir] bahwasanya dia mendengar [Anas bin Malik] berkata; \"Ketika kami sedang duduk di samping Rasulullah shallallahu 'alaihi wasallam di masjid, seseorang masuk dengan menaiki seekor unta, ia menderumkannya untanya kemudian mengikatnya, lalu berkata; \"Manakah di antara kalian yang bernama Muhammad?\" padahal beliau saat itu sedang bersandar di antara mereka, lalu kami katakan, \"Orang putih yang sedang bersandar ini.\" Orang tersebut berkata kepada beliau; \"Wahai anak Abdul Muththallib.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah menjawab panggilanmu.\" Orang itu berkata; \"Sungguh aku akan bertanya kepadamu wahai Muhammad, dan mendesakmu dalam bertanya. Beliau bersabda: \"Tanyakanlah apa yang terlintas dalam pikiranmu.\" Lalu orang itu bertanya; \"Aku bersumpah atas nama Rabbmu dan Rabb orang-orang sebelum kamu, apakah Allah telah mengutusmu kepada seluruh manusia?\" maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya Allah, ya.\" Ia bertanya, \"Aku bersumpah atas nama Allah, apakah Allah telah memerintahkanmu untuk berpuasa pada bulan ini setiap tahun.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya Allah, Ya.\" Ia bertanya; \"Aku bersumpah atas nama Allah, apakah Allah telah memerintahkanmu untuk mengambil zakat ini dari orang-orang kaya di antara kami, lalu dibagikan kepada orang-orang fakir di antara kami? Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya Allah, Ya.\" Orang itu berkata; \"Aku beriman dengan apa yang telah engkau bawa dan aku adalah utusan kaumku yang mereka berada di belakangku. Aku adalah Dhimam bin Tsa'labah berasal dari Bani Sa'd bin Bakr.\" 'Ubaidullah bin Umar menyelisihinya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		}
	]
}