{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Zakariya bin Ishaq] dari ['Amru bin Abu Sufyan] dari [Muslim bin Tsafinah] dia berkata; Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka. Muslim berkata; 'Lalu ayahku mengutusku kepada sebuah kaum agar aku mengambil zakat mereka.' Kemudian aku keluar hingga menemui seorang yang telah tua bernama [Si'ir], aku katakan; ayahku mengutusku kepadamu agar kamu menunaikan zakat kambingmu. (orang tua itu) berkata; wahai anak saudaraku! kambing seperti apa yang akan kalian ambil? aku berkata; Biarkan aku memilih sampai aku bisa mengukur susu kambingmu. Dia berkata; 'Wahai anak saudaraku, aku akan memberitahumu bahwa ketika aku berada di sebuah bukit bersama kambing-kambingku pada masa Nabi shallallahu 'alaihi wasallam, tiba-tiba datang kepadaku dua orang laki-laki yang mengendarai unta dan berkata; 'Kami adalah utusan Nabi shallallahu 'alaihi wasallam yang datang kepadamu agar kamu menunaikan zakat kambingmu, aku berkata; 'Apa yang wajib aku keluarkan darinya? ' (Keduanya) berkata; 'Seekor kambing.' Lalu aku pergi menuju seekor kambing, yang aku melihatnya telah mengandung dan gemuk, lalu aku mengeluarkannya kepada mereka. [Keduanya] berkata; 'Ini adalah kambing yang sedang hamil, padahal Rasulullah shallallahu 'alaihi wasallam melarang kami untuk mengambil kambing yang hamil. (orang tua itu) berkata; 'Lalu aku menuju 'anaq (kambing betina yang berumur enam bulan hingga satu tahun) yang mu'tath, dia berkata; Mu'tath adalah kambing yang tidak bisa melahirkan anak (karena gemuk) padahal sudah masanya untuk bisa melahirkan anak, lalu aku mengeluarkannya kepada mereka dan keduanya berkata; 'Berikan kepada kami, maka aku memberikannya kepada mereka hingga keduanya menaikkannya ke atas unta mereka lalu keduanya pergi. Telah mengabarkan kepada kami [Harun bin Abdullah] dia berkata; Telah menceritakan kepada kami [Rauh] dia berkata; telah menceritakan kepada kami [Zakaria bin Ishaq] dia berkata; Telah menceritakan kepadaku [Amru bin Abu Sufyan] dia berkata; Telah menceritakan kepadaku [Muslim bin Tsafinah] bahwa Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka.- kemudian dia menyampaikan hadits diatas",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		}
	]
}