{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"text": "Telah mengabarkan kepada kami ['Imran bin Bakkar] dia berkata; Telah menceritakan kepada kami ['Ali bin 'Ayyasy] dia berkata; Telah menceritakan kepada kami [Syu'aib] dia berkata; Telah menceritakan kepadaku [Abu Az Zinad] dari apa-apa yang diceritakan kepadanya oleh ['Abdurrahman Al A'raj] dari apa-apa yang disebutkan bahwa ia mendengar [Abu Hurairah] menceritakannya dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Seorang berkata; 'Sungguh aku benar-benar akan bersedekah! ' Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada seorang pencuri, maka mereka membicarakannya; 'Seorang pencuri diberi sedekah.' Ia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang pencuri. Sungguh aku benar-benar akan bersedekah.' Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada seorang wanita yang berzina, maka mereka membicarakannya; 'Malam ini seorang wanita yang berzina diberi sedekah'. Dia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang wanita yang berzina. Sungguh aku benar-benar akan bersedekah'. Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada orang kaya, maka mereka membicarakannya; 'Seorang kaya diberi sedekah.' Dia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang wanita yang berzina, seorang pencuri dan seorang yang kaya'. Lalu orang tersebut dibawa dan dikatakan kepadanya dalam mimpinya; 'Sedekahmu sungguh telah diterima. Adapun seorang wanita yang berzina, barangkali ia akan menjauhkan diri dari perzinaannya; barangkali seorang pencuri akan menjauhkan diri dari pencuriannya; dan barangkali orang yang kaya akan mengambil pelajaran, lalu ia menginfakkan apa yang Allah -Azza Wa Jalla- telah berikan kepadanya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		}
	]
}