{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "Telah mengabarkan kepada kami [Azhar bin Jamil] dia berkata; Telah menceritakan kepada kami [Khalid bin Al Harits] dia berkata; Telah menceritakan kepada kami [Syu'bah] dia berkata; -dan dia menyebutkan ['Aun bin Abu Juhaifah], - dia berkata; Aku mendengar [Al Mundzir bin Jarir] bercerita dari [Bapaknya] dia berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam di siang hari, tiba-tiba datang suatu kaum dalam keadaan telanjang kaki sambil menggantungkan pedang-pedang mereka. Mayoritas mereka -bahkan seluruhnya- dari kalangan Mudlar. Maka wajah Rasulullah shallallahu 'alaihi wasallam pun berubah karena kemiskinan yang terlihat pada mereka. Kemudian beliau keluar dan menyuruh Bilal untuk mengumandangkan adzan, lalu mendirikan shalat. Kemudian beliau shalat dan setelah itu berkhuthbah seraya bersabda: \" Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya Allah menciptakan isterinya; dan dari pada keduanya Allah memperkembang biakkan laki-laki dan perempuan yang banyak. Dan bertakwalah kepada Allah yang dengan nama-Nya kamu saling meminta satu sama lain, dan hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu Annisa: 1. Hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok Al Hasyr: 18. Lalu bersabda: 'seseorang bersedekah dengan uang dinarnya, atau dirhamnya, atau pakaiannya, atau satu sha gandum, atau satu sha kurma, hingga beliau bersabda; walaupun dengan sepotong kurma.' Lalu seseorang dari kalangan Anshar datang dengan membawa satu ikat barang yang ia bawa, seolah-olah ia sudah tidak sanggup untuk membawanya. Orang-orangpun berdatangan hingga aku melihat dua karung makanan dan pakaian. Akupun melihat wajah Rasulullah shallallahu 'alaihi wasallam bersinar gembira seperti gemerlapnya emas. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membuat contoh baik di dalam Islam, maka baginya pahala dan pahala orang yang mengamalkan contoh baik tersebut tanpa mengurangi pahala mereka sedikit pun. Dan barang siapa yang membuat contoh buruk di dalam Islam, maka baginya dosa dan dosa orang yang mengamalkan contoh buruk tersebut tanpa mengurangi dosa mereka sedikitpun",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 120
			}
		}
	]
}