{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "Telah mengabarkan kepada kami ['Amr bin Manshur] dan [Ishaq bin Manshur] dari [Al Hakam bin Nafi'], ia berkata; telah memberitakan kepada kami [Syu'aib] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [As Saib bin Yazid] bahwa [Huwaithib bin Abdul 'Uzza] telah mengabarkan kepadanya [Abdullah bin As Sa'di] telah mengabarkan kepadanya bahwa ia telah datang kepada Umar bin Al Khathab pada masa kekhilafahannya, lalu [Umar] berkata; Benarkah berita yang sampai kepadaku, bahwa engkau mengurusi beberapa pekerjaan manusia, kemudian apabila engkau diberi uang, maka engkau tidak menginginkannya. Ia berkata; maka aku katakan; \"Iya\". Umar bertanya; \"Apa yang kamu inginkan dengan melakukan hal tersebut?\" Maka saya katakan; \"Saya memiliki beberapa ekor kuda, serta beberapa sahaya dan aku dalam keadaan baik. Saya ingin amalanku menjadi sedekah kepada orang-orang muslim. Maka Umar berkata kepadanya; \"Janganlah engkau melakukan hal tersebut, sesungguhnya aku pernah berkeinginan seperti yang engkau inginkan. Dahulu Nabi shallallahu 'alaihi wasallam memberikan pemberian kepadaku lalu aku katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Hingga beliau suatu kali beliau memberiku harta, lalu saya katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Ambillah kemudian kembangkan dan sedekahkan, apa yang datang kepadamu dari harta ini sedang engkau tidak tamak dan tidak meminta maka ambillah dan yang tidak demikian maka jangan engkau perturutkan dirimu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 173
			}
		}
	]
}