{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"24": "The Book of Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Salamah] serta [Al Harits bin Miskin] dan lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari [Aisyah], ia berkata; kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada saat haji Wada`, lalu kami mengucapkan doa talbiyah untuk melakukan umrah, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memiliki hewan kurban, hendaknya ia mengucapkan doa talbiyah untuk melakukan haji dan umrah, kemudian tidak bertahallul hingga bertahallul dari keduanya secara bersama. Lalu saya datang ke Mekkah dalam keadaan mengalami haid, sehingga saya tidak melakukan thawaf di Ka'bah dan antara Shafa serta Marwah. Kemudian saya melaporkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Uraikan rambutmu dan sisirlah serta mengucapkan doa talbiyah lah untuk melakukan haji dan tinggalkan umrah.\" Lalu saya melakukannya, kemudian setelah saya menyelesaikan haji Rasulullah shallallahu 'alaihi wasallam mengirimku bersama Abdur Rahman bin Abu Bakr menuju Tan'im, lalu saya melakukan umrah. Beliau bersabda: \"Ini adalah tempat umrahmu.\" Lalu orang-orang yang telah mengucapkan doa talbiyah untuk melakukan umrah melakukan thawaf di Ka'bah serta diantara Shafa dan Marwah. Kemudian mereka bertahallul, dan melakukan thawaf yang lain setelah kembali dari Mina untuk melakukan haji mereka. Adapun orang yang telah menggabung antara haji dan umrah, maka mereka melakukan satu Thawaf",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 146
			}
		}
	]
}