{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"24": "The Book of Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Ibnu 'Ulaiyyah] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku ['Atho`] dari [Jabir], ia berkata; kami para sahabat Nabi shallallahu 'alaihi wasallam mengucapkan do'a talbiyah untuk melakukan haji secara murni tidak disertai yang lainnya, murni hanya itu semata. Kemudian kami sampai di Mekkah pada pagi keempat dari Dzul Hijjah. Kemudian Nabi shallallahu 'alaihi wasallam memerintahkan kami, beliau bersabda: \"Bertahallullah, dan jadikan haji tersebut sebagai umrah.\" Kemudian sampai kepada beliau bahwa kami mengatakan suatu hal. Setelah tidak ada jarak antara kita dengan Arafah kecuali lima, beliau memerintahkan kita untuk bertahallul, sehingga kita kembali ke Mina dan kemaluan-kemaluan kita meneteskan mani. Maka Nabi shallallahu 'alaihi wasallam berdiri kemudian berkhutbah kepada kami, lalu beliau bersabda: \"Sungguh telah sampai berita kepadaku apa yang kalian katakan, dan sesungguhnya saya adalah orang yang paling berbakti dan paling bertakwa diantara kalian. Seandainya tidak ada hewan kurban maka niscaya aku akan bertahallul, jika nampak bagiku perkaraku ini sebelumnya maka saya tidak membawa hewan kurban.\" Jabir berkata; dan kemudian Ali datang dari Yaman, lalu beliau bersabda: \"Bagaimana engkau mengucapkan doa talbiyah?\" Ia menjawab; dengan do'a talbiyah yang dilakukan Nabi shallallahu 'alaihi wasallam. Maka beliau bersabda: \"Berkurbanlah dan tinggallah dalam keadaan tetap berihram sebagaimana engkau sekarang.\" Jabir berkata; dan Suraqah bin Malik bin Ju'syam berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam bagaimana pendapat anda, apakah umrah kami ini hanya untuk tahun ini saja atau untuk selamanya?\" Beliau menjawab: \"Untuk selamanya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 187
			}
		}
	]
}