{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Ibnu Juraij], ia berkata; telah menceritakan kepada kami [Yunus bin Yusuf] dari [Sulaiman bin Yasar], ia berkata; orang-orang pergi dari Abu Hurairah, kemudian terdapat seseorang dari penduduk Syam berkata kepadanya; wahai Syekh, ceritakan kepada kami sebuah hadis yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam?! [Abu Hurairah] berkata; ya, saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang pertama yang diberi keputusan pada Hari Kiamat adalah tiga orang, pertama orang yang mati syahid, kemudian orang tersebut didatangkan, diperlihatkan kepadanya kenikmatannya, maka iapun mengetahuinya, Allah berfirman kepadanya; apakah yang engkau perbuat padanya? Orang tersebut menjawab; saya berperang karena-Mu hingga mati syahid. Allah berfirman; engkau dusta, tetapi engkau berperang agar dikatakan; Fulan adalah orang pemberani, sehingga dikatakanlah hal itu. Kemudian orang tersebut diperintahkan untuk dibawa pergi lalu diseret wajahnya hinggi dicampakkan ke Neraka. Dan seorang laki-laki yang mempelajari ilmu, dan mengajarkannya serta membaca Al Qur'an, kemudian orang tersebut didatangkan, dan diperlihatkan kepadanya kenikmatannya, maka iapun mengetahuinya. Allah berfirman kepadanya; apakah yang engkau perbuat padanya? Orang tersebut menjawab; saya mempelajari ilmu, dan mengajarkannya serta karena-Mu saya membaca Al Qur'an. Allah berfirman; engkau berdusta, akan tetapi engkau mempelajari ilmu agar dikatakan; ia orang yang alim, dan engkau membaca Al Qur'an agar dikatakan; ia orang yang pandai membaca, sehingga dikatakanlah hal itu. Kemudian orang tersebut diperintahkan untuk dibawa pergi lalu diseret wajahnya hinggi dicampakkan ke Neraka. Dan seorang laki-laki yang Allah luaskan rizqinya, dan Allah berikan kepadanya seluruh macam harta, kemudian orang tersebut didatangkan, dan diperlihatkan kepadanya kenikmatannya, maka iapun mengetahuinya. Allah berfirman kepadanya; apakah yang engkau perbuat padanya? Orang tersebut menjawab; tidak ada suatu jalan pun yang Engkau cintai yang saya tinggalkan. Abu Abdur Rahman berkata; artinya saya tidak mengetahui sesuatu yang Engkau cintai sebagaimana saya menghendaki untuk berinfak padanya kecuali saya telah berinfak padanya karena-Mu. Allah berfirman; engkau berdusta, tetapi agar dikatakan; ia adalah orang yang dermawan, sehingga hal itupun dikatakan. Kemudian orang tersebut diperintahkan untuk dibawa pergi lalu diseret wajahnya hingga dicampakkan ke Neraka",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		}
	]
}