{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3182,
			"arabicnumber": 3182,
			"text": "Telah mengkhabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Abdulah bin Idris], ia berkata; saya mendengar [Hushain bin Abdur Rahman] menceritakan dari ['Amr bin Jawan] dari [Al Ahnaf bin Qais], ia berkata; kami pernah keluar untuk melakukan haji, lalu kami datang ke Madinah dan kami ingin melakukan haji. Ketika kami berada di rumah kami dan menambatkan kendaraan kami, tiba-tiba datang seseorang kepada kami seraya berkata; sesungguhnya orang-orang telah berkumpul di Masjid dan mereka merasa kaget. Maka kami berangkat ke masjid, ternyata orang-orang sedang berkumpul mengelilingi beberapa orang di tengah masjid, dan diantara mereka terdapat [Ali], [Az Zubair] serta [Thalhah], dan [Sa'd bin Abi Waqqash]. Disaat kami dalam keadaan demikian, tiba-tiba [Utsman] radliallahu 'anhu datang memakai baju kurung kuning, dan menutup kepalanya dengan baju tersebut, seraya berkata; apakah di sini terdapat Thalhah? Apakah di sini terdapat Az Zubair? Apakah di sini terdapat Sa'd? mereka berkata; ya. Utsman berkata; sungguh saya bertanya kepada kalian dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barang siapa yang membeli tempat penambatan unta milik Bani Fulan, maka Allah akan mengampuninya.\" Maka saya membelinya dengan harga dua puluh ribu atau dua puluh lima ribu, kemudian saya datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengkhabarkan kepadanya. Lalu beliau bersabda: \"Jadikanlah berada di masjid kita, dan pahalanya untukmu.\" Mereka mengatakan; ya. Utsman berkata; saya bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Barang siapa yang membeli sumur Rumah, maka Allah akan mengampuninya.\" Maka saya membelinya dengan harga sekian dan sekian, kemudian saya datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengatakan; saya telah membelinya dengan harga sekian dan sekian. Lalu beliau bersabda: \"Jadikanlah untuk memberi minum orang-orang muslim dan pahalanya untukmu.\" Mereka mengatakan; ya. Utsman berkata; saya bertanya dan bersumpah dengan nama Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia, apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat ke wajah beberapa orang lalu bersabda: \"Barang siapa yang mempersiapkan mereka, maka Allah akan mengampuninya.\" Yaitu pasukan Al 'Usrah, maka saya mempersiapkan mereka hingga mereka tidak kehilangan satu tali unta dan satu tali kendalipun. Maka mereka berkata; ya. Utsman berkata; ya Allah saksikanlah, ya Allah saksikanlah, ya Allah saksikanlah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 98
			}
		}
	]
}