{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3245,
			"arabicnumber": 3245,
			"text": "Telah mengkhabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Muhammad, dari [Ibnu Al Qasim] dari [Malik] dari [Abdullah bin Yazid] dari [Abu Salamah bin Abdur Rahman] dari [Fathimah binti Qais] bahwa Abu 'Amr bin Hafsh menceraikannya sama sekali, dan ia tidak hadir. Kemudian wakilnya mengirimkan gandum kepadanya, lalu iapun marah. Kemudian wakil tersebut berkata; demi Allah, engkau tidak memiliki hak sedikitpun atas kami. Kemudian ia datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepadanya. Kemduian beliau bersabda: \"Engkau tidak mendapatkan nafkah.\" Kemudian beliau memerintahkannya agar ber'iddah di rumah Ummu Syarik, kemudian beliau bersabda: \"Orang itu adalah wanita yang sering didatangi para sahabatku, maka ber'iddahlah di rumah Ibnu Ummi Maktum, karena ia adalah laki-laki yang buta, engkau dapat meletakkan pakaianmu. Kemudian apabila engkau telah halal maka beritahu saya.\" Ia berkata; kemudian setelah halal, saya menyebutkan kepada beliau bahwa Mu'awiyah bin Sufyan dan Abu Jahm telah melamarnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adapun Abu Jahm maka ia tidak pernah meletakkan tongkatnya dari pundak, adapun Mu'awiyah maka ia adalah orang yang miskin tidak memiliki harta. Akan tetapi menikahlah dengan Usamah bin Zaid.\" Lalu saya membencinya, kemudian beliau bersabda: \"Menikahlah dengan Usamah bin Zaid.\" Maka saya menikah dengannya. Lalu Allah 'azza wajalla menjadikan padanya kebaikan dan sayapun iri kepadanya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 50
			}
		}
	]
}