{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"26": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3358,
			"arabicnumber": 3358,
			"text": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Ali bin Mushir] dari [Daud bin Abi Hindun] dari [Asy Sya'bi] dari ['Alqamah] dari [Abdullah], telah datang kepadanya beberapa orang, mereka berkata; seorang laki-laki dari kami menikahi seorang wanita dan belum menentukan mahar, belum mengumpulinya hingga laki-laki tersebut meninggal. Kemudian Abdullah berkata; sejak berpisah dengan Rasulullah shallallahu 'alaihi wasallam saya belum pernah ditanya yang lebih berat bagiku daripada permasalahan ini. Begini saja, datangilah selainku. Mereka tetap mendatangi Abdullah selama sebulan namun belum juga mendapat titik temu. Akhirnya mereka katakan; siapakah yang kami tanya jika kami tidak bertanya kepadamu, sedangkan engkau termasuk diantara sahabat Muhammad shallallahu 'alaihi wasallam di negeri ini, dan kami tidak mendapatkan selainmu. Abdullah berkata; saya akan berkata mengenainya dengan pendapatku, apabila benar maka hanya dari Allah tidak ada sekutu baginya dan apabila salah maka itu berasal dariku dan dari setan, Allah dan rasulNya berlepas diri darinya. Saya berpendapat bahwa ia diberi mahar wanita seperti wanita lainnnya, tidak ada pengurangan, serta kezhaliman dan ia mendapatkan warisan serta menunggu masa 'iddah empat bulan sepuluh hari. 'Alqamah berkata; dan hal tersebut di dengar [orang-orang] dari Asyja', kemudian mereka berdiri dan berkata; kami bersaksi bahwa engkau memberi keputusan dengan apa yang diputuskan Rasulullah shallallahu 'alaihi wasallam terhadap seorang wanita dari kami yang biasa dikenal dengan Barwa' binti Wasyiq. 'Alqamah berkata; tidaklah Abdullah terlihat bergembira seperti kegembiraan pada saat itu kecuali karena keIslamannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 163
			}
		}
	]
}