{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Salamah], ia berkata; telah menceritakan kepada kami [Ibnu Al Qasim] dari [Malik], ia berkata; telah menceritakan kepadaku [Ibnu Syihab] bahwa [Sahl bin Sa'd As Sa'idi] telah mengabarkan kepadanya bahwa 'Uwaimir Al 'Ajalani datang kepada 'Ashim bin Adi kemudian berkata; bagaimana pendapatmu wahai 'Ashim, seandainya seorang laki-laki mendapatkan bersama isterinya terdapat seorang laki-laki? Apakah ia membunuhnya kemudian orang-orang membunuhnya, atau bagaimana ia berbuat? Wahai 'Ashim, Tanyakan kepada Rasulullah shallallahu 'alaihi wasallam mengenai hal tersebut. Kemudian 'Ashim bertanya kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau tidak menyukai masalah-masalah tersebut, dan mencelanya, hingga terasa berat hal tersebut bagi 'Ashim apa yang ia dengar dari Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala 'Ashim kembali kepada keluarganya datanglah 'Uwaimir kepadanya dan berkata; wahai 'Ashim, apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepadamu? Kemudian 'Ashim berkata kepada 'Uwaimir; engkau tidak datang kepadaku dengan kebaikan, sungguh Rasulullah shallallahu 'alaihi wasallam tidak menyukai permasalahan yang engkau tanyakan. Kemudian 'Uwaimir berkata; demi Allah, saya tidak akan berhenti hingga menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian 'Uwaimir datang kepada Rasulullah shallallahu 'alaihi wasallam di tengah orang-orang. Kemudian ia berkata; wahai Rasulullah, bagaimana pendapat anda mengenai seorang laki-laki yang mendapatkan bersama isterinya terdapat laki-laki yang lain, apakah ia membunuhnya dan orang-orang membunuhnya atau bagaimana ia berbuat? Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh telah turun wahyu mengenaimu dan isterimu. Pergi dan bawalah dia.\" Sahl berkata; kemudian mereka berdua saling melaknat, dan saya bersama orang-orang yang lain berada di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala 'Uwaimir selesai, ia berkata; wahai Rasulullah, saya telah berdusta apabila saya menahannya. Kemudian ia menceraikan isterinya sebanyak tiga kali talak sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		}
	]
}