{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3466,
			"arabicnumber": 3466,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] ia berkata; telah menceritakan kepada kami [Abu Daud] ia berkata; telah menceritakan kepada kami [Abdul Aziz bin Abu Salamah] dan [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Sahl bin Sa'd] dari ['Ashim bin Adi] ia berkata, \"Uwaimir, seorang laki-laki dari Bani Al 'Ajlan, datang kepadaku. Ia berkata, \"Wahai 'Ashim, bagaimana pendapatmu mengenai seorang laki-laki yang melihat seorang laki-laki bersama isterinya? Apakah ia boleh membunuhnya sehingga mereka (wali kurban) membunuhnya (sebagai qishash) atau bagaimana ia berbuat? Wahai 'Ashim, tanyakanlah kepada Rasulullah shallallahu 'alaihi wasallam.\" Kemudian 'Ashim bertanya mengenai hal tersebut kepada Nabi shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam mencela permasalahan-permasalahan tersebut, dan beliau tidak menyukainya. Kemudian 'Uwaimir datang dan berkata, \"Apa yang telah engkau perbuat wahai 'Ashim? Ashim menjawab, \"Aku berbuat bahwa engkau tidak datang kepadaku dengan kebaikan, Rasulullah shallallahu 'alaihi wasallam tidak menyukai permasalahan-permasalahan tersebut, dan mencelanya.\" 'Uwaimir berkata, \"Demi Allah, sungguh aku akan menanyakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam.\" Kemudian ia datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya kepadanya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Sungguh Allah 'azza wajalla telah menurunkan mengenai dirimu dan isterimu. Maka datangkanlah dia.\" Sahl berkata, \"Aku bersama orang-orang berada di sisi Rasulullah shallallahu 'alaihi wasallam, kemudian ia datang membawa isterinya. Keduanya lalu saling melaknat, 'Uwaimir kemudian berkata, \"Wahai Rasulullah, demi Allah, seandainya aku menahannya sungguh aku telah berdusta terhadapnya.\" Kemudian ia menceraikannya sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya untuk menceraikannya. Kemudian hal tersebut menjadi hukum dua orang yang saling melaknat",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 78
			}
		}
	]
}