{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "Telah mengabarkan kepada kami ['Amru bin Ali] dan [Muhammad bin Al Mutsanna] mereka berkata; telah menceritakan kepada kami [Yahya bin Sa'id] ia berkata; telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] ia berkata; aku mendengar [Sa'id bin Jubair] berkata, \"Aku ditanya mengenai dua orang yang saling melakukan li'an (sumpah) pada masa pemerintahan Ibnu Az Zubair, apakah keduanya dipisahkan? Maka aku tidak mengetahui apa yang akan aku katakan. Kemudian aku berdiri dari tempatku menuju rumah [Ibnu Umar] dan berkata, \"Wahai Abu Abdurrahman, apakah dua orang yang melakukan li'an dipisahkan antara keduanya? Ia menjawab, \"Ya, subhanallah. Sesungguhnya orang pertama yang bertanya mengenai hal tersebut adalah Fulan bin Fulan. Ia berkata, \"Wahai Rasulullah, bagaimana pendapat anda… -'Amru tidak berkata; bagaimana pendapatmu- seorang lelaki di antara kami melihat perbuatan keji pada isterinya, apabila ia berbicara maka hal itu adalah suatu perkara yang besar, -sedangkan 'Amru berkata; ia telah melakukan perkara yang besar-, dan apabila ia diam maka ia diam dalam kondisi seperti itu.\" Kemudian beliau tidak menjawabnya. Setelah itu, orang tersebut datang kepada beliau dan berkata, \"Sesungguhnya perkara yang telah aku tanyakan kepada anda, telah diujikan kepadaku (membuat penderitaan). Kemudian Allah 'azza wajalla menurunkan ayat-ayat tersebut pada Surat An Nuur: '(Dan orang-orang yang menuduh isterinya (berzina), hingga firman Allah (dan (sumpah) yang kelima bahwa kemurkaan Allah akan menimpanya (isteri), jika dia (suami) termasuk orang yang berkata benar) ' (Qs. An Nuur: 6-9). Maka beliau memulai dari laki-laki, menasehati, mengingatkan dan mengabarkan kepadanya, bahwa adzab dunia lebih ringan daripada 'adzab akhirat. Kemudian orang tersebut berkata, 'Demi Dzat yang telah mengutusmu dengan kebenaran, aku tidak berdusta.' Kemudian kepada wanita, beliau nasehati dan mengingatkannya. Kemudian wanita tersebut berkata, 'Demi Dzat yang mengutusmu dengan kebenaran, sesungguhnya ia telah berdusta.' Kemudian beliau memulai dari yang laki-laki (untuk bersumpah). Maka laki-laki itu pun bersumpah empat kali dengan nama Allah, bahwa ia termasuk di antara orang-orang yang benar, dan yang kelimanya bahwa laknat Allah tertimpa kepadanya apabila ia termasuk orang yang berdusta. Kemudian kepada yang wanita, maka ia bersumpah sebanyak empat kali dengan nama Allah, bahwa suaminya merupakan di antara orang-orang yang berdusta, dan yang kelimanya bahwa kemurkaan Allah tertimpa kepadanya apabila suaminya termasuk di antara orang-orang yang benar. Kemudian beliau memisahkan di antara mereka berdua",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		}
	]
}