{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3518,
			"arabicnumber": 3518,
			"text": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata; telah memberitakan kepadaku [Yunus] dari [Ibnu Syihab] bahwa ['Ubaidullah bin Abdullah] menceritakan kepadanya bahwa [ayahnya] mengirim surat kepada [Umar bin Abdulllah bin Arqam Az Zuhri] memerintahkan kepadanya agar menemui Subai'ah binti Al Harits Al Aslamiyah. Kemudian iapun bertanya kepada [Subai'ah] mengenai kisahnya dan apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepadanya saat minta fatwa. Kemudian Umar bin Abdullah mengirim surat kepada Abdullah bin 'Utbah mengabarkan kepadanya, bahwa Subai'ah mengabarkan kepadanya bahwa ia pernah menjadi isteri Sa'd bin Khaulah dari Bani 'Amir bin Luai, seorang ahli badar. Kemudian suaminya meninggal saat haji Wada', sementara dirinya dalam keadaan hamil. Dan tak lama kemudian iua melahirkan anak. Setelah selesai nifas ia berhias untuk orang yang meminang. Lalu ia ditemui Abu As Sanabil bin Ba'kak seorang laki-laki dari Bani Abdu Ad Dar. Abu Sanabil lalu berkata kepadanya, \"Kenapa aku lihat engkau berhias? Apakah engkau akan menikah? Sungguh, demi Allah engkau tidak halal menikah hingga lewat empat bulan sepuluh hari.\" Subai'ah berkata, \"Setelah ia mengatakan itu kepadaku, maka aku pun mengumpulkan pakaianku, kemudian di sore harinya aku menemui Rasulullah shallallahu 'alaihi wasallam dan menanyakan hal tersebut. Beliau kemudian memberikan fatwa bahwa aku telah halal ketika melahirkan kandunganku. Dan beliau memerintahkanku untuk menikah apabila aku menghendaki",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 130
			}
		}
	]
}