{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3533,
			"arabicnumber": 3533,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan aku mendengar, lafazhnya adalah lafazh Al Harits, ia berkata; telah memberitakan kepada kami [Ibnu Al Qasim] dari [Malik] dari [Abdullah bin Abu Bakr] dari [Humaid bin Nafi'] dari [Zainab binti Abu Salamah], bahwa ia mengabarkan kepadanya tiga hadits.\" Zainab berkata, \"Aku menemui [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam ketika ayahnya, Abu Sufyan bin Harb, meninggal. Kemudian Ummu Habibah meminta minyak wangi dan memberi seorang sahaya wanita sebagian darinya kemudian ia mengusap kedua pipinya kemudian berkata, \"Demi Allah, aku tidak butuh kepada minyak wangi, hanya saja aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk berkabung terhadap mayit di atas tiga malam, kecuali terhadap suaminya hingga empat bulan sepuluh hari",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3533.2,
			"arabicnumber": 3533.2,
			"text": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya) [Zainab] berkata, \"Aku menemui [Zainab binti Jahsy] ketika saudaranya meninggal, dan ia minta minyak wangi dan mengusap dengan sebagiannya, kemudian berkata, \"Demi Allah, aku tidak membutuhkan minyak wangi, hanya saja aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk berkabung terhadap mayit di atas tiga malam, kecuali terhadap suami hingga empat bulan sepuluh hari",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3533.3,
			"arabicnumber": 3533.3,
			"text": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya), [Zainab] berkata, \"Aku mendengar [Ummu Salamah] berkata, \"Seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya anak wanitaku telah ditinggal mati suaminya dan ia mengeluhkan matanya, apakah aku boleh memberinya celak? Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak.\" Kemudian beliau bersabda: \"Sesungguhnya 'iddahnya adalah empat bulan sepuluh hari, dan sungguh salah seorang di antara kalian pada masa jahiliyah melempar kotoran binatang di penghujung tahun.\" Humaid berkata, \"Kemudian aku katakan kepada Zainab, \"Kenapa ia melempar kotoran binatang pada penghujung tahun? Zainab menjawab, \"Seorang wanita apabila ditinggal mati suaminya ia masuk ke rumah kecil dan buruk, memakai pakaian yang terburuk serta tidak mengusap minyak wangi atau apapun hingga lewat satu tahun. Kemudian didatangkan kepadanya binatang, keledai atau kambing atau burung kemudian ia memegangnya, jarang sekali ia menyentuh sesuatu kecuali sesuatu tersebut akan mati. Kemudian ia keluar dan diberi kotoran binatang, setelah itu ia melemparkannya dan kembali mengenakan minyak wangi atau yang lainnya.\" Malik berkata, \"Taftadldlu adalah mengusapnya.\" Dalam hadits Muhammad, Malik berkata, \"Al Hifsyu adalah rumah dari bambu",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}