{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3545,
			"arabicnumber": 3545,
			"text": "Telah mengabarkan kepada kami [Abdul Hamid bin Muhammad] berkata; telah menceritakan kepada kami [Makhlad] berkata; telah menceritakan kepada kami [Ibnu Juraij] dari ['Atha] berkata; telah mengabarkan kepadaku [Abdurrahman bin 'Ashim] bahwa [Fatimah binti Qais] mengabarkan kepadanya, bahwa ia pernah menjadi isteri seorang laki-laki Bani Makhzum, dan dia telah menceraikannya dengan tiga talak. Laki-laki itu kemudian keluar kesebagian peperangan dan memerintahkan wakilnya agar memberikan nafkah kepadanya, namun ia menolak pemberian itu. Setelah itu ia pergi menemui sebagian isteri Nabi shallallahu 'alaihi wasallam, dan ketika Rasulullah shallallahu 'alaihi wasallam masuk ia sedang bersama salah seorang isterinya. Isteri beliau kemudian berkata, \"Wahai Rasulullah, ini Fatimah binti Qais, ia telah dicerai oleh Fulan. Kemudian Fulan mengirimkan kepadanya sebagian nafkah, namun ia menolak pemberian itu. Dan Fulan mengaku bahwa hal tersebut merupakan sesuatu yang ia berikan sebagai kebaikan darinya. Beliau bersabda: \"Ia benar\". Nabi shallallahu 'alaihi wasallam bersabda: \"Pindahlah kamu ke rumah Ummu Kultsum, dan lakukanlah iddah di sana.\" Kemudian beliau bersabda: \"Sesungguhnya Ummu Kultsum banyak orang yang mengunjunginya, maka pindahlah kepada Abdullah Ibnu Ummi Maktum, sesungguhnya ia adalah orang yang buta.\" Kemudian Fatimah pindah ke rumah Abdullah dan ber'iddah di rumahnya hingga selesai 'iddahnya, lalu ia dilamar Abu Al Jahm dan Mu'awiyah bin Abu Sufyan. Maka ia pun datang menemui Rasulullah shallallahu 'alaihi wasallam meminta petunjuk mengenai keduanya. Beliau bersabda: \"Abu Al Jahm itu seorang laki-laki yang aku khawatir dirimu terhadap pukulan tongkatnya. Adapun Mu'awiyah ia adalah laki-laki yang miskin tidak memiliki harta. Maka menikahlah dengan Usamah bin Zaid",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 159
			}
		}
	]
}