{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3554,
			"arabicnumber": 3554,
			"text": "Telah mengabarkan kepada kami [Zakaria bin Yahya] berkata; telah menceritakan kepada kami [Ishaq bin Ibrahim] ia berkata; telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] berkata; telah menceritakan kepadaku [ayahku] ia berkata; telah menceritakan kepada kami [Yazid An Nahwi] dari ['Ikrimah] dari [Ibnu Abbas] mengenai firman Allah: '(ayat mana saja yang kami nasakhkan atau kami jadikan lupa kepadanya maka kami datangkan yang lebih baik daripadanya atau yang sebanding darinya) ' (Qs. Al Baqarah: 106), dan firman Allah: '(Dan apabila kami letakkan suatu ayat di tempat ayat yang lain sebagai penggantinya padahal Allah lebih mengetahui apa yang diturunkan-Nya) ' (Qs. An Nahl: 1o1), dan firman Allah: '(Allah menghapuskan apa yang dia kehendaki dan menetapkan (apa yang dia kehendaki, dan di sisi-Nya-lah terdapat Ummul-Kitab (Lauh mahfuzh)) ' (Qs. Ar Ra'd: 39). Yang pertama kali dinasakh dalam Al Qur'an adalah tentang kiblat, dan firman: '(Wanita-wanita yang ditalak hendaklah menahan diri (menunggu) tiga kali quru'. Tidak boleh mereka menyembunyikan apa yang diciptakan Allah dalam rahimnya, jika mereka beriman kepada Allah dan hari akhirat. Dan suami-suaminya berhak merujukinya dalam masa menanti itu, jika mereka (para suami) menghendaki ishlah) ' (Qs. Al Baqarah: 228). Hal itu karena jika seorang laki-laki mencerai isterinya, maka ia lebih berhak untuk kembali kepadanya walaupun telah mencerainya tiga kali, kemudian Allah menghapus hal tersebut dan berfirman: '(Talak (yang dapat dirujuki) dua kali. Setelah itu boleh rujuk lagi dengan cara yang ma'ruf atau menceraikan dengan cara yang baik) ' (Qs. Al Baqarah: 229)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 168
			}
		}
	]
}