{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"3": "The Book of Menstruation and Istihadah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Sulaiman bin Harb] dia berkata; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] dia berkata; orang Yahudi bila istri mereka haidl, mereka tidak mengajak makan dan minum bersama, dan tidak berkumpul bersamanya di rumah. Mereka menanyakan hal itu kepada Nabi shallallahu 'alaihi wasallam, Lalu Allah Azza wa Jalla menurunkan ayat \"Mereka bertanya kepadamu tentang haidl. Katakanlah, 'Itu adalah penyakit…\" Lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka untuk ikut makan dan minum dengannya, berkumpul dengan mereka di rumah, serta berbuat apa saja selain bersetubuh. Perempuan Yahudi tersebut berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak membiarkan satu perkara pun yang ada pada kami kecuali dia menyelisihinya!\" Lalu bangkitlah Usaid bin Hudlair dan Abbad bin Bisyr untuk memberitahukannya kepada Rasulullah shallallahu 'alaihi wasallam, mereka berkata: \"Apakah kita boleh menggauli mereka (para istri) yang sedang haidl?\" Wajah Rasulullah shallallahu 'alaihi wasallam lalu berubah dengan perubahan yang mencolok, sehingga kami menyangka bahwa beliau sangat marah, lalu keduanya pergi. Kemudian Rasulullah shallallahu 'alaihi wasallam menerima hadiah susu, maka beliau mencari jejak kedua orang ini lalu keduanya dibawa kepada Nabi shallallahu 'alaihi wasallam dan beliau memberi minum susu kepada keduanya. Jadi diketahuilah bahwa beliau shallallahu 'alaihi wasallam tidak marah pada kedua orang ini",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		}
	]
}