{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"37": "The Book of Fighting [The Prohibition of Bloodshed]"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4025,
			"arabicnumber": 4025,
			"text": "Telah mengabarkan kepada kami ['Amr bin Utsman bin Sa'id bin Katsir bin Dinar] dari [Al Walid] dari [Al Auza'i] dari [Yahya] dari [Abu Qilabah] dari [Anas] bahwa beberapa orang dari 'ukl datang kepada Nabi shallallahu 'alaihi wasallam kemudian mereka terkena penyakit paru-paru di Madinah. Lalu Nabi shallallahu 'alaihi wasallam memerintahkan mereka agar mendatangi unta shadaqah, dan meminum sebagian kencingnya, serta susunya. Kemudian mereka melakukannya dan membunuh orang yang menggembalanya serta menggiring unta tersebut. Maka Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan untuk mencari mereka. Anas berkata; kemudian mereka dihadapkan kepada beliau. Lalu beliau memotong tangan dan kaki mereka serta mencungkil mata mereka, tidak memenggal mereka dan beliau meninggalkan mereka hingga mati. Kemudian Allah 'azza wajalla menurunkan ayat: Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya hingga akhir Ayat. Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Muhammad bin Yusuf], ia berkata; telah menceritakan kepada kami [Al Auza'i], ia berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir], ia berkata; telah menceritakan kepadaku [Abu Qilabah] dari [Anas], ia berkata; telah datang kepada Rasulullah shallallahu 'alaihi wasallam delapan orang dari 'ukl.. kemudian ia menyebutkan hadits sama seperti itu hingga perkataannya tidak memenggal mereka. Dan ia berkata; mereka telah membunuh penggembala tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		}
	]
}