{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"41": "The Book of al-Fara' and al-'Atirah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4226,
			"arabicnumber": 4226,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nahs], ia berkata; telah memberitakan kepada kami [Abdullah yaitu Ibnu Al Mubarak] dari [Yahya yaitu Ibnu Zurarah bin Kuraim bin Al Harits bin 'Amr Al Bahili], ia berkata; saya mendengar [ayahku] menyebutkan bahwa ia mendengar [kakeknya yaitu Al Harits bin 'Amr] menceritakan bahwa ia berjumpa dengan Rasulullah shallallahu 'alaihi wasallam pada saat haji wada' dan beliau berada di atas ontanya yang berwarna Abu- Abu, kemudian saya mendatangi beliau dari salah satu sisi dan berkata; wahai Rasulullah, engkau ditebus dengan ayah dan ibuku, mintakan ampunan untukku. Kemudian beliau bersabda: \" Semoga Allah mengampuni kalian.\" Kemudian saya mendatanginya dari sisi yang lain, berharap beliau mengkhuskan saya tanpa mereka. Saya katakan; wahai Rasulullah, mintakan ampunan untukku. Kemudian beliau bersabda menggunakan tangannya: \" Semoga Allah mengampuni kalian.\" Kemudian seorang laki-laki berkata; wahai Rasulullah, bagaimana dengan 'atirah dan fara'? beliau bersabda: \"Barang siapa yang menginginkan maka ia menyembelih 'atirah dan barang siapa yang menginginkan maka ia tidak menyembelih 'atirah. Dan barang siapa yang menginginkan maka ia menyembelih fara' dan barang siapa yang menginginkan maka ia tidak menyembelih fara'. Dalam kambing terdapat kurbannya.\" Dan beliau mengenggam jari-jarinya kecuali satu. Telah mengabarkan kepadaku [Harun bin Abdullah], ia berkata; telah menceritakan kepadaku [Affan], ia berkata; telah menceritakan kepada kami [Yahya bin Zurarah As Sahmi], ia berkata; telah menceritakan kepadaku [ayahku] dari [kakekku yaitu Al Harits bin 'Amr]. telah menceritakan dan memberitakan kepadaku [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Hisyam bin Abdul Malik], ia berkata; telah menceritakan kepadaku [Yahya bin Zurarah As Sahmi], ia berkata; telah menceritakan kepadaku [ayahku] dari [kakekku yaitu Al Harits bin 'Amr] bahwa ia bertemu dengan Rasulullah shallallahu 'alaihi wasallam pada saat haji wada' kemudian berkata; wahai Rasulullah, engkau ditebus dengan ayah dan ibuku, mintakan ampunan untukku. Kemudian beliau bersabda: \" Semoga Allah mengampuni kalian.\" Kemudian saya memutar dari sisi yang lain... kemudian ia menyebutkan hadits tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		}
	]
}