{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"42": "The Book of Hunting and Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4352,
			"arabicnumber": 4352,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari ['Amr], ia berkata; saya mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami dan jumlah kami adalah tiga ratus orang, pemimpin kami adalah Abu 'Ubaidah bin Al Jarrah, kami mengintai kelompok dagang orang-orang Quraisy. Kemudian kami bermukim di tepi laut lalu kami tertimpa kelaparan yang sangat hingga kami makan daun yang terjatuh. Ia berkata; kemudian laut mendamparkan seekor binatang yang disebut ikan paus. Lalu kami memakan darinya selama setengah bulan. Dan kami berminyakan dari lemaknya, dan tubuh kami menjadi kuat. Kemudian Abu 'Ubaidah mengambil satu dari tulang-tulang rusuknya. Kemudian ia melihat kepada unta yang terpanjang serta orang yang tertinggi diantara pasukan. Lalu unta tersebut melewati di bawah tulang rusuk tersebut kemudian mereka merasa lapar, lalu seseorang menyembelih sebanyak tiga sembelihan kemudian mereka merasa lapar, lalu seseorang menyembelih tiga sembelihan kemudian mereka merasa lapar, lalu seseorang menyembelih tiga sembelihan kemudian Abu 'Ubaidah melarangnya. [Sufyan] berkata; telah berkata [Abu Az Zubair] dari [Jabir], kemudian kami bertanya kepada Nabi shallallahu 'alaihi wasallam lalu beliau bersabda: \"Apakah kalian membawa sebagiannya?\" ia berkata; kemudian kami mengeluarkan dari kedua mata ikan tersebut sekian dan sekian kendi dari lemak. Dan telah singgan di daerah Hajjaj 'ainih empat orang dan Abu 'Ubaidah memabawa kantong yang berisi kurma, dan ia memberi kami satu genggam hingga menjadi satu biji kurma, kemudian tatkala kami kehilangan kurma tersebut maka mendapatkannya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 90
			}
		}
	]
}