{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"5": "The Book of Salah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; Telah menceritakan kepada kami [Hisyam Ad-Dastawaa'i] dia berkata; Telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] dari [Malik bin Sha'sha'ah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ketika saya di depan Ka'bah antara tidur dan terjaga, tiba-tiba datang salah satu dari tiga orang yang ada di tengah-tengah dengan membawa ember emas yang isinya penuh hikmah dan iman, maka ia membelahku dari kerongkongan sampai perut, kemudian mencuci hati dengan air zamzam, lalu diisi hikmah dan iman. Lantas aku didatangkan seekor hewan tunggangan yang lebih kecil dari baghal (hewan hasil perkawinan silang antara kuda dan keledai-penerj) dan lebih besar dari keledai. Selanjutnya aku diajak pergi oleh Jibril Alaihis Salam. Kami sampai ke langit dunia, lalu kami ditanya, Siapa ini? 'dia menjawab, Jibril. Lalu ditanya lagi, \"siapa yang bersamamu?\" Jibril menjawab, 'Muhammad'. Dia ditanya lagi, dia sudah diutus kepada-Nya? Selamat datang, tamu mulia telah datang! Lalu aku mendatangi Adam? laihis Salam dan mengucapkan salam kepadanya, dia berkata, Selamat datang putra dan nabiku! Kemudian kami datang ke langit kedua dan ditanya, Siapa ini? Jibril menjawab, 'Jibril'. Ditanya lagi, 'Siapa yang bersamamu? Ia menjawab, 'Muhammad'. Lalu terjadilah apa yang terjadi saat bersama Adam. Aku datang kepada Yahya dan Isa dan mengucapkan salam kepada keduanya, lalu keduanya menjawab, Selamat datang wahai saudara dan nabi yang mulia! Selanjutnya kami datang ke langit yang ketiga, dan dia (Jibril) ditanya, 'Siapa ini? Ia menjawab, 'Jibril'. Lalu ditanya lagi, 'Siapa yang bersamamu? Ia menjawab 'Muhammad'. Lalu terjadilah hal yang sama dengan yang sebelumnya. Lalu aku bertemu dengan Yusuf Alaihis Salam, dan kuucapkan salam kepadanya, lalu ia menjawab; 'Selamat datang wahai saudaraku dan Nabi yang mulia! Kemudian kami sampai ke langit yang keempat dan terjadi seperti yang terjadi pada sebelumnya, aku datang kepada Idris Alaihis Salam, dan kuucapkan salam kepadanya, lalu ia menjawab, 'Selamat datang wahai saudaraku dan nabi yang mulia. Kemudian kami datang ke langit yang kelima dan terjadi seperti yang sebelumnya, aku datang kepada Harun Alaihis Salam dan kuucapkan salam kepadanya, lalu dia menjawab. Selamat datang saudara dan nabiku! Lalu kami datang ke langit yang ke enam, dan terjadi seperti itu juga, dan aku datang kepada Musa? laihis Salam dan aku ucapkan salam kepadanya, lalu ia menjawab, 'Selamat datang wahai saudaraku dan nabi yang mulia!. Setelah aku melewatinya, ia menangis, maka ia ditanya, 'Kenapa kamu menangis? 'Ia menjawab, 'Wahai Tuhanku, pemuda ini diutus setelah masaku, namun umatnya yang masuk surga lebih banyak dan lebih utama dari pada umatku. Kemudian kami datang ke langit ke tujuh dan juga terjadi seperti yang sebelumnya, aku datang kepada Ibrahim? laihis Salam dan kuucapkan salam kepadanya, lalu ia menjawab, 'Selamat datang wahai puteraku dan nabi yang mulia! Kemudian aku diangkat ke Baitul Makmur. Aku bertanya kepada Jibril tentang hal itu, dan ia menjawab, 'Inilah Baitul Makmur. Pada tiap hari ada tujuh puluh ribu malaikat yang shalat di dalamnya. Bila mereka keluar daripadanya, mereka tak kembali lagi. Kemudian aku diangkat ke Sidratul Muntaha, dan aku mendapati pohon yang buahnya besar seperti tempayan, daunnya seperti telinga gajah, dan di dasarnya ada empat sungai. Dua sungai yang tersembunyi dan dua sungai yang nampak jelas. Maka aku bertanya kepada Jibril, diapun menjawab; Adapun dua sungai yang tersembunyi dia adalah sungai dalam surga, sedangkan dua sungai yang nampak jelas adalah sungai Eufrat dan sungai Nil. Kemudian diwajibkan shalat lima puluh kali kepadaku. Aku kemudian datang kepada Musa, dan dia berkata, 'Apa yang engkau perbuat? Aku menjawab, 'Telah diwajibkan kepadaku shalat lima puluh kali. 'Dia berkata, 'Aku lebih mengetahui keadaan manusia dari pada kamu. Aku telah mencoba sekuat tenaga pada Bani Israil. Umatmu tidak akan mampu mengembannya, maka kembalilah ke Rabbmu dan mintalah keringanan kepada-Nya'. Maka Aku kembali lagi ke Rabbku dan aku meminta keringanan kepada-Nya, dan Allah menguranginya menjadi empat puluh kali. Kemudian aku kembali ke Musa? laihis Salam dan ia berkata, 'Apa yang kamu perbuat? 'Aku menjawab, 'Dia menguranginya menjadi empat puluh kali. Lalu dia berkata seperti perkataannya yang pertama kali, maka aku kembali lagi ke Rabbku Azza wa Jalla. Dan Dia menguranginya menjadi tiga puluh. Lantas aku datang kepada Musa Alaihis salam untuk memberitahukannya, dan dia berkata seperti perkataan yang semula. Aku lalu kembali lagi ke Rabbku dan Dia menguranginya menjadi dua puluh kali. Kemudian sepuluh kali, dan terakhir menjadi lima kali. Lalu aku datang kepada Musa Alaihis salam, dan beliau berkata seperti perkataannya yang pertama, namun aku malu untuk kembali kepada Allah Azza wa Jalla.\" Lalu dia (Nabi Muhammad shallallahu 'alaihi wasallam) diseru \"Telah kutetapkan kewajiban-Ku, telah kuringankan hamba-Ku, dan akan dibalas tiap kebaikan dengan sepuluh pahala",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		}
	]
}