{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"44": "The Book of Financial Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4639,
			"arabicnumber": 4639,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Salim bin Abu Al Ja'd] dari [Jabir bin Abdullah], ia berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu safar, dan saya berada di atas unta. Kemudian beliau bersabda: \"Kenapa engkau berada di bagian belakang?\" Saya katakan; untaku keletihan. Kemudian beliau memegang ekornya dan menghardiknya, lalu saya berada di depan orang-orang dan kepala unta tersebut membuatkan merasa khawatir. Kemudian tatkala kami telah mendekati Madinah beliau bersabda: \"Apa yang dilakukan unta tersebut? Juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu wahai Rasulullah. Beliau bersabda: \"Tidak, juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu. Beliau bersabda: \"Tidak, julallah kepadaku, saya beli dengan satu uqiyah, naiklah kemudian apabila engkau telah sampai Madinah maka datanglah kepada kami membawa unta tersebut.\" Tatkala saya telah sampai Madinah maka saya mendatanginya membawa unta tersebut. Kemudian beliau bersabda kepada Bilal: \"Wahai Bilal, timbanglah untuknya satu uqiyah dan tambahlah satu qirath.\" Ini adalah sesuatu yang dilebihkan Rasulullah shallallahu 'alaihi wasallam untukku, dan beliau tidak meninggalkanku. Kemudian saya meletakkannya di sebuah kantong, dan tetap ada padaku hingga penduduk Syam datang menyerang pada saat perang Harrah, dan mereka mengambil dari kami apa yang telah mereka ambil",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 191
			}
		}
	]
}