{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"44": "The Book of Financial Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4656,
			"arabicnumber": 4656,
			"text": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la], ia berkata; telah memberitakan kepada kami [Ibnu Wahb], ia berkata; telah memberitakan kepadaku beberapa orang dari ulama, diantara mereka adalah [Yunus] dan [Al Laits] bahwa [Ibnu Syihab] telah mengabarkan kepada mereka dari ['Urwah] dari [Aisyah] bahwa ia berkata; telah datang Barirah kepadaku dan berkata; wahai Aisyah, sesungguhnya saya telah mengadakan janji dengan tuanku untuk memerdekakan diriku, dengan sembila uqiyah pada setiap tahun satu uqiyah, maka bantulah saya. Dan ia belum membayar sedikitpun dari perjanjian pembebasannya itu. Kemudian Aisyah berkata kepadanya; kembalilah kepada taunmu, apabila mereka ingin saya memberikan itu semua kepada mereka dan perwaliannya untukku maka saya akan melakukannya. Kemudian Barirah pergi menemui tuannya dan menawarkan kepada mereka hal tersebut, namun mereka menolak, dan mengatakan; apabila ia mau mengharapkan pahala maka hendaknya silahkan ia melakukan dan perwalian itu untuk kami. Kemudian Aisyah menyampaikan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Hal itu tidak menghalangimu darinya. Belilah dan merdekakan, sesungguhnya perwalian untuk orang yang memerdekakan.\" Kemudian Aisyah melakukannya, dan Rasulullah shallallahu 'alaihi wasallam berdiri diantara manusia kemudian memuji Allah ta'la kemudian bersabda: \"Adapun selanjutnya, bagaimana keadaan orang-orang yang memberikan syarat-syarat yang tidak ada dalam Kitab Allah. Barang siapa yang memberikan syarat yang tidak ada dalam Kitab Allah maka syarat tersebut adalah batil, walaupun seratus syarat. Keputusan Allah lebih berhak dan syarat Allah lebih kuat, sesungguhnya perwalian adalah untuk orang yang memerdekakan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 208
			}
		}
	]
}