{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], dia berkata; \"Saya mengira dia mengatakan; dan dari [Rafi' bin Khadij] bahwa mereka berkata; \"Abdullah bin Sahl bin Zaid dan Muhayyishah bin Mas'ud telah keluar hingga ketika mereka sampai di Khaibar mereka berpisah di sebagian tempat di sana, kemudian Muhayyishah mendapatkan Abdullah bin Sahl terbunuh. Lalu dia menguburnya kemudian menghadap kepada Rasulullah shallallahu 'alaihi wasallam bersama dengan Huwayyishah bin Mas'ud serta Abdur Rahman bin Sahl dan dia adalah orang yang paling muda. Kemudian Abdur Rahman pergi untuk berbicara sebelum dua orang sahabatnya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Dahulukanlah yang tua.\" Kemudian dia diam dan dua orang sahabatnya berbicara, kemudian dia berbicara bersama mereka dan mereka menyebutkan kepada Rasulullah shallallahu 'alaihi wasallam mengenai terbunuhnya Abdullah bin Sahl. Lalu beliau bersabda: \"Apakah kalian bersumpah lima puluh sumpah dan kalian berhak terhadap sahabat kalian atau terhadap orang yang menyerang kalian?\" Mereka berkata; \"Bagaimana kami bersumpah sedang kami belum menyaksikan?\" Kemudian beliau bersabda: \"Apakah kalian mau orang-orang Yahudi akan bebas dari tuduhan kalian dengan lima puluh sumpah?\" Mereka berkata; \"Bagaimana kami menerima sumpah orang-orang kafir?\" Kemudian tatkala Rasulullah shallallahu 'alaihi wasallam melihat hal tersebut beliau memberikan diyatnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		}
	]
}