{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4713,
			"arabicnumber": 4713,
			"text": "Telah mengabarkan kepada kami [Ahmad bin Abdah] telah memberitakan kepada kami [Hammad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] bahwa mereka telah menceritakan kepadanya bahwa Muhayyishah bin Mas'ud dan Abdullah bin Sahl datang ke Khaibar untuk suatu keperluan kemudian mereka berpisah di sebuah pohon kurma, lalu Abdullah bin Sahl terbunuh maka saudaranya yaitu Abdur Rahman bin Sahl serta Huwayyishah dan Muhayyishah yakni dua orang anak pamannya datang kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Abdur Rahman berbicara mengenai perkara saudaranya padahal dia adalah orang yang paling muda di antara mereka. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya yang lebih tua memulai terlebih dahulu.\" Kemudian mereka berdua berbicara mengenai perkara sahabat mereka berdua. Kemudian Rasulullah shallallahu 'alaihi wasallam menyebutkan suatu kalimat yang maknanya; lima puluh orang dari kalian bersumpah. Maka mereka berkata; \"Wahai Rasulullah, itu adalah suatu perkara yang tidak kami saksikansendiri, bagaimana kami bersumpah?\" Beliau bersabda: \"Kalian mau orang-orang Yahudi akan bebas dari tuduhan kalian dengan sumpah lima puluh orang di antara mereka.\" Mereka berkata; \"Wahai Rasulullah, mereka adalah orang-orang kafir.\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyatnya dari beliau sendiri. Sahl berkata; \"Saya memasuki kandang milik mereka, kemudian saya disepak oleh seekor unta dari unta-unta tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		}
	]
}