{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4724,
			"arabicnumber": 4724,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Auf bin Abu Jamilah] telah menceritakan kepadaku [Abu Umar Al 'Aidzi] telah menceritakan kepada kami ['Alqamah bin Wail] dari [Wail], dia berkata; \"Saya menyaksikan Rasulullah shallallahu 'alaihi wasallam pada saat dihadapkan kepada beliau seorang pembunuh yang dituntun oleh wali orang yang dibunuh dengan tali kekang dari kulit. Rasulullah shallallahu 'alaihi wasallam bersabda kepada wali orang yang dibunuh: \"Apakah engkau akan memaafkannya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau akan mengambil diyat darinya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Engkau akan membunuhnya?\" Dia menjawab; \"Ya.\" Beliau bersabda; \"Pergilah bersamanya!\" Tatkala dia telah pergi bersamanya dan berpaling maka beliau memanggilnya dan bersabda kepadanya: \"Apakah engkau akan memaafkannya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau akan mengambil diyat darinya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Engkau akan membunuhnya?\" Dia menjawab; \"Ya.\" Beliau bersabda; \"Pergilah bersamanya!\" Pada saat itu beliau bersabda: \"Sesungguhnya apabila engkau memaafkannya maka dia akan kembali membawa dosanya dan dosa sahabatmu.\" Lalu dia memaafkannya dan membiarkannya. Saya melihatnya menyeret tali kekang dari kulit. Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Jami' bin Mathar Al Habathi] dari ['Alqamah bin Wail] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang semisal. Yahya berkata; Dia (hadits ini) lebih baik darinya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		}
	]
}