{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Hatim] dari [Simak], dia menyebutkan bahwa ['Alqamah bin Wail] telah mengabarkan kepadanya dari [ayahnya] bahwa dia pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki yang menuntun orang lain dengan tali kekang dari kulit lalu berkata; \"Wahai Rasulullah, orang ini telah membunuh saudaraku.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya; \"Apakah engkau membunuhnya?\" Dia berkata; \"Wahai Rasulullah, apabila dia tidak mengaku maka akan saya datangkan bukti.\" Orang tersebut berkata; \"Ya, saya telah membunuhnya.\" Beliau bersabda: \"Bagaimana engkau membunuhnya?\" Orang tersebut menjawab; \"Saya bersamanya mencari kayu bakar dari sebuah pohon, kemudian dia menghinaku dan membuatku marah. Kemudian saya memukul kepalanya dengan menggunakan kapak.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah engkau memiliki harta untuk menebus dirimu?\" Orang tersebut berkata; \"Wahai Rasulullah, saya tidak memiliki apapun kecuali kapak dan pakaianku.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah engkau melihat bahwa kaummu akan membelimu?\" Dia berkata; \"Saya lebih hina bagi kaumku daripada orang itu.\" Beliau melemparkan tali kekang tersebut kepada orang tersebut dan bersabda: 'Bawalah temanmu.\" Kemudian tatkala dia telah pergi Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dia membunuhnya berarti dia seperti orang tersebut.\" Kemudian mereka menemui orang tersebut dan berkata; \"Celaka engkau, sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dia membunuhnya maka dia sepertinya.\" Kemudian orang tersebut kembali kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, saya diberitahu bahwa Tuan mengatakan: \"Apabila dia membunuhnya maka dia sepertinya.\" Tidaklah saya membawanya kecuali dengan perintah Tuan.\" Beliau bersabda: \"Apakah engkau tidak mau dia membawa dosamu dan dosa sahabatmu?\" Dia berkata; \"Ya.\" Beliau bersabda: \"Jika demikian?\" Dia berkata; \"Berarti ya seperti itu.\" Telah mengabarkan kepada kami [Zakariya bin Yahya] telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abu Yunus] dari [Simak bin Harb] bahwa ['Alqamah bin Wail] telah menceritakan kepadanya bahwa [ayahnya] telah menceritakan kepadanya, dia berkata; \"Saya sedang duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki yang menuntun orang lain. Sama seperti hadits di atas",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		}
	]
}