{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4778,
			"arabicnumber": 4778,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] dari [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam mengutus Abu Jahm bin Hudzaifah sebagai pengurus shadaqah, kemudian terdapat seorang laki-laki yang terus mendesak dalam meminta shadaqah, sehingga Abu Jahm memukulnya, kemudian orang-orang mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; \"Kami meminta balasan wahai Rasulullah, \" Beliau bersabda: \"Maukah Kalian mendapatkan ini dan itu?\" Namun mereka tidak ridha, lalu beliau bersabda: \"kalian mendapatkan ini dan itu, \" lalu mereka ridha. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku akan berkhutbah kepada manusia dan akan aku kabari mereka dengan keridhaan kalian, \" Mereka menjawab; \"Ya.\" Lalu Nabi shallallahu 'alaihi wasallam berkhutbah dan beliau bersabda: \" Sesungguhnya mereka mendatangiku ingin memintaku balasan, lalu aku tawarkan kepada mereka ini dan itu, lalu mereka ridho, \" Mereka berkata; \"Tidak.\" Maka orang-orang muhajirin hendak melawan mereka, lalu Rasulullah shallallahu 'alaihi wasallam menyuruh mereka untuk menahan hal itu, dan mereka menahannya, lalu beliau memanggil mereka dan bersabda: \" Apakah kalian ridha, \" mereka menjawab iya, beliau bersabda: \" aku akan berkhutbah di hadapan manusia dan mengabarkan mereka akan keridhaan kalian, \" kemudian beliau berkhutbah di hadapan manusia dan bersabda: \"Apakah kalian ridha, \" mereka menjawab; \"Ya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 73
			}
		}
	]
}