{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"45": "The Book of Oaths (qasamah), Retaliation and Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4853,
			"arabicnumber": 4853,
			"text": "Telah mengabarkan kepada kami ['Amru bin Manshur] telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada penduduk Yaman yang berisi tentang berbagai kewajiban, sunnah-sunnah, dan diyat. Beliau mengutus 'Amru bin Hazm untuk mengantar surat tersebut. Kemudian surat tersebut dibacakan di hadapan penduduk Yaman. Inilah naskahnya; \"Dari Muhammad, Nabi shallallahu 'alaihi wasallam, kepada Syurahbil bin Abdu Kulal dan Nu'aim bin Abdu Kulal, serta Al Harits bin Abdu Kulal Qail Dzu ru'ain, Ma'afir, dan Hamdan; adapun selanjutnya.... Dan di antara isi surat tersebut adalah bahwa, \"Barang siapa membunuh seorang mukmin secara lalim dengan adanya bukti maka ia mendapatkan balasan, kecuali apabila para wali orang yang dibunuh merasa rela. Untuk sebuah nyawa satu diyat yaitu seratus ekor unta, hidung apabila dipotong semuanya adalah satu diyat, untuk lidah satu diyat, untuk dua bibir satu diyat, dua buah pelir satu diyat, penis satu diyat, tulang belakang satu diyat, dua mata satu diyat, satu kaki setengah diyat, luka yang sampai kepada otak sepertiga diyat, luka dalam sepertiga diyat, tulang retak dan bergeser lima belas unta, dan untuk setiap jari tangan dan kaki sepuluh unta, untuk gigi lima unta, untuk luka yang menampakkan tulang lima unta. Dan seseorang dibunuh akibat membunuh seorang wanita, bagi pemilik emas diyatnya adalah seribu dinar.\" Muhammad bin Bakkar bin Bilal menyelisihi hal tersebut",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 148
			}
		}
	]
}