{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"6": "The Book of the Times (of Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; Telah menceritakan kepada kami [Khalid] dia berkata; Telah menceritakan kepada kami [Syu'bah] dia berkata; Telah menceritakan kepada kami [Sayyar bin Salamah] dia berkata; Saya mendengar Bapakku bertanya kepada [Abu Barzah] tentang shalat Rasulullah shallallahu 'alaihi wasallam. Aku berkata, \"Apakah kamu mendengarnya?\" dia (Sayar) menjawab, \"Sebagaimana aku mengabarkan tentang waktu (shalat) kepadamu, aku mendengar ayahku bertanya tentang shalat Rasulullah shallallahu 'alaihi wasallam -Ayahku menjawab, \" Rasulullah shallallahu 'alaihi wasallam tidak menghiraukan sebagian tindakannya mengakhirkan shalat- (yakni shalat Isya' sampai tengah malam). Beliau shallallahu 'alaihi wasallam tidak suka tidur sebelum melakukan shalat Isya' dan beliau shallallahu 'alaihi wasallam tidak suka bercakap-cakap sesudahnya. Syu'bah berkata; \"Kemudian aku menemui Abu Barzah dan bertanya kepadanya. Ia menjawab, \"Beliau shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur ketika matahari telah tergelincir, sedangkan beliau shalat Ashar ketika seseorang memulai perjalanannya ke ujung Madinah dan matahari masih bersinar terang'. Adapun shalat Maghrib, aku tidak mengetahui secara pasti pada waktu mana yang telah disebutkan oleh Abu Barzah. Setelah itu aku menemuinya kembali dan bertanya kepadanya. Dia (Abu Barzah) menjawab, \"Beliau shallallahu 'alaihi wasallam shalat Subuh ketika lelaki dari kalangan mereka dapat mengenali teman yang berada di sampingnya. Beliau biasanya membaca enam puluh ayat hingga seratus ayat ketika shalat Subuh",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		}
	]
}