{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"6": "The Book of the Times (of Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; Telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari [Husain bin Ali bin Husain] dia berkata; Telah mengabarkan kepadaku [Wahab bin Kaisan] dia berkata; telah menceritakan kepada kami [Jabir bin Abdullah] dia berkata, \"Jibril 'alaihissalam datang kepada Rasulullah Shallallahu'alaihi wasallam ketika matahari telah condong ke barat, ia berkata.'Wahai Muhammad, bangkitlah dan tegakkanlah shalat! ' Lalu beliau shalat Zhuhur-ketika matahari condong ke barat-. Kemudian dia menetap hingga tatkala bayangan seseorang seperti aslinya. Ia datang pada waktu Ashar, lantas berkata, 'Wahai Muhammad, bangkitlah dan tegakkanlah shalat! ' Lalu beliau shalat Ashar, Kemudian dia menetap. Ia datang lagi ketika matahari telah terbenam dan berkata, 'Bangkit dan tegakkan shalat Maghrib! ' lalu beliau shalat Maghrib ketika matahari terbenam. Kemudian dia menetap dan tatkala awan merah telah hilang Jibril datang dan berkata 'bangkitlah dan tegakkan shalat Isya! ' Lalu beliau shalat Isya, dan saat fajar terbit pada waktu pagi, ia berkata, 'Bangkitlah dan tegakkan shalat! 'Lalu beliau shalat Subuh. Kemudian besoknya ia datang lagi ketika bayangan orang sama seperti aslinya dan berkata, 'Wahai Muhammad, bangkitlah dan tegakkanlah shalat!, lalu beliau shalat Zhuhur. Kemudian Jibril datang lagi tatkala bayangan (benda) seperti dua kali lipatnya, ia berkata, 'Wahai Muhammad, tagakkanlah shalat! lalu beliau shalat Ashar. Kemudian Jibril datang lagi untuk shalat saat matahari terbenam dan hanya satu waktu. Ia berkata, 'Wahai Muhammad, tegakkanlah shalat! 'Lalu beliau shalat Maghrib. Ia juga datang untuk shalat Isya ketika sepertiga malam berlalu, 'Wahai Muhammad, tegakkanlah shalat!, lalu beliau shalat Isya. Kemudian Jibril datang untuk shalat Subuh ketika sudah terang sekali, ia berkata, 'Wahai Muhammad, tegakkanlah shalat! lalu beliau shalat subuh. Lalu beliau Shallallahu'alaihi wasallam bersabda: \"Semua waktu shalat adalah diantara dua waktu ini",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		}
	]
}