{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"49": "The Book of the Etiquette of Judges"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5405,
			"arabicnumber": 5405,
			"text": "Telah mengabarkan kepada kami [Zakaria bin Yahya] ia berkata; telah menceritakan kepada kami [Abdul A'la bin Hammad] ia berkata; telah menceritakan kepada kami [Bisyr bin As Sari] ia berkata; telah menceritakan kepada kami [Abdullah Ibnul Mubarak] dari [Ma'mar]. (dalam riwayat lain disebutkan) telah memberitakan kepada kami [Ahmad bin Ali bin Sa'id] ia berkata; telah menceritakan kepada kami [Yahya bin Ma'in] ia berkata; telah menceritakan kepada kami [Hisyam bin Yusuf] dan [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [bapaknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam mengutus Khalid bin Walid kepada bani Jadzimah, ia menyeru mereka untuk masuk Islam, namun mereka tidak berlaku baik dengan mengatakan 'kami masuk Islam', dan mereka justeru mengatakan 'kami pindah agama'. Sehingga hal itulah yang menjadikan Khalid membunuh dan menawan. Ibnu Umar berkata, \"Khalid menyerahkan kepada setiap pasukan untuk memperlakukan tawanannya, hingga ketika pada suatu pagi hari Khalid Ibnul Walid memerintahkan setiap kita untuk membunuh tawanannya.\" Ibnu Umar berkata, \"Aku berkata, \"Demi Allah, aku tidak akan membunuh tawananku, dan tidak seorang pun, Bisyr menyebutkan, \"dari sahabatku yang akan membunuh tawanannya.\" Ibnu Umar berkata, \"Kami kemudian datang menemui Nabi shallallahu 'alaihi wasallam, dan apa yang dilakukan oleh Khalid itu diceritakan kepada beliau, maka Nabi shallallahu 'alaihi wasallam pun mengangkat tangan dan mengucapkan: \"Ya Allah, aku berlepas diri dari tindakan yang dilakukan oleh Khalid.\" Zakariya menyebutkan dalam haditsnya, \"Lalu disebutkan.\" Sementara dalam hadits Bisyr disebutkan, \"Beliau bersabda: \"Ya Allah, aku serahkan kepada-Mu apa yang telah dilakukan oleh Khalid. Beliau ucapkan dua kali",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 27
			}
		}
	]
}