{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"49": "The Book of the Etiquette of Judges"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5407,
			"arabicnumber": 5407,
			"text": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] dan [Al Harits bin Miskin] dari [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus bin Yazid] dan [Al Laits bin Sa'd] dari [Ibnu Syihab] bahwa ['Urwah Ibnu Az Zubair] menceritakan kepadanya, bahwa [Abdullah bin Az Zubair] menceritakan kepadanya, bahwa [Az Zubair bin 'Awwam] pernah berselisih dengan seorang laki-laki Anshar yang pernah ikut perang badar bersama Rasulullah shallallahu 'alaihi wasallam dalam masalah mata air harrah yang biasa mereka gunakan untuk mengairi kebun kurma mereka. Laki-laki Anshar itu berkata; \"Biarkanlah air itu mengalir.\" Namun Az Zubair menolaknya. Rasulullah shallallahu 'alaihi wasallam kemudian berkata kepada Az Zubair: \"Wahai Zubair, airilah kebunmu. Setelah itu berikanlah kepada tetanggamu.\" Orang Anshar itu marah dan berkata; \"Wahai Rasulullah, apakah karena ia anak pamanmu?\" maka menjadi merahlah wajah Rasulullah shallallahu 'alaihi wasallam, beliau kemudian bersabda: \"Wahai Zubair, airilah kebunmu. Setelah itu tahanlah airnya hingga ia kembali ke dalam tanah.\" Lantas Rasulullah shallallahu 'alaihi wasallam memenuhi haknya Zubair. Padahal sebelum itu, Rasulullah shallallahu 'alaihi wasallam memberi isyarat kepada Zubair untuk berlaku fleksibel baik untuknya maupun untuk laki-laki Anshar itu. Ketika laki-laki Anshar itu marah kepada Rasulullah shallallahu 'alaihi wasallam, beliau hanya memenuhi haknya Zubair dalam putusannya.\" Az Zubair berkata; \"Aku tidak berpendapat kecuali ayat ini hanya turun berkenaan dengan kasus itu: ' Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan.\" QS An Nisa`; 65",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 29
			}
		}
	]
}