{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"49": "The Book of the Etiquette of Judges"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5411,
			"arabicnumber": 5411,
			"text": "Telah mengabarkan kepada kami [Qutaibah] ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ubaidullah bin Abdullah] dari [Abu Hurairah] dan [Zaid bin Khalid] dan [Syibl] mereka berkata; \"Ketika kami sedang di sisi Nabi shallallahu 'alaihi wasallam, seorang laki-laki bangkit ke arah beliau dan berkata: \"Aku bersumpah kepada Allah atas diri baginda, kecuali jika engkau hukumi antara kami berdua dengan Kitabullah!\" lalu laki-laki yang menjadi seterunya berdiri dan berkata -dan ia lebih fakih di antara keduanya, \"Benar, hukumilah antara kami sesuai dengan Kitabullah.\" Beliau bersabda: \"Katakanlah.\" Laki-laki itu berkata, \"Sesungguhnya anakku adalah seorang buruh yang berkerja untuk orang ini, lalu anakku berzina dengan isterinya, dan aku telah menebusnya dengan seratus ekor kambing dan seorang budak. -seakan ia diberi kabar bahwa hukuman bagi anaknya adalah rajam hingga ia pun menebusnya- Kemudian aku bertanya seorang laki-laki dari ahli ilmu, mereka kemudian mengabariku bahwa hukuman bagi anakku adalah cambuk seratus kali dan diasingkan selama satu tahun. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda kepada laki-laki itu: \"Demi Dzat yang jiwaku ada dalam tangan-Nya, sungguh akan aku menghukumi kalian sesuai dengan Kitabullah 'azza wajalla. Adapun seratus kambing dan seorang budak, maka itu akan dikembalikan kepadamu. Dan anakmu akan dicambuk seratus kali dan diasingkan selama satu tahun. Wahai Unais, besok temuilah isteri orang ini, jika ia mengaku maka rajamlah.\" Keesokan harinya ia pergi menemui wanita itu, dan wanita itu pun mengakuinya hingga Unais merajamnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 33
			}
		}
	]
}