{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"51": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5540,
			"arabicnumber": 5540,
			"text": "Telah mengabarkan kepada kami Abu Bakr Ahmad bin Muhammad bin Ishaq As Sunni -dengan membaca dihadapannya di rumah miliknya- ia berkata; telah memberitakan kepada kami Imam Abu Abdurrahman Ahmad bin Syu'aib An Nasa`i rahimahullahu Ta'ala, ia berkata; telah memberitakan kepada kami [Abu Dawud] ia berkata; telah menceritakan kepada kami [Ubaidullah bin Musa] ia berkata; telah memberitakan kepada kami [Isra'il] dari [Abu Ishaq] dari [Abu Maisarah] dari [Umar radliallahu 'anhu] ia berkata; \"Ketika turun ayat yang mengharamkan khamer, Umar berdoa; \"Ya Allah, berilah penjelasan kepada kami tentang khamer dengan penjelasan yang memadahi!\" Maka turunlah ayat yang terdapat dalam surat Al Baqarah. Lalu Umar dipanggil dan ayat tersebut dibacakan kepadanya. Umar lalu berdoa lagi; \"Ya Allah, berilah penjelasan kepada kami tentang khamer dengan penjelasan yang memadahi!\" Maka turunlah ayat yang terdapat dalam surat An Nisa`: 'Hai orang-orang yang beriman, janganlah kamu shalat sedang kamu dalam keadaan mabuk…'. Jika waktu shalat tiba, penyeru Rasulullah shallallahu 'alaihi wasallam biasa menyerukan 'Janganlah kamu shalat, sedangkan kami dalam keadaan mabuk'. Lalu Umar dipanggil dan ayat tersebut dibacakan kepadanya. Setelah itu Umar berdoa lagi; \"Ya Allah, berilah penjelasan kepada kami tentang khamer dengan penjelasan yang memadahi!\" Maka turunlah ayat yang terdapat dalam surat Al Maidah. Umar pun dipanggil dan ayat tersebut dibacakan kepadanya, ketika sampai, Maka berhentilah kamu (dari mengerjakan pekerjaan itu, Lantas Umar radliallahu 'anhu berkata; \"Kami berhenti, kami berhenti)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		}
	]
}