{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"51": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5666,
			"arabicnumber": 5666,
			"text": "Telah mengabarkan kepada kami [Suwaid] ia berkata; telah memberitakan kepada kami [Abdullah] dari [Ma'mar] dari [Az Zuhri] dari [Abu Bakr bin 'Abdurrahman bin Al Harits] dari [Bapaknya] ia berkata; Aku mendengar [Utsman? radliallahu 'anhu] berkata, \"Jauhilah oleh kalian minum khamer sebab ia adalah pangkal semua dosa. Ada seorang laki-laki sebelum kalian yang taat beribadah disukai oleh seorang wanita pelacur. Wanita itu lalu mengutus budak wanitanya agar mengatakan, 'Sesungguhnya aku memanggilmu untuk bersaksi.' Maka berangkatlah laki-laki itu bersama budak wanita tersebut, sementara ia sendiri bersiap-siap hingga ketika laki-laki itu masuk ia mengunci pintu rumah tanpa ada orang selain dia. Sehingga laki-laki itu berhadapan dengan seorang wanita cantik yang di sisinya terdapat seorang anak kecil dan botol khamer. Wanita itu lantas berkata, \"Demi Allah, aku memanggilmu bukan untuk bersaksi, tetapi aku memanggilmu untuk bersetubuh denganku, atau meneguk segelas khamer, atau membunuh anak kecil ini!\" laki-laki itu berkata, \"Berikan saja aku segelas khamer.\" Maka wanita itu memberikan satu gelas khamer kepadanya. Laki-laki itu lalu berkata, \"Tambahkanlah untukku.\" Laki-laki itu tetap saja minum hingga ia menzinai wanita itu dan membunuh seorang jiwa (anak kecil). Maka jauhilah minum khamer, karena -demi Allah- tidak akan pernah berkumpul antara iman dan kebiasaan minum khamer kecuali salah satunya akan mengeluarkan yang lain.\" Telah mengabarkan kepada kami [Suwaid] ia berkata; telah memberitakan kepada kami [Abdullah] -yaitu Ibnul Mubarak- dari [Yunus] dari [Az Zuhri] ia berkata; telah menceritakan kepadaku [Abu Bakr bin 'Abdurrahman bin Al Harits] bahwa [Bapaknya] berkata; aku mendengar [Utsman] berkata, \"Jauhilah oleh kalian minum khamer sebab ia adalah pangkal semua dosa. Pernah ada seorang laki-laki yang menyepi dari kehidupan manusia untuk beribadah....lalu ia menyebutkan sebagaimana dalam hadits. Ia berkata, \"Jauhilah oleh kalian minum khamer, karena -demi Allah- selamanya tidak akan berkumpul antara iman dan kebiasaan minum khamer kecuali salah satunya akan mengeluarkan yang lain",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 128
			}
		}
	]
}