{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"7": "The Book of the Adhan (The Call to Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 631,
			"arabicnumber": 631,
			"text": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Mu'adz bin Hisyam] dia berkata, telah menceritakan kepadaku [bapakku] dari ['Amir 'Al Ahwal] dari [Makhul] dari ['Abdullah bin Muhairiz] dari [Abu Mahdzurah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam mengajarkan adzan kepadaku, beliau bersabda, \"ALLAHU AKBAR ALLAAHU AKBAR, ALLAHU AKBAR ALLAHU AKBAR (Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar). ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku bersaksi bahwa Muhammad adalah utusan Allah). Kemudian beliau mengulangi dan berkata, ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembahj kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembahj kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah.) HAYYA 'ALASH SHALAAH, HAYYA 'ALASH SHALAAH (Mari mengerjakan shalat, mari mengerjakan shalat), HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH, (Mari mencapai kebahagiaan, mari mencapai kebahagiaan). ALLAAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar). LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak disembah kecuali Allah)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		}
	]
}