{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "Telah mengabarkan kepada kami ['Imran bin Musa] dia berkata; telah menceritakan kepada kami ['Abdul Warits] dari [Abu At-Tayyah] dari [Anas bin Malik] dia berkata; Anas bin Malik, dia berkata, \"Ketika Rasulullah Shallallahu'alaihi wasallam datang ke Madinah, beliau singgah di tanah lapang di perkampungan yang dinamakan Bani Amru bin Auf. Beliau Shallallahu'alaihi wasallam tinggal selama empat belas hari. Kemudian beliau mengutus orang kepada pembesar Bani Najjar, lalu mereka datang dengan menghunus pedang-pedang mereka. Aku melihat Rasulullah Shallallahu'alaihi wasallam berada di atas unta kendaraannya dan Abu Bakar Radliyallahu'anhu naik di belakangnya, sedangkan pembesar Bani Najjar berada di sekelilingnya hingga beliau sampai ke pekarangan Abu Ayub, dan beliau Shallallahu'alaihi wasallam mengerjakan shalat kapansaja datang waktu shalat. Lantas beliau Shallallahu'alaihi wasallam mengerjakan shalat di tempat pengikatan kambing, dan beliau menyuruh untuk membuat masjid. Kemudian beliau mengirim orang ke pembesar Bani Najjar dan mereka pun datang, maka Rasulullah Shallallahu'alaihi wasallam bersabda kepada mereka, 'Wahai Bani Najjar, tentukan harga pekarangan ini? ' Mereka menjawab, 'Demi Allah, kami tidak menjualnya kecuali kepada Allah Azza wa Jalla'.\" Anas berkata, \"Dulu di tempat itu ada kuburan orang-orang musyrik, reruntuhan bangunan, dan pohon kurma. Rasulullah Shallallahu'alaihi wasallam menyuruh untuk membongkar kuburan orang-orang musyrik dan memotong pangkal pohon kurma, serta meratakan bekas bangunan. Lalu beliau menjadikan pohon kurma sebagai arah kiblat masjid dan sebuah batu besar sebagai dua batu masjid. Mulailah mereka memindahkan batu besar dengan kerja keras sambil mendendangkan lantunan syair -Sedang Rasulullah Shallallahu'alaihi wasallam bersama mereka- yang berbunyi: 'Ya Allah, tiada kebaikan yang lebih baik daripada kebaikan akhirat. Ya Allah, tolonglah orang-orang Anshar dan Muhajirin",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		}
	]
}