{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"1": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Ibrahim Al Bashri] dari [Bisyir bin Al Mufadhal] dari [Ibnu 'Aun] dari ['Amir As-Sya'bi] dari ['Urwah bin Al Mughirah] dari [Al Mughirah] dan dari [Muhammmad bin Sirin] dari [seorang laki-laki] yang kemudian di sandarkan kepada Al Mughirah, Ibnu 'Aun berkata; 'saya tidak hafal hadits ini dari ini' bahwasannya Al Mughirah, berkata, \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu safar (perjalanan). Beliau memukul punggungku dengan tongkat yang ada padanya. Beliau meluruskan posisiku, maka aku pun ikut meluruskan bersamanya hingga sampai pada suatu daerah, beliau singgah, lalu berangkat lagi, (Mughirah berkata) dan beliau pergi hingga tidak nampak olehku. Kemudian beliau datang dan bersabda, 'Apakah kamu punya air? 'Aku memang membawa air dalam tempat yang terbuat dari kulit (sathihah), maka aku datang kepada beliau dengan membawanya, lalu aku tuangkan kepada beliau. Beliaupun segera membasuh kedua tangannya dan wajahnya, dan kedua sikunya. Beliau memakai jubah dari Syam yang sempit kedua tangannya -beliau mengeluarkan tangannya dari bawah jubahnya- lalu membasuh muka dan kedua lengannya. Lalu beliau menyebutkan suatu bagian depan dari kepalanya dan dari surbannya, Ibnu 'Aun berkata; \"Dan saya tidak mengingat apa yang saya inginkan\". kemudian beliau mengusap kedua sepatunya (khuf). Beliau lalu berkata, 'Hajatmu? '. Aku menjawab, 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku tidak ada hajat'. Setelah itu kami datang dan kami dapati Abdurrhaman bin Auf sedang menjadi imam shalat jama'ah bersama orang-orang. Ia sudah mendapat satu raka'at shalat Subuh. Aku segera pergi untuk memberitahukannya, namun beliau mencegahku. Kamipun ikut shalat dari yang kami dapati, kemudian menyempurnakan yang ketinggalan",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 82
			}
		}
	]
}