{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "Telah mengabarkan kepada kami [Muammal bin Hisyam] dia berkata; telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Sa'id] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin Abdullah] dia berkata; \"Kami shalat bersama Abu Musa, setelah ia duduk seorang laki-laki dari kaumnya datang dan berkata, 'Shalat telah ditetapkan dengan kebaikan dan zakat'. Sesudah Abu Musa salam, ia menghadap kepada kaumnya sambil berkata, Tadi siapa yang mengatakan hal tersebut? ' Kaumnya terdiam semua, lantas ia bertanya, 'Hai Hiththan, mungkin kamu tadi yang mengucapkannya? ' la menjawab, 'Tidak. Aku khawatir kalau engkau akan mencelaku dengan hal ini'. Kemudian [Abu Musa] berkata, 'Rasulullah Shallallahu'alaihi wasallam mengajarkan shalat dan Sunnah-sunnah kepada kami, beliau Shallallahu'alaihi wasallam bersabda, \"Imam itu untuk diikuti. Bila ia bertakbir maka bertakbirlah dan bila imam mengucapkan, 'Ghairil maghdhubi 'alaihim walaadh-dhaalliin (Bukan orang-orang yang dimurkai bukan pula orang-orang yang sesat) ' maka ucapkan, 'Aamiin'. Semoga Allah mengabulkan kalian. Jika imam rukuk maka rukuklah dan jika mengangkat (kepala dari ruku') dengan mengucapkan 'Sami'allaahu liman hamidah (Allah mendengar orang yang memujinya) ' maka ucapkan, 'Rabbanaa lakal hamdu (Wahai Rabb kami, untuk-Mu segala pujian) ' Semoga Allah mendengar kalian. Bila, imam sujud maka ikutlah sujud dan jika ia mengangkat (kepala dari sujud) maka angkatlah. Imam sujud sebelum kalian dan mengangkat (kepala dari sujud) sebelum kalian.\" Lantas Rasulullah Shallallahu'alaihi wasallam bersabda -demikianlah tata cara yang harus dilakukan antara imam dengan makmum-, \" Masing-masing gerakan itu, kalian ikuti sesudahnya",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 54
			}
		}
	]
}