{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "Telah mengabarkan kepada kami [Washil bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Ibnu Fudhail] dari [Al A'masy] dari [Muharib bin Ditsar] dan [Abu Shalih] dari [Jabir] dia berkata; \"Seorang laki-laki Anshar datang, dan iqamah shalat sudah dikumandangkan. Lalu ia masuk ke masjid dan shalat di belakang Mua'dz. la memperlama shalatnya bersama jamaah, maka laki-laki tadi keluar dari jamaah dan shalat di pojok masjid kemudian pergi. Setelah Mua'dz selesai shalat, ia diberitahu, 'Si Fulan berbuat begini dan begitu'. Lalu Mua'dz berkata, 'Besok pagi akan aku ceritakan hal ini kepada Rasulullah Shallallahu'alihiwasallam. Maka Mua'dz segera datang kepada Rasulullah Shallallahu'alaihi wasallam dan menceritakan hal tersebut. Rasulullah Shallallahu'alaihi wasallam kemudian mengutus seseorang kepadanya (untuk memanggilnya), lalu beliau Shallallahu'alaihi wasallam bertanya kepadanya, ' 'Apakah yang mendorongmu berbuat demikian? ' la menjawab. 'Wahai Rasulullah Shallallahu'alihiwasallam aku pekerja keras di siang hari dan aku datang sedangkan iqamah shalat sudah dikumandangkan. Lalu aku segera masuk masjid dan shalat bersamanya, dan ia membaca surat ini dan surat itu. la memperlama shalatnya, maka aku keluar dan mengerjakan shalat di pojok masjid'. Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda, 'Wahai Mua'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah? Wahai Mua 'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah? Wahai Mua 'dz, apakah engkau hendak menjadi orang yang menimbulkan fitnah?",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 55
			}
		}
	]
}