{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] Radliyallahu'anha dia berkata; \"Tatkala Rasulullah Shallallahu'alaihi wasallam merasa berat (sakitnya), Bilal datang kepada beliau untuk memberitahukan tentang (datangnya waktu) shalat, maka beliau Shallallahu'alaihi wasallam bersabda 'Perintahkan Abu Bakar untuk shalat mengimami orang-orang'. Aku berkata, 'Wahai Rasulullah Shallallahu'alihiwasallam Abu Bakar orang yang berhati lembut, jadi jika ia menggantikan posisi engkau maka orang-orang tidak bisa mendengar suaranya. Bagaimana jika engkau menyuruh Umar?\" Beliau Shallallahu'alaihi wasallam tetap berkata, 'Perintahkan Abu Bakar untuk shalat mengimami orang-orang'. Lalu aku berkata kepada Hafshah, 'Katakan kepada beliau Shallallahu'alaihi wasallam (agar beliau menyuruh Umar) '. Kemudian Hafshah berkata kepada Rasulullah Shallallahu'alaihi wasallam tentang hal itu, dan beliau Shallallahu'alaihi wasallam bersabda, Kalian (para wanita seperti) saudara Yusuf, maka perintahkan Abu Bakar untuk Shalat bersama kaum muslim.\" Aisyah berkata; \"Lalu orang-orang menyuruh Abu Bakar. Setelah Abu Bakar memulai shalat, Rasulullah Shallallahu'alaihi wasallam merasakan badannya ringan.\" Aisyah meneruskan ceritanya, \"Lantas Rasulullah Shallallahu'alaihi wasallam bangkit dengan dipapah oleh dua orang laki-laki, sedangkan kedua kakinya menggores di tanah. Sesampainya di dalam masjid, Abu Bakar masih mendengar nafasnya yang terengah-engah, maka ia berusaha untuk mundur, tetapi Rasulullah Shallallahu'alaihi wasallam mengisyaratkan kepadanya agar tetap di tempatnya. Rasulullah lalu duduk di sebelah Abu Bakar. Beliau shalat mengimami kaum muslimin dengan duduk dan Abu Bakar shalat berdiri dengan mengikuti Rasulullah Shallallahu'alihiwasallam sedangkan kaum muslimin mengikuti shalat Abu Bakar Radliyallahu'anhu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 57
			}
		}
	]
}