{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"11": "The Book of the Commencement of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; ['Ubaidullah bin 'Umar] dia berkata; telah menceritakan kepadaku [Sa'id bin Abu Sa'id] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasululluh Shallallahu'alaihi wasallam masuk ke dalam masjid, lalu ada seorang laki-laki yang ikut masuk kemudian shalat. Setelah itu ia datang kepada Rasulullah Shallallahu'alaihi wasallam dengan mengucapkan salam kepada Rasulullah Shallallahu'alihiwasallam dan beliau Shallallahu'alaihi wasallam membalas salamnya sambil berkata, 'Kembalilah dan ulangi shalatmu karena kamu belum mengerjakan shalat! ' la lalu kembali lagi dan mengulangi shalatnya seperti shalat pertamanya. Kemudian ia datang lagi kepada Rasulullah Shallallahu'alaihi wasallam dengan mengucapkan salam kepada beliau Shallallahu'alihiwasallam dan Rasulullah Shallallahu'alaihi wasallam berkata, \"Wa'alaikas-salam. Kembali dan ulangi lagi shalatmu karena kamu belum mengerjakan shalat! ' Lalu orang tersebut shalat seperti itu sampai tiga kali. Setelah itu orang tersebut berkata, \"Demi Dzat yang mengutus engkau dengan membawa kebenaran, aku tidak bisa shalat lebih baik lagi dari yang seperti ini, maka ajarilah aku!\" Rasulullah Shallallahu'alaihi wasallam lalu bersabda: 'Jika kamu telah berdiri untuk shalat, maka bertakbirlah, kemudian bacalah A! Qur'an yang mudah bagimu. Kemudian ruku'lah hingga kamu tenang (thuma 'ninah) dalam rukumu dan bangkitlah dari ruku' hingga kamu berdiri tegak. Lalu sujudlah kamu hingga kamu tenang (thuma 'ninah) dalam sujudmu, dan bangkitlah dari sujud hingga kamu tenang (Thuma'ninah) dalam keadaan duduk. Kerjakanlah semua hal tersebut pada setiap shalatmu",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		}
	]
}