{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "It was narrated that ‘Asim bin Damrah As-Saluli said:“We asked ‘Ali about the voluntary (prayer) of Allah’s Messenger (ﷺ) during the day. He said: ‘You will not be able.’ We said: ‘Inform us of it, we will do what we can of it?’ So he said: ‘When he prayed the Fajr he would delay praying any more. When the sun appeared over there (west) – like it appears here, meaning in the direction of the east, about the amount for the ‘Asr prayer from there, meaning in the direction of the west, meaning before the Maghrib – he would stand and perform two Rak’ah* then he would delay praying until the sun appeared over there (west), meaning in the direction of the east, about the amount of the Zuhr prayer from there, then he would stand and perform four. And, four before the Zuhr when the sun passed the zenith, and two Rak’ah after it, and, four before the ‘Asr, separating between every two Rak’ah with Taslim** upon the angels that are close (to Allah), the Prophets, and those who follow them among the Muslims and the believers.’” 'Ali said: \"That is sixteen Rak'ah of voluntary prayer which Allah's Messenger (ﷺ) performed during the day. And there are very few who offer them regularly.\" Waki` said: “My father added: Habib bin Abu Thabit said: ‘O Abu Ishaq, this mosque filled with gold would not be dearer to me than this Hadith of yours.’” * Meaning, when the sun was low above the eastern horizon. That is the time of the Duha. ** Meaning the Tashah-hud",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 359
			}
		}
	]
}