{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "It was narrated that Salim bin ‘Ubaid said:“The Messenger of Allah (ﷺ) fainted when he was sick, then he woke up and said: ‘Has the time for prayer come?’ They said: ‘Yes.’ He said: ‘Tell Bilal to call the Adhan, and tell Abu Bakr to lead the people in prayer.’ Then he fainted, then he woke up and said: ‘Has the time for prayer come?’ They said: ‘Yes.’ He said: ‘Tell Bilal to call the Adhan, and tell Abu Bakr to lead the people in prayer.’ Then he fainted, then he woke up and said: ‘Has the time for prayer come?’ They said: ‘Yes.’ He said: ‘Tell Bilal to call the Adhan, and tell Abu Bakr to lead the people in prayer.’ ‘Aishah said: ‘My father is a tender-hearted man, and if he stands in that place he will weep and will not be able to do it. If you told someone else to do it (that would be better).’ Then he fainted, then woke up and said: ‘Tell Bilal to call the Adhan, and tell Abu Bakr to lead the people in prayer. You are (like) the female companions of Yusuf.’ So Bilal was told to call the Adhan and he did so, and Abu Bakr was told to lead the people in prayer, and he did so. Then the Messenger of Allah (ﷺ) felt a little better, and he said: ‘Find me someone I can lean on.’ Barirah and another man came, and he leaned on them. When Abu Bakr saw him, he started to step back, but (the Prophet (ﷺ)) gestured him to stay where he was. Then the Messenger of Allah (ﷺ) came and sat beside Abu Bakr, until Abu Bakr finished praying. Then the Messenger of Allah (ﷺ) passed away.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 432
			}
		}
	]
}