{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "It was narrated that Ibn `Abbas said:“When the Messenger of Allah (ﷺ) prayed Tahajjud at night, he would say: “Allahumma lakal-hamd, Anta nurus-samawati wal-ard wa man fihinna. Wa lakal-hamd, Anta qayyamus-samawati wal-ard wa man fihinna. Wa lakal-hamd, Anta malikus- samawati wal-ard wa man fihinna. Wa lakal-hamd, Antal-haqq, wa wa`duka haqq, wa liqa’uka haqq, wa qawluka haqq, wal-jannatu haqq, wan-naru haqq, was-sa`atu haqq, wan-nabiyyuna haqq, wa Muhammadun haqq. Allahumma laka aslamtu, wa bika amantu, wa `alaika tawakkaltu wa ilaika anabtu, wa bika khasamtu, wa ilaika hakamtu, faghfirli ma qaddamtu wa ma akhkhartu, wa ma asrartu wa ma a`lantu. Antal-muqaddimu wa Antal-muakhkhiru. La ilaha illa anta wa la ilaha ghairuka, wa la hawla wa la quwwata illa bika (O Allah, to you is praise, You are the Light of the heavens and the earth, and everyone therein. To You is praise, You are the Sustainer of the heavens and the earth, and everyone therein. To You is praise, You are the Sovereign of the heavens and the earth, and everyone therein. To You is praise, You are the Truth; Your promise is true, the meeting with You is true, Your saying is true, Paradise is true, the Fire is true, the Hour is true, the Prophets are true, and Muhammad (ﷺ) is true. O Allah, to You have I submitted, in You I believe, in You have I put my trust, to You I turn in repentance, by Your help I argue, to You I refer my case, so forgive me for my past and future sins, what I have done in secret and what I have done openly. You are the One Who brings forward and puts back. None has the right to be worshipped but You, and there is none who has the right to be worshipped other than You. And there is no power and no strength except with You.” Another chain that Ibn `Abbas narrated: “When the Messenger of Allah (ﷺ) stood during the night for Tahajjud,” and he mentioned something similar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 553
			}
		}
	]
}