{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "It was narrated that Salamah bin Sakhr Al-Bayadi said:\"I was a man who had a lot of desire for women, and I do not think there was any man who had as great a share of that as me. When Ramadan began, I declared Zihar upon my wife (to last) until Ramadan ended. While she was talking to me one night, part of her body became uncovered. I jumped on her and had intercourse with her. The next morning I went to my people and told them, and said to them: 'Ask the Messenger of Allah (ﷺ) for me.' They said: 'We will not do that, lest Allah reveal Quran concerning us or the Messenger of Allah (ﷺ) says, something about us, and it will be a lasting source of disgrace for us. Rather we will leave you to deal with it yourself. Go yourself and tell the Messenger of Allah (ﷺ) about your problem.' So I went out and when I came to him, I told him what happened. The Messenger of Allah (ﷺ) said: 'Did you really do that?' I said: 'I really did that, and here I am, O Messenger of Allah. (ﷺ) I will bear Allah’s ruling on me with patience.' He said: 'Free a slave.' I said: 'By the One Who sent you with the truth, I do not own anything but myself.' He said: 'Fast for two consecutive months.' I said: 'O Messenger of Allah, the thing that happened to me was only because of fasting.' He said: 'Then give charity, or feed sixty poor persons.' I said: 'By the One Who sent you with the truttu we spent last night with no dinner.' He said: 'Then go to the collector of charity of Banu Zuraiq, and tell him to give you something, then feed sixty poor persons, and benefit from the rest",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		}
	]
}