{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2622,
			"arabicnumber": 2622,
			"text": "It was narrated that Abu Sa'eed Al Khudri said:“Shall I not tell you what I heard directly from the Messenger of Allah (ﷺ)? I heard it and memorized it: 'A man killed ninety-nine people, then the idea of repentance occurred to him. He asked who was the most knowledgeable of people on earth, and he was told of a man so he went to him and said: “I have killed ninety-nine people. Can I repent?” He said: “After ninety-nine people?!” He said: 'So he drew his sword and killed him, thus completing one hundred. Then the idea of repentance occurred to him (again), so he asked who was the most knowledgeable of people, and he was told of a man (so he went to him) and said: “I have killed one hundred people. Can I repent?” He said: “Woe to you, what is stopping you from repenting? Leave the evil town where you are living and go to a good town, such and such town and worship your Lord there.” So he went out, heading for the good town, but death came to him on the road. The angels of mercy and angels of punishment argued over him. Iblis (Satan) said: “I have more right to him, for he never disobeyed me for a moment.” But the angels of mercy said: “He went out repenting.” (One of the narrators) Hammam said: “Humaid At-Tawil narrated to me from Bakr bin Abdullah that Abu Rafi said: 'So Allah (SWT) sent an angel to whom they referred (the case). He said: “Look and see which of the two towns was he closer, and put him with its people.” (One of the narrators) Qatadah said: “Hasan narrated to us: 'When death came to him he strove and drew closer to the good town, and farther away from the evil town, so they put him with the people of the good town.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		}
	]
}