{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "It was narrated from Sahl bin Abu Hathmah from the elders of his people that :'Abdullah bin Sahl and Muhayyishah set out for Khaibar because of some problem that had arisen. Someone came to Muhayyishah, and he told him that Abdullah bin Sahl had been killed and thrown into a pit or well in Khaibar. He came to the Jews and said: “By Allah, you killed him.” They said: “By Allah, we did not kill him.” Then he went back to his people and told them about that. Then he and his brother Huwayyisah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the Prophet (ﷺ)). Muhayyisah, who was the one who had been at Khaibar, went and he began to speak, but the Messenger of Allah (ﷺ) said: “Let the elder speak first.” So Huwayyisah spoke, then Muhayyisah spoke. The Messenger of Allah (ﷺ) said: “Either (the Jews) will pay the blood money for your companion, or war will be declared on them.” The Messenger of Allah (ﷺ) sent a letter to that effect (to the Jews) and they wrote back saying: “By Allah, we did not kill him.” The Messenger of Allah (ﷺ) said to Huwayyisah, Muhayyisah and Abdur-Rahman: “Will you swear an oath establishing your claim to the blood money of your companion?” They said: “No” He said: “Should the Jews swear an oath for you?” They said: “They are not Muslims.” So the Messenger of Allah (ﷺ) paid the blood money himself, and he sent one hundred she-camels to them and some of them entered the house. Sahl said: “A red she-camels from among them kicked me.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		}
	]
}