{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "It was narrated from ‘Amr bin Shu’aib, from his father, that his grandfather said:“Rabab bin Hudhaifah (bin Sa’eed) bin Sahm married Umm Wa’il bint Ma’mar Al-Jumahiyyah, and she bore him three sons. Their mother died and her sons inherited her houses and the Wala’ of her freed slaves. ‘Amr bin ‘As took them out to Sham, and they died of the plague of ‘Amwas. ‘Amr inherited from them, and he was their ‘Asabah.* When ‘Amr came back, Banu Ma’mar came to him and they referred their dispute with him concerning the Wala’ of their sister to ‘Umar. ‘Umar said: ‘I will judge between you according to what I heard from the Messenger of Allah (ﷺ). I heard him say: “What the son or father acquires goes to his. ‘Asabah, no matter who they are.’” So he ruled in our favour and wrote a document to that effect, in which was the testimony of ‘Abdur-Rahman bin ‘Awf, Zaid bin Thabit and someone else. Then when ‘Abdul-Malik bin Marwan was appointed caliph, a freed slave of hers (Umm Wa’il’s) died, leaving behind two thousand Dinar. I heard that that ruling had been changed, so they referred the dispute to Hisham bin Isma’il. We referred the matter to ‘Abdul-Malik, and brought him the document of ‘Umar. He said: ‘I thought that this was a ruling concerning which there was no doubt. I never thought that the people of Al-Madinah would reach such a state that they would doubt this ruling. So he ruled in our favour, and it remained like that afterwards.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		}
	]
}