{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:“There is goodness in the forelocks of horses” – or he said: “There is goodness tied in the forelocks of horses.” Suhail (one of the narrators) said: “I am not certain of” – “until the Day of Resurrection. And horses are of three types: those that bring reward to a man, those that are a means of protection for a man, and those that are a burden (of sin) for a man. As for those that bring reward, a man keeps them in the cause of Allah and keeps them constantly ready (for Jihad), so they do not take any fodder into their stomachs but a reward will be written for him, and if he puts them out to pasture, they do not eat anything but reward will be written for him. If he gives them to drink from a flowing river, for every drop that enters their stomachs there will be reward,” (continuing) until he mentioned reward in conjunction with their urine and droppings, and even when they run here and there by themselves, for each step they take a reward will be written for him – ‘As for those that are a means of protection, a man keeps them because they are a source of dignity and adornment, but he does not forget the rights of their backs and stomachs (i.e., their right not to be overworked and their right to be fed) whether at times of their difficulty or ease. As for those that bring a burden (of sin), the one who keeps them for purposes of wrongdoing or for pomp and show before people, is the one for whom they bring a burden of sin.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		}
	]
}