{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "Humaid bin Abu Sawiyyah said:I heard Ibn Hisham asking ‘Ata’ bin Abu Rabah about the Yemenite Corner, when he was performing Tawaf around the House. ‘Ata’ said: Abu Hurairah told me that the Prophet (ﷺ) said: “Seventy angels have been appointed over it. Whoever says: Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunya wal-akhirah; Rabbana atina fid-dunya hasanah, wa fil-akhirati hasanah, wa qina ‘adhaban-Nar (O Allah, I ask You for pardon and well-being in this world and in the Hereafter. Our Lord, give us good in this world and good in the Hereafter and protect us from the torment of the Fire), they say: Amin.” When he reached the Black Corner (where the Black Stone is), he said: O Abu Muhammad! What have you heard about this Black Corner? ‘Ata’ said: Abu Hurairah told me that he heard the Messenger of Allah (ﷺ) say: “Whoever faces it is facing the Hand of the Most Merciful.’” Ibn Hisham said to him: O Abu Muhammad, what about Tawaf? ‘Ata’ said: Abu Hurairah told me that he heard the Prophet (ﷺ) say: “Whoever performs Tawaf around the House seven times and does not say anything except: Subhan Allah wal-hamdu lillah, wa la ilaha illallah wa Allahu Akbar, wa la hawla wa la quwwata illa billah (Glory is to Allah, praise is to Allah, none has the right to be worshipping but Allah, and there is no power nor strength except with Allah), ten bad deeds will be erased from him, ten merits will be recorded for him, and he will be raised ten degrees in status. Whoever performs Tawaf and talks when he is in that situation, is wading in mercy like one who wades in water.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		}
	]
}