{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4053,
			"arabicnumber": 4053,
			"text": "It was narrated that Hudhaifah said:“The Messenger of Allah (ﷺ) told us two Ahadith, one of which I have seen, and I am still waiting for the other. He told us: ‘Honesty was preserved in the roots of men’s hearts’ – (One of the narrators) Tanafisi said: ‘Meaning in the middle of men’s hearts’ – ‘Then the Qur’an was revealed and we learned (it) from the Qur’an and the Sunnah.’ Then he told us about its disappearance, saying; ‘A man will go to sleep and honesty will be taken away from his heart, and only its trace will remain, like spots without color. Then he will go to sleep again and the remainder of the honesty will also be taken away (from his heart) and leaving a trace like a blister, as when an ember touches your foot and raises a blister which has nothing inside.’” Then Hudhaifah picked up a handful of pebbles and rolled them on his leg. He said: “People will engage in business with one another, but there will hardly be any honest persons among them. Then it will be said that in such and such a tribe there is an honest man, and a man will be admired for his intelligence, good manners and strength, but there will not be even a mustard seed of faith in his heart.” \"There was a time when I did not mind dealing with anyone of you, for if he was a Muslim, his religion would prevent him from cheating; and if he was a Christian, his Muslim ruler would prevent him from cheating. But today I cannot deal except with so-and-so and so-and-so",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		}
	]
}