{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4081,
			"arabicnumber": 4081,
			"text": "It was narrated that 'Abdullah bin Mas'ud said:\"On the night on which the Messenger of Allah (ﷺ) was taken on the Night Journey (Isra'), he met Ibrahim, Musa and 'Eisa, and they discussed the Hour. They started with Ibrahim, and asked him about it, but he did not have any knowledge of it. Then they asked Musa, and he did not have any knowledge of it. Then they asked 'Eisa bin Maryam, and he said: 'I have been assigned to some tasks before it happens.' As for as when it will take place, no one knows that except Allah. Then he mentioned Dajjal and said: 'I will descend and kill him, then the people will return to their own lands and will be confronted with Gog and Magog people, who will: \"swoop down from every mound.\"[21:96] They will not pass by any water but they will drink it, (and they will not pass) by anything but they will spoil it. They (the people) will beseech Allah, and I will pray to Allah to kill them. The earth will be filled with their stench and (the people) will beseech Allah and I will pray to Allah, then the sky will send down rain that will carry them and throw them in the sea. Then the mountains will turn to dust and the earth will be stretched out like a hide. I have been promised that when that happens, the Hour will come upon the people, like a pregnant woman whose family does not know when she will suddenly give birth.'\" (One of the narrators) 'Awwam said: \"Confirmation of that is found in the Book of Allah, where Allah says: \"Until, when Gog and Magog people are let loose (from their barrier), and they swoop down from every mound (21:96)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		}
	]
}