{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:“The believers will be gathered on the Day of Resurrection, inspired or worried.” – Sa’eed was not sure – “And they will say: ‘If we seek someone to intercede for us with our Lord, we may find relief from our situation.’ So they will go to Adam and will say: ‘You are Adam, the father of mankind. Allah created you with His Hand and His angels prostrated to you. Intercede for us with your Lord, that He might grant us relief from our situation.’ He will say: ‘I am not the one,’ and he will mention to them and complain of the sin that he committed. He will feel too shy to do that (and will say): ‘Rather go to Nuh, for he is the first Messenger whom Allah sent to the people of earth.’ So they will go to him, but he will say: ‘I am not the one,’ and he will mention of how he asked of Allah that of which he had no knowledge.* He will feel too shy to do that (and will say): ‘Rather go to the Close Friend of the Most Merciful, Ibrahim.’ So they will go to him and he will say: ‘I am not the one. Rather go to Musa, a slave to whom Allah spoke and to whom He gave the Torah.’ So they will go to him and he will say: ‘I am not the one,’ and he will mention how he killed a soul, not in retaliation for murder (and will say): ‘Rather go to ‘Isa, the slave of Allah and His Messenger, the Word of Allah and a spirit created by Him.’ So they will go to him, but he will say: ‘I am not the one. Rather go to Muhammad, a slave whose past and future sins Allah forgave.’ So they will come to me and I will go with them.” – There was a similar report from Hasan who added (the Prophet (ﷺ) said:) And I will walk between two rows of the believers.” Then he went back to the Hadith of Anas. – And he said: “And I will ask my Lord for permission and permission will be given to me. When I see Him I will fall down prostrating, and I will be left as long as Allah wills to leave me. Then it will be said: ‘Get up, O Muhammad. Speak, you will be heard; ask, you will be given; intercede, your intercession will be accepted.’ I will praise Him with praise that He will teach me, then I will intercede, and a limit will be set. Then they will be admitted to Paradise, and I will come back a second time. When I see Him I will fall down prostrating, and I will be left as long as Allah wills to leave me. Then it will be said: ‘Get up, O Muhammad. Speak, you will be heard; ask, you will be given; intercede, your intercession will be accepted.’ I will praise Him with praise that He will teach me, then I will intercede, and a limit will be set. Then they will be admitted to Paradise, and I will come back a third time. When I see Him I will fall down prostrating, and I will be left as long as Allah wills to leave me. Then it will be said: ‘Get up, O Muhammad. Speak, you will be heard; ask, you will be given; intercede, your intercession will be accepted.’ I will praise Him with praise that He will teach me, then I will intercede, and a limit will be set. Then they will be admitted to Paradise, and I will come back a fourth time and will say: ‘O Lord, there is no one left except those who are detained by the Qur’an.’” ** Qatadah (the Tabi'ee in the chain) would narrate after this hadith that Anas (ra) said \"Those who said 'La illaha illa Allah' (there is no god except Allah) and had the weight of a grain of barley in good in his heart will come out of the Fire, and those who said 'La illaha illa Allah' and had a weight of a grain of wheat in good in his heart will come out of the Fire, and those who said 'La illaha illa Allah' and had a weight of a grain of dust in good in his heart will come out of the Fire",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 213
			}
		}
	]
}