{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "Ibn Juraij narrated:\"Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated from 'Abdullah bin muhairiz who was an orphan under the care of Abu Mahdhurah bin mi'yar that when he was preparing him to travel to Sham, he said: 'O my uncle, I am going out to Sham, and I will be asked about how you started the Adhan.' So he informed me that. Abu Mahdhurah said: 'I went out with a group of people, and we were somewhere on the road, when the Mu'adh-dhin of the Messenger of Allah gave the call to prayer in the presence of the Messenger of Allah. We heard the voice of the Mu'adh-dhin, and we were shunning it (the Adhan), so we started yelling, imitating it and mocking it. The Messenger of Allah heard us, so he sent some people who brought us to sit in front of him. He said: 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and give the call to prayer.' I stood up and there was nothing more hateful to me than the Messenger of Allah and what he was telling me to do. I stood up in front of the Messenger of Allah and the Messenger of Allah himself taught me the call. He said: \"Say: 'Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah).'\" Then he said: \"Raise your voice (and say). Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).'\" Then he called me when I had finished saying the Adhan, and gave me a small bag in which there was some silver. Then he put his hand on the forelock of Abu Mahdhurah, then passed it over his face, then over his chest, and over his heart, until the hand of the Messenger of Allah reached his navel. Then the Messenger of Allah said: 'May Allah bless you and send blessings upon you.' I said: 'O Messenger of Allah, do you command me to give the call to prayer in Makkah?' He said: 'Yes, I command you (to do so).' Then all the hatred I had felt towards the Messenger of Allah disappeared, and was replaced with love for the Messenger of Allah. I came to 'Attab bin Asid, the governor of the Messenger of Allah in Makkah, and gave the call to prayer with him by command of the Messenger of Allah.\" (Sahih)He ('Abdul-'Aziz) said: \"Someone who met Abu Mahdhurah told me the same as 'Abdullah bin Muhairiz told me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		}
	]
}