{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "حدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أنه عقل رسول الله صلى الله عليه وسلم، وعقل مجة مجها في وجهه من بئر كانت في دارهم‏.‏ فزعم محمود أنه سمع عتبان بن مالك الأنصاري ـ رضى الله عنه ـ وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم يقول كنت أصلي لقومي ببني سالم، وكان يحول بيني وبينهم واد إذا جاءت الأمطار فيشق على اجتيازه قبل مسجدهم، فجئت رسول الله صلى الله عليه وسلم فقلت له إني أنكرت بصري، وإن الوادي الذي بيني وبين قومي يسيل إذا جاءت الأمطار فيشق على اجتيازه، فوددت أنك تأتي فتصلي من بيتي مكانا أتخذه مصلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر ـ رضى الله عنه ـ بعد ما اشتد النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه، فقام رسول الله صلى الله عليه وسلم فكبر وصففنا وراءه، فصلى ركعتين، ثم سلم وسلمنا حين سلم، فحبسته على خزير يصنع له فسمع أهل الدار رسول الله صلى الله عليه وسلم في بيتي فثاب رجال منهم حتى كثر الرجال في البيت‏.‏ فقال رجل منهم ما فعل مالك لا أراه‏.‏ فقال رجل منهم ذاك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذاك ألا تراه قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ فقال الله ورسوله أعلم‏.‏ أما نحن فوالله لا نرى وده ولا حديثه إلا إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال محمود فحدثتها قوما فيهم أبو أيوب صاحب رسول الله صلى الله عليه وسلم في غزوته التي توفي فيها ويزيد بن معاوية عليهم بأرض الروم، فأنكرها على أبو أيوب قال والله ما أظن رسول الله صلى الله عليه وسلم قال ما قلت قط‏.‏ فكبر ذلك على فجعلت لله على إن سلمني حتى أقفل من غزوتي أن أسأل عنها عتبان بن مالك ـ رضى الله عنه ـ إن وجدته حيا في مسجد قومه، فقفلت فأهللت بحجة أو بعمرة، ثم سرت حتى قدمت المدينة فأتيت بني سالم، فإذا عتبان شيخ أعمى يصلي لقومه فلما سلم من الصلاة سلمت عليه وأخبرته من أنا، ثم سألته عن ذلك الحديث فحدثنيه كما حدثنيه أول مرة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		}
	]
}