{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى ليس بموسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله، حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم قال ‏\"‏ قام موسى النبي خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا أعلم‏.‏ فعتب الله عليه، إذ لم يرد العلم إليه، فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك‏.‏ قال يا رب وكيف به فقيل له احمل حوتا في مكتل فإذا فقدته فهو ثم، فانطلق وانطلق بفتاه يوشع بن نون، وحملا حوتا في مكتل، حتى كانا عند الصخرة وضعا رءوسهما وناما فانسل الحوت من المكتل فاتخذ سبيله في البحر سربا، وكان لموسى وفتاه عجبا، فانطلقا بقية ليلتهما ويومهما فلما أصبح قال موسى لفتاه آتنا غداءنا، لقد لقينا من سفرنا هذا نصبا، ولم يجد موسى مسا من النصب حتى جاوز المكان الذي أمر به‏.‏ فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فلما انتهيا إلى الصخرة إذا رجل مسجى بثوب ـ أو قال تسجى بثوبه ـ فسلم موسى‏.‏ فقال الخضر وأنى بأرضك السلام فقال أنا موسى‏.‏ فقال موسى بني إسرائيل قال نعم‏.‏ قال هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت، وأنت على علم علمكه لا أعلمه‏.‏ قال ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا، فانطلقا يمشيان على ساحل البحر ليس لهما سفينة، فمرت بهما سفينة، فكلموهم أن يحملوهما، فعرف الخضر، فحملوهما بغير نول، فجاء عصفور فوقع على حرف السفينة، فنقر نقرة أو نقرتين في البحر‏.‏ فقال الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا كنقرة هذا العصفور في البحر‏.‏ فعمد الخضر إلى لوح من ألواح السفينة فنزعه‏.‏ فقال موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت‏.‏ فكانت الأولى من موسى نسيانا‏.‏ فانطلقا فإذا غلام يلعب مع الغلمان، فأخذ الخضر برأسه من أعلاه فاقتلع رأسه بيده‏.‏ فقال موسى أقتلت نفسا زكية بغير نفس قال ألم أقل لك إنك لن تستطيع معي صبرا ـ قال ابن عيينة وهذا أوكد ـ فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها، فأبوا أن يضيفوهما، فوجدا فيها جدارا يريد أن ينقض فأقامه‏.‏ قال الخضر بيده فأقامه‏.‏ فقال له موسى لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لوددنا لو صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		}
	]
}