{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "وقال عثمان بن الهيثم أبو عمرو حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة ـ رضى الله عنه ـ قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت فجعل يحثو من الطعام، فأخذته، وقلت والله لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال إني محتاج، وعلى عيال، ولي حاجة شديدة‏.‏ قال فخليت عنه فأصبحت فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة ما فعل أسيرك البارحة ‏\"‏‏.‏ قال قلت يا رسول الله شكا حاجة شديدة وعيالا فرحمته، فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم إنه سيعود‏.‏ فرصدته فجاء يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال دعني فإني محتاج، وعلى عيال لا أعود، فرحمته، فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، ما فعل أسيرك ‏\"‏‏.‏ قلت يا رسول الله شكا حاجة شديدة وعيالا، فرحمته فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فرصدته الثالثة فجاء يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم، وهذا آخر ثلاث مرات أنك تزعم لا تعود ثم تعود‏.‏ قال دعني أعلمك كلمات ينفعك الله بها‏.‏ قلت ما هو قال إذا أويت إلى فراشك فاقرأ آية الكرسي ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ حتى تختم الآية، فإنك لن يزال عليك من الله حافظ ولا يقربنك شيطان حتى تصبح‏.‏ فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما فعل أسيرك البارحة ‏\"‏‏.‏ قلت يا رسول الله زعم أنه يعلمني كلمات، ينفعني الله بها، فخليت سبيله‏.‏ قال ‏\"‏ ما هي ‏\"‏‏.‏ قلت قال لي إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ وقال لي لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح، وكانوا أحرص شىء على الخير‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنه قد صدقك وهو كذوب، تعلم من تخاطب منذ ثلاث ليال يا أبا هريرة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ ذاك شيطان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}