{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال لم أزل حريصا على أن أسأل عمر ـ رضى الله عنه ـ عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله لهما ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ فحججت معه فعدل وعدلت معه بالإداوة، فتبرز حتى جاء، فسكبت على يديه من الإداوة، فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال لهما ‏{‏إن تتوبا إلى الله‏}‏ فقال واعجبي لك يا ابن عباس عائشة وحفصة، ثم استقبل عمر الحديث يسوقه، فقال إني كنت وجار لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على النبي صلى الله عليه وسلم فينزل يوما وأنزل يوما، فإذا نزلت جئته من خبر ذلك اليوم من الأمر وغيره، وإذا نزل فعل مثله، وكنا معشر قريش نغلب النساء، فلما قدمنا على الأنصار إذا هم قوم تغلبهم نساؤهم، فطفق نساؤنا يأخذن من أدب نساء الأنصار، فصحت على امرأتي، فراجعتني، فأنكرت أن تراجعني، فقالت ولم تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه، وإن إحداهن لتهجره اليوم حتى الليل‏.‏ فأفزعني، فقلت خابت من فعل منهن بعظيم‏.‏ ثم جمعت على ثيابي، فدخلت على حفصة فقلت أى حفصة، أتغاضب إحداكن رسول الله صلى الله عليه وسلم اليوم حتى الليل فقالت نعم‏.‏ فقلت خابت وخسرت، أفتأمن أن يغضب الله لغضب رسوله صلى الله عليه وسلم فتهلكين لا تستكثري على رسول الله صلى الله عليه وسلم ولا تراجعيه في شىء ولا تهجريه، واسأليني ما بدا لك، ولا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى رسول الله صلى الله عليه وسلم ـ يريد عائشة ـ وكنا تحدثنا أن غسان تنعل النعال لغزونا، فنزل صاحبي يوم نوبته فرجع عشاء، فضرب بابي ضربا شديدا، وقال أنائم هو ففزعت فخرجت إليه‏.‏ وقال حدث أمر عظيم‏.‏ قلت ما هو أجاءت غسان قال لا، بل أعظم منه وأطول، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ قال قد خابت حفصة وخسرت، كنت أظن أن هذا يوشك أن يكون، فجمعت على ثيابي، فصليت صلاة الفجر مع النبي صلى الله عليه وسلم فدخل مشربة له فاعتزل فيها، فدخلت على حفصة، فإذا هي تبكي‏.‏ قلت ما يبكيك أولم أكن حذرتك أطلقكن رسول الله صلى الله عليه وسلم قالت لا أدري هو ذا في المشربة‏.‏ فخرجت، فجئت المنبر، فإذا حوله رهط يبكي بعضهم، فجلست معهم قليلا ثم غلبني ما أجد، فجئت المشربة التي هو فيها فقلت لغلام له أسود استأذن لعمر‏.‏ فدخل، فكلم النبي صلى الله عليه وسلم ثم خرج، فقال ذكرتك له، فصمت، فانصرفت حتى جلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت، فذكر مثله، فجلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت الغلام‏.‏ فقلت استأذن لعمر‏.‏ فذكر مثله، فلما وليت منصرفا، فإذا الغلام يدعوني قال أذن لك رسول الله صلى الله عليه وسلم‏.‏ فدخلت عليه، فإذا هو مضطجع على رمال حصير ليس بينه وبينه فراش، قد أثر الرمال بجنبه، متكئ على وسادة من أدم حشوها ليف، فسلمت عليه، ثم قلت وأنا قائم طلقت نساءك فرفع بصره إلى، فقال ‏\"‏ لا ‏\"‏‏.‏ ثم قلت ـ وأنا قائم أستأنس يا رسول الله، لو رأيتني، وكنا معشر قريش نغلب النساء، فلما قدمنا على قوم تغلبهم نساؤهم، فذكره، فتبسم النبي صلى الله عليه وسلم، ثم قلت لو رأيتني، ودخلت على حفصة، فقلت لا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى النبي صلى الله عليه وسلم ـ يريد عائشة ـ فتبسم أخرى، فجلست حين رأيته تبسم، ثم رفعت بصري في بيته، فوالله ما رأيت فيه شيئا يرد البصر غير أهبة ثلاثة‏.‏ فقلت ادع الله فليوسع على أمتك، فإن فارس والروم وسع عليهم وأعطوا الدنيا، وهم لا يعبدون الله، وكان متكئا‏.‏ فقال ‏\"‏ أوفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏‏.‏ فقلت يا رسول الله استغفر لي‏.‏ فاعتزل النبي صلى الله عليه وسلم من أجل ذلك الحديث حين أفشته حفصة إلى عائشة، وكان قد قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏‏.‏ من شدة موجدته عليهن حين عاتبه الله‏.‏ فلما مضت تسع وعشرون دخل على عائشة فبدأ بها، فقالت له عائشة إنك أقسمت أن لا تدخل علينا شهرا، وإنا أصبحنا لتسع وعشرين ليلة، أعدها عدا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏ وكان ذلك الشهر تسع وعشرون‏.‏ قالت عائشة فأنزلت آية التخيير فبدأ بي أول امرأة، فقال ‏\"‏ إني ذاكر لك أمرا، ولا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏‏.‏ قالت قد أعلم أن أبوى لم يكونا يأمراني بفراقك‏.‏ ثم قال ‏\"‏ إن الله قال ‏{‏يا أيها النبي قل لأزواجك‏}‏ إلى قوله ‏{‏ عظيما‏}‏ ‏\"‏‏.‏ قلت أفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة‏.‏ ثم خير نساءه، فقلن مثل ما قالت عائشة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		}
	]
}