{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "حدثنا أبو الربيع، سليمان بن داود وأفهمني بعضه أحمد حدثنا فليح بن سليمان، عن ابن شهاب الزهري، عن عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص الليثي، وعبيد الله بن عبد الله بن عتبة، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله منه، قال الزهري، وكلهم حدثني طائفة من حديثها وبعضهم أوعى من بعض، وأثبت له اقتصاصا، وقد وعيت عن كل واحد منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا‏.‏ زعموا أن عائشة قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين أزواجه، فأيتهن خرج سهمها خرج بها معه، فأقرع بيننا في غزاة غزاها فخرج سهمي، فخرجت معه بعد ما أنزل الحجاب، فأنا أحمل في هودج وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك، وقفل ودنونا من المدينة، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل، فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى الرحل، فلمست صدري، فإذا عقد لي من جزع أظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، فأقبل الذين يرحلون لي، فاحتملوا هودجي فرحلوه على بعيري الذي كنت أركب، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يثقلن ولم يغشهن اللحم، وإنما يأكلن العلقة من الطعام، فلم يستنكر القوم حين رفعوه ثقل الهودج فاحتملوه وكنت جارية حديثة السن، فبعثوا الجمل وساروا، فوجدت عقدي بعد ما استمر الجيش، فجئت منزلهم وليس فيه أحد، فأممت منزلي الذي كنت به فظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة غلبتني عيناى فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني، وكان يراني قبل الحجاب فاستيقظت باسترجاعه حين أناخ راحلته، فوطئ يدها فركبتها فانطلق يقود بي الراحلة، حتى أتينا الجيش بعد ما نزلوا معرسين في نحر الظهيرة، فهلك من هلك، وكان الذي تولى الإفك عبد الله بن أبى ابن سلول، فقدمنا المدينة فاشتكيت بها شهرا، يفيضون من قول أصحاب الإفك، ويريبني في وجعي أني لا أرى من النبي صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أمرض، إنما يدخل فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏‏.‏ لا أشعر بشىء من ذلك حتى نقهت، فخرجت أنا وأم مسطح قبل المناصع متبرزنا، لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا، وأمرنا أمر العرب الأول في البرية أو في التنزه، فأقبلت أنا وأم مسطح بنت أبي رهم نمشي، فعثرت في مرطها فقالت تعس مسطح، فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت يا هنتاه ألم تسمعي ما قالوا فأخبرتني بقول أهل الإفك، فازددت مرضا إلى مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم فقال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت ائذن لي إلى أبوى‏.‏ قالت وأنا حينئذ أريد أن أستيقن الخبر من قبلهما، فأذن لي رسول الله صلى الله عليه وسلم فأتيت أبوى فقلت لأمي ما يتحدث به الناس فقالت يا بنية هوني على نفسك الشأن، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا أكثرن عليها‏.‏ فقلت سبحان الله ولقد يتحدث الناس بهذا قالت فبت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم، ثم أصبحت فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى، يستشيرهما في فراق أهله، فأما أسامة فأشار عليه بالذي يعلم في نفسه من الود لهم، فقال أسامة أهلك يا رسول الله ولا نعلم والله إلا خيرا، وأما علي بن أبي طالب فقال يا رسول الله لم يضيق الله عليك والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ يا بريرة هل رأيت فيها شيئا يريبك ‏\"‏‏.‏ فقالت بريرة لا والذي بعثك بالحق، إن رأيت منها أمرا أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن العجين فتأتي الداجن فتأكله‏.‏ فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى ابن سلول فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرني من رجل بلغني أذاه في أهلي، فوالله ما علمت على أهلي إلا خيرا، وقد ذكروا رجلا ما علمت عليه إلا خيرا، وما كان يدخل على أهلي إلا معي ‏\"‏‏.‏ فقام سعد بن معاذ فقال يا رسول الله أنا والله أعذرك منه، إن كان من الأوس ضربنا عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا فيه أمرك‏.‏ فقام سعد بن عبادة وهو سيد الخزرج، وكان قبل ذلك رجلا صالحا ولكن احتملته الحمية فقال كذبت لعمر الله، لا تقتله ولا تقدر على ذلك، فقام أسيد بن الحضير فقال كذبت لعمر الله، والله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ فثار الحيان الأوس والخزرج حتى هموا، ورسول الله صلى الله عليه وسلم على المنبر فنزل فخفضهم حتى سكتوا وسكت، وبكيت يومي لا يرقأ لي دمع ولا أكتحل بنوم، فأصبح عندي أبواى، قد بكيت ليلتين ويوما حتى أظن أن البكاء فالق كبدي ـ قالت ـ فبينا هما جالسان عندي وأنا أبكي إذ استأذنت امرأة من الأنصار فأذنت لها، فجلست تبكي معي، فبينا نحن كذلك إذ دخل رسول الله صلى الله عليه وسلم فجلس، ولم يجلس عندي من يوم قيل في ما قيل قبلها، وقد مكث شهرا لا يوحى إليه في شأني شىء ـ قالت ـ فتشهد ثم قال ‏\"‏ يا عائشة فإنه بلغني عنك كذا وكذا، فإن كنت بريئة فسيبرئك الله، وإن كنت ألممت فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف بذنبه ثم تاب تاب الله عليه ‏\"‏‏.‏ فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة وقلت لأبي أجب عني رسول الله صلى الله عليه وسلم‏.‏ قال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ قالت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن فقلت إني والله لقد علمت أنكم سمعتم ما يتحدث به الناس، ووقر في أنفسكم وصدقتم به، ولئن قلت لكم إني بريئة‏.‏ والله يعلم إني لبريئة لا تصدقوني بذلك، ولئن اعترفت لكم بأمر، والله يعلم أني بريئة لتصدقني والله ما أجد لي ولكم مثلا إلا أبا يوسف إذ قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت على فراشي، وأنا أرجو أن يبرئني الله، ولكن والله ما ظننت أن ينزل في شأني وحيا، ولأنا أحقر في نفسي من أن يتكلم بالقرآن في أمري، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله، فوالله ما رام مجلسه ولا خرج أحد من أهل البيت حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه مثل الجمان من العرق في يوم شات، فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكان أول كلمة تكلم بها أن قال لي ‏\"‏ يا عائشة، احمدي الله فقد برأك الله ‏\"‏‏.‏ فقالت لي أمي قومي إلى رسول الله صلى الله عليه وسلم‏.‏ فقلت لا والله، لا أقوم إليه، ولا أحمد إلا الله فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك عصبة منكم‏}‏ الآيات، فلما أنزل الله هذا في براءتي قال أبو بكر الصديق ـ رضى الله عنه ـ وكان ينفق على مسطح بن أثاثة لقرابته منه والله لا أنفق على مسطح شيئا أبدا بعد ما قال لعائشة‏.‏ فأنزل الله تعالى ‏{‏ولا يأتل أولو الفضل منكم والسعة‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ فقال أبو بكر بلى، والله إني لأحب أن يغفر الله لي، فرجع إلى مسطح الذي كان يجري عليه‏.‏ وكان رسول الله صلى الله عليه وسلم يسأل زينب بنت جحش عن أمري، فقال ‏\"‏ يا زينب، ما علمت ما رأيت ‏\"‏‏.‏ فقالت يا رسول الله، أحمي سمعي وبصري، والله ما علمت عليها إلا خيرا، قالت وهى التي كانت تساميني، فعصمها الله بالورع‏.‏ قال وحدثنا فليح، عن هشام بن عروة، عن عروة، عن عائشة، وعبد الله بن الزبير، مثله‏.‏ قال وحدثنا فليح، عن ربيعة بن أبي عبد الرحمن، ويحيى بن سعيد، عن القاسم بن محمد بن أبي بكر، مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		}
	]
}