{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "حدثنا إبراهيم بن حمزة، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس ـ رضى الله عنهما ـ أنه أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر يدعوه إلى الإسلام، وبعث بكتابه إليه مع دحية الكلبي، وأمره رسول الله صلى الله عليه وسلم أن يدفعه إلى عظيم بصرى ليدفعه إلى قيصر، وكان قيصر لما كشف الله عنه جنود فارس مشى من حمص إلى إيلياء، شكرا لما أبلاه الله، فلما جاء قيصر كتاب رسول الله صلى الله عليه وسلم قال حين قرأه التمسوا لي ها هنا أحدا من قومه لأسألهم عن رسول الله صلى الله عليه وسلم‏.‏ قال ابن عباس فأخبرني أبو سفيان، أنه كان بالشأم في رجال من قريش، قدموا تجارا في المدة التي كانت بين رسول الله صلى الله عليه وسلم وبين كفار قريش، قال أبو سفيان فوجدنا رسول قيصر ببعض الشأم فانطلق بي وبأصحابي حتى قدمنا إيلياء، فأدخلنا عليه، فإذا هو جالس في مجلس ملكه وعليه التاج، وإذا حوله عظماء الروم فقال لترجمانه سلهم أيهم أقرب نسبا إلى هذا الرجل الذي يزعم أنه نبي قال أبو سفيان فقلت أنا أقربهم نسبا‏.‏ قال ما قرابة ما بينك وبينه فقلت هو ابن عمي، وليس في الركب يومئذ أحد من بني عبد مناف غيري‏.‏ فقال قيصر أدنوه‏.‏ وأمر بأصحابي فجعلوا خلف ظهري عند كتفي، ثم قال لترجمانه قل لأصحابه إني سائل هذا الرجل عن الذي يزعم أنه نبي، فإن كذب فكذبوه‏.‏ قال أبو سفيان والله لولا الحياء يومئذ من أن يأثر أصحابي عني الكذب لكذبته حين سألني عنه، ولكني استحييت أن يأثروا الكذب عني فصدقته، ثم قال لترجمانه قل له كيف نسب هذا الرجل فيكم قلت هو فينا ذو نسب‏.‏ قال فهل قال هذا القول أحد منكم قبله قلت لا‏.‏ فقال كنتم تتهمونه على الكذب قبل أن يقول ما قال قلت لا‏.‏ قال فهل كان من آبائه من ملك قلت لا‏.‏ قال فأشراف الناس يتبعونه أم ضعفاؤهم قلت بل ضعفاؤهم‏.‏ قال فيزيدون أو ينقصون قلت بل يزيدون‏.‏ قال فهل يرتد أحد سخطة لدينه بعد أن يدخل فيه قلت لا‏.‏ قال فهل يغدر قلت لا، ونحن الآن منه في مدة، نحن نخاف أن يغدر‏.‏ قال أبو سفيان ولم يمكني كلمة أدخل فيها شيئا أنتقصه به لا أخاف أن تؤثر عني غيرها‏.‏ قال فهل قاتلتموه أو قاتلكم قلت نعم‏.‏ قال فكيف كانت حربه وحربكم قلت كانت دولا وسجالا، يدال علينا المرة وندال عليه الأخرى‏.‏ قال فماذا يأمركم قال يأمرنا أن نعبد الله وحده لا نشرك به شيئا، وينهانا عما كان يعبد آباؤنا، ويأمرنا بالصلاة والصدقة والعفاف والوفاء بالعهد وأداء الأمانة‏.‏ فقال لترجمانه حين قلت ذلك له قل له إني سألتك عن نسبه فيكم، فزعمت أنه ذو نسب، وكذلك الرسل تبعث في نسب قومها، وسألتك هل قال أحد منكم هذا القول قبله فزعمت أن لا، فقلت لو كان أحد منكم قال هذا القول قبله قلت رجل يأتم بقول قد قيل قبله‏.‏ وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا، فعرفت أنه لم يكن ليدع الكذب على الناس ويكذب على الله، وسألتك هل كان من آبائه من ملك فزعمت أن لا، فقلت لو كان من آبائه ملك قلت يطلب ملك آبائه‏.‏ وسألتك أشراف الناس يتبعونه أم ضعفاؤهم فزعمت أن ضعفاءهم اتبعوه، وهم أتباع الرسل، وسألتك هل يزيدون أو ينقصون فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم، وسألتك هل يرتد أحد سخطة لدينه بعد أن يدخل فيه فزعمت أن لا، فكذلك الإيمان حين تخلط بشاشته القلوب لا يسخطه أحد، وسألتك هل يغدر فزعمت أن لا، وكذلك الرسل لا يغدرون‏.‏ وسألتك هل قاتلتموه وقاتلكم فزعمت أن قد فعل، وأن حربكم وحربه تكون دولا، ويدال عليكم المرة وتدالون عليه الأخرى، وكذلك الرسل تبتلى، وتكون لها العاقبة، وسألتك بماذا يأمركم فزعمت أنه يأمركم أن تعبدوا الله ولا تشركوا به شيئا، وينهاكم عما كان يعبد آباؤكم، ويأمركم بالصلاة والصدق والعفاف والوفاء بالعهد، وأداء الأمانة، قال وهذه صفة النبي، قد كنت أعلم أنه خارج، ولكن لم أظن أنه منكم، وإن يك ما قلت حقا، فيوشك أن يملك موضع قدمى هاتين، ولو أرجو أن أخلص إليه لتجشمت لقيه، ولو كنت عنده لغسلت قدميه‏.‏ قال أبو سفيان ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرئ فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد عبد الله ورسوله، إلى هرقل عظيم الروم، سلام على من اتبع الهدى، أما بعد فإني أدعوك بدعاية الإسلام، أسلم تسلم، وأسلم يؤتك الله أجرك مرتين، فإن توليت فعليك إثم الأريسيين و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏‏\"‏‏.‏ قال أبو سفيان فلما أن قضى مقالته، علت أصوات الذين حوله من عظماء الروم، وكثر لغطهم، فلا أدري ماذا قالوا، وأمر بنا فأخرجنا، فلما أن خرجت مع أصحابي وخلوت بهم قلت لهم لقد أمر أمر ابن أبي كبشة، هذا ملك بني الأصفر يخافه، قال أبو سفيان والله ما زلت ذليلا مستيقنا بأن أمره سيظهر، حتى أدخل الله قلبي الإسلام وأنا كاره‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}