{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "حدثنا إسحاق بن محمد الفروي، حدثنا مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان،، وكان، محمد بن جبير ذكر لي ذكرا من حديثه ذلك، فانطلقت حتى أدخل على مالك بن أوس، فسألته عن ذلك الحديث فقال مالك بينا أنا جالس في أهلي حين متع النهار، إذا رسول عمر بن الخطاب يأتيني فقال أجب أمير المؤمنين‏.‏ فانطلقت معه حتى أدخل على عمر، فإذا هو جالس على رمال سرير، ليس بينه وبينه فراش متكئ على وسادة من أدم، فسلمت عليه ثم جلست فقال يا مال، إنه قدم علينا من قومك أهل أبيات، وقد أمرت فيهم برضخ فاقبضه فاقسمه بينهم‏.‏ فقلت يا أمير المؤمنين، لو أمرت به غيري‏.‏ قال اقبضه أيها المرء‏.‏ فبينا أنا جالس عنده أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن بن عوف والزبير وسعد بن أبي وقاص يستأذنون قال نعم‏.‏ فأذن لهم فدخلوا فسلموا وجلسوا، ثم جلس يرفا يسيرا ثم قال هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فدخلا فسلما فجلسا، فقال عباس يا أمير المؤمنين، اقض بيني وبين هذا‏.‏ وهما يختصمان فيما أفاء الله على رسوله صلى الله عليه وسلم من بني النضير‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ قال عمر تيدكم، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما الله، أتعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره ـ ثم قرأ ‏{‏وما أفاء الله على رسوله منهم‏}‏ إلى قوله ‏{‏قدير‏}‏ ـ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم‏.‏ والله ما احتازها دونكم، ولا استأثر بها عليكم قد أعطاكموه، وبثها فيكم حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل رسول الله صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قال عمر ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضها أبو بكر، فعمل فيها بما عمل رسول الله صلى الله عليه وسلم، والله يعلم إنه فيها لصادق بار راشد تابع للحق، ثم توفى الله أبا بكر، فكنت أنا ولي أبي بكر، فقبضتها سنتين من إمارتي، أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وما عمل فيها أبو بكر، والله يعلم إني فيها لصادق بار راشد تابع للحق، ثم جئتماني تكلماني وكلمتكما واحدة، وأمركما واحد، جئتني يا عباس تسألني نصيبك من ابن أخيك، وجاءني هذا ـ يريد عليا ـ يريد نصيب امرأته من أبيها، فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعتها إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وبما عمل فيها أبو بكر، وبما عملت فيها منذ وليتها، فقلتما ادفعها إلينا‏.‏ فبذلك دفعتها إليكما، فأنشدكم بالله، هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ ثم أقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال فتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك، فإن عجزتما عنها فادفعاها إلى، فإني أكفيكماها‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		}
	]
}