{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"59": "Beginning of Creation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "حدثنا هدبة بن خالد، حدثنا همام، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، وهشام، قالا حدثنا قتادة، حدثنا أنس بن مالك، عن مالك بن صعصعة ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم ‏\"‏ بينا أنا عند البيت بين النائم واليقظان ـ وذكر بين الرجلين ـ فأتيت بطست من ذهب ملئ حكمة وإيمانا، فشق من النحر إلى مراق البطن، ثم غسل البطن بماء زمزم، ثم ملئ حكمة وإيمانا، وأتيت بدابة أبيض دون البغل وفوق الحمار البراق، فانطلقت مع جبريل حتى أتينا السماء الدنيا قيل من هذا قال جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على آدم، فسلمت عليه، فقال مرحبا بك من ابن ونبي‏.‏ فأتينا السماء الثانية، قيل من هذا قال جبريل‏.‏ قيل من معك قال محمد صلى الله عليه وسلم‏.‏ قيل أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على عيسى ويحيى فقالا مرحبا بك من أخ ونبي‏.‏ فأتينا السماء الثالثة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به ولنعم المجيء جاء‏.‏ فأتيت يوسف فسلمت عليه، قال مرحبا بك من أخ ونبي فأتينا السماء الرابعة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد صلى الله عليه وسلم‏.‏ قيل وقد أرسل إليه قيل نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على إدريس فسلمت عليه، فقال مرحبا من أخ ونبي‏.‏ فأتينا السماء الخامسة، قيل من هذا قال جبريل‏.‏ قيل ومن معك قيل محمد‏.‏ قيل وقد أرسل إليه قال نعم‏.‏ قيل مرحبا به، ولنعم المجيء جاء‏.‏ فأتينا على هارون، فسلمت عليه فقال مرحبا بك من أخ ونبي‏.‏ فأتينا على السماء السادسة، قيل من هذا قيل جبريل‏.‏ قيل من معك قال محمد صلى الله عليه وسلم‏.‏ قيل وقد أرسل إليه مرحبا به، ولنعم المجيء جاء‏.‏ فأتيت على موسى، فسلمت ‏{‏عليه‏}‏ فقال مرحبا بك من أخ ونبي‏.‏ فلما جاوزت بكى‏.‏ فقيل ما أبكاك قال يا رب، هذا الغلام الذي بعث بعدي يدخل الجنة من أمته أفضل مما يدخل من أمتي‏.‏ فأتينا السماء السابعة، قيل من هذا قيل جبريل‏.‏ قيل من معك قيل محمد‏.‏ قيل وقد أرسل إليه مرحبا به، ونعم المجيء جاء‏.‏ فأتيت على إبراهيم، فسلمت عليه فقال مرحبا بك من ابن ونبي، فرفع لي البيت المعمور، فسألت جبريل فقال هذا البيت المعمور يصلي فيه كل يوم سبعون ألف ملك، إذا خرجوا لم يعودوا إليه آخر ما عليهم، ورفعت لي سدرة المنتهى فإذا نبقها كأنه قلال هجر، وورقها كأنه آذان الفيول، في أصلها أربعة أنهار نهران باطنان ونهران ظاهران، فسألت جبريل فقال أما الباطنان ففي الجنة، وأما الظاهران النيل والفرات، ثم فرضت على خمسون صلاة، فأقبلت حتى جئت موسى، فقال ما صنعت قلت فرضت على خمسون صلاة‏.‏ قال أنا أعلم بالناس منك، عالجت بني إسرائيل أشد المعالجة، وإن أمتك لا تطيق، فارجع إلى ربك فسله‏.‏ فرجعت فسألته، فجعلها أربعين، ثم مثله ثم ثلاثين، ثم مثله فجعل عشرين، ثم مثله فجعل عشرا، فأتيت موسى فقال مثله، فجعلها خمسا، فأتيت موسى فقال ما صنعت قلت جعلها خمسا، فقال مثله، قلت سلمت بخير، فنودي إني قد أمضيت فريضتي وخففت عن عبادي، وأجزي الحسنة عشرا ‏\"‏‏.‏ وقال همام عن قتادة عن الحسن عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم ‏\"‏ في البيت المعمور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 18
			}
		}
	]
}