{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "قال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، ح حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال أنس كان أبو ذر ـ رضى الله عنه ـ يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة، فنزل جبريل، ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري، ثم أطبقه ثم أخذ بيدي، فعرج بي إلى السماء، فلما جاء إلى السماء الدنيا، قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال معك أحد قال معي محمد‏.‏ قال أرسل إليه قال نعم، فافتح‏.‏ فلما علونا السماء إذا رجل عن يمينه أسودة، وعن يساره أسودة، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا يا جبريل قال هذا آدم، وهذه الأسودة عن يمينه، وعن شماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى، ثم عرج بي جبريل، حتى أتى السماء الثانية، فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول، ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات إدريس وموسى وعيسى وإبراهيم، ولم يثبت لي كيف منازلهم، غير أنه قد ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السادسة‏.‏ وقال أنس فلما مر جبريل بإدريس‏.‏ قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس، ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى، فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال عيسى‏.‏ ثم مررت بإبراهيم، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم‏.‏ قال وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك ـ رضى الله عنهما ـ قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على خمسين صلاة، فرجعت بذلك حتى أمر بموسى، فقال موسى ما الذي فرض على أمتك قلت فرض عليهم خمسين صلاة‏.‏ قال فراجع ربك، فإن أمتك لا تطيق ذلك‏.‏ فرجعت فراجعت ربي فوضع شطرها، فرجعت إلى موسى، فقال راجع ربك، فذكر مثله، فوضع شطرها، فرجعت إلى موسى، فأخبرته فقال راجع ربك، فإن أمتك لا تطيق ذلك، فرجعت فراجعت ربي فقال هي خمس، وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى، فقال راجع ربك‏.‏ فقلت قد استحييت من ربي، ثم انطلق، حتى أتى السدرة المنتهى، فغشيها ألوان لا أدري ما هي، ثم أدخلت ‏{‏الجنة‏}‏ فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		}
	]
}