{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3364,
			"arabicnumber": 3364,
			"text": "وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب السختياني، وكثير بن كثير بن المطلب بن أبي وداعة،، يزيد أحدهما على الآخر عن سعيد بن جبير، قال ابن عباس أول ما اتخذ النساء المنطق من قبل أم إسماعيل، اتخذت منطقا لتعفي أثرها على سارة، ثم جاء بها إبراهيم، وبابنها إسماعيل وهى ترضعه حتى وضعهما عند البيت عند دوحة، فوق زمزم في أعلى المسجد، وليس بمكة يومئذ أحد، وليس بها ماء، فوضعهما هنالك، ووضع عندهما جرابا فيه تمر وسقاء فيه ماء، ثم قفى إبراهيم منطلقا فتبعته أم إسماعيل فقالت يا إبراهيم أين تذهب وتتركنا بهذا الوادي الذي ليس فيه إنس ولا شىء فقالت له ذلك مرارا، وجعل لا يلتفت إليها فقالت له آلله الذي أمرك بهذا قال نعم‏.‏ قالت إذا لا يضيعنا‏.‏ ثم رجعت، فانطلق إبراهيم حتى إذا كان عند الثنية حيث لا يرونه استقبل بوجهه البيت، ثم دعا بهؤلاء الكلمات ورفع يديه، فقال ‏{‏ربنا إني أسكنت من ذريتي بواد غير ذي زرع‏}‏ حتى بلغ ‏{‏يشكرون‏}‏‏.‏ وجعلت أم إسماعيل ترضع إسماعيل، وتشرب من ذلك الماء، حتى إذا نفد ما في السقاء عطشت وعطش ابنها، وجعلت تنظر إليه يتلوى ـ أو قال يتلبط ـ فانطلقت كراهية أن تنظر إليه، فوجدت الصفا أقرب جبل في الأرض يليها، فقامت عليه ثم استقبلت الوادي تنظر هل ترى أحدا فلم تر أحدا، فهبطت من، الصفا حتى إذا بلغت الوادي رفعت طرف درعها، ثم سعت سعى الإنسان المجهود، حتى جاوزت الوادي، ثم أتت المروة، فقامت عليها ونظرت هل ترى أحدا، فلم تر أحدا، ففعلت ذلك سبع مرات ـ قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فذلك سعى الناس بينهما ‏\"‏‏.‏ ـ فلما أشرفت على المروة سمعت صوتا، فقالت صه‏.‏ تريد نفسها، ثم تسمعت، فسمعت أيضا، فقالت قد أسمعت، إن كان عندك غواث‏.‏ فإذا هي بالملك، عند موضع زمزم، فبحث بعقبه ـ أو قال بجناحه ـ حتى ظهر الماء، فجعلت تحوضه وتقول بيدها هكذا، وجعلت تغرف من الماء في سقائها، وهو يفور بعد ما تغرف ـ قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل لو تركت زمزم ـ أو قال لو لم تغرف من الماء ـ لكانت زمزم عينا معينا ‏\"‏‏.‏ ـ قال فشربت وأرضعت ولدها، فقال لها الملك لا تخافوا الضيعة، فإن ها هنا بيت الله، يبني هذا الغلام، وأبوه، وإن الله لا يضيع أهله‏.‏ وكان البيت مرتفعا من الأرض كالرابية، تأتيه السيول فتأخذ عن يمينه وشماله، فكانت كذلك، حتى مرت بهم رفقة من جرهم ـ أو أهل بيت من جرهم ـ مقبلين من طريق كداء فنزلوا في أسفل مكة، فرأوا طائرا عائفا‏.‏ فقالوا إن هذا الطائر ليدور على ماء، لعهدنا بهذا الوادي وما فيه ماء، فأرسلوا جريا أو جريين، فإذا هم بالماء، فرجعوا فأخبروهم بالماء، فأقبلوا، قال وأم إسماعيل عند الماء فقالوا أتأذنين لنا أن ننزل عندك فقالت نعم، ولكن لا حق لكم في الماء‏.‏ قالوا نعم‏.‏ قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فألفى ذلك أم إسماعيل، وهى تحب الإنس ‏\"‏ فنزلوا وأرسلوا إلى أهليهم، فنزلوا معهم حتى إذا كان بها أهل أبيات منهم، وشب الغلام، وتعلم العربية منهم، وأنفسهم وأعجبهم حين شب، فلما أدرك زوجوه امرأة منهم، وماتت أم إسماعيل، فجاء إبراهيم، بعد ما تزوج إسماعيل يطالع تركته، فلم يجد إسماعيل، فسأل امرأته عنه فقالت خرج يبتغي لنا‏.‏ ثم سألها عن عيشهم وهيئتهم فقالت نحن بشر، نحن في ضيق وشدة‏.‏ فشكت إليه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، وقولي له يغير عتبة بابه‏.‏ فلما جاء إسماعيل، كأنه آنس شيئا، فقال هل جاءكم من أحد قالت نعم، جاءنا شيخ كذا وكذا، فسألنا عنك فأخبرته، وسألني كيف عيشنا فأخبرته أنا في جهد وشدة‏.‏ قال فهل أوصاك بشىء قالت نعم، أمرني أن أقرأ عليك السلام، ويقول غير عتبة بابك‏.‏ قال ذاك أبي وقد أمرني أن أفارقك الحقي بأهلك‏.‏ فطلقها، وتزوج منهم أخرى، فلبث عنهم إبراهيم ما شاء الله ثم أتاهم بعد، فلم يجده، فدخل على امرأته، فسألها عنه‏.‏ فقالت خرج يبتغي لنا‏.‏ قال كيف أنتم وسألها عن عيشهم، وهيئتهم‏.‏ فقالت نحن بخير وسعة‏.‏ وأثنت على الله‏.‏ فقال ما طعامكم قالت اللحم‏.‏ قال فما شرابكم قالت الماء‏.‏ فقال اللهم بارك لهم في اللحم والماء‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ولم يكن لهم يومئذ حب، ولو كان لهم دعا لهم فيه ‏\"‏‏.‏ قال فهما لا يخلو عليهما أحد بغير مكة إلا لم يوافقاه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، ومريه يثبت عتبة بابه، فلما جاء إسماعيل قال هل أتاكم من أحد قالت نعم أتانا شيخ حسن الهيئة، وأثنت عليه، فسألني عنك فأخبرته، فسألني كيف عيشنا فأخبرته أنا بخير‏.‏ قال فأوصاك بشىء قالت نعم، هو يقرأ عليك السلام، ويأمرك أن تثبت عتبة بابك‏.‏ قال ذاك أبي، وأنت العتبة، أمرني أن أمسكك‏.‏ ثم لبث عنهم ما شاء الله، ثم جاء بعد ذلك، وإسماعيل يبري نبلا له تحت دوحة قريبا من زمزم، فلما رآه قام إليه، فصنعا كما يصنع الوالد بالولد والولد بالوالد، ثم قال يا إسماعيل، إن الله أمرني بأمر‏.‏ قال فاصنع ما أمرك ربك‏.‏ قال وتعينني قال وأعينك‏.‏ قال فإن الله أمرني أن أبني ها هنا بيتا‏.‏ وأشار إلى أكمة مرتفعة على ما حولها‏.‏ قال فعند ذلك رفعا القواعد من البيت، فجعل إسماعيل يأتي بالحجارة، وإبراهيم يبني، حتى إذا ارتفع البناء جاء بهذا الحجر فوضعه له، فقام عليه وهو يبني، وإسماعيل يناوله الحجارة، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏‏.‏ قال فجعلا يبنيان حتى يدورا حول البيت، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 38
			}
		}
	]
}