{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"7": "Rubbing hands and feet with dust (Tayammum)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 344,
			"arabicnumber": 344,
			"text": "حدثنا مسدد، قال حدثني يحيى بن سعيد، قال حدثنا عوف، قال حدثنا أبو رجاء، عن عمران، قال كنا في سفر مع النبي صلى الله عليه وسلم وإنا أسرينا، حتى كنا في آخر الليل، وقعنا وقعة ولا وقعة أحلى عند المسافر منها، فما أيقظنا إلا حر الشمس، وكان أول من استيقظ فلان ثم فلان ثم فلان ـ يسميهم أبو رجاء فنسي عوف ـ ثم عمر بن الخطاب الرابع، وكان النبي صلى الله عليه وسلم إذا نام لم يوقظ حتى يكون هو يستيقظ، لأنا لا ندري ما يحدث له في نومه، فلما استيقظ عمر، ورأى ما أصاب الناس، وكان رجلا جليدا، فكبر ورفع صوته بالتكبير، فما زال يكبر ويرفع صوته بالتكبير حتى استيقظ لصوته النبي صلى الله عليه وسلم فلما استيقظ شكوا إليه الذي أصابهم قال ‏\"‏ لا ضير ـ أو لا يضير ـ ارتحلوا ‏\"‏‏.‏ فارتحل فسار غير بعيد ثم نزل، فدعا بالوضوء، فتوضأ ونودي بالصلاة فصلى بالناس، فلما انفتل من صلاته إذا هو برجل معتزل لم يصل مع القوم قال ‏\"‏ ما منعك يا فلان أن تصلي مع القوم ‏\"‏‏.‏ قال أصابتني جنابة ولا ماء‏.‏ قال ‏\"‏ عليك بالصعيد، فإنه يكفيك ‏\"‏‏.‏ ثم سار النبي صلى الله عليه وسلم فاشتكى إليه الناس من العطش فنزل، فدعا فلانا ـ كان يسميه أبو رجاء نسيه عوف ـ ودعا عليا فقال ‏\"‏ اذهبا فابتغيا الماء ‏\"‏‏.‏ فانطلقا فتلقيا امرأة بين مزادتين ـ أو سطيحتين ـ من ماء على بعير لها، فقالا لها أين الماء قالت عهدي بالماء أمس هذه الساعة، ونفرنا خلوفا‏.‏ قالا لها انطلقي إذا‏.‏ قالت إلى أين قالا إلى رسول الله صلى الله عليه وسلم‏.‏ قالت الذي يقال له الصابئ قالا هو الذي تعنين فانطلقي‏.‏ فجاءا بها إلى النبي صلى الله عليه وسلم وحدثاه الحديث قال فاستنزلوها عن بعيرها ودعا النبي صلى الله عليه وسلم بإناء، ففرغ فيه من أفواه المزادتين ـ أو السطيحتين ـ وأوكأ أفواههما، وأطلق العزالي، ونودي في الناس اسقوا واستقوا‏.‏ فسقى من شاء، واستقى من شاء، وكان آخر ذاك أن أعطى الذي أصابته الجنابة إناء من ماء قال ‏\"‏ اذهب، فأفرغه عليك ‏\"‏‏.‏ وهى قائمة تنظر إلى ما يفعل بمائها، وايم الله لقد أقلع عنها، وإنه ليخيل إلينا أنها أشد ملأة منها حين ابتدأ فيها، فقال النبي صلى الله عليه وسلم ‏\"‏ اجمعوا لها ‏\"‏‏.‏ فجمعوا لها من بين عجوة ودقيقة وسويقة، حتى جمعوا لها طعاما، فجعلوها في ثوب، وحملوها على بعيرها، ووضعوا الثوب بين يديها قال لها ‏\"‏ تعلمين ما رزئنا من مائك شيئا، ولكن الله هو الذي أسقانا ‏\"‏‏.‏ فأتت أهلها، وقد احتبست عنهم قالوا ما حبسك يا فلانة قالت العجب، لقيني رجلان فذهبا بي إلى هذا الذي يقال له الصابئ، ففعل كذا وكذا، فوالله إنه لأسحر الناس من بين هذه وهذه‏.‏ وقالت بإصبعيها الوسطى والسبابة، فرفعتهما إلى السماء ـ تعني السماء والأرض ـ أو إنه لرسول الله حقا، فكان المسلمون بعد ذلك يغيرون على من حولها من المشركين، ولا يصيبون الصرم الذي هي منه، فقالت يوما لقومها ما أرى أن هؤلاء القوم يدعونكم عمدا، فهل لكم في الإسلام فأطاعوها فدخلوا في الإسلام‏.‏",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 11
			}
		}
	]
}