{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام، أخبرنا معمر، عن الزهري، حدثنا عروة بن الزبير، أن عبيد الله بن عدي بن الخيار، أخبره أن المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث قالا له ما يمنعك أن تكلم خالك عثمان في أخيه الوليد بن عقبة وكان أكثر الناس فيما فعل به‏.‏ قال عبيد الله فانتصبت لعثمان حين خرج إلى الصلاة فقلت له إن لي إليك حاجة وهى نصيحة‏.‏ فقال أيها المرء، أعوذ بالله منك، فانصرفت، فلما قضيت الصلاة جلست إلى المسور وإلى ابن عبد يغوث، فحدثتهما بالذي قلت لعثمان وقال لي‏.‏ فقالا قد قضيت الذي كان عليك‏.‏ فبينما أنا جالس معهما، إذ جاءني رسول عثمان، فقالا لي قد ابتلاك الله‏.‏ فانطلقت حتى دخلت عليه، فقال ما نصيحتك التي ذكرت آنفا قال فتشهدت ثم قلت إن الله بعث محمدا صلى الله عليه وسلم وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت به، وهاجرت الهجرتين الأوليين، وصحبت رسول الله صلى الله عليه وسلم ورأيت هديه، وقد أكثر الناس في شأن الوليد بن عقبة، فحق عليك أن تقيم عليه الحد‏.‏ فقال لي يا ابن أخي أدركت رسول الله صلى الله عليه وسلم قال قلت لا، ولكن قد خلص إلى من علمه ما خلص إلى العذراء في سترها‏.‏ قال فتشهد عثمان فقال إن الله قد بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت بما بعث به محمد صلى الله عليه وسلم‏.‏ وهاجرت الهجرتين الأوليين كما قلت، وصحبت رسول الله صلى الله عليه وسلم وبايعته، والله ما عصيته ولا غششته حتى توفاه الله، ثم استخلف الله أبا بكر فوالله ما عصيته ولا غششته، ثم استخلف عمر، فوالله ما عصيته ولا غششته، ثم استخلفت، أفليس لي عليكم مثل الذي كان لهم على قال بلى‏.‏ قال فما هذه الأحاديث التي تبلغني عنكم فأما ما ذكرت من شأن الوليد بن عقبة، فسنأخذ فيه إن شاء الله بالحق قال فجلد الوليد أربعين جلدة، وأمر عليا أن يجلده، وكان هو يجلده‏.‏ وقال يونس وابن أخي الزهري عن الزهري أفليس لي عليكم من الحق مثل الذي كان لهم‏.‏ قال أبو عبد الله بلاء من ربكم ما ابتليتم به من شدة وفي موضع البلاء الابتلاء والتمحيص من بلوته ومحصته أي استخرجت ما عنده يبلو يختبر مبتليكم مختبركم وأما قوله بلاء عظيم النعم وهي من أبليته وتلك من ابتليته",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		}
	]
}