{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "حدثني محمد، حدثنا عبد الصمد، حدثنا أبي، حدثنا عبد العزيز بن صهيب، حدثنا أنس بن مالك ـ رضى الله عنه ـ قال أقبل نبي الله صلى الله عليه وسلم إلى المدينة وهو مردف أبا بكر، وأبو بكر شيخ يعرف، ونبي الله صلى الله عليه وسلم شاب لا يعرف، قال فيلقى الرجل أبا بكر فيقول يا أبا بكر، من هذا الرجل الذي بين يديك فيقول هذا الرجل يهديني السبيل‏.‏ قال فيحسب الحاسب أنه إنما يعني الطريق، وإنما يعني سبيل الخير، فالتفت أبو بكر، فإذا هو بفارس قد لحقهم، فقال يا رسول الله، هذا فارس قد لحق بنا‏.‏ فالتفت نبي الله صلى الله عليه وسلم فقال ‏\"‏ اللهم اصرعه ‏\"‏‏.‏ فصرعه الفرس، ثم قامت تحمحم فقال يا نبي الله مرني بما شئت‏.‏ قال ‏\"‏ فقف مكانك، لا تتركن أحدا يلحق بنا ‏\"‏‏.‏ قال فكان أول النهار جاهدا على نبي الله صلى الله عليه وسلم، وكان آخر النهار مسلحة له، فنزل رسول الله صلى الله عليه وسلم جانب الحرة، ثم بعث إلى الأنصار، فجاءوا إلى نبي الله صلى الله عليه وسلم فسلموا عليهما، وقالوا اركبا آمنين مطاعين‏.‏ فركب نبي الله صلى الله عليه وسلم وأبو بكر، وحفوا دونهما بالسلاح، فقيل في المدينة جاء نبي الله، جاء نبي الله صلى الله عليه وسلم‏.‏ فأشرفوا ينظرون ويقولون جاء نبي الله، جاء نبي الله‏.‏ فأقبل يسير حتى نزل جانب دار أبي أيوب، فإنه ليحدث أهله، إذ سمع به عبد الله بن سلام وهو في نخل لأهله يخترف لهم، فعجل أن يضع الذي يخترف لهم فيها، فجاء وهى معه، فسمع من نبي الله صلى الله عليه وسلم ثم رجع إلى أهله، فقال نبي الله صلى الله عليه وسلم ‏\"‏ أى بيوت أهلنا أقرب ‏\"‏‏.‏ فقال أبو أيوب أنا يا نبي الله، هذه داري، وهذا بابي‏.‏ قال ‏\"‏ فانطلق فهيئ لنا مقيلا ‏\"‏‏.‏ قال قوما على بركة الله‏.‏ فلما جاء نبي الله صلى الله عليه وسلم جاء عبد الله بن سلام فقال أشهد أنك رسول الله، وأنك جئت بحق، وقد علمت يهود أني سيدهم وابن سيدهم، وأعلمهم وابن أعلمهم، فادعهم فاسألهم عني قبل أن يعلموا أني قد أسلمت، فإنهم إن يعلموا أني قد أسلمت قالوا في ما ليس في‏.‏ فأرسل نبي الله صلى الله عليه وسلم فأقبلوا فدخلوا عليه‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر اليهود، ويلكم اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أني رسول الله حقا، وأني جئتكم بحق فأسلموا ‏\"‏‏.‏ قالوا ما نعلمه‏.‏ قالوا للنبي صلى الله عليه وسلم قالها ثلاث مرار‏.‏ قال ‏\"‏ فأى رجل فيكم عبد الله بن سلام ‏\"‏‏.‏ قالوا ذاك سيدنا وابن سيدنا، وأعلمنا وابن أعلمنا‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ يا ابن سلام، اخرج عليهم ‏\"‏‏.‏ فخرج فقال يا معشر اليهود، اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أنه رسول الله، وأنه جاء بحق‏.‏ فقالوا كذبت‏.‏ فأخرجهم رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		}
	]
}