{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4033,
			"arabicnumber": 4033,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني مالك بن أوس بن الحدثان النصري، أن عمر بن الخطاب ـ رضى الله عنه ـ دعاه إذ جاءه حاجبه يرفا فقال هل لك في عثمان، وعبد الرحمن، والزبير وسعد يستأذنون فقال نعم، فأدخلهم‏.‏ فلبث قليلا، ثم جاء فقال هل لك في عباس وعلي يستأذنان قال نعم‏.‏ فلما دخلا قال عباس يا أمير المؤمنين، اقض بيني وبين هذا، وهما يختصمان في الذي أفاء الله على رسوله صلى الله عليه وسلم من بني النضير، فاستب علي وعباس، فقال الرهط يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ يريد بذلك نفسه‏.‏ قالوا قد قال ذلك‏.‏ فأقبل عمر على عباس وعلي فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا نعم‏.‏ قال فإني أحدثكم عن هذا الأمر، إن الله سبحانه كان خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره فقال جل ذكره ‏{‏وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب‏}‏ إلى قوله ‏{‏قدير‏}‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم، ثم والله ما احتازها دونكم، ولا استأثرها عليكم، لقد أعطاكموها وقسمها فيكم، حتى بقي هذا المال منها، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل ذلك رسول الله صلى الله عليه وسلم حياته، ثم توفي النبي صلى الله عليه وسلم فقال أبو بكر فأنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضه أبو بكر، فعمل فيه بما عمل به رسول الله صلى الله عليه وسلم وأنتم حينئذ‏.‏ فأقبل على علي وعباس وقال تذكران أن أبا بكر عمل فيه كما تقولان، والله يعلم إنه فيه لصادق بار راشد تابع للحق ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر‏.‏ فقبضته سنتين من إمارتي أعمل فيه بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، والله يعلم أني فيه صادق بار راشد تابع للحق، ثم جئتماني كلاكما وكلمتكما واحدة وأمركما جميع، فجئتني ـ يعني عباسا ـ فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيه بما عمل فيه رسول الله صلى الله عليه وسلم وأبو بكر، وما عملت فيه مذ وليت، وإلا فلا تكلماني، فقلتما ادفعه إلينا بذلك‏.‏ فدفعته إليكما، أفتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض لا أقضي فيه بقضاء غير ذلك حتى تقوم الساعة، فإن عجزتما عنه، فادفعا إلى فأنا أكفيكماه‏.‏ قال فحدثت هذا الحديث، عروة بن الزبير فقال صدق مالك بن أوس، أنا سمعت عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم تقول أرسل أزواج النبي صلى الله عليه وسلم عثمان إلى أبي بكر يسألنه ثمنهن مما أفاء الله على رسوله صلى الله عليه وسلم، فكنت أنا أردهن، فقلت لهن ألا تتقين الله، ألم تعلمن أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ لا نورث، ما تركنا صدقة ـ يريد بذلك نفسه ـ إنما يأكل آل محمد صلى الله عليه وسلم في هذا المال ‏\"‏‏.‏ فانتهى أزواج النبي صلى الله عليه وسلم إلى ما أخبرتهن‏.‏ قال فكانت هذه الصدقة بيد علي، منعها علي عباسا فغلبه عليها، ثم كان بيد حسن بن علي، ثم بيد حسين بن علي، ثم بيد علي بن حسين وحسن بن حسن، كلاهما كانا يتداولانها، ثم بيد زيد بن حسن، وهى صدقة رسول الله صلى الله عليه وسلم حقا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}