{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4037,
			"arabicnumber": 4037,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو سمعت جابر بن عبد الله ـ رضى الله عنهما ـ يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من لكعب بن الأشرف فإنه قد آذى الله ورسوله ‏\"‏‏.‏ فقام محمد بن مسلمة فقال يا رسول الله أتحب أن أقتله قال ‏\"‏ نعم ‏\"‏‏.‏ قال فأذن لي أن أقول شيئا‏.‏ قال ‏\"‏ قل ‏\"‏‏.‏ فأتاه محمد بن مسلمة فقال إن هذا الرجل قد سألنا صدقة، وإنه قد عنانا، وإني قد أتيتك أستسلفك‏.‏ قال وأيضا والله لتملنه قال إنا قد اتبعناه فلا نحب أن ندعه حتى ننظر إلى أى شىء يصير شأنه، وقد أردنا أن تسلفنا وسقا، أو وسقين ـ وحدثنا عمرو غير مرة، فلم يذكر وسقا أو وسقين أو فقلت له فيه وسقا أو وسقين فقال أرى فيه وسقا أو وسقين ـ فقال نعم ارهنوني‏.‏ قالوا أى شىء تريد قال فارهنوني نساءكم‏.‏ قالوا كيف نرهنك نساءنا وأنت أجمل العرب قال فارهنوني أبناءكم‏.‏ قالوا كيف نرهنك أبناءنا فيسب أحدهم، فيقال رهن بوسق أو وسقين‏.‏ هذا عار علينا، ولكنا نرهنك اللأمة ـ قال سفيان يعني السلاح ـ فواعده أن يأتيه، فجاءه ليلا ومعه أبو نائلة وهو أخو كعب من الرضاعة، فدعاهم إلى الحصن، فنزل إليهم فقالت له امرأته أين تخرج هذه الساعة فقال إنما هو محمد بن مسلمة، وأخي أبو نائلة ـ وقال غير عمرو قالت أسمع صوتا كأنه يقطر منه الدم‏.‏ قال إنما هو أخي محمد بن مسلمة ورضيعي أبو نائلة ـ إن الكريم لو دعي إلى طعنة بليل لأجاب قال ويدخل محمد بن مسلمة معه رجلين ـ قيل لسفيان سماهم عمرو قال سمى بعضهم قال عمرو جاء معه برجلين وقال غير عمرو أبو عبس بن جبر، والحارث بن أوس وعباد بن بشر قال عمرو وجاء معه برجلين ـ فقال إذا ما جاء فإني قائل بشعره فأشمه، فإذا رأيتموني استمكنت من رأسه فدونكم فاضربوه‏.‏ وقال مرة ثم أشمكم‏.‏ فنزل إليهم متوشحا وهو ينفح منه ريح الطيب، فقال ما رأيت كاليوم ريحا ـ أى أطيب ـ وقال غير عمرو قال عندي أعطر نساء العرب وأكمل العرب قال عمرو فقال أتأذن لي أن أشم رأسك قال نعم، فشمه، ثم أشم أصحابه ثم قال أتأذن لي قال نعم‏.‏ فلما استمكن منه قال دونكم‏.‏ فقتلوه ثم أتوا النبي صلى الله عليه وسلم فأخبروه‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 84
			}
		}
	]
}