{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "حدثني أبو جعفر، محمد بن عبد الله حدثنا حجين بن المثنى، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن الفضل، عن سليمان بن يسار، عن جعفر بن عمرو بن أمية الضمري، قال خرجت مع عبيد الله بن عدي بن الخيار، فلما قدمنا حمص قال لي عبيد الله هل لك في وحشي نسأله عن قتل حمزة قلت نعم‏.‏ وكان وحشي يسكن حمص فسألنا عنه فقيل لنا هو ذاك في ظل قصره، كأنه حميت‏.‏ قال فجئنا حتى وقفنا عليه بيسير، فسلمنا، فرد السلام، قال وعبيد الله معتجر بعمامته، ما يرى وحشي إلا عينيه ورجليه، فقال عبيد الله يا وحشي أتعرفني قال فنظر إليه ثم قال لا والله إلا أني أعلم أن عدي بن الخيار تزوج امرأة يقال لها أم قتال بنت أبي العيص، فولدت له غلاما بمكة، فكنت أسترضع له، فحملت ذلك الغلام مع أمه، فناولتها إياه، فلكأني نظرت إلى قدميك‏.‏ قال فكشف عبيد الله عن وجهه ثم قال ألا تخبرنا بقتل حمزة قال نعم، إن حمزة قتل طعيمة بن عدي بن الخيار ببدر، فقال لي مولاى جبير بن مطعم إن قتلت حمزة بعمي فأنت حر، قال فلما أن خرج الناس عام عينين ـ وعينين جبل بحيال أحد، بينه وبينه واد ـ خرجت مع الناس إلى القتال، فلما اصطفوا للقتال خرج سباع فقال هل من مبارز قال فخرج إليه حمزة بن عبد المطلب فقال يا سباع يا ابن أم أنمار مقطعة البظور، أتحاد الله ورسوله صلى الله عليه وسلم قال ثم شد عليه فكان كأمس الذاهب ـ قال ـ وكمنت لحمزة تحت صخرة فلما دنا مني رميته بحربتي، فأضعها في ثنته حتى خرجت من بين وركيه ـ قال ـ فكان ذاك العهد به، فلما رجع الناس رجعت معهم فأقمت بمكة، حتى فشا فيها الإسلام، ثم خرجت إلى الطائف، فأرسلوا إلى رسول الله صلى الله عليه وسلم رسولا، فقيل لي إنه لا يهيج الرسل ـ قال ـ فخرجت معهم حتى قدمت على رسول الله صلى الله عليه وسلم فلما رآني قال ‏\"‏ آنت وحشي ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أنت قتلت حمزة ‏\"‏‏.‏ قلت قد كان من الأمر ما بلغك‏.‏ قال ‏\"‏ فهل تستطيع أن تغيب وجهك عني ‏\"‏‏.‏ قال فخرجت، فلما قبض رسول الله صلى الله عليه وسلم فخرج مسيلمة الكذاب قلت لأخرجن إلى مسيلمة لعلي أقتله فأكافئ به حمزة ـ قال ـ فخرجت مع الناس، فكان من أمره ما كان ـ قال ـ فإذا رجل قائم في ثلمة جدار، كأنه جمل أورق ثائر الرأس ـ قال ـ فرميته بحربتي، فأضعها بين ثدييه حتى خرجت من بين كتفيه ـ قال ـ ووثب إليه رجل من الأنصار، فضربه بالسيف على هامته‏.‏ قال قال عبد الله بن الفضل فأخبرني سليمان بن يسار أنه سمع عبد الله بن عمر يقول فقالت جارية على ظهر بيت وا أمير المؤمنين، قتله العبد الأسود‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 117
			}
		}
	]
}