{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "حدثني إبراهيم بن موسى، أخبرنا هشام بن يوسف، عن معمر، عن الزهري، عن عمرو بن أبي سفيان الثقفي، عن أبي هريرة ـ رضى الله عنه ـ قال بعث النبي صلى الله عليه وسلم سرية عينا، وأمر عليهم عاصم بن ثابت ـ وهو جد عاصم بن عمر بن الخطاب ـ فانطلقوا حتى إذا كان بين عسفان ومكة ذكروا لحي من هذيل، يقال لهم بنو لحيان، فتبعوهم بقريب من مائة رام، فاقتصوا آثارهم حتى أتوا منزلا نزلوه فوجدوا فيه نوى تمر تزودوه من المدينة فقالوا هذا تمر يثرب‏.‏ فتبعوا آثارهم حتى لحقوهم، فلما انتهى عاصم وأصحابه لجئوا إلى فدفد، وجاء القوم فأحاطوا بهم، فقالوا لكم العهد والميثاق إن نزلتم إلينا أن لا نقتل منكم رجلا‏.‏ فقال عاصم أما أنا فلا أنزل في ذمة كافر، اللهم أخبر عنا نبيك‏.‏ فقاتلوهم حتى قتلوا عاصما في سبعة نفر بالنبل، وبقي خبيب، وزيد ورجل آخر، فأعطوهم العهد والميثاق، فلما أعطوهم العهد والميثاق نزلوا إليهم، فلما استمكنوا منهم حلوا أوتار قسيهم فربطوهم بها‏.‏ فقال الرجل الثالث الذي معهما هذا أول الغدر‏.‏ فأبى أن يصحبهم فجرروه وعالجوه على أن يصحبهم، فلم يفعل، فقتلوه، وانطلقوا بخبيب وزيد حتى باعوهما بمكة، فاشترى خبيبا بنو الحارث بن عامر بن نوفل، وكان خبيب هو قتل الحارث يوم بدر، فمكث عندهم أسيرا حتى إذا أجمعوا قتله استعار موسى من بعض بنات الحارث أستحد بها فأعارته، قالت فغفلت عن صبي لي فدرج إليه حتى أتاه، فوضعه على فخذه، فلما رأيته فزعت فزعة عرف ذاك مني، وفي يده الموسى فقال أتخشين أن أقتله ما كنت لأفعل ذاك إن شاء الله‏.‏ وكانت تقول ما رأيت أسيرا قط خيرا من خبيب، لقد رأيته يأكل من قطف عنب، وما بمكة يومئذ ثمرة، وإنه لموثق في الحديد، وما كان إلا رزق رزقه الله، فخرجوا به من الحرم، ليقتلوه فقال دعوني أصلي ركعتين‏.‏ ثم انصرف إليهم فقال لولا أن تروا أن ما بي جزع من الموت، لزدت‏.‏ فكان أول من سن الركعتين عند القتل هو، ثم قال اللهم أحصهم عددا ثم قال ما أبالي حين أقتل مسلما على أى شق كان لله مصرعي وذلك في ذات الإله وإن يشأ يبارك على أوصال شلو ممزع ثم قام إليه عقبة بن الحارث فقتله، وبعث قريش إلى عاصم ليؤتوا بشىء من جسده يعرفونه، وكان عاصم قتل عظيما من عظمائهم يوم بدر، فبعث الله عليه مثل الظلة من الدبر، فحمته من رسلهم، فلم يقدروا منه على شىء‏.‏",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 130
			}
		}
	]
}