{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال حدثني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة بن مسعود، عن عائشة، رضى الله عنها زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، وكلهم حدثني طائفة من حديثها، وبعضهم كان أوعى لحديثها من بعض وأثبت له اقتصاصا، وقد وعيت عن كل رجل منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا، وإن كان بعضهم أوعى له من بعض، قالوا قالت عائشة كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين أزواجه، فأيهن خرج سهمها، خرج بها رسول الله صلى الله عليه وسلم معه، قالت عائشة فأقرع بيننا في غزوة غزاها فخرج فيها سهمي، فخرجت مع رسول الله صلى الله عليه وسلم بعد ما أنزل الحجاب، فكنت أحمل في هودجي وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل، دنونا من المدينة قافلين، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى رحلي، فلمست صدري، فإذا عقد لي من جزع ظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، قالت وأقبل الرهط الذين كانوا يرحلوني فاحتملوا هودجي، فرحلوه على بعيري الذي كنت أركب عليه، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم، إنما يأكلن العلقة من الطعام، فلم يستنكر القوم خفة الهودج حين رفعوه وحملوه، وكنت جارية حديثة السن، فبعثوا الجمل فساروا، ووجدت عقدي بعد ما استمر الجيش، فجئت منازلهم وليس بها منهم داع ولا مجيب، فتيممت منزلي الذي كنت به، وظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة في منزلي غلبتني عيني فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم، فعرفني حين رآني، وكان رآني قبل الحجاب، فاستيقظت باسترجاعه حين عرفني، فخمرت وجهي بجلبابي، والله ما تكلمنا بكلمة ولا سمعت منه كلمة غير استرجاعه، وهوى حتى أناخ راحلته، فوطئ على يدها، فقمت إليها فركبتها، فانطلق يقود بي الراحلة حتى أتينا الجيش موغرين في نحر الظهيرة، وهم نزول ـ قالت ـ فهلك ‏{‏في‏}‏ من هلك، وكان الذي تولى كبر الإفك عبد الله بن أبى ابن سلول‏.‏ قال عروة أخبرت أنه كان يشاع ويتحدث به عنده، فيقره ويستمعه ويستوشيه‏.‏ وقال عروة أيضا لم يسم من أهل الإفك أيضا إلا حسان بن ثابت، ومسطح بن أثاثة، وحمنة بنت جحش في ناس آخرين، لا علم لي بهم، غير أنهم عصبة ـ كما قال الله تعالى ـ وإن كبر ذلك يقال عبد الله بن أبى ابن سلول‏.‏ قال عروة كانت عائشة تكره أن يسب عندها حسان، وتقول إنه الذي قال: فإن أبي ووالده وعرضي لعرض محمد منكم وقاء قالت عائشة فقدمنا المدينة فاشتكيت حين قدمت شهرا، والناس يفيضون في قول أصحاب الإفك، لا أشعر بشىء من ذلك، وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي، إنما يدخل على رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ثم ينصرف، فذلك يريبني ولا أشعر بالشر، حتى خرجت حين نقهت، فخرجت مع أم مسطح قبل المناصع، وكان متبرزنا، وكنا لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا‏.‏ قالت وأمرنا أمر العرب الأول في البرية قبل الغائط، وكنا نتأذى بالكنف أن نتخذها عند بيوتنا، قالت فانطلقت أنا وأم مسطح وهى ابنة أبي رهم بن المطلب بن عبد مناف، وأمها بنت صخر بن عامر خالة أبي بكر الصديق، وابنها مسطح بن أثاثة بن عباد بن المطلب، فأقبلت أنا وأم مسطح قبل بيتي، حين فرغنا من شأننا، فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت أى هنتاه ولم تسمعي ما قال قالت وقلت ما قال فأخبرتني بقول أهل الإفك ـ قالت ـ فازددت مرضا على مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت له أتأذن لي أن آتي أبوى قالت وأريد أن أستيقن الخبر من قبلهما، قالت فأذن لي رسول الله صلى الله عليه وسلم، فقلت لأمي يا أمتاه ماذا يتحدث الناس قالت يا بنية هوني عليك، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها لها ضرائر إلا كثرن عليها‏.‏ قالت فقلت سبحان الله أولقد تحدث الناس بهذا قالت فبكيت تلك الليلة، حتى أصبحت لا يرقأ لي دمع، ولا أكتحل بنوم، ثم أصبحت أبكي ـ قالت ـ ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما ويستشيرهما في فراق أهله ـ قالت ـ فأما أسامة فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله، وبالذي يعلم لهم في نفسه، فقال أسامة أهلك ولا نعلم إلا خيرا‏.‏ وأما علي فقال يا رسول الله لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت له بريرة والذي بعثك بالحق ما رأيت عليها أمرا قط أغمصه، غير أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله ـ قالت ـ فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى وهو على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغني عنه أذاه في أهلي، والله ما علمت على أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا، وما يدخل على أهلي إلا معي ‏\"‏‏.‏ قالت فقام سعد بن معاذ أخو بني عبد الأشهل فقال أنا يا رسول الله أعذرك، فإن كان من الأوس ضربت عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا أمرك‏.‏ قالت فقام رجل من الخزرج، وكانت أم حسان بنت عمه من فخذه، وهو سعد بن عبادة، وهو سيد الخزرج ـ قالت ـ وكان قبل ذلك رجلا صالحا، ولكن احتملته الحمية فقال لسعد كذبت لعمر الله لا تقتله، ولا تقدر على قتله، ولو كان من رهطك ما أحببت أن يقتل‏.‏ فقام أسيد بن حضير ـ وهو ابن عم سعد ـ فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ قالت فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا، ورسول الله صلى الله عليه وسلم قائم على المنبر ـ قالت ـ فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت ـ قالت ـ فبكيت يومي ذلك كله، لا يرقأ لي دمع، ولا أكتحل بنوم ـ قالت ـ وأصبح أبواى عندي، وقد بكيت ليلتين ويوما، لا يرقأ لي دمع، ولا أكتحل بنوم، حتى إني لأظن أن البكاء فالق كبدي، فبينا أبواى جالسان عندي وأنا أبكي فاستأذنت على امرأة من الأنصار، فأذنت لها، فجلست تبكي معي ـ قالت ـ فبينا نحن على ذلك دخل رسول الله صلى الله عليه وسلم علينا، فسلم ثم جلس ـ قالت ـ ولم يجلس عندي منذ قيل ما قيل قبلها، وقد لبث شهرا لا يوحى إليه في شأني بشىء ـ قالت ـ فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد، يا عائشة إنه بلغني عنك كذا وكذا، فإن كنت بريئة، فسيبرئك الله، وإن كنت ألممت بذنب، فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف ثم تاب تاب الله عليه ‏\"‏‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة، فقلت لأبي أجب رسول الله صلى الله عليه وسلم عني فيما قال‏.‏ فقال أبي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت أمي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت وأنا جارية حديثة السن لا أقرأ من القرآن كثيرا إني والله لقد علمت لقد سمعتم هذا الحديث حتى استقر في أنفسكم وصدقتم به، فلئن قلت لكم إني بريئة لا تصدقوني، ولئن اعترفت لكم بأمر، والله يعلم أني منه بريئة لتصدقني، فوالله لا أجد لي ولكم مثلا إلا أبا يوسف حين قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت واضطجعت على فراشي، والله يعلم أني حينئذ بريئة، وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن الله منزل في شأني وحيا يتلى، لشأني في نفسي كان أحقر من أن يتكلم الله في بأمر، ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها، فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه، ولا خرج أحد من أهل البيت، حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه من العرق مثل الجمان وهو في يوم شات، من ثقل القول الذي أنزل عليه ـ قالت ـ فسري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكانت أول كلمة تكلم بها أن قال ‏\"‏ يا عائشة أما الله فقد برأك ‏\"‏‏.‏ قالت فقالت لي أمي قومي إليه‏.‏ فقلت والله لا أقوم إليه، فإني لا أحمد إلا الله عز وجل ـ قالت ـ وأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات، ثم أنزل الله هذا في براءتي‏.‏ قال أبو بكر الصديق ـ وكان ينفق على مسطح بن أثاثة لقرابته منه وفقره ـ والله لا أنفق على مسطح شيئا أبدا بعد الذي قال لعائشة ما قال‏.‏ فأنزل الله ‏{‏ ولا يأتل أولو الفضل منكم‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ قال أبو بكر الصديق بلى والله إني لأحب أن يغفر الله لي فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها منه أبدا قالت عائشة وكان رسول الله صلى الله عليه وسلم سأل زينب بنت جحش عن أمري فقال لزينب ماذا علمت أو رأيت فقالت يا رسول الله أحمي سمعي وبصري والله ما علمت إلا خيرا قالت عائشة وهي التي كانت تساميني من أزواج النبي صلى الله عليه وسلم فعصمها الله بالورع قالت وطفقت أختها حمنة تحارب لها فهلكت فيمن هلك قال ابن شهاب فهذا الذي بلغني من حديث هؤلاء الرهط ثم قال عروة قالت عائشة والله إن الرجل الذي قيل له ما قيل ليقول سبحان الله فوالذي نفسي بيده ما كشفت من كنف أنثى قط قالت ثم قتل بعد ذلك في سبيل الله",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 185
			}
		}
	]
}