{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "حدثني إبراهيم بن موسى، عن هشام، عن معمر،‏.‏ وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، قال حدثني ابن عباس، قال حدثني أبو سفيان، من فيه إلى في قال انطلقت في المدة التي كانت بيني وبين رسول الله صلى الله عليه وسلم ـ قال ـ فبينا أنا بالشأم إذ جيء بكتاب من النبي صلى الله عليه وسلم إلى هرقل قال وكان دحية الكلبي جاء به فدفعه إلى عظيم بصرى، فدفعه عظيم بصرى إلى ـ هرقل ـ قال فقال هرقل هل ها هنا أحد من قوم هذا الرجل الذي يزعم أنه نبي فقالوا نعم‏.‏ قال فدعيت في نفر من قريش فدخلنا على هرقل، فأجلسنا بين يديه فقال أيكم أقرب نسبا من هذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا‏.‏ فأجلسوني بين يديه، وأجلسوا أصحابي خلفي، ثم دعا بترجمانه فقال قل لهم إني سائل هذا عن هذا الرجل الذي يزعم أنه نبي، فإن كذبني فكذبوه‏.‏ قال أبو سفيان وايم الله، لولا أن يؤثروا على الكذب لكذبت‏.‏ ثم قال لترجمانه سله كيف حسبه فيكم قال قلت هو فينا ذو حسب‏.‏ قال فهل كان من آبائه ملك قال قلت لا‏.‏ قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا‏.‏ قال أيتبعه أشراف الناس أم ضعفاؤهم قال قلت بل ضعفاؤهم‏.‏ قال يزيدون أو ينقصون قال قلت لا بل يزيدون‏.‏ قال هل يرتد أحد منهم عن دينه، بعد أن يدخل فيه، سخطة له قال قلت لا‏.‏ قال فهل قاتلتموه قال قلت نعم‏.‏ قال فكيف كان قتالكم إياه قال قلت تكون الحرب بيننا وبينه سجالا، يصيب منا ونصيب منه‏.‏ قال فهل يغدر قال قلت لا ونحن منه في هذه المدة لا ندري ما هو صانع فيها‏.‏ قال والله ما أمكنني من كلمة أدخل فيها شيئا غير هذه‏.‏ قال فهل قال هذا القول أحد قبله قلت لا‏.‏ ثم قال لترجمانه قل له إني سألتك عن حسبه فيكم، فزعمت أنه فيكم ذو حسب، وكذلك الرسل تبعث في أحساب قومها، وسألتك هل كان في آبائه ملك فزعمت أن لا فقلت لو كان من آبائه ملك قلت رجل يطلب ملك آبائه، وسألتك عن أتباعه أضعفاؤهم أم أشرافهم فقلت بل ضعفاؤهم، وهم أتباع الرسل، وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا، فعرفت أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله، وسألتك هل يرتد أحد منهم عن دينه بعد أن يدخل فيه سخطة له فزعمت أن لا، وكذلك الإيمان إذا خالط بشاشة القلوب، وسألتك هل يزيدون أم ينقصون فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم، وسألتك هل قاتلتموه فزعمت أنكم قاتلتموه فتكون الحرب بينكم وبينه سجالا، ينال منكم وتنالون منه، وكذلك الرسل تبتلى، ثم تكون لهم العاقبة، وسألتك هل يغدر فزعمت أنه لا يغدر، وكذلك الرسل لا تغدر، وسألتك هل قال أحد هذا القول قبله فزعمت أن لا، فقلت لو كان قال هذا القول أحد قبله قلت رجل ائتم بقول قيل قبله‏.‏ قال ثم قال بم يأمركم قال قلت يأمرنا بالصلاة والزكاة والصلة والعفاف‏.‏ قال إن يك ما تقول فيه حقا فإنه نبي، وقد كنت أعلم أنه خارج، ولم أك أظنه منكم، ولو أني أعلم أني أخلص إليه لأحببت لقاءه، ولو كنت عنده لغسلت عن قدميه، وليبلغن ملكه ما تحت قدمى‏.‏ قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرأه، فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد رسول الله، إلى هرقل عظيم الروم، سلام على من اتبع الهدى، أما بعد، فإني أدعوك بدعاية الإسلام، أسلم تسلم، وأسلم يؤتك الله أجرك مرتين، فإن توليت فإن عليك إثم الأريسيين، و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله‏}‏ إلى قوله ‏{‏اشهدوا بأنا مسلمون‏}‏‏\"‏‏.‏ فلما فرغ من قراءة الكتاب ارتفعت الأصوات عنده، وكثر اللغط، وأمر بنا فأخرجنا قال فقلت لأصحابي حين خرجنا لقد أمر أمر ابن أبي كبشة، أنه ليخافه ملك بني الأصفر فما زلت موقنا بأمر رسول الله صلى الله عليه وسلم أنه سيظهر حتى أدخل الله على الإسلام‏.‏ قال الزهري فدعا هرقل عظماء الروم فجمعهم في دار له فقال يا معشر الروم، هل لكم في الفلاح والرشد آخر الأبد، وأن يثبت لكم ملككم قال فحاصوا حيصة حمر الوحش إلى الأبواب، فوجدوها قد غلقت، فقال على بهم‏.‏ فدعا بهم فقال إني إنما اختبرت شدتكم على دينكم، فقد رأيت منكم الذي أحببت‏.‏ فسجدوا له ورضوا عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 75
			}
		}
	]
}