{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4953,
			"arabicnumber": 4953,
			"text": "حدثنا يحيى، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني سعيد بن مروان، حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرنا أبو صالح، سلمويه قال حدثني عبد الله، عن يونس بن يزيد، قال أخبرني ابن شهاب، أن عروة بن الزبير، أخبره أن عائشة زوج النبي صلى الله عليه وسلم قالت كان أول ما بدئ به رسول الله صلى الله عليه وسلم الرؤيا الصادقة في النوم، فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح، ثم حبب إليه الخلاء فكان يلحق بغار حراء فيتحنث فيه ـ قال والتحنث التعبد ـ الليالي ذوات العدد قبل أن يرجع إلى أهله، ويتزود لذلك، ثم يرجع إلى خديجة فيتزود بمثلها، حتى فجئه الحق وهو في غار حراء فجاءه الملك فقال اقرأ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنا بقارئ ‏\"‏‏.‏ قال ‏\"‏ فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني‏.‏ فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثانية حتى بلغ مني الجهد، ثم أرسلني‏.‏ فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثالثة حتى بلغ مني الجهد ثم أرسلني‏.‏ فقال ‏{‏اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم * الذي علم بالقلم‏}‏ ‏\"‏‏.‏ الآيات إلى قوله ‏{‏علم الإنسان ما لم يعلم‏}‏ فرجع بها رسول الله صلى الله عليه وسلم ترجف بوادره حتى دخل على خديجة فقال ‏\"‏ زملوني زملوني ‏\"‏‏.‏ فزملوه حتى ذهب عنه الروع قال لخديجة ‏\"‏ أى خديجة ما لي، لقد خشيت على نفسي ‏\"‏‏.‏ فأخبرها الخبر‏.‏ قالت خديجة كلا أبشر، فوالله لا يخزيك الله أبدا، فوالله إنك لتصل الرحم، وتصدق الحديث، وتحمل الكل، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق‏.‏ فانطلقت به خديجة حتى أتت به ورقة بن نوفل وهو ابن عم خديجة أخي أبيها، وكان امرأ تنصر في الجاهلية، وكان يكتب الكتاب العربي ويكتب من الإنجيل بالعربية ما شاء الله أن يكتب، وكان شيخا كبيرا قد عمي فقالت خديجة يا ابن عم اسمع من ابن أخيك‏.‏ قال ورقة يا ابن أخي ماذا ترى فأخبره النبي صلى الله عليه وسلم خبر ما رأى‏.‏ فقال ورقة هذا الناموس الذي أنزل على موسى، ليتني فيها جذعا، ليتني أكون حيا‏.‏ ذكر حرفا‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أومخرجي هم ‏\"‏‏.‏ قال ورقة نعم لم يأت رجل بما جئت به إلا أوذي، وإن يدركني يومك حيا أنصرك نصرا مؤزرا‏.‏ ثم لم ينشب ورقة أن توفي، وفتر الوحى، فترة حتى حزن رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 475
			}
		}
	]
}