{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5191,
			"arabicnumber": 5191,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال لم أزل حريصا أن أسأل عمر بن الخطاب عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ حتى حج وحججت معه، وعدل وعدلت معه بإداوة، فتبرز، ثم جاء فسكبت على يديه منها فتوضأ فقلت له يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ قال واعجبا لك يا ابن عباس، هما عائشة وحفصة‏.‏ ثم استقبل عمر الحديث يسوقه قال كنت أنا وجار لي من الأنصار في بني أمية بن زيد، وهم من عوالي المدينة، وكنا نتناوب النزول على النبي صلى الله عليه وسلم فينزل يوما وأنزل يوما، فإذا نزلت جئته بما حدث من خبر ذلك اليوم من الوحى أو غيره، وإذا نزل فعل مثل ذلك، وكنا معشر قريش نغلب النساء، فلما قدمنا على الأنصار إذا قوم تغلبهم نساؤهم، فطفق نساؤنا يأخذن من أدب نساء الأنصار، فصخبت على امرأتي فراجعتني فأنكرت أن تراجعني قالت ولم تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه، وإن إحداهن لتهجره اليوم حتى الليل‏.‏ فأفزعني ذلك وقلت لها وقد خاب من فعل ذلك منهن‏.‏ ثم جمعت على ثيابي فنزلت فدخلت على حفصة فقلت لها أى حفصة أتغاضب إحداكن النبي صلى الله عليه وسلم اليوم حتى الليل قالت نعم‏.‏ فقلت قد خبت وخسرت، أفتأمنين أن يغضب الله لغضب رسوله صلى الله عليه وسلم فتهلكي لا تستكثري النبي صلى الله عليه وسلم ولا تراجعيه في شىء، ولا تهجريه، وسليني ما بدا لك، ولا يغرنك أن كانت جارتك أوضأ منك، وأحب إلى النبي صلى الله عليه وسلم ـ يريد عائشة ـ قال عمر وكنا قد تحدثنا أن غسان تنعل الخيل لغزونا، فنزل صاحبي الأنصاري يوم نوبته، فرجع إلينا عشاء فضرب بابي ضربا شديدا وقال أثم هو ففزعت فخرجت إليه، فقال قد حدث اليوم أمر عظيم‏.‏ قلت ما هو، أجاء غسان قال لا بل أعظم من ذلك وأهول، طلق النبي صلى الله عليه وسلم نساءه‏.‏ فقلت خابت حفصة وخسرت، قد كنت أظن هذا يوشك أن يكون، فجمعت على ثيابي فصليت صلاة الفجر مع النبي صلى الله عليه وسلم فدخل النبي صلى الله عليه وسلم مشربة له، فاعتزل فيها، ودخلت على حفصة فإذا هي تبكي فقلت ما يبكيك ألم أكن حذرتك هذا أطلقكن النبي صلى الله عليه وسلم قالت لا أدري ها هو ذا معتزل في المشربة‏.‏ فخرجت فجئت إلى المنبر فإذا حوله رهط يبكي بعضهم، فجلست معهم قليلا ثم غلبني ما أجد، فجئت المشربة التي فيها النبي صلى الله عليه وسلم فقلت لغلام له أسود استأذن لعمر‏.‏ فدخل الغلام فكلم النبي صلى الله عليه وسلم ثم رجع فقال كلمت النبي صلى الله عليه وسلم وذكرتك له، فصمت‏.‏ فانصرفت حتى جلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت فقلت للغلام استأذن لعمر‏.‏ فدخل ثم رجع فقال قد ذكرتك له فصمت‏.‏ فرجعت فجلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت الغلام فقلت استأذن لعمر‏.‏ فدخل ثم رجع إلى فقال قد ذكرتك له فصمت‏.‏ فلما وليت منصرفا ـ قال ـ إذا الغلام يدعوني فقال قد أذن لك النبي صلى الله عليه وسلم فدخلت على رسول الله صلى الله عليه وسلم فإذا هو مضطجع على رمال حصير، ليس بينه وبينه فراش، قد أثر الرمال بجنبه متكئا على وسادة من أدم حشوها ليف، فسلمت عليه ثم قلت وأنا قائم يا رسول الله أطلقت نساءك‏.‏ فرفع إلى بصره فقال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏ ثم قلت وأنا قائم أستأنس يا رسول الله لو رأيتني، وكنا معشر قريش نغلب النساء فلما قدمنا المدينة إذا قوم تغلبهم نساؤهم، فتبسم النبي صلى الله عليه وسلم ثم قلت يا رسول الله لو رأيتني ودخلت على حفصة فقلت لها لا يغرنك أن كانت جارتك أوضأ منك وأحب إلى النبي صلى الله عليه وسلم يريد عائشة فتبسم النبي صلى الله عليه وسلم تبسمة أخرى، فجلست حين رأيته تبسم، فرفعت بصري في بيته، فوالله ما رأيت في بيته شيئا يرد البصر غير أهبة ثلاثة، فقلت يا رسول الله ادع الله فليوسع على أمتك، فإن فارسا والروم قد وسع عليهم، وأعطوا الدنيا وهم لا يعبدون الله‏.‏ فجلس النبي صلى الله عليه وسلم وكان متكئا‏.‏ فقال ‏\"‏ أوفي هذا أنت يا ابن الخطاب، إن أولئك قوم عجلوا طيباتهم في الحياة الدنيا ‏\"‏‏.‏ فقلت يا رسول الله استغفر لي‏.‏ فاعتزل النبي صلى الله عليه وسلم نساءه من أجل ذلك الحديث حين أفشته حفصة إلى عائشة تسعا وعشرين ليلة وكان قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏‏.‏ من شدة موجدته عليهن حين عاتبه الله، فلما مضت تسع وعشرون ليلة دخل على عائشة فبدأ بها فقالت له عائشة يا رسول الله إنك كنت قد أقسمت أن لا تدخل علينا شهرا، وإنما أصبحت من تسع وعشرين ليلة أعدها عدا‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏ فكان ذلك الشهر تسعا وعشرين ليلة‏.‏ قالت عائشة ثم أنزل الله تعالى آية التخير فبدأ بي أول امرأة من نسائه فاخترته، ثم خير نساءه كلهن فقلن مثل ما قالت عائشة‏.‏",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 125
			}
		}
	]
}