{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6573,
			"arabicnumber": 6573,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني سعيد، وعطاء بن يزيد، أن أبا هريرة، أخبرهما عن النبي صلى الله عليه وسلم‏.‏ وحدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي هريرة، قال قال أناس يا رسول الله هل نرى ربنا يوم القيامة فقال ‏\"‏ هل تضارون في الشمس، ليس دونها سحاب ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ هل تضارون في القمر ليلة البدر، ليس دونه سحاب ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ فإنكم ترونه يوم القيامة كذلك، يجمع الله الناس فيقول من كان يعبد شيئا فليتبعه، فيتبع من كان يعبد الشمس، ويتبع من كان يعبد القمر، ويتبع من كان يعبد الطواغيت، وتبقى هذه الأمة فيها منافقوها، فيأتيهم الله في غير الصورة التي يعرفون فيقول أنا ربكم‏.‏ فيقولون نعوذ بالله منك، هذا مكاننا حتى يأتينا ربنا، فإذا أتانا ربنا عرفناه فيأتيهم الله في الصورة التي يعرفون فيقول أنا ربكم‏.‏ فيقولون أنت ربنا، فيتبعونه ويضرب جسر جهنم ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فأكون أول من يجيز، ودعاء الرسل يومئذ اللهم سلم سلم، وبه كلاليب مثل شوك السعدان، أما رأيتم شوك السعدان ‏\"‏‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ فإنها مثل شوك السعدان، غير أنها لا يعلم قدر عظمها إلا الله، فتخطف الناس بأعمالهم، منهم الموبق، بعمله ومنهم المخردل، ثم ينجو، حتى إذا فرغ الله من القضاء بين عباده، وأراد أن يخرج من النار من أراد أن يخرج، ممن كان يشهد أن لا إله إلا الله، أمر الملائكة أن يخرجوهم، فيعرفونهم بعلامة آثار السجود، وحرم الله على النار أن تأكل من ابن آدم أثر السجود، فيخرجونهم قد امتحشوا، فيصب عليهم ماء يقال له ماء الحياة، فينبتون نبات الحبة في حميل السيل، ويبقى رجل مقبل بوجهه على النار فيقول يا رب قد قشبني ريحها وأحرقني ذكاؤها، فاصرف وجهي عن النار فلا يزال يدعو الله‏.‏ فيقول لعلك إن أعطيتك أن تسألني غيره‏.‏ فيقول لا وعزتك لا أسألك غيره‏.‏ فيصرف وجهه عن النار، ثم يقول بعد ذلك يا رب قربني إلى باب الجنة‏.‏ فيقول أليس قد زعمت أن لا تسألني غيره، ويلك ابن آدم ما أغدرك‏.‏ فلا يزال يدعو‏.‏ فيقول لعلي إن أعطيتك ذلك تسألني غيره‏.‏ فيقول لا وعزتك لا أسألك غيره‏.‏ فيعطي الله من عهود ومواثيق أن لا يسأله غيره، فيقربه إلى باب الجنة، فإذا رأى ما فيها سكت ما شاء الله أن يسكت، ثم يقول رب أدخلني الجنة‏.‏ ثم يقول أوليس قد زعمت أن لا تسألني غيره، ويلك يا ابن آدم ما أغدرك فيقول يا رب لا تجعلني أشقى خلقك‏.‏ فلا يزال يدعو حتى يضحك، فإذا ضحك منه أذن له بالدخول فيها، فإذا دخل فيها قيل تمن من كذا‏.‏ فيتمنى، ثم يقال له تمن من كذا‏.‏ فيتمنى حتى تنقطع به الأماني فيقول له هذا لك ومثله معه ‏\"‏‏.‏ قال أبو هريرة وذلك الرجل آخر أهل الجنة دخولا‏.‏",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 161
			}
		}
	]
}