{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6982,
			"arabicnumber": 6982,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب،‏.‏ وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، حدثنا معمر، قال الزهري فأخبرني عروة، عن عائشة ـ رضى الله عنها ـ أنها قالت أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصادقة في النوم، فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح، فكان يأتي حراء فيتحنث فيه ـ وهو التعبد ـ الليالي ذوات العدد، ويتزود لذلك ثم يرجع إلى خديجة فتزوده لمثلها، حتى فجئه الحق وهو في غار حراء فجاءه الملك فيه فقال اقرأ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ فقلت ما أنا بقارئ فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني‏.‏ فقال اقرأ‏.‏ فقلت ما أنا بقارئ‏.‏ فأخذني فغطني الثانية حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ‏.‏ فقلت ما أنا بقارئ‏.‏ فغطني الثالثة حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ باسم ربك الذي خلق ‏\"‏‏.‏ حتى بلغ ‏{‏ما لم يعلم‏}‏ فرجع بها ترجف بوادره حتى دخل على خديجة فقال ‏\"‏ زملوني زملوني ‏\"‏‏.‏ فزملوه حتى ذهب عنه الروع فقال ‏\"‏ يا خديجة ما لي ‏\"‏‏.‏ وأخبرها الخبر وقال ‏\"‏ قد خشيت على نفسي ‏\"‏‏.‏ فقالت له كلا أبشر، فوالله لا يخزيك الله أبدا، إنك لتصل الرحم، وتصدق الحديث، وتحمل الكل، وتقري الضيف، وتعين على نوائب الحق‏.‏ ثم انطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى بن قصى ـ وهو ابن عم خديجة أخو أبيها، وكان امرأ تنصر في الجاهلية، وكان يكتب الكتاب العربي فيكتب بالعربية من الإنجيل ما شاء الله أن يكتب، وكان شيخا كبيرا قد عمي ـ فقالت له خديجة أى ابن عم اسمع من ابن أخيك‏.‏ فقال ورقة ابن أخي ماذا ترى فأخبره النبي صلى الله عليه وسلم ما رأى فقال ورقة هذا الناموس الذي أنزل على موسى، يا ليتني فيها جذعا أكون حيا، حين يخرجك قومك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أومخرجي هم ‏\"‏‏.‏ فقال ورقة نعم، لم يأت رجل قط بما جئت به إلا عودي، وإن يدركني يومك أنصرك نصرا مؤزرا‏.‏ ثم لم ينشب ورقة أن توفي، وفتر الوحى فترة حتى حزن النبي صلى الله عليه وسلم فيما بلغنا حزنا غدا منه مرارا كى يتردى من رءوس شواهق الجبال، فكلما أوفى بذروة جبل لكى يلقي منه نفسه، تبدى له جبريل فقال يا محمد إنك رسول الله حقا‏.‏ فيسكن لذلك جأشه وتقر نفسه فيرجع، فإذا طالت عليه فترة الوحى غدا لمثل ذلك، فإذا أوفى بذروة جبل تبدى له جبريل فقال له مثل ذلك‏.‏ قال ابن عباس ‏{‏فالق الإصباح‏}‏ ضوء الشمس بالنهار، وضوء القمر بالليل‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 1
			}
		}
	]
}