{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "حدثني مؤمل بن هشام أبو هشام، حدثنا إسماعيل بن إبراهيم، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه ‏\"‏ هل رأى أحد منكم من رؤيا ‏\"‏‏.‏ قال فيقص عليه من شاء الله أن يقص، وإنه قال ذات غداة ‏\"‏ إنه أتاني الليلة آتيان، وإنهما ابتعثاني، وإنهما قالا لي انطلق‏.‏ وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه فيتهدهد الحجر ها هنا، فيتبع الحجر فيأخذه، فلا يرجع إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏.‏ قال قلت لهما سبحان الله ما هذان قال قالا لي انطلق ـ قال ـ فانطلقنا فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقى وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه وعينه إلى قفاه ـ قال وربما قال أبو رجاء فيشق ـ قال ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه فيفعل مثل ما فعل المرة الأولى‏.‏ قال قلت سبحان الله ما هذان قال قالا لي انطلق‏.‏ فانطلقنا فأتينا على مثل التنور ـ قال فأحسب أنه كان يقول ـ فإذا فيه لغط وأصوات ـ قال ـ فاطلعنا فيه، فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم، فإذا أتاهم ذلك اللهب ضوضوا ـ قال ـ قلت لهما ما هؤلاء قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على نهر ـ حسبت أنه كان يقول ـ أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسبح ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة فيفغر له فاه فيلقمه حجرا فينطلق يسبح، ثم يرجع إليه، كلما رجع إليه فغر له فاه فألقمه حجرا ـ قال ـ قلت لهما ما هذان قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على رجل كريه المرآة كأكره ما أنت راء رجلا مرآة، وإذا عنده نار يحشها ويسعى حولها ـ قال ـ قلت لهما ما هذا قال قالا لي انطلق انطلق‏.‏ فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهرى الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط ـ قال ـ قلت لهما ما هذا ما هؤلاء قال قالا لي انطلق انطلق‏.‏ ـ قال ـ فانطلقنا فانتهينا إلى روضة عظيمة لم أر روضة قط أعظم منها ولا أحسن‏.‏ ـ قال ـ قالا لي ارق فيها‏.‏ قال فارتقينا فيها فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا ففتح لنا، فدخلناها فتلقانا فيها رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء ـ قال ـ قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ قال وإذا نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه، ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة ـ قال ـ قالا لي هذه جنة عدن، وهذاك منزلك‏.‏ قال فسما بصري صعدا، فإذا قصر مثل الربابة البيضاء ـ قال ـ قالا هذاك منزلك‏.‏ قال قلت لهما بارك الله فيكما، ذراني فأدخله‏.‏ قالا أما الآن فلا وأنت داخله‏.‏ قال قلت لهما فإني قد رأيت منذ الليلة عجبا، فما هذا الذي رأيت قال قالا لي أما إنا سنخبرك، أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق، وأما الرجال والنساء العراة الذين في مثل بناء التنور فإنهم الزناة والزواني‏.‏ وأما الرجل الذي أتيت عليه يسبح في النهر ويلقم الحجر، فإنه آكل الربا، وأما الرجل الكريه المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة فإنه إبراهيم صلى الله عليه وسلم وأما الولدان الذين حوله فكل مولود مات على الفطرة ‏\"‏‏.‏ قال فقال بعض المسلمين يا رسول الله وأولاد المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأولاد المشركين‏.‏ وأما القوم الذين كانوا شطر منهم حسنا وشطر منهم قبيحا، فإنهم قوم خلطوا عملا صالحا وآخر سيئا، تجاوز الله عنهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}