{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قلنا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس والقمر إذا كانت صحوا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ فإنكم لا تضارون في رؤية ربكم يومئذ، إلا كما تضارون في رؤيتهما ـ ثم قال ـ ينادي مناد ليذهب كل قوم إلى ما كانوا يعبدون‏.‏ فيذهب أصحاب الصليب مع صليبهم، وأصحاب الأوثان مع أوثانهم، وأصحاب كل آلهة مع آلهتهم حتى يبقى من كان يعبد الله من بر أو فاجر، وغبرات من أهل الكتاب، ثم يؤتى بجهنم تعرض كأنها سراب فيقال لليهود ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد فما تريدون قالوا نريد أن تسقينا، فيقال اشربوا فيتساقطون في جهنم ثم يقال للنصارى ما كنتم تعبدون فيقولون كنا نعبد المسيح ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد، فما تريدون فيقولون نريد أن تسقينا‏.‏ فيقال اشربوا‏.‏ فيتساقطون حتى يبقى من كان يعبد الله من بر أو فاجر فيقال لهم ما يحبسكم وقد ذهب الناس فيقولون فارقناهم ونحن أحوج منا إليه اليوم وإنا سمعنا مناديا ينادي ليلحق كل قوم بما كانوا يعبدون‏.‏ وإنما ننتظر ربنا ـ قال ـ فيأتيهم الجبار‏.‏ فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فلا يكلمه إلا الأنبياء فيقول هل بينكم وبينه آية تعرفونه فيقولون الساق‏.‏ فيكشف عن ساقه فيسجد له كل مؤمن، ويبقى من كان يسجد لله رياء وسمعة، فيذهب كيما يسجد فيعود ظهره طبقا واحدا، ثم يؤتى بالجسر فيجعل بين ظهرى جهنم ‏\"‏‏.‏ قلنا يا رسول الله وما الجسر قال ‏\"‏ مدحضة مزلة، عليه خطاطيف وكلاليب وحسكة مفلطحة، لها شوكة عقيفاء تكون بنجد يقال لها السعدان، المؤمن عليها كالطرف وكالبرق وكالريح وكأجاويد الخيل والركاب، فناج مسلم وناج مخدوش ومكدوس في نار جهنم، حتى يمر آخرهم يسحب سحبا، فما أنتم بأشد لي مناشدة في الحق، قد تبين لكم من المؤمن يومئذ للجبار، وإذا رأوا أنهم قد نجوا في إخوانهم يقولون ربنا إخواننا كانوا يصلون معنا ويصومون معنا ويعملون معنا‏.‏ فيقول الله تعالى اذهبوا فمن وجدتم في قلبه مثقال دينار من إيمان فأخرجوه‏.‏ ويحرم الله صورهم على النار، فيأتونهم وبعضهم قد غاب في النار إلى قدمه وإلى أنصاف ساقيه، فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال نصف دينار فأخرجوه‏.‏ فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال ذرة من إيمان فأخرجوه‏.‏ فيخرجون من عرفوا ‏\"‏‏.‏ قال أبو سعيد فإن لم تصدقوني فاقرءوا ‏{‏إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها‏}‏ ‏\"‏ فيشفع النبيون والملائكة والمؤمنون فيقول الجبار بقيت شفاعتي‏.‏ فيقبض قبضة من النار فيخرج أقواما قد امتحشوا، فيلقون في نهر بأفواه الجنة يقال له ماء الحياة، فينبتون في حافتيه كما تنبت الحبة في حميل السيل، قد رأيتموها إلى جانب الصخرة إلى جانب الشجرة، فما كان إلى الشمس منها كان أخضر، وما كان منها إلى الظل كان أبيض، فيخرجون كأنهم اللؤلؤ، فيجعل في رقابهم الخواتيم فيدخلون الجنة فيقول أهل الجنة هؤلاء عتقاء الرحمن أدخلهم الجنة بغير عمل عملوه ولا خير قدموه‏.‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		}
	]
}