{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"4": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "Narrated AbuAyyash az-Zuraqi: We accompanied the Messenger of Allah (ﷺ) at Usfan, and Khalid ibn al-Walid was the chief of unbelievers. We offered the noon prayer. Thereupon, the unbelievers said: We suffered from negligence; we became careless. We should have attacked them while they were praying. Thereupon the verse was revealed, relating to the shortening of the prayer (in time of danger) between the noon and afternoon (prayer). When the time of the afternoon prayer came, the Messenger of Allah (ﷺ) stood facing the qiblah, and the unbelievers were standing in front of him. The people stood in a row behind the Messenger of Allah (ﷺ) and there was another row behind this row. The Messenger of Allah (ﷺ) bowed and all of them bowed. He then prostrated and also the row near him prostrated. The other people in the second row remained standing and stood guard over them. When they performed two prostrations and stood up, those who were behind them prostrated. The people in the front row near him then stepped backward taking the place of the people in the second row and the second row took the place of the first row. The Messenger of Allah (ﷺ) then bowed and all of them bowed together. Then he and the row near him prostrated themselves. The other people in the second row remained standing and stood guard over them. When the Messenger of Allah (ﷺ) and the row near him (i.e. the front row) were seated, the people in the second row behind them prostrated themselves. Then all of them were seated. (He (the Prophet) then uttered the salutation upon all of them. He prayed in his manner at Usfan as well as at the territory of Banu Sulaym. Abu Dawud said: This tradition has been narrated by Ayyub and Hisham from Abu al-Zubair on the authority of Jabir to the same effect from the Prophet (ﷺ). Similarly, this has been transmitted by Dawud b. Husain from 'Ikrimah, on the authority of Ibn 'Abbas. This has also been reported by 'Abd al-Malik, from 'Ata' from Jabir in like manner. This has also been narrated by Qatadah from al-Hasan from Hittan on the authority of Abu Musa in a similar way. Similarly, this has been reported by 'Ikrimah b. Khalid from Mujahid from the Prophet (ﷺ). This has also been reported by Hisham b. 'Urwah from his father from the Prophet (ﷺ). This is the opinion of al-Thawri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		}
	]
}