{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "Narrated Kuraib, the client of Ibn 'Abbas:That 'Abd Allah b. Abbas, 'Abd al-Rahman b. Azhar and al-Miswar b. Makhramah sent him to 'Aishah, wife of the Prophet (ﷺ). They said: Convey our regards to her from all of us and ask her about the two rak'ahs after the 'Asr prayer, and tell her that we have been informed that she prays them, and we are told that the Messenger of Allah (ﷺ) prohibited them. I entered upon her and told her that for which they had sent me to her. She said: Ask Umm Salamah. I returned to them (Ibn 'Abbas and others) and informed them about her opinion. They sent me back to Umm Salamah with the same mission for which they had sent me to 'Aishah. Umm Salamah said: I heard the Messenger of Allah (ﷺ) prohibiting them, but later on I saw him praying them. When he prayed them, he had offered the 'Asr prayer. He then came to me while a number of women from Banu Haram from the Ansar were sitting with me. He prayed these two rak'ahs. I sent a slave girl to him and I told her: Stand beside him and tell him that Umm Salamah has asked: Messenger of Allah (ﷺ), I heard you prohibiting these two rak'ahs (after the afternoon prayer) but I see you praying them yourself. If he makes a sign with his hand, step backward from him. The slave girl did so. When he finished prayer, he said: O daughter of Abu Umayyah, you asked about the praying of two rak'ahs after the 'Asr prayer, in fact, some people of 'Abd al-Qais has come to me with the news that their people had embraced Islam. They hindered me from praying the two rak'ahs after Zuhr prayer. It is those two rak'ahs (which I offered after the 'Asr prayer)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		}
	]
}