{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "Narrated Aisha, Ummul Mu'minin: Zurarah ibn Awfa said that Aisha was asked about the midnight prayer of the Messenger of Allah (ﷺ). She said: He used to offer his night prayer in congregation and then return to his family (in his house) and pray four rak'ahs. Then he would go to his bed and sleep, but the water for his ablution was placed covered near his head and his tooth-stick was also kept there until Allah awakened him at night. He then used the tooth-stick, performed ablution perfectly then came to the place of prayer and would pray eight rak'ahs, in which he would recite Surah al-Fatihah, and a surah from the Qur'an as Allah willed. He would not sit during any of them but sit after the eighth rak'ah, and would not utter the salutation, but recite (the Qur'an) during the ninth rak'ah. Then he would sit and supplicate as long as Allah willed, and beg Him and devote his attention to Him; He would utter the salutation once in such a loud voice that the inmates of the house were almost awakened by his loud salutation. He would then recite Surah al-Fatihah while sitting, bow while sitting, and then recite the Qur'an during the second rak'ah, and would bow and prostrate while sitting. He would supplicate Allah as long as He willed, then utter the salutation and turn away. This amount of prayer of the Messenger of Allah (ﷺ) continued till he put a weight. During that period he retrenched two rak'ahs from nine and began to pray six and seven rak'ahs standing and two rak'ahs sitting. This continued till he died",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		}
	]
}