{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "Narrated Laqit ibn Sabirah: I was the leader of the delegation of Banu al-Muntafiq or (the narrator doubted) I was among the delegation of Banu al-Muntafiq that came to the Messenger of Allah (ﷺ). When we reached the Prophet, we did not find him in his house. We found there Aisha, the Mother of the Believers. She ordered that a dish called Khazirah should be prepared for us. It was then prepared. A tray containing dates was then presented to us. (The narrator Qutaybah did not mention the word qina', tray). Then the Messenger of Allah (ﷺ) came. He asked: Has anything been served to you or ordered for you? We replied: Yes, Messenger of Allah. While we were sitting in the company of the Messenger of Allah (ﷺ) we suddenly saw that a shepherd was driving a herd of sheep to their fold. He had with him a newly-born lamb that was crying. He (the Prophet) asked him: What did it bear, O so and so? He replied: A ewe. He then said: Slaughter for us in its place a sheep. Do not think that we are slaughtering it for you. We have one hundred sheep and we do not want their number to increase. Whenever a ewe is born, we slaughter a sheep in its place. (The narrator says that the Prophet (ﷺ) used the word la tahsabanna, do not think). I (the narrator Laqit) then said: Messenger of Allah, I have a wife who has something (wrong) in her tongue, i.e. she is insolent. He said: Then divorce her. I said: Messenger of Allah, she had company with me and I have children from her. He said: Then ask her (to obey you). If there is something good in her, she will do so (obey); and do not beat your wife as you beat your slave-girl. I said: Messenger of Allah, tell me about ablution. He said: Perform ablution in full and make the fingers go through the beard and snuff with water well except when you are fasting",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		}
	]
}