{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"8": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) used to say at the end of his witr: \"O Allah, I seek refuge in Thy good pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thy mercy from Thy wrath. I cannot reckon the praise due to Thee. Thou art as Thou hast praised Thyself.\" Abu Dawud said: Hisham is the earliest teacher of Hammad. Yahya b. Ma'in said: No one is reported to have narrated traditions form him except Hammad b. Salamah. Abu Dawud said: Ubayy b. Ka'b said: The Messenger of Allah (ﷺ) recited supplication in the witr before bowing. Abu Dawud said: This tradition has also been narrated by 'Isa b. Yunus through a different chain of narrators from Ubayy b. Ka'b. He also narrated it through a different chain of narrators on the authority of Ubayy b. Ka'b that the Messenger of Allah (ﷺ) recited the supplication in the witr before bowing. Abu Dawud said: The chain of narrators of the tradition of Sa'id from Qatadah goes: Yazid b. Zurai' narrated from Sa'id, from Qatadah, from 'Azrah, from Sa'id b. 'Abd al-Rahman b. Abza, on the authority of his father, from the Prophet (ﷺ). This version does not mention the supplication and the name of Ubayy. This tradition has also been narrated by 'Abd al-A'la and Muhammad b. Bishr al-'Abdi. He heard the traditions from 'Isa b. Yunus at Kufah. They did not mention the supplication in their version. This tradition has also been narrated by Hisham al-Dastuwa'i and Shu'bah from Qatadah. They did not mention the supplication in their version. The tradition of Zubaid has been narrated by Sulaiman al-A'mash, Shu'bah, 'Abd al-Malik b. Abi Sulaiman, and Jarir b. Hazim; all of them narrated on the authority of Zubaid. None of them mention the supplication in his version, except in the tradition transmitted by Hafs b. Ghiyath from Mis'ar from Zubaid; he narrated in his version that he (the Prophet) recited supplication before bowing. Abu Dawud said: This version of tradition is not well know. There is doubt that Hafs might have narrated this tradition from some other narrator than Mis'ar. Abu Dawud said: It is reported that Ubayy (b. Ka'b) used to recited the supplication )in the witr) in the second half of Ramadan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		}
	]
}