{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Narrated Hammad : I took a letter from Thumamah bin ‘Abd Allah bin Anas. He presumed that Abu Bakr had written it for Anas when he sent him (to Al Bahrain) as a collector of zakat. This (letter) was stamped with the stamp of the Messenger of Allah(ﷺ) and was written by Abu Bakr for him(Anas). This letter goes “This is the obligatory sadaqah(zakat) which the Messenger of Allah(ﷺ) imposed on Muslims which Allah commanded his Prophet(ﷺ) to impose. Those Muslims who are asked for the proper amount must give it, but those who are asked for more than that must not give it. For less than twenty five Camels a goat is to be given for every five Camels. When they reach twenty five to thirty five, a she Camel in her second year is to be given. If there is no she Camel in her second year, a male Camel in its third year is to be given. When they reach thirty six to forty five, a she Camel in her third year is to be given. When they reach forty six to sixty , a she Camel in her fourth year which is ready to be covered by a stallion is to be given. When they reach sixty one to seventy five, a she Camel in her fifth year is to be given. When they reach seventy six to ninety, two she Camel in their third year are to be given. When they reach ninety one to a hundred and twenty, two she Camels in their fourth year are ready to be covered by a stallion are to be given. When they exceed a hundred and twenty, a she Camel in her third year is to be given for every forty and a she Camel in her fourth year for every fifty(Camels). In case the ages of the Camel vary in the payment of obligatory sadaqah(zakat) If anyone whose Camels reach the number on which a she Camel in her fifth year is payable does not possess one but possess one in her fourth year, that will be accepted from him along with two goats if he can conveniently give them, or else twenty dirhams. If anyone whose Camels reach the number on which a she Camel in her fourth year is payable does not possess but possesses one in her fifth year, that will be accepted from him, and the collector must give him twenty dirhams or two goats. If anyone whose Camels reach the number on which a she Camel in her fourth year is payable possesses only one in her third year, that will be accepted from him.” Abu Dawud said From here I could not retain accurately from Musa as I liked “And he must give along with it two goats if he can conveniently give them, or else twenty dirhams. If anyone whose Camels reach the number on which a she Camel in her third year is payable possesses only one in her fourth year, that will be accepted from him.” Abu Dawud said (I was doubtful) up to here, and retained correctly onward “and the collector must give him twenty dirhams or two goats. If anyone whose Camels reach the number on which a she Camel in her third year is payable does not possess one but possesses one in her second year, that will be accepted from him, but he must give two goats or twenty dirhams. Anyone whose Camels reach the number on which a she Camel in her second year is payable does not possess one but possesses a male Camel in its third year, that will be accepted from him, and nothing extra will be demanded along with it. If anyone possesses only four Camels, no zakat will be payable on them unless their owner wishes. If the numbers of the pasturing goats reach forty to one hundred and twenty, one goat is to be given. Over one hundred and twenty up to two hundred, two goats are to be given. If they exceed two hundred reaching three hundred, three goats are to be given. If they exceed three hundred, a goat is to be for every hundred. An old sheep, one with a defect in the eye, or a male goat is not to be accepted as sadaqah (zakat) unless the collector wishes. Those which are in separate flocks are not to be brought together and those which are in one flock are not to be separated from fear of sadaqah(zakat). Regarding what belongs to two partners, they can make claims for restitution from one another with equity, If a man’s pasturing animals are less than forty, no sadaqah(zakat) is due on them unless their owner wishes. On sliver dirhams a fortieth is payable, but if there are only a hundred and ninety, nothing is payable unless their owner wishes.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		}
	]
}