{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Al-Harith al-A'war reported from Ali. Zuhayr said:I think, the Prophet (ﷺ) said: \"Pay a fortieth. A dirham is payable on every forty, but you are not liable for payment until you have accumulated two hundred dirhams. When you have two hundred dirhams, five dirhams are payable, and that proportion is applicable to larger amounts. \"Regarding sheep, for every forty sheep up to one hundred and twenty, one sheep is due. But if you possess only thirty-nine, nothing is payable on them.\" He further narrated the tradition about the sadaqah (zakat) on sheep like that of az-Zuhri. \"Regarding cattle, a yearling bull calf is payable for every thirty, and a cow in her third year for forty, and nothing is payable on working animals. Regarding (the zakat on) camels, he mentioned the rates that az-Zuhri mentioned in his tradition. He said: \"For twenty-five camels, five sheep are to be paid. If they exceed by one, a she-camel in her second year is to be given. If there is no she-camel in her second year, a male camel in its third year is to be given, up to thirty-five. If they exceed by one a she-camel in her third year is to be given, up to forty-five. If they exceed by one, a she-camel in her fourth year which is ready to be covered by a bull-camel is to be given.\" He then transmitted the rest of the tradition like that of az-Zuhri. He continued: If they exceed by one, i.e. they are ninety-one to hundred and twenty, two she-camels in their fourth year, which are ready to be covered by a bull-camel, are to be given. If there are more camels than that, a she-camel in her fourth year is to be given for every fifty. Those which are in one flock are not to be separated, and those which are separate are not to be brought together. An old sheep, one with a defect in the eye, or a billy goat is not to be accepted as a sadaqah unless the collector is willing. As regards agricultural produce, a tenth is payable on that which is watered by rivers or rain, and a twentieth on that which is watered by draught camels.\" The version of Asim and al-Harith says: \"Sadaqah (zakat) is payable every year.\" Zuhayr said: I think he said \"Once a year\". The version of Asim has the words: \"If a she-camel in her second year is not available among the camels, nor is there a bull-camel in its third year, ten dirhams or two goats are to be given",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		}
	]
}