{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "Abu Hurairah reported that Messenger of Allah (SWAS) as saying If any owner of treasure (gold and silver) does not pay what is due on it, Allah will make it heated in the Hell fire on the Day of Judgment, and his side, forehead and back will be cauterized with it until Allah gives His Judgment among mankind during a day whose extent will be fifty thousand years of your count and he sees whether his path is to take him to Paradise or to Hell. If any owner does not pay zakat on them, the sheep wilkl appear on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns. As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell. If any owner of camels does not pay what is due on them, they will appear in on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns. As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		}
	]
}