{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "Ibn Shihab said “’Urwah bin Al Zubair asked A’ishah , wife of the Prophet(ﷺ) about the Qur’anic verse “And if ye fear that ye will not deal fairly by the orphans, marry of the women, who seem good to you.” She said “O my nephew, this means the female orphan who is under the protection of her guardian and she holds a share in his property and her property and beauty attracts him; so her guardian intends to marry her without doing justice to her in respect of her dower and he gives her the same amount of dower as others give her. They (i.e., the guardians) were prohibited to marry them except that they do justice to them and pay them their maximum customary dower and they were asked to marry women other than them (i.e., the orphans) who seem good to them. ‘Urwah reported that A’ishah said “The people then consulted the Apostle of Allaah(ﷺ) about women after revelation of this verse. Thereupon Allaah the Exalted sent down the verse “They consult thee concerning women. Say Allaah giveth you decree concerning them and the scripture which hath been recited unto you(giveth decree) concerning female orphans unto whom you give not that which is ordained for them though you desire to marry them. “ She said “The mention made by Allaah about the Scripture recited to them refers to the former verse in which Allaah has said “And if ye fear that ye will not deal fairly by the orphans, marry of the women, who seem good to you.” A’ishah said “The pronouncement of Allaah , the Exalted in the latter verse “though you desire to marry them” means the disinterest of one of you in marrying a female orphan who was under his protection, but she said little property and beauty. So they were prohibited to marry them for their interest in the property and beauty of the female orphans due to their disinterest in themselves except that they do justice )to them). The narrator Yunus said “Rabi’ah said explain the Qur’anic verse “And if ye fear that ye will not deal fairly by the orphans” means “Leave them if you fear (that you will not do justice to them), for I have made four women lawful for you.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		}
	]
}