{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "Narrated Maymunah, daughter of Kardam: I went out along with my father during the hajj performed by the Messenger of Allah (ﷺ). I saw the Messenger of Allah (ﷺ). My father came near him; he was riding his she-camel. He stopped there and listened to him. He had a whip like the whip of the teachers. I heard the Bedouin and the people saying: Keep away from the whip. My father came up to him. He caught hold of his foot and acknowledged him (his Prophethood). He stopped and listened to him. He then said: I participated in the army of Athran (in the pre-Islamic days). The narrator, Ibn al-Muthanna, said: Army of Gathran. Tariq ibn al-Muraqqa' said: Who will give me a lance and get a reward? I asked: What is its reward? He replied: I shall marry him to my first daughter born to me. So I gave him my lance and then disappeared from him till I knew that a daughter was born to him and she came of age. I then came to him and said: Send my wife to me. He swore that he would not do that until I fixed a dower afresh other than that agreed between me and him, and I swore that I should not give him the dower other than that I had given him before. The Messenger of Allah (ﷺ) said: How old is she now? He said: She has grown old. He said: I think you should leave her. He said: This put awe and fear into me, and I looked at the Messenger of Allah (ﷺ). When he felt this in me, he said: You will not be sinful, nor will your companion be sinful. Abu Dawud said: Qatir means old age",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		}
	]
}