{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2185,
			"arabicnumber": 2185,
			"text": "Abdur Rahman ibn Ayman, the client of Urwah, asked Ibn Umar and Abu al-Zubayr was was listening:What do you think if a man divorces his wife while she is menstruating? He said: Abdullah ibn Umar divorced his wife while she was menstruating during the time of the Messenger of Allah (ﷺ).So Umar asked the Messenger of Allah (ﷺ) saying: Abdullah ibn Umar divorced his wife while she was menstruating. Abdullah said: He returned her to me and did not count it (the pronouncement) anything. He said: When she is purified, he may divorce her or keep her with him. Ibn Umar said: The Prophet (ﷺ) recited the Qur'anic verse: O Prophet, when you divorce women, divorce them in the beginning of their waiting period.\" Abu Dawud said: This tradition has been narrated by Yunus b. Jubair, Anas b. Sirin b. Jubair, Zaid b. Aslam, Abu al-Zubair and Mansur from Abu Wa'il on the authority of Ibn 'Umar. They all agreed on the theme that the Prophet (ﷺ) commanded him to take her back (and keep her) till she was purified. Then if he desired, he might divorce her or keep her with him if he wanted to do so. The version narrated by al-Zuhri from Salim from Nafi' on the authority of Ibn 'Umar has: The Prophet (ﷺ) commanded him to take her back (and keep her) till she is purified, and then has menstrual discharge, and then she is purified. Then if he desires, he may divorce her and if he desires he may keep her. Abu Dawud said: A version like that of Nafi' and al-Zuhri has also been transmitted by 'Ata al-Khurasani from al-Hasan on the authority of Ibn 'Umar. All the versions of this tradition contradict the one narrated by Abu al-Zubair",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		}
	]
}