{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"text": "Mujahid said “I was with Ibn ‘Abbas”. A man came to him and said that he divorced his wife by three pronouncements. I kept silence and thought that he was going to restore het to him. He then said “A man goes and commits a foolish act and then says “O, Ibn ‘Abbas! Alaah has said “And for those who fear Allaah, He (ever) prepares a way out.” Since you did not keep duty to Allaah I do not find a way out for you. You disobeyed your Lord and your wife was separated from you. Allaah has said “O Prophet! When you divorce women divorce them in the beginning of their waiting period.” Abu Dawud said “This tradition has been transmitted by Humaid Al A’raj and by others from Mujahid on the authority of Ibn ‘Abbas. Shu’bjh narrated it from ‘Amr bin Murrah from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ayyub and Ibn ‘Jubair both narrated it from “’Ikrimah bin Khalid from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ibn Juraij narrated it from ‘Abd Al Hamid bin Rafi’ from ‘Ata from Ibn ‘Abbas. Al A’mash narrated it from Malik bin Al Harith on the authority of Ibn ‘Abbas. They all said about the divorce by three pronouncements. He allowed it and said” (Your wife) has been separated from you similar to the tradition narrated by Isma’il from Ayub from ‘Abd Allaah bin Kathir.” Abu Dawud said “Hammad bin Zaid narrated it from Ayyub from ‘Ikrimah on the authority of Ibn ‘Abbas. This version adds If he said “You are divorced three times saying in one pronouncement, it constitutes a single (divorce). Isma’il bin Ibrahim narrated it from Ayyub from ‘Ikrimah. This is his (‘Ikrimah’s) statement. He did not mention the name of Ibn ‘Abbas. He narrated it as a statement of ‘Ikrimah.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		}
	]
}