{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "Narrated Salamah ibn Sakhr al-Bayadi: I was a man who was more given than others to sexual intercourse with women. When the month of Ramadan came, I feared lest I should have intercourse with my wife, and this evil should remain with me till the morning. So I made my wife like my mother's back to me till the end of Ramadan. But one night when she was waiting upon me, something of her was revealed. Suddenly I jumped upon her. When the morning came I went to my people and informed them about this matter. I said: Go along with me to the Messenger of Allah (ﷺ). They said: No, by Allah. So I went to the Prophet (peace be upon him and informed him of the matter. He said: Have you really committed it, Salamah? I said: I committed it twice, Messenger of Allah. I am content with the Commandment of Allah, the Exalted; so take a decision about me according to what Allah has shown you. He said: Free a slave. I said: By Him Who sent you with truth, I do not possess a neck other than this: and I struck the surface of my neck. He said: Then fast two consecutive months. I said: Whatever I suffered is due to fasting. He said: Feed sixty poor people with a wasq of dates. I said: By Him Who sent you with truth, we passed the night hungry; there was no food in our house. He said: Then go to the collector of sadaqah of Banu Zurayq; he must give it to you. Then feed sixty poor people with a wasq of dates; and you and your family eat the remaining dates. Then I came back to my people, and said (to them): I found with you poverty and bad opinion; and I found with the Prophet (ﷺ) prosperity and good opinion. He has commanded me to give alms to you. Ibn al-Ala' added: Ibn Idris said: Bayadah is a sub-clan of Banu Zurayq",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		}
	]
}