{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "A’ishah wife of the Prophet (ﷺ) said “Marriage in pre Islamic times was of four kinds.” One of them was the marriage contracted by the people today. A man asked another man to marry his relative (sister or daughter) to him. He fixed the dower and married her to him. Another kind of marriage was that a man asked his wife when she became pure from menstruation to send fro so and so and have sexual intercourse with him. Her husband kept himself aloof and did not have intercourse with her till It became apparent that she was pregnant from the man who had intercourse with her. When it was manifest that she was pregnant, her husband approached her if he liked. This marriage was called istibda’(to utilize man for intercourse for a noble birth). A third kind of marriage was that a group of people less than ten in number entered upon a woman and had intercourse with her. When she conceived gave birth to a child and a number of days passed after her delivery, she sent for them. No one of them could refuse to attend and they gathered before her. She said to them “You have realized your affair. I have now given birth to a child. And this is your son. O so and so. She called the name of anyone of them she liked and the child was attributed to him. A fourth kind of marriage was that many people gathered together and entered upon a woman who did not prevent anyone who came to her. They were prostitutes. They hoisted flags at their doors which served as a sign for the one who intended to enter upon them. When she became pregnant and delivered the child , they got together before her and called for the experts of tracing relationship from physical features. They attributed the child to whom they considered and it was given to him. The child was called his son and he could not deny. When Allah sent Muhammad (ﷺ) as a Prophet, he abolished all kinds of marriages prevalent among the people of the pre Islamic times except of the Muslims practiced today",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 98
			}
		}
	]
}