{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "Narrated Sahl ibn al-Hanzaliyyah: On the day of Hunayn we travelled with the Messenger of Allah (ﷺ) and we journeyed for a long time until the evening came. I attended the prayer along with the Messenger of Allah (ﷺ). A horseman came and said: Messenger of Allah, I went before you and climbed a certain mountain where saw Hawazin all together with their women, cattle, and sheep, having gathered at Hunayn. The Messenger of Allah (ﷺ) smiled and said: That will be the booty of the Muslims tomorrow if Allah wills. He then asked: Who will be on guard tonight? Anas ibn AbuMarthad al-Ghanawi said: I shall , Messenger of Allah. He said: Then mount your horse. He then mounted his horse, and came to the Messenger of Allah (ﷺ). The Messenger of Allah said to him: Go forward to this ravine till you get to the top of it. We should not be exposed to danger from your side. In the morning the Apostle of of Allah (ﷺ) came out to his place of prayer, and offered two rak'ahs. He then said: Have you seen any sign of your horseman? They said: We have not, Messenger of Allah. The announcement of the time for prayer was then made, and while the Messenger of Allah (ﷺ) was saying the prayer, he began to glance towards the ravine. When he finished his prayer and uttered salutation, he said: Cheer up, for your horseman has come. We therefore began to look between the trees in the ravine, and sure enough he had come. He stood beside the Messenger of Allah (ﷺ), saluted him and said: I continued till I reached the top of this ravine where the Messenger of Allah (ﷺ) commanded me, and in the morning I looked down into both ravines but saw no one. The Messenger of Allah (ﷺ) asked him: Did you dismount during the night? He replied: No, except to pray or to relieve myself. The Messenger of Allah (ﷺ) said: You have ensured your entry to (Paradise). No blame will be attached to you supposing you do not work after it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		}
	]
}