{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "Sulaiman bin Buraidah reported on the authority of his father. When the Apostle of Allaah(ﷺ) appointed a Commander over an Army or a detachment, he instructed him to fear Allaah himself and consider the welfare of the Muslims who were with him. He then said “When you meet the polytheists who are your enemy, summon them tone of three things and accept whichever of them they are willing to agree to, and refrain from them. Summon them to Islam and if they agree, accept it from them and refrain from them. Then summon them to leave their territory and transfer to the abode of the Emigrants and tell them that if they do so, they will have the same rights and responsibilities as the Emigrants, but if they refuse and choose their own abode, tell them that they will be like the desert Arabs who are Muslims subject to Allaah’s jurisdiction which applies to the believers, but will have no spoil or booty unless they strive with the Muslims. If they refuse demand jizyah (poll tax) from them, if they agree accept it from them and refrain from them. But if they refuse, seek Alaah’s help and fight with them. When you invade the fortress and they (its people) offer to capitulate and have the matter referred to Allaah’s jurisdiction, do not grant this, for you do not know whether or not you will hit on Allaah’s jurisdiction regarding them. But let them capitulate and have the matter refereed to your jurisdiction and make a decision about them later on as you wish. Sufyan (bin ‘Uyainah) said thah ‘Alqamah said “I mentioned this tradition to Muqatil bin Habban, He said “Muslim narrated it to me.” Abu Dawud said “He is Ibn Haidam narrated from Al Nu’man in Muqqarin from the Prophet (ﷺ) like the tradition of Sulaiman bin Buraidah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 136
			}
		}
	]
}