{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2717,
			"arabicnumber": 2717,
			"text": "Abu Qatadah said “We went out with the Apostle of Allaah(ﷺ) in the year of Hunain. And when the armies met, the Muslims suffered a reverse. I saw one of the polytheists prevailing over a Muslim, so I went round him till I came to him from behind and struck him with my sword at the vein between his neck and shoulder. He came towards me and closed with me, so that I felt death was near, but he was overtaken by death and let me go. I then caught upon on “Umar bin Al Khattab and said to him “What is the matter with the people?” He said “It is what Allaah has commanded. Then the people returned and the Apostle of Allaah(ﷺ)sat down and said “If anyone kills a man and can prove it, he will get his spoil. I stood up and said “Who will testify for me? I then sat down.” He said again “If anyone kills a man and can prove it, he will get his spoil. I stood up and said “Who will testify for me? I then sat down.” He then said the same for the third time. I then stood up. The Apostle of Allaah(ﷺ) said “What is the matter with you, Abu Qatadah? I told him the story. A man from the people said “He has spoken the truth, and I have this spoil with me, so make him agreeable (to take something in exchange). Abu Bakr said “In that case I swear by Allaah that he must not do so. One of the Allaah’s heroes does not fight for Allaah and his Apostle and then give you his spoil. The Apostle of Allaah(ﷺ) said “He has spoken the truth, hand it over to him. Abu Qatadah said “he handed it over to me, I sold the coat of mail and brought a garden among Banu Salamh. This was the first property I acquired in the Islamic period",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 241
			}
		}
	]
}