{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "‘Awf bin malik Al Ashja’I said “I went out with Zaid bin Harith in the battle of Mutah. For the reinforcement of the Muslim army a man from the people of Yemen accompanied me. He had only his sword with him. A man from the Muslims slaughtered a Camel. The man for the reinforcement asked him for a part of its skin which he gave him. He made it like the shape of a shield. We went on and met the Byzantine armies. There was a man among them on a reddish horse with a golden saddle and golden weapons. This Byzantinian soldiers began to attack the Muslims desperately. The man for reinforcement sat behind a rock for (attacking) him. He hamstrung his horse and overpowered him and then killed him. He took his horse and weapons. When Allah, Most High, bestowed victory on the Muslims. Khalid bin Al Walid sent for him and took his spoils. ‘Awf said “I came to him and said “Khalid, do you know that the Apostle of Allaah(ﷺ) had decided to give spoils to the killer? He said “Yes, I thought it abundant. I said “You should return it to him, or I shall tell you about it before the Apostle of Allaah(ﷺ). But he refused to return it. ‘Awf said “We then assembled with the Apostle of Allaah(ﷺ). I told him the story of the man of reinforcement and what Khalid had done. The Apostle of Allaah(ﷺ) said “Khalid, what made you do the work you have done?” He said “Apostle of Allaah(ﷺ), I considered it to be abundant. The Apostle of Allaah(ﷺ) said “Khalid, return it to him what you have taken from him.” ‘Awf said “I said to him “here you are, Khalid. Did I not keep my word? The Apostle of Allaah(ﷺ) said “What is that? I then informed him.” He said “The Apostle of Allaah(ﷺ) became angry and said “Khalid, do not return it to him. Are you going to leave my commanders? You may take from them what is best for you and eave to them what is worst",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 243
			}
		}
	]
}