{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 286,
			"arabicnumber": 286,
			"text": "Narrated Fatimah daughter of AbuHubaysh: Urwah ibn az-Zubayr reported from Fatimah daughter of AbuHubaysh that her blood kept flowing, so the Prophet (ﷺ) said to her: When the blood of the menses comes, it is black blood which can be recognised; so when that comes, refrain from prayer; but when a different type of blood comes, perform ablution and pray, for it is (due only to) a vein. Abu Dawud said: Ibn al-Muthanna narrates this tradition from his book on the authority of Ibn 'Adi in a similar way. Later on he transmitted it to us from his memory: Muhammad b. 'Amr reported to us from al-Zuhri from 'Urwah on the authority of 'Aishah who said: Fatimah used to have her blood flowing. He then reported the tradition conveying the same meaning. Abu Dawud said: Anas b. Sirin reported from Ibn 'Abbas about the woman who has a prolonged flow of blood. He said: If she sees thick blood, she should not pray; if she finds herself purified even for a moment, she should was an pray. Makhul said: Menses are not hidden from women. Their blood is black and thick. When it (blackness and thickness) goes away and there appears yellowness and liquidness, that is the flow of blood (from vein). She should wash and pray. Abu Dawud said: This tradition has been transmitted by Sa'id b. al-Musayyab through a different chain of narrators, saying: The woman who has a prolonged flow of blood should abandon prayer when the menstruation begins; when it is finished, she should wash and pray. Sumayy and others have also reported it from Sa'id b. al-Musayyab. This version adds: She should refrain (from prayer) during her menstrual period. Hammad b. Salamah has reported it similarly from Yahya b. Sa'id on the authority of Sa'id b. al-Musayyab. Abu Dawud said: Yunus has reported from Al-Hasan: When the bleeding of a menstruating woman extends (beyond the normal period), she should refrain (from prayer), after her menses are over, for one or two days. Now she becomes the woman who has a prolonged flow of blood. Al-Taimi reported from Qatadah: If her menstrual period is prolonged by five days, she should pray. Al-Taimi said: I kept on reducing (the number of days) until I reached two days. He said: If the period extends by two days, they will be counted from the menstrual period. When Ibn Sirin was questioned about it, he said: Women have better knowledge of that",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 286
			}
		}
	]
}