{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "Narrated Hamnah daughter of Jahsh: Hamnah said my menstruation was great in quantity and severe. So I came to the Messenger of Allah (ﷺ) for a decision and told him. I found him in the house of my sister, Zaynab, daughter of Jahsh. I said: Messenger of Allah, I am a woman who menstruates in great quantity and it is severe, so what do you think about it? It has prevented me from praying and fasting. He said: I suggest that you should use cotton, for it absorbs the blood. She replied: It is too copious for that. He said: Then take a cloth. She replied: It is too copious for that, for my blood keeps flowing. The Messenger of Allah (ﷺ) said: I shall give you two commands; whichever of them you follow, that will be sufficient for you without the other, but you know best whether you are strong enough to follow both of them. He added: This is a stroke of the Devil, so observe your menses for six or seven days, Allah alone knows which it should be; then wash. And when you see that you are purified and quite clean, pray during twenty-three or twenty-four days and nights and fast, for that will be enough for you, and do so every month, just as women menstruate and are purified at the time of their menstruation and their purification. But if you are strong enough to delay the noon (Zuhr) prayer and advance the afternoon ('Asr) prayer, to wash, and then combine the noon and the afternoon prayer; to delay the sunset prayer and advance the night prayer, to wash, and then combine the two prayers, do so: and to wash at dawn, do so: and fast if you are able to do so if possible. The Messenger of Allah (ﷺ) said: Of the two commands this is more to my liking.1 Abu Dawud said: 'Amr b. Thabit narrated from Ibn 'Aqil: Hamnah said: Of the two commands this is the one which is more to my liking.2 In this version these words were not quoted as the statement of the Prophet (ﷺ); it gives it as a statement of Hamnah. Abu Dawud said: 'Amr b. Thabit was a Rafidi. This has been said by Yahya b. Ma'in. Abu Dawud said: I heard Ahmad (b. Hanbal) say: I am doubtful about the tradition transmitted by Ibn 'Aqil",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 287
			}
		}
	]
}