{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "Ibn A’bud said, ‘Ali said to me “May I not narrate you about me and Fathimah daughter of the Apostle of Allaah(ﷺ)? She was most favorite to him of his family.” I said “Yes”. He said “She pulled the grinding stone with her hand so much that it affected her hand, she carried water in a water bag so much so that it affected the upper portion of her chest, she swept the house so much so that her clothes became dirty. The Prophet (ﷺ) acquired some slaves”. So I said “Would that you go to your father and ask him for a slave. She then came to him and found some people with him talking to him. She therefore returned. Next day she came again. He asked (her), what was your need? But she kept silence. So I said, I inform you, Apostle of Allaah(ﷺ). She pulled grinding stone so much that it affected her hand, she carried water bag so much so that it affected the upper portion of her chest. When the slaves were brought to you I asked her to come to you and to ask you for a slave to save her from the exertion she is suffering.” He said “Fear Allaah, Fathimah and perform the duty of your Lord and do the work of your family.” When you go to bed say “Glory be to Allaah” thirty three times, “Praise be to Allaah” thirty three times, “Allaah is Most Great” thirty four times. This is hundred times. That will be better for you than a servant. She said “I am pleased with Allaah, Most High and with his Apostle (ﷺ).”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		}
	]
}