{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "Narrated Amir ar-Ram: We were in our country when flags and banners were raised. I said: What is this? The (the people) said: This is the banner of the Messenger of Allah (ﷺ). So I came to him. He was (sitting) under a tree. A sheet of cloth was spread for him and he was sitting on it. His Companions were gathered around him. I sat with them. The Messenger of Allah (ﷺ) mentioned illness and said: When a believer is afflicted by illness and Allah cures him of it, it serves as an atonement for his previous sins and a warning to him for the future. But when a hypocrite becomes ill and is then cured, he is like a camel which has been tethered and then let loose by its owners, but does not know why they tethered it and why they let it loose. A man from among those around him asked: Messenger of Allah, what are illnesses? I swear by Allah, I never fell ill. The Messenger of Allah (ﷺ) said: Get up and leave us. You do not belong to our number. When we were with him, a man came to him. He had a sheet of cloth and something in his hand. He turned his attention to him and said: Messenger of Allah, when I saw you, I turned towards you. I saw a group of trees and heard the sound of fledglings. I took them and put them in my garment. Their mother then came and began to hover round my head. I showed them to her, and she fell on them. I wrapped them with my garment. They are now with me. He said: Put them away from you. So I put them away, but their mother stayed with them. The Messenger of Allah (ﷺ) said to his companions: Are you surprised at the affection of the mother for her young? They said: Yes, Messenger of Allah. He said: I swear by Him Who has sent me with the Truth, Allah is more affectionate to His servants than a mother to her young ones. Take them back put them and where you took them from when their mother should have been with them. So he took them back",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		}
	]
}