{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"22": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "Imran b. Husain said:'Adba belonged to a man of Banu 'Aqil. It used to go ahead of pligrims. The man was then captivated. He was brought in chains to the Prophet (ﷺ). The Prophet (ﷺ) was riding on a donkey with a blanket on him. He said: Muhammad, why do you arrest me and capture the one (i.e. the she-camel) which goes ahead of the pilgrims. He replied: We are arresting you on account of the crime committed by your allies Thaqid. Thaqif captivated two persons from among the Companions of the Prophet (ﷺ). He said (whatever he said) I am a Muslim, or he said: I have embraced Islam. When the Prophet (ﷺ) went ahead, he called him: O Muhammed, O Muhammed. Abu Dawud said: I learnt it from the version of the narrator Muhammad b. 'Isa. The Prophet (ﷺ) was compassionate and kind hearted. So he returned to him, and asked: What is the matter with you ? He replied: I am a Muslim. He said: Had you said it when the matter was in your hand, you would have succeeded completely. Abu Dawud said: I then returned to the version of the narrator Sulaiman (b. Harb). He said: Muhammad, I am hungry, so feed me. I am thirsty, so give me water. The Prophet (ﷺ) said: This is your need, or he said: This is his need (the narrator is doubtful). Later on the man was taken back (by Thaqif) as a ransom for the two men (of the Companions of the Prophet). The Prophet (ﷺ) retained 'Adba for his journey. The narrator said: The polytheists raided the pasturing animals of Medina and they took away 'Adba. When they took away 'Adba, they also captivated a Muslim woman. They used to leave their camels in the fields for rest at night. One night they slept and the (Muslim) woman stood up. Any camel on which she put her hand brayed until she came to 'Adba. She came to a she-camel which was docile and experienced. She then rode on her and vowed to Allah that if He saved her, she would sacrifice it. When she came to Medina, the people recognized the she-camel of the Prophet (ﷺ). The Prophet (ﷺ) was then informed about it and he sent for her. She was brought to him and she informed him about her vow. He said: It is a bad return that you have given it. Allah has not saved you, on its (back) that you now sacrifice it. A vow to do an act of disobedience must not be fulfilled, or to do something over which one has no control. Abu Dawud said: This woman was the wife of Abu Dharr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		}
	]
}