{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "Narrated Salim bin 'Abdullah b. 'Umar: Ibn 'Umar used to let out his land till it reached him that Rafi' b. Khadij al-Ansari narrated that the Messenger of Allah (ﷺ) forbade let out land. So 'Abd Allah (b. 'Umar) said: Ibn Khadij, what do you narrate from the Messenger of Allah (ﷺ) about leasing the land? Rafi' replied to 'Abd Allah b. 'Umar: I heard both of my uncles were present in the battle of Badr say, and they narrated it to the members of the family, that the Messenger of Allah (ﷺ) forbade leasing land. 'Abd Allah said: I swear by Allah, I knew that land was leased in the time of the Messenger of Allah (ﷺ). 'Abd Allah then feared that the Messenger of Allah (ﷺ) might have created something new in that matter, so he gave up leasing land. Abu Dawud said: This tradition has also been transmitted by Ayyub, 'Ubaid Allah, Kathir b. Farqad, Malik from Nafi' on the authority of Rafi' from the Prophet (ﷺ). It has also been transmitted by al-Auzai' from Hafs b. 'Inan al-Hanafi from Nafi' from Rafi' who said: I heard the Messenger of Allah (ﷺ) say: Similarly, it has been transmitted by Zaid b. Abi Unaisah from al-Hakkam from Nafi' from Ibn 'Umar that he went to Rafi' and asked: Have you heard the Messenger of Allah (ﷺ) say? He replied: Yes. Similarly, it has also been transmitted by 'Ikrimah b. 'Ammar from Abu al-Najashi, from Rafi' b. Khadij who said: I heard the Prophet (ﷺ) say. It has also been transmitted by al-Auza'i from Abu al-Najashi from Rafi' b. Khadij from his uncle Zuhair b. Rafi' from the Prophet (ﷺ). Abu Dawud said: The name of Abu al-Najashi is 'Ata b. Suhaib",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		}
	]
}