{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"31": "The Book of Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "Narrated Aisha, Ummul Mu'minin: Juwayriyyah, daughter of al-Harith ibn al-Mustaliq, fell to the lot of Thabit ibn Qays ibn Shammas, or to her cousin. She entered into an agreement to purchase her freedom. She was a very beautiful woman, most attractive to the eye. Aisha said: She then came to the Messenger of Allah (ﷺ) asking him for the purchase of her freedom. When she was standing at the door, I looked at her with disapproval. I realised that the Messenger of Allah (ﷺ) would look at her in the same way that I had looked. She said: Messenger of Allah, I am Juwayriyyah, daughter of al-Harith, and something has happened to me, which is not hidden from you. I have fallen to the lot of Thabit ibn Qays ibn Shammas, and I have entered into an agreement to purchase of my freedom. I have come to you to seek assistance for the purchase of my freedom. The Messenger of Allah (ﷺ) said: Are you inclined to that which is better? She asked: What is that, Messenger of Allah? He replied: I shall pay the price of your freedom on your behalf, and I shall marry you. She said: I shall do this. She (Aisha) said: The people then heard that the Messenger of Allah (ﷺ) had married Juwayriyyah. They released the captives in their possession and set them free, and said: They are the relatives of the Messenger of Allah (ﷺ) by marriage. We did not see any woman greater than Juwayriyyah who brought blessings to her people. One hundred families of Banu al-Mustaliq were set free on account of her. Abu dawud said: This evidence shows that a Muslim ruler may marry a slave woman himself",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		}
	]
}