{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"39": "Battles (Kitab Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "Fatimah, daughter of Qais, said:I heard the crier of the Messenger of Allah (ﷺ) calling : Assemble for the prayer. I Then came out and prayed along with the Messenger of Allah (ﷺ): When the Messenger of Allah (ﷺ) finished his prayer, he sat on the pulpit laughing, and he said : Everyone should remain where he had said his prayer. He then asked : Do you know why I have assembled you? They said: Allah and His Messenger know best. He (ﷺ) said: I did not call you together fors some alarming news or for something good. Rather, I called you all because Tamim al-Dari, a Christian, who came and accepted Islam, told me something which agrees with what I was telling you about the Dajjal. He told me that he sailed with thirty men of Lakhm and Judham and that they were storm-tossed for a month. They drew near to an island when the sun was setting. They sat in a boat nearest to them and entered the island where they were met by a very hairy beast. They said: Woe to you! What can you be ? It replied : I am the Jassasah. Go to this man in the monastery, for he is anxious to get news of you. He said : When it named a man to us we were afraid of it lest it should be a she-devil. So we went off quickly and entered the monastery, where we found a man with the hugest and strongest frame we had ever seen with his hands chained to his neck. He then narrated the rest of the tradition. He asked them about the palm-trees of Baisan and the spring of Zughar and about the unlettered prophet. He said: I am the messiah (the Antichrist) and will be soon given permission to emerge. And the Prophet (ﷺ) said: He is in the Syrian sea or the Yemeni sea: No, on the contrary, it is towards the east that he is. He said it twice and pointed his hand to the east. She said: I memorized this (tradition) from the Messenger of Allah (ﷺ), and she narrated the tradition",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		}
	]
}