{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4354,
			"arabicnumber": 4354,
			"text": "Abu Burdah said on the authority of Abu Musa :I went to the Prophet (ﷺ) while two men who were Ash’ arIs were with me. One of them was on my right and the other on my left side. Bothe of them asked him for employment. The prophet (ﷺ) was silent. He asked : What do you say Abu Musa, or ‘Abd Allah b. Qais (Abu Musa’s name)? I replied: By him who has sent you with truth, they did not inform me of what they had in their hearts, and I did not know that they would ask for an employment. He said : I have the scene before my eyes that he had his toothstick below his lip which receded. He (the prophet) said: We will never or will not put in charge of our work anyone who asks for it. But go, ye, Abu Musa, or ‘Abd Allah b. Qais. He then sent him as a Governor of the Yemen, After him he sent Muadh b. Jabal. When Muadh came to him, he said: come down , and he put a cushion for him. He saw that a man was chained with him. He asked : What is this? He replied: He was a Jew and he accepted Islam. He then converted to his religion, an evil religion. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (ﷺ). He said: Yes, be seated. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (peace be upon him). He said it three times. He then commanded for it and he was killed. Both of them then discussed the question of prayer and vigilance at night. One of them, probably Muadh, said : So far as I am concerned, I sleep and I keep vigilance: I keep vigilance and I sleep: I hope for the same reward for my sleep as for my vigilance",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		}
	]
}