{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4428,
			"arabicnumber": 4428,
			"text": "Narrated AbuHurayrah: A man of the tribe of Aslam came to the Prophet (ﷺ) and testified four times against himself that he had had illicit intercourse with a woman, while all the time the Prophet (ﷺ) was turning away from him. Then when he confessed a fifth time, he turned round and asked: Did you have intercourse with her? He replied: Yes. He asked: Have you done it so that your sexual organ penetrated hers? He replied: Yes. He asked: Have you done it like a collyrium stick when enclosed in its case and a rope in a well? He replied: Yes. He asked: Do you know what fornication is? He replied: Yes. I have done with her unlawfully what a man may lawfully do with his wife. He then asked: What do you want from what you have said? He said: I want you to purify me. So he gave orders regarding him and he was stoned to death. Then the Prophet (ﷺ) heard one of his companions saying to another: Look at this man whose fault was concealed by Allah but who would not leave the matter alone, so that he was stoned like a dog. He said nothing to them but walked on for a time till he came to the corpse of an ass with its legs in the air. He asked: Where are so and so? They said: Here we are, Messenger of Allah (ﷺ)! He said: Go down and eat some of this ass's corpse. They replied: Messenger of Allah! Who can eat any of this? He said: The dishonour you have just shown to your brother is more serious than eating some of it. By Him in Whose hand my soul is, he is now among the rivers of Paradise and plunging into them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 78
			}
		}
	]
}