{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"text": "Narrated Abu Dawud: Abu Dawud and others have said: When a she-camel enters fourth year, the female is called hiqqah, and the male is called hiqq, for it deserves that it should be loaded and ridden. When a camel enters its fifth year, the male is called Jadha' and the female is called Jadha'ah. When it enters its sixth year, and sheds its front teeth, it is called thani (male) and thaniyyah (female). When it enters its seventh year, it is called raba' and raba'iyyah. When it enters its ninth year and cuts its canine teeth, it is called bazil. When it enters its tenth year, it is called mukhlif. Then there is no name for it, but is called bazil'am and bazil'amain, and mukhlif'am and mukhlif'amain, upto any year it increases. Nad d. Shumail said: Bint makhad is a she-camel of one year, and bin labun is s she-camel of two years, hiqqah is a she-camel of three years, jadha'ah is a she-camel of four years, thani is a camel of five years, raba' is a camel of six years, sadis is a camel of seven years, and bazil is a camel of eight years. Abu Dawud said: Abu Hatim and al-Asma'i said: Al-Jadhu'ah is a time when no tooth is growing. Abu Hatim said: Some of them said: When it sheds its teeth between front and canine teeth, it is called raba' and when it sheds its front teeth, it is called thani. Abu 'Ubaid said: When it becomes pregnant, it is called khalifah, and it remains khalifah for ten months; when it reaches ten months, it is called 'ushara', Abu Hatim said: When it shed its front teeth, it is called thani and when it sheds its teeth between front and canine teeth it is called raba",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		}
	]
}