{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "Narrated Abu Dawud: I found in my notebook from Shaiban and I did not hear from him ; Abu Bakr, a reliable friend of ours, said: Shaiban - Muhammad b. Rashid - Sulaiman b. Musad - 'Amr b. Suh'aib, On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) would fix the blood-money for accidental killing at the rate of four hundred dinars or their equivalent in silver for townsmen, and he would fix it according to the price of camels. So when they were dear, he increased the amount to be paid, and when cheap prices prevailed he reduced the amount to be paid. In the time of the Messenger of Allah (ﷺ) they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams. He said: The Messenger of Allah (ﷺ) gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep. He said: The Messenger of Allah (ﷺ) said: The blood-money is to be treated as something to be inherited by the heirs of the one who has been killed, and the remainder should be divided among the agnates. He said: The Messenger of Allah (ﷺ) gave judgment that for cutting off a nose completely there was full blood-money, one hundred (camels) were to be paid. If the tip of the nose was cut off, half of the blood-money,i.e. fifty camels were to be paid, or their equivalent in gold or in silver, or a hundred cows, or one thousand sheep. For the hand, when it was cut of,f half of the blood-money was to be paid; for one foot of half, the blood-money was to be paid. For a wound in the head, a third of the blood-money was due, i.e. thirty-three camels and a third of the blood-money, or their equivalent in gold, silver, cows or sheep. For a head thrust which reaches the body, the same blood-money was to be paid. Ten camels were to be paid for every finger, and five camels for every tooth. The Messenger of Allah (ﷺ) gave judgment that the blood-money for a woman should be divided among her relatives on her father's side, who did not inherit anything from her except the residence of her heirs. If she was killed, her blood-money should be distributed among her heirs, and they would have the right of taking revenge on the murderer. The Messenger of Allah (ﷺ) said: There is nothing for the murderer; and if he (the victim) has no heir, his heir will be the one who is nearest to him among the people, but the murderer should not inherit anything. Muhammad said: All this has been transmitted to me by Sulayman ibn Musa on the authority of Amr ibn Shu'aib who, on his father's authority, said that his grandfather heard it from the Prophet (ﷺ). Abu Dawud said: Muhammad b. Rashid, an inhabitant of Damascus, fled from Basrah escaping murder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		}
	]
}