{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "‘Abd Allah b. Zaid reported :when the Messenger of Allah (ﷺ) ordered a bell to be made so that it might be struck to gather the people for prayer, a man carrying a bell in his hand appeared to me while I was asleep, and I said; servant of ‘abd Allah, will you sell the bell? He asked; what will you do with it? I replied; we shall use it to call the people to prayer. He said; should I not suggest you something better than that. I replied: certainly. Then he told me to say: Allah is most great, Allah is most great, Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to pray, come to pray; come to salvation; come to salvation. Allah is most great, Allah is most great. I testify that there is no god but Allah. He then moved backward a few steps and said: when you utter the IQAMAH, you should say: Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to prayer, come to salvation. The time for prayer has come, the time for prayer has come: Allah is most great, Allah is most great. There is no god but Allah. When the morning came, I came to the Messenger of Allah (May peace be upon him) and informed him of what I had seen in the dream. He said: it is a genuine vision, and he then should use it to call people to prayer, for he has a louder voice than you have. So I got up along with Bilal and began to teach it to him and he used it in making the call to prayer. ‘Umar b. al-khattab (Allah be pleased with him) heard it while he was in his house and came out trailing his cloak and said: Messenger of Allah. By him who has sent you with the truth, I have also seen the kind of thing as has been shown to him. The Messenger of Allah (May peace be upon him) said: To Allah be the praise. Abu Dawud said; Al-Zuhri narrated this tradition in a similar way from Sa’id b. al-Musayyib on the authority of ‘Abd Allah b. Zaid. In this version Ibn Ishaq narrated from al-Zuhri: Allah is most great. Allah is most great, Allah is most great, Allah is most great. Ma;mar and yunus narrated from al-Zuhri; Allah is most great, Allah is most great. They did not report it twice again",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		}
	]
}