{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5185,
			"arabicnumber": 5185,
			"text": "Narrated Qays ibn Sa'd: The Messenger of Allah (ﷺ) came to visit us in our house, and said: Peace and Allah's mercy be upon you! Sa'd returned the greeting in a lower tone. Qays said: I said: Do you not grant permission to the Messenger of Allah (ﷺ) to enter? He said: Leave him, he will give us many greetings. The Messenger of Allah (ﷺ) then said: Peace and Allah's mercy be upon you! Sa'd again responded in a lower tone. The Messenger of Allah (ﷺ) again said: Peace and Allah's mercy be upon you! So the Messenger of Allah (ﷺ) went away. Sa'd went after him and said: Messenger of Allah! I heard your greetings and responded in a lower tone so that you might give us many greetings. The Messenger of Allah (ﷺ) returned with him. Sa'd then offered to prepare bath-water for him, and he took a bath. He then gave him a long wrapper dyed with saffron or wars and he wrapped himself in it. The Messenger of Allah (ﷺ) then raised his hands and said: O Allah, bestow Thy blessings and mercy on the family of Sa'd ibn Ubadah! The Messenger of Allah (ﷺ) then shared their meals. When he intended to return, Sa'd brought near him an ass which was covered with a blanket. The Messenger of Allah (ﷺ) mounted it. Sa'd said: O Qays, accompany the Messenger of Allah. Qays said: The Messenger of Allah (ﷺ) said to me: Ride. But I refused. He again said: Either ride or go away. He said: So I went away. Hisham said: AbuMarwan (transmitted) from Muhammad ibn AbdurRahman ibn As'ad ibn Zurarah. Abu Dawud said: 'Umar b. 'Abd al-Wahid and Ibn Sama'ah transmitted it from al-Awzai' in mursal form (the ling of the Companion being missing), and they did not mention Qais b. Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 413
			}
		}
	]
}