{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "Mu’awiyah b. al-Hakam al-Sulami said:I was praying with the Messenger of Allah(ﷺ). A man in the company sneezed, and I said: May Allah have mercy on you! The people gave me disapproving looks, so I said: Woe is to me! What do you mean by looking at me? They began to strike their hand on their thighs; then I realised that they were urging me to be silent. When the Messenger of Allah (ﷺ) finished his prayer – for whom I would give my father and mother as ransom-he did not beat, scold or revile me, but said: No talk to people in lawful in this prayer, for it consists only in glorifying Allah, declaring His greatness, and reciting the Qur'an or words to that effect said by the Messenger of Allah (ﷺ). I said: Messenger of Allah, we were only recently pagans, but Allah has brought Islam to us, and among us there are men who have recourse to soothsayers (kahins). He replied: Do not have recourse to them. I said: Among us are there are men who take omens. He replied: That is something which they find, but let it not turn them away (from what they intended to do). I said: among us there are men who draw lines. He replied: There was a prophet who drew lines; so if the line of anyone tallies with this line, that might come true. I said: A slave-girl of mine used to tend goats before (the mountain) Uhud and al-Jawaniyyah. Once when I reached her (suddenly) I found that a wolf had taken away a goat of them. I am a human being; I feel grieved as others do. But I gave her a good knocking. This was unbearable for the Messenger of Allah (ﷺ). I asked: Should I set her free ? He replied: Bring her to me. So I brought her to him. He asked (her): Where is Allah ? She said: In the heaven. He said: Who am I ? She replied: You are the Messenger of Allah. He said: Set her free, for she is believer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 541
			}
		}
	]
}