{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"18": "The Chapters on Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "It was narrated from Mutarrif bin 'Abdullah bin Shikhkhir that his father said:“The Messenger of Allah (ﷺ) said: 'The lost animal of the Muslim may lead to the burning flame of Hell.' ”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "It was narrated that Mundhir bin Jarir said:“I was with my father in Bawazij and the cows came back in the evening. He saw a cow did not recognize it. He said: 'What is this?' He said: 'A cow that joined the herd.' And he issued orders that it be driven away until it disappeared from view. Then he said: 'I heard the Messenger of Allah (ﷺ) say: “No one gives refuge to a stray animal but one who is also astray.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "It was narrated from Zaid bin Khalid that the Prophet (ﷺ) was asked about a lost camel. :He turned red, and he said: “What does it have to do with you? It has its feet and its water supply, it can go and drink water and eat from the trees until its owner finds it.” And he was asked about lost sheep, and he said: “Take it, for it will be for you or for your brother or for the wolf.” And he was asked about lost property and he said: “Remember the features of its leather bag and strap, and announce it for one year, then if someone claims it, describing it to you with those features (give it to him), otherwise incorporate it into your own wealth.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "It was narrated from 'Iyad bin Himar that the Messenger of Allah (ﷺ) said:“Whoever finds lost property, let him ask one or two men of good character to witness it, then he should not alter it nor conceal it. If its owner comes along, then he has more right to it, otherwise it belongs to Allah (SWT), Who gives it to whomsoever He wills.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "It was narrated that Suwaid bin Ghafalah said:“I went out with Zaid bin Suhan and Salman bin Rabi'ah, and when we were at `Udhaib, I found a whip. They said to me: 'Throw it away,' but I refused. When we came to Al-Madinah I went to Ubayy bin Ka'b and told him about that. He said: 'You did the right thing. I found one hundred dinar that had been lost at the time of the Messenger of Allah (ﷺ), and I asked him about it. He said, “Announce it for a year.” So I Announced it, and I did not find anyone who recognized it. He said: “Remember the features of its bag and strap, and how many it contains, then announce it for a year. If someone comes who describes it with those features, (give it to him), otherwise it is like your own property.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "It was narrated from Zaid bin Khalid Al-Juhani that the Messenger of Allah (ﷺ) was asked about lost property. :He said: “Announce it for a year, then if someone describes it with its features, return it to him. If no one claims it, then remember the features of its leather bag and strap, and consume it (use it). Then if its owner comes along, give it to him.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "It was narrated from Miqdad bin 'Amr:That he went out one day to Al-Baqi', which is the graveyard, to relieve himself. People used to go out to relieve themselves only every two or three days, and their faces was like that of a camel (because of hunger and rough food). Then he entered a ruin and while he was squatting to relieve himself, he saw a rat bringing a Dinar out of a hole, then it went in and brought out another, until it had brought out seventeen Dinars. Then it brought out a piece of red rag.Miqdad said: “I picked up the rag and found another Dinar inside it, thus completing eighteen Dinar. I took them out and brought them to the Messenger of Allah (ﷺ), and told him what had happened. I said, 'Take its Sadaqah (charity), O Messenger of Allah (ﷺ).' He said: 'Take them back, for no Sadaqah is due on them. May Allah (SWT) bless them for you.' Then he said: 'Perhaps you put your hand in the hole?' I said: 'No, by the One Who has honored you with the truth.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:“One fifth is due on buried treasure.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:“One fifth is due on buried treasure.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "Sulaiman bin Hayyan said:“I heard my father narrate from Abu Hurairah that the Prophet (ﷺ) said: 'Among those who came before you there was a man who bought some property and found therein a jar of gold. He said: “I bought land from you, but I did not buy the gold from you.” The man said: “Rather I sold you the land with whatever is in it.” They referred their case to (a third) man who said: “Do you have children?” One of them said: “I have a boy.” The other said: “I have a girl.” He said: “Marry the boy to the girl, and let them spend on themselves from it and give in charity.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 10
			}
		}
	]
}