{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "It was narrated from Muhammed bin 'Abdullah bin Zaid that his father said that:The Messenger of Allah was thinking of a horn, and he commanded that a bell be made and it was done. Then 'Abdullah bin Zaid had a dream. He said: \"I saw a man wearing two green garments, carrying a bell. I said to him, 'O slave of Allah, will you sell the bell?' He said; 'What will you do with it?' I said, 'I will call (the people) to prayer.' He said, 'Shall I not tell you of something better than that?' I said, 'What is it?' he said, 'Say: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alas-salah, Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is The Most Great, Allah is The Most Great; Allah is The Most Great, Allah is The Most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammed is the Messenger of Allah, I bear witness that Muhammed is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).\" 'Abdullah bin Zaid went out and came to the Messenger of Allah, and told him what he had seen. He said, \"O Messenger of Allah, I saw a man wearing two green garments carrying a bell,\" and he told him the story. The Messenger of Allah said, \"Your companion has had a dream. Go out with Bilal to the mosque and teach it to him, for he has a louder voice than you.\" I ('Abdullah) went out with Bilal to the mosque, and I started teaching him the words and he was calling them out. 'Umar Al-Khattab heard the voice and came out saying, \"O Messenger of Allah! By Allah, I saw the same (dream) as him.\" (Hasan)Abu 'Ubaid said: \"Abu Bakr Al-Hakami told me that 'Abdullah bin Zaid Al-Ansari said concerning that: 'I praise Allah, the Possessor of majesty and honor, A great deal of praise for the Adhan. Since the news of it came to me from Allah, So due to it, I was honored by the information. During the three nights. Each of which increased me in honor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "It was narrated from Salim, from his father, that:The Prophet consulted the people as to how he could call them to the prayer. They suggested a horn, but he disliked that because of the Jews (because the Jews used a horn). Then they suggested a bell but he disliked that because of the Christians (because the Christians used a bell). Then that night the call to the prayer was shown in a dream to a man among the Ansar whose name was 'Abdullah bin Zaid, and to 'Umar bin Khattab. The Ansari man came to the Messenger of Allah at night, and the Messenger of Allah commanded Bilal to give the call to the prayer. (Da'if)Zuhri said: \"Bilal added the phrase \"As-salatu khairum minan-nawm (the prayer is better than sleep)\" to the call for the morning prayer, and the Messenger of Allah approved of that.\" 'Umar said: \"O Messenger of Allah, I saw the same as he did, but he beat me to it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "Ibn Juraij narrated:\"Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated from 'Abdullah bin muhairiz who was an orphan under the care of Abu Mahdhurah bin mi'yar that when he was preparing him to travel to Sham, he said: 'O my uncle, I am going out to Sham, and I will be asked about how you started the Adhan.' So he informed me that. Abu Mahdhurah said: 'I went out with a group of people, and we were somewhere on the road, when the Mu'adh-dhin of the Messenger of Allah gave the call to prayer in the presence of the Messenger of Allah. We heard the voice of the Mu'adh-dhin, and we were shunning it (the Adhan), so we started yelling, imitating it and mocking it. The Messenger of Allah heard us, so he sent some people who brought us to sit in front of him. He said: 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and give the call to prayer.' I stood up and there was nothing more hateful to me than the Messenger of Allah and what he was telling me to do. I stood up in front of the Messenger of Allah and the Messenger of Allah himself taught me the call. He said: \"Say: 'Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah).'\" Then he said: \"Raise your voice (and say). Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).'\" Then he called me when I had finished saying the Adhan, and gave me a small bag in which there was some silver. Then he put his hand on the forelock of Abu Mahdhurah, then passed it over his face, then over his chest, and over his heart, until the hand of the Messenger of Allah reached his navel. Then the Messenger of Allah said: 'May Allah bless you and send blessings upon you.' I said: 'O Messenger of Allah, do you command me to give the call to prayer in Makkah?' He said: 'Yes, I command you (to do so).' Then all the hatred I had felt towards the Messenger of Allah disappeared, and was replaced with love for the Messenger of Allah. I came to 'Attab bin Asid, the governor of the Messenger of Allah in Makkah, and gave the call to prayer with him by command of the Messenger of Allah.\" (Sahih)He ('Abdul-'Aziz) said: \"Someone who met Abu Mahdhurah told me the same as 'Abdullah bin Muhairiz told me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "It was narrated that Abu Mahdhurah said:\"The Messenger of Allah taught me the Adhan with nineteen phrases and the Iqamah with seventeen. The Adhan is: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah). And the Iqamah is seventeen phrases: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Qad qamatis-salah, qad qamatis-salah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; The prayer is about to begin, the prayer is about to begin; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "Abdur-Rahman bin Sa'd bin 'Ammar bin Sa'd, who was the Mu'adh-dhin of the Messenger of Allah narrated from his grandfather, that:The Messenger of Allah commanded Bilal to put his fingers in his ears when calling the Adhan, and he said: \"It makes the voice louder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "It was narrated from 'Awn bin Abu Juhaifah that his father said:\"I came to the Messenger of Allah in Abtah, when he was in a red tent. Bilal came out and gave the call to prayer, turning around and putting his fingers in his ears",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah said: There are two characteristics in which the Muslims are dependent upon their Mu'adh-dhins: their prayer and their fasting",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "It was narrated that Jabir bin Samurah said:\"Bilal did not delay the Adhan from its proper time, but he sometimes delayed the Iqamah a little",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "It was narrated that 'Uthman bin Abul-As said:\"The last instruction that the Messenger of Allah gave to me was that I should not appoint a Mu'adh-dhin who took payment for the Adhan.\" (sahih)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "It was narrated that Bilal said:\"The Messenger of Allah commanded me (with Tathwib) in the Adhan for Fajr, and he forbade me to do so in the Adhan for 'Isha",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "It was narrated that Bilal came to the Prophet to call him for the Fajr prayer, and was told:\"He is sleeping.\" He said: \"As-salatu khairum minan-nawm, As-salatu khairum minan-nawm (The prayer is better than sleep, the prayer is better than sleep). These words were approved of in the Adhan for the Fajr, and that is how it remained",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "It was narrated that Ziyad bin Harith As-Suda'i said:\"I was with the Messenger of Allah on a journey, and he commanded me to call the Adhan. Bilal wanted to call the Iqamah, but the Messenger of Allah said: 'The brother of Suda' called the Adhan, and the one who calls the Adhan is the one who calls the Iqamah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "It was narrated that Abu Hurairah said:\"The Messenger of Allah said: 'When the Mu'adh-dhin calls the Adhan, say as he says",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "Umm Habibah narrated that :When the Messenger of Allah was with her on her day and night, and heard the Mu'adh-dhin calling the Adhan, she heard him saying what he said",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "It was narrated that Abu Sa'eed Al-Khudri said:\"The Messenger of Allah said: 'When you hear the call (to prayer), say what the Mu'adh-dhin says",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "It was narrated from Sa'd bin Abu Waqqas that:The Messenger of Allah said: \"Whoever says, when he hears the Mu'adh-dhin, 'Wa ana Ash-hadu an la ilaha illallah wahdahu la sharika lahu, wa ash-hadu anna Muhammadan 'abduhu wa rasuluhu, radaytu Billahi rabban wa bil-islami dinan wa bi muhammadin nabiyyan (And I bear witness that none has the right to be worshipped but Allah alone, with no partner, and I bear witness that Muhammad is His slave and Messenger, and I am content with Allah as my Lord, Islam as my religion and Muhammad as my Prophet),' his sins will be forgiven to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "It was narrated that Jabir bin 'Abdullah said:\"The Messenger of Allah said: 'Whoever says when he hears the call to the prayer: \"Allahumma Rabba hadhihid-da'watit-tammah was-salatil-qa'imah, ati Muhammadanil-wasilata wal-fadilah, wab'athhu maqaman mahmudanilladhi wa'adtah (O Allah, Lord of this perfect call and the prayer to be offered, grant Muhammad the privilege (of intercession) and also the eminence, and resurrect him to the praised position that You have promised),\" my intercession for him will be permitted on the Day of Resurrection",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "It was narrated from 'Abdullah bin 'Abdur-Rahman bin Abu Sa'sa'ah that:His father who was under the care of Abu Sa'eed said: \"Abu Sa'eed said to me: 'If you are in the desert, raise your voice when you say the Adhan, for I heard the Messenger of Allah say: 'No jinn, human, tree or rock will hear it, but it will bear witness for you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "It was narrated that Abu Hurairah said:\"I heard the Messenger of Allah himself say: 'The Mu'adh-dhin's sins will be forgiven as far as his voice reaches, and every wet and dry thing will pray for forgiveness for him. For the one who attends the prayer, twenty-five Hasanat (good deeds) will be recorded, and it is will be expiation (for sins committed) between them (the two prayers)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "It was narrated that 'Esa bin Talhah said:\"I heard Mu'awiyah bin Abu Sufyan say that Messenger of Allah said: \"The Mu'adh-dhin will have the longest necks of all people on the Day of Resurrection",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah said: 'Let the best of you give the call to prayer (Adhan), and let those who are most versed in the Qur'an lead you in prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah said: 'Whoever calls the Adhan for seven years, seeking reward (from Allah), Allah will decree for him deliverance from the Fire",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "It was narrated from Ibn 'Umar that:The Messenger of Allah said: \"Whoever calls the Adhan for twelve years, he will be guaranteed Paradise, and for each day sixty Hasanat (good deeds) will be recorded for him by virtue of his Adhan, and thirty Hasanat by virtue of his Iqamah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "It was narrated that Anas bin Malik said:\"They looked for something by means of which they could call out informing of (the time of) the prayer. Then Bilal was commanded to say the phrases of the Adhan twice and the phrases of the Iqamah once",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "It was narrated that Anas said:\"Bilal was commanded to say the phrases of the Adhan twice and the phrases of the Iqamah once",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "Abdur-Rahman bin Sa'd bin 'Ammar bin Sa'd narrated (from his great-grandfather of the Messenger of Allah) that:In the Adhan of Bilal, the phrases were two by two, and in his Iqamah they were said once",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "It was narrated that Abu Rafi' said:\"I saw Bilal calling the Adhan in fron of Allah's Messenger, (saying the phrases) two by two, and saying each phrase once in the Iqamah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "It was narrated that Abu Sha'tha said:\"We were sitting in the mosque with Abu Hurairah when the Mu'adh-dhin called the Adhan. A man got up and walked out of the mosque, and Abu Hurairah followed him with his gaze until he left the mosque. Then Abu Hurairah said: \"This man has disobeyed Abul-Qasim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "It was narrated that 'Uthman said:\"The Messenger of Allah said: 'Whoever hears the Adhan when he is in the mosque, then goes out and does not go out for any (legitimate) need and does not intend to return, is a hypocrite",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		}
	]
}