{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"15": "The Chapters on Charity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "১/২৩৯০। উমার ইবনুল খাত্তাব (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি তোমার কৃত দান ফেরত নিও না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "২/২৩৯১। আবদুল্লাহ ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি দান করে তা পুনরায় ফেরত নেয়, সে কুকুরের সমতুল্য, যে বমি করে পুনরায় ফিরে এসে তা গলধঃকরণ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "১/২৩৯২। উমার (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে একটি ঘোড়া দান করেছিলেন। তিনি তার মালিককে সেটি সস্তায় বিক্রয় করতে দেখে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে এ সম্পর্কে তাকে জিজ্ঞেস করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার দান তুমি ক্রয় করো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "২/২৩৯৩। যুবাইর ইবনুল আওয়াম (রাঃ) থেকে বর্ণিত। তিনি তার গামর বা গামরা নামের একটি ঘোড়া দান করেন। তিনি তার সেই ঘোড়ার গর্ভজাত একটি নর বা মাদী ঘোড়া বিক্রয় হতে দেখলেন। তা ক্রয় করতে নিষেধ করা হলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "১/২৩৯৪। বুরায়দা (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকট এসে বললো, হে আল্লাহর রাসূল! আমি আমার মাকে আমার একটি ক্রীতদাসী দান করার পর তিনি ইনতিকাল করেন। আমি ছাড়া তার আর কোন ওয়ারিস নাই। রাসূলুল্লহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তোমাকে প্রতিদান দিবেন এবং তা ওয়ারিসী সূত্রে তোমাকে ফেরত দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "২/২৩৯৫। আমার ইবনে শুআইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, আমি আমার মাকে আমার একটি বাগান দান করেছিলাম। তিনি ইনতিকাল করেছেন এবং আমাকে ছাড়া আর কোন ওয়ারিস রেখে যাননি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার দান পূর্ণরূপে আদায় হয়েছে এবং তোমার বাগান তোমার মালিকায়নায় ফেরত এসেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "১/২৩৯৬। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, উমার ইবনুল খাত্তাব (রাঃ) খায়বারে এক খন্ড জমি পেলেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে তাঁর নির্দেশ প্রার্থনা করে বলেন, ইয়া রাসূলুল্লাহ! আমি খায়বারে এক খন্ড সম্পত্তি লাভ করেছি। আমার মতে এতো উত্তম সম্পত্তি আমি আর কখনো অর্জন করিনি। এই সম্পত্তি সম্পর্কে আপনি আমাকে কি হুকুম করেন? তিনি বলেনঃ তুমি ইচ্ছা করলে মূল সম্পত্তি (তোমার মালিকানায়) বহাল রেখে তার আয় দান-খয়রাত করতে পারো। ইবনে উমার (রাঃ) বলেন, উমার (রাঃ) নিম্নোক্ত শর্তযোগে তাই করলেনঃ ‘‘মূল সম্পত্তি বিক্রয় করা যাবে না, দান করা যাবে না, তাতে ওয়ারিসী স্বত্বও বর্তাবে না এবং তার আয় দরিদ্র, নিকটাত্মীয়, দাসমুক্ত, আল্লাহর রাস্তায় মুসাফির ও মেহমানদের আপ্যায়ন ইত্যাদি উদ্দেশ্যে দান করা হবে। যে তার মোতাওয়াল্লী হবে, সে তা থেকে ন্যায়সঙ্গতভাবে আহার করতে পারবে এবং তার বন্ধুদের আহার করাতে পারবে, কিন্তু জমা করতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "২/২৩৯৭। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, উমার ইবনুল খাত্তাব (রাঃ) বললেন, ইয়া রাসূলুল্লাহ! খায়বারের আমি যে এক শত অংশ জমি পেয়েছি, তার চেয়ে অধিক প্রিয় কোন সম্পত্তি আমি আর কখনো পাইনি। আমি তা দান-খয়রাত করার সংকল্প করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি মূল সম্পত্তি বহাল রেখে দাও এবং তার আয় দান করো। অধস্তন রাবী ইবনে আবূ উমার (রাঃ) বলেন, আমি এ হাদীস আমার কিতাবের অন্য এক স্থানে নিম্নোক্ত সনদসূত্রে পেয়েছিঃ সুফিয়া আবদুল্লাহ নাফে-ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, উমার (রাঃ) বললেন ... উক্ত হাদীসের অনুরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "১/২৩৯৮। আবূ উমামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতে শুনেছিঃ আরিয়া পরিশোধ করতে হবে এবং মানীহা (দুধ পান করতে দেয়া পশু) ফেরত দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "২/২৩৯৯। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ আরিয়া (ধার) পরিশোধ করতে হবে এবং মানীহা (দুধপান করতে দেয়া পশু) ফেরত দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "৩/২৪০০। সামুরা (রাঃ) থেকে বর্ণিত। রাসলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তি (ধারে) যা গ্রহণ করেছে তা ফেরত না দেয়া পর্যন্ত তার জন্য সে দায়ী থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "১/২৪০১। আমার ইবনে শুআইব (রাঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ কারো কাছে ওয়াদিয়া রাখলে (তা ধ্বংস হলে) তার কোন ক্ষতিপূরণ নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "১/২৪০২। উরওয়া আল-বারিকী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জন্য একটি ছাগল কেনার উদ্দেশে তাকে একটি দীনার দেন। তিনি তাঁর জন্য দু’টি ছাগল কিনে এর একটি এক দীনারে বিক্রয় করে একটি দীনার ও একটি ছাগল নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য বরকতের দোয়া করেন। রাবী বলেন, এরপর তিনি মাটি কিনলে তাতেও লাভবান হতেন। ২/২৪০২ (১) উরওয়া ইবনে আবুল জাদ আল-বারিকী (রাঃ) থেকে বর্ণিত। তিনি বলেন, একটি বাণিজ্যিক কাফেলা পণ্যদ্রব্য নিয়ে আসলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে একটি দীনার দিলেন ... পূর্বোক্ত হাদীসের অনুরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "১/২৪০৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ধনী ব্যক্তির ঋণ পরিশোধে গড়িমসি করা অন্যায়। স্বচ্ছল ব্যক্তির নিকট তোমাদের কারো পাওনা থাকলে সে যেন তার পেছনে লেগে থাকে (শেষোক্ত বাক্যের আরো একটি অর্থ হতে পারেঃ তোমাদের কারো ঋণ পরিশোধ করার জন্য ঋণগ্রস্ত ব্যক্তি কোন সক্ষম ব্যক্তির উপর দায়িত্ব ন্যস্ত করলে তা অনুমোদন করা উচিৎ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "২/২৪০৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছে্নঃ স্বচ্ছল ব্যক্তির ঋণ পরিশোধে গড়িমসি করা জুলুম। স্বচ্ছল ব্যক্তির নিকট তোমার পাওনা থাকলে তার পেছেনে লেগে থাকো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "১/২৪০৫। আবূ উমামা আল-বাহিলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যামিনদার দায়বদ্ধ এবং ঋণ অবশ্যই পরিশোধযোগ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "২/২৪০৬। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এক ব্যক্তি তার দেনাদারের পেছনে লাগলো। সে তার নিকট দশ দীনার পাওনা ছিল। দেনাদার বললো, আমার নিকট তোমাকে দেয়ার মত কোন জিনিস নাই। পাওনাদার বললো, না, আল্লাহর শপথ! আমার দেনা পরিশোধ না করা অথবা একজন যামিনদার উপস্থিত না করা পর্যন্ত আমি তোমাকে ছাড়ছি না। সে তাকে টেনে-হেঁচড়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে গেলো। তিনি পাওনাদারকে বলেনঃ তুমি তাকে কতো দিনের অবকাশ দিতে পারো? সে বললো, এক মাস। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাহলে আমিই তার যামিন। দেনাদার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বলে দেয়া সময়সীমার মধ্যে পাওনাসহ তাঁর নিকট উপস্থিত হলে তিনি তাকে বলেনঃ তুমি এগুলো কোথায় পেলে? সে বললো, খনিতে। তিনি বলেনঃ এতে কোন কল্যাণ নেই। অতঃপর তিনি নিজের পক্ষ থেকে ঋণদাতার পাওনা পরিশোধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "৩/২৪০৭। আবূ কাতাদা (রাঃ) থেকে বর্ণিত। জানাযার নামায পড়ার জন্য একটি লাশ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে আসা হলো। তিনি বলেনঃ তোমরা তোমাদের সঙ্গীর জানাযার নামায পড়ো। কেননা সে ঋণগ্রস্ত। আবূ কাতাদা (রাঃ) বলেন, আমি তার ঋণের যামিন হচ্ছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পরিশোধ করার জন্য তো? তিনি বলেন, পরিশোধ করার জন্য। তার ঋণের পরিমাণ ছিলো আঠার বা উনিশ দিরহাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "১/২৪০৮। ইবনে হুযায়ফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, উম্মুল মুমিনীন মায়মুনা (রাঃ) ধারকর্জ গ্রহণ করতেন। তার পরিবারের কেউ কেউ বললো, আপনি ধারকর্জ করবেন না এবং তার এ কাজকে তারা অপছন্দ করলো। তিনি বলেন, হ্যাঁ আমি আমার নবী ও বন্ধু সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে কোন মুসলিম ধারকর্জ গ্রহণ করে এবং আল্লাহ জানেন যে, তা পরিশোধ করার অভিপ্রায় তার রয়েছে, তাহলে দুনিয়াতেই আল্লাহ তার ঐ ধারকর্জ পরিশোধের ব্যবস্থা করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "২/২৪০৯। আবদুল্লাহ ইবনে জাফর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঋণগ্রস্ত ব্যক্তির ঋণ পরিশোধ না করা পর্যন্ত আল্লাহ তার সাথে থাকেন, যদি না সে আল্লাহর অপছন্দনীয় উদ্দেশ্যে ঋণ গ্রহণ করে থাকে। রাবী বলেন, আবদুল্লাহ ইবনে জাফর (রাঃ) তার কোষাধ্যক্ষকে বলতেন, যাও, আমার জন্য ঋণ গ্রহণকরো। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট যে হাদীস শুনেছি তারপর থেকে এক রাতও আল্লাহ আমার সঙ্গে থাকা ছাড়া কাটাতে অপছন্দ করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2410,
			"arabicnumber": 2410,
			"text": "১/২৪১০। সুহাইব আল-খায়ের (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে কোন ব্যক্তি ঋণ গ্রহণ করলো এবং তা পরিশোধ না করতে সংকল্পবদ্ধ, (কিয়ামতের দিন) সে আল্লাহ সাথে তষ্কররূপে সাক্ষাত করবে। ২/২৪১০ (১)। ইবরাহীম ইবনুল মুনযির আল-হিযামী-ইউসুফ ইবনে মুহাম্মাদ ইবনে সাইফী-আবদুল হামীদ ইবনে যিয়াদ-তার পিতা-তার দাদা সুহাইব (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে পূর্বোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "৩/২৪১১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি মানুষের সম্পদ ধ্বংস করার অভিপ্রায় গ্রহণ করে, আল্লাহ তাকে ধ্বংস করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": 2412,
			"text": "১/২৪১২। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুক্তদাস সাওবান (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তিনটি দোষ থেকে মুক্ত অবস্থায় যার দেহ থেকে তার প্রাণবায়ু বের হয়েছে সে জান্নাতে প্রবেশ করবেঃ অহংকার, আত্মসাৎ ও ঋণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": 2413,
			"text": "২/২৪১৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিন ব্যক্তির রূহ তার ঋণের কারণে ঝুলন্ত অবস্থায় থাকে, যতক্ষণ যাবত না তা পরিশোধ করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": 2414,
			"text": "৩/২৪১৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি তার যিম্মায় এক দীনার বা এক দিরহাম পরিমাণ ঋণ রেখে মারা গেলে (কিয়ামতের দিন) তার নেক আমলের দ্বারা তা পরিশোধ করা হবে। আর সেখানে কোন দীনারও থাকবে না, দিরহামও থাকবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2415,
			"arabicnumber": 2415,
			"text": "১/২৪১৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে কোন মুমিন ব্যক্তি ঋনগ্রস্ত অবস্থায় মারা গেলে তিনি জিজ্ঞেস করতেনঃ সে কি তার ঋণ পরিশোধ করার মত কোন কিছু রেখে গেছে? লোকজন যদি বলতো, হ্যাঁ, তবে তিনি তার জানাযার নামায পড়তেন। আর যদি তারা বলতো, না, তাহলে তিনি বলতেনঃ তোমরা তোমাদের সঙ্গীর জানাযার নামায পড়ো। অতঃপর আল্লাহ তাঁর রাসূলকে (যুদ্ধে) অসংখ্য বিজয় দান করলে তিনি বলেনঃ আমিই মুমনিদের জন্য তাদের নিজেদের চেয়ে অধিক কল্যাণকামী। অতএব কোন ব্যক্তি ঋণগ্রস্ত অবস্থায় মারা গেলে তা পরিশোধের দায়িত্ব আমার। আর সে যে সম্পদ রেখে যাবে, তা তার ওয়ারিসদের প্রাপ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": 2416,
			"text": "২/২৪১৬। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি সম্পদ রেখে মারা গেলে তা তার ওয়ারিসদের প্রাপ্য। আর কোন ব্যক্তি ঋণ অথবা অসহায় সন্তান রেখে মারা গেলে তা পরিশোধের দায়িত্ব আমার এবং তাদের লালন-পালনের দায়িত্বও আমার। আমিই মুমনিদের অধিক উপযুক্ত পৃষ্ঠপোষক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": 2417,
			"text": "১/২৪১৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি অস্বচ্ছল (ঋণগ্রস্ত) ব্যক্তিকে অবকাশ দিবে, আল্লাহ দুনিয়াতে ও আখেরাতে তার সাথে সহজ ব্যবহার করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": 2418,
			"text": "২/১৪১৮। বুরায়দা আল-আসলামী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি (ঋণগ্রস্ত) অভাবী ব্যক্তিকে অবকাশ দিবে, সে দান-খয়রাত করার সওযাব পাবে। আর যে ব্যক্তি ঋণ শোধের মেয়াদ শেষ হওয়ার পরও সময় বাড়িয়ে দিবে সেও প্রতিদিন দান-খয়রাত করার সওয়াব পাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": 2419,
			"text": "৩/২৪১৯। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী আবুল ইউসর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি চায় যে, আল্লাহ তাকে তাঁর ছায়ার নিচে স্থান দিল, যে যেন ঋণগ্রস্থ ব্যক্তিকে অবকাশ দেয় অথবা তার দেনা মাফ করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": 2420,
			"text": "৪/২৪২০। হুযায়ফা (রাঃ) থেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাণী হিসাবে বর্ণিত। এক ব্যক্তি মারা গেলে তাকে জিজ্ঞেস করা হলো, তুমি কি আমল করেছো? সে নিজের স্মৃতি থেকে অথবা তাকে স্মরণ করিয়ে দেয়া হলে বললো, আমি নগদ অর্ধ ধার দিতাম এবং অভাবগ্রস্তকে (ঋণ পরিশোধে) অবকাশ দিতাম। এজন্য আল্লাহ তাকে ক্ষমা করে দেন। আবূ মাসউদ (রাঃ) বলেন, আমিও এ হাদীস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুনেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": 2421,
			"text": "১/২৪২১। ইবনে উমার ও আয়েশা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তি পাওনা আদায়ের তাগাদা দিলে যেন বিনীতভাবেই তাগাদা দেয়, তাতে পাওনা আদায় হোক বা না হোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": 2422,
			"text": "২/২৪২২। আবূ হুরায়র (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক পাওনাদারকে বলেনঃ তুমি তোমার পাওনা ভদ্র ও বিনীতভাবে গ্রহণ করো, তা পূর্ণরূপে আদায় হোক বা না হোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": 2423,
			"text": "১/২৪২৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে সেই ব্যক্তি উত্তম যে উত্তমরূপে ঋণ পরিশোধ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": 2424,
			"text": "২/২৪২৪। আবদুল্লাহ ইবনে আবূ রবীআ আল-মাখযূমী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুনায়ন যুদ্ধের সময় তার কাছ থেকে তিরিশ অথবা চল্লিশ হাজার দিরহাম ধার নিয়েছিলেন। তিনি যুদ্ধ থেকে ফিরে এসে তার পাওনা পরিশোধ করেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ আল্লাহ পাক তোমাকে তোমার পরিবার ও সম্পদে বরকত দান করুন। ধারের প্রতিদান হলো, তা পরিশোধ করা এবং প্রশংসা করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": 2425,
			"text": "১/২৪২৫। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি ঋণ বা পাওনা আদায়ের তাগাদা দেয়ার জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলো এবং কিছু কঠোর কথা বললো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ তাতে ত্রুুদ্ধ হলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে বললেনঃ থামো! পাওনা পরিশোধ না করা পর্যন্ত ঋণদাতা তার দেনাদারকে কঠোরভাবে তাগাদা দেয়ার অধিকার রাখে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "২/২৪২৬। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে তার ঋণ শোধের জন্য তাঁকে কঠোর ভাষায় তাগাদা দিলো, এমনকি সে তাঁকে বললো, আমার ঋণ পরিশোধ না করলে আমি আপনাকে নাজেহাল করবো। সাহীবগণ তার উপর চড়াও হতে উদ্ধত হয়ে বললেন, তোমার অনিষ্ট হোক! তুমি কি জানো কার সাথে কথা বলছো? সে বললো, আমি আমার পাওনা দাবি করছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা কেন পাওনাদারের পক্ষ নিলে না? অতঃপর তিনি কায়েসের কন্যা খাওলা (রাঃ) এর নিকট লোক পাঠিয়ে তাকে বললেন, তোমার কছে খেজুর থাকলে আমাকে ধার দাও। আমারে খেজুর আসলে তোমার ধার পরিশোধ করবো। খাওলা (রাঃ) বললেন, হ্যাঁ, আমার পিতা আপনার জন্য উৎসর্গিত হোক, ইয়া রাসূলাল্লাহ। রাবী বলেন, তিনি তাঁকে ধার দিলেন। তিনি বেদুঈনের পাওনা পরিশোধ করলেন এবং তাকে আহার করালেন। সে বললো, আপনি পূর্ণরূপে পরিশোধ করলেন, আল্লাহ আপনাকে পূর্ণরূপে দান করুন। তিনি বলেনঃ উত্তম লোকেরা এমনই হয়। যে জাতির দুর্বল লোকেরা জোর-জবরদস্তি ছাড়া তাদের পাওনা আদায় করতে পারে না সেই জাতি কখনো পবিত্র হতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "১/২৪২৭। আমর ইবনুশ শারীদ (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে স্বচ্ছল ব্যক্তি কোন দেনা পরিশোধ করতে গড়িমসি করে, তাকে অপমান করা ও শাস্তি দেয়া উভয়ই আমার জন্য হালাল। আল আত-তানাফিসী (রাঃ) বলেন, অপমান করা অর্থ তার বিরুদ্ধে অভিযোগ দায়ের করা এবং শাস্তি দেয়ার অর্থ তাকে জেলখানায় কয়েদ করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "২/২৪২৮। হিরমাস ইবনে হাবীব (রাঃ) থেকে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, আমি আমার এক দেনাদারকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলাম। তিনি বলেনঃ এর পিছে লেগে থাকো। অতঃপর দিনের শেষে তিনি আমার নিকট নিয়ে যাওয়ার সময় বলেনঃ হে তামীম গোত্রের ভাই! তোমার কয়েদী কি করছে?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "৩/২৪২৯। আবুদুল্লাহ ইবনে কাব ইবনে মালেক (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি ইবনে আবূ হাদরাদকে তার দেয়া ঋণ ফেরত দানের জন্য মসজিদের মধ্যে তাগাদা দিলেন। এতে তাদের উভয়ের কন্ঠস্বর চরমে উঠে এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘর থেকে তা শুনতে পান। তিনি তাদের নিকট বের হয়ে এসে কাব (রাঃ) -কে ডাকলেন। কাব (রাঃ) উত্তর দিলেনঃ আমি হাজির ইয়া রাসূলাল্লাহ! তিনি বলেনঃ তোমার পাওনা থেকে এই পরিমাণ ছেড়ে দাও এবং নিজের হাত দিয়ে ইশারা করে অর্ধেক ছেড়ে দিতে বলেন। কাব (রাঃ) বললেন, আমি মাফ করে দিলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দেনাদারকে বলেনঃ উঠে যাও এবং ওর ঋণ পরিশোধ করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "১/২৪৩০। কায়েস ইবনে রূমী (রাঃ) থেকে বর্ণিত। তিনি বলেন, সুলায়মান ইবনে আদনান (রাঃ) আলকামা(রাঃ) কে তার বাতা প্রাপ্তির সাপেক্ষ এক হাজার দিরহাম করয দিয়েছিলেন। সুলায়মান তাকে কঠোরভাবে কযর থেকে দানের তাগাদা দিলেন। আলকামা (রাঃ) তার কর্য ফেরত দিলেন এবং তার প্রতি অসন্তুষ্ট হলেন। কয়েক মাস পর তিনি সুলায়মানের নিকট এসে বলেন, হাঁ খুব ভালো কথা। হে উতবার মা! দয়া করে তোমার নিকট গচ্ছিত মোহর করা থলেটি নিয়ে এসো। সে তা নিয়ে এলে সুলায়মান (আলকামাকে) বলেন, আল্লাহর শপথ! দেখুন, এগুলো আপনার সেই দিরহাম যা আপনি আমাকে ফেরত দিয়েছিলেন। আমি তা থেকে একটি দিরহামও সরাইনি। আলকামা (রাঃ) বলেন, আল্লাহর জন্য তোমার পিতা উৎসর্গিত হোক! তবে কোন জিনিস তোমাকে আমার সাথে রূঢ় আচরণ করতে প্ররোচিত করেছিল? তিনি বলেন, আমি আপনার নিকট যে হাদীস শুনেছি তা। আলকামা (রাঃ) বলেন, তুমি আমার নিকট কি হাদীস শুনেছ? তিনি বলেন, আমি আপনাকে ইবনে মাসউদ (রাঃ) -র সূত্রে বর্ণনা করতে শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘কোন মুসলিম অপর মুসলিমকে দু’বার করয দিলে সে সেই পরিমাণ মাল একবার দান-খয়রাত করার সমান সওয়াব পায়।’’ আলকামা (রাঃ) বলেন, ইবনমোসউদ (রাঃ) আমাকে এভাবেই অবহিত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "২/২৪৩১। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মিরাজের রাতে আমি জান্নাতের একটি দরজায় লেখা দেখলাম, দান-খয়রাতে দশ গুণ সওয়াব এবং করযে আঠারো গুণ! আমি বললামঃ হে জিবরীল! করয দান-খয়রাতের চেয়ে উত্তম হওয়ার কারণ কি? তিনি বলেন, ভিক্ষুক নিজের কাছে (সম্পদ) থাকতেও ভিক্ষা চায়, কিন্তু কযরদান প্রয়োজনের তাগিদেই কর্য চায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "৩/২৪৩২। ইহয়াহইয়া ইবনে আবূ ইসহাক আল-হানাঈ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি আনাস ইবনে মালেক (রাঃ) কে জিজ্ঞেস করলাম, আমাদের মধ্যে কেউ তার ভাইক মাল করয দেয়, অতঃপর করযদার তাকে উপঢৌকন দেয়। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ কোন জিনিস করয দেয়ার পর করযদার তাকে কিছু উপঢৌকন দিলে বা তার সওয়ারীতে আরোহণ করাতে চাইলে সে যেন তাতে আরোহণ না করে এবং উপঢৌকন গ্রহণ না করে। তবে তাদের মধ্যে আগে থেকেই এরূপ সৌজন্যমূলক বিনিময়ের প্রচলন থাকলে আপত্তি নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "১/২৪৩৩। সা'দ ইবনুল আতওয়াল (রাঃ) থেকে বর্ণিত। তার ভাই ইনতিকাল করেন এবং তিন শত দিরহাম ও কতক অসহায় সন্তান রেখে যান। আমি সেগুলো তার সন্তানদের জন্য খরচ করতে মনস্থ করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার ভাই দেনার কারণে আটক রয়েছে। অতএব তার পক্ষ থেকে তা পরিশোধ করো। সাদ (রাঃ) বলেন, ইয়া রাসূলুল্লাহ! আমি তার পক্ষ থেকে সব দেনা শোধ করেছি, কেবল এক মহিলার দাবিকৃত দু’টি দীনার বাকী আছে। কিন্তু তার কাছে কোন প্রমাণ নেই। তিনি বলেনঃ তা তাকে দিয়ে দাও, কারণ সে সত্যবাদিনী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "২/২৪৩৪। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তার পিতা তার দায়িত্বে তিরিশ ওয়াসাক (খাদ্যশস্য) দেনা রেখে মারা যান। এক ইহূদীর নিকট থেকে তা ধার নেয়া হয়েছিল। জাবির ইবনে আবদুল্লাহ (রাঃ) তার কাছে সময় চাইলে সে তাকে সময় দিতে রাযী হলো না। জাবির (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে আলাপ করলেন যে, সে যেন তার করযের বিনিময়ে জাবিরের বাগানের খেজুর নিয়ে নেয়। ইহূদী তাতে সম্মত হলো না। পুনরায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সময় দিতে বললে এবারও সে তাকে সময় দিতে রাজী হলো না। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জাবিরের বাগানে প্রবেশ করে তার মধ্যে পায়চারি করলেন, তারপর জাবির (রাঃ)-কে বললেনঃ খেজুর কেটে তার সম্পূর্ণ পাওনা তাকে মিটিয়ে দাও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রত্যাবর্তনের পর জাবির (রাঃ) তা কাটলেন এবং তা থেকে ইহূদীকে তিরিশ ওয়াসাক দেয়ার পর আরো ১২ ওয়াসাক উদ্বৃত্ত হলো। অতএব জাবির (রাঃ) এ খবর জানানোর জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে অনুপস্থিত পেলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে এলে তিনি তাঁর কাছে এসে জানান যে, তিনি ইহূদীর সম্পূর্ণ পাওনা পরিশোধ করেছেন এবং যা উদ্বৃত্ত হলো তার কথাও তাঁকে অবহিত করলেন। রাসূলুল্লাহ বললেনঃ খবরটি উমার ইবনুল খাত্তাবকেও পৌঁছিয়ে দাও। জাবির (রাঃ) উমর (রাঃ) এর কাছে গিয়ে তাকে খবরটি জানালে তিনি তাকে বলেনঃ আমি জানতাম যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন বাগানের মধ্যে পায়চারি করেছেন তখন আল্লাহ তা‘আল অবশ্যই তাতে বরকত দিবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "২/২৫২৮। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি এজমালি গোলামের তার নিজ অংশ আযাদ করে দিলে সে তার ন্যায়সংগত মূল্য নির্ধারণপূর্বক তার মাল দ্বারা অন্যান্য শরীকের অংশের মূল্যও পরিশোধ করবে। অন্যথায় যতটুকু আযাদ করা হয়েছে সে ততটুকুই আযাদ গণ্য হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 46
			}
		}
	]
}