{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "২৭১৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আবূ হুরায়রা! ফারায়েয শিক্ষা করো এবং (অন্যদের) তা শিক্ষা দাও। কেননা তা জ্ঞানের অর্ধেক। আর এটা ভুলিয়ে দেয়া হবে এবং এটাই প্রথম জিনিস যা আমার উম্মাত থেকে (শেষ যুগে) ছিনিয়ে নেয়া হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "১/২৭২০। জাবের ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, সাদ ইবনুর রাবী (রাঃ) এর স্ত্রী সা‘দের দু’ কন্যাসহ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলেন, ইয়া রাসূলাল্লাহ! এরা দু’জন সা‘দ (রাঃ) এর কন্যা, যিনি আপনার সাথে উহুদের যুদ্ধে শরীক হয়ে শহীদ হয়েছেন। এদের পিতার পরিত্যক্ত সমস্ত মাল এদের চাচা দখল করে নিয়েছে। মেয়েদের সম্পদ না থাকলে তাদের বিবাহ দেয়া যায় না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করে রইলেন। শেষে উত্তরাধিকার স্বত্ব সংক্রান্ত আয়াত নাযিল হলো। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা‘দ ইবনুর রাবী‘র ভাইকে ডেকে এনে বলেনঃ সা‘দের কন্যাদ্বয়কে তার সম্পদের দুই-তৃতীয়াংশ দাও, তার স্ত্রীকে এক-অষ্টমাংশ দাও, অবশিষ্ট যা থাকে তা তুমি নাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "২/২৭২১। হুযাইল ইবনে শুরাহবীল (রহঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি আবূ মূসা আশআরী ও সালমান ইবনে রাবীআ আল-বাহিলী (রাঃ) -এর কাছে এসে এক কন্যা, এক পৌত্রী ও এক সহোদর বোনের ওয়ারিসী স্বত্ব সম্পর্কে জিজ্ঞাসা করলো। তারা বলেন, কন্যা পারে অর্ধেক এবং যা অবশিষ্ট থাকবে তা পাবে বোন। তুমি ইবনে মাসউদের নিকট যাও। তিনিও হয়তো আমাদের সাথে একমত হবেন। অতঃপর লোকটি ইবনে মাসউদ (রাঃ) এর নিকট গিয়ে জিজ্ঞাসা করলো এবং তারা যা বলেছিলেন তাও তাকে অবহিত করলো। আবদুল্লাহ ইবনে মাসউদ (রাঃ) বলেন, তাহলে আমি পথভ্রষ্ট হয়ে যাবো এবং হেদায়াতপ্রাপ্তদের অন্তর্ভুক্ত থাকবো না। এ ব্যাপারে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুরূপ ফায়সালাই দিবো। কন্যা পাবে অর্ধাংশ এবং পৌত্রী পাবে এক-ষষ্ঠাংশ। এভাবে উভয়ের অংশ মিলে দুই-তৃতীয়াংশ পূর্ণ হবে। অবশিষ্ট যা থাকবে তা পাবে বোন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "১/২৭২২। মা‘কিল ইবনে ইয়াসার আল-মুযানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুনেছি যে, একটি ফারায়েযের বিষয় উত্থাপিত হলো, যাতে দাদাও অন্তর্ভুক্ত ছিল। তিনি দাদাকে এক-তৃতীয়াশ বা এক-ষষ্ঠাংশ দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "২/২৭২৩। মাকিল ইবনে ইয়াসার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মধ্যেকার দাদাকে এক-যষ্ঠাংশ ওয়ারিসী স্বত্ব প্রদানের নির্দেশ দিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "১/২৭২৪। কাবীসা ইবনে যুওয়াইব (রহঃ) থেকে বর্ণিত। তিনি বলেন, এক দাদী বা নানী আবূ বাকর সিদ্দীক (রাঃ) এর নিকট এসে তার ওয়ারিসী স্বত্ব সম্পর্কে জিজ্ঞেস করলো। আবূ বাকর (রাঃ) তাকে বলেন, তোমার জন্য আল্লাহর কিতাবে কিছু নির্ধারিত নেই। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীসেও তোমার জন্য কিছু নির্ধারিত আছে বলে আমি জানি না। তুমি ফিরে যাও, আমি লোকজনকে জিজ্ঞেস করে জেনে নেই। অতঃপর তিনি লোকজনের নিকট জিজ্ঞেস করলে মুগীরা ইবনে শো‘বা (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত থাকা অবস্থায় তিনি তাকে এক-ষষ্ঠাংশ দিয়েছেন। আবূ বাকর (রাঃ) জিজ্ঞেস করেন, তুমি চাড়া তোমার সাথে আরো কেউ উপস্থিত ছিল কি? তখন মুহাম্মাদ ইবনে মাসলামা আল-আনসারী (রাঃ) দাঁড়ালেন এবং মুগীরা ইবনে শো‘বা (রাঃ)-র অনুরূপ একই কথা বললেন। আবূ বাকর (রাঃ) তার জন্য এ হুকুম জারী করে দিলেন। এরপর উমার (রাঃ) এর নিকট এক দাদী বা নানী এসে তার ওয়ারিসী স্বত্ব সম্পর্কে জিজ্ঞেস করলো। তিনি বলেন, তোমার জন্য আল্লাহর কিতাবে কোন স্বত্ব নির্ধারিত নেই এবং ইতোপূর্বেকার যে ফয়সালা, তা ছিল তুমি ছাড়া ভিন্নজনের ব্যাপারে। আমি ফারায়েযে অতিরিক্ত কিছু যোগ করতে প্রস্তুত নই, বরং সেই এক-ষষ্ঠাংশই নির্ধারিত থাকবে। যদি দাদী-নানী দু’জনই একত্র হয় তবে ঐ এক-ষষ্ঠাংশ স্বত্ব তোমাদের দু’জনের মধ্যে সমানভাবে বণ্টিত হবে। আর তোমাদের দু’জনের মধ্যে যদি একজন জীবিত থাকে তবে সে একাই এই স্বত্ব পাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "২/২৭২৫। ইবনে ‘আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক দাদীকে এক-ষষ্ঠাংশ ওয়ারিসী স্বত্ব দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "১/২৭২৬। মা‘দান ইবনে আবূ তালহা আল-ই‘য়ামুরী (রহঃ) থেকে বর্ণিত। উমার ইবনুল খাত্তাব (রাঃ) জুমু‘আর দিন তাদের উদ্দেশে খুতবা দিতে দাঁড়ালেন এবং খুতবা দিলেন। তিনি আল্লাহর প্রশংসা ও গুণগান করার পর বলেন, আল্লাহর শপথ! আমি আমার পরে কালালার চেয়ে গুরুতর কোন বিষয় রেখে যাচ্ছি না। বিষয়টি সম্পর্কে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলে তিনি আমাকে এতো কঠোর জবাব দেন যে, অন্য কোন বিষয়ে ততো কঠোর জবাব আমাকে দেননি। এমনকি তিনি তাঁর আঙ্গুল দিয়ে আমার উভয় পার্শ্বদেশে অথবা আমার বুকে খোঁচা মারেন, অতঃপর বললেনঃ হে উমার! তোমার জন্য গ্রীষ্মকালে নাযিলকৃত সূরা নিসার শেষ ভাগের আয়াতটিই (৪ঃ ১৭৬) যথেষ্ট।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "২/২৭২৭। মুররা ইবনে শুরাহবীল (রহঃ) থেকে বর্ণিত। তিনি বলেন, উমার ইবনুল খাত্তাব (রাঃ) বললেন, তিনটি বিষয় সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্পষ্টভাবে বর্ণনা করে দিলে তা আমার জন্য দুনিয়া ও তার মধ্যেকার সব কিছুর চেয়ে প্রিয়তর হতো। তা হলোঃ কালালা, সূদ এবং খিলাফত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "৩/২৭২৮। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি অসুস্থ হয়ে পড়লে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর (রাঃ) -কে সাথে নিয়ে পদব্রজে আমাকে দেখতে এলেন। আমি বেহুঁশ হয়ে পড়লাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উযু করলেন, অতঃপর তাঁর উযুর পানি আমার গায়ে ছিটিয়ে দিলেন। (হুঁশ ফিরে এলে) আমি বললাম, ইয়া রাসূলাল্লাহ! আমি আমার সম্পদের ব্যাপারে কী করবো, আমি এ ব্যাপারে কী সিদ্ধান্ত নিবো? শেষভাগে মীরাছের আয়াত নাযিল হলো (অনুবাদ) ‘‘লোকে তোমার নিকট ব্যবস্থা জানতে চায়। বলো, পিতৃ-মাতৃহীন নিঃসন্তান অবস্থায় মারা গেলে এবং তার এক বোন থাকলে তার জন্য পরিত্যক্ত সম্পত্তির অর্ধাংশ এবং সে (বোন) নিঃসন্তান হলে তার ভাই তার ওয়ারিস হবে। আর দু’ বোন থাকলে তার পরিত্যক্ত সম্পত্তির দুই-তৃতীয়াংশ তাদের প্রাপ্য। আর ভাই-বোন থাকলে এক পুরুষের অংশ দু’ নারীর অংশের সমান। তোমরা যাতে পথভ্রষ্ট না হও সেজন্য আল্লাহ তোমাদের পরিষ্কারভাবে জানিয়ে দিচ্ছেন। আল্লাহ সর্ববিষয়ে সবিশেষ অবহিত’’ (সূরা নিসাঃ ১৭৬)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "১/২৭২৯। উসামা ইবনে যায়েদ (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মুসলিম ব্যক্তি কাফের ব্যক্তির ওয়ারিস হবে না এবং কাফেরও মুসলিমের ওয়ারিস হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "২/২৭৩০। উসামা ইবনে যায়েদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, ইয়া রাসূলাল্লাহ! আপনি কি মক্কায় আপনার বাড়িতে অবস্থান করবেন? তিনি বলেনঃ আকীল কি আমাদের জন্য কোন ঘর-বাড়ি বা ঠিকানা অবশিষ্ট রেখেছে? (রাবী বলেন,) আকীল ও তালিবই আবূ তালিবের ওয়ারিস হয়েছিল এবং জাফর ও আলী (রাঃ) তার ওয়ারিস হননি। কেননা তারা দু’জন তখন (আবূ তালিবের মৃত্যুর সময়) মুসলিম ছিলো। আর আকীল ও তালিব ছিল কাফের (আকীল পরে মুসলিম হন)। এ কারণেই উমার (রাঃ) বলতেন, কোন মুমিন কোন কাফেরের ওয়ারিস হবে না। উসামা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিম কাফেরের ওয়ারিস হবে না এবং কাফেরও মুসলিমের ওয়ারিস হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "৩/২৭৩১। ‘আমর ইবনে শু‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দু’ ভিন্ন ধর্মের লোক পরস্পরের ওয়ারিস হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "১/২৭৩২। ‘আমর ইবনে শু‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রাবাব ইবনে হুযাইফা ইবনে সাঈদ ইবনে সাহম (রহঃ) উম্মু ওয়াইল বিনতে মামার আল-জুমাহিয়্যাকে বিবাহ করেন। তার গর্ভে তার তিনটি সন্তান জন্মগ্রহণ করে। অতঃপর তাদের মা মারা গেলে তারা ওয়ারিসী সূত্রে তার পরিত্যক্ত সম্পত্তি ও তার মুক্তদাসদের ওয়ালাআর মালিক হয়। অতঃপর ‘আমর ইবনুল আ‘স (রাঃ) তাদেরকে সিরিয়ায় নিয়ে যান। সেখানে তারা আমওয়াস নামক মহামারীতে আক্রান্ত হয়ে মারা যায়। অতঃপর ‘আমর (রাঃ) তাদের ওয়ারিস হন। তিনি ছিলেন তাদের আসাবা। ‘আমর ইবনুল আ‘স (রাঃ) ফিরে এলে মা‘মারের পুত্ররা এসে তাদের বোনের ওয়ালাআর দাবিদার হয়ে উমার (রাঃ) -এর নিকট মামলা দায়ের করে। উমার (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট যা শুনেছি তদনুযায়ী তোমাদের মধ্যে ফয়সালা করবো। আমি তাঁকে বলতে শুনেছিঃ পুত্র ও পিতা (ওয়ালাআ সূত্রে) যা পেয়েছে তা তার আসাবাগণের প্রাপ্য। রাবী বলেন, অতএব তিনি এ সম্পর্কে আমাদের অনুকূলে ফয়সালা দিলেন এবং আমাদেরকে একখানা পত্র লিখে দিলেন যাতে আবদুর রহমান ইবনে আওফ (রাঃ) , যায়েদ ইবনে সাবিত (রাঃ) ও আরো একজন সাক্ষী হয়েছিলেন। এরপর আবদুল মালেক ইবনে মারওয়ানের খেলাফতকালে উম্মু ওয়াইলের এক মুক্তদাস দু’ হাজার দীনার রেখে মারা গেলো। আমি অবহিত হলাম যে, পূর্বের সেই ফয়সালা পরিবর্তন করা হয়েছে। অতএব তারা হিশাম ইবনে ইসমাঈলের নিকট অভিযোগ দায়ের করলে তিনি আমাদেরকে আবদুল মালেকের নিকট পাঠান। আমরা তার কাছে উমার (রাঃ) এর পত্রসহ উপস্থিত হলাম। তিনি বলেন, আমি জানতাম না যে, এই সুস্পষ্ট ফয়সালা নিয়েও লোকজন বিবাদ করবে। আমার ধারণা ছিলো না যে, মদীনাবাসীদের অবস্থা এমন পর্যায়ে পৌঁছবে যে, তারা এই ফয়সালা নিয়ে সন্দেহ করবে। অতএব তিনি এ ব্যাপারে আমাদের পক্ষে রায় দিলেন এবং এরপর থেকে আমরা এ সম্পত্তি ওয়ারিসী সূত্রে ভোগদখল করে আসছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "২/২৭৩৩। আয়েশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একটি মুক্তদাস খেজুর গাছ থেকে পড়ে মারা যায়। তার কিছু সম্পদও ছিল, কিন্তু কোন সন্তান বা আত্মীয়-স্বজন ছিলো না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তার পরিত্যক্ত সষ্পত্তি তার গ্রামের কোন লোককে দান করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "৩/২৭৩৪। আবদুল্লাহ ইবনে শাদ্দাদের বৈপিত্রেয় বোন এবং হামযা (রাঃ) এর কন্যা থেকে বর্ণিত। তিনি বলেন, আমার এক মুক্তদাস একটি কন্যা সন্তান রেখে মারা যায়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পরিত্যক্ত সম্পদ আমার ও তার সেই কন্যার মধ্যে বণ্টন করেন। তিনি আমাকে দিলেন অর্ধেক এবং তাকে দিলেন অর্ধেক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "১/২৭৩৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হত্যাকারী ওয়ারিস হবে না (উত্তরাধিকার স্বত্ব পাবে না)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "২/২৭৩৬। আবদুল্লাহ ইবনে ‘আমর (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন দাঁড়িয়ে বলেনঃ স্ত্রী তার স্বামীর দিয়াত ও পরিত্যক্ত সম্পদের ওয়ারিস হবে এবং স্বামী স্ত্রীর দিয়াত ও পরিত্যক্ত সম্পদের ওয়ারিস হবে, যদি না একজন অপরজনকে হত্যা করে। তাদের একজন অপরজনকে ইচ্ছাকৃতভাবে হত্যা করলে সে তার দিয়াত ও সম্পদ কিছুরই ওয়ারিস হবে না। অবশ্য একজন অপরজনকে ভুলবশত হত্যা করলে তার সম্পদের ওয়ারিস হবে কিন্তু দিয়াতের ওয়ারিস হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "১/২৭৩৭। আবূ উমামা ইবনে সাহল ইবনে হুনাইফ (রহঃ) থেকে বর্ণিত। এক ব্যক্তি অপর ব্যক্তিকে তীর নিক্ষেপ করে হত্যা করলো। নিহতের এক মামা ছাড়া আর কোন ওয়ারিস ছিলো না। আবূ উবায়দা ইবনুল জাররাহ (রাঃ) বিষয়টি নিয়ে উমার (রাঃ) কে পত্র লিখেন। উমার (রাঃ) তাকে লিখে জানান যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার কোন অভিভাবক নেই আল্লাহ ও তাঁর রাসূলই তার অভিভাবক এবং যার কোন ওয়ারিস নেই মামাই তার ওয়ারিস।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "২/২৭৩৮। শামনিবাসী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী মিকদাম আবূ কারীমা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি সম্পদ রেখে গেলে তা তার ওয়ারিসদের প্রাপ্য। আর কোন ব্যক্তি ঋণের বোঝা বা অসহায় সন্তান রেখে গেলে সেগুলোর দায়িত্ব আমাদের উপর। তিনি কখনো বলতেনঃ তার দায়িত্ব আল্লাহ ও তাঁর রাসূলের উপর। যার কোন ওয়ারিস নাই আমিই তার ওয়ারিস। আমিই তার পক্ষ থেকে দিয়াত পরিশোধ করবো এবং আমি তার পরিত্যক্ত মাল গ্রহণ করবো। আর যার অন্য কোন ওয়ারিস নাই মামাই তার ওয়ারিস। সে তার পক্ষ থেকে দিয়াত পরিশোধ করবে এবং তার পরিত্যক্ত মাল গ্রহণ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "১/২৭৩৯। ‘আলী ইবনে আবূ তালিব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফয়সালা দিয়েছেনঃ একই মায়ের সন্তানরা পরস্পরের ওয়ারিস হবে, বৈমাত্রেয় ভাইগণ নয়। মানুষ তার সহোদর ভাই-বোনের ওয়ারিস হবে, বৈমাত্রেয় ভাই-বোনের নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "২/২৭৪০। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যাবিল ফরূযের মধ্যে মৃতের সম্পদ বণ্টন করো আল্লাহর কিতাব অনুযায়ী। তাদের জন্য নির্ধারিত অংশ তাদেরকে দেয়ার পর যা অবশিষ্ট থাকবে তা (মৃতের) সবচেয়ে নিকটতম পুরুষ আত্মীয় পাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "১/২৭৪১। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এক ব্যক্তি মারা গেলো এবং তার একটি মুক্তদাস ছাড়া আর কোন ওয়ারিস রেখে যায়নি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পরিত্যক্ত সম্পত্তি সেই মুক্তদাসকে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "১/২৭৪২। ওয়াসিলা ইবনুল আসকা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নারীগণ বিশেষ তিন শ্রেণীর লোকের ওয়ারিস হতে পারে। (১) তার আযাদকৃত দাস-দাসীর, (২) পরিত্যক্ত শিশুর যাকে সে কুড়িয়ে পেয়েছে এবং (৩) সেই সন্তানের যার সম্পর্কে সে স্বামীর সাথে লি‘আন (অভিশাপযুক্ত শপথ) করেছে। মুহাম্মাদ ইবনে ইয়াযীদ (রহঃ) বলেন, এ হাদীস হিশাম ছাড়া অন্য কেউ রিওয়ায়াত করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "১/২৭৪৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, লিআন সম্পর্কিত আয়াত নাযিল হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে নারী কোন সম্প্রদায়ের সাথে এমন বাচ্চাকে শামিল করে যে তাদের নয়, তার সাথে আল্লাহর কোন সম্পর্ক নেই এবং তিনি কখনো তাকে জান্নাতে প্রবেশ করাবেন না। আর যে পুরুষ নিজের সন্তানকে চিনতে পেরেও অস্বীকার করলো, কিয়ামতের দিন আল্লাহ তার থেকে আড়ালে থাকবেন এবং সমস্ত সৃষ্টিকুলের সামনে তাকে অপমান করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "২/২৭৪৪। ‘আমর ইবনে শু‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এমন লোককে নিজ বংশীয় দাবি করা কুফরী যাকে লোকে চিনে না, অথবা সামান্য সম্পর্ক থাকা সত্ত্বেও নিজের বংশের লোককে অস্বীকার করাও কুফরী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "১/২৭৪৫। ‘আমর ইবনে শু‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি বাঁদী বা স্বাধীন নারীর সাথে যেনা করলে তার পরিণতিতে যে সন্তান হবে তা জারজ সন্তান। পুরুষ লোকটিও ঐ সন্তানের ওয়ারিস হবে না এবং ঐ সন্তানও পুরুষ লোকটির ওয়ারিস হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "২/২৭৪৬। ‘আমর ইবনে শু‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তির মৃত্যুর পর কোন শিশুকে তার সন্তানরূপে তার সাথে সম্পৃক্ত করা হলো এবং মৃতের ওয়ারিসগণ তার সম্পর্কে এই দাবি করলো, ‘‘সে আমাদের বংশীয়’’, তার ক্ষেত্রে ফয়সালা এই যে, সে যে দাসীর গর্ভজাত, মালিকের মালিকানায় থাকা অবস্থায় যদি তার সাথে তার সঙ্গম হয়ে থাকে তবে সেই সন্তান যার বলে দাবি করা হচ্ছে তার সাথে সম্পৃক্ত হবে। তবে ইতোপূর্বে (জাহিলী যুগে) যে ওয়ারিসী স্বত্ব বণ্টিত হয়েছে সে তার কিছুই পাবে না। আর যে ওয়ারিসী স্বত্ব এখনও বন্টিত হয়নি তা থেকে সে তার অংশ পাবে। পক্ষান্তরে তাকে যে পিতার সাথে সম্পৃক্ত করা হচ্ছে, সেই পিতা তাকে অস্বীকার করলে ওয়ারিসগণের দাবির কোন কার্যকারিতা নাই। আর সেই সন্তান যদি তার মালিকানাহীন কোন দাসীর গর্ভজাত হয়ে থাকে অথবা কোন স্বাধীন নারীর সাথে তার যেনার পরিণতিতে হয়ে থাকে, তাহলে উক্ত সন্তান তার সাথে সম্পৃক্ত হবে না এবং সে তার পরিত্যক্ত সম্পত্তিও পাবে না, যদিও সে তাকে তার সন্তান বলে দাবি করে। সে হবে জারজ সন্তান। সে তার মায়ের বংশের সাথে সম্পৃক্ত হবে, সে স্বাধীন নারী হোক বা ক্রীতদাসী। রাবী মুহাম্মাদ ইবনে রাশেদ বলেন, এখানে বণ্টনের অর্থ হলোঃ যে ওয়ারিসী স্বত্ব ইসলামের পূর্বে জাহিলী যুগে বণ্টিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "১/২৭৪৭। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওয়ালাআ স্বত্ব বিক্রয় বা হেবা করতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "২/২৭৪৮। ইবনে উমার (রহঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওয়ালাআ স্বত্ব বিক্রয় বা হেবা করতে নিষেধ করেজেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "১/২৭৪৯। আবদুল্লাহ ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যেসব ওয়ারিসী স্বত্ব জাহিলী যুগে বণ্টিত হয়েছে তা সেই জাহিলী যুগের বণ্টন নীতি অনুযায়ী বহাল থাকবে। আর যেসব ওয়ারিসী স্বত্ব ইসলামী যুগে উদ্ভূত হয়েছে তা ইসলামের বণ্টন নীতি অনুযায়ী বণ্টিত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "১/২৭৫০। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সদ্যজাত শিশু চীৎকার দিলে তার (জানাযার) নামায পড়তে হবে এবং সে ওয়ারিস হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "২/২৭৫১। জাবির ইবনে আবদুল্লাহ ও মিসওয়ার ইবনে মাখরামা (রাঃ) থেকে বর্ণিত। তারা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সদ্যজাত শিশু সশব্দে চীৎকার না দেয়া পর্যন্ত ওয়ারিস হবে না। রাবী বলেন, তার সশব্দে চীৎকারের অর্থ হলোঃ ক্রন্দন করা, চিল্লানো বা হাঁচি দেয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "১/২৭৫২। তামীম আদ-দারী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! আহলে কিতাবের কেউ কারো কাছে ইসলাম গ্রহণ করলে তার বিধান কী? তিনি বলেনঃ সে (মুসলিম ব্যক্তি) তার (নও মুসলিমের) জীবনে ও মরণে অন্য সব লোকের চেয়ে অগ্রগণ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		}
	]
}