{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2753,
			"arabicnumber": 2753,
			"text": "১/২৭৫৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আল্লাহর রাস্তায় বের হয়, আমার রাস্তায় জিহাদ, আমার উপর ঈমান এবং আমার রাসূলগণকে সত্যবাদী বলে মেনে নেয়াই তাকে এ পথে বের করে, তার জন্য আমার যিম্মাদারি এই যে, আমি তাকে জান্নাতে প্রবেশ করাবো অথবা তাকে তার বের হওয়ার স্থান অর্থাৎ তার আবাসে তাকে সওয়াব ও গনীমাতসহ ফিরিয়ে আনবো। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সেই সত্তার শপথ যাঁর হাতে আমার প্রাণ! আমি মুসলিমদের জন্য কষ্টসাধ্য মনে না করলে তারা আল্লাহর রাস্তায় যে যুদ্ধেই যায় আমি পিছনে থেকে যেতাম না। কিন্তু আমার এতোটুকু সঙ্গতি নাই যে, আমি তাদের প্রত্যেকের সওয়ারীর ব্যবস্থা করে দিবো এবং তাদেরও সঙ্গতি নাই যে, প্রতিটি যুদ্ধে তারা আমার সাথে যাবে। আমি তাদেরকে আমার সাথে না নিয়ে গেলে তাদেরও দুশ্চিন্তা হবে। সেই সত্তার শপথ যাঁর হাতে মুহাম্মাদের প্রাণ! আমার ইচ্ছে হয় যে, আমি আল্লাহর রাস্তায় জিহাদ করে শহীদ হই, তারপর আবার জিহাদ করে শহীদ হই, তারপর আবার জিহাদ করে শহীদ হই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": 2754,
			"text": "২/২৭৫৪। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তাঁর রাস্তায় জিহাদকারীর যিম্মাদার। হয় তিনি তাকে তার ক্ষমা ও রহমতে ধন্য করে উঠিয়ে নিবেন অথবা তাকে সওয়াব ও গনীমাতসহ ফিরিয়ে আনবেন। আল্লাহর রাস্তায় জিহাদকারী সেই ব্যক্তির ন্যায় যে অক্লান্তভাবে (দিনভর) রোযা রাখে এবং (রাতভর) নামায পড়ে জিহা থেকে ফিরে না আসা পর্যন্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": 2755,
			"text": "১/২৭৫৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর রাস্তায় একটি সকাল অথবা একটি বিকাল অতিবাহিত করা দুনিয়া ও তার মধ্যকার সবকিছু থেকে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": 2756,
			"text": "২/২৭৫৬। সাহল ইবনে সাদ আস-সাইদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর রাস্তায় একটি সকাল বা একটি বিকাল অতিবাহিত করা দুনিয়া ও তার মধ্যকার সবকিছু থেকে কল্যাণকর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": 2757,
			"text": "৩/২৭৫৭। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর রাস্তায় একটি সকাল অথবা একটি বিকাল ব্যয় করা দুনিয়া ও তার মধ্যকার সবকিছু থেকে কল্যাণকর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "১/২৭৫৮। উমার ইবনুল খাত্তাব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যে ব্যক্তি কোন গাযীকে আল্লাহর রাস্তায় জিহাদের সরঞ্জামের ব্যবস্থা করে দেয় যাতে সে যুদ্ধ করতে সক্ষম হয়, এতে তার সেই যোদ্ধার অনুরূপ সওয়াব হতে থাকে যতক্ষণ না সে মৃত্যুবরণ করে (বা নিহত হয়) অথবা ফিরে আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": 2759,
			"text": "২/২৭৫৯। যায়েদ ইবনে খালিদ আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আল্লাহর রাস্তায় কোন গাযীকে (যুদ্ধের) সরঞ্জাম সংগ্রহ করে দেয়, তার সেই গাযীর সমপরিমাণ সওয়াব হয় এবং এতে গাযীর সওয়াব থেকে মোটেও কমানো হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": 2760,
			"text": "১/২৭৬০। সাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লোকে যে দীনারগুলো (অর্থ-সম্পদ) খরচ করে তার মধ্যে সবচেয়ে উত্তম দীনার হলো- যা সে তার পরিবার-পরিজনের জন্য ব্যয় করে, যা সে আল্লাহর রাস্তায় জিহাদের ঘোড়া প্রতিপালনে ব্যয় করে এবং যা সে আল্লাহর রাস্তায় জিহাদকারী তার সহ-যোদ্ধাদের জন্য খরচ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": 2761,
			"text": "২/২৭৬১। ‘আলী ইবনে আবূ তালিব, আবূ দারদা, আবূ হুরায়রা, আবূ উমামা আল-বাহিলী, ‘আবদুল্লাহ ইবনে ‘উমার, আবদুল্লাহ ইবনে ‘আমর, জাবির ইবনে আবদুল্লাহ ও ইমরান ইবনুল হুসাইন (রাঃ) থেকে বর্ণিত। তারা সকলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন যে, তিনি বলেছেনঃ যে ব্যক্তি আল্লাহর রাস্তায় জিহাদের খরচ বহন করে এবং সে নিজ আবাসে থেকে যায়, সে তার প্রতিটি দিরহামের বিনিময়ে সাত শত দিরহামের সওয়াব লাভ করে। আর যে ব্যক্তি সশরীরে আল্লাহর রাস্তায় জিহাদ করে এবং এর খরচ বহন করে, তার প্রতিটি দিরহামের বিনিময়ে সে সাত লাখ দিরহামের সওয়াব পায়। অতঃপর তিনি এ আয়াত তিলাওয়াত করেন (অনুবাদ) ‘‘আল্লাহ যাকে ইচ্ছা বহু গুণে বৃদ্ধি করে দেন ’’ (সূরা বাকারাঃ ২৬১)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": 2762,
			"text": "১/২৭৬২। আবূ উমামা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি জিহাদ করে না বা জিহাদকারীর সরঞ্জাম প্রস্তুত করে দেয় না অথবা জিহাদকারী (যুদ্ধে) যাওয়ার পর তার পরিবার-পরিজনের উত্তমরূপে খোঁজ-খবর নেয় না, মহান আল্লাহ তাকে কিয়ামতের পূর্বে ভীষণ বিপদে নিক্ষেপ করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": 2763,
			"text": "২/২৭৬৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আল্লাহর সাথে এমতাবস্থায় সাক্ষাত করবে যে, তার মধ্যে আল্লাহর রাস্তায় (জিহাদের) কোন চিহ্ন নাই সে ক্ষতিগ্রস্ত অবস্থায় আল্লাহর সাথে সাক্ষাত করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "১/২৭৬৪। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাবুকের যুদ্ধ থেকে প্রত্যাবর্তন করে মদীনার নিকটবর্তী হয়ে বলেনঃ মদীনায় এমন কতক লোক আছে যে, তোমরা যেখানেই গিয়েছো এবং যে উপত্যকাই অতিক্রম করেছো, তারা তোমাদের সাথেই ছিল। সাহাবাগণ বলেন, হে আল্লাহর রাসূল! তারা মদীনায় থেকেও (আমাদের সাথে ছিলেন)! তিনি বলেনঃ তারা মদীনায় থেকেও, তাদের অক্ষমতা তাদের প্রতিরোধ করে রেখেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "২/২৭৬৫। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদীনায় এমন কতক লোক আছে যে, তোমরা যে উপত্যকাই অতিক্রম করেছো এবং যে পথই চলেছো তারা সওয়াবে তোমাদের সাথে শরীক আছে, প্রতিবন্ধকতা তাদেরকে আটকে রেখেছে। আবূ আবদুল্লাহ ইবনে মাজা (রহঃ) বলেন, আহমাদ ইবনে সিনান অনুরূপ কিছু বলেছেন। আমি তার মূল পাঠ লিখে নিয়েছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": 2766,
			"text": "১/২৭৬৬। আবদুল্লাহ ইবনুয যুবাইর (রাঃ) থেকে বর্ণিত। তিনি বলেন, উসমান ইবনে আফফান (রাঃ) লোকেদের উদ্দেশে ভাষণ দিলেন। তিনি বলেন, হে জনগণ! আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট একটি হাদীস শুনেছি। সেটি তোমাদের নিকট বর্ণনা করা থেকে আমাকে বিরত রেখেছে তোমাদের সাহচর্যের প্রতি আমার কৃপণতা। অতএব কেউ চাইলে তা নিজের জন্য গ্রহণ করতে পারে অথবা পরিহারও করতে পারে। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে ব্যক্তি আল্লাহ তা‘আলার রাস্তায় এক রাত সীমান্ত অঞ্চলে পাহারা দেয়, তা এক হাজার দিন রোযা রাখা এবং এক হাজার রাত জেগে নামায পড়ার সমতুল্য।",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": 2767,
			"text": "২/২৭৬৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তি আল্লাহর রাস্তায় সীমান্ত অঞ্চল পাহারাদানরত অবস্থায় মারা গেলে আল্লাহ তার জন্য সেইসব নেক আমলের সওয়াব প্রদান অব্যাহত রাখবেন যা সে করতো, জান্নাতে তাকে রিযিক দান করবেন, কবরের বিপর্যয়কর অবস্থা থেকে নিরাপদ রাখবেন এবং কিয়ামতের ভয়ভীতি থেকে মুক্ত অবস্থায় উঠাবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "৩/২৭৬৮। উবাই ইবনে কা‘ব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমযান মাস ব্যতীত অন্য মাসে সওয়াবের আশায় মুসলিমদের জন্য আল্লাহর রাস্তায় সীমান্ত চৌকিতে এক দিন পাহারা দেয়া একশত বছরের ইবাদত, রোযা ও (নফল) নামায অপেক্ষা অধিক সওয়াবের কাজ। আর রমযান মাসে সওয়াবের আশায় আল্লাহর রাস্তায় মুসলিমদের নিরাপত্তার জন্য এক দিন পাহারা দেয়া আল্লাহর নিকট এক হাজার বছরের ইবাদত, রোযা ও নামায অপেক্ষা অধিক সওয়াবের কাজ। আল্লাহ যদি তাকে নিরাপদে তার পরিবার-পরিজনের নিকট ফিরিয়ে আনেন তবে এক হাজার বছর পর্যন্ত তার কোন গুনাহ লেখা হবে না, তার জন্য নেকী লেখা হবে এবং কিয়ামত পর্যন্ত তার জন্য সীমান্ত চৌকিতে পাহারাদানের সওয়াব অব্যাহতভাবে লিপিবদ্ধ হতে থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": 2769,
			"text": "১/২৭৬৯। উকবা ইবনে আমের আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা‘আলা নিরাপত্তামূলক পাহারাদানকারীদের উপর রহমত বর্ষণ করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": 2770,
			"text": "২/২৭৭০। আনাস ইবনু মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ আল্লাহর রাস্তায় একরাত পাহারা দেয়া কোন লোকের নিজ পরিবারে অবস্থানরত থেকে এক হাজার বছর রোযা রাকা ও নামায পড়ার চেয়ে অধিক উত্তম। এক বছর হলো তিন শত ষাট দিনে, যার প্রতিটি দিন এক হাজার বছরের সমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": 2771,
			"text": "৩/২৭৭১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বলেনঃ আল্লাহভীতি অবলম্বনের এবং প্রতিটি উচুঁ স্থানে আরোহণকালে তাকবীর ধ্বনি করার জন্য আমি তোমাকে উপদেশ দিচ্ছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": 2772,
			"text": "১/২৭৭২। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রসঙ্গ উল্লেখ করা হলে তিনি বলেন, তিনি ছিলেন মানুষের মধ্যে সর্বাধিক সুন্দর, সর্বাধিক দানশীল এবং সর্বাধিক সাহসী বীর পুরুষ। এক রাতে মদীনাবাসী সন্ত্রস্ত হয়ে পড়লো। তারা একটি বিকট শব্দ শুনে সেদিকে ছুটলো। পথিমধ্যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সাথে মিলিত হলেন। অবশ্য তিনি তাদের আগেই সেই বিকট শব্দের কারণ অনুসন্ধানে গিয়েছিলেন। তিনি আবূ তাল্হা (রাঃ) এর ঘোড়ার গদিহীন খালি পিঠে সওয়ার ছিলেন। তাঁর ঘাড়ে তরবারি ঝুলানো ছিল। তিনি বলছিলেনঃ হে জনগণ! তোমরা সন্ত্রস্ত হয়ো না। এই বলে তিনি তাদের ফিরিয়ে আনছিলেন। অতঃপর তিনি ঘোড়া সম্পর্কে মন্তব্য করেনঃ আমি এটিকে সমুদ্রের ন্যায় পেয়েছি অথবা এটি যেন একটি সমুদ্র। রাবী হাম্মাদ (রহঃ) বলেন, সাবিত (রহঃ) বা অপর কেউ আমাকে বলেছেন যে, আবূ তালহা (রাঃ) এর ঘোড়াটি ছিল মন্থর গতিসম্পন্ন। কিন্তু এ দিনের পর থেকে কোন ঘোড়াই দৌড় প্রতিযোগিতায় একে অতিক্রম করতে পারেনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": 2773,
			"text": "২/২৭৭৩। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদেরকে জিহাদে যোগদানের আহবান জানানো হলে তোমরা বেরিয়ে পড়বে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": 2774,
			"text": "৩/২৭৭৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর পথে ধুলা এবং জাহান্নামের ধোঁয়া কোনো মুসলিম বান্দার পেটে একত্র হতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "৪/২৭৭৫। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আল্লাহর পথে একটি বিকাল চললো, তাতে সে যতোটা ধুলিমলিন হলো, তা কিয়ামতের দিন তার জন্য এর সমপরিমাণ কস্তরীতে পরিণত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": 2776,
			"text": "১/২৭৭৬। আনাস ইবনে মালেক (রাঃ) এর খালা উম্মু হারাম বিনতে মিলহান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক দিন আমার ঘরে ঘুমালেন। তিনি হাসতে হাসতে জাগ্রত হলেন। আমি বললাম, ইয়া রাসূলাল্লাহ! আপনাকে কে হাসালো? তিনি বলেনঃ আমার উম্মাতের কতক লোককে সমুদ্রপৃষ্ঠে উপবিষ্ট অবস্থায় আমার সামনে পেশ করা হয়েছে, যেভাবে বাদশাহ সিংহাসনে উপবিষ্ট থাকে। উম্মু হারাম (রাঃ) বলেন, আপনি আল্লাহর নিকট দোয়া করুন যাতে তিনি আমাকে তাদের অন্তর্ভুক্ত করেন। আনাস (রাঃ) বলেন, তিনি তার জন্য দোয়া করলেন। তিনি পুনরায় ঘুমিয়ে পড়লেন, অতঃপর পূর্বের ন্যায় জাগ্রত হলেন। উম্মু হারাম (রাঃ) জিজ্ঞাসা করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পূর্বানুরূপ জবাব দেন। উম্মু হারাম (রাঃ) বলেন, আপনি আল্লাহর নিকট দোয়া করুন যাতে তিনি আমাকে তাদের অন্তর্ভুক্ত করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি প্রথম দলের অন্তর্ভুক্ত থাকবে। আনাস (রাঃ) বলেন, মুসলিমগণ মুআবিয়া ইবনে আবূ সুফিয়ান (রাঃ)-র নেতৃত্বে সর্বপ্রথম নৌযুদ্ধে রওয়ানা হলে উম্মু হারাম (রাঃ)ও তার স্বামী উবাদা ইবনুস সামিত (রাঃ)-এর সাথে জিহাদে রওয়ানা হলেন। তারা জিহাদ থেকে ফিরে এসে সিরিয়ায় অবতরণ করেন। আরোহণের জন্য তার নিকট একটি জন্তুযান আনা হলো। জন্তুটি তাকে ছুড়ে ফেলে দিলে তিনি তাতে নিহত হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": 2777,
			"text": "২/২৭৭৭। আবূ দারদা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ একটি নৌযুদ্ধ দশটি স্থলযুদ্ধের সমতুল্য। আর সমুদ্রে যার মাথাঘুরানি হবে সে মহান আল্লাহর রাস্তায় রক্তে রঞ্জিত (নিহত) ব্যক্তির সমতুল্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": 2778,
			"text": "৩/২৭৭৮। আবূ উমামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ একজন শহীদ নৌযোদ্ধার মর্যাদা দু’জন শহীদ স্থলযোদ্ধার সমান। আর নৌ-পথে যার মাথাঘুরানি হয়, তার মর্যাদা স্থলযুদ্ধে শহীদের মর্যাদার সমান। আর দু’টি ঢেউয়ের মধ্যবর্তী দূরত বঅতিক্রমকারীর মর্যাদা আল্লাহর আনুগত্যে সারা দুনিয়া সফরকারীর সমান। আল্লাহ তা‘আলা মৃত্যুদূতকে নৌযোদ্ধা ব্যতীত সকলের রূহ হরণ করার দায়িত্ব দিয়েছেন। স্বয়ং আল্লাহ নৌযোদ্ধার রূহ নিয়ে নেন। তিনি যুদ্ধে শহীদের সকল গুনাহ মাফ করেন তার ঋণ ব্যতীত, কিন্তু নৌ-যুদ্ধে শহীদের সকল গুনাহ এবং ঋণও মাফ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": 2779,
			"text": "১/২৭৭৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুনিয়ার একটি মাত্র দিনও যদি অবশিষ্ট থাকে তবে মহামহিম আল্লাহ সেই দিনটিকে দীর্ঘায়িত করবেন, যে পর্যন্ত না আমার আহলে বাইত-এর এক ব্যক্তি দায়লামের পাহাড় এবং কুসতুনতুনিয়ার কনস্টান্টিনো লের অধিপতি হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2780,
			"arabicnumber": 2780,
			"text": "২/২৭৮০। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অচিরেই তোমরা বেশ কয়েকটি দেশ এবং কাযবীন নামক শহর জয় করবে। যে ব্যক্তি তথায় চল্লিশ দিন অথবা চল্লিশ রাত প্রতিরক্ষামূলক পাহারা দিবে, জান্নাতে তার জন্য স্বর্নের গম্বুজবিশিষ্ট পীত বর্ণের মনি-মুক্তার স্তম্ভসমূহের বালাখানা থাকবে। এতে সোনার তৈরী সত্তর হাজার দরজা থাকবে এবং প্রতিটি দরজায় থাকবে একজন করে আয়তলোচনা হূর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "১/২৭৮১। মুআবিয়া ইবনে জাহিমা আস-সালামী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে বললাম, হে আল্লাহর রাসূল! আল্লাহর সন্তোষ লাভের এবং আখেরাতে জান্নাত প্রাপ্তির আশায় আমি আপনার সাথে জিহাদে যেতে চাই। তিনি বলেনঃ তোমার জন্য দুঃখ হয়, তোমার মা কি জীবিত আছে? আমি বললাম, হ্যাঁ। তিনি বলেনঃ ফিরে গিয়ে তার সেবাযত্ন করো। এরপর আমি অপর পাশ থেকে তাঁর নিকট এসে বললাম, হে আল্লাহর রাসূল! আমি আল্লাহর সন্তুষ্টি অর্জন এবং আখেরাতে জান্নাত লাভের আশায় আপনার সাথে জিহাদে যেতে চাই। তিনি বলেনঃ তোমার জন্য দুঃখ হয়, তোমার মা কি জীবিত আছে? আমি বললাম, ইয়া রাসূলাল্লাহ! হাঁ। তিনি বলেন, তুমি ফিরে যাও এবং তার সেবাযত্ন করো। এরপর আমি তাঁর সম্মুখভাগে এসে বললাম, হে আল্লাহর রাসূল। আল্লাহর সন্তুষ্টি অর্জন এবং আখেরাতে জান্নাত লাভের আশায় আমি আপনার সাথে জিহাদে যেতে চাই। তিনি বলেনঃ তোমার জন্য দুঃখ হয়, তোমার মা কি জীবিত আছে? আমি বললাম, হ্যাঁ, ইয়া রাসূলাল্লাহ! তিনি বলেনঃ তোমার জন্য আফসোস! তার পায়ের কাছে পড়ে থাকো, সেখানেই জান্নাত। ২/২৭৮১(১)। হারূন ইবনে আবদুল্লাহ আল-হাম্মাল-হাজ্জাজ ইবনে মুহাম্মাদ-ইবনে জুরাইজ-মুহাম্মাদ ইবনে তালহা-তার পিতা তালহা-মুআবিয়া ইবনে জাহিমা আস-সুলামী (রাঃ) থেকে বর্ণিত। জাহিমা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলেন ... পূর্বোক্ত হাদীসের অনুরূপ। আবূ আবদুল্লাহ ইবনে মাজা (রহঃ) বলেন, ইনি হলেন জাহিমা ইবনে আব্বাস মিরদাস আস-সালামী যিনি হুনাইন যুদ্ধের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে র্ভৎসনা করেছিলেন (পরে ইসলাম গ্রহণ করেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "৩/২৭৮২। আবদুল্লাহ ইবনে ‘আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, হে আল্লাহর রাসূল! আমি আল্লাহর সন্তুষ্টি অর্জন এবং আখেরাতে জান্নাত লাভের আশায় আপনার সাথে জিহাদে যাওয়ার ইচ্ছা নিয়ে এসেছি। আমি আমার পিতা-মাতাকে কাঁদিয়ে এসেছি। তিনি বলেনঃ তাদের নিকট ফিরে যাও এবং তাদের মুখে হাসি ফুটাও, যেভাবে তুমি তাদেরকে কাঁদিয়ে এসেছো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "১/২৭৮৩। আবূ মুসা আশ‘আরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক ব্যক্তি সম্পর্কে জিজ্ঞেস করা হলো যে, সে জিহাদ করে বীরত্ব প্রদর্শনের জন্য, সে জিহাদ করে জাতীয়তাবোধে উদ্বুদ্ধ হয়ে এবং সে জিহাদ করে প্রদর্শনীর জন্য। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে আল্লাহর কলেমা (দীন) সমুন্নত করার জন্য জিহাদ করে সে-ই হলো আল্লাহর পথে (জিহাদরত)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "২/২৭৮৪। আবূ ‘উকবা (রাঃ) থেকে বর্ণিত। তিনি ছিলেন পারস্যবাসীর মুক্তদাস। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে উহুদ যুদ্ধের দিন হাজির ছিলাম। আমি এক মুশরিককে তরবারির আঘাত হেনে বললাম, নে এটা আমার পক্ষ থেকে, আর আমি হলাম পারস্য যুবক। ঘটনাটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানতে পেরে বলেনঃ তুমি কেন বললে না, নে এটা আমার পক্ষ থেকে, আমি হলাম আনসারী যুবক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "৩/২৭৮৫। আবদুল্লাহ ইবনে ‘আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে সেনাদল আল্লাহর রাস্তায় জিহাদ করে গনীমাতের মাল লাভ করলো, তারা তাদের দু’ তৃতীয়াংশ সওয়াব সাথে সাথে পেয়ে গেলো। আর গনীমাতের মাল না পেলে তারা (আখেরাতে) পূর্ণ সওয়াব লাভ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "১/২৭৮৬। উরওয়া আল-বারিকী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঘোড়ার কপালে কিয়ামত পর্যন্ত কল্যাণ ও প্রাচুর্য বাঁধা থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "২/২৭৮৭। আবদুল্লাহ ইবনে ‘উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কিয়ামত পর্যন্ত ঘোড়ার কপালে কল্যাণ ও প্রাচুর্য যুক্ত থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "৩/২৭৮৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঘোড়ার কপালে বাঁধা রয়েছে কল্যাণ ও বরকত অথবা তিনি বলেছেনঃ কিয়ামত পর্যন্ত ঘোড়ার কপালে কল্যাণ ও বরকত বাঁধা থাকবে। ঘোড়া তিন ধরনেরঃ একজনের জন্য তা সওয়াব বয়ে আনে, একজনের জন্য তা পর্দাস্বরূপ; আরেক জনের জন্য তা পাপের কারণ হয়। ঘোড়া তার জন্য সওয়াব বয়ে আনেঃ যে লোক আল্লাহর পথে জিহাদ করার জন্য তা পোষে এবং একে সেজন্য প্রস্তুত করে রাখে। সেই ঘোড়ার পেটে যা কিছু যায় তার জন্যও তার আমলনামায় সওয়াব লেখা হয়। যদি তার ঘোড়া চারণভূমিতে চরায় তবে ঘোড়া যা কিছুই খায় তার বিনিময়ে তার আমলনামায় সওয়াব লেখা হয়। সে যদি ঘোড়াকে বহমান নদীর পানি পান করায় তবে তার পেটে যাওয়া প্রতিটি ফোঁটা পানির বিনিময়েও তার আমলনামায় একটি করে সওয়াব লেখা হয়। এমনকি তিনি ঘোড়ার পেশাব ও গোবরের বিনিময়েও সওয়াব হওয়ার কথাও উল্লেখ করেন। আর তা যদি একটি বা দু’টি টিলা অতিক্রম করে তবে তার প্রতিটি পদক্ষেপের বিনিময়ে তার আমলনামায় সওয়াব লেখা হয়। আর যে লোক ঘোড়া পোষে সম্মান ও সৌন্দর্যের উপকরণস্বরূপ তা তার জন্য আবরণ। অবশ্য সে তার ঘোড়ার সহজ বা কঠিন কর্তব্য বিস্মৃত হয় না। আর ঘোড়া যার জন্য পাপের কারণঃ যে লোক ঘোড়া পোষে অহংকারবশে ও প্রদর্শনীর উদ্দেশ্যে, তা তার জন্য পাপের কারণ হয়। তার জন্য ঘোড়া শাস্তিস্বরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "৪/২৭৮৯। আবূ কাতাদা আল-আনসারী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কালো রং-এর ঘোড়া সর্বোত্তম যার কপাল ও উপরের ওষ্ঠ সাদা। অতঃপর যে ঘোড়ার ডান পা ও কপাল ব্যতীত অবশিষ্ট পান্ডলো সাদা। যদি কালো ঘোড়া না পাওয়া যায় তবে লাল-কালো মিশ্রিত বর্ণের ঘোড়া উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "৫/২৭৯০। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিকাল ঘোড়া (অর্থাৎ তিন পা সাদা এবং এক পা শরীরের রং-বশিষ্ট) অপছন্দ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "৬/২৭৯১। তামীম আদ-দারী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে ব্যক্তি আল্লাহর পথে (জিহাদের উদ্দেশে) একটি ঘোড়া পোষে, অতঃপর স্বহস্তে একে ঘাস ও শস্যদানা খাওয়ায়, তার আমলনামায় প্রতিটি দানার বিনিময়ে একটি করে সওয়াব লেখা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "১/২৭৯২। মুআয ইবনে জাবাল (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ কোন মুসলিম ব্যক্তি মহামহিম আল্লাহর পথে একটি উষ্ট্রী দোহনের সময় পরিমাণ যুদ্ধ করলে তার জন্য জান্নাত অবধারিত হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "২/২৭৯৩। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি এক যুদ্ধে উপস্থিত ছিলাম। আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) বললেন, ‘‘হে আত্মা! আমি কি দেখছি না যে, তুমি জান্নাতকে অপছন্দ করছো! আমি আল্লাহর শপথ করে বলছি, তোমাকে অবশ্যই জান্নাতে যেতে হবে আনন্দে হোক বা নিরানন্দে’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "৩/২৭৯৪। আমর ইবনে আবাসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললাম, ইয়া রাসূলাল্লাহ! কোন্ জিহাদ উত্তম? তিনি বলেনঃ যে যুদ্ধে মুজাহিদের রক্ত প্রবাহিত হয় এবং তার ঘোড়াও আহত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "৪/২৭৯৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর পথে আহত ব্যক্তি, আল্লাহই ভালো জানেন কে তাঁর পথে আহত হয়, কিয়ামতের দিন এমন অবস্থায় উঠবে যে, তার ক্ষতস্থান আহত হওয়ার দিনের মত দগদগে তাজা থাকবে, তার রং হবে রক্তিম বর্ণ এবং তার ঘ্রাণ হবে কস্ত্তরীর মত সুগন্ধে ভরপুর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "৫/২৭৯৬। আবদুল্লাহ ইবনে আবূ আওফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাফের বাহিনীসমুহকে বদদোয়া করে বলেনঃ ‘‘হে কিতাব নাযিলকারী, দ্রুত হিসাব গ্রহণকারী আল্লাহ! আপনি বাহিনীসমূহকে পরাস্ত করুন। হে আল্লাহ! আপনি তাদের পরাস্ত করুন এবং তাদের ভীত-কম্পিত করুন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "৬/২৭৯৭। সাহল ইবনে হুনাইফ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি সর্বান্তঃকরণে সত্যিকারভাবে আল্লাহর নিকট শাহাদাত কামনা করবে, আল্লাহ তাকে শহীদদের মর্যাদা দান করবেন, যদিও সে তার বিছানায় মারা যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "১/২৭৯৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শহীদদের বিষয় উল্লেখ করা হলে তিনি বলেনঃ শহীদের রক্ত মাটিতে শুকিয়ে যাবার আগেই তার দু’জন স্ত্রী (জান্নাতের হূর) এসে তাকে এমনভাবে তুলে নেয়, যেন তারা স্তন্যদানকারিণী, যারা তাদের দুগ্ধপোষ্য সন্তানকে জঙ্গলে হারিয়ে ফেলেছে। তাদের দু’জনের প্রত্যেকের হাতে থাকবে একটি করে চাদর যা দুনিয়া ও তার মধ্যকার সব কিছুর চেয়ে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "২/২৭৯৯। মিকদাম ইবনে মাদীকারিব (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ শহীদের জন্য আল্লাহর নিকট ছয়টি বৈশিষ্ট্য রয়েছে। (১) তার দেহের রক্তের প্রথম ফোঁটাটি বের হতেই তিনি তাকে ক্ষমা করেন এবং জান্নাতে তার ঠিকানা তাকে দেখানো হয়, (২) কবরের আযাব থেকে তাকে রক্ষা করা হয়, (৩) (কিয়ামতের) ভয়ংকর ত্রাস থেকে সে নিরাপদ থাকবে; (৪) তাকে ঈমানের চাদর পরানো হবে; (৫) আয়তলোচনা হুরের সাথে তার বিবাহ দেয়া হবে এবং (৬) তার নিকট আত্মীয়দের মধ্য থেকে সত্তরজনের পক্ষে তাকে শাফা‘আত করার অনুমতি দেয়া হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "৩/২৮০০। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, উহুদের যুদ্ধের দিন আবদুল্লাহ ইবনে ‘আমর ইবনে হারাম (রাঃ) শহীদ হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে জাবির! মহামহিম আল্লাহ তোমার পিতাকে যা বলেছেন তা কি আমি তোমাকে অবহিত করবো না? আমি বললাম, হ্যাঁ। তিনি বলেনঃ আল্লাহ তা‘আলা যার সাথেই কথা বলেছেন, পর্দার অন্তরাল থেকে বলেছেন, কিন্তু তোমার পিতার সাথে সামনা সামনি কথা বলেছেন। তিনি বলেছেন, হে আমার বান্দা! তুমি আকাঙ্ক্ষা করো, আমি তোমাকে দিবো। সে বললো, হে প্রভু! আমাকে জীবিত করুন আমি পুনরায় আপনার রাস্তায় শহীদ হবো। তিনি বলেন, আমার পক্ষ থেকে পূর্বেই এটা সাব্যস্ত হয়ে গেছে যে, এখানে আসার পর তারা আর প্রত্যাবর্তন করবে না। সে বললো, প্রভু! আমার পক্ষ থেকে আমার পশ্চাতের (পৃথিবীর) লোকেদের সুসংবাদ পৌঁছে দিন। তখন মহান আল্লাহ এ আয়াত নাযিল করেন (অনুবাদ): ‘‘যারা আল্লাহর পথে নিহত হয়েছে তাদেরকে তোমরা কখনও মৃত মনে করো না, বরং তারা জীবিত এবং তাদের প্রতিপালকের নিকট থেকে তারা জীবিকাপ্রাপ্ত ....’’ (সূরা আল ইমরানঃ ১৬৯-১৭১)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "৪/২৮০১। আবদুল্লাহ (রাঃ) থেকে আল্লাহ তা‘আলার নিম্নোক্ত বাণী সম্পর্কে বর্ণিতঃ ‘‘যারা আল্লাহর পথে নিহত হয়েছে তাদেরকে তোমরা কখনো মৃত মনে করো না, বরং তারা জীবিত এবং তাদের প্রতিপালকের নিকট থেকে তারা রিযিকপ্রাপ্ত’’ (সূরা আল ইমরানঃ ১৬৯)। তিনি বলেন, আমরা উক্ত আয়াতের তাৎপর্য জিজ্ঞেস করলে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ শহীদগণের রূহ সবুজ পাখির ন্যায় স্বাধীনভাবে জান্নাতে যত্রতত্র উড়ে বেড়ায় এবং আরশের সাথে ঝুলন্ত ফানুসের মধ্যে বিশ্রাম গ্রহণ করে। একদা তাদের রূহসমূহ ঐ অবস্থায় থাকাকালে তোমার প্রতিপালক তাদের নিকট উদ্ভাসিত হয়ে বলেন, তোমরা যা ইচ্ছা আমার নিকট চাও। তারা বললো, আমাদের প্রতিপালক! আমরা আপনার নিকট আর কি চাবো! আমরা তো স্বাধীনভাবে জান্নাতের যেখানে ইচ্ছা ঘুরে বেড়াই। তারা যখন দেখলো যে, কিছু না চাওয়া পর্যন্ত তাদেরকে ছাড়া হচ্ছে না, তখন তারা বললো, আমরা আপনার নিকট চাই যে, আপনি আমাদের দেহে আমাদের রূহ ফেরত দিয়ে আমাদেরকে দুনিয়াতে পাঠাবেন, যাতে আমরা আপনার রাস্তায় জিহাদ করতে পারি। আল্লাহ যখন দেখলেন যে, তারা কেবল এটাই চাচ্ছে, তখন তাদেরকে (স্ব স্ব অবস্থায়) ত্যাগ করা হলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "৫/২৮০২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শহীদ ব্যক্তি নিহত হওয়ার সময় কোন কষ্টই অনুভব করে না, শুধু এতটুকু যে, তোমাদের কাউকে পিঁপড়ায় দংশন করলে সে যতটকু ব্যথা অনুভব করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "১/২৮০৩। জাবির ইবনে আতীক (রাঃ) থেকে বর্ণিত। তিনি অসুস্থ হয়ে পড়লে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখতে আসেন। জাবির (রাঃ) এর পরিবারের কেউ বললো, আমরা আশা করতাম যে, সে আল্লাহর রাস্তায় শহীদ হয়ে মৃত্যুবরণ করবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাহলে আমার উম্মাতের শহীদের সংখ্যা তো খুব কম হয়ে যাবে। আল্লাহর পথে নিহত হলে শহীদ, মহামারীতে নিহত হলে শহীদ, যে মহিলা গর্ভাবস্থায় মারা যায় সে শহীদ এবং পানিতে ডুবে, আগুনে পুড়ে ও ক্ষয়রোগে মৃত্যুবরণকারী শহীদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "২/২৮০৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের মধ্যে কাদের তোমরা শহীদ মনে করো? সাহাবীগণ বলেন, আল্লাহর পথে যারা নিহত হয়। তিনি বলেনঃ তাহলে তো আমার উম্মাতের শহীদের সংখ্যা কম হবে। যে ব্যক্তি আল্লাহর পথে নিহত হয় সে শহীদ, যে ব্যক্তি আল্লাহর রাস্তায় মারা যায় সে শহীদ, যে ব্যক্তি পেটের পীড়ায় মারা যায় সে শহীদ এবং যে ব্যক্তি মহামারীতে মারা যায় সেও শহীদ। সুহাইল (রহঃ) বলেন, উবায়দুল্লাহ ইবনে মিকসাম (রহঃ) আবূ সালিহ (রহঃ)-এর সূত্রে আমাকে অবহিত করেন যে, তিনি তার রিওয়ায়াতে আরো উল্লেখ করেছেনঃ পানিতে ডুবে মরা ব্যক্তিও শহীদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "১/২৮০৫। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন শিরস্ত্রাণ পরিহিত অবস্থায় মক্কায় প্রবেশ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "২/২৮০৬। সাইব ইবনে ইয়াযীদ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদের যুদ্ধের দিন দু’টি লৌহবর্ম একটির উপর অপরটি পরিধান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "৩/২৮০৭। সুলায়মান ইবনে হাবীব (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমরা আবূ উমামা (রা)-র নিকট প্রবেশ করলাম। তিনি আমাদের তরবারিতে রূপার অলঙ্করণ দেখতে পেয়ে অসন্তুষ্ট হন এবং বলেন, (আগেকার) লোকেরা বহু বিজয় অর্জন করেছিলো। কিন্তু তাদের তরবারি সোনা বা রূপা দ্বারা অলংকৃত ছিলো না, বরং শিশা, লোহা বা উটের রগ দ্বারা অলংকৃত ছিল। আবুল হাসান আল-কাত্তান (রহঃ) বলেন, হাদীসে উল্লিখিত শব্দ (علابي) ‘‘আলাবী’’-এর অর্থ ‘রগ’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "৪/২৮০৮। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ‘যুল-ফাকার’ নামক তরবারি বদরের যুদ্ধের দিন গনীমতস্বরূপ গ্রহণ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "৫/২৮০৯। ‘আলী ইবনে আবূ তালিব (রাঃ) থেকে বর্ণিত। তিনি বলেন, মুগীরা ইবনে শো‘বা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জিহাদ করতে গেলে সাথে একটি বর্শা নিতেন। ফিরে এসে তিনি বর্শাটি ফেলে দিতেন। শেষে কেউ তা তুলে এনে তাকে দিতো। ‘আলী (রাঃ) তাকে বলেন, আমি অবশ্যই এটা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলবো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এটা করো না। কেননা তুমি যদি এরূপ করো তবে কেউ আর কোন পড়ে থাকা জিনিস কুড়িয়ে নিয়ে ফেরত দিবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "৬/২৮১০। ‘আলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে একটি আরবীয় ধনুক ছিলো। তিনি এক ব্যক্তির হাতে একটি পারসিক ধনুক দেখে বলেনঃ এটা কী? এটা ফেলে দাও। তোমরা এটার অনুরূপ ধনুক রাখো এবং বর্শাও রাখো। কেননা আল্লাহ তা‘আলা এই ধনুক ও বর্শা দ্বারা তোমাদের দীনের সাহায্য করবেন এবং তোমাদের দ্বারা বিভিন্ন দেশ জয় করাবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "১/২৮১১। ‘উকবা ইবনে ‘আমের আল-জুহানী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নিশ্চয় আল্লাহ একটি তীরের উপলক্ষে তিন ব্যক্তিকে জান্নাতে প্রবেশ করাবেনঃ (১) তীর নির্মাতা যে তা নির্মাণকালে কল্যাণের আশা করে, (২) (জিহাদে) এই তীর নিক্ষেপকারী এবং (৩) যে তা নিক্ষেপে সাহায্য করে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তীরন্দাজী করো এবং ঘোড়দৌড় শিক্ষা করো। তবে তোমার ঘোড়দৌড় শেখার তুলনায় তীরন্দাজী শিক্ষা করা আমার কাছে অধিক প্রিয়। মুসলিম ব্যক্তির সকল ক্রীড়া-কৌতুকই বৃথা। তবে তার ধনুক দ্বারা তীর নিক্ষেপ, তার ঘোড়াকে প্রশিক্ষণ দান এবং তার স্ত্রীর সাথে তার ক্রীড়া-কৌতুক বৃথা নয়। কারণ এগুলো উপকারী ও বিধিসম্মত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "২/২৮১২। ‘আমর ইবনে ‘আবাসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে ব্যক্তি শত্রুবাহিনীর প্রতি একটি তীর নিক্ষেপ করলো, অতঃপর তা শত্রুবাহিনী পর্যন্ত গিয়ে পৌছে লক্ষ্যে আঘাত হানুক বা লক্ষ্যভ্রষ্ট হোক, তা একটি গোলাম আযাদ করার সমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "৩/২৮১৩। উকবা ইবনে আমের আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মিম্বারের উপর দাঁড়িয়ে তিলাওয়াত করতে শুনেছি (অনুবাদ) ‘‘তোমরা দুশমনের বিরুদ্ধে যথাসাধ্য শক্তি সঞ্চয় করো’’ (সূরা আনফালঃ ৬০)। জেনে রেখো! এই শক্তি হলো তীরন্দাজী। কথাটি তিনি তিনবার বলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "৪/২৮১৪। ‘উকবা ইবনে ‘আমের আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যে ব্যক্তি তীরন্দাজী শিক্ষা করার পর তা ত্যাগ করলো সে আমার নাফরমানী করলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "৫/২৮১৫। ইবনে ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল লোকের নিকট দিয়ে যাচ্ছিলেন যারা তীরন্দাজী করছিল। তিনি বলেনঃ হে ইসমাঈলের বংশধর! তোমরা তীরন্দাজী করো। কেননা তোমাদের পিতা ছিলেন তীরন্দাজ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "১/২৮১৬। হারিস ইবনে হাসসান (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি মদীনায় পৌঁছে দেখলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বারের উপর দাঁড়িয়ে আছেন এবং বিলাল (রাঃ) তার গলায় তরবারি ঝুলিয়ে তাঁর সামনে দন্ডায়মান। আরও ছিল একটি কালো পতাকা। আমি বললাম, এই লোক কে? লোকেরা বললো, আমর ইবনুল আস (রাঃ)। তিনি একটি যুদ্ধ থেকে ফিরে এসেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "২/২৮১৭। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন মক্কায় প্রবেশ করেন এবং তাঁর পতাকাটি ছিল সাদা রং-এর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "৩/২৮১৮। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বড় পতাকাটি ছিল কালো রং-এর এবং ক্ষুদ্র পতাকাটি ছিল সাদা রং-এর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "১/২৮১৯। আসমা বিনতে আবূ বাকর (রাঃ) থেকে বর্ণিত। তিনি একটি সোনার বোতামযুক্ত জামা বের করে বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শত্রুবাহিনীর সাথে যুদ্ধ করার সময় এটি পরিধান করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "২/২৮২০। ‘উমার (রাঃ) থেকে বর্ণিত। তিনি রেশমী পোশাক পরিধান করতে নিষেধ করতেন, কিন্তু এতটুকু পরিমাণ হলে (দোষ নেই)। অতঃপর তার আংগুল দিয়ে ইশারা করলেন, তারপর দ্বিতীয় আংগুল দিয়ে, তারপর তৃতীয় আংগুল দিয়ে, তারপর চতুর্থ আংগুল দিয়ে, অতঃপর বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের তা পরিধান করতে নিষেধ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "১/২৮২১। ‘আমর ইবনে হুরাইস (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি যেন এখনো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর মাথায় কালো পাগড়ি পরিহিত অবস্থায় দেখতে পাচ্ছি এবং তিনি তাঁর পাগড়ির উভয় প্রান্ত তাঁর দু’ কাঁধের উপর ঝুলিয়ে দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "২/২৮২২। জাবির (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মাথায় কালো পাগড়ি পরিহিত অবস্থায় মক্কায় প্রবেশ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "১/২৮২৩। খারিজা ইবনে যায়েদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি দেখলাম এক ব্যক্তি আমার পিতার নিকট এমন এক ব্যক্তি সম্পর্কে জিজ্ঞেস করছেন, যে যুদ্ধে যোগদান করে যুদ্ধক্ষেত্রে ক্রয়-বিক্রয় করছে। আমার পিতা তাকে বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে তাবুকে অবস্থানকালে ক্রয়-বিক্রয় করতাম। তিনি আমাদের দেখতেন কিন্তু নিষেধ করতেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "১/২৮২৪। মুআয ইবনে আনাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর পথের মুজাহিদকে বিদায় জানানো, অতঃপর তাকে সকালে বা সন্ধ্যায় তার সওয়ারীতে তুলে দেয়া আমার নিকট দুনিয়া ও তার মধ্যকার সব কিছু থেকে অধিক পছন্দনীয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "২/২৮২৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বিদায় দিয়ে বলেনঃ আমি তোমাকে আল্লাহর আমানতে সোপর্দ করলাম, যাঁর নিকট সোপর্দকৃত জিনিস ধ্বংস হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "৩/২৮২৬। ইবনে ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন সামরিক বাহিনীকে বিদায় দিয়ে বলতেনঃ আমি তোমার দীন, তোমার বিশ্বস্ততা ও তোমার সর্বশেষ আমল আল্লাহর নিকট সোপর্দ করলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "১/২৮২৭। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আকসাম ইবনে জাওন আল-খুযাঈ (রাঃ) কে বলেনঃ হে আকসাম! তুমি তোমার সম্প্রদায় ব্যতীত অন্য সম্প্রদায়ের সাথে একত্রে জিহাদ করো, তাহলে তোমার চরিত্র সুন্দর হবে। তোমার সঙ্গীদের সাথে উত্তম ব্যবহার করো (বা সঙ্গীদের সম্মান করো)। উত্তম সঙ্গী চারজন এবং উত্তম সারিয়্যা (ক্ষুদ্র যুদ্ধাভিযান) হলো চারটি, যার সৈন্যসংখ্যা চারশত। চার হাজার সৈন্য সম্বলিত সেনাদল হলো উত্তম। আর ১২ হাজার সদস্যবিশিষ্ট সেনাদল সংখ্যা স্বল্পতার দরুন কখনো পরাজিত হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "২/২৮২৮। বারাআ ইবনে আযেব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা আলোচনা করতাম যে, বদরের যুদ্ধের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীর সংখ্যা ছিল তিন শত দশের কিছু বেশী। এই সংখ্যা ছিল তালূতের সাথে নদী অতিক্রমকারী সেনাদলের সমান। তালূতের সাথে মুমিন ব্যক্তিগণই নদী পার হয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "৩/২৮২৯। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী আবুল ওয়ারদ (রাঃ) বলেন, তোমরা সেই সেনাদল পরিহার করো যারা শত্রুর মোকাবিলায় অবতীর্ণ হলে পলায়ন করে এবং গনীমাত পেলে তাতে প্রতারণা করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "১/২৮৩০। কাবীসা ইবনে হুলব (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নাসারাদের (খৃস্টানদের) খাদ্যদ্রব্য সম্পর্কে জিজ্ঞেস করলাম। তিনি বলেনঃ তোমার অন্তরে যেন কোন খাদ্য সন্দেহ সৃষ্টি না করে, তাহলে তুমিও এ ক্ষেত্রে নাসারাদের অনুরূপ হয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "২/২৮৩১। আবূ সা‘লাবা আল-খুশানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে তাঁকে জিজ্ঞেস করলাম, ইয়া রাসূলাল্লাহ! মুশরিকদের হাঁড়ি-পাতিলে কি আমরা রান্না করবো? তিনি বলেনঃ তোমরা তাতে রান্না করো না। আমি বললাম, আমরা যদি এর মুখাপেক্ষী হয়ে পড়ি এবং সেগুলো ছাড়া যদি আমরা পাত্র না পাই? তিনি বলেনঃ তাহলে তোমরা তা উত্তমরূপে ধুয়ে নাও, অতঃপর তাতে রান্না করো এবং আহার করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "১/২৮৩২। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় আমরা কোন মুশরিকের সাহায্য চাই না। ‘আলী (রাঃ) তার রিওয়ায়াতে উল্লেখ করেছেন যে, রাবীর নাম ‘আবদুল্লাহ ইবনে ইয়াযীদ অথবা যায়েদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "১/২৮৩৩। আয়েশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যুদ্ধ হলো কৌশল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "২/২৮৩৪। ইবনে ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যুদ্ধ হলো কৌশল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "১/২৮৩৫। কায়েস ইবনে উবাদ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবূ যার (রাঃ) কে শপথ করে বলতে শুনেছিঃ ‘‘এরা দু’টি বিবদমান পক্ষ, তারা তাদের প্রতিপালক সম্পর্কে বিবাদে লিপ্ত....’’ (সূরা হজ্জঃ ১৯) শীর্ষক আয়াত নাযিল হয় বদর যুদ্ধের দিন ছয় ব্যক্তি সম্পর্কেঃ (মুসলিমদের ) হামযা ইবনে আবদুল মুত্তালিব (রাঃ), ‘আলী ইবনে আবূ তালিব (রাঃ) ও উবায়দা ইবনুল হারিছ (রাঃ) এবং (কাফেরদের) উতবা ইবনে রবীআ, শায়বা ইবনে রবীআ ও ওয়ালীদ ইবনে উতবা সম্পর্কে। বদরের দিন তারা পরস্পর মল্লযুদ্ধে লিপ্ত হয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "২/২৮৩৬। সালামা ইবনুল আকওয়া' (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি এক ব্যক্তির সাথে মল্লযুদ্ধে লিপ্ত হয়ে তাকে হত্যা করলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মালপত্র আমাকে দিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "৩/২৮৩৭। আবূ কাতাদা (রাঃ) থেকে বর্ণিত। হুনায়নের যুদ্ধের দিন তিনি যাকে হত্যা করেছিলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মালপত্র তাকে দিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "৪/২৮৩৮। সামুরা ইবনে জুনদুব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (যুদ্ধের ময়দানে) যে যাকে হত্যা করে তার মালপত্র হত্যাকারীর প্রাপ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "১/২৮৩৯। সাব‘ ইবনে জাস্‌সামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাতের বেলা মুশরিকদের মহল্লায় অতর্কিত আক্রমণ প্রসঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করা হলো, যাতে নারী ও শিশু নিহত হয়। তিনি বলেনঃ তারাও (নারী ও শিশু) তাদের অন্তর্ভুক্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "২/২৮৪০। সালামা ইবনুল আকওয়া (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আবূ বাকর (রাঃ) এর সাথে হাওয়াযিন গোত্রের বিরুদ্ধে যুদ্ধ করি। আমরা ফাযারা গোত্রের পানির উৎসে পৌঁছে সেখানে রাত কাটাই। ভোর হলে আমরা তাদেরকে অতর্কিতে আক্রমণ করলাম। অতঃপর আমরা পানির মালিকদের নিকট এসে তাদেরকে আক্রমণ করে তাদের নয় অথবা সাত ঘর লোককে হত্যা করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "৩/২৮৪১। ইবনে উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক নারীকে নিহত অবস্থায় পড়ে থাকতে দেখলেন। অতঃপর তিনি নারী ও শিশুদের হত্যা করতে নিষেধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "৪/২৮৪২। হানজালা আল-কাতিব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যুদ্ধ করলাম। আমরা এক নিহত নারীর পাশ দিয়ে যাচ্ছিলাম, যার নিকট লোকজন ভীড় জমিয়েছিল। লোকেরা তাঁর জন্য পথ করে দিলো। তিনি বলেনঃ যারা যুদ্ধ করে, সে তো তাদের সাথে যুদ্ধ করতো না! অতঃপর তিনি এক ব্যক্তিকে বলেনঃ তুমি খালিদ ইবনুল ওয়ালীদকে গিয়ে বলো, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে এই বলে নির্দেশ দিয়েছেনঃ তোমরা কখনো শিশু ও শ্রমিককে হত্যা করো না। ৫/২৮৪২(১)। আবূ বাকর ইবনে আবূ শায়বা-কুতায়বা-মুগীরা ইবনে আবদুর রহমান-আবুয যিনাদ-মুরাককা-তার দাদা রাবাহ ইবনুর রাহী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে অনুরূপ বর্ণিত আছে। আবূ বাকর ইবনে আবূ শায়বা (রাঃ) বলেন, সাওরী তার এই রিয়ায়াতে ভুল করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "১/২৮৪৩। উসামা ইবনে যায়েদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ‘উবনা’ নামে কথিত একটি জনপদে পাঠালেন এবং বললেনঃ তুমি ভোরবেলা উবনা পৌঁছে তাকে ভষ্মীভূত করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "২/২৮৪৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহূদী নাযীর গোত্রের বুওয়ায়রা নামক খেজুর বাগান জ্বালিয়ে দেন এবং কেটে ফেলেন। তখন আল্লাহ তা‘আলা এ আয়াত নাযিল করেন (অনুবাদ) ‘‘তোমরা যে খেজুর গাছগুলো কেটে ফেলেছো এবং যেগুলো কান্ডের উপর স্থির রেখেছো....’’ (সূরা হাশরঃ ৫)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "৩/২৮৪৫। ইবনে উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ নাযীরের খেজুর বাগান জ্বালিয়ে দেন এবং কেটে ফেলেন। এ বিষয়ে তাদের (মুসলিমদের) কবি (হাসসান ইবনে ছাবিত রা) বলেনঃ ‘‘লুআয়্যি (কুরাইশ) গোত্রের নেতৃবৃন্দের পক্ষে বুওয়ায়রা নামক বাগানটি ব্যাপকভাবে জ্বালিয়ে দেয়া সহজ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "১/২৮৪৬। সালামা ইবনুল আকওয়া (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আবূ বাকর (রাঃ) এর সাথে হাওয়াযিন গোত্রের বিরুদ্ধে জিহাদ করি। তিনি ফাযারা গোত্রের একটি কন্যা গনীমতের অতিরিক্ত আমাকে দেন। সে ছিল আরবের সেরা সুন্দরী। তার পরনে ছিল চামড়ার পোশাক। আমি তার কাপড় উন্মোচন করিনি। এমতাবস্থায় আমি মদীনায় পৌঁছি। বাজারে আমার সাথে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাক্ষাত হলে তিনি বলেনঃ তোমার পিতা ছিল উত্তম লোক (তোমার পিতা, আল্লাহর শপথ!), ঐ মেয়েটি আমাকে দান করো। আমি মেয়েটি তাঁকে দান করলাম। অতঃপর তিনি সেই মেয়েটিকে মক্কায় বন্দী মুসলিমদের মুক্তিপণস্বরূপ তথায় পাঠিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "১/২৮৪৭। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, তার একটি ঘোড়া ছুটে চলে গেলে শত্রুপক্ষ তা ধরে নিয়ে যায়। এরপর মুসলিমগণ তাদের উপর বিজয়ী হলে তার ঘোড়া তাকে ফিরিয়ে দেয়া হয়। এ ঘটনা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়কার। ইবনে উমার (রাঃ) বলেন, তার একটি গোলাম পলায়ন করে রূম এলাকায় চলে যায়। অতঃপর মুসলিমগণ তাদের উপর বিজয়ী হলে (এবং গোলামটিকে প্রেপ্তার করে আনা হলে) খালিদ ইবনুল ওয়ালীদ (রা) তা তাকে ফেরত দেন। এটা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইনতিকালের পরের ঘটনা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "১/২৮৪৮। যায়েদ ইবনে খালিদ আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আশজাআ গোত্রের এক ব্যক্তি খায়বারে যুদ্ধের দিন মারা গেল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা তোমার সাথীর নামায পড়ো। লোকেদের নিকট বিষয়টি খুব খারাপ লাগলো এবং এর কারণে তাদের চেহারা বিবর্ণ হয়ে গেল। তিনি তা দেখে বলেনঃ তোমাদের সাথী আল্লাহর রাস্তায় আত্মসাৎ করেছে। যায়েদ (রাঃ) বলেন, তারা তার মালপত্র তালাশ করলে তার মধ্যে ইহূদীদের দু’ দিরহাম মূল্যের আংটির পাথর বা মণি পাওয়া গেল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "২/২৮৪৯। আবদুল্লাহ ইবনে আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, কিরকিরা নামক এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মালপত্র পাহারা দেয়ার দায়িত্বে নিয়োজিত ছিল। সে মারা গেলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে জাহান্নামী। সাহাবীগণ অনুসন্ধান করে তার সঈে একটি কম্বল অথবা একটি আবা পেলো যা সে আত্মসাৎ করেছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "৩/২৮৫০। উবাদা ইবনুস সামিত (রাঃ) থেকে বর্ণিত। তিনি বলেন, হুনায়নের যুদ্ধের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে গনীমতের উটের পাশে নামায পড়লেন। তারপর তিনি উটের দেহ থেকে একটি পশম নিয়ে তা তাঁর দু’ আঙ্গুলের মাঝে রেখে বলেনঃ হে লোকসকল! অবশ্য এটা তোমাদের গনীমতের মাল। সুতা এবং সুঁই, আর যা পরিমাণে তার চেয়ে বেশী এবং যা তার চেয়ে কম, সবই তোমরা গনীমতের মালের মধ্যে জমা দাও। কেননা গনীমতের মাল চুরি করার ফলে কিয়ামতের দিন তা চোরের জন্য অপমান ও গ্লানি এবং জাহান্নামের শাস্তির কারণ হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "১/২৮৫১। হাবীব ইবনে মাসলামা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক-পঞ্চমাংশ নেয়ার পর অবশিষ্ট মালের এক-তৃতীয়াংশ থেকে নফল (পুরষ্কার) দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "২/২৮৫২। উবাদা ইবনুস সামিত (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুদ্ধের প্রথমভাগে গনীমতের মালের এক-চতুর্থাংশ এবং ফিরতি যুদ্ধে এক-তৃতীয়াংশ থেকে (পুরস্কারস্বরূপ) অতিরিক্ত দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "৩/২৮৫৩। ‘আমর ইবনে শো‘আইব (রহঃ) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পর আর কোন নফল (অতিরিক্ত) দেয়া যাবে না। শক্তিশালী মুসলিমগণ দুর্বল মুসলিমকে গনীমতের মাল ফেরত দিবে। রাবী রাজা (রাঃ) বলেন, আমি সুলায়মান ইবনে মূসাকে বলতে শুনেছি, মাকহূল আমাকে হাবীব ইবনে মাসলামার সূত্রে বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুদ্ধের প্রথমভাগে অর্জিত গনীমতের মালের এক-চতুর্থাংশ এবং শেষভাগে অর্জিত গনীমতের এক-তৃতীয়াংশ পুরষ্কারস্বরূপ দিতেন। ‘আমর (রাঃ) বলেন, আমি যেখানে তোমাকে আমার পিতা ও দাদার সূত্রে হাদীস শুনাচ্ছি, সেখানে তুমি আমাকে মাকহূলের সূত্রে হাদীস শুনাচ্ছো",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "১/২৮৫৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বারের যুদ্ধের দিন গনীমতের মাল বণ্টন করেন অশ্বারোহীর জন্য তিন ভাগঃ ঘোড়ার জন্য দু’ ভাগ এবং পদাতিকের জন্য এক ভাগ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "১/২৮৫৫। আবুল লা‏হম (রাঃ) এর মুক্তদাস উমাইর (রাঃ) থেকে বর্ণিত। ওয়াকী (রাঃ) বলেন, আবুল লাহম (রাঃ) গোশত খেতেন না। উমাইর (রাঃ) বলেন, আমি গোলাম অবস্থায় আমার মনিবের সাথে খায়বারের দিন যুদ্ধ করেছিলাম। গনীমতের মালে আমাকে ভাগ দেয়া হয়নি। আমাকে ঘরের আসবাবপত্র থেকে একখানি তরবারি দেয়া হয়। আমি তা কোমরে বেঁধে মাটিতে হেঁচড়িয়ে নিয়ে যেতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "২/২৮৫৬। উম্মু আতিয়্যা আল-আনসারী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সাতটি যুদ্ধে অংশগ্রহণ করেছি। আমি তাদের সওয়ারী ও মালপত্র রক্ষণাবেক্ষণের জন্য পশ্চাতে থাকতাম, তাদের খাবার তৈরী করতাম, আহতদের চিকিৎসা করতাম এবং রোগীদের দেখাশুনা করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "১/২৮৫৭। সাফ্ওয়ান ইবনে আসসাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে একটি ক্ষুদ্র সামরিক অভিযানে পাঠান, তিনি বলেনঃ তোমরা আল্লাহর নামে আল্লাহর রাস্তায় রওয়ানা হয়ে যাও, যারা আল্লাহর সাথে কুফরী করে তাদের বিরুদ্ধে যুদ্ধ করো, লাশ (নাক-কান কেটে) বিকৃত করো না, বিশ্বাসঘাতকতা করো না, গনীমতের মাল আত্মসাৎ করো না এবং শিশুদের হত্যা করো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "২/২৮৫৮। বুরাইদা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন ব্যক্তিকে ক্ষুদ্র সেনা-অভিযানে অধিনায়ক নিয়োগ করে পাঠানোর সময় বিশেষভাবে তার জন্য আল্লাহভীতি অবলম্বনের এবং তার সহ-যোদ্ধাদের সাথে উত্তম ব্যবহারের উপদেশ দিতেন। তিনি বলতেনঃ তোমরা আল্লাহর নামে এবং আল্লাহর পথে যুদ্ধ করো, যারা আল্লাহর সাথে কুফরী করে তাদের বিরুদ্ধে যুদ্ধ করো। তোমরা জিহাদ করো, বিশ্বাসঘাতকতা করো না, চুরি করো না, কারো অঙ্গহানি বা অঙ্গ বিকৃত করো না এবং শিশুদের হত্যা করো না। যখন তুমি শত্রুপক্ষের মুশরিকদের বিরুদ্ধে সম্মুখ যুদ্ধে অবতীর্ণ হবে, তখন তাদেরকে তিনটি বিষয়ের প্রতি আহবান জানাবে। তারা সেগুলোর যে কোন একটির প্রতি সাড়া দিলে তুমি তাদের থেকে তা কবুল করো এবং তাদেরকে আক্রমণ করা থেকে বিরত থাকো। (১) তুমি তাদেরাক ইসলামের দাওয়াত দাও। তারা যদি তা কবুল করে তবে তাদের পক্ষ থেকে তা মেনে নাও এবং তাদেরকে আক্রমণ করা থেকে বিরত থাকো, অতঃপর তাদেরকে স্বদেশ ছেড়ে মুহাজিরদের দেশে চলে আসার আহবান জানাও এবং তাদেরকে জানিয়ে দাও যে, তারা যদি এ কাজ করে তবে যেসব সুযোগ-সুবিধা মুহাজিরগন পাবে তারাও তা পাবে এবং মুহাজিরদের উপর যেসব দায়দায়িত্ব বর্তাবে তা তাদের উপরও বর্তাবে। তারা যদি (স্বদেশ ত্যাগ করতে) অসম্মত হয় তবে তাদের জানিয়ে দাও যে, তারা বেদুইন মুসলিমদের সমান মর্যাদা পাবে, তাদের উপর আল্লাহর সেই সব হুকুম জারি হবে যা মুমিন মুসলিমদের উপর জারী হয় এবং তারা গনীমত ও ফাই-এর কিছুই পাবে না, তবে তারা মুসলিমদের সাথে মিলে জিহাদ করতে পারবে। (২) তার্ যদি ইসলামে দাখিল হতে অস্বীকার করে তবে তাদেরকে জিয্য়া দিতে বলো। তার যদি তা দেয় তবে তাদের নিকট থেকে তা গ্রহণ করো এবং তাদেরকে আক্রমণ করা থেকে বিরত থাকো। (৩) তারা যদি জিয্য়া দিতেও অস্বীকার এর, তবে তুমি তাদের বিরুদ্ধে আল্লাহর নিকট সাহায্য প্রার্থনা করো এবং তাদের বিরুদ্ধে যুদ্ধ করো। আর তুমি কোন দুর্গ অবরোধ করলে পর তারা তোমার নিকট আল্লাহর যিম্মাদারি এবং তোমার নবীর যিম্মাদারি লাভের আশা করলে তুমি তাদের জন্য আল্লাহর যিম্মাদারি এবং তোমার নবীর যিম্মাদারি দান করো। কারণ তোমাদের নিজেদের ও তোমাদের পিতৃপুরুষদের যিম্মাদারি ভঙ্গ করা আল্লাহ ও তাঁর রাসূলের যিম্মাদারি ভঙ্গ করার চেয়ে তোমাদের জন্য অধিকতর সহজ। আর তুমি কোন দূর্গ অবরোধ করলে পর তারা তোমার নিকট আল্লাহর হুকুমে দূর্গ থেকে বেরিয়ে আসার আবেদন করলে তুমি তাদেরকে আল্লাহর হুকুমে বেরিয়ে আসার অনুমতি দিও না, বরং তাদেরকে তোমার নিজের হুকুমে বেরিয়ে আসার অনুমতি দাও। কারণ তোমার জানা নেই যে, তাদের ব্যাপারে তুমি আল্লাহর হুকুম কার্যকর করতে পারবে কি না। আলকামা (রাঃ) বলেন, আমি মুকাতিল ইবনে হায়য়্যান (রাঃ) এর নিকট এ হাদীস বর্ণনা করলে তিনি বলেন, মুসলিম ইবনে হায়সাম (রাঃ) নোমান ইবনে মুকাররিন (রাঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আমার কাছে অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "১/২৮৫৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আমার আনুগত্য করলো সে আল্লাহর আনুগত্য করলো। আর যে ব্যক্তি আমার অবাধ্য হলো সে আল্লাহরই অবাধ্য হলো। যে ব্যক্তি ইমামের আনুগত্য করলো সে আমারই আনুগত্য করলো। আর যে ব্যক্তি ইমামের অবাধ্য হলো সে আমারই অবাধ্য হলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "২/২৮৬০। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (নেতৃ-আদেশ) শ্রবণ করো এবং আনুগত্য করো, এমনকি আংগুর ফল সদৃশ (ক্ষুদ্র) মস্তিস্কবশিষ্ট কাফ্রী ক্রীতদাসকেও যদি তোমাদের নেতৃপদে নিয়োগ করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "৩/২৮৬১। উম্মুল হুসাইন (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ নাক-কান কর্তিত কোন কাফ্রী ক্রীতদাসকেও যদি তোমাদের নেতৃপদে নিয়োগ করা হয় তবুও তোমরা তার নির্দেশ শোনো ও আনুগত্য করো, যতক্ষণ সে তোমাদেরকে আল্লাহর কিতাব (কুরআন) অনুযায়ী পরিচালনা করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "৪/২৮৬২। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি যখন (নির্বাসনে) রাবাযা নামক স্থানে পৌঁছলেন তখন নামাযের একামত হচ্ছিল। এক ক্রীতদাস লোকেদের নামাযে ইমামতি করছিল। (তাকে) বলা হলো, ইনি আবূ যার (রাঃ)। (এ কথায়) ক্রীতদাস পেছনে সরে আসতে উদ্যত হলে আবূ যার (রাঃ) বলেন, আমার প্রিয়তম বন্ধ মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ওসিয়াত করেছেনঃ আমি যেন (নেতৃ-আদেশ) শ্রবণ করি ও আনুগত্য করি, যদিও সে অঙ্গ-প্রত্যঙ্গ কর্তিত কাফ্রী ক্রীতদাস হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "১/২৮৬৩। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলকামা ইবনে মুজাযযিয (রাঃ) কে একটি সামরিক বাহিনীর অধিনায়ক নিয়োগ করেন। আমিও তাতে শরীক ছিলাম। তিনি যখন গন্তব্যে পৌঁছেন অথবা পথিমধ্যে ছিলেন, তখন একদল সৈন্য তার নিকট (কোন বিষয়ে) অনুমতি চাইলে তিনি তাদের অনুমতি দিলেন এবং আবদুল্লাহ ইবনে হুযাফা ইবনে কায়েস আস-সাহমী (রাঃ)-কে তাদের অধিনায়ক নিযুক্ত করেন। যেসব লোক আবদুল্লাহ (রাঃ) -র সঙ্গী হয়ে জিহাদ করেছে, আমিও তাদের সাথে ছিলাম। লোকেরা পথিমধ্যে ছিল। এ অবস্থায় একদল লোক উত্তাপ গ্রহণের জন্য অথবা অন্য কোন কাজে আগুন প্রজ্জ্বলিত করলো। আবদুল্লাহ (রাঃ) তাদের বলেন (তিনি কিছুটা রসিক প্রকৃতির ছিলেন), আমার নির্দেশ শোনা ও আনুগত্য করা কি তোমাদের জন্য বাধ্যতামূলক নয়? তারা বললো হ্যাঁ। তিনি বলেন, আমি তোমাদেরকে যা করার নির্দেশই দিবো তোমরা কি তাই করবে? তারা বললো হ্যাঁ। তিনি বলেন, আমি তোমাদেরকে চূড়ান্ত নির্দেশ দিচ্ছি যে, তোমরা এই আগুনে ঝাঁপিয়ে পড়ো। কতক লোক (আগুনে ঝাঁপ দেয়ার জন্য) দাঁড়িয়ে গেলো এবং কোমর বাঁধলো। তিনি যখন দেখলেন, লোকেরা সত্যিই আগুনে ঝাঁপ দিতে প্রস্তুত হয়েছে, তখন বললেন, থামো। আমি তোমাদের সাথে ঠাট্টা করেছি। (রাবী বলেন) আমরা ফিরে এলে লোকেরা মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ ঘটনা উল্লেখ করলো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কেউ তোমাদেরকে আল্লাহর নাফরমানি করার নির্দেশ দিলে তোমরা তার আনুগত্য করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "২/২৮৬৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পাপকাজ ব্যতীত যে কোন কাজে মুসলিম ব্যক্তির উপর (নেতৃবৃন্দের) আনুগত্য করা অপরিহার্য, তা তার মনঃপূত হোক বা না হোক। অতএব পাপ কাজের নির্দেশ দেয়া হলে তা শোনাও যাবে না, আনুগত্যও করা যাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "৩/২৮৬৫। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ অচিরেই আমার পরে এমন সব লোক তোমাদের নেতা হবে, যারা সুন্নাতকে বিলুপ্ত করবে, বিদআতের অনুসরণ করবে এবং নামায নির্দিষ্ট ওয়াক্ত থেকে বিলম্বে পড়বে। আমি বললাম, হে আল্লাহর রাসূল! আমি যদি তাদের (যুগ) পাই, তবে কী করবো? তিনি বলেনঃ হে উম্মু আবদ-এর পুত্র! তুমি আমাকে জিজ্ঞেস করছো যে, তুমি কী করবে? যে ব্যক্তি আল্লাহর অবাধ্যাচরণ করে, তার আনুগত্য করা যাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "১/২৮৬৬। উবাদা ইবনুস সামিত (রাঃ) থেকে বর্ণিত। তিনি বলেন, দুঃসময় ও সুসময়, আনন্দ ও বিষাদে এবং নিজেদের উপর অন্যদের অগ্রাধিকার প্রদানে (নেতৃ-আদেশ) শ্রবণ ও আনুগত্য করার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট থেকে বায়আত (শপথ) গ্রহণ করেন। তিনি আমাদের নিকট থেকে এ বিষয়ে বায়আত নেন যে, (রাষ্ট্র পরিচালনার ক্ষেত্রে) আমরা যেন যোগ্য ব্যক্তির সাথে (গদি নিয়ে) বিবাদে লিপ্ত না হই। আর যেখানেই থাকি আমরা যেন সত্য কথা বলি এবং আল্লাহর ব্যাপারে নিন্দুকের নিন্দার যেন পরোয়া না করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "২/২৮৬৭। আওফ ইবনে মালেক আল-আশজাঈ (রাঃ) বলেন, আমরা সাত, আট অথবা নয় ব্যক্তি মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত ছিলাম। তখন তিনি বলেনঃ তোমরা কি আল্লাহর রাসূলের নিকট বায়আত হবে না? তৎক্ষণাৎ আমরা আমাদের হাত প্রসারিত করে দিলাম। এক ব্যক্তি বললো, ইয়া রাসূলাল্লাহ! আমরা তো আপনার নিকট (ইতোপূর্বে) বায়আত হয়েছি, এখন (আবার) কিসের জন্য আপনার নিকট বায়আত হবো? তিনি বলেনঃ (তোমরা এ বিষয়ে বায়াআত হবে যে) তোমরা আল্লাহর ইবাদত করবে, তাঁর সাথে কোন কিছু শরীক করবে না, পাঁচ ওয়াক্তের নামায কায়েম করবে, (নেতৃ-আদেশ) শ্রবণ করবে ও আনুগত্য করবে। (একটি কথা তিনি গোপনে বললেন): মানুষের কাছে কিছু প্রার্থনা করবে না। রাবী বলেন, অতঃপর আমি তাদের যে কোন ব্যক্তিকে দেখেছি যে, তার চাবুক নিচে পড়ে গেলেও তিনি কাউকে তা তুলে দিতে বলতেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "৩/২৮৬৮। হুরমুযের মুক্তদাস আত্তাব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি আনাস ইবনে মালেক (রাঃ)-কে বলতে শুনেছি, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শ্রবণ ও আনুগত্য করার জন্য বায়আত হলাম। তিনি বলেনঃ ‘‘যতদূর তোমাদের সাধ্যে কুলায়’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "৪/২৮৬৯। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, একটি ক্রীতদাস এসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হিজরত করার শপথ নেয়। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানতেন না যে, সে ক্রীতদাস। তার মনিব তাকে ফেরত নিতে এলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাকে আমার নিকট বিক্রয় করো। তিনি দু’টি কৃষ্ণকায় গোলামের বিনিময়ে তাকে খরিদ করেন। এরপর থেকে তিনি কাউকে বায়আত করার পূর্বেই জিজ্ঞেস করে নিতেন, সে ক্রীতদাস কি না?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "১/২৮৭০। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন শ্রেণীর লোকের সাথে আল্লাহ কিয়ামতের দিন কথা বলবেন না, তাদের প্রতি ভ্রুক্ষেপ করবেন না, তাদের পবিত্র করবেন না এবং তাদের জন্য রয়েছে পীড়াদায়ক শাস্তি। (১) যে ব্যক্তি মাঠে প্রয়োজনের অতিরিক্ত পানি রাখে কিন্তু তা পথিকদের ব্যবহার করতে দেয় না; (২) যে ব্যক্তি আসরের নামাযের পর অপর কোন ব্যক্তির নিকট পণ্যদ্রব্য বিক্রয় করে এবং আল্লাহর নামে শপথ করে বলে যে, সে তা এত এত মূল্যে খরিদ করেছে এবং ক্রেতা তার কথা বিশ্বাস করে, অথচ তার কথা সত্য নয় এবং (৩) যে ব্যক্তি পার্থিব স্বার্থ লাভের উদ্দেশ্যে নেতার কাছে আনুগত্যের শপথ নেয়, নেতা তাকে কিছু পার্থিব স্বার্থ দিলে সে তার শপথ পূর্ণ করে এবং না দিলে শপথ পূর্ণ করে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "২/২৮৭১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বনী ইসরাঈলের রাজনীতি পরিচালনা করতেন তাদের নবীগণ। যখনই একজন নবী চলে যেতেন (ইনতিকাল করতেন) তখনই আরেকজন নবী নেতৃত্ব গ্রহণ করতেন। কিন্তু আমার পরে তোমাদের মধ্যে আর কেউ নবী হবে না। সাহাবীগণ জিজ্ঞেস করলেন, ইয়া রাসূলাল্লাহ! তাহলে কী অবস্থা হবে? তিনি বলেনঃ খলীফা হবে এবং তাদের সংখ্যা অনেক হবে। সাহাবীগণ বলেন, আমরা কি ব্যবস্থা গ্রহণ করবো? তিনি বলেনঃ যে ব্যক্তি প্রথমে খলীফা হবে তোমরা তার আনুগত্যের শপথ করো, অতঃপর তার পরবর্তী খলীফার। তোমাদের উপর তাদের যে অধিকার রয়েছে তোমরা তা আদায় করো। আর তাদের উপর (তোমাদের) যে অধিকার প্রাপ্য আছে (তা আদায় না করলে), মহান আল্লাহ তাদের নিকট থেকে তার হিসাব নিবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "৩/২৮৭২। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন প্রত্যেক বিশ্বাসঘাতকের জন্য একটি করে পতাকা স্থাপন করা হবে এবং বলা হবে, এটা অমুকের বিশ্বাসঘাতকতার পতাকা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "৪/২৮৭৩। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাবধান! কিয়ামতের দিন প্রত্যেক প্রতারক ও বিশ্বাসঘাতকের জন্য তার প্রতারণার মাত্রা অনুযায়ী একটি করে পতাকা স্থাপন করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "১/২৮৭৪। উমায়মা বিনতে রুকায়কা (রাঃ) বলেন, বায়আত হওয়ার উদ্দেশ্যে আমি কতক মহিলা সমভিব্যাহারে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হলাম। তিনি আমাদের বলেন, যতদূর তোমাদের সামর্থ্যে ও শক্তিতে কুলায়। আমি মহিলাদের সাথে মুসাফাহা (করমর্দন) করি না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "২/২৮৭৫। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়েশা (রাঃ) বলেন, ঈমানদার মহিলাগণ হিজরত করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হলে তিনি আল্লাহ তা‘আলার নিম্নোক্ত বাণীর নির্দেশ অনুযায়ী তাদের পরীক্ষা করতেনঃ ‘‘হে নবী! ঈমানদার মহিলাগণ যখন তোমার নিকট এসে বায়আত করে...’’ (সুরা মুমতাহিনাঃ ১২)। আয়েশা (রাঃ) বলেন, যে কোন ঈমানদার মহিলা উপরোক্ত আয়াত অনুযায়ী স্বীকার করতো সে যেন কঠিন পরীক্ষাকে স্বীকার করে নিতো। মহিলাগণ বাচনিক এসব কথা স্বীকার করে নিলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বলতেনঃ তোমরা চলে চাও, আমি তোমাদের বায়আত গ্রহণ করেছি। (রাবী বলেন,) না, আল্লাহর শপথ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাত কখনও কোন মহিলার হাত স্পর্শ করতো না, তিনি শুধু কথার মাধ্যমে তাদের বায়আত করতেন। আয়েশা (রাঃ) বলেন, আল্লাহর শপথ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহিলাদের নিকট থেকে কেবলমাত্র সেইসব কথার স্বীকারোক্তি করাতেন যার নির্দেশ আল্লাহ তা‘আলা তাঁকে দান করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাত কখনও কোন মহিলার হাত স্পর্শ করতো না। তিনি তাদের শপথবাক্য পাঠ করানোর পর বলতেনঃ আমি বাচনিক তোমাদের বায়আত করলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "১/২৮৭৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি একটি ঘোড়া দু’টি ঘোড়ার সাথে (দৌড় প্রতিযোগিতায়) শরীক করলো, কিন্তু তার ঘোড়া জিতবে কিনা এ ব্যাপারে সে নিশ্চিত না হলে তা জুয়ার পর্যায়ভুক্ত নয়। আর যে ব্যক্তি একটি ঘোড়া দু’টি ঘোড়ার সাথে (দৌড় প্রতিযোগিতায়) শরীক করলো এবং তার ঘোড়া জিতবে বলে সে নিশ্চিত হলে তা জুয়ার পর্যায়ভুক্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "২/২৮৭৭। ইবনে উমার থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোড়াকে বিশেষ পদ্ধতিতে প্রশিক্ষণ দিলেন। বিশেষ পদ্ধতিতে প্রশিক্ষণপ্রাপ্ত এসব ঘোড়ার দ্বারা তিনি আল-হাফ্য়া নামক স্থান থেকে সানিয়্যাতুল বিদা পর্যন্ত ঘোড়দৌড়ের ব্যবস্থা করলেন। আর যেসব ঘোড়া প্রশিক্ষণপ্রাপ্ত ছিলো না সেগুলো দ্বারা সানিয়্যাতুল বিদা থেকে যুরায়ক গোত্রের মসজিদ পর্যন্ত (ঘোড়দৌড়ের ব্যবস্থা করেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "৩/২৮৭৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দৌড় প্রতিযোগিতায় বিজয়ী হলে (মাল অথবা অর্থ গ্রহণ করা বৈধ নয়), উট ও ঘোড়া ব্যতীত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "১/২৮৭৯। ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরআন মজীদ সাথে নিয়ে শত্রু এলাকায় সফর করতে নিষেধ করেছেন, এই আশংকায় যে, তা দুশমনদের হস্তগত হয়ে যেতে পারে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "২/২৮৮০। ইবনে উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরআন মজীদ সাথে নিয়ে শত্রুর এলাকায় সফরে যেতে নিষেধ করতেন এই আশংকায় যে, তা দুশমনদের হস্তগত হয়ে যেতে পারে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "১/২৮৮১। সাঈদ ইবনুল মুসাইয়্যাব (রাঃ) থেকে বর্ণিত। জুবাইর ইবনে মুতইম (রাঃ) তাকে অবহিত করেন যে, তিনি ও উসমান ইবনে আফ্ফান (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হলেন খায়বারে প্রাপ্ত যুদ্ধলব্ধ সম্পদ বণ্টনের বিষয়ে তাঁর সাথে আলাপ করার জন্য। তারা বললেন, আপনি আমাদের ভ্রাতৃগোষ্ঠী বনূ হাশিম ও বনূ মুত্তালিবের মধ্যে বণ্টন করেছেন, অথচ আমাদের আত্মীয় সম্পর্ক তো একই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি বনূ হাশিম ও বনূ মুত্তালিবকে একই মনে করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 129
			}
		}
	]
}