{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "১/৭০৬। আবদুল্লাহ ইবনু যায়দ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিঙ্গাধ্বনি করার মনস্থ করেন এবং ঢোল বাজিয়ে লোকেদের (সালাতের জন্য) ডাকার নির্দেশ দেন। এরপর আবদুল্লাহ ইবনু যায়দ (রাঃ) কে স্বপ্নে দেখানো হল। তিনি বলেন, আমি সবুজ বর্ণের একজোড়া কাপড় পরিহিত এক ব্যাক্তিকে একটি নাকূস বহন করতে দেখলাম। আমি তাকে বললাম, হে আল্লাহ্‌র বান্দা! তুমি কি নাকূস বিক্রয় করবে? সে বললো, তা দিয়ে তুমি কী করবে? আমি বললাম, আমি তা দিয়ে সালাতের জন্য ডাকবো। সে বললো, আমি কি তোমাকে এর চাইতে উৎকৃষ্ট কোন জিনিস সম্পর্কে অবহিত করবো না? আমি বললাম, তা কী? সে বললো, তুমি বলোঃ আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান। আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই। আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই। আমি সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহ্‌র রাসূল, আমি সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহ্‌র রাসূল। সালাতের দিকে এসো, সালাতের দিকে এসো। কল্যাণের দিকে এসো, কল্যাণের দিকে এসো। আল্লাহ মহান, আল্লাহ মহান। আল্লাহ ব্যতীত কোন ইলাহ নেই। রাবী বলেন, আবদুল্লাহ ইবনু যায়দ(রাঃ) বের হয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আসেন এবং যে স্বপ্ন তিনি দেখেছেন সে সম্পর্কে তাঁকে অবহিত করেন। তিনি বলেন, হে আল্লাহ্‌র রাসূল! আমি স্বপ্নযোগে একজোড়া সবুজ কাপড় পরিহিত এক ব্যাক্তিকে নাকূস বহন করতে দেখলাম। এরপর তিনি তাঁর কাছে সব ঘটনা খুলে বলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের এই সাথী একটি স্বপ্ন দেখেছে। তুমি বিলালের সাথে মসজিদে চলে যাও, তাকে এগুলো শিখিয়ে দাও এবং বিলাল যেন আযান দেয়। কারণ বিলাল তোমার চাইতে উচ্চ কন্ঠের অধিকারী। রাবী বলেন, আমি বিলালের সাথে মসজিদে গেলাম। আমি তাকে শিখিয়ে দিলাম এবং তিনি তা উচ্চ স্বরে ঘোষণা দিলেন। রাবী বলেন, উমার ইবনুল খাত্তাব(রাঃ) এই বাক্যধ্বনি শুনে বেরিয়ে আসেন এবং বলেন, হে আল্লাহ্‌র রাসূল! আল্লাহ্‌র শপথ! আমিও অনুরূপ স্বপ্ন দেখেছি। ইরওয়াহ ইবনু মাজাহ এর উষ্ণতায় আবূ উবাইদ (রহঃ) বলেন, আবূ বাকর আল-হাকামী (রহঃ) আমাকে অবহিত করেছেন যে, আবদুল্লাহ ইবনু যায়েদ আল-আনসারী(রাঃ) এ সম্পর্কে (কবিতা) বলেনঃ আমি মহামহিম গৌরান্বিত আল্লাহ্‌র অশেষ প্রশংসা করছি আযান দেয়ার জন্য। যখন আল্লাহ্‌র পক্ষ থেকে সুসংবাদদাতা তা নিয়ে আমার নিকট এলো, আমাকে সুসংবাদ দেয়ার জন্য তাকে সম্মান করে, সে তিন রাত আমাকে আযান দিলো, যখনই সে এলো, আমার মর্যাদা বাড়িয়ে দিলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "২/৭০৭। সালিম (রহঃ) থেকে তার পিতার সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের জন্য সমবেত করার ব্যাপারে সাহাবীদের সাথে পরামর্শ করেন। তারা শিঙ্গার উল্লেখ করেন, কিন্তু এটি ইহূদীদের যন্ত্র বলে তিনি অপছন্দ করেন। অতঃপর তারা নাকূসের কথা উল্লেখ করেন। কিন্তু এটি খ্রিস্টানদের ঘন্টা বলে তিনি অপছন্দ করেন। সেই রাতে আবদুল্লাহ বিন যায়দ (রাঃ) নামক এক আনসারীকে স্বপ্নে আযানের পদ্ধতি দেখানো হল এবং উমার ইবনুল খাত্তাব (রাঃ)ও (রাতে একই স্বপ্ন দেখেন)। আনসারী সাহাবী রাতেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আসেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল -কে আযানের নির্দেশ দিলে তিনি আযান দেন। যুহরী (রহঃ) বলেন, বিলাল ফজরের সালাতে (ঘুম থেকে সালাত উত্তম) বাক্যটি সংযোজন করেন এবং রাসূলুল্লাহ তা বহাল রাখেন। উমার বলেন, হে আল্লাহ্‌র রাসূল! নিশ্চয় আমিও এ ব্যাক্তির অনুরূপ স্বপ্ন দেখেছি, কিন্তু সে আমার আগেই পৌঁছে গেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "১/৭০৮। আবদুল্লাহ ইবনু মুহাইরীয় (রহঃ) থেকে বর্ণিত। তিনি (রহঃ) ইয়াতীম হিসাবে আবূ মাহযূরা (রাঃ)-এর তত্ত্বাবধানে থাকা অবস্থায় তিনি তাকে সিরিয়ার দিকে পাঠান। তখন আমি আবূ মাহযূরা (রাঃ)-কে বললাম, হে চাচাজান! আমি সিরিয়ায় যাচ্ছি। আমি আপনাকে আপনার আযান সম্পর্কে জিজ্ঞেস করছি। তিনি আমাকে অবহিত করেন যে, আবূ মাহযূরা বলেন, আমি একটি দলের সাথে রওয়ানা হলাম এবং আমরা কোন এক রাস্তা অতিক্রম করছিলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর মুয়ায্যিন তাঁর উপস্থিতিতে সালাতের আযান দেন। আমরাও মুয়াযযিনের আযান ধ্বনি শুনলাম। তা অপছন্দ হওয়ার কারণে আমরা তার শব্দাবলীর প্রতিধ্বনি করতে লাগলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতিধ্বনি শুনে আমাদের নিকট লোক পাঠান। আমাদেরকে তাঁর সামনে পেশ করা হলে তিনি বলেনঃ তোমাদের মধ্যে কার কন্ঠস্বর উচ্চ, যার কন্ঠস্বর আমি শুনতে পেলাম? লোকেরা ইশারা করে আমাকে দেখিয়ে দিল। তিনি সকলকে ছেড়ে দিলেন এবং আমাকে আটক রাখলেন। তিনি আমাকে বলেনঃ দাঁড়াও এবং আযান দাও। অতএব আমি দাঁড়ালাম। আমার কাছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তিনি যার নির্দেশ দিয়েছেন তার চাইতে অধিকতর প্রিয় কোন কিছুই ছিল না। আমি রাসসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সামনে দাঁড়ালাম এবং তিনি নিজে আমাকে আযান শিক্ষা দিলেন। তিনি বলেনঃ তুমি বলোঃ আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান। আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই; আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই। আমি সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহ্‌র রাসূল; আমি সাক্ষ্য দেউ যে, মুহাম্মাদ আল্লাহ্‌র রাসূল। অতঃপর তিনি আমাকে বলেনঃ তুমি আরো উচ্চকন্ঠে বলোঃ আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই; আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নাই। আমি আরো সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহ্‌র রাসূল; আমি সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহ্‌র রাসূল। সালাতের দিকে এসো, সালাতের দিকে এসো। কল্যাণের দিকে এসো, কল্যাণের দিকে এসো। আল্লাহ মহান, আল্লাহ মহান। আল্লাহ ব্যতীত কোন ইলাহ নেই। আমি আযান শেষ করলে তিনি আমাকে কাছে ডাকলেন এবং কিছু রূপার মুদ্রা ভর্তি একটি থলে দান করেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাত আবূ মাহযূরা (রাঃ) এর কপালের অগ্রভাগে রাখেন, অতঃপর তা তাঁর মুখমন্ডলে বুলিয়ে দেন, অতঃপর তাঁর হাত তার বুকে বুলিয়ে দেন, এমনকি তাঁর হাত আবূ মাহযূরা (রাঃ) এর নাভিমূল পর্যন্ত পৌঁছে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তাআলা তোমাকে বরকত দান করুন এবং তোমার উপর বরকত নাযিল করুন। আমি বললাম, হে আল্লাহ্‌র রাসূল! আমাকে মক্কা মুয়াযযমায় আযান দেয়ার জন্য নিয়োগ করুন। তিনি বলেনঃ হ্যাঁ, তোমাকে নিয়োগ করলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যা কিছু আমার নিকট অপ্রিয় ছিল তা সব দূর হয়ে গেলো এবং তদস্থলে তাঁর প্রতি অকুন্ঠ ভালোবাসা স্থান পেলো। অতঃপর আমি মক্কা মুয়াযযমায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিযুক্ত গভর্নর আত্তাব ইবনু উসাইদ -এর নিকট এলাম। আমি তার উপস্থিতিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নির্দেশ মোতাবেক সালাতের আযান দিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "২/৭০৯। আবদুল্লাহ ইবনু মুহাইরীয (রহঃ) থেকে বর্ণিত। আবূ মাহযূরা তাকে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে আযানের ঊনিশটি এবং ইকামতের সতেরটি বাক্য শিক্ষা দিয়েছেন। আযানের বাক্যগুলো হলঃ আল্লাহ্‌ মহান,আল্লাহ্‌ মহান,আল্লাহ্‌ মহান,আল্লাহ্‌ মহান; আমি সাক্ষ্য দিচ্ছি যে আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই (২বার); আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আল্লাহর রাসুল (২ বার), সালাতের দিকে এসো (২বার), কল্যানের দিকে এসো (২বার), আল্লাহ্‌ মহান (২ বার), আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই (১বার) ইকামতের সতেরটি বাক্য হলঃ আল্লাহ্‌ মহান,আল্লাহ্‌ মহান,আল্লাহ্‌ মহান,আল্লাহ্‌ মহান; আমি সাক্ষ্য দিচ্ছি যে আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই (২বার); আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আল্লাহর রাসুল (২ বার), সালাতের দিকে এসো (২ বার), কল্যানের দিকে এসো (২ বার), সালাত কায়েম হয়েছে (২ বার) আল্লাহ্‌ মহান (২ বার), আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই (১বার)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "১/৭১০। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুয়াযযিন সা’দ (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল (রাঃ)-কে তার দু কানের ছিদ্রে তার দু আঙ্গুল প্রবিষ্ট করার নির্দেশ দেন এবং বলেনঃ তাতে তোমার কন্ঠস্বর আরো উচ্চ হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "২/৭১১। আবূ জুহাইফা (রাঃ) বলেন, আমি আল-আবতাহ্ (মিনা) নামক উপত্যকায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলাম। তিনি তখন একটি লাল তাঁবুর মধ্যে অবস্থান করছিলেন। বিলাল বেরিয়ে এসে আযান দিলেন। আযান দেয়ার সময় তিনি এদিক-সেদিক তার মুখ ফিরান এবং তার দু কানের ছিদ্রে তার দু আঙ্গুল প্রবিষ্ট করান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "৩/৭১২। ইবনু উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুয়ায্যিনের কাঁধে মুসলিমদের দুটি বিষয় অর্পিতঃ তাদের সালাত ও সাওম (রোযা/রোজা/সিয়াম/ছিয়াম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "৪/৭১৩। জাবির ইবনু সামুরা (রাঃ) থেকে বর্ণিত। তিনি বলেন, ওয়াক্ত হলে বিলাল কখনো আযান দিতে বিলম্ব করতেন না। তবে তিনি কখনো ইকামতে কিছুটা বিলম্ব করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "৫/৭১৪। উসমান ইবনু আবূল আস (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার থেকে সর্বশেষ যে অঙ্গীকার গ্রহণ করেছেন তা হলঃ আমি যেন বেতনভুক্ত মুয়াযযিন নিয়োগ না করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "৬/৭১৫। বিলাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -আমাকে ফজরের সালাতে তাসবীব করার নির্দেশ দেন এবং এশার সালাতে তাবসীব করতে নিষেধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "৭/৭১৬। বিলাল (রাঃ) থেকে বর্ণিত। তিনি ফজরের সালাত সম্পর্কে অবহিত করার জন্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলেন। তাকে বলা হল যে, তিনি ঘুমিয়ে আছেন। তখন বিলাল বলেন, ঘুম থেকে সালাত উত্তম; ঘুম থেকে সালাত উত্তম। এ বাক্য ফজরের আযানে যোগ করা হল এবং তদনুযায়ী আমল চলে আসছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "৮/৭১৭। যিয়াদ ইবনুল হারিস আস-সুদাঈ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। তিনি আমাকে নির্দেশ দিলে আমি আযান দিলাম। বিলাল ইকামত দিতে চাইলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার ভাই সুদাঈ আযান দিয়েছে। আর যে ব্যাক্তি আযান দিবে সেই ইকামত দিবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "১/৭১৮। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুয়াযযিন যখন আযান দেয়, তখন তোমরা তার কথার অনুরূপ বলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "২/৭১৯। উম্মু হাবীবা (রাঃ) থেকে বর্ণিত। তার পালার দিন ও রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তার নিকট অবস্থান করতেন তখন তিনি তাঁকে মুয়ায্যিনের আযান শুনে তার অনুরূপ বলতে শুনেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "৩/৭২০। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যখন আযান শুনতে পাও, তখন মুয়ায্যিন যা বলে তোমরাও তা বলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "৪/৭২১। সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, কোন ব্যাক্তি মুয়ায্যিনের আযান শোনার পর নিম্নোক্ত দুআ পড়লে তার গুনাহ ক্ষমা করা হবেঃ আমি সাক্ষ্য দেই যে, আল্লাহ ছাড়া কোন ইলাহ নেই, তিনি এক, তাঁর কোন শারীক নেই। আমি আরো সাক্ষ্য দেই যে, মুহাম্মাদ তাঁর বান্দা ও রাসূল। আমি আল্লাহকে রব, ইসলামকে দ্বীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নবী হিসাবে পেয়ে সন্তুষ্ট।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "৫/৭২২। জাবির ইবনু আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যাক্তি মুয়ায্যিনের আযান শুনে নিম্নোক্ত দুআ পড়লে তার জন্য কিয়ামতের দিন শাফা আত অবধারিত হবেঃ হে আল্লাহ, এই পূর্ণাঙ্গ আহবান ও প্রতিষ্ঠিত সালাতের প্রভু! মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দান করুন সুমহান মর্যাদা ও সম্মান এবং তাঁকে প্রশংসিত স্থানে পৌঁছান, যার প্রতিশ্রুতি আপনি তাকে দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "১/৭২৩। আবূ সাঈদ (রাঃ) এর তত্ত্বাবধানে প্রতিপালিত আবদুর রহমান ইবনু আবূ সাসাআ (রহঃ) থেকে বর্ণিত। তিনি বলেন, আবূ সাঈদ আমাকে বলেছেনঃ যখন তুমি গ্রামে বা বন-জঙ্গলে থাকবে, তখন উচ্চস্বরে আযান দিবে। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ জ্বীন, মানুষ, বৃক্ষলতা ও পাথর যে-ই এই আযান শুনবে, সে তার জন্য (আখেরাতে) সাক্ষ্য দিবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "২/৭২৪। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নিজ মুখে বলতে শুনেছি: মুয়ায্যিনের আযান ধ্বনি যত দূর পর্যন্ত পৌঁছবে, তত দূর তাকে ক্ষমা করা হবে এবং জীবিত ও নির্জীব সকলে তার জন্য ক্ষমা প্রার্থনা করে। সালাতে উপস্থিত লোকেদের পঁচিশ নেকী লেখা হয় এবং তার দু সালাতের মধ্যবর্তী কালের গুনাহ ক্ষমা করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "৩/৭২৫। মুআবিয়াহ ইবনু আবূ সুফ্ইয়ান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন মুয়াযযিনগণ লোকেদের মাঝে সুদীর্ঘ ঘাড়বিশিষ্ট হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "৪/৭২৬। ইবনু আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অবশ্যই তোমাদের মধ্যকার উত্তম ব্যাক্তি আযান দিবে এবং তোমাদের মধ্যকার উত্তম কারী (কুরআন বিশেষজ্ঞ) ইমামতি করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "৫/৭২৭। ইবনু আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যাক্তি সওয়াবের আশায় সাত বছর আযান দেয় আল্লাহ তাকে জাহান্নাম থেকে মুক্তির সনদ লিখে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "৬/৭২৮। ইবনু উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যাক্তি বারো বছর আযান দেয় তার জন্য জান্নাত অবধারিত হয়ে যায়। আর প্রতি দিনের আযানের বিনিময়ে তার জন্য ষাট নেকী এবং প্রতি ইকামতের জন্য তিরিশ নেকী লেখা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "১/৭২৯। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, সাহাবীগণ সালাতের ওয়াক্তের সংকেতবাহী কোন পন্থা খুঁজছিলেন। তখন বিলাল (রাঃ)-কে আযানের শব্দাবলী দুবার করে এবং ইকামতের শব্দাবলী একবার করে বলার নির্দেশ দেয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "২/৭৩০। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, বিলাল (রাঃ) কে আযানের শব্দাবলী জোড় সংখ্যায় এবং ইকামতের শব্দাবলী বেজোড় সংখ্যায় বলার নির্দেশ দেয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "৩/৭৩১। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুয়াযযিন আম্মার ইবনু সা’দ (রাঃ) থেকে বর্ণিত। তিনি বলেন, বিলাল (রাঃ) আযানের শব্দাবলী দুবার করে এবং ইকামতের শব্দাবলী একবার করে উচ্চারণ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "৪/৭৩২। আবূ রাফি (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি বিলাল (রাঃ)-কে দেখেছি যে, তিনি রাসসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপস্থিতিতে আযানের প্রতিটি বাক্য দুবার করে এবং ইকামতের প্রতিটি বাক্য একবার করে বলেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "১/৭৩৩। আবূশ-শাছা (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমরা আবূ হুরাইরাহ (রাঃ) এর সাথে মসজিদে বসা ছিলাম। মুয়ায্যিন আযান দিলে পর এক ব্যাক্তি মাসজিদ থেকে উঠে চলে যেতে থাকে। আবূ হুরাইরাহ (রাঃ) এর দৃষ্টি তাকে অনুসরণ করতে থাকে। অবশেষে সে মাসজিদ থেকে বের হয়ে চলে যায়। আবূ হুরাইরাহ (রাঃ) বলেন, লোকটি তো আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নাফরমানী করলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "২/৭৩৪। উসমান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মসজিদে আযান হয়ে যাওয়ার পর যে ব্যাক্তি বিনা প্রয়োজনে বেরিয়ে যাবে এবং তার ফিরে আসার ইচ্ছা নাই সে মুনাফিক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		}
	]
}