{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"34": "Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "১/৩৮২৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি মহান আল্লাহর নিকট দোয়া করে না, আল্লাহ তার প্রতি অসন্তুষ্ট হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "২/৩৮২৮। নোমান ইবনে বশীর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দোয়াই হলো ইবাদত। অতঃপর তিলাওয়াত করেন (অনুবাদঃ) ‘‘এবং তোমার প্রভু বলেছেন, তোমরা আমাকে ডাকো আমি তোমাদের ডাকে সাড়া দিবো’’ (৪০ঃ ৬০)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "৩/৩৮২৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মহান আল্লাহর নিকট দোয়ার চেয়ে অধিক সম্মানিত কোন জিনিস নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "১/৩৮৩০। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর দোয়ায় বলতেনঃ ‘‘হে প্রভু! আমাকে সাহায্য করো এবং আমার বিরুদ্ধে কাউকে সাহায্য করো না, আমাকে সহযোগিতা করো এবং আমার বিরুদ্ধে কাউকে সহযোগিতা করো না, আমার জন্য কৌশল এঁটো, আমার বিরুদ্ধে কৌশল এঁটো না,আমাকে হেদায়াত দান করো, আমার জন্য হেদায়াতের পথ সহজতর করো এবং যে ব্যক্তি আমার উপর অত্যাচার ও সীমা লংঘন করে তার বিরুদ্ধে আমাকে সাহায্য করো। হে প্রভু! আমাকে তোমার জন্য কৃতজ্ঞ বান্দা বানাও, তোমার জন্য অনেক যিকিরকারী, তোমাকে অধিক ভয়কারী, তোমার অধিক আনুগত্যকারী, তোমার নিকট অনুনয়-বিনয়কারী ও তোমার দিকে প্রত্যাবর্তনকারী বানাও। হে আমার রব! আমার তওবা কবুল করো, আমার সমস্ত গুনাহ ধুয়ে-মুছে ফেলো, আমার দোয়া কবুল করো, আমার অন্তরকে হেদায়াত দান করো, আমার যবানকে সোজা রাখো, আমার যুক্তি-প্রমাণ বহাল করো এবং আমার মনের সমস্ত হিংসা-বিদ্বেষ দূরীভূত করো। আবুল হাসান আত-তানাফিসী (রাঃ) বলেন- আমি ওয়াকী‘ (রাঃ) কে বললাম, আমি কি তা বেতেরের কুনূতে পড়তে পারি? তিনি বলেন, হাঁ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "২/৩৮৩১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, ফাতিমা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট একটি খাদেম চাওয়ার জন্য আসলেন। তিনি তাকে বলেনঃ আমার কাছে এমন কিছু নেই, যা আমি তোমাকে দিতে পারি। অতএব তিনি ফিরে গেলেন। পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট এসে বলেনঃ যা তুমি চেয়েছো, সেটাই কি তোমার কাছে অধিক প্রিয়, না যা তার চেয়ে উত্তম সেটি? আলী (রাঃ) তাই বললেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি বলো, ‘‘হে আল্লাহ, সাত আসমানের প্রতিপালক ও মহান আরশের প্রভু, আমাদের প্রতিপালক এবং প্রতিটি জিনিসের প্রতিপালক, তাওরাত, ইনজীল ও মহান কুরআন নাযিলকারী, তুমিই আদি, তোমার পূর্বে কিছুই নাই, তুমি অন্ত, তোমার পরেও কিছুই নাই, তুমিই প্রবল, বিজয়ী ও প্রকাশ্য, তোমার উপরে কিছুই নাই, তুমিই গুপ্ত, তুমি ছাড়া আর কিছু নাই। অতএব তুমি আমাদের ঋণ পরিশোধ করে দাও এবং আমাদেরকে দরিদ্রতা থেকে স্বাবলম্বী বানাও’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "৩/৩৮৩২। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট হেদায়াত, তাক্বওয়া, চরিত্রের নির্মলতা ও আত্মনির্ভরশীলতা প্রার্থনা করি’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "৪/৩৮৩৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ ‘‘হে আল্লাহ! তুমি আমাকে যে জ্ঞান দান করেছো, তার দ্বারা আমাকে উপকৃত করো, আমার জন্য উপকারী জ্ঞান আমাকে শিখিয়ে দাও এবং আমার জ্ঞান বৃদ্ধি করো। সর্বাবস্থায় সমস্ত প্রশংসা আল্লাহর! আমি জাহান্নামের শাস্তি থেকে আল্লাহর আশ্রয় প্রার্থনা করি’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "৫/৩৮৩৪। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্যাপ্ত পরিমাণে বলতেনঃ ‘‘হে আল্লাহ! আমার অন্তরকে তোমার দীনের উপর প্রতিষ্ঠিত রাখো’’। এক ব্যক্তি বলেন, হে আল্লাহর রাসূল! আমাদের ব্যাপারে আশংকা করেন? আমরা তো আপনার উপর ঈমান এনেছি এবং আপনি যা নিয়ে এসেছেন সেই বিষয়ে আমরা আপনাকে সত্যবাদী বলে স্বীকার করে নিয়েছি। তিনি বলেনঃ অন্তরসমূহ মহামহিমান্বিত করুণাময়ের দু’ আংগুলের মাঝে অবস্থিত। তিনি সেগুলোকে ওলট-পালট করেন। আ‘মাশ (রাঃ) তার দু’ আংগুল দ্বারা ইশারা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "৬/৩৮৩৫। আবূ বাকর সিদ্দীক (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললেন, আমাকে একটি দোয়া শিখিয়ে দিন যার দ্বারা আমি আমার নামাযের মধ্যে দোয়া করতে পারি। তিনি বলেনঃ তুমি বলো, ‘‘হে আল্লাহ! নিশ্চয় আমি আমার সত্তার উপর অনেক অত্যাচার করেছি, তুমি ভিন্ন গুনাহ মাফ করার আর কেউ নাই। অতএব তুমি আমাকে মাফ করে দাও। কেননা তুমিই কেবল ক্ষমা করতে পারো এবং আমার প্রতি দয়া করো। নিশ্চয় তুমি ক্ষমাকারী, অতি দয়ালু’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "৭/৩৮৩৬। আবূ উমামা আল-বাহিলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি লাঠিতে ভর দিয়ে আমাদের নিকট বেরিয়ে এলেন। আমরা তাঁকে দেখামাত্র দাঁড়িয়ে গেলাম। তিনি বলেনঃ পারস্যবাসীরা তাদের নেতাদের সাথে যেরূপ করে, তোমরা তদ্রূপ করো না। আমরা বললাম, হে আল্লাহর রাসূল! আপনি যদি আমাদের জন্য আল্লাহর নিকট দোয়া করতেন। তিনি বলেন, ‘‘হে আল্লাহ! আমাদের মাফ করে দাও, আমাদের প্রতি দয়া করো, আমাদের প্রতি সন্তুষ্ট থাকো, আমাদের দোয়া কবুল করো,আমাদেরকে জান্নাতে প্রবেশ করাও, আমাদেরকে জাহান্নাম থেকে নাজাত দাও, আমাদের অবস্থা সংশোধন করে দাও সম্পুর্নভাবে এবং আমাদের জন্য আরো অধিক দোয়া করবেন। তখন তিনি বলেনঃ আমি কি তোমাদের সকল প্রয়োজন একত্র করে দেইনি?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "৮/৩৮৩৭। আবূ হুরায়রা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট চারটি জিনিস থেকে আশ্রয় চাইঃ এমন জ্ঞান থেকে যা উপকারে আসে না, এমন অন্তর থেকে যা ভীত-বিহবল হয় না, এমন আত্মা থেকে যা তৃপ্ত হয় না এবং এমন দোয়া থেকে যা কবুল করা হয় না’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "১/৩৮৩৮। আয়েশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ সকল বাক্যে দোয়া করতেনঃ ‘‘হে আল্লাহ! আমি অবশ্যই আপনার নিকট আশ্রয় চাই জাহান্নামের বিপর্যয় থেকে, জাহান্নামের শাস্তি থেকে, কবরের বিপর্যয় থেকে, কবরের শাস্তি থেকে, প্রাচুর্যের বিপর্যয়কর ক্ষতি থেকে, দারিদ্রের বিপর্যয়কর অভিশাপ থেকে এবং দাজ্জালের বিপর্যয়কর ক্ষতি থেকে। হে আল্লাহ! তুমি আমার গুনাহসমূহ বরফ-শিলা পানি দিয়ে ধুয়ে ফেলো, আমার অন্তরকে সমস্ত পাপ থেকে পরিচ্ছন্ন করো, যেমন তুমি সাদা কাপড়কে ময়লা থেকে পরিষ্কার করো এবং আমার ও আমার পাপগুলোর মাঝে এতোটা দুরত্ব সৃষ্টি করে দাও, তুমি যতটা দূরত্ব সৃষ্টি করেছো পূর্ব ও পশ্চিমের মাঝে। হে আল্লাহ! আমি তোমার কাছে আশ্রয় চাই অলসতা থেকে, বার্ধক্য থেকে, গুনাহ প্রলুব্ধকর বস্ত্ত থেকে এবং ঋণভার থেকে’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "২/৩৮৩৯। ফারওয়া ইবনে নাওফাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেসব বাক্যে দোয়া করতেন, আমি আয়েশা (রাঃ) -র নিকট সেই দোয়া সম্পর্কে জিজ্ঞেস করলাম। তিনি বলেন, তিনি বলতেনঃ ‘‘হে আল্লাহ! আমি আপনার নিকট আশ্রয় চাই আমার কৃতকর্মের ক্ষতি থেকে এবং যে কাজ আমি (এখনো) করিনি তার অনিষ্ট থেকে ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "৩/৩৮৪০। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিম্নোক্ত দোয়াটি আমাদেরকে এতো গুরুত্ব সহকারে শিক্ষা দিতেন যত গুরুত্ব সহকারে তিনি আমাদের কুরআনের কোন সূরা শিক্ষা দিতেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট আশ্রয় চাই জাহান্নামের আযাব থেকে, তোমার নিকট আরো আশ্রয় চাই কবরের আযাব থেকে তোমার নিকট আরো আশ্রয় চাই মাসীহ দাজ্জালের বিপর্যয় থেকে এবং তোমার নিকট আরো আশ্রয় চাই জীবন ও মৃত্যুর বিপর্যয় থেকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "৪/৩৮৪১। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক রাতে অমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর বিছানায় পেলাম না। আমি তাঁকে খুঁজতে লাগলাম। আমার হাত তাঁর দু’ পায়ের পাতার নীচে গিয়ে লাগলো। তিনি তখন সিজদারত ছিলেন এবং তাঁর পায়ের পাতা দু’টি দাঁড়ানো অবস্থায় ছিল। তিনি বলছিলেনঃ ‘‘হে আল্লাহ! আমি তোমার সন্তুষ্টির উসীলায় তোমার অসন্তোষ থেকে আশ্রয় চাই, তোমার ক্ষমার উসীলায় তোমার আযাব থেকে আশ্রয় চাই, তোমার নিকট তোমা থেকে আশ্রয় চাই, তোমার পূর্ণ প্রশংসা করা আমার সাধ্যাতীত, তুমি যেরূপ তোমার প্রশংসা বর্ণনা করেছো সেরূপই’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "৫/৩৮৪২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা দারিদ্র, স্বল্পতা, অত্যাচার করা ও অত্যাচারিত হওয়া থেকে আল্লাহর নিকট আশ্রয় প্রার্থনা করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "৬/৩৮৪৩। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আল্লাহর নিকট উপকারী জ্ঞান লাভের প্রার্থনা করো এবং অপকারী জ্ঞান থেকে আল্লাহর নিকট আশ্রয় প্রার্থনা করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "৭/৩৮৪৪। উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশ্রয় প্রার্থনা করতেন ভীরুতা, কাপুরুষতা, কার্পণ্য, অথর্বজনক বার্ধক্য, কবরের শাস্তি ও অন্তরের বিপর্যয় থেকে। ওয়াকী (রাঃ) বলেন, অন্তরের বিপর্যয়ের অর্থ হলো যে ব্যক্তি তার পথভ্রষ্টতা থেকে আল্লাহর নিকট ক্ষমা প্রার্থনা না করে মারা যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "১/৩৮৪৫। তারিক (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ হাদীস শুনেছেন। এক ব্যক্তি তাঁর নিকট এসে বললো, হে আল্লাহর রাসূল! আমি আমার প্রভুর নিকট প্রার্থনা করতে গিয়ে কিভাবে বলবো? তিনি বলেনঃ তুমি বলো, ‘‘হে আল্লাহ! আমাকে ক্ষমা করো, আমার প্রতি দয়া করো, আমাকে আরোগ্য দান করো এবং আমাকে রিযিক দান করো’’। অতঃপর তিনি তাঁর বৃদ্ধাংগুলি ছাড়া অবশিষ্ট চার আংগুল একত্র করে বলেনঃ এই চারটি প্রার্থনা তোমার দীন ও দুনিয়াকে তোমার জন্য একত্র করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "২/৩৮৪৬। ‘আয়িশাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে এই দু’আ শিখিয়েছেনঃ ‘‘হে আল্লাহ! আমি তোমার কাছে যাবতীয় কল্যাণ ভিক্ষা করছি, যা তাড়াতাড়ি আসে, যা দেরিতে আসে, যা জানা আছে, যা জানা নেই। আর আমি যাবতীয় মন্দ হতে তোমার আশ্রয় ভিক্ষা করছি- যা তাড়াতাড়ি আগমনকারী আর যা দেরিতে আগমনকারী আর যা আমি জানি আর যা অবগত নই। হে আল্লাহ! আমি তোমার নিকটে ঐ মঙ্গলই চাচ্ছি যা চেয়েছেন- তোমার (নেক) বান্দা ও তোমার নবী, আর তোমার কাছে ঐ মন্দ বস্ত্ত থেকে পানাহ চাচ্ছি যা হতে তোমার বান্দা ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানাহ চেয়েছেন। হে আল্লাহ্! আমি তোমার কাছে জান্নাত চাচ্ছি এবং ঐসব কথা ও কাজ চাচ্ছি যেগুলো আমাকে জান্নাতের নিকটবর্তী করে দেবে। আর আমি জাহান্নাম হতে তোমার নিকট পানাহ চাচ্ছি এবং ঐসব কথা ও কাজ হতেও পানাহ চাচ্ছি যেগুলো আমাকে জাহান্নামের নিকটবর্তী করে দেবে। আর আমি তোমার কাছে প্রার্থনা করছি যে, তুমি আমার জন্য যেসব ফায়সালা করে রেখেছ তা আমার জন্য কল্যাণকর করে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "৩/৩৮৪৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বললেনঃ নামাযের মধ্যে তুমি কী বলো? সে বললো, আমি তাশাহ্হুদ পড়ি, অতঃপর আল্লাহর নিকট জান্নাত কামনা করি এবং জাহান্নাম থেকে তাঁর নিকট আশ্রয় প্রার্থনা করি। তবে আপনার ও মুআয (রাঃ)-র দোয়া কতই না উত্তম। তিনি বললেনঃ আমরাও প্রায় অনুরূপ দোয়া করে থাকি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "১/৩৮৪৮। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, হে আল্লাহর রাসূল! কোন্ দোয়া সর্বোত্তম? তিনি বলেনঃ তুমি তোমার প্রতিপালকের নিকট দুনিয়া ও আখেরাতের শান্তি ও নিরাপত্তা প্রার্থনা করো। অতঃপর সে দ্বিতীয় দিন তাঁর নিকট এসে বললো, ইয়া রাসূলাল্লাহ! কেন্ দোয়া সর্বোত্তম? তিনি বলেনঃ তুমি তোমার প্রভুর নিকট দুনিয়া ও আখেরাতের শান্তি ও নিরাপত্তা প্রার্থনা করো। অতঃপর সে তৃতীয় দিন তাঁর নিকট এসে বললো, হে আল্লাহর নবী! কোন্ দোয়া সর্বোত্তম? তিনি বলেনঃ তুমি তোমার রবের নিকট দুনিয়া ও আখেরাতের শান্তি ও নিরাপত্তা প্রার্থনা করো। যদি তোমাকে দুনিয়া ও আখেরাতের শান্তি ও নিরাপত্তা দান করা হয়, তাহলে তুমি পরম সাফল্য লাভ করলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "২/৩৮৪৯। আওসাত ইবনে ইসমাঈল আল-বাজালী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইনতিকালের পর তিনি আবূ বাকর (রাঃ) থেকে বলতে শুনেনঃ গত বছর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার এই স্থানে দাঁড়ালেন, অতঃপর আবূ বাকর (রাঃ) কেঁদে দিলেন, অতঃপর বললেনঃ অবশ্যই তোমরা সততা অবলম্বন করবে। কারণ তা পুণ্যের সাথী এবং দেু’টির অবস্থান জান্নাতে। তোমরা অবশ্যই মিথ্যাকে পরিহার করবে। কারণ তা পাপাচারের সাথী এবং এ দু’টির অবস্থান জাহান্নামে। তোমরা আল্লাহর নিকট সুস্থতা ও নিরাপত্তা কামনা করো। কেননা ঈমানের পর কাউকে সুস্থতা ও নিরাপত্তার চেয়ে অধিক উত্তম কিছু দান করা হয়নি। তোমরা পরস্পর হিংসা-বিদ্বেষ পোষণ করো না, সম্পর্কচ্ছেদ করো না এবং পরস্পর থেকে মুখ ফিরিয়ে নিও না। হে আল্লাহর বান্দাগণ! তোমরা ভাই ভাই হয়ে যাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "৩/৩৮৫০। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, ইয়া রাসূলাল্লাহ! আমি যদি কদরের রাত পেয়ে যাই তবে কী দোয়া পড়বো? তিনি বলেনঃ তুমি বলবে (রাঃ) ‘‘হে আল্লাহ! তুমি ক্ষমাকারী, তুমি ক্ষমা করতেই ভালোবাসো। অতএব তুমি আমাকে ক্ষমা করে দাও’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "৪/৩৮৫১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বান্দা যত রকম দোয়া করে তার মধ্যে ‘‘হে আল্লাহ আমি তোমার নিকট দুনিয়া ও আখেরাতের নিরাপত্তা কামনা করি ’’ এ দোয়ার চেয়ে উত্তম কোন দোয়া নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "১/৩৮৫২। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘আল্লাহ আমাদেরকে এবং আদ জাতির ভাই (হূদ আ)-কে দয়া করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "১/৩৮৫৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের যে কোন লোকের দোয়াই কবুল হয়ে থাকে, যাবত না সে তাড়াহুড়া করে। বলা হলো, ইয়া রাসূলাল্লাহ! লোকে তাড়াহুড়া কিভাবে করে? তিনি বলেনঃ দোয়াকারী বলে, আমি আল্লাহর নিকট দোয়া করলাম কিন্তু আল্লাহ আমার দোয়া কবুল করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "১/৩৮৫৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন এভাবে না বলেঃ ‘‘হে আল্লাহ তুমি চাইলে আমাকে ক্ষমা করো ’’, বরং সে যেন পূর্ণ দৃঢ়তা সহকারে কামনা করে। কেননা কোন কাজই আল্লাহর জন্য বাধ্যতামূলক নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": 3855,
			"text": "১/৩৮৫৫। আসমা বিনতে ইয়াযীদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর মহান নাম (ইসমে আযম) এই দু’ আয়াতের মধ্যে নিহিত আছে (অনুবাদ): ‘‘আর তোমাদের ইলাহ একমাত্র ইলাহ। তিনি ব্যতীত অন্য কোন ইলাহ নাই। তিনি দয়াময় অতি দয়ালু ’’ ( ২ঃ ১৬৩) এবং সূরা আল ইমরানের প্রথম আয়াত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "২/৩৮৫৬। কাসিম (রাঃ) থেকে বর্ণিত। তিনি বলেন, আল্লাহর ইসমে আযম, যার উল্লেখ করে দোয়া করলে তা কবুল হয়, তা তিনটি সূরায় রয়েছেঃ সূরা বাকারা, সূরা আল ইমরান ও সূরা তাহা। ৩/৩৮৫৬ (১)। আবদুর রহমান ইবনে ইবরাহীম-আমর ইবনে আবূ সালামা-ঈসা ইবনে মূসা-গাইলান ইবনে আনাস-কাসিম-আবূ উমামা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে পূর্বোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": 3857,
			"text": "৪/৩৮৫৭। বুরাইদা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বলতে শুনলেনঃ ‘‘হে আল্লাহ! নিশ্চয় আমি তোমার নিকট এই বিশ্বাসে প্রার্থনা করছি যে, তুমিই একমাত্র আল্লাহ, তুমি একক সত্তা, স্বয়ংসম্পূর্ণ, তিনি কাউকে জন্ম দেননি এবং তাঁকেও জন্ম দেয়া হয়নি এবং তাঁর সমকক্ষ কেউ নেই ’’ তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ নিশ্চয় এ ব্যক্তি আল্লাহর নিকট তাঁর মহান নামের উসীলায় প্রার্থনা করেছে, যার উসীলায় প্রার্থনা করলে তিনি অবশ্যই দান করেন এবং যার উসীলায় দোয়া করলে তিনি অবশ্যই কবুল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": 3858,
			"text": "৫/৩৮৫৮। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বলতে শুনলেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট প্রার্থনা করছি, কেননা সমস্ত প্রশংসা তোমার, তুমি ব্যতীত আর কোন ইলাহ নেই, তুমি একক সত্তা, তোমার কোন শরীক নেই, তুমি অনুগ্রহকারী, আসমানসমূহ ও যমীনের উদ্ভাবনকারী, মহা শক্তি ও সম্মানের অধিকারী তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন সে আল্লাহর নিকট তাঁর ইসমে আযমের (মহান নামের) উসীলায় প্রার্থনা করেছে, যার উসীলায় প্রার্থনা করলে তিনি দান করেন এবং যার উসীলায় দোয়া করলে তিনি কবুল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "৬/৩৮৫৯। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ ‘‘হে আল্লাহ! আমি আপনার নিকট আপনার পবিত্র, উত্তম, বরকতপূর্ণ এবং আপনার অধিক প্রিয় নামের উসীলায় আপনার নিকট প্রার্থনা করছি, যে নামের উসীলায় আপনাকে ডাকলে আপনি সাড়া দেন, যে নামের উসীলায় প্রার্থনা করলে আপনি দান করেন, যে নামের উসীলায় রহমত প্রার্থনা করা হলে আপনি রহমত নাযিল করেন এবং যে নামের উসীলায় বিপদমুক্তি কামনা করা হলে আপনি বিপদমুক্ত করেন ’’। আয়েশা (রাঃ) বলেন, একদিন তিনি বললেনঃ হে আয়েশা! তুমি কি জানো, আল্লাহ আমাকে সেই নামটি বলে দিয়েছেন, যে নামের উসীলায় ডাকলে তিনি সাড়া দেন? আয়েশা (রাঃ) বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমার পিতা-মাতা আপনার জন্য উৎসর্গিত হোক, তা আমাকে শিখিয়ে দিন। তিনি বলেনঃ হে আয়েশা! তা তোমার পক্ষে সম্ভব হবে না। তিনি বলেন, তখন আমি সরে গিয়ে কিছুক্ষণ বসে থাকলাম, অতঃপর উঠে দাঁড়িয়ে তাঁর মাথায় চুমা দিয়ে বললাম, হে আল্লাহর রাসূল! তা আমাকে শিখিয়ে দিন। তিনি বলেনঃ হে আয়েশা! তা তোমার পক্ষে সম্ভব হবে না। আমি যদি তোমাকে শিখিয়ে দেই তবে সেই নামের উসীলায় পার্থিব জগতের কিছু প্রার্থনা করা তোমার জন্য সংগত হবে না। আয়েশা (রাঃ) বলেন, তখন আমি উঠে গিয়ে উযু করার এবং দু’ রাক‘আত নামায পড়ার পর বললাম, ‘‘হে আল্লাহ! আমি তোমাকে ‘আল্লাহ’ নামে ডাকছি, আমি তোমাকে রহমান নামে ডাকছি, আমি তোমাকে ‘বাররুর রহীম’ নামে ডাকছি এবং আমি তোমাকে আমার জানা-অজানা তোমার যাবতীয় সর্বোত্তম নামে ডাকছি, তুমি আমাকে ক্ষমা করে দাও এবং আমার প্রতি দয়া করো’’। আয়েশা (রাঃ) বলেন, এতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অকৃত্রিম হাসি দিলেন, অতঃপর বললেনঃ তুমি যেসব নামে ডাকলে, সেই নামটি অবশ্যই এগুলোর মধ্যে আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": 3860,
			"text": "১/৩৮৬০। আবু হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় আল্লাহর নিরানব্বইটি নাম আছে অর্থাৎ এক কম এক শত। যে ব্যক্তি এই নামগুলো কণ্ঠস্থ করলো বা গুণে গুণে পড়লো সে জান্নাতে প্রবেশ করলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "২/৩৮৬১। আব হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর নিরানব্বই নাম আছে অর্থাৎ এক কম এক শত। নিশ্চয় তিনি বেজোড় এবং তিনি বেজোড়কে পছন্দ করেন। যে ব্যক্তি এই নামগুলোর হেফাজত করবে সে জান্নাতে প্রবেশ করবে। সেগুলো এইঃ اللَّهُ الْوَاحِدُ الصَّمَدُ الأَوَّلُ الآخِرُ الظَّاهِرُ الْبَاطِنُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ الْمَلِكُ الْحَقُّ السَّلاَمُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ الرَّحْمَنُ الرَّحِيمُ اللَّطِيفُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْعَلِيمُ الْعَظِيمُ الْبَارُّ الْمُتَعَالِ الْجَلِيلُ الْجَمِيلُ الْحَىُّ الْقَيُّومُ الْقَادِرُ الْقَاهِرُ الْعَلِيُّ الْحَكِيمُ الْقَرِيبُ الْمُجِيبُ الْغَنِيُّ الْوَهَّابُ الْوَدُودُ الشَّكُورُ الْمَاجِدُ الْوَاجِدُ الْوَالِي الرَّاشِدُ الْعَفُوُّ الْغَفُورُ الْحَلِيمُ الْكَرِيمُ التَّوَّابُ الرَّبُّ الْمَجِيدُ الْوَلِيُّ الشَّهِيدُ الْمُبِينُ الْبُرْهَانُ الرَّءُوفُ الرَّحِيمُ الْمُبْدِئُ الْمُعِيدُ الْبَاعِثُ الْوَارِثُ الْقَوِيُّ الشَّدِيدُ الضَّارُّ النَّافِعُ الْبَاقِي الْوَاقِي الْخَافِضُ الرَّافِعُ الْقَابِضُ الْبَاسِطُ الْمُعِزُّ الْمُذِلُّ الْمُقْسِطُ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ الْقَائِمُ الدَّائِمُ الْحَافِظُ الْوَكِيلُ الْفَاطِرُ السَّامِعُ الْمُعْطِي الْمُحْيِي الْمُمِيتُ الْمَانِعُ الْجَامِعُ الْهَادِي الْكَافِي الأَبَدُ الْعَالِمُ الصَّادِقُ النُّورُ الْمُنِيرُ التَّامُّ الْقَدِيمُ الْوِتْرُ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ যুহাইর (রাঃ) বলেন, আমরা একাধিক বিশেষজ্ঞ আলেমের অভিমত অবহিত হয়েছি যে, উক্ত নামগুলো নিম্নোক্তভাবে শুরু করতে হবেঃ (আল্লাহ ছাড়া আর কোন ইলাহ নাই, তিনি এক, তাঁর কোন শরীক নাই, তাঁর জন্য রাজত্ব, তাঁর জন্য সমস্ত প্রশংসা, তাঁর হাতে যাবতীয় কল্যাণ নিহিত, তিনি সবকিছুর উপর পূর্ণ ক্ষমতাবান। আল্লাহ ছাড়া কোন ইলাহ নাই, তাঁর জন্য রয়েছে সর্বোত্তম নামসমূহ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": 3862,
			"text": "১/৩৮৬২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন ব্যক্তির দোয়া নিঃসন্দেহে কবুল হয়। মজলুমের দোয়া, মুসাফিরের দোয়া ও সন্তানের জন্য পিতার দোয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": 3863,
			"text": "২/৩৮৬৩। উম্মু হাকীম বিনতে ওয়াদ্দাআ আল-খুযাইয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ পিতার দোয়া (আল্লাহর নূরের) পর্দা পর্যন্ত পৌঁছে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": 3864,
			"text": "১/৩৮৬৪। আনু নাআমা (রাঃ) থেকে বর্ণিত। আবদুল্লাহ ইবনে মুগাফ্ফাল (রাঃ) তার ছেলেকে বলতে শুনলেন, ‘‘হে আল্লাহ! আমি জান্নাতে প্রবেশ করে আপনার নিকট জান্নাতের ডান দিকের শ্বেত প্রাসাদ প্রার্থনা করি’’। তখন তিনি বলেন, হে বৎস! আল্লাহর নিকট জান্নাত প্রার্থনা করো এবং জাহান্নাম থেকে আশ্রয় চাও। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ অচিরেই এমন এক সম্প্রদায়ের আবির্ভাব হবে যারা দোয়ায় অতিরঞ্জন করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": 3865,
			"text": "১/৩৮৬৫। সালমান (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নিশ্চয় তোমাদের প্রতিপালক চিরঞ্জীব, দানশীল। তাঁর কোন বান্দা নিজের দু’ হাত তুলে তাঁর নিকট দোয়া করলে তিনি তার শূন্যহাত বা তাকে নিরাশ করে ফিরিয়ে দিতে লজ্জাবোধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "২/৩৮৬৬। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি যখন আল্লাহর নিকট দোয়া করবে, তখন তোমার দু’ হাতের তালু উপর দিকে রেখে দোয়া করবে, দু’ হাতের পিঠ উপর দিকে রেখে দোয়া করবে না। তুমি দোয়া শেষ করে হাতের তালুদ্বয় তোমার মুখমন্ডলে মাসেহ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": 3867,
			"text": "১/৩৮৬৭। আবূ আইয়াশ আয-যুরাকী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি ভোরে উপনীত হয়ে বলেঃ ‘‘আল্লাহ ব্যতীত কোন ইলাহ নই, তিনি এক, তাঁর কোন শরীক নাই, রাজত্ব-সার্বভোমত্ব তাঁর, সমস্ত প্রশংসা তাঁর জন্য, তিনি সর্ববিষয়ে শক্তিমান ’’, সে ইসমাঈল (আ)-এর বংশের একটি গোলাম আযাদ করার সমতুল্য সওয়াব পাবে, তার দশটি গুনাহ মোচন হবে, তার মর্যাদা দশ গুণ বৃদ্ধি করা হবে এবং সে সন্ধ্যা পর্যন্ত শয়তান থেকে নিরাপদ থাকবে। সে সন্ধ্যায় উপনীত হয়ে অনুরূপ দোয়া করলে ভোর হওয়া পর্যন্ত অনুরূপ নিরাপদ থাকবে। সে সন্ধ্যায় উপনীত হয়ে অনুরূপ দোয়া করলে ভোর হওয়া পর্যন্ত অনুরূপ প্রতিদান পাবে। রাবী বলেন, এক ব্যক্তি স্বপ্নে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দর্শনলাভ করে তাকে জিজ্ঞাসা করলো, ইয়া রাসূলাল্লাহ! আবূ আইয়াশ আপনার নামে এ ধরনের হাদীস বর্ণনা করেন। তিনি বলেনঃ আবূ আইয়াশ সত্য বলেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": 3868,
			"text": "২/৩৮৬৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ভোরে উপনীত হয়ে বলবে, ‘‘হে আল্লাহ! তোমার হুকুমেই আমার প্রভাতে উপনীত হই এবং তোমার হুকুমেই আমরা সন্ধ্যায় উপনীত হই, তোমার হুকুমেই আমরা জীবন ধারণ করি এবং তোমার হুকুমেই আমরা মৃত্যুবরণ করি’’। আর তোমরা সন্ধ্যায় উপনীত হয়েও বলবে, ‘‘হে আল্লাহ! আমরা তোমার হুকুমেই সন্ধ্যায় উপনীত হই, তোমার হুকুমেই আমরা ভোরে উপনীত হই, তোমার হুকুমেই আমরা জীবন ধারণ করি এবং তোমার হুকুমেই আমরা মৃত্যুবরণ করি। তোমার নিকটই আমাদের প্রত্যাবর্তন ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": 3869,
			"text": "৩/৩৮৬৯। উসমান ইবনে আফফান (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যে কোন বান্দা প্রতিদিন সকালে ও প্রতি রাতে সন্ধ্যায় তিনবার করে এ দোয়াটি পড়লে কোন কিছুই তার ক্ষতি করতে পারবে নাঃ ‘‘আল্লাহর নামে যাঁর নামের বরকতে আসমান ও যমীনের কোন কিছুই কোন ক্ষতি করতে পারে না। তিনি সর্বশ্রোতা সর্বোজ্ঞ ’’। অধস্তন রাবী বলেন, আবান (রাঃ)-এর দেহের একাংশ পক্ষাঘাতগ্রস্ত হয়ে পড়ে। (উক্ত হাদীস বর্ণনাকালে) এক ব্যক্তি (অধস্তন রাবী) তার দিকে তাকাতে থাকলে তিনি তাকে বলেন, তুমি কি দেখছো? শোন! আমি তোমার নিকট যে হাদীস বর্ণনা করছি তা হুবহু বর্ণনা করেছি। তবে যেদিন আমি পক্ষাঘাতগ্রস্ত হয়েছি সেদিন ঐ দোয়া পড়িনি এবং আল্লাহ তা‘আলা তাকদীরের লিখন আমার উপর কার্যকর করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": 3870,
			"text": "৪/৩৮৭০। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খাদেম আবূ সাল্লাম (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন মুসলিম বা কোন মানুষ বা কোন বান্দা সন্ধ্যায় ও সকালে উপনীত হয়ে ‘‘আল্লাহ আমার প্রভু, ইসলাম আমার দীন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার রাসূল হওয়ায় আমি সর্বান্তঃকরণে সন্তুষ্ট আছি ’’ এ কথা বললে, কিয়ামতের দিন তার উপর সন্তুষ্ট হওয়া আল্লাহর কর্তব্য হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": 3871,
			"text": "৫/৩৮৭১। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সন্ধ্যায় ও সকালে উপনীত হয়ে নিম্নোক্ত দোয়া পড়তেনঃ ‘‘ হে আল্লাহ! আমি তোমার নিকট দুনিয়া ও আখেরাতের স্বস্তি ও নিরাপত্তা প্রার্থনা করছি। হে আল্লাহ! আমি তোমার নিকট আমার দীন, আমার দুনিয়া, আমার পরিবার ও আমার সম্পদের স্বস্তি ও নিরাপত্তা প্রার্থনা করছি। হে আল্লাহ! আমার লজ্জাস্থানকে গোপন রাখো, আমার ভয়কে শান্তিতে পরিণত করো এবং আমার ডান দিক থেকে, আমার বাম দিক থেকে ও আমার উপরের দিক থেকে আমাকে হেফাজত করো। আমি তোমার নিকট আমার নিচের দিক দিয়ে আমাকে ধ্বসিয়ে দেয়া থেকে আশ্রয় প্রার্থনা করি্।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "৬/৩৮৭২। বুরায়দা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দোয়া পড়েছেনঃ ‘‘হে আল্লাহ! তুমি আমার প্রভু, তুমি ব্যতীত আর কোন ইলাহ নাই, তুমি আমাকে সৃষ্টি করেছো, আমি তোমার বান্দা, আমি তোমার প্রতিশ্রুতিতে যথাসাধ্য প্রতিষ্ঠিত থাকবো। আমি আমার কৃতকর্মের ক্ষতি থেকে তোমার আশ্রয় চাই, আমি তোমার নিয়ামতসমূহ স্বীকার করছি, আমি আমার অপরাধ স্বীকার করছি। অতএব তুমি আমার অপরাধসমূহ মাফ করে দাও। কারণ তুমি ছাড়া গুনাহ মাফ করার আর কেউ নাই’’। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি দিনে ও রাতে এ দোয়া পড়লে এবং সেই দিনে বা রাতে মারা গেলে ইনশাআল্লাহ জান্নাতে দাখিল হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": 3873,
			"text": "১/৩৮৭৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শয্যা গ্রহণ করতেন তখন বলতেনঃ ‘‘হে আল্লাহ! আকাশমন্ডলী ও পৃথিবীর প্রভু, প্রতিটি জিনিসের প্রভু, শস্যবীজ ও আঁটির অংকুর উদগমকারী, তাওরাত, ইনজীল ও মহান কুরআন নাযিলকারী! আমি প্রত্যেক প্রাণীর অনিষ্ট থেকে তোমার নিকট আশ্রয় প্রার্থনা করি। এগুলো তোমার আয়ত্তাধীন। তুমিই আদি, তোমার পূর্বে কিছুই নাই। তুমিই গুপ্ত, তোমার থেকে কিছুই গোপন নয়। সুতরাং তুমি আমার ঋণ পরিশোধের ব্যবস্থা করে দাও এবং আমাকে দারিদ্র থেকে স্বাবলম্বী করো ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": 3874,
			"text": "২/৩৮৭৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের কেউ যখন শয্যা গ্রহণের ইচ্ছা করে, তখন সে যেন তার লুঙ্গীর ভেতরাংশ ঝেড়ে নেয়, অতঃপর তা দিয়ে তার বিছানা ঝেড়ে ফেলে। কেননা সে জানে না যে, তার অনুপস্থিতিতে বিছানায় কী পতিত হয়েছে। অতঃপর সে যেন তার ডান কাতে শোয়,অতঃপর বলে, ‘‘হে আমার রব! তোমার নামে আমি আমার পার্শ্বদেশ বিছানায় এলিয়ে দিলাম এবং তোমার নামেই আবার তা উঠাবো। যদি তুমি আমার জান রেখে দাও (মৃত্যু দান করো) তবে তার প্রতি দয়া করো, আর যদি তাকে ছেড়ে দাও তবে তার সেইভাবে হেফাজত করো যেভাবে তুমি তোমার সৎকর্মপরায়ণ বান্দাদের হেফাজত করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": 3875,
			"text": "৩/৩৮৭৫। আয়েশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শয্যা গ্রহণ করতেন, তখন সূরা ফালাক ও সূরা নাস পড়ে তাঁর দু’ হাতে ফুঁ দিয়ে তা তাঁর সমস্ত শরীর মলতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": 3876,
			"text": "৪/৩৮৭৬। বারাআ ইবনে আযেব (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বলেনঃ যখন তুমি শয্যা গ্রহণ করবে বা বিছানাগত হবে তখন বলবে, ‘‘হে আল্লাহ! আমি আমার মুখমন্ডল তোমার দিকে ফিরিয়ে দিলাম, আমার পিঠ তোমার আশ্রয়ে সোপর্দ করলাম, তোমার রহমতের আশা ও তোমার আযাবের ভয় সহকারে আমার যাবতীয় বিষয় তোমার উপর সোপর্দ করলাম। তোমার থেকে পালিয়ে আশ্রয় নেয়ার এবং নাজাত পাওয়ার তুমি ভিন্ন আর কোন ঠিকানা নাই। তুমি যে কিতাব নাযিল করেছো এবং যে নবী পাঠিয়েছ আমি তার উপর ঈমান এনেছি ’’। তুমি যদি সে রাতে মারা যাও তাহলে তুমি ফিতরাতের (ইসলামের) উপর মৃত্যুবরণ করবে। আর তুমি যদি সকালে উপনীত হও তবে পর্যাপ্ত কল্যাণ প্রাপ্ত হয়ে সকালে উপনীত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": 3877,
			"text": "৫/৩৮৭৭। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শয্যা গ্রহণ করতেন তখন তাঁর ডান হাত তাঁর গন্ডদেশের নিচে স্থাপন করে বলতেনঃ ‘‘হে আল্লাহ! যেদিন তুমি তোমার বান্দাদের পুনরুত্থিত করবে এবং সমবেত করবে, সেদিন আমাকে তোমার শাস্তি থেকে রক্ষা করো ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": 3878,
			"text": "১/৩৮৭৮। উবাদা ইবনুস সামিত (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি রাতে ঘুম থেকে জাগ্রত হয়ে বলে, ‘‘আল্লাহ ব্যতীত কোন ইলাহ নাই, তিনি এক, তাঁর কোন শরীক নাই, সার্বভৌমত্ব তাঁর, সমস্ত প্রশংসা তাঁর প্রাপ্য, তিনি সবকিছুর উপর সর্বশক্তিমান, আল্লাহ মহা পবিত্র, আল্লাহই সমস্ত প্রশংসার অধিকারী, আল্লাহ ব্যতীত কোন ইলাহ নাই, আল্লাহ সুমহান, মহান আল্লাহর অনুগ্রহ ব্যতীত অন্যায় থেকে বিরত থাকার কিংবা ভালো কাজ করার শক্তি কারো নাই ’’, অতঃপর বলে ‘‘প্রভু! আমাকে ক্ষমা করো’’, তাকে ক্ষমা করা হয়। রাবী ওলীদ ইবনে মুসলিমের বর্ণনায় আছেঃ এ দোয়া করলে তার দোয়া কবুল করা হয়। অতঃপর সে উঠে গিয়ে উযু করে নামায পড়লে তার নামায কবুল করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "২/৩৮৭৯। রবীআ ইবনে আল-আসলাম (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ঘরের দ্বারদেশে রাত যাপন করতেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে রাতে দীর্ঘ সময় ধরে বলতে শুনতেন, ‘‘বিশ্বজাহানের প্রতিপালক আল্লাহ মহাপবিত্র’’, অতঃপর বলতেনঃ ‘‘আল্লাহ সম্পূর্ণ পবিত্র এবং প্রশংসা তাঁর প্রাপ্য’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": 3880,
			"text": "৩/৩৮৮০। হুযায়ফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতে ঘুম থেকে জাগ্রত হয়ে বলতেনঃ ‘‘সমস্ত প্রশংসা আল্লাহর যিনি আমাদের মৃত্যুর পর পুনরায় জীবিত করেছেন এবং তাঁর কাছেই প্রত্যাবর্তন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": 3881,
			"text": "৪/৩৮৮১। মুআয ইবনে জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কোন বান্দা পবিত্র অবস্থায় রাত যাপন করলে এবং ঘুম থেকে জাগ্রত হয়ে আল্লাহর নিকট দুনিয়া বা আখেরাতের কিছু প্রার্থনা করলে তিনি অবশ্যই তাকে তা দান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "১/৩৮৮২। আসমা বিনতে উমাইস (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বিপদকালে পড়ার জন্য কয়েকটি বাক্য শিখিয়েছেনঃ ‘‘আল্লাহ, আল্লাহ, আমার প্রতিপালক, আমি তাঁর সাথে কোন কিছুই শরীক করি না’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": 3883,
			"text": "২/৩৮৮৩। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিপদকালে নিম্নোক্ত দোয়া করতেনঃ ‘‘আল্লাহ ব্যতীত কোন ইলাহ নাই, তিনি পরম সহিষ্ণু, মহা সম্মানিত, পরম দয়ালু, মহান আরশের প্রভু আল্লাহ মহাপবিত্র, সাত আসমানের প্রভু ও মহান আরশের প্রভু আল্লাহ মহাপবিত্র’’ (বুখারী, মুসলিম, তিরমিযি ও নাসাঈ)। একদা ওয়াকী (রাঃ) প্রতিটি বাক্যের সাথে ‘‘লা ইলাহা ইল্লাল্লাহ’’ বলেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": 3884,
			"text": "১/৩৮৮৪। উম্মু সালামা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তাঁর ঘর থেকে বের হতেন তখন বলতেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট আশ্রয় চাই পথভ্রষ্ট হওয়া থেকে, পদঙ্খলন ঘটা থেকে, অত্যাচার করা থেকে, অত্যাচারিত হওয়া থেকে, অজ্ঞতাসুলভ আচরণ করা থেকে বা আমার প্রতি কারো অজ্ঞতাসুলভ আচরণ থেকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "২/৩৮৮৫। আবূ হুরায়রা (রাঃ) থকে বর্ণিত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তাঁর ঘর থেকে বের হতেন তখন বরতেনঃ ‘‘আল্লাহর নামে, আল্লাহ ছাড়া ক্ষতি রোধ করা বা কল্যাণ হাসিল করার শক্তি কারো নেই। ভরসা আল্লাহর উপর’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": 3886,
			"text": "৩/৩৮৮৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন কোন লোক তার ঘরের বা বাড়ির দরজা দিয়ে বাইরে বের হয়, তখন দু’জন ফেরেশতাকে তার সঙ্গী হিসাবে তার জন্য নিযুক্ত করা হয়। অতঃপর যখন সে ‘বিসমিল্লাহ’ বলে তখন ফেরেশতাদ্বয় বলেন, তোমাকে হেদায়াত দান করা হয়েছে। যখন সে বলে আল্লাহ ব্যতীত ক্ষতি রোধ করার বা কল্যাণ লাভ করার শক্তি কারো নাই, তখন ফেরেশতাদ্বয় বলেন, তোমাকে রক্ষা করা হয়েছে। যখন সে বলে, আমি আল্লাহর উপর ভরসা করলাম, তখন তারা বলেন, তোমার জন্য (আল্লাহ) যথেষ্ট হয়েছেন। অতঃপর তার সাথে তার জন্য নিযুক্ত দু’ সাথী সাক্ষাত করে। তখন ফেরেশতাদ্বয় বলেন, এমন ব্যক্তির ব্যাপারে তোমরা কী করতে চাও, যাকে হেদায়াত দান করা হয়েছে, যাকে রক্ষা করা হয়েছে এবং যার জন্য আল্লাহ যথেষ্ট হয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "১/৩৮৮৭। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ কোন ব্যক্তি তার ঘরে প্রবেশকালে এবং খাবার গ্রহণকালে আল্লাহর নাম স্মরণ করলে শয়তান (তার সংগীদেরকে) বলে, তোমাদের রাত্রিবাস এবং রাতের আহারের কোন ব্যবস্থা হলো না। কিন্তু কোন ব্যক্তি তার ঘরে প্রবেশকালে আল্লাহকে স্মরণ না করলে শয়তান বলে, তোমরা রাত্রিবাসের জায়গা পেয়ে গেলে। সে আহারের সময় আল্লাহকে স্মরণ না করলে শয়তান বলে, তোমাদের রাতের আহার ও শয্যা গ্রহণের ব্যবস্থা হয়ে গেলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": 3888,
			"text": "১/৩৮৮৮। আবদুল্লাহ ইবনে সারজিস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে রওয়ানার প্রাক্কালে বলতেনঃ ‘‘হে আল্লাহ! আমি তোমার নিকট সফরের ব্যর্থতা, প্রাচুর্যের পরে রিক্ততা, নির্যাতিতের বদদোয়া এবং পরিবার-পরিজন ও মাল-সম্পদের প্রতি কুদৃষ্টি থেকে তোমার আশ্রয় প্রার্থনা করি’’। আবূ মুআবিয়ার বর্ণনায় আরো আছেঃ তিনি ফিরে এসেও অনুরূপ বলতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": 3889,
			"text": "১/৩৮৮৯। আয়েশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আকাশের কোন দিক থেকে মেঘ ভেসে আসতে দেখলে তাঁর হাতের কাজ ছেড়ে দিতেন, এমনকি নামাযে রত থাকলেও, অতঃপর মেঘমালার দিকে মুখ করে বলতেনঃ ‘‘হে আল্লাহ! এই মেঘমালাকে যে অনিষ্টসহ পাঠানো হয়েছে তা থেকে তোমার আশ্রয় প্রার্থনা করি।’’ মেঘমালা বৃষ্টি বর্ষণ করলে তিনি দু’বার বা তিনবার বলতেনঃ ‘‘হে আল্লাহ! লাভজনক পর্যাপ্ত বৃষ্টি বর্ষণ করুন’’। মহান আল্লাহ যদি মেঘমালা সরিয়ে নিতেন এবং বৃষ্টি না হতো তবে সেজন্যও তিনি আল্লাহর প্রশংসা করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": 3890,
			"text": "২/৩৮৯০। আয়েশা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টি হতে দেখলে বলতেনঃ ‘‘হে আল্লাহ! তুমি একে লাভজনক পর্যাপ্ত বৃষ্টিপাতের কারণ বানাও।’’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": 3891,
			"text": "৩/৩৮৯১। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মেঘমালা দেখলে তাঁর চেহারা বিবর্ণ হয়ে পরিবর্তিত হয়ে যেতো এবং তিনি ঘরে প্রবেশ করতেন আবার বেরিয়ে আসতেন, আর সামনে যেতেন এবং পিছনে আসতেন। বৃষ্টি বর্ষণের পর তাঁর এ অবস্থা দূরীভূত হতো। অধস্তন রাবী বলেন, আয়েশা (রাঃ) তাঁর এরূপ অবস্থা হওয়ার কারণ জিজ্ঞেস করলে তিনি বলেনঃ তুমি কি জানো, হয়তো তা সেই মেঘই হবে, যে সম্পর্কে হূদ (আ)-এর জাতি বলেছিলো, ‘‘অতঃপর যখন তারা তাদের উপত্যকার দিকে মেঘ আসতে দেখলো তখন তারা বলতে লাগলোঃ সেটা তো মেঘ, আমাদেরকে বৃষ্টি দান করবে। (হুদ আ. বললেনঃ) বরং এটাই তো সেই আযাব যা তোমরা ত্বরান্বিত করতে চেয়েছো’’ (সূরা আহকাফঃ ২৪)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": 3892,
			"text": "১/৩৮৯২। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি হঠাৎ কোন বিপদগ্রস্ত ব্যক্তিকে দেখে বলবে, ‘‘সমস্ত প্রশংসা আল্লাহর জন্য, তিনি তোমাকে যে বিপদে লিপ্ত করেছেন তা থেকে আমাকে নিরাপদ রেখেছেন এবং তাঁর অসংখ্য সৃষ্টির উপর আমাকে মর্যাদা দান করেছেন ’’, তাহলে সে তার জীবৎকাল পর্যন্ত উক্ত বিপদ থেকে নিরাপদ থাকবে (তিরমিযি)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 66
			}
		}
	]
}