{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": 4100,
			"text": "১/৪১০০। আবূ যারা আল-গিফারী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হালাল বস্ত্তুকে হারাম করে নেয়া এবং ধনসম্পদ ধ্বংস করা দুনিয়ার প্রতি অনাসক্তি (যুহ্দ) নয়, বরং দুনিয়ার প্রতি অনাসক্তি হলোঃ আল্লাহর নিকট যা আছে তার চেয়ে তোমার নিকট যা আছে তার উপর অধিক নির্ভরশীল না হওয়া এবং তুমি কোন বিপদে পতিত হলে তার বিনিময়ে সওয়াবের আশার তুলনায় বিপদে পতিত না হওয়াটা তোমার নিকট অধিকতর কাঙ্ক্ষিত না হওয়া। হিশাম (রাঃ) বলেন, আবূ ইদরীস আল-খাওলানী (রাঃ) বলেছেন, হাদীস ভান্ডারে এ হাদীসটি যেন স্বর্ণ খনির খাঁটি সোনা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": 4101,
			"text": "২/৪১০১। আবূ খাল্লাদ (রাঃ) থেকে বর্ণিত। তিনি সাহাবী ছিলেন। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা এমন লোক দেখতে পাবে যাকে দুনিয়াতে যুহদ দান করা হয়েছে এবং স্বল্পভাষী করা হয়েছে, তখন তোমরা তার নৈকট্য ও সাহচর্য অবলম্বন করবে। কারণ তাকে প্রজ্ঞা দান করা হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": 4102,
			"text": "৩/৪১০২। সাহল ইবনে সাদ আস-সাইদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হয়ে বললো, হে আল্লাহর রাসূল! আমাকে এমন একটি কাজের কথা বলে দিন যা আমি করলে আল্লাহ আমাকে ভালোবাসবেন এবং লোকেরাও আমাকে ভালোবাসবেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি দুনিয়ার প্রতি অনাসক্তি অবলন্বন করো। তাহলে আল্লাহ তোমাকে ভালোবাসবেন। মানুষের নিকট যা আছে, তুমি তার প্রতি অনাসক্ত হয়ে যাও, তাহলে তারাও তোমাকে ভালোবাসবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": 4103,
			"text": "৪/৪১০৩। সামুরা ইবন সাহম (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি আবূ হাশেম ইবনে উতবার (রাঃ) কাছে গেলাম। তিনি বর্শার আঘাতে আহত হয়ে অসুস্থ ছিলেন। মুআবিয়া (রাঃ) ও তাকে দেখতে এলেন। আবূ হাশেম (রাঃ) কেঁদে দিলে তিনি বলেন, হে মামা! কিসে আপনাকে কাঁদাচ্ছে। আঘাতের যন্ত্রণা, নাকি পার্থিব কিছু? পার্থিব কিছু হলে তার উৎকৃষ্ট অংশ তো অতিবাহিত হয়েছে। তিনি বলেন, এর কোনটিই নয়। তবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট থেকে একটি প্রতিশ্রুতি নিয়েছিলেন। হায়! আমি যদি তা অনুসরণ করতাম। তিনি বলেছিলেনঃ ‘‘হয়তো তুমি পর্যাপ্ত সম্পদের অধিকারী হবে যা তুমি জনগণের মধ্যে বিতরণ করবে। তখন তোমার জন্য একটি খাদেম এবং আল্লাহর পথে জিহাদের জন্য একটি সওয়ারীই যথেষ্ট’’। আমি সেই প্রাচুর্য লাভ করেছি কিন্তু তা (বিতরণ না করে) পুঞ্জীভূত করে রেখেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": 4104,
			"text": "৫/৪১০৪। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, সালমান (রাঃ) অসুস্থ হয়ে পড়লে সাদ (রাঃ) তাকে দেখতে যান। তিনি তাকে কাঁদতে দেখে জিজ্ঞেস করেন, হে ভাই! আপনি কাঁদছেন কেন? আপনি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহচর্য লাভ করেননি? আপনি কি এই এই (ভালো কাজ) করেননি। সালমান (রাঃ) বলেন, আমি এই দু’টির কোনটির জন্যই কাঁদছি না। আমি দুনিয়া থেকে চলে যাওয়ার আক্ষেপে বা আখেরাতের পরিণতির আশংকায় কাঁদছি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট থেকে একটি প্রতিশ্রুতি নিয়েছিলেন, কিন্তুু মনে হয় আমি তাতে সীমালংঘন করেছি। সাদ (রাঃ) বলেন, তিনি আপনার থেকে কী প্রতিশ্রুতি নিয়েছিলেন? সালমান (রাঃ) বলেন, তিনি এই প্রতিশ্রুতি নিয়েছিলেন যে, ‘‘তোমাদের যে কোন ব্যক্তির একজন পর্যটকের সমপরিমাণ পাথেয় যথেষ্ট’’। কিন্তু আমি লক্ষ্য করছি যে, আমি সীমালংঘন করে ফেলেছি। হে ভাই সাদ! যখন তুমি বিচার মীমাংসা করবে, ভাগ-বাঁটোয়ারা করবে এবং কোন কাজের উদ্যোগ গ্রহণ করবে তখন আল্লাহকে ভয় করবে। সাবিত (রাঃ) বলেন, আমি জানতে পেরেছি যে, (মৃত্যুর সময়) সালমান (রাঃ) তার ভরণপোষণের জন্য সঞ্চিত মাত্র বিশাধিক দিরহাম রেখে যান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": 4105,
			"text": "১/৪১০৫। আবান ইবনে উসমান (রাঃ) থেকে বর্ণিত। তিনি বলেন, যায়েদ ইবনে সাবিত (রাঃ) দুপুরের সময় মারওয়ানের নিকট থেকে বের হয়ে এলে আমি ভাবলাম, নিশ্চয় কোন গুরুত্বপূর্ণ বিষয় জানার জন্য এ সময় তিনি তাকে ডেকে পাঠিয়েছেন। আমি তাকে জিজ্ঞেস করলে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আমাদের শ্রুত কতক হাদীস শোনার জন্য মারওয়ান আমাদের ডেকেছেন। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ পার্থিব চিন্তা যাকে মোহগ্রস্ত করবে, আল্লাহ তার কাজকর্মে অস্থিরতা সৃষ্টি করবেন, দরিদ্রতা তার নিত্যসংগী হবে এবং পার্থিব স্বার্থ ততটুকুই লাভ করতে পারবে, যতটুকু তার তাকদীরে লিপিবদ্ধ আছে। আর যার উদ্দেশ্য হবে আখেরাত, আল্লাহ তার সবকিছু সুষ্ঠু করে দিবেন, তার অন্তরকে ঐশ্বর্যমন্ডিত করবেন এবং দুনিয়া স্বয়ং তার সামনে এসে হাযির হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": 4106,
			"text": "২/৪১০৬। আসওয়াদ ইবনে ইয়াযীদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আবদুল্লাহ (রাঃ) বলেছেন, আমি তোমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যার চিন্তার কেন্দ্রবিন্দু হবে আখেরাত, তার পার্থিব চিন্তার জন্য আল্লাহই যথেষ্ট হয়ে যান। আর যে ব্যক্তি দুনিয়ার চিন্তায় মোহগ্রস্ত থাকে তার যে কোন উপত্যকায় বা প্রান্তরে ধ্বংস হয়ে যাওয়াতে আল্লাহর কোন পরোয়া নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": 4107,
			"text": "৩/৪১০৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহাপবিত্র আল্লাহ বলেনঃ হে আদম সন্তান! আমার ইবাদতে মগ্ন হও। আমি তোমার অন্তরকে ঐশ্বর্যমন্ডিত করবো এবং তোমার দারিদ্র দূর করবো। তুমি যদি তা না করো, তাহলে আমি তোমার অন্তর পেরেশানী দিয়ে পূর্ণ করবো এবং তোমার দরিদ্রতা দূর করবো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": 4108,
			"text": "১/৪১০৮। বনূ ফিহ্রের সদস্য মুসতাওরিদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ আখেরাতের তুলনায় দুনিয়া হলো এতটুকু, যেমন তোমাদের কেউ তার একটি আংগুল সমুদ্রের পানিতে ডুবিয়ে তা তুলে আনলো। সে লক্ষ্য করুক তার আংগুল কতটুকু পানি নিয়ে ফিরেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": 4109,
			"text": "২/৪১০৯। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি খেজুর পাতার মাদুরে শুয়েছিলেন। তাঁর দেহের চামড়ায় (মাদুরের) দাগ বসে গেলো। আমি বললাম, হে আল্লাহর রাসূল! আমার পিতা-মাতা আপনার জন্য উৎসর্গিত হোক। আপনি আমাদেরকে অনুমতি দিলে আমরা আপনার জন্য মাদুরের উপর কিছু বিছিয়ে দিতাম। তাহলে তা আপনাকে দাগ লাগা থেকে বাঁচিয়ে রাখতো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দুনিয়ার সাথে আমার সম্পর্ক কী? আমি দুনিয়াতে এমন এক মুসাফির বৈ তো কিছু নই, যে একটি গাছের ছায়ায় আশ্রয় নিলো, অতঃপর তা ত্যাগ করে গন্তব্যের পানে চলে গেলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": 4110,
			"text": "৩/৪১১০। সাহল ইবনে সাদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে যুল-হুলায়ফা নামক স্থানে থাকাকালে একটি মৃত বকরী চিৎ হয়ে পড়ে থাকতে দেখা গেলো। তিনি বলেনঃ তোমাদের কী ধারণা, এই বকরিটা তার মালিকের কাছে তুচ্ছ নয় কি? সেই মহান সত্তার শপথ, যাঁর হাতে আমার প্রাণ! এই মৃত বকরীটা তার মালিকের নিকট যতোটা তুচ্ছ, অবশ্যই এ দুনিয়া আল্লাহর নিকট তার চেয়েও অধিক তুচ্ছ। এ দুনিয়ার মূল্য যদি আল্লাহর নিকট মশার একটি পাখার সমানও হতো, তাহলে তিনি কোন কাফেরকে এখানকার পানির এক ঢোকও পান করাতেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": 4111,
			"text": "৪/৪১১১। মুসতাওরিদ ইবনে শাদ্দাদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাফেলার সাথে ছিলাম। তিনি রাস্তার পাশে ফেলে রাখা একটি বকরীর মৃত ছানার নিকট এসে দাঁড়ালেন। তিনি বলেনঃ তোমরা কি জানো, এই বকরির মৃত বাচ্চাটি তার মালিকের নিকট কতো তুচ্ছ? বলা হলো, হে আল্লাহর রাসূল! মূল্যহীন হওয়ার দরুনই তারা এটাকে ফেলে দিয়েছে। তিনি বলেনঃ সেই সত্তার শপথ, যাঁর হাতে আমার প্রাণ! এটা তার মালিকের নিকট যতোটা মূল্যহীন, দুনিয়াটা আল্লাহর কাছে তার চেয়েও অধিক মূল্যহীন ও তুচ্ছ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": 4112,
			"text": "৫/৪১১২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ দুনিয়া ও তার মধ্যকার সবই অভিশপ্ত, কিন্তু আল্লাহর যিকির এবং তার সাথে সংগতিপূর্ণ অনান্য আমল অথবা আলেম ও এলেম অন্বেষণকারী ব্যতীত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": 4113,
			"text": "৬/৪১১৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুনিয়া মুমিনের জেলখানা (কারাগার) এবং কাফেরের বেহেশতখানা (জান্নাত)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": 4114,
			"text": "৭/৪১১৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার দেহ স্পর্শ করে বলেনঃ হে আবদুল্লাহ! দুনিয়াতে এমনভাবে বসবাস করো যেন তুমি একজন প্রবাসী অথবা পথচারী মুসাফির। তুমি নিজেকে কবরবাসীদের অন্তর্ভুক্ত মনে করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": 4115,
			"text": "১/৪১১৫। মুআয ইবনে জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি তোমাকে জান্নাতের বাদশাহ্দের সম্পর্কে অবহিত করবো না। আমি বললাম, হাঁ। তিনি বলেনঃ দু’টি ছিন্নবস্ত্র পরিহিত দুর্বল ও অনাহারী ব্যক্তি যাকে ধর্তব্যে আনা হয় না। কিন্তুু সে কোন বিষয়ে আল্লাহর নামে শপথ করলে তিনি তা অবশ্যই পূর্ণ করেন (সে হবে জান্নাতের বাদশাহ্)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": 4116,
			"text": "২/৪১১৬। হারিসা ইবনে ওয়াহব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি তোমাদেরকে অবহিত করবো না যে, কারা জান্নাতী হবে? যারা দুর্বল এবং যাদেরকে দুর্বল মনে করা হয়। আমি কি তোমাদের অবহিত করবো না যে, কারা জাহান্নামী হবে? প্রত্যেক অবাধ্য, আহাম্মক ও দাম্ভিক ব্যক্তি জাহান্নামে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": 4117,
			"text": "৩/৪১১৭। আবূ উমামা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ লোকেদের মধ্যে সর্বাপেক্ষা ঈর্ষণীয় হলো সেই মুমিন ব্যক্তি যার অবস্থা খুবই হালকা (স্বল্প সম্পদ ও ক্ষুদ্র পরিবার) এবং যে নামাযে মনোযোগী, মানুষের মাঝে অখ্যাত, তার কোন গুরুত্ব দেয়া হয় না,আর নূন্যতম প্রয়োজন মাফিক তার রিযিক এবং তাতেই ধৈর্য ধারণকারী। অচিরেই তার মৃত্যু হয়, তার পরিত্যক্ত সম্পদও কম এবং তার জন্য বিলাপকারীর সংখ্যাও কম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": 4118,
			"text": "৪/৪১১৮। আবূ উমামা আল-হারিসী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অনাড়ম্বর জীবন যাপনই ঈমান। রাবী বলেন, ‘বাযাযাহ’-এর অর্থ কাশাফাহ অর্থাৎ বিলাস-বাসনা ত্যাগ করা, সাধামাটা জীবন নির্বাহ করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": 4119,
			"text": "৫/৪১১৯। আসমা বিনতে ইয়াযীদ (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ আমি কি তোমাদের মধ্যকার শ্রেষ্ঠ ব্যক্তিদের কথা জানিয়ে দিবো না? তারা বলেন, হাঁ, হে আল্লাহর রাসূল! তিনি বলেনঃ তোমাদের মধ্যে তারাই শ্রেষ্ঠ যাদের দেখলে মহান আল্লাহর স্মরণ হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": 4120,
			"text": "১/৪১২০। সাহল ইবনে সাদ আল-সাইদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট দিয়ে যাচ্ছিল। নবী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ তোমরা এ লোকটি সম্পর্কে কী বলো? সাহাবীগণ বলেন, তার সম্পর্কে আপনার অভিমত হবে যথার্থ। আমরা বলি, সে সুপারিশ করলে তা মঞ্জুর করা হয়। সে কথা বললে তা শোনা হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ থাকলেন। ইত্যবসরে আরেক ব্যক্তি সেখান দিয়ে অতিক্রম করলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ এই ব্যক্তি সম্পর্কে তোমরা কী বলো? সাহাবীগণ বলেন, আল্লাহর শপথ, হে আল্লাহর রাসূল! আমরা বলি যে, এ ব্যক্তি তো দীনহীন মুসলিমদের অন্তর্ভুক্ত। সে এতই যোগ্য যে, সে বিবাহের প্রস্তাব দিলে তা প্রত্যাখ্যান করা হয়, সুপারিশ করলে তা মঞ্জুর করা হয় না এবং কথা বললে তার কথায় কেউ কর্ণপাত করে না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রথমোক্ত শ্রেণীর লোকের দ্বারা পৃথিবী ভরে গেলেও শেষোক্ত ব্যক্তি তাদের চেয়ে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": 4121,
			"text": "২/৪১২১। ইমরান ইবনুল হুসাইন (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর যে মুমিন বান্দা দরিদ্র ও অধিক সন্তানের পিতা হওয়া সত্ত্বেও যাঞা করা থেকে বিরত থাকে, তিনি তাকে ভালোবাসেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": 4122,
			"text": "১/৪১২২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দরিদ্র মুমিনগণ ধনীদের তুলনায় অর্ধ দিন আগে জান্নাতে প্রবেশ করবে। আর অর্ধ দিনের পরিমাণ হবে পাঁচ শত বছর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": 4123,
			"text": "২/৪১২৩। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দরিদ্র মুহাজিরগণ তাদের বিত্তবানদের তুলনায় পাঁচ শত বছর আগে জান্নাতে প্রবেশ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": 4124,
			"text": "৩/৪১২৪। আবদুল্লাহ ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আল্লাহ তা‘আলা দরিদ্র মুহাজিরদের উপর তাদের ধনীদের যে মর্যাদা (সম্পদের প্রাচুর্য) দান করেছেন, তারা সে বিষয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আক্ষেপ প্রকাশ করেন। এতে তিনি বলেনঃ হে অভাবী সমাজ! আমি কি তোমাদেরকে এ সুসংবাদ দিবো না যে, দরিদ্র মুমিনগণ তাদের ধনীদের তুলনায় অর্ধ দিন অর্থাৎ পাঁচ শত বছর আগে জান্নাতে প্রবেশ করবে? অতঃপর মূসা ইবনে উবায়দা (রাঃ) এ আয়াত তিলাওয়াত করেন (অনুবাদ): ‘‘তোমার প্রতিপালকের একদিন তোমাদের গণনার হাজার বছরের সমান ’’ (সূরা হজ্জঃ ৪৭)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": 4125,
			"text": "১/৪১২৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, জাফর ইবনে আবূ তালিব (রাঃ) ফকীর-মিসকীনদের মহববত করতেন, তাদের সাথে ওঠাবসা করতেন এবং তাদের সাথে আলাপ-আলোচনা করতেন। আর তারাও তার সাথে আলাপ-আলোচনা করতো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আবুল মাসাকীন (দরিদ্রদের পিতা) উপাধি দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": 4126,
			"text": "২/৪১২৬। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, তোমরা মিসকীনদের মহববত করবে। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর দোয়ায় বলতে শুনেছিঃ ‘‘হে আল্লাহ! তুমি আমাকে মিসকীনরূপে জীবিত রাখো, মিসকীনরূপে মৃত্যুদান করো এবং মিসকীনদের দলভুক্ত করে হাশরের ময়দানে উত্থিত করো ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": 4127,
			"text": "৩/৪১২৭। খাববাব (রাঃ) থেকে বর্ণিত। মহান আল্লাহর বাণী (অনুবাদ): ‘‘যারা তাদের প্রতিপালককে সকালে ও সন্ধ্যায় তাঁর সন্তুষ্টি অর্জনের জন্য ডাকে তাদেরকে তুমি তাড়িয়ে দিও না। তাদের কাজের জবাবদিহির দায়িত্ব তোমার নয় এবং তোমার কোন কাজের জবাবদিহির দায়িত্বও তাদের নয় যে, তুমি তাদের বিতাড়িত করবে, করলে তুমি যালেমদের অন্তর্ভুক্ত হবে ’’ (সূরা আনআমঃ ৫২)। তিনি উক্ত আয়াত সম্পর্কে বলেন, আকরা ইবনে হাবেস আতম-তামীমী ও উয়াইনা ইবনে হিসন আল-ফাজারী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলো। তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সুহাইব, বিলাল, আম্মার ও খাববাব (রাঃ) প্রমুখ দরিদ্র অসহায় মুমিনদের সাথে বসা দেখলো। তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চারপাশে তাদের উপবিষ্ট দেখে তাদেরকে হেয় জ্ঞান করলো। তারা তাঁর সান্নিধ্যে এসে একান্তে তাঁকে বললো, আমরা চাই যে, আপনি আপনার সাথে আমাদের বিশেষ বৈঠকের ব্যবস্থা করবেন, যাতে আরবরা আমাদের মর্যাদা উপলব্ধি করতে পারে। কেননা আপনার নিকট আরবের প্রতিনিধিদলসমূহ আসে। এই দাসদের সাথে আরবরা আমাদেরকে উপবিষ্ট দেখলে তাতে আমরা লজ্জাবোধ করি। অতএব আমরা যখন আপনার নিকট আসবো তখন আপনি এদেরকে আপনার নিকট থেকে উঠিয়ে দিবেন। আমরা আপনার নিকট থেকে বিদায় নেয়ার পর আপনি ইচ্ছা করলে তাদের সাথে বসুন। তিনি বলেনঃ আচ্ছা! দেখা যাক। তারা বললো, আপনি আমাদের জন্য একটি চুক্তিপত্র লিখিয়ে দিন। রাবী বলেন, তিনি কাগজ আনালেন এবং আলী (রাঃ) কে লেখার জন্য ডাকলেন। আমরা এক পাশে বসা ছিলাম। ইত্যবসরে জিবরীল (আঃ) এই আয়াত নিয়ে অবতরণ করলেন (অনুবাদ) ‘‘যারা তাদের রবকে সকাল-সন্ধ্যায় ডাকে তার সন্তুষ্টি লাভের জন্য তাদের তুমি তাড়িয়ে দিও না। তাদের কাজের জবাবদিহির দায়িত্ব তোমার নয় এবং তোমার কাজের জবাবদিহির দায়িত্বও তাদের নয় যে, তুমি তাদের বিতাড়িত করবে। করলে তুমি যালেমদের অন্তর্ভুক্ত হবে ’’ (সূরা আনআমঃ ৫২)। অতঃপর আল্লাহ তা‘আলা আকরা ইবনে হাবেস ও উয়াইনা ইবনে হিসন-এর সম্পর্কে নাযিল করেন (অনুবাদঃ) ‘‘এভাবেই আমি তাদের এক দলকে অন্য দল দ্বারা পরীক্ষা করেছি, যেন তারা বলে, আমাদের মধ্যে কি এদের প্রতিই আল্লাহ অনুগ্রহ করলেন? আল্লাহ কি কৃতজ্ঞ লোকেদের সম্পর্কে বিশেষ অবহিত নন’’ (সূরা আনআমঃ ৫৩)? অতঃপর আল্লাহ বলেন, ‘‘যারা আমার আয়াতসমূহের প্রতি ঈমান আনে তারা যখন তোমার নিকট আসে, তখন তুমি তাদের বলোঃ তোমাদের প্রতি শান্তি বর্ষিত হোক। তোমাদের প্রতিপালক দয়া করা তাঁর কর্তব্য বলে স্থির করেছেন’’ (সূরা আনআমঃ ৫৪)। রাবী বলেন, এ আয়াত নাযিল হওয়ার পর আমরা তাঁর এতো নিকটবর্তী হলাম যে, আমাদের হাঁটু তাঁর হাঁটুর সাথে লাগিয়ে বসলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সাথে বসতেন এবং যখন উঠে যাওয়ার ইচ্ছা করতেন, তখন আমাদের ছেড়ে দাঁড়িয়ে যেতেন। তখন আল্লাহ তা‘আলা এ আয়াত নাযিল করেন (অনুবাদ) ‘‘তুমি নিজেকে ধৈর্য সহকারে রাখবে তাদের সংসর্গে যারা সকাল-সন্ধ্যায় তাদের প্রতিপালককে ডাকে তাঁর সন্তোষ লাভের আশায় এবং তুমি পার্থিব জীবনের শোভা কামনা করে তাদের থেকে তোমার দৃষ্টি ফিরিয়ে নিও না’’ (সূরা কাহ্ফঃ ২৮) আর তুমি অভিজাতদের সাথে বসো না এবং যার চিত্তকে আমি আমার স্মরণে অমনোযোগী করে দিয়েছি তার অনুসরণ করো না। যে নিজ প্রবৃত্তির অনুসরণ করে এবং কাজেকর্মে সীমা অতিক্রম করে (অর্থাৎ উয়াইনা ও আকরা) তার কৃতকর্ম বরবাদ হয়েছে। অতঃপর তিনি তাদের সামনে দু’ ব্যক্তির দৃষ্টান্ত ও পার্থিব জীবনের উপমা পেশ করেন (সূরা কাহফের ৩২ নং ও ৪৫ নং আয়াত দ্রঃ) খাব্বাব (রাঃ) বলেন, অতঃপর আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে বসতাম। যখন তাঁর উঠার সময় হতো তখন আমরা তাঁর আগে উঠে যেতাম, অতঃপর তিনি উঠতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": 4128,
			"text": "৪/৪১২৮। সাদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, এ আয়াত আমাদের ছ’জন সম্পর্কে নাযিল হয়েছেঃ আমি, ইবনে মাসউদ, সুহাইব, আম্মার, মিকদাদ ও বিলাল (রাঃ)। কুরাইশরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললো, আমরা এসব লোকের সাথে বসতে সম্মত নই। আপনি এদেরকে আপনার নিকট থেকে তাড়িয়ে দিন। রাবী বলেন, এ কথা শোনার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অন্তরে আল্লাহর মর্জি একটা ধারণার উদয় হলো। তখন মহান আল্লাহ এই আয়াত নাযিল করেন (অনুবাদ): ‘‘যারা তাদের রবকে সকাল-সন্ধ্যায় ডাকে তাঁর সন্তুষ্টি লাভের জন্য তাদের তুমি তাড়িয়ে দিও না। তাদের কাজের জবাবদিহির দায়িত্ব তোমার নয় এবং তোমার কাজের জবাবদিহির দায়িত্বও তাদের নয় যে, তুমি তাদের বিতাড়িত করবে, করলে তুমি যালেমদের অন্তর্ভুক্ত হবে’’ (সূরা আনআমঃ ৫২)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": 4129,
			"text": "১/৪১২৯। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রাচুর্যের মালিকদের জন্য ধ্বংস অনিবার্য, তবে যারা ডানে, বাঁয়ে, সামনে পেছনে (আল্লাহর পথে) নিজেদের সম্পদ ব্যয় করে তারা ব্যতীত।",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": 4130,
			"text": "২/৪১৩০। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সম্পদশালীরা কিয়ামতের দিন সর্বনিম্ন স্তরে উপনীত হবে। কিন্তু যারা নিজেদের মাল এদিক সেদিক (আল্লাহর পথে) খরচ করে এবং পবিত্র পন্থায় তা উপার্জন করে তারা এর ব্যতিক্রম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": 4131,
			"text": "৩/৪১৩১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিপুল প্রাচুর্যের মালিকরা হলো নীচু স্তরের লোক। তবে যারা বলেছে, এই দিকে ও এই দিকে বিলিয়ে দাও তারা ব্যতীত। তিনি কথাটি তিনবার বলেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": 4132,
			"text": "৪/৪১৩২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি পছন্দ করি না যে, উহুদ পর্বত পরিমাণ স্বর্ণ আমার অধিকারে থাক এবং তৃতীয় দিনেও তার কিছু আমার নিকট অবশিষ্ট থাক, তবে ঋণ পরিশোধের পরিমাণ ছাড়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": 4133,
			"text": "৫/৪১৩৩। আমর ইবনে গাইলান আস-সাকাফী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আল্লাহ! যে ব্যক্তি আমার উপর ঈমান এনেছে, আমার সত্যতা স্বীকার করেছে এবং আমি যা নিয়ে এসেছি তা আপনার পক্ষ থেকে আগত সত্য বলে জ্ঞান করেছে, আপনি তার ধনবল ও জনবল হ্রাস করে দিন, আপনার সাক্ষাত তার জন্য প্রিয় বানিয়ে দিন এবং তার মৃত্যু ত্বরান্বিত করুন। আর যে ব্যক্তি আমার উপর ঈমান আনেনি, আমাকে সত্য বলে মেনে নেয়নি এবং আমি যা নিয়ে এসেছি তা আপনার পক্ষ থেকে আগত সত্য বলে জ্ঞান করেনি,আপনি তার ধনবল ও জনবল বৃদ্ধি করুন এবং তার আয়ুষ্কাল বর্দ্ধিত করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": 4134,
			"text": "৬/৪১৩৪। নুকাদা আল-আসাদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এক ব্যক্তির নিকট থেকে একটি উষ্ট্রী ধার আনার জন্য পাঠান। কিন্তু সে তাঁকে ধার দিলো না। অতঃপর তিনি আমাকে আরেক ব্যক্তির নিকট পাঠান। সে তাঁর জন্য একটি উষ্ট্রী পাঠিয়ে দিলো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উষ্ট্রীটি দেখে বলেনঃ ‘‘হে আল্লাহ! তুমি এতে বরকত দাও এবং যে ব্যক্তি এটা পাঠিয়েছে তাকেও’’। নুকাদা (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললাম, যে ব্যক্তি এ উষ্ট্রী নিয়ে এসেছে তার জন্যও (দোয়া করুন)। তিনি বলেনঃ ‘‘যে ব্যক্তি এটা নিয়ে এসেছে তাকেও (বরকত দান করুন)’’। অতঃপর তিনি নির্দেশ দিলে উষ্ট্রীর দুধ দোহন করা হলো এবং তা পরিমাণে পর্যাপ্ত হলো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘‘হে আল্লাহ! অমুক ব্যক্তির ধন বৃদ্ধি করুন, যে প্রথম নিষেধকারী। আর যে ব্যক্তি উষ্ট্রীটি পাঠিয়েছে তাকে দৈনিক হারে রিযিক দিন ’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": 4135,
			"text": "৭/৪১৩৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দীনার ও দিরহামের দাসেরা ধ্বংস হোক, সুদৃশ্য চাদর ও কারুকার্যময় চাদরের দাসেরাও ধ্বংস হোক। তাকে দান করা হলে খুশী হয় এবং না দেয়া হলে (কৃত অঙ্গীকার) পূর্ণ করে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": 4136,
			"text": "৮/৪১৩৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দীনার, দিরহাম ও মূল্যবান চাদরের গোলামেরা ধ্বংস হোক। আল্লাহ এদেরকে অধোমুখে জাহান্নামে নিক্ষেপ করবেন। জাহান্নামের কাঁটার খোঁচা খেয়েও সে বের হতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": 4137,
			"text": "১/৪১৩৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পার্থিব সম্পদের প্রাচুর্য থাকলেই ঐশ্বর্যশালী হওয়া যায় না। মনের ঐশ্বর্যই প্রকৃত ঐশ্বর্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": 4138,
			"text": "২/৪১৩৮। আবদুল্লাহ ইবনে আমর ইবনুল আস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি ইসলামের দিকে হেদায়াতপ্রাপ্ত হয়েছে, যাকে প্রয়োজন মাফিক রিযিক দান করা হয়েছে এবং যে তাতেই পরিতুষ্ট থাকে, সে-ই সফলকাম হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": 4139,
			"text": "৩/৪১৩৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আল্লাহ! আপনি মুহাম্মাদের পরিবারের জন্য কেবল জীবন ধারণোপযোগী (পরিমাণ) রিযিকের ব্যবস্থা করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4140,
			"arabicnumber": 4140,
			"text": "৪/৪১৪০। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন ধনী-গরীব প্রত্যেকেই এই আকফঙ্ক্ষা ব্যক্ত করবে যে, তাদেরকে যদি পৃথিবীতে জীবন ধারণোপযোগী রিযিক দান করা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "৫/৪১৪১। সালামা ইবনে উবায়দুল্লাহ ইবনে মিহসান আল-আনসারী (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে যে ব্যক্তি সুস্থদেহে দিনাতিপাত করে, পরিবার-পরিজনসহ নিরাপদে সকালে উপনীত হয় এবং তার নিকট যদি সারা দিনের খোরাকী থাকে, তাহলে তার জন্য যেন গোটা দুনিয়াই একত্র করা হলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": 4142,
			"text": "৬/৪১৪২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা পার্থিব ব্যাপারে তোমাদের চেয়ে কম সমৃদ্ধশালী লোকেদের প্রতি দৃষ্টি দাও এবং তোমাদের চেয়ে অধিক সমৃদ্ধিশালী লোকেদের প্রতি তাকিও না। তাহলে তোমাদেরকে দেয়া আল্লাহর নিয়ামত তোমাদের নিকট তুচ্ছ মনে হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": 4143,
			"text": "৭/৪১৪৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নিশ্চয় আল্লাহ তোমাদের বাহ্যিক চেহারা ও বিত্ত-বৈভবের প্রতি লক্ষ্য করেন না, বরং তিনি তোমাদের কার্যকলাপ ও অন্তরের দিকে লক্ষ্য রাখেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": 4144,
			"text": "১/৪১৪৪। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর পরিবারবর্গ এক এক মাস এমনভাবে অতিবাহিত করতাম যে, আমাদের চুলায় আগুন জ্বালাতে পারতাম না। খেজুর ও পানিই হতো আমাদের জীবন ধারণের উপকরণ। ইবনে নুমাইরের বর্ণনায় ‘‘নালবাছু’’ শব্দ এসেছে ‘‘নামকুসু’’-এর পরিবর্তে (অর্থ একই)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": 4145,
			"text": "২/৪১৪৫। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরিজনবর্গের কোন কোন মাস এমনভাবে অতিবাহিত হতে যে, তাদের কারো ঘরের চুলা থেকে ধোঁয়া বের হতে দেখা যেতো না। আমি (আবূ সালামা) জিজ্ঞাসা করলাম, তাদের আহার্য কী ছিলো? তিনি বলেন, দু’টি কালো জিনিসঃ খেজুর ও পানি। তবে আমাদের আনসারী প্রতিবেশীরা ছিলেন অত্যন্ত সত্যপ্রিয়। তারা বকরী পালতেন এবং বকরীর দুধ উপঢৌকন স্বরূপ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর জন্য পাঠাতেন। রাবী মুহাম্মাদ ইবনে আমর (রাঃ) বলেন, তাঁর পরিবারবর্গ নয় ঘরে বিভক্ত ছিলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": 4146,
			"text": "৩/৪১৪৬। নোমান ইবনে বশীর (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি উমার ইবনুল খাত্তাব (রাঃ) কে বলতে শুনেছি, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দিনের বেলা ক্ষুধার তাড়নায় পার্শ্ব পরিবর্তন করতে দেখেছি। তিনি তাঁর উদর পূর্তির জন্য এমনকি রদ্দি খেজুরও পেতেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "৪/৪১৪৭। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ সেই সত্তার শপথ যাঁর হাতে মুহাম্মাদের প্রাণ! মুহাম্মাদের পরিবার-পরিজন এমন অবস্থায় ভোরে উপনীত হতো যে, তাদের নিকট এক সা‘ খাদ্যশস্য বা এক সা‘ খেজুরও থাকতো না। তখন তাঁর নয়জন স্ত্রী ছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": 4148,
			"text": "৫/৪১৪৮। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুহাম্মাদের পরিবারবর্গ এমন অবস্থায় সকালে উপনীত হতো যে, তাদের নিকট এক মুদ্দ পরিমাণ খাদ্যশস্যও থাকতো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4149,
			"arabicnumber": 4149,
			"text": "৬/৪১৪৯। সুলায়মান ইবনে সুরাদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট এলেন এবং তিন রাত আমাদের সঙ্গে অবস্থান করলেন। তখন আমরা তিন দিন যাবত খাদ্যের সংস্থান করতে পারিনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4150,
			"arabicnumber": 4150,
			"text": "৭/৪১৫০। অবু হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সামনে গরম টাটকা খাবার পেশ করা হলো। তিনি আহার করলেন এবং আহার শেষে বললেনঃ সমস্ত প্রশংসা আল্লাহর। এতো দিন পর্যন্ত আমার উদরে কখনো এরূপ টাটকা উপাদেয় খাদ্য প্রবেশ করেনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4151,
			"arabicnumber": 4151,
			"text": "১/৪১৫১। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বিছানা ছিল চামড়ার তৈরী। তার ভেতরে খেজুর গাছের ছাল ভর্তি ছিলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4152,
			"arabicnumber": 4152,
			"text": "২/৪১৫২। আলী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী ও ফাতিমা (রাঃ) -এর নিকট এলেন। তখন তারা তাদের একটি সাদা পশমী চাদরে আবৃত ছিলেন। তা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে বিবাহের উপঢৌকন স্বরূপ দিয়েছিলেন। তিনি আরও দিয়েছিলেন ইযখির ঘাস ভর্তি একটি বালিশ এবং পানির একটি মশক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4153,
			"arabicnumber": 4153,
			"text": "৩/৪১৫৩। উমার ইবনুল খাত্তাব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট প্রবেশ করলাম। তিনি তখন খেজুর পাতার চাটাইয়ের উপর শোয়া ছিলেন। আমি বসে পড়লাম। তাঁর পরিধানে ছিলো একটি লুঙ্গি। এ ছাড়া আর কোন বস্ত্র তাঁর পরিধানে ছিলো না। তাঁর পাঁজরে চাটাইয়ের দাগ বসে গিয়েছিলো। আমি দেখলাম যে, তাঁর ঘরের এক কোণে ছিলো প্রায় একসা গম, বাবলা গাছের কিছু পাতা এবং ঝুলন্ত একটি পানির মশক। এ অবস্থা দেখে আমার দু'চোখে অশ্রু প্রবাহিত হলো। তিনি জিজ্ঞেস করলেনঃ হে কাত্তাবের পুত্র! তুমি কাঁদছো কেন? আমি বললাম, হে আল্লাহর নবী! আমি কেন কাঁদবো না! এই চাটাই আপনার পাঁজরে দাগ কেটে দিয়েছে, আর এই হচ্ছে আপনার ধনভান্ডার, এতে যা আছে তা তো দেখতেই পাচ্ছি। এই কিসরা (পারস্যরাজ) ও কায়সার (রোম সম্রাট) বিরাট বিরাট উদ্যান ও ঝর্ণা সমৃদ্ধ অট্টালিকায় বিলাস-বসনে জীবন-যাপন করছে। আর আপনি হলেন আল্লাহর নবী এবং তাঁর মনোনীত প্রিয় বান্দা। আর আপনার ধনভান্ডারের অবস্থা এই। তিনি বলেনঃ হে খাত্তাবের পুত্র! তুমি কি এতে সন্তুষ্ট নও যে, আমাদের জন্য রয়েছে আখেরাতের স্থায়ী সুখ-শান্তি এবং ওদের জন্য রয়েছে পার্থিব ভোগবিলাস? আমি বললাম, হ্যাঁ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4154,
			"arabicnumber": 4154,
			"text": "৪/৪১৫৪। আলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যাকে যেদিন আমার ঘরে তুলে আনা হলো সেদিন রাতে আমাদের বিছানা ছিলো ছাগলের চামড়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4155,
			"arabicnumber": 4155,
			"text": "১/৪১৫৫। আবূ মাসউদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে দান-খয়রাত করার নির্দেশ দিতেন। তাই আমাদের কেউ শ্রমিকের কাজ করতে যেতেন এবং এক মুদ্দ উপার্জন করে নিয়ে আসতেন (অতঃপর তা থেকে দান-খয়রাত করতেন)। আর আজকের দিনে তাদের কেউ কেউ লাখো দিরহামের মালিক। শাকীক (রাঃ) বলেন, তিনি উক্ত কথা দ্বারা নিজের প্রতি ইঙ্গিত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4156,
			"arabicnumber": 4156,
			"text": "২/৪১৫৬। খালিদ ইবনে উমাইর (রাঃ) বলেন, উতবা ইবনে গায্ওয়ান (রাঃ) মিম্বারে দাঁড়িয়ে আমাদের উদ্দেশে ভাষণ দিলেন। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে সাতজনের মধ্যে সপ্তমজন ছিলাম। গাছের পাতা ছাড়া আমাদের আহারের জন্য আমাদের সাথে আর কিছু ছিলো না। শেষে আমাদের মাড়ির ছাল উঠে গিয়েছিলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4157,
			"arabicnumber": 4157,
			"text": "৩/৪১৫৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তারা সাতজন চরম অনাহারের শিকার হলেন। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যেক ব্যক্তিকে একটি করে খেজুর দেয়ার জন্য আমাকে মোট সাতটি খেজুর দিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4158,
			"arabicnumber": 4158,
			"text": "৪/৪১৫৮। আবদুল্লাহ ইবনুয যুবাইর ইবনুল আওয়াম (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, যখন ‘‘এরপর অবশ্যই সেদিন তোমাদেরকে নিয়ামত সম্পর্কে জিজ্ঞাসাবাদ করা হবে’’ (সূরা তাকাসুরঃ ৮) শীর্ষক আয়াত নাযিল হলো, তখন যুবাইর (রাঃ) বলেন, আমাদের নিকট এমন কী নিআমত আছে যে সম্পর্কে আমাদেরকে জিজ্ঞাসাবাদ করা হবে? আমাদের নিকট শুধুমাত্র দু’টি কালো জিনিস অর্থাৎ খেজুর ও পানি আছে। তিনি বলেনঃ তা অচিরেই (তোমাদের হস্তগত ) হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4159,
			"arabicnumber": 4159,
			"text": "৫/৪১৫৯। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের তিন শত লোককে (এক সামরিক অভিযানে) পাঠান। আমরা আমাদের রসদপত্র নিজ নিজ কাঁধে বহন করেছিলাম। আমাদের খাদ্য প্রায় ফুরিয়ে এলো। আমাদের মাথাপিছু একটি করে খেজুর থাকলো। জিজ্ঞেস করা হলো, হে আবূ আবদুল্লাহ! একটি মাত্র খেজুরে একজন লোকের কী হতো? তিনি বলেন, যখন মাথাপিছু একটি করে খেজুরও শেষ হয়ে গেলো, তখন আমরা এর কদর বুঝেত পারলাম। আমরা সমুদ্রতীরে উপনীত হয়ে তথায় একটি বিরাটকায় মাছ দেখতে পেলাম, যেটিকে সমুদ্র তরঙ্গ তীরে নিক্ষেপ করেছিল। আমরা আঠারো দিন ধরে সেই মাছটি আহার করলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4160,
			"arabicnumber": 4160,
			"text": "১/৪১৬০। আবুদল্লাহ ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট দিয়ে যাচ্ছিলেন। তখন আমরা আমাদের একটি কুঁড়েঘর মেরামত করছিলাম। তিনি বলেনঃ এটা কী? আমি বললাম, আমাদের কুঁড়েঘর। সেটি আমরা মেরামত করছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি তো দেখছি মৃত্যু তার চেয়েও দ্রুত এসে যাচ্ছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4161,
			"arabicnumber": 4161,
			"text": "২/৪১৬১। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারীর গোলাকার ঘরের নিকট দিয়ে যাচ্ছিলেন। তিনি জিজ্ঞাসা করলেনঃ এটা কী? তারা বলেন, এটা অমুকের তৈরী একটি গোলাকার ঘর। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এরূপ যে কোন সম্পদ কিয়ামতের দিন তার মালিকের জন্য বিপদের কারণ হবে। এ কথা আনসারীর নিকট পৌঁছলে তিনি ঘরখানি ভেঙ্গে ফেলেন। পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই পথে যেতে ঘরটি না দেখতে পেয়ে এ সম্পর্কে জিজ্ঞেস করেন। তাঁকে জানানো হলো, আপনার কথা তার কানে পৌঁছার পর সে তা ভেঙ্গে ফেলেছে। তিনি বলেনঃ আল্লাহ তার প্রতি দয়া করুন, আল্লাহ তার প্রতি দয়া করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4162,
			"arabicnumber": 4162,
			"text": "৩/৪১৬২। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নিজেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে (স্বপ্নে) দেখতে পেলাম যে, আমি রোদ-বৃষ্টি থেকে আশ্রয়ের জন্য একটি ঘর নির্মাণ করেছি। কিন্তু মহান আল্লাহর সৃষ্টির কেউ আমাকে সহযোগিত করেনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4163,
			"arabicnumber": 4163,
			"text": "৪/৪১৬৩। হারিসা ইবনে মুদাররিব (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা অসুস্থ খাববাব (রাঃ) কে দেখতে এলাম। তখন তিনি বলেন, আমার অসুস্থাবস্থা দীর্ঘায়িত হচ্ছে। যদি আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে না শুনতামঃ ‘‘তোমরা মৃত্যুর আকাংখা করো না’’, তাহলে অবশ্যই আমি মৃত্যু কামনা করতাম। তিনি বলেছেনঃ নিশ্চয় বান্দা তার প্রতিটি ব্যয়ের জন্য প্রতিদান পাবে, মাটিতে ব্যয় করার বা ইমারত নির্মাণ ব্যয় ব্যতীত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4164,
			"arabicnumber": 4164,
			"text": "১/৪১৬৪। উমার (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যদি তোমরা যথার্থই আল্লাহর উপর ভরসা করতে, তাহলে তিনি অবশ্যই তোমাদেরকে পাখির মত রিযিক দান করতেন। ভোরবেলা পাখিরা খালিপেটে (বাসা থেকে) বের হয়ে যায় এবং সন্ধ্যাবেলা উদর পূর্তি করে (বাসায়) ফিরে আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4165,
			"arabicnumber": 4165,
			"text": "২/৪১৬৫। খালিদের পুত্রদ্বয় হাববা ও সাওয়া (রাঃ) থেকে বর্ণিত। তারা বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট প্রবেশ করলাম। তখন তিনি কিছু মেরামত করছিলেন। আমরা তাঁকে তাতে সহায়তা করলাম। তিনি বলেনঃ যতক্ষণ তোমাদের মাথা সুস্থ থাকবে (তোমরা জীবিত থাকবে), তোমরা রিযিকের ব্যাপারে নিরাশ হয়ো না। মানুষকে তো তার মা রক্তাপ্লুত ও ক্ষীণ চামড়াযু্ক্ত অবস্থায় প্রসব করে, সেই অবস্থায়ও মহান আল্লাহ তাকে রিযিক দান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4166,
			"arabicnumber": 4166,
			"text": "৩/৪১৬৬। আমর ইবনুল আস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আদম সন্তানের অন্তরের প্রতিটি ময়দানে অনেক পথ রয়েছে। যে ব্যক্তি তার অন্তরের প্রতিটি ময়দানের সকল পথ অনুসরণ করে, আল্লাহ তাকে যে কোন ময়দানে ধ্বংস করতে পরোয়া করেন না। আর যে ব্যক্তি আল্লাহর উপর ভরসা করে, সে সর্বপ্রকার পথ থেকে মুক্তি পায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4167,
			"arabicnumber": 4167,
			"text": "৪/৪১৬৭। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ তোমাদের কেউ যেন অবশ্যই আল্লাহর প্রতি সুধারণা পোষণ করা ব্যতিরেকে মারা না যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4168,
			"arabicnumber": 4168,
			"text": "৫/৪১৬৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ শক্তিমান মুমিন ব্যক্তি দুর্বল মুমিন ব্যক্তির তুলনায় উত্তম এবং আল্লাহর কাছে অধিক প্রিয়। অবশ্য উভয়ের মধ্যে কল্যাণ আছে। তোমাদের জন্য উপকারী প্রতিটি উত্তম কাজের প্রতি আগ্রহী হও এবং অলস বা গাফিল হয়ো না। কোন কাজ তোমাকে পরাভূত করলে তুমি বলো, আল্লাহ নির্দ্ধারণ করেছেন এবং নিজ মর্জি মাফিক করে রেখেছেন। ‘‘যদি’’ শব্দ সম্পর্কে সাবধান থাকো। কেননা ‘‘যদি’’ শয়তানের কর্মের পথ উন্মুক্ত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4169,
			"arabicnumber": 4169,
			"text": "১/৪১৬৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রাজ্ঞাপূর্ণ কথা মুমিনের হারানো ধন। সুতরাং সে যেখানেই তা পাবে, সে-ই হবে তার অধিকারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4170,
			"arabicnumber": 4170,
			"text": "২/৪১৭০। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এমন দু‘টি নিয়ামত আছে যে ব্যাপারে অধিকাংশ লোক ধোঁকায় পতিতঃ সুস্বাস্থ্য ও সুসময় বা অবসর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4171,
			"arabicnumber": 4171,
			"text": "৩/৪১৭১। আবূ আইউব (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো, হে আল্লাহর রাসূল! আমাকে সংক্ষেপে শিখিয়ে দিন। তিনি বলেনঃ যখন তুমি তোমার নামাযে দাঁড়াবে, তখন এমনভাবে নামায পড়ো, যেন এটাই তোমার শেষ নামায। তুমি এমন কথা বলো না, যার জন্য তোমাকে কৈফিয়ত দিতে হবে। আর মানুষের হাতে যা আছে তা থেকে নিরাশ হয়ে যাওয়ার ব্যাপারে দৃঢ় প্রতিজ্ঞ হও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4172,
			"arabicnumber": 4172,
			"text": "৪/৪১৭২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি মজলিসে বসে প্রজ্ঞাপূর্ণ কথাগুলো গোপন রাখলো, সে এমন এক ব্যক্তির সাথে তুলনীয় যে কোন রাখালের নিকট গিয়ে বললো, হে রাখাল! তোমার পাল থেকে আমাকে একটি বকরী দাও। রাখাল বললো, তুমি যাও এবং তোমার পছন্দমত পালের মধ্যকার উত্তম বকরীটি নাও। কিন্তু সে গিয়ে বকরীর পালের (পাহারারত) কুকুরের কান ধরে নিয়ে এলো। ৫/৪১৭২(১) আবূ হাসান ইবনে সালামা-ইসমাঈল ইবনে ইবরাহীম-মূসা-হাম্মাদ (রাঃ) সূত্রে সামান্য শাব্দিক পার্থক্যসহ পূর্বোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4173,
			"arabicnumber": 4173,
			"text": "১/৪১৭৩। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার অন্তরে সরিষার দানা পরিমাণও (সামান্যতম) অহংকার আছে, সে জান্নাতে প্রবেশ করতে পারবে না। আর যার অন্তরে সরিষার দানা পরিমাণও ঈমান আছে, সে জাহান্নামে প্রবেশ করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4174,
			"arabicnumber": 4174,
			"text": "২/৪১৭৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহান আল্লাহ বলেন, অহংকার আমার চাদর, মহানত্ব আমার লুঙ্গি। কেউ এ দু’টির কোন একটি নিয়ে আমার সাথে বিবাদ করলে, আমি তাকে জাহান্নামে নিক্ষেপ করবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4175,
			"arabicnumber": 4175,
			"text": "৩/৪১৭৫। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহান আল্লাহ বলেন, অহংকার আমার চাদর, মহানত্ব আমার লুঙ্গি। কেউ এ দু’টির কোন একটি নিয়ে আমার সাথে বিবাদ করলে, আমি তাকে জাহান্নামে নিক্ষেপ করবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4176,
			"arabicnumber": 4176,
			"text": "৪/৪১৭৬। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি মহান আল্লাহর সস্ত্তষ্টি লাভের উদ্দেশ্যে এক স্তর বিনয়ী হবে, আল্লাহ তার মর্যাদা এক স্তর উঁচু করবেন। আর যে ব্যক্তি আল্লাহর বিরুদ্ধে এক স্তর অহংকার করবে, আল্লাহ তার মর্যাদা এক স্তর নীচু করে দিবেন। শেষ পর্যন্ত তিনি তাকে হীনতাগ্রস্তদের মধ্যে হীনতমে পরিণত করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4177,
			"arabicnumber": 4177,
			"text": "৫/৪১৭৭। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, মদীনার কোন দাসী নিজ প্রয়োজনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাত ধরে তাঁকে নিজ ইচ্ছামত মদীনার কোন স্থানে নিয়ে যেতে চাইলে তিনি তার হাত থেকে নিজের হাত ছাড়িয়ে নিতেন না (তার সাথে যেতেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4178,
			"arabicnumber": 4178,
			"text": "৬/৪১৭৮। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রুগ্নকে দেখতে যেতেন, জানাযায় শরীক হতেন, ক্রীতদাসের দাওয়াত কবুল করতেন এবং গাধার পিঠে সওয়ার হতেন। তিনি বনূ কুরায়যা ও বনূ নাযীরে যুদ্ধের দিন একটি গাধার পিঠে আরোহিত ছিলেন। খায়বারের যুদ্ধের দিনও তিনি নাসারন্ধ্রে খেজুর গাছের বাকলের তৈরী লাগাম বাঁধা গাধায় সওয়ার ছিলেন। তার নিচে ছিল খেজুর গাছের বাকলের আঁশ দ্বারা তৈরী গদি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4179,
			"arabicnumber": 4179,
			"text": "৭/৪১৭৯। ইয়াদ ইবনু হিমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের উদ্দেশে ভাষণ দিলেন এবং বললেনঃ মহামহিম আল্লাহ আমার নিকট ওহী প্রেরণ করেন যে, তোমরা বিনয়ী হও, নম্রতা অবলন্বন করো, এমনকি একজন যেন অপরজনের উপর অহংকার প্রকাশ না করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4180,
			"arabicnumber": 4180,
			"text": "১/৪১৮০। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্দানশীল কুমারীর চেয়েও অধিক লজ্জাশীল ছিলেন। তিনি কোন জিনিস অপছন্দ করলে তা তাঁর চেহারায় প্রতিভাত হতো বা তাঁর চেহারা দেখেই বোঝা যেতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4181,
			"arabicnumber": 4181,
			"text": "২/৪১৮১। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিটি ধর্মেরই একটা স্বতন্ত্র বৈশিষ্ট্য আছে। আর ইসলামের স্বতন্ত্র বৈশিষ্ট্য হলো ‘লজ্জাশীলতা’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4182,
			"arabicnumber": 4182,
			"text": "৩/৪১৮২। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় প্রতিটি ধর্মের একটি স্বতন্ত্র বৈশিষ্ট্য আছে। ইসলামের স্বতন্ত্র বৈশিষ্ট্য হলো ‘লজ্জাশলীতা’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4183,
			"arabicnumber": 4183,
			"text": "৪/৪১৮৩। আবূ মাসউদ উকবা ইবনে আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানুষ পূর্ববর্তী নবীগণের বাণী থেকে যা পেয়েছে তার মধ্যে আছে, ‘‘তোমার লজ্জা-শরম না থাকলে যা ইচ্ছা তাই করতে পারো’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4184,
			"arabicnumber": 4184,
			"text": "৫/৪১৮৪। আবূ বাকরা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লজ্জাশীলতা ঈমানের অংগ। আর ঈমানের অবস্থান হলো জান্নাতে। আর অশ্লীলতা হলো অত্যাচার (জুলুম), আর অত্যাচার থাকবে জাহান্নামে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4185,
			"arabicnumber": 4185,
			"text": "৬/৪১৮৫। আনাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নির্লজ্জতা ও অশ্লীলতা কোন বস্ত্তর কেবল কদর্যতাই বৃদ্ধি করে এবং লজ্জা-শরম কোন জিনিসের সৌন্দর্যই বৃদ্ধি করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4186,
			"arabicnumber": 4186,
			"text": "১/৪১৮৬। মুআয ইবনে আনাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি নিজের ক্রোধকে কার্যে পরিণত করার ক্ষমতা রেখেও তা সংবরণ করে, আল্লাহ তাকে কিয়ামতের দিন সমগ্র সৃষ্টি সামনে ডেকে আনবেন এবং জান্নাতের যে কোন হূর নিজের ইচ্ছামত বেছে নেয়ার অধিকার দান করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4187,
			"arabicnumber": 4187,
			"text": "২/৪১৮৭। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বসা ছিলাম। তিনি বলেনঃ তোমাদের নিকট আবদুল কায়েস গোত্রের প্রতিনিধিদল এসেছে। কিন্তুু তখনও আমাদের সামনে কাউকে দেখা যাচ্ছিলো না। এ অবস্থায় আমাদের কিছুক্ষণ অতিবাহিত হলো। ইতোমধ্যে তারা এসে পৌঁছলো এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকট হাযির হলো, কেবল আশাজ্জ আল-আসারী তখনো পৌঁছেননি। পরে তিনি এসে পৌঁছে একটি স্থানে অবতরণ করে তার উষ্ট্রী বাঁধলেন, নিজের কাপড় একপাশে রাখলেন, অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট হাযির হলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ হে আশাজ্জ! তোমার মধ্যে এমন দু’টি উত্তম স্বভাব বিদ্যমান, যা আল্লাহ পছন্দ করেনঃ সহনশীলতা ও আত্মমর্যাদাবোধ। তিনি বলেন, হে আল্লাহর রাসূল! আমার মধ্যে তা কি প্রকৃতিগত না সৃষ্টিগত? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রকৃতিগত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4188,
			"arabicnumber": 4188,
			"text": "৩/৪১৮৮। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আশাজ্জ আল-আসারীকে বলেনঃ নিশ্চয় তোমার মধ্যে এমন দু’টি উত্তম স্বভাব বিদ্যমান, যা আল্লাহ পছন্দ করেনঃ সহনশীলতা ও লজ্জাশীলতা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4189,
			"arabicnumber": 4189,
			"text": "৪/৪১৮৯। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহর সন্তুুষ্টি অর্জনের জন্য বান্দার ক্রোধ সংবরণে যে মহান প্রতিদান রয়েছে তা অন্য কিছু সংবরণে নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4190,
			"arabicnumber": 4190,
			"text": "১/৪১৯০। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় আমি দেখি যা তোমরা দেখো না এবং আমি শুনি যা তোমরা শোনো না। আসমান চড়চড় করছে এবং চড়চড় করাই তার কর্তব্য। তাতে চার আঙ্গুল পরিমাণ জায়গাও খালি নাই, যেখানে একজন না একজন ফেরেশতা আল্লাহর জন্য সিজদায় তার কপাল লুটিয়ে দেননি। আল্লাহর শপথ! আমি যা জানি, তোমরা তা জানতে পারলে খুব কমই হাসতে, বরং অধিক কাঁদতে, বিছানায় স্ত্রীদের সম্ভোগ করতে না এবং চীৎকার করে আল্লাহর কাছে দোয়া করতে করতে পথে-প্রান্তরে বেরিয়ে পড়তে। আল্লাহর শপথ! আহা, আমি যদি একটি গাছ হতাম এবং তা কেটে ফেলা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4191,
			"arabicnumber": 4191,
			"text": "২/৪১৯১। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি যা জানি, তা যদি তোমরা জানতে, তাহলে খুব কমই হাসতে এবং প্রচুর কাঁদতে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4192,
			"arabicnumber": 4192,
			"text": "৩/৪১৯২। আবূ হাযেম (রাঃ) থেকে বর্ণিত। আমের ইবনে আবদুল্লাহ ইবনুয যুবাইর (রাঃ) তাকে অবহিত করেন যে, তার পিতা তাকে অবহিত করেছেন যে, তাদের ইসলাম গ্রহণ এবং তাদেরকে তিরস্কার করে নিম্নোক্ত আয়াত নাযিলের মধ্যে চার বছরের ব্যবধান ছিলো। (অনুবাদঃ) ‘‘এরা যেন তাদের মতো না হয়, যাদেরকে পূর্বে কিতাব দেয়া হয়েছিল। অতঃপর তাদের উপর দীর্ঘ কাল অতিবাহিত হওয়ায় তাদের অন্তঃকরণ কঠিন হয়ে গিয়েছিল। তাদের অধিকাশই সত্যত্যাগী’’ (সূরা হাদীদঃ ১৬)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4193,
			"arabicnumber": 4193,
			"text": "৪/৪১৯৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা অধিক হাসবে না। কারণ অধিক হাসি অন্তরের মৃত্যু ঘটায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4194,
			"arabicnumber": 4194,
			"text": "৫/৪১৯৪। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেনঃ আমাকে কুরআন পড়ে শুনাও। আমি তাঁকে সূরা নিসা পড়ে শুনালাম। আমি যখন এ আয়াত পর্যন্ত পৌঁছলাম (فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَٰؤُلَاءِ شَهِيدًا) (অনুবাদ) ‘‘যখন আমি প্রত্যেক উম্মাত থেকে একজন সাক্ষী উপস্থিত করবো এবং তোমাকে তাদের বিরুদ্ধে সাক্ষীরূপে উপস্থিত করবো, তখন কী অবস্থা হবে’’ (সূরা নিসাঃ ৪১), তখন আমি তাঁর দিকে তাকিয়ে দেখলাম যে, তাঁর দু'চোখ বেয়ে পানি পড়ছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4195,
			"arabicnumber": 4195,
			"text": "৬/৪১৯৫। বারাআ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে এক জানাযায় উপস্থিত ছিলাম। তিনি কবরের কিনারে বসে কাঁদলেন, এমনকি তাঁর চোখের পানিতে মাটি ভিজে গেলো। অতঃপর তিনি বলেনঃ ‘‘হে ভাইসব! তোমাদের অবস্থাও তার মতই হবে, সুতরাং তোমরা প্রস্ত্তুতি গ্রহণ করো’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4196,
			"arabicnumber": 4196,
			"text": "৭/৪১৯৬। সা'দ ইবনে আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কান্নাকাটি করো, যদি কাঁদতে না পারো তবে কান্নার ভান করো বা কাঁদতে চেষ্টা করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4197,
			"arabicnumber": 4197,
			"text": "৮/৪১৯৭। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে মুমিন বান্দার দু‘চোখ থেকে আল্লাহর ভয়ে পানি বের হয়, যদিও তা মাছির মাথার পরিমাণ হয়, এবং তা কপাল বেয়ে পড়ে, তাতে আল্লাহ তার জন্য জাহান্নাম হারাম করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4198,
			"arabicnumber": 4198,
			"text": "১/৪১৯৮। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! (অনুবাদঃ) ‘‘এবং যারা তাদের প্রভুর নিকট প্রত্যাবর্তন করবে, এই বিশ্বাসে তাদের যা দান করার তা দান করে ভীত-কম্পিত হৃদয়ে’’ (সূরা মুমিনূনঃ ৬০), এর দ্বারা কি এমন ব্যক্তিকে বুঝানো হয়েছে, যে ব্যভিচার করে, চুরি করে এবং মদ্যপান করে? তিনি বলেনঃ না, হে আবূ বাকরের কন্যা, হে সিদ্দীকের কন্যা! বরং উক্ত আয়াতে এমন ব্যক্তিকে বুঝানো হয়েছে, যে রোযা রাখে, যাকাত দেয়, দান-খয়রাত করে, নামায পড়ে এবং আশংকা করে যে, তার এসব ইবাদত কবুল হলো কি না?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4199,
			"arabicnumber": 4199,
			"text": "২/৪১৯৯। মুআবিয়া ইবনে আবূ সুফিয়ান (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ আমল হলো পাত্রের মত। পাত্রের তলা অক্ষত থাকলে তার উপরিভাগও অক্ষত থাকে এবং তার তলা নষ্ট হয়ে গেলে তার উপরিভাগও নষ্ট হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4200,
			"arabicnumber": 4200,
			"text": "৩/৪২০০। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বান্দা প্রকাশ্যে ও গোপনে উত্তমরূপে নামায পড়লে মহান আল্লাহ বলেন, সে-ই আমার প্রকৃত বা যথার্থ বান্দা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4201,
			"arabicnumber": 4201,
			"text": "৪/৪২০১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সব ব্যাপারে ভারসাম্যপূর্ণ পন্থা অবলম্বন করো এবং বাড়াবাড়ি ত্যাগ করো। কেননা তোমাদের মধ্যে এমন কেউ নেই যার আমল তাকে নাজাত দিতে পারবে। সাহাবীগণ বলেন, হে আল্লাহর রাসূল! আপনিও না? তিনি বলেনঃ আমিও না, তবে আল্লাহর রহমত ও করুণা যদি আমাকে ঢেকে নেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4202,
			"arabicnumber": 4202,
			"text": "১/৪২০২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মহামহিম আল্লাহ বলেন, আমি শরীকদের (মুশরিকদের) শিরক হতে মুক্ত। যে ব্যক্তি আমার জন্য কোন কাজ করলো এবং তাতে আমি ব্যতীত অন্য কিছুকে শরীক করলো, আমি তা থেকে সম্পুর্ণ মুক্ত। সে কাজ তার জন্য যাকে সে শরীক করেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4203,
			"arabicnumber": 4203,
			"text": "২/৪২০৩। আবূ সাদ ইবনে আবূ ফাদালা আল-আনসারী (রাঃ) থেকে বর্ণিত। তিনি সাহাবী ছিলেন। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা‘আলা যখন কিয়ামতের দিন, যে দিনের আগমনে কোন সন্দেহ নাই, পূর্বাপর সকলকে একত্র করবেন, তখন একজন ঘোষক ঘোষণা করবে, যে ব্যক্তি আল্লাহর সন্তুষ্টির জন্য কাজ করতে গিয়ে এর মধ্যে কাউকে শরীক করেছে, সে যেন গাইরুল্লাহর নিকট নিজের সওয়াব চেয়ে নেয়। কেননা আল্লাহ তা‘আলা শরীকদের শিরক থেকে সম্পূর্ণ মুক্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4204,
			"arabicnumber": 4204,
			"text": "৩/৪২০৪। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমাদের নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হয়ে আসলেন, আমরা তখন মসীহ দাজ্জাল সম্পর্কে আলোচনা করছিলাম। তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি কি তোমাদের এমন বিষয় অবহিত করবো না, যা আমার মতে তোমাদের জন্য মসীহ দাজ্জালের চেয়েও ভয়ংকর? রাবী বলেন, আমরা বললাম, হাঁ, অবশ্যই। তিনি বলেনঃ গুপ্ত শিরক। মানুষ নামায পড়তে দাঁড়ায় এবং লোকের দৃষ্টি আকর্ষণের জন্য সুন্দরভাবে নামায পড়ে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4205,
			"arabicnumber": 4205,
			"text": "৪/৪২০৫। শাদ্দাদ ইবনে আওস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি আমার উম্মাতের জন্য যেসব বিষয়ের ভয় করি তার মধ্যে অধিক আশংকাজনক হচেছ আল্লাহর সঙ্গে শিরক করা। অবশ্য আমি এ কথা বলছি না যে, তারা সূর্য, চন্দ্র বা প্রতিমার পূজা করবে, বরং আল্লাহ ব্যতীত অপরের সন্তুুষ্টির জন্য কাজ করা এবং গোপন পাপাচার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4206,
			"arabicnumber": 4206,
			"text": "৫/৪২০৬। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি সুনাম-সুখ্যাতি অন্বেষণের জন্য কাজ করবে, আল্লাহ তার কাজের দোষ-ত্রুটি প্রচার করে দিবেন। আর যে ব্যক্তি লোক দেখানোর জন্য কাজ করবে আল্লাহ তাকে সেটাই দেখাবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4207,
			"arabicnumber": 4207,
			"text": "৬/৪২০৭। জুনদুব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি লোক দেখানোর উদ্দেশ্যে আমল করবে, আল্লাহও তাকে সেটাই দেখাবেন এবং যে ব্যক্তি সুনাম-সুখ্যাতির অন্বেষণে আমল করবে, আল্লাহ তার আমল প্রচার করে দিবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4208,
			"arabicnumber": 4208,
			"text": "১/৪২০৮। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’ ব্যক্তি ছাড়া আর কারো ব্যাপারে ঈর্ষা করা বৈধ নয়। (এক) যাকে আল্লাহ সম্পদ দিয়েছেন এবং তাকে তা সৎকাজে ব্যয় করার মনোবলও দিয়েছেন। (দুই) যাকে আল্লাহ প্রজ্ঞা দান করেছেন এবং সে তদ্বারা (সঠিক) মীমাংসা করে এবং তা (লোককে) শিক্ষা দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4209,
			"arabicnumber": 4209,
			"text": "২/৪২০৯। সালেম (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’টি ক্ষেত্র ব্যতীত ঈর্ষা করা জায়েয নেই। (এক) যাকে আল্লাহ কুরআন দান করেছেন এবং সে দিন-রাত সর্বক্ষণ তার উপর কায়েম থাকে। (দুই) যাকে আল্লাহ ধন-সম্পদ দান করেছেন এবং সে তা দিন-রাত সর্বক্ষণ (আল্লাহর পথে) ব্যয় করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4210,
			"arabicnumber": 4210,
			"text": "৩/৪২১০। আনাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হিংসা বা পরশ্রীকাতরতা নেক আমলসমূহ খেয়ে ফেলে, যেমন আগুন জ্বালানী কাঠ খেয়ে ফেলে। দান-খায়রাত গুনাহসমূহ বিলীন করে দেয় (রাঃ) যেমন পানি আগুনকে বিলীন করে (নিভিয়ে) দেয়। নামায মুমিনের নূর (আলো) এবং রোযা জাহান্নাম থেকে আত্মরক্ষার ঢাল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4211,
			"arabicnumber": 4211,
			"text": "১/৪২১১। আবূ বাকরা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (ন্যায়পরায়ণ শাসকের বিরুদ্ধে) বিদ্রোহ এবং আত্মীয়তার বন্ধন ছিন্ন করার মত মারাত্মক আর কোন গুনাহ নাই, যার শাস্তি আল্লাহ ত্বরিতে দুনিয়াতে দেন এবং আখেরাতের জন্যও জমা রাখেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4212,
			"arabicnumber": 4212,
			"text": "২/৪২১২। উম্মুল মুমিনীন আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সৎকর্ম ও আত্মীয়তার সম্পর্ক বজায় রাখার সওয়াব দ্রুত পাওয়া যায় এবং দুরাচার ও আত্মীয়তার সম্পর্ক ছিন্ন করার শাস্তি দ্রুত কার্যকর হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4213,
			"arabicnumber": 4213,
			"text": "৩/৪২১৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তির মন্দ প্রমাণিত হওয়ার জন্য এতটুকু যথেষ্ট যে, সে তার অপর মুসলিম ভাইকে তুচ্ছজ্ঞান করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4214,
			"arabicnumber": 4214,
			"text": "৪/৪২১৪। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় আল্লাহ আমার নিকট ওহী পাঠিয়েছেন যে, তোমরা নম্রতা অবলম্বন করো, বিনয়ী হও এবং তোমাদের কেউ যেন কারো প্রতি সীমালংঘন না করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": 4215,
			"text": "১/৪২১৫। আতিয়্যা আস-সাদী (রাঃ) থেকে বর্ণিত। তিনি ছিলেন নবী (রাঃ) -এর সাহাবী। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বান্দা ক্ষতিকর কাজে লিপ্ত হওয়ার আশংকায় বৈধ অক্ষতিকর বিষয় ত্যাগ না করা পর্যন্ত মোত্তাকীদের পর্যায়ে উন্নীত হতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": 4216,
			"text": "২/৪২১৬। আবদুল্লাহ ইবনে আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলা হলো, কোন ব্যক্তি সর্বোত্তম? তিনি বলেনঃ প্রত্যেক বিশুদ্ধ অন্তরের অধিকারী সত্যভাষী ব্যক্তি। তারা বলেন, সত্যভাষীকে তো আমরা চিনি, কিন্তু বিশুদ্ধ অন্তরের ব্যক্তি কে? তিনি বলেনঃ সে হলো পূত-পবিত্র নিষ্কলুষ চরিত্রের মানুষ যার কোন গুনাহ নাই, নাই কোন দুশমনি, হিংসা-বিদ্বেষ, আত্মহমিকা ও কপটতা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": 4217,
			"text": "৩/৪২১৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আবূ হুরায়রা! তুমি আল্লাহভীরু হয়ে যাও, তাহলে লোকেদের মধ্যে শ্রেষ্ঠ ইবাদতকারী হতে পারবে। তুমি অল্পে তুষ্ট থাকো, তাহলে লোকেদের মধ্যে সর্বোত্তম কৃতজ্ঞ হতে পারবে। তুমি নিজের জন্য যা পছন্দ করো, অন্যদের জন্যও তাই পছন্দ করবে, তাহলে পূর্ণ মুমিন হতে পারবে। তোমার প্রতিবেশীর প্রতি সদাচারী ও দয়াপরবশ হও, তাহলে মুসলিম হতে পারবে। তোমার হাসি কমাও, কেননা অধিক হাসি অন্তরাত্মাকে ধ্বংস করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": 4218,
			"text": "৪/৪২১৮। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তদবীরের (বিচক্ষণতা, পরিণামদর্শিতা) তুল্য কোন জ্ঞান নেই, নিষিদ্ধ বিষয় থেকে বিরত থাকার তুল্য ধার্মিকতা নেই এবং সচ্চরিত্র তুল্য কোন আভিজাত্য নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": 4219,
			"text": "৫/৪২১৯। সামুরা ইবনে জুনদুব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আভিজাত্য হলো সম্পদ এবং মহত্ব ও মহানুভবতাই তাক্বওয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": 4220,
			"text": "৬/৪২২০। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি এমন একটি বাক্য বা আয়াত জানি, সকলেই যদি তা গ্রহণ করতো তবে অবশ্যই তাদের জন্য তা যথেষ্ট হতো। তারা বলেন, হে আল্লাহর রাসূল! তা কোন্ আয়াত? তিনি বলেন? তা হলো (অনুবাদ): ‘‘যে কেউ আল্লাহকে ভয় করলে তিনি তার জন্য নিস্কৃতির পথ করে দেন’’ (সূরা তালাকঃ ২)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": 4221,
			"text": "১/৪২২১। আবূ যুহাইর আস-সাকাফী (রাঃ) থেকে তার পিতার সুত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাবাওয়াহ বা বানাওয়াহ নামক স্থানে আমাদের উদ্দেশে ভাষণ দেন। রাবী বলেন, নাবাওয়াহ তায়েফের একটি স্থানের নাম। তিনি বলেনঃ অচিরেই তোমরা জান্নাতী লোকেদেরকে জাহান্নামীদের থেকে পৃথকভাবে চিনতে পারবে। তারা বলেন, হে আল্লাহর রাসূল! তা কিভাবে? তিনি বলেনঃ সুপ্রশংসা ও কুপ্রশংসা দ্বারা। তোমরা যে মৃতের প্রশংসা করবে সে জান্নাতী এবং যে মৃতের দুর্নাম করবে সে জাহান্নামী। তোমরা (পৃথিবীতে) পরস্পরের বিরুদ্ধে আল্লাহর সাক্ষী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": 4222,
			"text": "২/৪২২২। কুলসূম আল-খুযাঈ (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো, হে আল্লাহর রাসূল! আমি ভালো কাজ করলে কিভাবে জানতে পারবো যে, আমি ভালো কাজ করেছি এবং মন্দ কাজ করলেই বা কিভাবে বুঝবো যে,আমি মন্দ কাজ করেছি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন তোমার প্রতিবেশী বলে যে, তুমি ভালো কাজ করেছো, তবেই তুমি ভালো কাজ করেছো এবং যখন তারা বলে যে, তুমি মন্দ করেছো তবেই তুমি মন্দ কাজ করেছো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": 4223,
			"text": "৩/৪২২৩। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললো, আমি কিভাবে জানবো, যখন আমি ভালো কাজ করি এবং যখন আমি মন্দ কাজ করি? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন তুমি তোমার প্রতিবেশীদের বলতে শুনবে যে, তুমি ভালো কাজ করেছো, তবেই তুমি ভালো কাজ করেছো। আর যখন তুমি তোমার প্রতিবেশীদের বলতে শুনবে যে, তুমি মন্দ কাজ করেছো, তবেই তুমি মন্দ কাজ করেছো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": 4224,
			"text": "৪/৪২২৪। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ মানুষের উত্তম প্রশংসায় যার দু’ কান পূর্ণ করেছেন এবং সেও তা শুনতে পেয়েছে, এমন ব্যক্তিই জান্নাতের অধিবাসী। তিনি যার কান মানুষের দুর্নামে পূর্ণ করেছেন এবং সেও তা শুনতে পেয়েছে, এমন ব্যক্তিই জাহান্নামী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": 4225,
			"text": "৫/৪২২৫। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললাম, কোন ব্যক্তি কেবল আল্লার সন্তুুষ্টি লাভের আশায় কাজ করে এবং লোকজন তার সেই কাজের জন্য তাকে ভালোবাসে। তিনি বলেনঃ এটা তো ঈমানদার ব্যক্তির জন্য আগাম সুসংবাদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": 4226,
			"text": "৬/৪২২৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি বললো, হে আল্লাহর রাসূল! আমি কোন কাজ করি, তা লোকের গোচরীভূত হয়ে যায়, তাতে আমি আনন্দবোধ করি। তিনি বলেনঃ তোমার জন্য দ্বিগুণ সওয়াব। গোপনে করার সওয়াব এবং প্রকাশ হয়ে পড়ার সওয়াব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": 4227,
			"text": "১/৪২২৭। আলকামা ইবনে ওয়াক্কাস (রাঃ) থেকে বর্ণিত। উমার ইবনুল খাত্তাব (রাঃ) জনগণের উদ্দেশে প্রদত্ত ভাষণে বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ যাবতীয় কাজের ফল নিয়্যাতের উপর নির্ভরশীল। প্রত্যেক মানুষের জন্য তার নিয়্যাত (অভিপ্রায়) অনুযায়ী ফলাফল রয়েছে। অতএব যার হিজরত আল্লাহ ও তাঁর রাসূলের দিকে, তার হিজরত আল্লাহ ও তাঁর রাসূলের জন্যই গণ্য হয়। আর যার হিজরত পার্থিব স্বার্থ লাভের জন্য, সে তাই লাভ করবে অথবা তার হিজরত কোন নারীকে বিবাহ করার উদ্দেশ্যে হলে সে যে উদ্দেশ্যে হিজরত করেছে তার হিজরত সেই উদ্দেশ্যের জন্য গণ্য হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": 4228,
			"text": "২/৪২২৮। আবূ কাবশা আল-আনমারী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ ﷺ বলেছেনঃ এ উম্মাতের দৃষ্টান্ত চার ব্যক্তি সদৃশ। (এক) এক ব্যক্তিকে আল্লাহ ধন-সম্পদ ও জ্ঞান দান করেছেন এবং সে তার জ্ঞান দ্বারা তার মাল ব্যবহার করে, যথার্থ খাতে তা ব্যয় করে। (দুই) এক ব্যক্তিকে আল্লাহ জ্ঞান দান করেছেন কিন্তু সম্পদ দান করেননি। সে বলে, ঐ ব্যক্তির অনুরূপ আমার সম্পদ থাকলে আমি তার মত তা কাজে লাগাতাম। রাসূলুল্লাহ ﷺ বলেনঃ এ দু’জন সমান পুরস্কার লাভের অধিকারী। (তিন) এক ব্যক্তিকে আল্লাহ সম্পদ দান করেছেন, কিন্তু জ্ঞান দান করেননি। সে তার মালে ভ্রষ্টনীতি গ্রহণ করে, তা অন্যায় পথে ব্যয় করে। (চার) এক ব্যক্তিকে আল্লাহ জ্ঞান ও সম্পদ কোনটাই দান করেননি। সে বলে, তার অনুরূপ আমার সম্পদ থাকলে আমি তার মত (ভ্রষ্ট) কাজে লাগাতাম। রাসূলুল্লাহ ﷺ বলেনঃ এই দু’ ব্যক্তি সমান অপরাধী।[1] ৩/৪২২৮(১)। ইসহাক ইবনে মানসূর-আবদুর রাযযাক-মামার (মুআম্মার)-মানসূর-সালেম ইবনে আবুল জাদ-ইবনে আবূ কাবশা-তার পিতা-নবী ﷺ, পুনরায় মুহাম্মাদ ইবনে ইসমাঈল ইবনে সামুরা-আবূ উসামা-মুফাদ্দাল-মানসূর-সালেম ইবনে আবূ জাদ-ইবনে আবূ কাবশা-তার পিতা-নবী রাসূলুল্লাহ ﷺ সূত্রে অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": 4229,
			"text": "৪/৪২২৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লোকেদের (হাশরের দিন) তাদের নিয়্যাত (অভিপ্রায়) অনুসারে উঠানো হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "৫/৪২৩০। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লোকজনকে তাদের নিয়াত (উদ্দেশ্য) অনুসারে হাশরের ময়দানে একত্র করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": 4231,
			"text": "১/৪২৩১। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বর্গাকৃতির চতুর্ভুজ আঁকলেন, এর মধ্যভাগে একটি সরল রেখা টানলেন, অতঃপর চতুর্ভুজের মধ্যবর্তী এ রেখার দু’ দিকে অনেকগুলো ক্ষুদ্র রেখা টানলেন, অতঃপর চতুর্ভুজের বহির্ভাগে একটি সরল রেখা টানলেন যা বর্গক্ষেত্রকে ছেদ করে অন্য প্রান্ত ভেদ করেছে। অতঃপর তিনি বলেনঃ তোমরা কি জানো, এটা কী? তারা বলেন, আল্লাহ ও তাঁর রাসূল অধিক জ্ঞাত। তিনি বলেনঃ এই মধ্যবর্তী রেখাটি হলো মানুষ। আর সরল রেখার দু’ দিকে যে ক্ষুদ্র ক্ষুদ্র রেখা আছে, এগুলো হলো বিপদাপদ, যা তাকে অহরহ দংশন করে। সে একটি বিপদ থেকে মুক্তি পেলে আরেকটি বিপদ তার উপর পতিত হয়। বর্গক্ষেত্রটি হলো তার জীবনকালের সীমা, যা তাকে বেষ্টন করে রেখেছে। আর (বর্গক্ষেত্র ভেদ করে) বাইরে আসা রেখাটি হলো তার কামনা-বাসনা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": 4232,
			"text": "২/৪২৩২। আনাস ইবনে মালেক (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এই হলো আদম সন্তান এবং এই হলো তার মৃত্যু, তার ঘাড়ের নিকট। তিনি তাঁর হাত তাঁর সামনের দিকে প্রসারিত করে বললেনঃ এই পর্যন্ত (হায়াতের চেয়েও বেশি) তার আকাঙ্ক্ষা বৃদ্ধি পেয়ে থাকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": 4233,
			"text": "৩/৪২৩৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’টি জিনিসের ভালোবাসায় বৃদ্ধের মন যুবকই থেকে যায়। বেঁচে থাকার লালসা ও সম্পদের প্রাচুর্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": 4234,
			"text": "৪/৪২৩৪। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আদম সন্তান বৃদ্ধ হয়ে গেলেও তার দু’টি স্বভাব যুবকই থেকে যায়ঃ সম্পদের লোভ ও বেঁচে থাকার লালসা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4235,
			"arabicnumber": 4235,
			"text": "৫/৪২৩৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আদম সন্তান দু’ উপত্যকা ভর্তি সম্পদের অধিকারী হলেও সে এর সাথে তৃতীয়টি পাওয়ার আকাঙ্ক্ষা করবে। মাটি ছাড়া অন্য কিছু তার দেহ ভর্তি করতে পারে না। কোন ব্যক্তি তওবা করলে আল্লাহ তার তওবা কবুল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": 4236,
			"text": "৬/৪২৩৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমার উম্মাতের (গড়) আয়ু ষাট থেকে সত্তর বছর। তাদের মধ্যে খুব কম সংখ্যকই এ বয়স অতিক্রম করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": 4237,
			"text": "১/৪২৩৭। উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, সেই মহান সত্তার শপথ, যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে নিয়ে গেছেন, তিনি ইন্তিকালের আগ পর্যন্ত অধিকাংশ সময় (নফল) নামায বসে পড়তেন। বান্দা যে নেক আমল নিয়মিত করে তার অল্প হলেও তাঁর নিকট পছন্দনীয় ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": 4238,
			"text": "২/৪২৩৮। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমার নিকট এক মহিলা উপস্থিত থাকা অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার ঘরে প্রবেশ করলেন। তিনি জিজ্ঞেস করলেনঃ এ মহিলা কে? আমি বললাম, অমুক মহিলা, সে রাতে ঘুমায় না। তিনি তার নামাযের কথা উল্লেখ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আরে থামো! তোমাদের সামর্থ্য অনুযায়ী আমল করা তোমাদের কর্তব্য। আল্লাহর শপথ! আল্লাহ (পুরস্কার প্রদানে) অবসন্ন হন না, যতক্ষণ না তোমরা অবসন্ন হয়ে পড়ো। আয়েশা (রাঃ) বলেন, কোন ব্যক্তির নিয়মিত আমলই তাঁর নিকট সর্বাধিক প্রিয় দীন ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": 4239,
			"text": "৩/৪২৩৯। হানযালা আল-কাতিব আত-তামীমী আল-উসায়্যিদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত ছিলাম। তিনি আমাদের জান্নাত-জাহান্নামের কথা স্মরণ করিয়ে দিয়ে এমনভাবে নসীহত করলেন, যেন আমরা তা চাক্ষুস দেখতে পাচ্ছি। তারপর আমি উঠে পরিবার ও সন্তানদের নিকট ফিরে আসি এবং আনন্দ স্ফুর্তি করি। রাবী বলেন, আমি আমাদের এ অবস্থার কথা স্মরণ করছিলাম, অতঃপর (ঘর থেকে) বের হয়ে গিয়ে আবূ বাকর সিদ্দীক (রাঃ) -এর সাথে সাক্ষাত করলাম এবং তাকে বললাম, আমি মোনাফেক হয়ে গেছি, মোনাফেক হয়ে গেছি। আবূ বাকর (রাঃ) বলেন, আমরাও তো তাই করি। অতঃপর হানযালা (রাঃ) গিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বিষয়টি উল্লেখ করলেন। তিনি বলেনঃ হে হানযালা! তোমরা আমার নিকট উপস্থিত থাকলে যেরূপ থাকো, সর্বদা তদ্রূপ থাকলে অবশ্যই ফেরেশতাগণ তোমাদের বিছানায় অথবা পথিমধ্যে তোমার সাথে মোসাফাহা করতো। হে হানযালা! সেই অবস্থা সময় সময় হয়ে থাকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "৪/৪২৪০। আবূ হুরায়রা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যথাসাধ্য আমল করো। কেননা সেই আমলই উত্তম যা নিয়মিত করা যায়, তা পরিমাণে কম হলেও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": 4241,
			"text": "৫/৪২৪১। জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক খন্ড পাথরের উপর নামাযরত এক ব্যক্তিকে অতিক্রম করে চলে গেলেন। তিনি মক্কার এক প্রান্তে পৌঁছে সেখানে কিছুক্ষণ কাটালেন। অতঃপর তিনি ফেরার পথে ঐ লোকটিকে পূর্বাবস্থায় নামাযরত দেখতে পেলেন। তিনি দাঁড়িয়ে গেলেন এবং তাঁর দু’ হাত একত্র করে বলেনঃ হে লোকসকল! তোমরা মধ্যপন্থা অবলম্বন করো। কথাটা তিনি তিনবার বলেন। কেননা তোমরা অবসাদগ্রস্ত না হওয়া পর্যন্ত আল্লাহ প্রতিদান দিতে ক্ষান্ত হন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": 4242,
			"text": "১/৪২৪২। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা বললাম, হে আল্লাহর রাসূল! আমরা জাহিলী যুগে যা করেছি, সে সম্পর্কে কি আমাদের জাবাবদিহি করতে হবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যারা ইসলাম গ্রহণের পর ভালো কাজ করেছে তাদেরকে জাহিলী যুগের কৃতকর্ম সম্পর্কে জবাবদিহি করতে হবে না। কিন্তুু যে ব্যক্তি মন্দ কাজ করবে, তাকে পূর্বাপর সকল কৃতকর্মের জন্য জবাবদিহি করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": 4243,
			"text": "২/৪২৪৩। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ হে আয়েশা! ক্ষুদ্র গুনাহ থেকেও সাবধান হও। কারণ সেগুলোর জন্যও আল্লাহর নিকট জবাবদিহি করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "৩/৪২৪৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মুমিন ব্যক্তি যখন গুনাহ করে তখন তার কলবে একটি কালো দাগ পড়ে। অতঃপর সে তওবা করলে, পাপকাজ ত্যাগ করলে এবং ক্ষমা প্রার্থনা করলে তার কলব পরিচ্ছন্ন হয়ে যায়। সে আরও গুনাহ করলে সেই কালো দাগ বেড়ে যায়। এই সেই মরিচা যা আল্লাহ তাঁর কিতাবে উল্লেখ করেছেন (অনুবাদঃ) ‘‘কক্ষনো নয়, বরং তাদের কৃতকর্মই তাদের অন্তরে জং (মরিচা) ধরিয়েছে’’ (সূরা আল-মুতাফফিফীনঃ ১৪)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": 4245,
			"text": "৪/৪২৪৫। সাওবান (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি আমার উম্মাতের কতক দল সম্পর্কে অবশ্যই জানি যারা কিয়ামতের দিন তিহামার শুভ্র পর্বতমালার সমতুল্য নেক আমলসহ উপস্থিত হবে। মহামহিম আল্লাহ সেগুলোকে বিক্ষিপ্ত ধূলিকণায় পরিণত করবেন। সাওবান (রাঃ) বলেন, হে আল্লাহর রাসূল! তাদের পরিচয় পরিষ্কারভাবে আমাদের নিকট বর্ণনা করুন, যাতে অজ্ঞাতসারে আমরা তাদের অন্তর্ভুক্ত না হই। তিনি বলেনঃ তারা তোমাদেরই ভ্রাতৃগোষ্ঠী এবং তোমাদের সম্প্রদায়ভুক্ত। তারা রাতের বেলা তোমাদের মতই ইবাদত করবে। কিন্তু তারা এমন লোক যে, একান্ত গোপনে আল্লাহর হারামকৃত বিষয়ে লিপ্ত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "৫/৪২৪৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করা হলো, কোন্ জিনিসের বদৌলতে বেশীর ভাগ লোক জান্নাতে প্রবেশ করবে। তিনি বলেনঃ তাক্বওয়া ও সচ্চরিত্রের বদৌলতে। তাকে আরো জিজ্ঞেস করা হলো, কোন্ জিনিসের কারণে অধিকাংশ লোক জাহান্নামে যাবে? তিনি বলেনঃ দু’টি অংগ- মুখ ও লজ্জাস্থান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": 4247,
			"text": "১/৪২৪৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তি তার হারানো উট প্রাপ্তিতে যতো আনন্দিত হয়, তোমাদের কারো তওবায় মহান আল্লাহ ততোধিক আনন্দিত হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": 4248,
			"text": "২/৪২৪৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা যদি পাপাচার করতে, এমনকি তোমাদের পাপ আকাশের সীমা পর্যন্ত পৌঁছে যেতো, অতঃপর তোমরা তওবা করতে, তাহলে আল্লাহ অবশ্যই তোমাদের তওবা কবুল করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"text": "৩/৪২৪৯। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বান্দা বিজন প্রান্তরে তার বাহনের উট হারিয়ে ফেললো, অতঃপর তার অনুসন্ধান করতে করতে শেষে নিরাশ ও অবসন্ন হয়ে তার কাপড় মুড়ি দিয়ে শুয়ে পড়লো। এ অবস্থায় হঠাৎ সে তার হারিয়ে যাওয়া বাহনের আওয়াজ শুনতে পেয়ে নিজের মুখমন্ডল থেকে তার কাপড় সরিয়ে তার উট তার সামনে উপস্থিত দেখতে পেয়ে যতো আনন্দিত হয়, আল্লাহ তাঁর বান্দার তওবায় ততোধিক আনন্দিত হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": 4250,
			"text": "৪/৪২৫০। আবূ উবায়দা ইবনে আবদুল্লাহ (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গুনাহ থেকে তওবাকারী নিষ্পাপ ব্যক্তিতুল্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "৫/৪২৫১। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক আদম সন্তানই গুনাহগার। আর গুনাহগারদের মধ্যে তওবাকারীগণ উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "৬/৪২৫২। ইবনে মা‘কিল (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি আমার পিতার সাথে আব্দুল্লাহ (রাঃ) -এর নিকট উপস্থিত হলাম। আমি তাকে বলতে শুনলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘অনুতপ্ত হওয়াই তওবা’’। আমার পিতা তাকে জিজ্ঞেস করেন, আপনি নিজে কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন যে, ‘‘অনুতপ্ত হওয়াই তওবা’’? তিনি বলেন, হাঁ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "৭/৪২৫৩। আবদুল্লাহ ইবনে ‘আমর (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ রূহ কণ্ঠাগত না হওয়া (মৃত্যুর পূর্ব মুহূর্ত) পর্যন্ত মহামহিম আল্লাহ বান্দার তওবা কবুল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4254,
			"arabicnumber": 4254,
			"text": "৮/৪২৫৪। ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো যে, সে এক বেগানা মহিলাকে চুমা দিয়েছে। সে এর কাফ্ফরা সম্পর্কে জিজ্ঞেস করতে থাকলো। কিন্তুু তিনি তাকে কোন উত্তর দিলেন না। তখন মহামহিম আল্লাহ এ আয়াত নাযিল করলেন (অনুবাদঃ) ‘‘দিনের দু’ প্রান্তভাগে এবং রাতের প্রথমাংশে নামায কায়েম করো। নিশ্চয় সৎকাজ অসৎ কাজকে দূরীভূত করে দেয়। যারা উপদেশ গ্রহণ করে, এটা তাদের জন্য উপদেশ’’ (সূরা হূদঃ ১১৪)। লোকটি বললোঃ হে আল্লাহর রাসূল! এ নির্দেশ কি কেবল আমার জন্য সীমিত? তিনি বলেনঃ আমার উম্মাতের যে কেউ এর উপর আমল করবে, তার জন্যই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": 4255,
			"text": "৯/৪২৫৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এক ব্যক্তি নিজের উপর যুলুম (পাপাচার) করলো। তার মৃত্যু উপস্থিত হলে সে তার পুত্রদের ওসিয়ত করে বললো, আমি মারা যাওয়ার পর তোমরা আমাকে আগুনে ভস্মীভূত করবে, অতঃপর ছাই পিষে চূর্ণ-বিচূর্ণ করবে, তারপর সমুদ্রে প্রবল বায়ুর মধ্যে সেগুলো নিক্ষেপ করবে। আল্লাহর শপথ! যদি আমার রব আমাকে পাকড়াও করতে পারেন তাহলে আমাকে এমন ভয়াবহ শাস্তি দিবেন যা অন্য কাউকে দেননি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তার পুত্ররা তার ওসিয়াত মত কাজ করলো। আল্লাহ তা‘আলা জমীনকে বলেন, তুমি তার দেহ থেকে যা গ্রহণ করেছো, তা ফেরত দাও। ফলে সে সোজা দাঁড়িয়ে গেল। আল্লাহ তাকে জিজ্ঞেস করলেন, এ কাজ করতে কিসে তোমাকে প্ররোচিত করেছে? সে বললো, হে প্রভু! আপনার ভয়। এজন্য আল্লাহ তাকে ক্ষমা করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": 4256,
			"text": "১০/৪২৫৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এক নারী একটি বিড়ালের কারণে জাহান্নামে গেছে। সে বিড়ালটিকে বেঁধে রেখেছিল, এমতাবস্থায় তাকে আহারও করায়নি এবং একে ছেড়েও দেয়নি, যাতে সে কীট-পতঙ্গ খেতে পারতো। ফলে সেটি অনাহারে মারা গেলো। যুহরী (রাঃ) বলেন, মানুষকে (নিজের আমলের উপর) ভরসা করাও উচিত নয় এবং (আল্লাহর রহমত থেকে) নিরাশ হওয়াও উচিত নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": 4257,
			"text": "১১/৪২৫৭। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রাচুর্যময় মহান আল্লাহ বলেন, হে আমার বান্দাগণ! আমি যাদের ক্ষমা করেছি তারা ব্যতীত তোমাদের সকলেই গুনাহগার। অতএব তোমরা আমার নিকট ক্ষমা প্রার্থনা করো, আমি তোমাদের ক্ষমা করবো। তোমাদের মধ্যে যে ব্যক্তি জানে যে, আমি ক্ষমা করার ক্ষমতা রাখি, অতঃপর সে আমার নিকট ক্ষমা প্রার্থনা করলে আমি তাকে ক্ষমা করে দেই। আমি যাদের হেদায়াত করেছি তারা ব্যতীত তোমরা সকলেই পথভ্রষ্ট। অতএব তোমরা আমার নিকট সৎপথ প্রার্থনা করো, আমি তোমাদের সৎপথ প্রদর্শন করবো। আমি যাদের ধনবান করেছি তারা ব্যতীত তোমরা সকলেই দরিদ্র। তোমরা আমার নিকট প্রার্থনা করো, আমি তোমাদের রিযিক দান করবো। তোমাদের জীবিত, মৃত, আগের ও পরের, সিক্ত ও শুষ্ক (সচ্ছল-অসচ্ছল) নির্বিশেষে সকলেই যদি আমার বান্দাদের মধ্যে সর্বাধিক তাক্বওয়ার অধিকারী ব্যক্তির হৃদয়ের মত হয়ে যায়, তাহলে একটি মশার পাখার সম-পরিমাণও আমার রাজত্বের শ্রীবৃদ্ধি ঘটবে না। পক্ষান্তরে তারা সকলে যদি একত্রে আমার বান্দাদের মধ্যে সবচেয়ে মারাত্মক পাপী বান্দার মত হয়ে যায়, তবুও তাতে একটি মশার পাখার সম-পরিমাণও আমার রাজত্বের সৌন্দর্যহানি ঘটবে না। তোমাদের জীবিত, মৃত, আগের ও পরের, সিক্ত ও শুষ্ক সকলে যদি একত্র হয়ে প্রত্যেকে তার পূর্ণ চাহিদামত আমার নিকট প্রার্থনা করে এবং আমি তাদের চাহিদামত সবকিছু দান করি, তবুও আমার রাজত্বের কিছুই কমবে না, তবে এতটুকু পরিমাণ যে, তোমাদের কেউ সমুদ্রের মধ্য দিয়ে অতিক্রমকালে তাতে একটি সুঁই ডুবিয়ে তা তুলে নিলে তাতে সমুদ্রের পানি যতটুকু হ্রাস পাবে। কারণ আমি হলাম দাতা, দয়ালু ও মহান। আমি যা চাই তাই করি। আমার দান হলো আমার কথা (এবং আমার আযাব হলো আমার নির্দেশ)। আমার ব্যাপার এই যে, আমি যখন কিছু ইচ্ছা করি তখন বলি, ‘‘হয়ে যাও’’, অমনি তা হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": 4258,
			"text": "১/৪২৫৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা অধিক পরিমাণে জীবনের স্বাদ হরণকারী অর্থাৎ মৃত্যুকে স্মরণ করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": 4259,
			"text": "২/৪২৫৯। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে ছিলাম। এমতাবস্থায় এক আনসারী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে তাকে সালাম দিলো। অতঃপর বললো, হে আল্লাহর রাসূল! মুমিনদের মধ্যে সর্বাপেক্ষা উত্তম কে? তিনি বলেনঃ স্বভাব-চরিত্রে তাদের মধ্যে যে ব্যক্তি অধিক উত্তম। সে পুনরায় জিজ্ঞেস কররো, মুমিনদের মধ্যে সর্বাপেক্ষা বুদ্ধিমান কে? তিনি বলেনঃ তাদের মধ্যে যারা মৃত্যুকে অধিক স্মরণ করে এবং মৃত্যু পরবর্তী জীবনের জন্য উত্তমরূপে প্রস্তুতি গ্রহণ করে, তারাই সর্বাধিক বুদ্ধিমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": 4260,
			"text": "৩/৪২৬০। আবূ ইয়ালা শাদ্দাদ ইবনে আওস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বুদ্ধিমান সেই ব্যক্তি যে নিজের নফসকে নিয়ন্ত্রণে রাখে এবং মৃত্যুর পরবর্তী জীবনের জন্য কাজ করে। আর নির্বোধ ও অকর্মন্য সেই ব্যক্তি যে তার নফসের দাবির অনুসরণ করে এবং আল্লাহর নিকট বৃথা আশা করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": 4261,
			"text": "৪/৪২৬১। আনাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মুমূর্ষু যুবকের নিকট উপস্থিত হয়ে জিজ্ঞেস করেনঃ তোমার কেমন লাগছে? সে বললো, হে আল্লাহর রাসূল! আমি আমার গুনাহ সম্পর্কে আল্লাহর কাছে (ক্ষমার) আশাবাদী ও ভীত-শংকিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এ দু’টি জিনিস (আশা ও শংকা) যে বান্দার অন্তরেই একত্র হয়, সে যা আশা করে, আল্লাহ তাকে তা দান করবেন এবং সে যা আশংকা করে তা থেকে তাকে নিরাপদ রাখবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": 4262,
			"text": "৫/৪২৬২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মৃত্যুর সময় মানুষের নিকট ফেরেশতা আগমন করেন। অতএব মুমূর্ষু ব্যক্তি উত্তম লোক হলে তারা বলেন, হে পবিত্র আত্মা! পবিত্র দেহ থেকে প্রশংসিত অবস্থায় বের হয়ে এসো এবং আল্লাহর রহমত ও সুঘ্রাণের সুসংবাদ গ্রহণ করো। তোমার রব তোমার প্রতি অসন্তুষ্ট নন। রূহ বের হয়ে আসা পর্যন্ত তারা এভাবে আহবান জানাতে থাকে। অতঃপর রূহ বের হয়ে আসলে তারা তা নিয়ে আসমানে আরোহণ করেন। এ রূহের জন্য আসমানের দরজা খুলে দেয়া হয়। জিজ্ঞেস করা হয়, সে কে? ফেরেশতাগণ বলেন, অমুক ব্যক্তি। তখন বলা হয়, পবিত্র আত্মাকে স্বাগতম, যা ছিল পবিত্র দেহে। প্রশংসিত অবস্থায় তুমি প্রবেশ করো, আল্লাহর রহমত ও সুঘ্রাণের সুসংবাদ গ্রহণ করো। তোমার রব তোমার প্রতি অসন্তুষ্ট নন। তাকে অবিরতভাবে এ সংবাদ প্রদান করা হয়, যাবত না তা মহামহিম আল্লাহ যে আসমানে অবস্থান করেন সেখানে পৌঁছে যায়। মুমূর্ষু ব্যক্তি পাপাচারী হলে ফেরেশতা বলেন, হে নিকৃষ্ট দেহের নিকৃষ্ট আত্মা! নিন্দিত অবস্থায় বের হয়ে আয় এবং উত্তপ্ত গরম পানি ও রক্ত-পুঁজের দুঃসংবাদ গ্রহণ কর এবং অনুরূপ বহু বিষাক্ত বস্ত্তর। রূহ বের হয়ে আসা পর্যন্ত তারা এভাবে আহবান জানাতে থাকেন। অতঃপর তারা রূহসহ উর্দ্ধাকাশে আরোহণ করেন। কিন্তু তার জন্য দরজা খোলা হয় না। জিজ্ঞেস করা হয়, এ ব্যক্তি কে? বলা হয়, অমুক। তখন বলা হয়, নিকৃষ্ট দেহের নিকৃষ্ট আত্মার জন্য নাই কোন সাদর সম্ভাষণ। তুই নিন্দিত অবস্থায় ফিরে যা। কারণ তোর জন্য আকাশের দ্বারসমূহ খোলা হবে না। অতঃপর একে আসমান থেকে ফিরিয়ে দেয়া হয় এবং তা কবরে ফিরে আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "৬/৪২৬৩। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন তোমাদের কারো মৃত্যু কোন এলাকায় নির্ধারিত হয়, তখন কোন প্রয়োজন তাকে সেখানে যেতে বাধ্য করে। সে যখন উক্ত এলাকায় নির্দিষ্ট স্থানে পৌঁছে যায় তখন মহান আল্লাহ তার জান কবয করেন। কিয়ামতের দিন জমীন বলবে, হে প্রভু! এই তোমার আমানত যা আমার নিকট গচ্ছিত রেখেছিলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "৭/৪২৬৪। আয়েশা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি আল্লাহর সাথে সাক্ষাত পছন্দ করে, আল্লাহও তার সাথে সাক্ষাত পছন্দ করেন। আর যে ব্যক্তি আল্লাহর সাথে সাক্ষাত অপছন্দ করে, আল্লাহও তার সাথে সাক্ষাত অপছন্দ করেন। বলা হলো, ইয়া রাসূলাল্লাহ! আল্লাহর সাথে সাক্ষাত অপছন্দ করা তো মৃত্যুকে অপছন্দ করা। অতএব আমাদের সকলেই তো মৃত্যুকে অপছন্দ করে। তিনি বলেনঃ তা নয়, এটা মৃত্যুর সময়ের ব্যাপার। যখন কোন বান্দাকে আল্লাহর রহমত ও ক্ষমার সুসংবাদ দেয়া হয়, তখন সে আল্লাহর সাক্ষাত লাভকে পছন্দ করে এবং আল্লাহও তার সাক্ষাত পছন্দ করেন। আর যখন কোন বান্দাকে কঠিন শাস্তির দুঃসংবাদ দেয়া হয়, তখন সে আল্লাহর সাক্ষাত অপছন্দ করে এবং আল্লাহও তার সাক্ষাত অপছন্দ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "৮/৪২৬৫। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন তার উপর পতিত বিপদাপদের কারণে মৃত্যু কামনা না করে। অবশ্যই কেউ যদি মৃত্যু কামনা করতেই চায়, তবে সে যেন বলে, ‘‘হে আল্লাহ! যাবৎ জীবিত থাকা আমার জন্য কল্যাণকর, তাবৎ আমাকে জীবিত রাখুন এবং যখন মৃত্যুই আমার জন্য কল্যাণকর হবে তখন আমাকে মৃত্যুদান করুন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "১/৪২৬৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একটি হাড় ব্যতীত গোটা মানবদেহ ক্ষয়প্রাপ্ত হবে। সেটি হলো পাছার হাড় এবং এই হাড় থেকেই কিয়ামতের দিন সৃষ্টির দৈহিক কাঠামো পুনর্গঠিত করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "২/৪২৬৭। উসমান (রাঃ) এর মুক্তদাস হানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, উষমান ইবনে আফফান (রাঃ) যখন কোন কবরের পাশে দাঁড়াতেন তখন এতো কাঁদতেন যে, তার দাড়ি ভিজে যেতো। তাকে বলা হলো, আপনি জান্নাত-জাহান্নামের কথা স্মরণ করেন তখন তো এভাবে কান্নাকাটি করেন না, অথচ কবর দেখলেই কাঁদেন! তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় কবর হলো আখেরাতের মনযিলসমূহের মধ্যকার সর্বপ্রথম মনযিল। কেউ যদি এখান থেকে রেহাই পায়, তবে তার জন্য পরবর্তী মনযিলগুলো কবরের চেয়েও সহজতর হবে। আর সে যদি এখান থেকে রেহাই না পায়, তবে তার জন্য পরবর্তী মনযিলগুলো আরো ভয়াবহ হবে। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কখনও এমন কোন দৃশ্য অবলোকন করিনি যার তুলনায় কবর অধিক ভয়ংকর নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "৩/৪২৬৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মৃত ব্যক্তির কবরে রাখা হলে এবং সে সৎকর্মপরায়ণ লোক হলে তাকে ভীতিশূন্য ও দুশ্চিন্তামুক্ত অবস্থায় তার কবরে বসানো হয়। অতঃপর তাকে জিজ্ঞেস করা হয়, তুমি কিসের অনুসারী ছিলে? সে বলবে, আমি ইসলামের অনুসারী ছিলাম। তাকে জিজ্ঞেস করা হবে, এই ব্যক্তি কে? সে বলবে, আল্লাহর রাসূল মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তিনি আল্লাহর পক্ষ থেকে সুস্পষ্ট দলীল-প্রমাণসহ আমাদের নিকট এসেছিলেন এবং আমরা তাকে সত্য নবী বলে স্বীকার করেছি। অতঃপর তাকে জিজ্ঞেস করা হবে, তুমি কি আল্লাহকে দেখেছিলে? সে বলবে, আল্লাহকে দেখা কারো পক্ষে সম্ভব নয়। অতঃপর তার জন্য জাহানণামের দিকে একটি সুড়ঙ্গ পথ খুলে দেয়া হবে। সে সেদিকে তাকিয়ে দেখতে পাবে যে, তার এক অংশ অপর অংশকে গ্রাস করছে। তাকে বলা হবে, দেখে নাও, যা থেকে আল্লাহ তোমাকে রক্ষা করেছেন। অতঃপর তার জন্য জান্নাতের দিকে একটি সুড়ঙ্গ পথ খুলে দেওয়া হবে। সে তথাকার পুষ্প উদ্যান ও অন্যান্য সবকিছু দেখতে পাবে। তাকে বলা হবে, এই হলো তোমার স্থায়ী বাসস্থান। তাকে আরো বলা হবে, তুমি ঈমানের উপর দৃঢ় প্রতিষ্ঠিত ছিলে, ইমানসহ মৃত্যুবরণ করেছো এবং ইনশাল্লাহ ঈমানসহ হাশরের ময়দানে উত্থিত হবে। পক্ষান্তরে দুষ্কর্মপরায়ণ লোককে ভীতিকর ও দুশ্চিন্তাগ্রস্ত অবস্থায় উঠিয়ে তার কবরে বসানো হবে। তাকে জিজ্ঞেস করা হবে, তুমি কিসের অনুসারী ছিলে? সে বলবে, আমি জানি না। তাকে জিজ্ঞেস করা হবে, এই ব্যক্তি কে? সে বলবে, আমি লোকজনকে একটা কথা বলতে শুনেছি, আমিও তাই বলেছি। অতঃপর তার জন্য জান্নাতের দিকে একটি সুড়ঙ্গ পথ খুলে দেয়া হবে। সে সেদিকে তাকিয়ে তথাকার পুষ্প উদ্যান ও অন্যান্য সবকিছু দেখতে পাবে। তাকে বলা হবে, দেখ যা থেকে আল্লাহ তোকে বঞ্চিত করেছেন। অতঃপর তার জন্য জাহানণামের দিকে একটি সুড়ঙ্গ পথ খুলে দেয়া হবে। সে সেদিকে তাকিয়ে দেখতে পাবে যে, জাহান্নামের এক অংশ অপর অংশকে গ্রাস করছে। অতঃপর তাকে বলা হবে, এটা হলো তোর স্থায়ী আবাসস্থল। তুই সংশয়ের উপর প্রতিষ্ঠিত ছিলি, সংশয়ী অবস্থায় মরেছিস এবং আল্লাহর মর্জি সংশয়ী অবস্থায় তোকে উঠানো হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "৪/৪২৬৯। বারাআ ইবনে আযিব (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘‘যারা শাশ্বত বাণীতে ঈমান এনেছে আল্লাহ তাদেরকে সুপ্রতিষ্ঠিত রাখবে’’ (সূরা ইবরাহীমঃ ২৭)। তিনি বলেন যে, এ আয়াত কবর আযাব সম্পর্কে নাযিল হয়েছে। কবরস্থ ব্যক্তিকে বলা হবে, তোমার রব কে? সে বলবে, আর রব আল্লাহ এবং আমার নবী মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। এই হচ্ছে আল্লাহর নিম্নোক্ত আয়াতের তাৎপর্য (অনুবাদ): ‘‘যারা শাশ্বত বাণীতে ঈমান এনেছে আল্লাহ তাদের পার্থিব জীবনে এবং আখেরাতে সুপ্রতিষ্ঠিত রাখবেন’’ (সূরা ইবরাহীমঃ ২৭)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "৫/৪২৭০। ইবনে উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের যে কেউ মারা যাওয়ার পর তার সামনে সকাল-সন্ধ্যায় তার বসবাসের ঠিকানা তুলে ধরা হয়। সে জান্নাতী হয়ে থাকলে জান্নাতীদের অবস্থান দেখানো হয় এবং জাহান্নামী হলে জাহান্নামীদের অবস্থান দেখানো হয়। তাকে বলা হয়, কিয়ামতের দিন তোমাকে উঠানোর পর থেকে এটাই হবে তোমার আবাস।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "৬/৪২৭১। আবদুর রহমান ইবনে কা‘ব আল-আনসারী (রাঃ) থেকে বর্ণিত। তার পিতা বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিন ব্যক্তির রূহ একটি পাখির আকৃতিতে জান্নাতের বৃক্ষে যুক্ত থাকবে। শেষে উত্থিত হওয়ার দিন তার রূহ তার দেহে ফিরে আসবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "৪২৭২। আবূ সুফিয়ান (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মৃত ব্যক্তিকে কবরে রাখা হলে সে সূর্যকে অস্তমিত দেখতে পায়। তখন সে উঠে বসে এবং তার চক্ষুদ্বয় মলতে মলতে বলে, আমাকে ছেড়ে দাও, আমি নামায পড়বো। এবং তার চক্ষুদ্বয় মলতে মলতে বলে, আমাকে ছেড়ে দাও, আমি নামায পড়বো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "১/৪২৭৩। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শিংগাধারী দু’ ফেরেশতা তাদের দু’ হাতে দু’টি শিংগা নিয়ে অপেক্ষায় আছেন, কখন তাদের প্রতি (ফুৎকারের) নির্দেশ আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "২/৪২৭৪। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, মদীনার বাজারে এক ইহূদী বললো, সেই সত্তার শপথ যিনি মূসা আলাইহিস সালামকে সমগ্র মানবজাতির উপর মর্যাদা দান করেছেন। এক আনসারী তার হাত তুলে তাকে সজোরে চড় মেরে বললো, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মাঝে থাকা অবস্থায় তুমি একথা বলছো! বিষয়টি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পেশ করা হলে তিনি বলেনঃ মহান আল্লাহ বলেছেনঃ ‘‘এবং শিংগায় ফুৎকার দেওয়া হবে। ফলে যাদের আল্লাহ ইচ্ছা করবেন তারা ব্যতীত আকাশমন্ডলী ও পৃথিবীর সকলে মুর্ছিত হয়ে পড়বে। অতঃপর পুনরায় শিংগায় ফুৎকার দেয়া হবে, তৎক্ষণাৎ তারা দন্ডায়মান হয়ে তাকাতে থাকবে’’ (সূরা যুমারঃ ৬৮)। আমি হবো মাথা উত্তোলনকারী প্রথম ব্যক্তি। আমি মূসা আলাইহিস সালামকে আরশের একটি পায়া আঁকড়ে ধরা অবস্থায় দেখতে পাবো। আমি জানি না, তিনি কি আমার আগে তাঁর মাথা তুলেছেন, না আল্লাহ তা‘আলা তাঁকে অজ্ঞান হওয়া থেকে রক্ষা করেছেন। আর যে ব্যক্তি বলে যে, আমি ইউনুস ইবনে মাত্তা (আলাইহিস সালাম) অপেক্ষা উত্তম, সে মিথ্যা বলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "৩/৪২৭৫। আবদুল্লাহ ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে মিম্বারের উপর দাঁড়িয়ে বলতে শুনেছিঃ মহাপ্রতাপশালী আল্লাহ তাঁর আকাশমন্ডলী ও পৃথিবীকে তাঁর হাতের মুঠোয় পুরে নিয়ে তা মুষ্টিবদ্ধ করবেন, অতঃপর তা সংকুচিত ও প্রসারিত করতে থাকবেন, অতঃপর বলবেন, আমিই মহাপ্রতাপশালী, অমিই রাজাধিরাজ। প্রতাপশালী দাম্ভিকেরা কোথায়? রাবী বলেন, এ কথা বলতে বলতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ডানে বামে ঝুঁকছিলেন। শেষে আমি লক্ষ্য করলাম যে, মিম্বারের নিম্নাংশ তাকে নিয়ে দুলছে, এমনকি আমি বলতে লাগলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বার থেকে নিচে পড়ে যান কিনা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "৪/৪২৭৬। কাসিম (রাঃ) থেকে বর্ণিত। তিনি বলেন, আয়েশা (রাঃ) বলেছেনঃ আমি বললাম, হে আল্লাহর রাসূল! কিয়ামতের দিন হাশরের ময়দানে মানবজাতিকে কী অবস্থায় সমবেত করা হবে? তিনি বলেনঃ নগ্নপদে উলঙ্গ বদনে। আমি বললাম, নারীরাও? তিনি বলেনঃ নারীরাও। আমি বললাম, হে আল্লাহর রাসূল! এতে কি আমরা লজ্জিত হবো না? তিনি বলেনঃ হে আয়েশা! তখনকার অবস্থা হবে খুবই ভয়ংকর। কেউ কারো প্রতি দৃষ্টিপাত করার মত অবস্থায় থাকবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "৫/৪২৭৭। আবূ মূসা আল-আশআরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন মানুষকে তিনবার পেশ করা হবে। প্রথম দু’বার বাক-বিতন্ডা ও ওজর-আপত্তি পেশের জন্য। তৃতীয়বারে প্রত্যেকের আমলনামা উড়ে এসে হাতের নাগালে পৌঁছবে এবং কেউ তা ডান হাতে, কেউ তা বাম হাতে গ্রহণ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "৬/৪২৭৮। ইবনে উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘‘যেদিন মানবজাতি জগতসমূহের প্রতিপালকের সম্মুখে দাঁড়াবে’’ (সূরা মুতাফফিফীনঃ ৬) শীর্ষক আয়াত সম্পর্কে বলেনঃ তাদের এক একজন নিজ দেহ নিঃসৃত ঘামের মধ্যে দু’ কান বরাবর ডুবন্ত অবস্থায় দাঁড়িয়ে থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "৭/৪২৭৯। আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট ‘‘যেদিন এই পৃথিবী পরিবর্তিত হয়ে অন্য পৃথিবী হবে এবং আকাশমন্ডলীও’’ (সূরা ইবরাহীমঃ ৪৮) শীর্ষক আয়াত সম্পর্কে জিজ্ঞাসা করলাম, সেদিন মানুষ কোথায় থাকবে? তিনি বলেনঃ পুলসিরাতের উপর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "৮/৪২৮০। আবূ সাঈদ আল-খুদরী (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পুলসিরাত জাহান্নামের দু’ তীরের সাথে যুক্ত থাকবে। তাতে থাকবে সাদান বৃক্ষের কাঁটা সদৃশ কাঁটাসমূহ। লোকজন তার উপর দিয়ে অতিক্রম করবে। কতক মুসলিম নিরাপদে তার উপড় দিয়ে অতিক্রম করবে, কতক কাঁটার আঁচড় খেয়ে, কতক কাঁটায় বিদ্ধ হয়ে থাকার পর নাজাত পাবে এবং কতক মুখ থুবড়ে জাহান্নামের তলদেশে নিক্ষিপ্ত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": 4281,
			"text": "৯/৪২৮১। হাফসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি অবশ্যই আশা করি আল্লাহর মর্জি যারা বদর ও হুদায়বিয়ার প্রান্তরে উপস্থিত ছিল তাদের কেউ জাহান্নামে যাবে না। আমি বললাম, হে আল্লাহর রাসূল! আল্লাহ তা‘আলা কি বলেননিঃ ‘‘এবং তোমাদের প্রত্যেকেই তা অতিক্রম করবে, এটা তোমার প্রভুর অনিবার্য সিদ্ধান্ত’’ (সূরা মরিয়মনঃ ৭১)? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি কি শোননি যে, আল্লাহ বলেছেনঃ ‘‘পরে আমি মোত্তাকীদের উদ্ধার করবো এবং যালেমদের সেথায় নতজানু অবস্থায় রেখে দিবো’’ (সূরা মরিয়মঃ ৭২)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "১/৪২৮২। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন তারা (আমার উম্মাত) শুভ্র হস্তপদ ও উজ্জ্বল চেহারায় আমার নিকট দিয়ে অতিক্রম করবে। এটা হবে আমার উম্মাতের নিদর্শন, অন্য কোন উম্মাতের নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": 4283,
			"text": "২/৪২৮৩। আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে একটি তাঁবুর মধ্যে ছিলাম। তিনি বলেনঃ তোমরা কি এ কথায় সন্তুষ্ট নও যে, তোমরা জান্নাতীদের সংখ্যার এক-চতুর্থাংশ হবে? আমরা বললাম, হাঁ। তিনি আবার বলেনঃ তোমরা কি এ কথায় সন্তুষ্ট নও যে, তোমরা জান্নাতীদের সংখ্যার এক-তৃতীয়াংশ হবে? আমরা বললাম, হাঁ। তিনি বলেনঃ জান্নাতীদের অর্ধেক হবে তোমরা। এজন্য যে, জান্নাতে কেবল মুসলিম ব্যক্তিই প্রবেশ করবে। তোমরা মুশরিকদের তুলনায় কালো ষাঁড়ের চামড়ায় সাদা লোম সদৃশ অথবা লাল ষাঁড়ের চামড়ায় কালো লোম সদৃশ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": 4284,
			"text": "৩/৪২৮৪। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কিয়ামতের দিন) একজন নবী আসবেন, তাঁর সাথে থাকবে একজন মাত্র অনুসারী। আবার কোন নবীর সাথে থাকবে দু’জন অনুসারী। আবার কোন নবীর সাথে থাকবে তিনজন বা তার কম-বেশী অনুসারী। তাঁকে বলা হবে, তুমি কি তোমার জাতির নিকট আল্লাহর বাণী পৌঁছিয়েছিলে? তিনি বলবেনঃ হাঁ। তার জাতিকে ডাকা হবে এবং বলা হবে, তিনি কি তোমাদের নিকট আল্লাহর বাণী পৌঁছিয়েছিলেন? তারা বলবে, না। তাঁকে বলা হবে, তোমার সাক্ষী কারা? তিনি বলবেনঃ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর উম্মাত। তখন মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উম্মাতকে ডাকা হবে এবং জিজ্ঞেস করা হবে, নবী কি (তাঁর উম্মাতের নিকট আল্লাহর বাণী) পৌঁছিয়েছিলেন? তারা বলবে, হাঁ। তাদের আবার জিজ্ঞেস করা হবে, তোমরা তা জানলে কিভাবে? তারা বলবে, আমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবহিত করেছিলেন যে, নিশ্চয় রাসূলগণ আল্লাহর বাণী পৌঁছে দিয়েছেন। আমরা তাঁর কথা সত্য বলে স্বীকার করেছি। তোমাদের জন্য এ কথার প্রমাণ হলো মহান আল্লাহর বাণী (অনুবাদ): ‘‘এভাবে আমি তোমাদেরকে এক ন্যায়নিষ্ঠ জাতিরূপে প্রতিষ্ঠিত করেছি, যাতে তোমরা মানবজাতির জন্য সাক্ষীস্বরূপ এবং রাসূল তোমাদের সাক্ষীস্বরূপ হতে পারে’’ (সূরা বাকারঃ ১৪৩)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "৪/৪২৮৫। রিফাআ আল-জুহানী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা (সফর থেকে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ফিরে এলে তিনি বলেনঃ সেই মহান সত্তার শপথ, যাঁর হাতে মুহাম্মাদের প্রাণ! এমন কোন বান্দা নেই, যে ঈমান আনার পর তার উপর অবিচল থেকেও জান্নাতের দিকে পরিচালিত হবে না। আমি আশা করি যে, তোমরা ও তোমাদের সৎকর্মপরায়ণ সন্তানেরা জান্নাতে নিজ নিজ স্থানে না পৌঁছা পর্যন্ত অন্য লোকেরা জান্নাতে প্রবেশ করতে পারবে না। আমার মহান প্রভু আমাকে প্রতিশ্রুতি দিয়েছেন যে, তিনি আমার উম্মাতের সত্তর হাজার লোককে বিনা হিসাবে জান্নাতে প্রবেশ করাবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": 4286,
			"text": "৫/৪২৮৬। আবূ উমামা আল-বাহিলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ আমার মহান প্রতিপালক আমাকে প্রতিশ্রুতি দিয়েছেন যে, তিনি আমার উম্মাতের সত্তর হাজার লোককে বিনা হিসাবে জান্নাতে দাখিল করবেন এবং তাদের কোনরূপ শাস্তিও হবে না। প্রতি হাজারের সাথে থাকবে আরও সত্তর হাজার করে এবং আরো থাকবে আমার মহান প্রতিপালকের তিন মুঠো পরিমাণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": 4287,
			"text": "৬/৪২৮৭। বাহ্য ইবনে হাকীম (রাঃ) থেকে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন আমার উম্মাত সত্তর সংখ্যা পূর্ণ করবে। আমরা হবো এর সর্বশেষ ও সর্বোত্তম উম্মাত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": 4288,
			"text": "৭/৪২৮৮। বাহয ইবনে হাকীম (রাঃ) থেকে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ নিশ্চয় তোমরা উম্মাতের সংখ্যা সত্তরে পূর্ণ করেছো। এদের মধ্যে তোমরাই আল্লাহর নিকট অধিক উত্তম ও মর্যাদাবান উম্মাত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": 4289,
			"text": "৮/৪২৮৯। বুরায়দা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জান্নাতীদের একশত বিশটি কাতার হবে। তন্মধ্যে এই উম্মাতের হবে আশিটি কাতার এবং অন্যান্য উম্মাতের হবে চল্লিশটি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": 4290,
			"text": "৯/৪২৯০। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমরা হলাম সর্বশেষ উম্মাত এবং সর্বপ্রথম আমাদের হিসাব গ্রহণ করা হবে। বলা হবে, উম্মী (নিরক্ষর) নবীর উম্মাত এবং তাদের নবী কোথায়? সুতরাং আমরা হলাম সর্বশেষ উম্মাত (দুনিয়াতে আগমনের দিক থেকে) এবং সর্বাপ্রথম উম্মাত (জান্নাতে প্রবেশের দিক থেকে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": 4291,
			"text": "১০/৪২৯১। আবূ বুরদা (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ কিয়ামতের দিন সমগ্র সৃষ্টিকে একত্র করার পর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উম্মাতকে সিজদারত হওয়ার নির্দেশ দেয়া হবে। তারা দীর্ঘক্ষণ তাঁর উদ্দেশে সিজদারত থাকবে। অতঃপর বলা হবে, তোমরা মাথা উঠাও। আমি তোমাদের সমসংখ্যককে (কাফেরকে) জাহান্নামের ফিদয়া স্বরূপ দিয়েছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": 4292,
			"text": "১১/৪২৯২। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এই উম্মাত হলো অনুগ্রহপ্রাপ্ত। এদের দ্বারাই এদের শাস্তি হবে (পারস্পরিক হানাহানির মাধ্যমে)। কিয়ামতের দিন প্রত্যেক মুসলিমকে একজন করে মুশরিক সোপর্দ করা হবে এবং বলা হবে, জাহান্নাম থেকে বাঁচার জন্য এই হলো তোমার ফিদয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": 4293,
			"text": "১/৪২৯৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা‘আলার একশত রহমত রয়েছে। তন্মধ্যে একটি রহমত তিনি সারা সৃষ্টির মধ্যে বণ্টন করেছেন। এই একটি রহমতের কারণেই তারা একে অপরের প্রতি দয়াপরবশ হয়, পরস্পরের প্রতি সহানুভূতিশীল হয়। এর দ্বারা জীব-জন্তু তার বাচ্চার প্রতি মমতায় উদ্বুদ্ধ হয়। তিনি অবশিষ্ট নিরানব্বইটি রহমত কিয়ামতের দিন তাঁর বান্দাদের প্রতি অনুকম্পা প্রদর্শনের জন্য রেখেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "২/৪২৯৪। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহান আল্লাহ আসমানসমূহ ও পৃথিবী সৃষ্টির দিন এক শত রহমত সৃষ্টি করেছেন। তার মধ্যে থেকে তিনি মাত্র একটি রহমত পৃথিবীতে বিতরণ করেছেন। এর দ্বারা উদ্বুদ্ধ হয়ে মা তার সন্তানের প্রতি অনুকম্পা প্রদর্শন করে এবং জীবজন্তুু, পক্ষীকুল ইত্যাদিও পরস্পরের প্রতি সহানুভূতি প্রদর্শন করে। অবশিষ্ট নিরানব্বইটি রহমত তিনি কিয়ামতের দিনের জন্য রেখে দিয়েছেন। যেদিন কিয়ামত হবে সেদিন তিনি এটি দ্বারা একশত রহমত পূর্ণ করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": 4295,
			"text": "৩/৪২৯৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ যখন সৃষ্টিকুলকে সৃষ্টি করেছেন তখন নিজ হাতে নিজের ব্যাপারে লিখেছেনঃ ‘‘আমার রহমত আমার ক্রোধের উপর বিজয়ী থাকবে’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": 4296,
			"text": "৪/৪২৯৬। মুআয ইবনে জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট দিয়ে যাচ্ছিলেন। আমি তখন একটি গাধার পিঠে আরোহিত ছিলাম। তিনি বলেনঃ হে মুআয! তুমি কি জানো, বান্দার উপর আল্লাহর কী অধিকার রয়েছে এবং আল্লাহর উপর বান্দার কী অধিকার রয়েছে? আমি বললাম, আল্লাহ ও তাঁর রাসূলই অধিক অবগত। তিনি বলেনঃ বান্দার উপর আল্লাহর অধিকার এই যে, বান্দাহ তাঁরই ইবাদত করবে এবং তাঁর সাথে অন্য কিছু শরীক করবে না। আর আল্লাহর উপর বান্দার অধিকার এই যে, তারা (বান্দা) তদনুযায়ী আচরণ করলে তিনি তাদেরকে শাস্তি দিবেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "৫/৪২৯৭। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা কোন এক জিহাদে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে ছিলাম। তিনি এক সম্প্রদায়ের নিকট দিয়ে যাচ্ছিলেন। তিনি জিজ্ঞেস করলেন, কারা এই সম্প্রদায়? তারা বলেন, আমরা মুসলিম। এক স্ত্রীলোক তার চুলায় আগুন দাউ দাউ করে জ্বলে উঠলে সে তার পুত্রকে সরিয়ে নিলো। সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো, আপনি কি আল্লাহর রাসূল? তিনি বলেনঃ হাঁ। সে বললো, আমার পিতা-মাতা আপনার জন্য উৎসর্গিত হোক। আল্লাহ তা‘আলা কি দয়ালুদের মধ্যে সর্বাধিক দয়ালু নন? তিনি বলেনঃ অবশ্যই। স্ত্রীলোকটি বললো, সন্তানের প্রতি মা যতোটা দয়াপরবশ, আল্লাহ কি তাঁর বান্দাদের প্রতি তার চেয়ে অধিক দয়াপরবশ নন? তিনি বলেনঃ অবশ্যই। সে বললো, নিশ্চয় মা তার সন্তানকে আগুনে নিক্ষেপ করে না। একথায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথা অবনত করে কেঁদে দিলেন, অতঃপর মাথা তুলে তাকে বলেনঃ যে ব্যক্তি অবাধ্য, উদ্ধত, বিদ্রোহী, যে আল্লাহর বিরুদ্ধে বিদ্রোহ করে এবং ‘‘লা ইলাহা ইল্লাল্লাহ’’ বলতে অস্বীকার করে, সে ব্যতীত আল্লাহ তার অপরাপর বান্দাদের শাস্তি দিবেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": 4298,
			"text": "৬/৪২৯৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুর্ভাগা হতভাগা ব্যতীত কেউ জাহান্নামে যাবে না। জিজ্ঞেস করা হলো, হে আল্লাহর রাসূল! হতভাগা কে? তিনি বলেনঃ যে ব্যক্তি আল্লাহর আনুগত্যমূলক কাজ করেনি এবং তাঁর অবাধ্যাচারিতা ত্যাগ করেনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": 4299,
			"text": "৭/৪২৯৯। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াত পাঠ বা তিলাওয়াত করলেন (অনুবাদ) ‘‘একমাত্র তিনিই ভয়ের যোগ্য এবং তিনিই ক্ষমা করার অধিকারী’’ (সূরা মুদ্দাসসিরঃ ৫৬), অতঃপর বলেনঃ মহান আল্লাহ বলেছেন, আমিই উপযুক্ত যে, কেবল আমাকেই ভয় করতে হবে। অতএব আমার সাথে যেন অন্য ইলাহ যোগ না করা হয়। যে ব্যক্তি আমার সাথে অন্য কোন ইলাহ যোগ করা পরিহার করবে, আমি তাকে ক্ষমা করার যোগ্য। ৮/৪২৯৯(১)। আবুল হাসান আল-কাত্তান (রাঃ) -আনাস (রাঃ) থেকে বর্ণিত। ‘‘একমাত্র তিনিই ভয়ের যোগ্য এবং তিনিই ক্ষমা করার অধিকারী’’ (সূরা মুদ্দাসসির) শীর্ষক আয়াত সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের প্রতিপালক বলেছেন, আমিই উপযুক্ত যে, আমাকেই ভয় করতে হবে, আমার সাথে অন্যকে শরীক করা যাবে না। আর যে ব্যক্তি আমার সাথে শরীক করা পরিহার করেছে আমিই তাকে ক্ষমা করার যোগ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": 4300,
			"text": "৯/৪৩০০। আবদুল্লাহ ইবনে আমর (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন সমস্ত সৃষ্টির সামনে আমার এক উম্মাতকে ডাকা হবে, অতঃপর তার সামনে নিরানব্বইটি দফতর পেশ করা হবে। প্রতিটি দফতর দৃষ্টিসীমা পর্যন্ত দীর্ঘ হবে। মহান আল্লাহ বলবেন, তুমি কি এর কোন কিছু অস্বীকার করো? সে বলবে, না, হে আমার প্রভু! আল্লাহ বলবেন, তোমার উপর আমলনামা লেখক আমার ফেরেশতাগণ কি জুলুম করেছে? অতঃপর তিনি জিজ্ঞাসা করবেন, তোমার নিকট কি কোন নেকী আছে? সে ভীত-সন্ত্রস্ত হয়ে পড়বে এবং বলবে, না। তখন আল্লাহ বলবেন, হাঁ, আমার নিকট তোমার কিছু নেকী জমা আছে। আজ তোমার উপর জুলুম করা হবে না। অতঃপর তার সামনে একটি চিরকুট তুলে ধরা হবে, যাতে লিপিবদ্ধ থাকবেঃ ‘‘আমি সাক্ষ্য দেই যে, আল্লাহ ব্যতীত কোন ইলাহ নেই এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বান্দাহ ও রাসূল। তখন সে বলবে হে আমার রব! এতো বৃহৎ দফতরসমূহের তুলনায় এই ক্ষুদ্র চিরকুট আর কী উপকারে আসবে! তিনি বলবেন, তোমার প্রতি অন্যায় করা হবে না। অতঃপর সেই বৃহদাকার দফতরসমূহ এক পাল্লায় এবং সেই ক্ষুদ্র চিরকুটটি আরেক পাল্লায় রাখা হবে। এতে বৃহদাকার দফতরসমূহের পাল্লা হালকা হয়ে উপরে উঠে যাবে এবং ক্ষুদ্র চিরকুটের পাল্লা ভারী হয়ে যাবে। মুহাম্মাদ ইবনে ইয়াহইয়া বলেন, বিতাকা (চিরকুট) অর্থ রুক্আ (টুকরা), মিসরবাসী রুকআকে বিতাকা বলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": 4301,
			"text": "১/৪৩০১। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমার জন্য বায়তুল্লাহ থেকে বায়তুল মুকাদ্দাস পর্যন্ত বিস্তৃত একটি ঝর্ণা আছে। এর পানি দুধের ন্যায় সাদা এবং এর পানপাত্র তারকাপুঞ্জের ন্যায় অসংখ্য। কিয়ামতের দিন অন্য সকল নবী-রাসূলের অনুসারীর চেয়ে আমার অনুসারীর সংখ্যা হবে অনেক বেশী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "২/৪৩০২। হুযায়ফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার হাওয কাওসারের পরিধি আয়লা থেকে এডেন পর্যন্ত বিস্তৃত। সেই মহান সত্তার শপথ, যাঁর হাতে আমার প্রাণ! এই হাওযের পানপাত্রের সংখ্যা হবে নক্ষত্ররাজির চেয়েও অধিক। এর পানি হবে দুধের চেয়েও সাদা এবং মধুর চেয়েও মিষ্টি। সেই মহান সত্তার শপথ যাঁর হাতে আমার প্রাণ! নিশ্চয় আমি এই হাওযের তীর থেকে একদল লোককে তাড়িয়ে দিবো, যেমন কোন লোক অপরিচিতি উটকে তার কূপ থেকে তাড়িয়ে দেয়। জিজ্ঞেস করা হলো, হে আল্লাহর রাসূল! আপনি কি আমাদের চিনতে পারবেন? তিনি বলেনঃ হাঁ, তোমরা উযু করার কারণে তোমাদের উযুর অঙ্গসমূহ উজ্জল অবস্থায় আমার নিকট উপস্থিত হবে। তোমাদের ব্যতীত অন্য কারো এরূপ হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "৩/৪৩০৩। আবূ সাল্লাম আল-হাবাশী (রাঃ) থেকে বর্ণিত। তিনি বলেন, উমার ইবনে আবদুল আযীয (রাঃ) আমাকে ডেকে পাঠান। আমি একটি খচ্চরের পিঠে সাওয়ার হয়ে তার নিকট আসি। আমি তার নিকট পৌঁছলে তিনি বলেন, হে আবূ সাল্লাম! আমি আপনার বাহনের ব্যাপারে আপনাকে কষ্ট দিয়েছি। তিনি বলেন, হাঁ, আল্লাহর শপথ! হে আমীরুল মুমিনীন। তিনি বলেন, আল্লাহর শপথ! আপনাকে কষ্ট দেয়ার ইচ্ছা আমার ছিলো না। আমি জানতে পেরেছি যে, আপনি হাওয কাওসার সম্পর্কিত একটি হাদীস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর মুক্তদাস সাওবান (রাঃ) -র সূত্রে বর্ণনা করেন। আমি সেই হাদীসখানি আপনার মুখে শুনতে আগ্রহী। আমি বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুক্তদাস সাওবান (রাঃ) আমার নিকট বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার হাওয এডেন থেকে আয়লা পর্যন্ত বিস্তৃত হবে। এর পানি দুধের চেয়েও সাদা এবং মধুর চেয়েও মিষ্টি। এর পাত্রসংখ্যা আকাশের তারকারাজির সমান। যে কেউ এই হাওয থেকে এক ঢোক পানি পান করতে পারবে, সে আর কখনও তৃষ্ণার্ত হবে না। দরিদ্র মুহাজিরগণ সর্বপ্রথম এর পানি পানের সৌভাগ্য লাভ করবে, যাদের মাথার চুল উস্কখুষ্ক, পোশাক ধুলি মলিন, যারা ধনবান পরিবারের মেয়েদের বিবাহ করতে পারেনি এবং যাদের আপ্যায়নের জন্য ঘরের দরজাসমূহ খোলা হয়নি। রাবী বলেন, (এ হাদীস শুনে) উমার (রাঃ) কেঁদে দিলেন, এমন কি তার দাড়ি অশ্রুসিক্ত হয়ে গেলো। তিনি বলেন, আমি তো ধনীর দুলালী বিবাহ করেছি এবং আমার জন্য সব দরজাই তো উন্মুক্ত। এখন থেকে আমি আমার পরিধেয় বস্ত্র ময়লাযুক্ত না হওয়া পর্যন্ত ধৌত করবো না এবং মাথার চুল উষ্কখুষ্ক না হওয়া পর্যন্ত তৈল ব্যবহার করবো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": 4304,
			"text": "৪/৪৩০৪। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার হাওযের দু’ তীরের ব্যবধান (ইয়ামনের রাজধানী) সানআ ও মদীনার মধ্যকার দূরত্বের সমান অথবা মদীনার ও আম্মানের মধ্যকার দূরত্বের সমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "৫/৪৩০৫। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সেখানে (হাওয কাওসারের তীরে) আকাশের নক্ষত্রপুঞ্জের সমান সংখ্যক স্বর্ণ ও রৌপ্য নির্মিত পানপাত্রসমূহ দৃশ্যমান থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "৬/৪৩০৬। আবূ হুরায়রা থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরস্থানে এসে কবরবাসীদের সালাম দিলেন এবং বললেনঃ ‘‘আসসালামু আলাইকুম দারা কাওমিম মুমিনীন ওয়াইন্না ইনশাআল্লাহ তা‘আলা বিকুম লাহিকুন’’ (ঈমানদার কবরবাসীরা! তোমাদের প্রতি শান্তি বর্ষিত হোক। অচিরেই আল্লাহর মর্জি আমরা তোমাদের সাথে মিলিত হবো)। অতঃপর তিনি বলেনঃ নিশ্চয় আমাদের আকাঙ্ক্ষা এই যে, আমরা আমাদের ভাইদের দেখতে পাবো। তারা বলেন, হে আল্লাহর রাসূল! আমরা কি আপনার ভাই নই? তিনি বলেনঃ তোমরা আমার সাহাবী। আর যারা আমাদের পরে আসবে তারা আমার ভাই। আমি তোমাদের আগেই হাওযের নিকট উপস্থিত হবো। তারা জিজ্ঞাসা করেন, হে আল্লাহর রাসূল! আপনি এমন লোকেদের আপনার উম্মাতরূপে কিভাবে চিনবেন, যারা এখনও জন্মগ্রহণ করেনি? তিনি বলেনঃ তোমরা কি দেখো না, যদি কোন ব্যক্তির একটি সাদা পা ও সাদা পেশানীযুক্ত ঘোড়া অপর ব্যক্তির কোলো ঘোড়ার পালে মিশে যায়, তবে সে কি তার ঘোড়াটি চিনতে পারবে না? তারা বলেন, হাঁ, নিশ্চয় চিনতে পারবে। তিনি বলেনঃ তারা কিয়ামতের দিন উযুর বদৌলতে সাদা পেশানী ও সাদা হাত-পাবিশিষ্ট অবস্থায় আসবে। তিনি আরো বলেনঃ আমি তোমাদের আগেই হাওয কাওছারে উপস্থিত হবো। একদল লোক আমার হাওয থেকে বিতাড়িত হবে, যেমন পথভোলা উট বিতাড়িত হয়। আমি তাদেরকে ডেকে বলবোঃ তোমরা এদিকে এসো তোমরা এদিকে এসো। তখন বলা হবে, এসব লোক আপনার পর (দীনকে) পরিবর্তন করেছে এবং অবিরত তারা তাদের পশ্চাতে ফিরে গেছে। তখন আমি বলবোঃ সাবধান! দূর হও দূর হও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "১/৪৩০৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক নবীর জন্য একটি করে দোয়া আছে যা কবুল করা হয়। আর প্রত্যেক নবী তাঁর দু‘আর ব্যাপারে তাড়াহুড়া করেছেন আর আমি আমার দু‘আ আমার উম্মাতের শাফাআতের জন্য জমা রেখেছি। অতএব আমার উম্মাতের মধ্যে যারা আল্লাহর সাথে শিরক না করে মারা যাবে তারা আমার শাফাআত প্রাপ্ত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": 4308,
			"text": "২/৪৩০৮। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি আদম সন্তানদের সরদার, তাতে গর্বের কিছু নেই। কিয়ামতের দিন সর্বপ্রথম আমার জন্য জমীন বিদীর্ণ হবে (কবর থেকে সর্বপ্রথম আমিই উঠবো), এতে গর্বের কিছু নাই। আমিই হবো সর্বপ্রথম শাফাআতকারী এবং সর্বাগ্রে আমার শাফাআত কবুল করা হবে। এতেও কোন গর্ব নেই। কিয়ামতের দিন আল্লাহর প্রশংসার পতাকা আমার হাতে থাকবে। এতেও গর্বের কিছু নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": 4309,
			"text": "৩/৪৩০৯। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আহা দোখবাসী, যারা জাহান্নামবাসী তারা সেখানে মরবেও না, বাঁচবেও না। তবে কতক লোক তাদের ভুলত্রুটি ও গুনাহের কারণে জাহান্নামে শাস্তি ভোগ করবে। আগুন তাদের দগ্ধীভূত করবে, ফলে তারা কয়লাবৎ হয়ে যাবে। তখন তাদের শাফাআতের অনুমতি দেয়া হবে। তাদের দলে দলে জাহান্নাম থেকে বের করে আনা হবে এবং জান্নাতের ঝরনার নিকট ছড়িয়ে রাখা হবে। তখন বলা হবে, হে জান্নাতবাসীরা! তোমরা তাদের উপর পানি ছিটিয়ে দাও। ফলে তারা প্লাবনের পর উর্বর মাটিতে চারাগাছ গজানোর মত গজিয়ে উঠবে। রাবী বলেন, উপস্থিত এক ব্যক্তি বললো, মনে হয় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেন বন-বাদাড়ে বসবাস করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": 4310,
			"text": "৪/৪৩১০। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ কিয়ামতের দিন আমার শাফাআত হবে আমার উম্মাতের কবীরা গুনাহগারদের জন্যই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": 4311,
			"text": "৫/৪৩১১। আবূ মূসা আল-আশআরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমাকে শাফাআত করার অথবা আমার উম্মাতের অর্ধেক জান্নাতী হওয়ার মধ্যে যে কোন একটি গ্রহণ করার অবকাশ দেয়া হয়েছিলো। আমি শাফাআতকে গ্রহণ করেছি। কেননা তা ব্যাপক বিস্তৃত এবং অধিক ফলপ্রসূ। তোমরা কি মনে করো যে, শাফাআত মুত্তাকীদের জন্য? না, বরং তা গুনাহগার, অপরাধে অভিযুক্ত এবং সত্য-মিথ্যার মধ্যে মিশ্রণকারীদের জন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "৬/৪৩১২। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কিয়ামতের দিন ঈমানদার বান্দারা সমবেত হবে। তখন তাদের অন্তরে ইলহাম করা হবে এবং তারা বলবে, কেউ যদি আমাদের প্রভুর নিকট আমাদের জন্য শাফাআত করতো তাহলে তিনি আমাদেরকে এ অবস্থা থেকে শান্তি দিতে পারতেন। অতএব তারা আদম আলাইহিস সালামের নিকট এসে বলবে, আপনি আদম, মানবজাতির পিতা। আল্লাহ নিজ হাতে আপনাকে সৃষ্টি করেছেন এবং তাঁর ফেরেশতাদের দ্বারা আপনাকে সিজদা করিয়েছেন। আপনি আমাদের এ অবস্থা থেকে নাজাতের জন্য আপনার প্রতিপালকের নিকট শাফাআত করুন। তিনি বলবেনঃ আমি তোমাদের এ কাজের উপযুক্ত নই। তিনি তাদের নিকট নিজের কৃত গুনাহের কথা উল্লেখ করে আক্ষেপ করবেন এবং এতে লজ্জিত হবেন। বরং তোমরা নূহ আলাইহিস সালামের নিকট যাও। কেননা তিনি ছিলেন পৃথিবীবাসীর প্রতি আল্লাহর প্রেরিত প্রথম রাসূল। অতএব তারা তাঁর নিকট উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের উপযুক্ত নই। তিনি অজ্ঞাতে আল্লাহর নিকট যে নিবেদন করেছিলেন, তা স্মরণ করে লজ্জিত হবেন। বরং তোমরা দয়াময় রহমানের প্রিয় বান্দা ইবরাহীম আলাইহিস সালামের নিকট যাও। অতএব তারা তাঁর নিকট আসলে তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। বরং তোমরা মুস আলাইহিস সালামের নিকট যাও। তিনি ছিলেন আল্লাহর প্রিয় বান্দা, তাঁর সাথে আল্লাহ বাক্যালাপ করেছেন এবং তাঁকে তাওরাত কিতাব দান করেছেন। অতএব তারা তাঁর নিকট উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। তিনি একটি অন্যায় হত্যাকান্ডের কথা স্মরণ করবেন। তোমরা বরং আল্লাহর বানদা ও রাসূল, তাঁর বাক্য, তাঁর দেয়া রূহ ঈসা আলাইহিস সালামের নিকট যাও। অতএব লোকেরা তাঁর নিকট এসে উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। বরং তোমরা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট যাও, যাঁর পূর্বাপর সমস্ত গুনাহ আল্লাহ ক্ষমা করে দিয়েছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তখন তারা আমার নিকট আসবে এবং আমি রওয়ানা হবো। রাবী বলেন, হাসান (রাঃ) -এর সনদে এই শব্দাবলী বর্ণিত আছেঃ তিনি বলেন, আমি মুমিনদের দু’টি সারির মাঝখান দিয়ে অগ্রসর হতে থাকবো। কাতাদা (রাঃ) বলেন, তারপর রাবী আনাস (রাঃ) থেকে বর্ণিত হাদীসের শব্দাবলীতে বর্ণনা করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি আমার প্রভুর নিকট (শাফাআতের) অনুমতি প্রার্থনা করবো এবং আমাকে অনুমতি দেয়া হবে। আমি তাঁকে দেখামাত্র সিজদায় লুটিয়ে পড়বো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত অবস্থায় রাখবেন। অতঃপর নির্দেশ দেওয়া হবে, হে মুহাম্মাদ! মাথা উঠাও, বলো, শোনা হবে এবং চাও, দেয়া হবে, শাফাআত করো, কবুল করা হবে। অতএব তিনি যা আমাকে শিখিয়ে দিবেন সেই বাক্যে আমি তাঁর প্রশংসা করবো। অতঃপর আমি শাফাআত করবো। তবে আমার জন্য শাফাআতের একটি সীমা বেঁধে দেয়া হবে। আল্লাহ শাফাআতপ্রাপ্তদের জান্নাতে প্রবেশ করাবেন। আমি পুনরায় আমার প্রভুর নিকট ফিরে আসবো এবং তাঁকে দেখামাত্র সিজদায় লুটিয়ে পড়বো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত রাখবেন। অতঃপর আমাকে বলা হবে, হে মুহাম্মাদ! মাথা উঠাও, বলো শোনা হবে; চাও দেয়া হবে; শাফাআত করো কুবল করা হবে। তিনি আমাকে যে বাক্য শিখিয়ে দিবেন, আমি সেই বাক্যে তাঁর প্রশংসা করবো, অতঃপর শাফাআত করবো। আমাকে একটি সীমা নির্দিষ্ট করে দেয়া হবে। আল্লাহ শাফাআতপ্রাপ্তদের জান্নাতে প্রবেশ করাবেন। আমি তৃতীয় বারের মত ফিরে যাবো এবং আমার প্রভুকে দেখামাত্র সিজদায় পতিত হবো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত রাখবেন। অতঃপর বলা হবে, হে মুহাম্মাদ! মাথা উঠাও; বলো, শোনা হবে; প্রার্থনা করো, কবুল করা হবে; শাফাআত করো, মঞ্জুর করা হবে। আমি আমার মাথা উঠাবো এবং তাঁর শিখানো বাক্যে তাঁর প্রশংসা করবো এবং তারপর আমি শাফাআত করবো এবং আমাকে একটা সীমা বেঁধে দেয়া হবে। আল্লাহ শাফাআতকৃতদের জান্নাতে প্রবেশ করাবেন। আমি চতুর্থবার গিয়ে বলবো, হে প্রভু! কুরআন যাদের আটক করে রেখেছে তারা ব্যতীত আর কেউ অবশিষ্ট নেই। রাবী বলেন, কাতাদা (রাঃ) এই হাদীস বর্ণনা করে বলেছেন, আনাস ইবনে মালেক (রাঃ) আমাদে কাছে বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শেষে এমন ব্যক্তিকে জাহান্নাম থেকে রে করা হবে যে শুধু বলেছে, ‘‘লা ইলাহা ইল্লাল্লাহ’’ (আল্লাহ ব্যতীত কোন ইলাহ নেই) এবং যার অন্তরে একটি গমের দানা পরিমাণ নেক আমল থাকবে। আর এমন ব্যক্তিকেও জাহান্নাম থেকে বের করে আনা হবে যে বলেছে, ‘‘লা ইলাহা ইল্লাল্লাহ ’’ এবং যার অন্তরে থাকবে বার্লির দানা পরিমাণ নেক আমল (ঈমান)। এমন ব্যক্তিকেও জাহান্নাম থেকে বের করা হবে যে বলেছেঃ লা ইলাহা ইল্লাল্লাহু এবং যার অন্তরে অণু পরিমাণ নেক আমল থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": 4313,
			"text": "৭/৪৩১৩। উষমান ইবনে আফফান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন তিন শ্রেণীর লোক শাফা‘আত করবে। নবীগণ, অতঃপর আলেমগণ, অতঃপর শহীদগণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": 4314,
			"text": "৮/৪৩১৪। উবাই ইবনে কাব (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কিয়ামতের দিন আমি হবো নবীগণের ইমাম, তাদের পক্ষ থেকে বক্তব্য পেশকারী এবং তাদের প্রধান সুপারিশকারী, তাতে কোন গর্ব নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": 4315,
			"text": "৯/৪৩১৫। ইমরান ইবনুল হুসাইন (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমার শাফাআতের বদৌলতে ‘জাহান্নামী’ নামের একদল জাহান্নাম থেকে নাজাত পাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": 4316,
			"text": "১০/৪৩১৬। আবদুল্লাহ ইবনে আবুল জাদ‘আ (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ আমার উম্মাতের এক ব্যক্তির শাফাআতে তামীম গোত্রের জনসংখ্যার চেয়েও অধিক লোক জান্নাতে যাবে। তারা জিজ্ঞাসা করলেন, হে আল্লাহর রাসূল! সেই ব্যক্তি কি আপনি ব্যতীত অন্য কেউ? তিনি বলেনঃ আমি ব্যতীত। আমি (আবদুল্লাহ ইবনে আবুল জাদ‘আ) জিজ্ঞাসা করলাম, আপনি কি এটা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুনেছেন? তিনি বলেন, আমি তাঁর নিকট শুনেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "১১/৪৩১৭। আওফ ইবনে মালেক আল-আশজাঈ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কি জানো, আমার প্রভু আজ রাতে আমাকে কোন্ বিষয়ে অবকাশ দিয়েছেন? আমরা বললাম, আল্লাহ ও তাঁর রাসূল অধিক অবগত। তিনি বলেনঃ তিনি (আল্লাহ) আমাকে এই অবকাশ দিয়েছেন যে, আমার উম্মাতের অর্ধেক সংখ্যক জান্নাতে প্রবেশ করবে অথবা তাদের নাজাতের জন্য শাফা‘আতের অনুমতি থাকবে। আমি শাফা‘আতের অবকাশ গ্রহণ করলাম। আমরা বললাম, হে আল্লাহর রাসূল! আপনি আল্লাহর কাছে দোয়া করুন যেন তিনি আমাদেরকে শাফা‘আত লাভের যোগ্য বানান। তিনি বলেনঃ এই শাফা‘আত প্রত্যেক মুসলিমের জন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "১/৪৩১৮। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের দুনিয়ার এ আগুন জাহান্নামের আগুনের সত্তর ভাগের একভাগ (উত্তাপের দিক থেকে)। যদি সেই আগুনকে দু’বার পানি দ্বারা ঠান্ডা করা না হতো তবে তোমরা এর দ্বারা উপকৃত হতে পারতে না। এ আগুন মহামহিম আল্লাহর নিকট প্রার্থনা করছে যে আবার তাকে জাহান্নামে ফেরত না নেয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": 4319,
			"text": "২/৪৩১৯। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নাম তার প্রভুর নিকট অভিযোগ করে বললো, হে আমার রব! আমার একাংশ অপরাংশকে গ্রাস করেছে। তখন আল্লাহ তাকে দু’বার নিঃশ্বাস নেয়ার অনুমতি দিলেনঃ একটি শীতকালে অপরটি গ্রীষ্মকালে। তোমরা দুনিয়াতে যে ঠান্ডা অনুভব করো তা হলো জাহান্নামের হিম শীতলতা থেকে এবং যে গরম অনুভব করো তা হলো জাহান্নামের আগুনের উষ্ণতা থেকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": 4320,
			"text": "৩/৪৩২০। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামের আগুন হাজার বছর ধরে উত্তপ্ত করার পর তা সাদা রং ধারণ করে আবার তা হাজার বছর ধরে উতপ্ত করার পর লাল রং ধারণ করে। আবার হাজার বছর ধরে উত্তপ্ত করার পর তা কালো বর্ণ ধারণ করে। এখন তা গভীর অন্ধকার রাতের মতো অন্ধকার অবস্থায় আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "৪/৪৩২১। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন কাফেরদের মধ্য থেকে এমন এক ব্যক্তিকে হাযির করা হবে, যে দুনিয়াতে আরাম-আয়েশে দিন কাটিয়েছে। বলা হবে, তোমরা (ফেরেশতারা) একে জাহান্নামে একটি চুবান দাও। অতএব তাকে জাহান্নামে একটি চুবান দেয়া হবে। অতঃপর তাকে জিজ্ঞেস করা হবে, হে অমুক! তুকি কি কখনো সুখের ছোঁয়া পেয়েছো? সে বলবে, না, আমি কখনো সুখের ছোঁয়া পাইনি। অতঃপর (কিয়ামতের দিন) ঈমানদারদের মধ্য হতে এমন এক ব্যক্তিকে হাযির করা হবে, যে দুনিয়াতে দুঃখ-কষ্ট ও বিপদাপদে জীবন কাটিয়েছে। বলা হবে, একে একটু জান্নাত দেখাও। অতঃপর তাকে জান্নাত দেখানো হবে। এরপর তাকে বলা হবে, হে অমুক! তোমাকে কি কখনো দুঃখ-কষ্ট ও বিপদাপদ স্পর্শ করেছে? সে বলবে, আমি কখনো দুঃখ-কষ্টে পতিত হইনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "৫/৪৩২২। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কাফেরদের দেহ হবে অস্বাভাবিক মোটা, এমনকি তার এক একটি দাঁত হবে উহুদ পাহাড়ের চেয়েও বড়ো। আর তার দেহ হবে তার দাঁতের তুলনায় এতো বিরাট, যেমন তোমাদের কারো দাঁতের তুলনায় তার দেহ অনেক বড় হয়ে থাকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "৬/৪৩২৩। আবদুল্লাহ ইবনে কায়েস (রাঃ) বলেন, এক রাতে আমি আবূ বুরদা (রাঃ)-র নিকট উপস্থিত ছিলাম। ইত্যবসরে হারিস ইবনে উকাইস (রাঃ) আমাদের নিকট প্রবেশ করলেন। হারিস (রাঃ) সে রাতে আমাদের নিকট হাদীস বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উম্মাতের মধ্যে এমন ব্যক্তিও হবে যার শাফা‘আতে মুদার গোত্রের লোকসংখ্যার চেয়ে অধিক সংখ্যক লোক জান্নাতে প্রবেশ করবে। আবার আমার উম্মাতের মধ্যে এমন ব্যক্তিও হবে, যে জাহান্নামের জন্য এতো হৃষ্টপুষ্ট হবে যে, এমনকি তার এক কোণা ভরে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": 4324,
			"text": "৭/৪৩২৪। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নামীদের জন্য পাঠানো হবে কেবল কান্নাকাটি। তারা কাঁদতে কাঁদতে তাদের চোখের পানি শেষ হয়ে যাবে। অতঃপর তাদের চোখ দিয়ে ঝরতে থাকবে রক্তাশ্রু। ফলে তাদের মুখমন্ডলে বিরাটকায় গর্ত সদৃশ গর্ত সৃষ্টি হবে। তাতে নৌযান ছেড়ে দিলে অব্যশই তা অনায়াসে চলতে পারবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "৮/৪৩২৫। ইবনে আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ আয়াত পড়লেন (অনুবাদঃ) ‘‘হে ঈমানদারগণ! তোমরা আল্লাহকে যথার্থভাবে ভয় করো এবং তোমরা আত্মসমপর্ণকারী না হয়ে কোন অবস্থায় মরো না’’ (সূরা আল ইমরানঃ ১০২)। যাক্কুমের একটি বিন্দুও যদি পৃথিবীতে পতিত হতো তাহলে দুনিয়াবাসীর জীবন দুর্বিসহ হয়ে যেতো। আর এটাই যাদের খাদ্য হবে তাদের কী অবস্থা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "৯/৪৩২৬। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামের আগুন সিজদার চিহ্নসম্বলিত স্থান ব্যতীত আদম সন্তানের সমস্ত দেহ খেয়ে ফেলবে। আল্লাহ তা‘আলা সিজদার চিহ্নসমূহ গ্রাস করা জাহান্নামের আগুনের জন্য হারাম করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": 4327,
			"text": "১০/৪৩২৭। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘মৃত্যু’’ নামক সৃষ্টিকে এনে কিয়ামতের দিন পুলসিরাতের উপর স্থাপন করা হবে। অতঃপর ডাকা হবে, হে জান্নাতবাসীগণ! তারা ভীত-সন্ত্রস্ত হয়ে আবির্ভূত হবে, না জানি তাদের বর্তমান অবস্থান থেকে তাদেরকে বহিস্কার করা হয়। অতঃপর বলা হবে, হে জাহান্নামবাসীরা! তারা আনন্দিত ও উৎফুল্ল হয়ে আত্মপ্রকাশ করবে, হয়তো তাদের বর্তমান অবস্থান থেকে তাদেরকে মুক্তি দেয়া হবে। অতঃপর বলা হবে, তোমরা কি একে চিনো? তারা বলবে, হাঁ, এ হলো ‘‘মৃত্যু’’। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ অতঃপর তার সম্পর্কে নির্দেশ দেয়া হলে তাকে পুরসিরাতের উপর যবেহ করা হবে। অতঃপর জান্নাতাবাসী ও জাহান্নামবাসীদের বলা হবে, তোমরা উভয় দল স্ব স্ব স্থানে স্থায়ীভাবে অবস্থান করো। এখানে কখনো মৃত্যু নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": 4328,
			"text": "১/৪৩২৮। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহান আল্লাহ বলেন, আমি আমার সৎকর্মপরায়ণ বান্দাদের জন্য এমন কিছু তৈরী করে রেখেছি, যা কোন চোখ কখনও দেখেনি, কোন কান কখনো শুনেনি এবং কোন মানুষের অন্তরের কল্পনা তার ধারণাও করতে পারেনি। আবূ হুরায়রা (রাঃ) বলেন, যেসব উপকরণাদির কথা আল্লাহ তা‘আলা তোমাদের বলেছেন সেগুলোর কথা বাদ দিয়েও বরং তোমরা ইচ্ছা করলে পড়তে পারোঃ ‘‘কেউ জানে না তাদের জন্য নয়ন প্রীতিকর কী লুকিয়ে রাখা হয়েছে তাদের কৃতকর্মের পুরস্কার স্বরূপ’’ (সূরা আস-সাজদাঃ ১৭)। আবূ হুরায়রা (রাঃ) এর স্থলেمِنْ قُرَّاتِ أَعْيُنٍ পড়তেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": 4329,
			"text": "২/৪৩২৯। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জান্নাতের এক বিঘত পরিমাণ স্থান সমগ্র পৃথিবী ও তার মধ্যকার সব কিছু থেকে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "৩/৪৩৩০। সাহল ইবনে সাদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতের এক চাবুক পরিমাণ জায়গা, পৃথিবী ও তার মধ্যকার সবকিছু থেকে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "৪/৪৩৩১। মুআয ইবনে জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ জান্নাতের একশ তলা রয়েছে। এক তলা থেকে অপর তলার ব্যবধান আসমান-জমীনের মধ্যকার দূরত্বের সমান। নিশ্চয় এর শীর্ষ স্তরে রয়েছে ফিরদাওস এবং মধ্যবর্তী স্তরও ফিরদাওস। আল্লাহর আরশ ফিরদাওসের উপরে অবস্থিত। এখান থেকে জান্নাতের ঝরণাসমূহ প্রবাহিত। তোমরা যখন আল্লাহর কাছে চাইবে তখন তাঁর নিকট ফিরদাওস নামক জান্নাত প্রার্থনা করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": 4332,
			"text": "৫/৪৩৩২। উসামা ইবনে যায়েদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের বললেনঃ আছে না কি কেউ জান্নাতের জন্য কোমর বেঁধে কর্ম সম্পাদনকারী? কেননা জান্নাতের বিকল্প বা সমতুল্য কিছু নেই। কাবার প্রভুর শপথ! তার আলো ঝলমল করে বিচ্ছুরিত হয়। পুষ্পরাজি ঘ্রাণ ছড়ায়। সুরম্য অট্টালিকাসমূহ, বহমান স্রোতস্বিনী, সুমিষ্ট ফলের প্রাচুর্য, অলংকারে সজ্জিতা পরমা সুন্দরী স্ত্রী, চিরস্থায়ী বাসস্থান সবুজ শ্যামলিমায় নিয়ামতে ভরপুর, গগনচুম্বী নিরাপদ ও মনোরম বাড়িঘর। তারা বলেন, হে আল্লাহর রাসূল! আমরা এ জান্নাতের জন্য কোমর বাঁধলাম। তিনি বলেনঃ তোমরা ‘‘ইনশাআল্লাহ’’ বলো। অতঃপর তিনি জিহাদ সম্পর্কে আলোচনা করেন এবং তাতে যোগদানে উৎসাহিত করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": 4333,
			"text": "৬/৪৩৩৩। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতে প্রবেশকারী সর্বপ্রথম দলের লোকেদের চেহারা হবে পূর্ণিমা রাতের পূর্ণ চাঁদের ন্যায় উজ্জ্বল। তাদের পরবর্তী দলের চেহারা হবে আকাশের উজ্জ্বল তারকারাজির মত। জান্নাতবাসীগণ পেশাব করবে না, পায়খানাও করবে না। তাদের নাকে শ্লেষ্মা হবে না এবং থুথুও ফেলবে না। তাদের চিরুনী হবে সোনার তৈরী। তাদের শরীর থেকে নির্গত ঘাম মিশকের ন্যায় সুগন্ধময় হবে। তাদের জন্য চন্দন কাঠ ও আগরবাতি জ্বালানো থাকবে। তাদের স্ত্রীগণ হবে আয়তলোচনা হূর। তাদের চরিত্র.. বৈশিষ্ট্য হবে একই ব্যক্তির ন্যায়। তারা তাদের পিতা আদম আলাইহিস সালামের অবয়বে ষাট হাত লম্ব হবে। ৭/৪৩৩৩(১)। আবূ বাকর ইবনে আবূ শাইবা (রাঃ) আবূ মুআবিয়া-আমাশ-আবূ সালেহ-আবূ হুরায়রা (রাঃ) থেকে বর্ণিত... উমারার সূত্রে ইবনে ফুদাইল (রাঃ) বর্ণিত হাদীসের অনুরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": 4334,
			"text": "৮/৪৩৩৪। ইবনে উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কাওসার হলো জান্নাতের একটি ঝরনা। এর উভয় তীর স্বর্ণপাতে মোড়ানো। এর পানি প্রবাহিত হবে নীলকান্ত মণি ও মুক্তার উপর দিয়ে। তার মাটি কস্ত্তরীর চেয়েও সুগন্ধযুক্ত, পানি মধুর চেয়েও সুমিষ্ট এবং বরফের চেয়েও অধিক সাদা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": 4335,
			"text": "৯/৪৩৩৫। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতে একটি প্রকান্ড গাছ আছে। এর ছায়া যে কোন আরোহী শত বছর ধরে অতিক্রম করতে থাকবে, কিন্তু তা অতিক্রম করতে পারবে না। তোমরা চাইলে এ আয়াত পড়তে পারো (অর্থঃ) ‘‘সম্প্রসারিত ছায়া’’ (সূরা ওয়াকিয়াঃ ৩০)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "১০/৪৩৩৬। সাঈদ ইবনুল মুসাইয়্যাব (রাঃ) থেকে বর্ণিত। তিনি আবূ হুরায়রা (রাঃ)-র সাথে সাক্ষাত করলে তিনি বলেন, আমি আল্লাহর নিকট প্রার্থনা করছি যে, তিনি যেন আমাকে ও তোমাকে জান্নাতের বাজারে একত্র করেন। সাঈদ (রাঃ) বলেন, জান্নাতে কি বাজারও আছে? তিনি বলেন, হাঁ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে অবহিত করেছেন যে, জান্নাতবাসীরা জান্নাতে প্রবেশ করে নিজ নিজ মর্যাদা অনুসারে সেখানে স্থান পাবে। অতঃপর দুনিয়ার সময় অনুসারে এক জুমুআর দিনে তাদেরকে (তাদের প্রভুকে দেখার) অনুমতি দেয়া হবে এবং তারা তাদের মহামহিম আল্লাহর দর্শন লাভ করবে। তাদের জন্য তাঁর আরশ প্রকাশিত হবে। জান্নাতের কোন এক উদ্যানে তাদের সামনে তাদের প্রভুর (তাজাল্লীর) প্রকাশ ঘটবে। তাদের জন্য নূর, মণি-মুক্তা, পদ্মরাগমণি, যমরূদ ও সোনা-রূপা ইত্যাদির মিম্বার স্থাপন করা হবে। তাদের মধ্যকার সবচেয়ে নিম্নস্তরের জান্নাতবাসীও কস্ত্তরী ও কর্পূরের স্তূপের উপর আসন গ্রহণ করবে। তবে সেখানে কেউ হীন বা নীচ হবে না। মিম্বারে আসীন ব্যক্তিগণকে তারা তাদের চেয়ে শ্রেষ্ঠ বা উৎকৃষ্ট ভাববে না। আবূ হুরায়রা (রাঃ) বলেন, আমি জিজ্ঞাসা করলাম, ইয়া রাসূলাল্লাহ! আমরা কি আমাদের প্রভুর দর্শন লাভ করবো? তিনি বলেনঃ হাঁ। সূর্য বা পূর্ণিমার চাঁদ দেখতে তোমাদের কি কোন সন্দেহ হয়? আমরা বললাম, না। তিনি বলেনঃ ঠিক সেরূপ তোমরা তোমাদের মহামহিম প্রভুর দর্শন লাভেও তোমাদের কোন সন্দেহ থাকবে না। সেই মজলিসে উপস্থিত এমন কোন লোক থাকবে না যার সামনে মহামহিম আল্লাহ উদ্ভাসিত না হবেন। এমনকি তিনি একে একে তাদের নাম ধরে ডেকে বলবেন, হে অমুকের পুত্র অমুক! তুমি অমুক দিন এরূপ এরূপ কাজ করেছ, তা তোমার স্মরণ আছে কি? এভাবে তিনি তাকে দুনিয়ার কতক নাফরমানী ও বিদ্রোহের কথা স্মরণ করিয়ে দিবেন। সে তখন বলবে, হে আমার প্রভু! আপনি কি আমাকে ক্ষমা করেননি। এ অবস্থায় হঠাৎ তাদের উপর এক খন্ড মেঘ এসে তাদেরকে ছেয়ে ফেলবে এবং তা থেকে তদের উপর সুঘ্রাণ (বৃষ্টি) বর্ষিত হবে, যেরূপ সুঘ্রাণ তারা ইতোপূর্বে কখনো কিছুতে পায়নি। অতঃপর তিনি বলবেন, ওঠো! আমি তোমাদের সম্মানে মেহমানদারির আয়োজন করেছি, সেদিকে অগ্রসর হও এবং যা কিছু পছন্দ হয় গ্রহণ করো। তখন আমরা একটি বাজারে এসে উপস্থিত হবো যা ফেরেশতাগণ পরিবেষ্টন করে রাখবেন। সেখানে এমন সব পণ্যসামগ্রী থাকবে যা না কোন চোখ দেখেছে, না, কোন কান শুনেছে এবং কখনো অন্তুরের কল্পনা জগতে ভেসেছে। আমরা সেখানে যা চাইবো তাই তুলে দেয়া হবে। তবে ক্রয়-বিক্রয় হবে না। সেই বাজারে জান্নাতবাসীগণ পরস্পরের সাথে সাক্ষাত করবে। উচ্চ মর্যাদাসম্পন্ন জান্নাতবাসী সামনে অগ্রসর হয়ে তার চেয়ে অল্প মর্যাদাসম্পন্ন বেহশতবাসীর সাথে সাক্ষাত করবে। তবে সেখানে তাদের মধ্যে উচুঁ-নীচু বোধ থাকবে না। তিনি তার পোশাক দেখে পেরেশান হয়ে যাবেন। একথা শেষ হতে না হতেই তিনি মনে করতে থাকবেন যে, তার পরনেও পূর্বাপেক্ষা উত্তম পোশাক শোভা পাচ্ছে। আর এরূপ এজন্যই হবে যে, সেখানে কাউকে দুঃখ-কষ্ট বা দুশ্চিন্তা স্পর্শ করবে না। অতঃপর আমরা নিজেদের জায়গায় ফিরে আসবো এবং স্ব স্ব স্ত্রীর সাক্ষাত পাবো। তারা বলবে, মারহাবা স্বাগতম। কী ব্যাপার! যে আকর্ষণীয় রূপ-সৌন্দর্য নিয়ে বিচ্ছিন্ন হয়েছিলে, তদপেক্ষা উত্তম সৌন্দর্য নিয়ে ফিরে এসেছো। আমরা বলবো, আজ আমরা আমাদের মহাপ্রতাপশালী মহিমাময় প্রভুর সাথে মজলিসে বসেছিলাম। তাই আমাদের এই পরিবর্তন ঘটেছে এবং এরূপ ঘটাই ছিলো স্বাভাবিক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "১১/৪৩৩৭। আবূ উমামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহান আল্লাহ যাদের জান্নাতে প্রবেশ করাবেন তাদের প্রত্যেককেই বাহাত্তরজন স্ত্রীর সাথে বিবাহ দিবেন। তাদের মধ্যে দু’জন হবে আয়তলোচনা হূর এবং সত্তরজন হবে জাহান্নামীদের থেকে ওয়ারিসী সূত্রে প্রাপ্ত। তাদের প্রত্যেকের স্ত্রী অঙ্গ হবে অত্যন্ত কামাতুর এবং পুরুষের অঙ্গ হবে অত্যন্ত সুদৃঢ় অটল। হিশাম ইবনে খালিদ (রাঃ) বলেন, জাহান্নামীদের থেকে প্রাপ্ত স্ত্রী বুঝতে সেইসব পবিত্রা নারীদের বুঝানো হয়েছে যাদের স্বামীরা জাহান্নামী হয়েছে। কিন্তু স্ত্রীরা ঈমানদার হওয়ার কারণে জান্নাতে প্রবেশ করেছে। যেমন ফেরাউনের স্ত্রী জান্নাতী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": 4338,
			"text": "১২/৪৩৩৮। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মু’মিন ব্যক্তি জান্নাতে সন্তান কামনা করলে তার স্ত্রী গর্ভধারণ করবে এবং সন্তান প্রসব করবে এবং সন্তানটি হবে বয়সে যুবক (আবূ দাউদ ও তিরমিযি) এসবকিছু মুহূর্তের মধ্যে সম্পন্ন হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "১৩/৪৩৩৯। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি সবশেষে জাহান্নাম থেকে বের হয়ে আসবে এবং সবেশেষে জান্নাতে প্রবেশ করবে আমি তাকে অবশ্যই চিনি। এক ব্যক্তি হামাগুড়ি দিয়ে জাহান্নাম থেকে বের হয়ে আসবে। তাকে বলা হবে, তুমি যাও এবং জান্নাতে প্রবেশ করো। অতএব সে তথায় পৌঁছার পর তার মনে হবে ইতোপূর্বেই তা ভরপুর হয়ে গেছে। সে ফিরে এসে বলবে, হে প্রভু! আমি তা ভরপুর পেলাম। মহান আল্লাহর বলবেন, যাও এবং জান্নাতে প্রবেশ করো। সে পুনরায় তথায় ফিরে যাবে এবং তার মনে হবে যে, জান্নাত ইতোপূর্বেই ভরপুর হয়ে গেছে। সে ফিরে এসে বলবে, হে প্রভু! তা পরিপূর্ণ হয়ে গেছে। মহিমাময় আল্লাহ বলবেন, তুমি যাও এবং জান্নাতে প্রবেশ করো। কেননা, তোমাকে দেয়া হলো পৃথিবী পরিমাণ স্থান এবং তার দশ গুণ অথবা তোমার জন্য রয়েছে পৃথিবীর দশ গুণ। তখন সে বলবে, আপনি মালিক হয়ে আমার সাথে হাসি-ঠাট্টা করছেন। রাবী বলেন, একথা বলার পর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে হাসতে দেখলাম। এমনকি তাঁর মাড়ির দাঁত প্রকাশিত হলো। অতঃপর বলা হতো, এ ব্যক্তিই হবে মর্যাদায় সর্বনিম্ন স্তরের জান্নাতী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": 4340,
			"text": "১৪/৪৩৪০। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি তিনবার জান্নাত প্রার্থনা করলে জান্নাত বলে, ‘‘হে আল্লাহ! তাকে জান্নাতে প্রবেশ করাও’’। আবার কোন ব্যক্তি তিনবার জাহান্নাম থেকে নিস্কৃতি লাভের প্রার্থনা করলে জাহান্নাম বলে, ‘‘হে আল্লাহ! তাকে জাহান্নাম থেকে নিস্কৃতি দাও’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "১৫/৪৩৪১। আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের প্রত্যেকের জন্য দু’টি করে আবাস রয়েছে। একটি আবাস জান্নাতে এবং একটি জাহান্নামে। অতএব কোন ব্যক্তি মারা যাওয়ার পর জাহান্নামে প্রবেশ করলে তার জান্নাতের আবাস জান্নাতীরা ওয়ারিসী সূত্রে লাভ করবে। এটাই হলো আল্লাহর নিম্নোক্ত বাণীর তাৎপর্য (অনুবাদঃ ‘‘তারাই হবে ওয়ারিস’’ (সূরা মুমিনূনঃ ১০)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 242
			}
		}
	]
}