{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "১/১৭৮৩। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মু‘আয ইবনু জাবাল (রাঃ)-কে ইয়ামনে পাঠাবার প্রাক্কালে বলেনঃ নিশ্চয়ই তুমি এমন একটি সম্প্রদায়ের কাছে যাচ্ছো যারা আহলে কিতাব। তুমি সর্বপ্রথম তাদেরকে ‘‘আল্লাহ ব্যতীত কোন ইলাহ নাই এবং আমি আল্লাহর রসূল’’ এ কথার সাক্ষ্য দেয়ার আহবান জানাবে। তারা তা মেনে নিলে তুমি তাদের জানিয়ে দিবে যে, আল্লাহ্ তাদের উপর দৈনিক পাঁচ ওয়াক্ত সালাত ফরয করেছেন। তারা যদি এ কথাও মেনে নেয়, তবে তাদের আরও জানিয়ে দিবে যে, আল্লাহ্ তাদের সম্পদের উপর যাকাত ফরয করেছেন, যা তাদের ধনীদের নিকট থেকে আদায় করা হবে এবং তাদের গরীবদের মধ্যে বিতরণ করা হবে। তারা যদিও এটিও মেনে নেয় তবে তাদের উত্তম সম্পদ (গ্রহণ) থেকে নিজেদের বিরত রাখবে। তুমি মযলুমের বদদোয়াকে ভয় করো। কেননা মযলুমের আহাজারি ও আল্লাহর মাঝে কোন পর্দা (প্রতিবন্ধক) নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "১/১৭৮৪। ‘আবদুল্লাহ্ ইবনু মাস‘উদ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি তার মালের যাকাত আদায় করে না, তার মালকে কিয়ামতের দিন বিষধর সাপে পরিণত করা হবে, এমনকি তা তার গলায় পেচিয়ে দেয়া হবে। এরপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সমর্থনে আল্লাহর কিতাবের নিম্নোক্ত আয়াত আমাদের তিলাওয়াত করে শুনান (অনুবাদ) ‘‘আর আল্লাহ্ নিজ অনুগ্রহে যা তোমাদের দিয়েছেন, এতে যারা কৃপণতা করে, তাদের জন্য তা মঙ্গলজনক একথা যেন তারা মনে না করে...’’ (৩ঃ ১৮০)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "২/১৭৮৫। আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন উট, ছাগল ও গরুর মালিক যদি এর যাকাত আদায় না করে, তবে এগুলো কিয়ামতের দিন বিরাটকায় ও মোটাতাজা হয়ে উপস্থিত হবে এবং মালিককে এদের শিং ও ক্ষুর দিয়ে আঘাত করতে থাকবে। শেষটির পালা শেষ হলে আবার প্রথমটি থেকে শুরু হবে এবং এভাবেই চলতে থাকবে, যে পর্যন্ত না বিচারকার্য শেষ হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "৩/১৭৮৬। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে উটের যাকাত দেয়া হয়নি, তা কিয়ামতের দিন তার মালিককে তার ক্ষুর দিয়ে মাড়াতে থাকবে। তদ্রূপ গরু ও ছাগল এসে এদের ক্ষুর ও শিং দিয়ে এদের মালিককে আঘাত করতে থাকবে। তার সঞ্চিত সম্পদও বিষধর সাপে পরিণত হয়ে তার মালিকের সামনে হাযির হবে। মালিক দু’বার তা দেখে পালাবে, কিন্তু সে আবার মালিকের সামনে এসে দাঁড়াবে। তখন মালিক পালাতে চেষ্টা করবে এবং বলবে, তোমার সাথে আমার কী সম্পর্ক? সে বলবে, আমি তোমার গচ্ছিত সম্পদ, আমি তোমার রক্ষিত ধন। মালিক তার হাত দিয়ে সাপ থেকে আত্মরক্ষার চেষ্টা করলে সে তার হাতটি গিলে ফেলবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "১/১৭৮৭। ‘উমার ইবনুল খাত্তাব (রাঃ)-এর মুক্তদাস খালিদ ইবনু আসলাম (রহ.) থেকে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ)-এর সাথে বের হলাম। এক বেদুঈন এসে তাঁকে আল্লাহর বাণী সম্পর্কে জিজ্ঞেস করলোঃ ‘‘যারা সোনা-রূপা পুঞ্জীভূত করে এবং তা আল্লাহর পথে ব্যয় করে না...’’ (সূরা তওবাঃ ৩৪)। ইবনু ‘উমার (রাঃ) তাকে বলেন, যে ব্যক্তি সোনা-রূপা পুঞ্জীভূত করে রাখে, অথচ এর যাকাত আদায় করে না, তার জন্য ধ্বংস অনিবার্য। এ অবস্থা ছিল যাকাতের বিধান নাযিল হওয়ার আগের। পরবর্তীতে যাকাতের বিধান নাযিল হলে যাকাতকেই আল্লাহ মালের পবিত্রতাকারী সাব্যস্ত করেন। অতঃপর ইবনু ‘উমার (রাঃ) লোকটির দিকে তাকিয়ে বলেন, এ ব্যাপারে আমার পরোয়া নেই যে, উহুদ পাহাড় পরিমাণ সোনাও যদি আমার হাতে আসে, তবে আমি তার পরিমাণ নিরূপণ করে এর যাকাত পরিশোধ করবো এবং মহান আল্লাহর হুকুম পালনে তা ব্যয় করবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "২/১৭৮৮। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন তুমি তোমার মালের যাকাত আদায় করলে, তখন তুমি তোমার দায়িত্ব সম্পন্ন করে ফেললে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "৩/১৭৮৯। ফাতেমাহ বিনত কায়েস (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেনঃ যাকাত ব্যতীত সম্পদের উপর অন্য কোন দাবি নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Munqar"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "১/১৭৯০। ‘আলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ঘোড়া ও গোলামের যাকাত থেকে তোমাদের নিষ্কৃতি দিলাম। তবে তোমরা প্রতি চল্লিশ দিরহামে এক দিরহাম (যাকাত) দিবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "২/১৭৯১। ইবনু ‘উমার ও ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি বিশ দিনার বা তার চেয়ে কিছু বেশি হলে অর্ধ দিনার এবং চল্লিশ দিনারে এক দিনার (যাকাত) গ্রহণ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "১/১৭৯২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ বছর পূর্ণ না হওয়া পর্যন্ত কোন মালের যাকাত নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "১/১৭৯৩। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেনঃ পাঁচ ‘ওয়াসাক’-এর কম পরিমাণ খেজুরে, পাঁচ ‘উকিয়া’-এর কম পরিমাণ মুদ্রায় এবং পাঁচের কম সংখ্যক উটে যাকাত নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "২/১৭৯৪। জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উটের সংখ্যা পাঁচের কম হলে তাতে যাকাত নেই, পাঁচ ‘উকিয়া’-এর কম মুদ্রায় যাকাত নেই এবং পাঁচ ওয়াসাক-এর কম ফসলে যাকাত নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "১/১৭৯৫। ‘আলী ইবনু আবূ ত্বলিব (রাঃ) থেকে বর্ণিত। ‘আব্বাস (রাঃ) তার মালের বর্ষপূর্তির পূর্বে যাকাত প্রদানের ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করেন। তিনি তাকে এ ব্যাপারে অনুমতি দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "১/১৭৯৬। ‘আবদুল্লাহ্ ইবনু আবূ আওফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, কোন ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট তার মালের যাকাত নিয়ে উপস্থিত হলে তিনি তার জন্য দু‘আ করতেন। আমি আমার মালের যাকাত নিয়ে তাঁর নিকট উপস্থিত হলে তিনি দু‘আ করলেনঃ ‘‘হে আল্লাহ্! আপনি আবূ আওফার পরিবারের প্রতি দয়া করুন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "২/১৭৯৭। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যখন যাকাত দিবে তখন তার সওয়াবের কথা ভুলে যেও না এবং এ দু‘আ করোঃ ‘‘হে আল্লাহ্! আপনি এই যাকাতকে তওবা কবুলের উসীলা বানিয়ে দিন এবং একে ঋণ পরিশোধের (বা জরিমানার) পর্যায়ভুক্ত না করুন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "১/১৭৯৮। ‘আবদুল্লাহ্ বিন ‘উমার (রাঃ) থেকে বর্ণিত। ইবনু শিহাব (রহ.) বলেন, সালেম (রহ.) আমাকে একটি পত্র পড়ে শোনান, যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ইনতিকালের পূর্বে যাকাত সম্পর্কে লিখেছিলেন। আমি তাতে যে তথ্য পাই তা হলোঃ পাঁচ উটের যাকাত একটি বকরি, দশ উটে দু’টি বকরি, পনের উটে তিনটি বকরি, বিশ উটে চারটি বকরি এবং পচিশ থেকে পঁয়ত্রিশ উটে একটি ‘‘বিনতে মাখাদ’’ (পূর্ণ এক বছর বয়সের উষ্ট্রী), আর ‘‘বিনতে মাখাদ না পাওয়া গেলে একটি ইবনু লাবূন (পূর্ণ দু’ বছর বয়সের উট)। উটের সংখ্যা পঁয়ত্রিশ থেকে একটি বেশি হলে পঁয়তাল্লিশ সংখ্যক পর্যন্ত একটি ‘বিনতে লাবূন’। উটের সংখ্যা পঁয়তাল্লিশ-এর একটি বেশি হলে ষাট সংখ্যক পর্যন্ত একটি ‘হিক্কাহ’ (পূর্ণ তিন বছর বয়সের উষ্ট্রী)। উটের সংখ্যা ষাট-এর একটি বেশি হলে পঁচাত্তর সংখ্যক পর্যন্ত একটি ‘‘জাযাআহ’’ (পূর্ণ চার বছর বয়সের উষ্ট্রি)। উটের সংখ্যা পঁচাত্তরের চেয়ে একটি বেশি হলে, নব্বই সংখ্যক পর্যন্ত দু’টি ‘‘বিনতে লাবূন’’। উটের সংখ্যা নব্বই থেকে একটি বেশি হলে এক শত বিশ সংখ্যক পর্যন্ত দু’টি হিক্কাহ্ যাকাত স্বরূপ দিতে হবে। এক শত বিশের অধিক প্রতি পঞ্চশ উটে একটি হিক্কাহ এবং প্রতি চল্লিশ উটে একটি ‘বিনতে লাবূন’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "২/১৭৯৯। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উটের সংখ্যা পাঁচ-এর কম হলে কোন যাকাত নাই। পাঁচ থেকে নয় পর্যন্ত উটে একটি বকরি, দশ থেকে চৌদ্দ পর্যন্ত উটে দু’টি বকরি, পনের থেকে উনিশ পর্যন্ত উটে তিনটি বকরি, বিশ থেকে চবিবশ পর্যন্ত উটে চারটি বকরি, পঁচিশ থেকে পঁয়ত্রিশ পর্যন্ত উটে একটি বিনতে মাখাদ। যদি বিনতে মাখাদ না পাওয়া যায়, তবে একটি ইবনু লাবূন আদায় করতে হবে। উটের সংখ্যা বেড়ে পঁয়তাল্লিশ পর্যন্ত পৌঁছলে এতে একটি বিনতে লাবূন। উটের সংখ্যা বেড়ে পঁচাত্তর পৌঁছলে এতে দু’টি বিনতে লাবূন। উটের সংখ্যা বেড়ে এক শত বিশ পর্যন্ত পৌঁছলে এতে দু’টি হিক্কাহ। উটের সংখ্যা বেড়ে একশত বিশের অধিক হলে প্রতি পঞ্চাশ উটে একটি হিক্কাহ এবং প্রতি চল্লিশ উটে একটি বিনতে লাবূন আদায় করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "১/১৮০০। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আবূ বাকর (রাঃ) তাকে লিখে পাঠানঃ বিসমিল্লাহির রহমানির রাহীম। এটি যাকাতের বিধান, যা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর নির্দেশে মুসলিমদের জন্য ফরয করেছেন। উটের যত সংখ্যকে (যাকাত বাবদ) বকরি প্রদান করতে হয়, তারপর থেকে তার নিকট একটি জাযাআহ যাকাত বাবদ প্রদানের সম-সংখ্যক উট আছে, কিন্তু জাযাআহ নাই, তবে হিক্কাহ্ আছে, তার নিকট থেকে হিক্কাহ্ গ্রহণ করা হবে, উপরন্তু সহজলভ্য হলে তার থেকে দু’টি বকরি অথবা বিশ দিরহাম নেয়া হবে। যার উটের সংখ্যা একটি হিক্কাহ্ প্রদানের পর্যায়ে পৌঁছেছে, কিন্তু তার নিকট হিক্কাহ্ নাই, তবে বিনতে লাবূন আছে, তার নিকট থেকে (যাকাত স্বরূপ) বিনতে লাবূন গ্রহণ করা হবে, উপরন্তু তার থেকে সহজলভ্য হলে দু’টি বকরী অথবা বিশ দিরহাম আদায় করা হবে। যার উটের সংখ্যা একটি বিনতে লাবূন প্রদানের পর্যায়ে পৌঁছেছে, কিন্তু তার নিকট বিনতে লাবূন নাই, তবে হিক্কাহ্ আছে, তার নিকট থেকে হিক্কাহ্ গ্রহণ করা হবে এবং যাকাত উসূলকারী তাকে দু’টি বকরি অথবা বিশ দিরহাম প্রদান করবে। যার যাকাত বিনতে লাবূন প্রদানের পর্যায়ে পৌঁছেছে কিন্তু তার নিকট বিনতে লাবূন নাই, তবে বিনতে মাখাদ আছে, তার থেকে বিনতে মাখাদ গ্রহণ করা হবে, উপরন্তু তার থেকে দু’টি বকরি অথবা বিশ দিরহাম উসূল করা হবে। যার যাকাত বিনতে মাখাদ প্রদানের পর্যায়ে পৌঁছেছে, কিন্তু তার নিকট বিনতে মাখাদ নাই, তবে বিনতে লাবূন আছে, তার থেকে বিনতে লাবূন গ্রহণ করা হবে এবং যাকাত উসূলকারী তাকে দু’টি বকরি অথবা বিশ দিরহাম ফেরত দিবে। বিনতে মাখাদ ফরয হওয়ার ক্ষেত্রে তা না থাকলে এবং বিনতে লাবূন থাকলে তাই গ্রহণ করা হবে এবং যাকাতদাতাকে অতিরিক্ত কিছু দিতে হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "১/১৮০১। সুয়াইদ ইবনু গাফালা (রাঃ) থেকে বর্ণিত। যাকাত আদায়কারী কর্মচারি আমাদের নিকট আসলে আমি তার হাত ধরে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এই নির্দেশ পাঠ করে শুনালামঃ ‘‘যাকাতের ভয়ে বিচ্ছিন্ন মালকেক একত্র করা এবং একত্রিত মালকে বিচ্ছিন্ন করা যাবে না’’। ইতোমধ্যে এক ব্যক্তি তার একটি বিরাট ও মোটাতাজা উষ্ট্রী নিয়ে আসলে তিনি তা গ্রহণ করতে অস্বীকার করেন। এরপর লোকটি আগেরটির চাইতে কম হৃষ্টপুষ্ট উট নিয়ে আসলে তিনি তা গ্রহণ করেন এবং বলেনঃ কোন্ মাটি আমাকে বহন করবে এবং কোন্ আকাশ আমাকে ছায়া দান করবে, যখন আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কোন মুসলিম ব্যক্তির উৎকৃষ্ট উট নিয়ে হাজির হবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "২/১৮০২। জারীর ইবনু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যাকাত আদায়কারী যেন সন্তুষ্ট চিত্তে ফিরে আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "১/১৮০৩। মুআয ইবনু জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ইয়ামন পাঠালেন এবং আমাকে নির্দেশ দেন যে, আমি যেন প্রতি চল্লিশ গরুতে পূর্ণ দু’ বছর বয়সের একটি মাদী বাছুর এবং প্রতি ত্রিশ গরুতে একটি নর বা মাদী বাছুর গ্রহণ করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "২/১৮০৪। ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রতি ত্রিশ গরুতে পূর্ণ এক বছর বয়সের একটি নর বা মাদী এবং প্রতি চল্লিশটিতে পূর্ণ দু’ বছর বয়সের একটি মাদী বাছুর (যাকাত বাবদ আদায় করতে হবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "১/১৮০৫। ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। অধস্তন রাবী ইবনু শিহাব (রহ.) বলেন, সালিম (রহ.) রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক তাঁর ইন্তিকালের আগে যাকাত সম্পর্কে লিখিত পত্র আমাকে পড়ে শুনান। এতে আমি দেখতে পেলাম যে, চল্লিশ থেকে এক শত বিশ পর্যন্ত বকরির যাকাত একটি বকরি। এক শত একুশ থেকে দু’ শত পর্যন্ত বকরির যাকাত দু’টি বকরি। দু’ শত এক থেকে তিন শত পর্যন্ত বকরির যাকাত তিনটি বকরি। বকরীর সংখ্যা এর চেয়ে অধিক হলে প্রতি এক শত বকরীতে একটি বকরী। আমি উক্ত পত্রে আরো দেখতে পেলাম যে, বিচ্ছিন্নকে একত্র এবং একত্রকে বিচ্ছিন্ন করা যাবে না। আমি এতে আরও দেখতে পেলাম যে, পাঁঠা, অতি বৃদ্ধ ও ত্রুটিযুক্ত পশু যাকাত বাবদ গ্রহণ করা যাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "২/১৮০৬। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের পশুর যাকাত তাদের পানি পানের স্থান থেকে গ্রহণ করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "৩/১৮০৭। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ চল্লিশ থেকে এক শত বিশ পর্যন্ত বকরীর যাকাত একটি বকরী। এক শত একুশ থেকে দু’ শত পর্যন্ত বকরীর যাকাত দু’টি বকরী এবং দু’ শত এক থেকে তিন শত পর্যন্ত বকরীর যাকাত তিনটি বকরী। বকরীর সংখ্যা তার অধিক হলে প্রতি এক শত বকরীতে একটি বকরী যাকাত ধার্য হবে। যাকাত ফরয হওয়ার আশঙ্কায় একত্রকে বিচ্ছিন্ন এবং বিচ্ছিন্নকে একত্র করা যাবে না। শরীকানা মালের যাকাত আদায়ের বেলায় কারো অংশ থেকে অতিরিক্ত গ্রহণ করা হলে, সে অপর শরীকের অংশ থেকে তা ফেরত পাবে। যাকাত আদায়কারীকে অতি বৃদ্ধ, ত্রুটিযুক্ত বা অন্ধ ও নর পশু দেয়া যাবে না, তবে যাকাত আদায়কারী ইচ্ছা করলে তা গ্রহণ করতে পারে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "১/১৮০৮। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যাকাত আদায়ে বা প্রদানে অন্যায় পন্থা অবলম্বনকারী যাকাত বারণকারীর সমতুল্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "২/১৮০৯। রাফি‘ ইবনু খাদীজ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ ন্যায়নিষ্ঠার সাথে যাকাত আদায়কারী আল্লাহর পথে জিহাদকারীর সমতুল্য যাবত না সে নিজ বাড়িতে ফিরে আসে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "৩/১৮১০। ‘আবদুল্লাহ্ ইবনু উনাইস (রাঃ) থেকে বর্ণিত। তিনি এবং ‘উমার ইবনুল খাত্তাব (রাঃ) একদিন যাকাত সম্পর্কে আলোচনা করেন। ‘উমার (রাঃ) বলেন, তুমি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যাকাতের মাল আত্মসাৎ সম্পর্কে আলোচনা প্রসঙ্গে বলতে শুনোনিঃ কেউ যদি যাকাতের একটি উট বা একটি ছাগল আত্মসাৎ করে, তবে তাকে ক্বিয়ামতের দিন তা বহনরত অবস্থায় হাযির করা হবে। রাবী বলেন, ‘আবদুল্লাহ ইবনু উনাইস (রাঃ) বললেন, হ্যাঁ শুনেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "৪/১৮১১। ইমরানের আযাদকৃত গোলাম আতা (রহ.) থেকে বর্ণিত। ইমরান ইবনুল হুসাইন (রাঃ)-কে যাকাত আদায়কারী হিসেবে নিয়োগ করা হলো। তিনি ফিরে আসলে জিজ্ঞেস করা হলো, যাকাতের মাল কোথায়? তিনি বলেন, মাল নিয়ে আসার জন্য কি আপনি আমাকে পাঠিয়েছিলেন? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে আমরা যেখান থেকে যাকাত আদায় করার সেখান থেকেই যাকাত আদায় করতাম এবং যেখানে তা ব্যয় করার সেখানেই তা ব্যয় করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "১/১৮১২। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের উপর তাদের গোলাম ও ঘোড়ার জন্য যাকাত ধার্য হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "২/১৮১৩। ‘আলী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি ঘোড়া ও গোলামের যাকাত থেকে তোমাদের অব্যাহতি দিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "১/১৮১৪। মু‘আয ইবনু জাবাল (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ইয়ামনে পাঠান এবং বলেনঃ ফসলের যাকাত বাবদ ফসল, ছাগলের যাকাত বাবদ ছাগল, উটের যাকাত বাবদ উট এবং গরুর যাকাত বাবদ গরু আদায় করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "২/১৮১৫। ‘আমর ইবনু শুয়াইব (রহ.) থেকে পর্যায়ক্রমে তার পিতা ও তার দাদার সূত্রে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই পাঁচটি ফসলের উপর যাকাত আরোপ করেছেনঃ যব, গম, খেজুর, কিশমিশ ও ভুট্টা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "১/১৮১৬। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বৃষ্টির পানি অথবা ঝর্ণার পানি সিক্ত জমিনের উৎপন্ন ফসলের এক-দশমাংশ এবং পানি সেচ দ্বারা সিক্ত জমিনের উৎপন্ন ফসলের এক-বিংশতি অংশ যাকাত দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "২/১৮১৭। সালিম (রহ.) থেকে তার পিতার সূত্রে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ বৃষ্টি, নদী ও ঝর্ণার পানিতে সিক্ত জমিনের ফসলের উশর (এক-দশমাংশ) এবং পানিসেচ দ্বারা সিক্ত জমিনের উৎপন্ন ফসলে অর্ধ-উশর (বিশ ভাগের এক ভাগ) যাকাত দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "৩/১৮১৮। মু‘আয ইবনু জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ইয়ামনে পাঠান এবং নির্দেশ দেন যে, আমি যেন বৃষ্টি এবং ঝর্ণার পানির সাহায্যে উৎপন্ন ফসলে উশর (এক-দশমাংশ) এবং সেচ ব্যবস্থার মাধ্যমে সিক্ত যমীনের ফসলের অর্ধ-উশর যাকাত হিসেবে গ্রহণ করি। ইয়াহ্ইয়া ইবনু আদম (রহ.) এ হাদীসে উল্লিখিত কয়েকটি শব্দের ব্যাখ্যায় বলেন, যে যমীন বৃষ্টির পানিতে সিক্ত হয়। যে যমীনে বিশেষভাবে মেঘ ও বৃষ্টির পানির সাহায্যে ফসল উৎপাদন করা হয়। বৃষ্টির পানি ব্যতীত অন্য কোন পানি তাতে পৌঁছে না। আঙ্গুর বা অনুরূপ শিকড় জাতীয় গাছ, যার শিকড় ভূগর্ভস্থ পানি পর্যন্ত পৌঁছে যায় এবং পাঁচ-ছয় বছর পর্যন্ত বাঁচার জন্য তাতে পানি সেচের প্রয়োজন হয় না।البعل والسىل হলো মাঠের পানি যা ঢলের রূপ ধারণ করে।الغىل হল ঢলের পানির চেয়ে পরিমাণে কম বেগে আসা পানি। ইরওয়াহ।[1]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "১/১৮১৯। আত্তাব ইবনু উসাইদ (বা উসাইদ) (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকেদের আঙ্গুর ও অন্যান্য ফলের পরিমাণ অনুমান করে নির্ধারণের জন্য লোক পাঠাতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "২/১৮২০। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার জয় করে তথাকার (ইহূদী) আদিবাসীদের সাথে এ চুক্তি করেন যে, খায়বারের ভূমি ও সোনা-রূপা তাঁর [রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] সরকারের মালিকানাভুক্ত থাকবে। খায়বারবাসীগণ তাঁকে বললো, আমরা জমাজমি (কৃষিকার্য) সম্পর্কে অধিক জ্ঞাত। অতএব আপনি ভূমি (চাষাবাদের জন্য) এ শর্তে আমাদেরকে ছেড়ে দিন যে, ফল ও ফসলের অর্ধেক আমাদের এবং অর্ধেক আপনাদের। রাবী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উক্ত শর্তে খায়বারের ভূমি তাদেরকে (চাষাবাদের জন্য) দিলেন। খেজুর গাছের ফল কাটার সময় হলে তিনি ‘আবদুল্লাহ্ ইবনু রাওয়াহা (রাঃ)-কে তাদের নিকট পাঠান। তিনি গিয়ে অনুমানে ফলের পরিমাণ নিরূপণ করলেন। মদ্বীনাবাসীর নিকট এ অনুমানের পরিভাষা হলো ‘খারস’। তিনি বলেন, বাগানে এই এই পরিমাণ ফল হবে। ইহূদীরা বললো, হে ইবনু রাওয়াহা! আপনি আমাদের উপর অধিক ধার্য করেছেন। ইবনু রাওয়াহা (রাঃ) বলেন, আমি তো অনুমান করছি এবং যা ধার্য করছি তার অর্ধেকই তো তোমাদের দিবো। তারা বললো, এটাই সঠিক (ইনসাফ) এবং এ কারণেই আসমান-যমীন প্রতিষ্ঠিত আছে। অতঃপর তারা বললো, আপনি যা বলেছেন, আমরা তাতে সম্মত হলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "১/১৮২৩। আবূ সাইয়ারা আল-মুত্তাকী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! আমার মধু আছে। তিনি বলেনঃ এক-দশমাংশ (উশর) আদায় করো। আমি বললাম, হে আল্লাহর রসূল! ভূমিটি আমাকে খাস জমি হিসাবে দান করুন। অতএব তিনি আমাকে তা খাস হিসাবে দান করলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "২/১৮২৪। ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মধুর এক-দশমাংশ (উশর) আদায় করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "১/১৮২৫। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সদকাতুল ফিতর (ফিতরা) বাবদ এক সা খেজুর অথবা এক সা‘ যব দান করার নির্দেশ দিয়েছেন। ‘আবদুল্লাহ্ (রাঃ) বলেন, পরবর্তীতে লোকেরা দু’ মুদ্দ গমকে এক সা‘র সমান ধরে নিয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "২/১৮২৬। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রত্যেক স্বাধীন-পরাধীন (দাস) এবং পুরুষ ও নারীর উপর সদাকাতুল ফিত্র হিসাবে এক সা‘ যব অথবা এক সা‘ খেজুর নির্ধারণ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "৩/১৮২৭। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রোযাদারের অনর্থক কথাবার্তা ও অশালীন আচরণের কাফ্ফারাস্বরূপ এবং গরীব-মিসকীনদের আহারের সংস্থান করার জন্য সদাকাতুল ফিতর (ফিতরা) নির্ধারণ করেছেন। যে ব্যক্তি ঈদের সালাতের পূর্বে তা পরিশোধ করে (আল্লাহর নিকট) তা গ্রহণীয় দান। আর যে ব্যক্তি ঈদের সালাতের পর তা পরিশোধ করে, তাও দানসমূহের অন্তর্ভুক্ত একটি দান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "৪/১৮২৮। কায়েস ইবনু সা‘দ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাকাতের বিধান নাযিল হওয়ার পূর্বে আমাদেরকে সদাকাতুল ফিতর আদায় করার নির্দেশ দেন। পরে যাকাতের হুকুম নাযিল হলে এ ব্যাপারে আমাদেরকে নির্দেশও দেননি এবং নিষেধও করেননি। তবে আমরা পূর্বোক্ত নির্দেশ পালন করে যাচ্ছি।",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "৫/১৮২৯। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মাঝে বর্তমান থাকা অবস্থায় আমরা সাদকাতুল ফিতর বাবদ এক সা‘ খাদ্য (গম) বা এক সা‘ খেজুর বা এক সা‘ যব বা এক সা‘ পনির অথবা এক সা‘ কিসমিস দান করতাম। আমরা অব্যাহতভাবে এ নিয়মই পালন করে আসছিলাম। অবশেষে মুয়াবিয়া (রাঃ) মাদ্বীনাহ্য় আমাদের নিকট আসেন এবং লোকেদের সাথে আলোচনা প্রসঙ্গে বলেন, আমি শাম দেশের উত্তম গমের দু’ মুদ্দ পরিমাণকে এখানকার এক সা‘র সমান মনে করি। তখন থেকে লোকেরা এ কথাটিকেই গ্রহণ করে নিলো। আবূ সাঈদ (রাঃ) বলেন, আমি কিন্তু সারা জীবন ঐ হিসাবেই সদকাতুল ফিতর পরিশোধ করে যাবো, যে হিসাবে আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তা পরিশোধ করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "৬/১৮৩০। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুআযযিন সা‘দ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সদাকাতুল ফিতর হিসাবে এক সা‘ খেজুর বা এক সা‘ যব বা এক সা‘ সাদা যব আদায় করার নির্দেশ দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "১/১৮৩১। আলা ইবনুল হাদরামী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বাহরাইন বা হাজার এলাকায় পাঠান। আমি দু’ সহোদর মুসলিম ও মুশরিক ভাইয়ের শরীকানা বাগানে পৌঁছে মুসলিম ভাইয়ের নিকট থেকে উশর এবং মুশরিক ভাইয়ের নিকট থেকে খাজনা আদায় করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "১/১৮৩২। আবূ সাঈদ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ষাট সা' এ এক ওয়াসক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "২/১৮৩৩। জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ষাট সা-এ এক ওয়াসক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "১/১৮৩৪। ‘আবদুল্লাহ্ (রাঃ)-এর স্ত্রী যয়নব থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট জিজ্ঞেস করলাম, আমার যাকাত আমার স্বামী ও আমার তত্ত্বাবধানাধীন ইয়াতীমদের ভরণ-পোষণের জন্য দান করলে তা যথেষ্ট হবে কি? ১/১৮৩৪ (১) হাসান বিন মুহাম্মাদ বিন সাববাহ-আবূ মু‘আবিয়াহ, আ‘মাশ-শাক্বীক্ব- আমর বিন হারিস-যায়নাবের বোন (যায়নাব হলেন আব্দুল্লাহর স্ত্রী) তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণনা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "২/১৮৩৫। উম্মু সালামাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে দান-খয়রাত করার নির্দেশ দিলেন। ‘আবদুল্লাহ্ (রাঃ)-এর স্ত্রী যয়নব (রাঃ) বললেন, আমার দরিদ্র স্বামী এবং আমার ভাইয়ের কয়েকটি ইয়াতীম সন্তান রয়েছে। আমি সব সময় তাদের জন্য আমার এই এই পরিমাণ সম্পদ ব্যয় করে আসছি। তাদেরকে আমার যাকাত দেয়া যাবে কি? তিনি বলেনঃ হ্যাঁ। রাবী বলেন, যয়নব (রাঃ) কুটিরশিল্প উৎপাদন করে উপার্জন করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "১/১৮৩৬। যুবাইর (রাঃ) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যদি রশি নিয়ে পাহাড়ে গিয়ে এক বোঝা কাঠ সংগ্রহ করে তা নিজে পিঠে বহন করে নিয়ে এসে বিক্রয় ক’রে তার মূল্য দ্বারা সামর্থ্যবান হয়, তবে তা তার জন্য লোকের কাছে হাত পেতে বেড়ানোর চেয়ে অবশ্যই উত্তম। লোকেরা তাকে দিতেও পারে, নাও দিতে পারে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "২/১৮৩৭। সাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কে আমার একটি কথা কবুল করবে, তাহলে আমি তার জান্নাতের যামিন হবো। আমি বললাম, আমি। তিনি বললেনঃ তুমি লোকেদের নিকট কিছু প্রার্থনা করবে না। রাবী বলেন, সাওবান (রাঃ)-এর চাবুক আরোহিত অবস্থায় নিচে পড়ে যেতো, কিন্তু তিনি কাউকে বলতেন না, এটি আমাকে তুলে দাও। তিনি বাহন থেকে নেমে তা তুলে নিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "১/১৮৩৮। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি নিজের সম্পদ বৃদ্ধির লক্ষ্যে মানুষের মাল চেয়ে বেড়ায়, সে মূলত জাহান্নামের জ্বলন্ত অঙ্গার চেয়ে বেড়ায়। অতএব সে তা কম সংগ্রহ করুক বা বেশি সংগ্রহ করুক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "২/১৮৩৯। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সচ্ছল ও সুস্থ-সবল ব্যক্তির জন্য যাকাত গ্রহণ করা হালাল নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "৩/১৮৪০। ‘আবদুল্লাহ্ ইবনু মাস‘উদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার স্বনির্ভর থাকার মত সম্পদ থাকা সত্ত্বেও (অন্যের কাছে কিছু) চায়, সে কিয়ামতের দিন আহত মুখমুন্ডলসহ হাযির হবে। জিজ্ঞেস করা হলো, হে আল্লাহর রসূল! স্বচ্ছলতার সীমা কতটুকু? তিনি বলেনঃ পঞ্চাশ দিরহাম অথবা তার সমমূল্যের সোনা। এক ব্যক্তি সুফ্ইয়ানকে বললো, শু’বাহ তো হাকীম ইবনু জুবাইরের সূত্রে হাদীস বর্ণনা করেন না। তখন সুফ্ইয়ান বললেন, আমার নিকট এ হাদীস যায়দ (রহ.) মুহাম্মাদ ইবনু ‘আবদুর রহমানের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "১/১৮৪১। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ স্বচ্ছল ব্যক্তির জন্য যাকাত গ্রহণ করা হালাল নয়। তবে পাঁচজন ধনী ব্যক্তির জন্য তা হালালঃ যাকাত আদায়কারী কর্মচারী (বেতন বাবদ), আল্লাহর পথে জিহাদরত ব্যক্তি, যে ব্যক্তি তার নিজস্ব মাল দ্বারা যাকাতের মাল ক্রয় করে, কোন গরীব ব্যক্তি তার প্রাপ্ত যাকাত কোন স্বচ্ছল ব্যক্তিকে উপহাস্বরূপ দিলে এবং ঋণগ্রস্ত ব্যক্তি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "১/১৮৪২। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ যদি কোন পবিত্র মাল দান করে, আর আল্লাহ্ পবিত্র মাল ছাড়া অন্য কিছু গ্রহণ করেন না, তবে দয়াময় আল্লাহ্ তা তাঁর ডান হাতে গ্রহণ করেন, যদিও তা একটি খেজুর হয়। আল্লাহর হাতে তা বৃদ্ধিপ্রাপ্ত হয়ে পাহাড়ের চেয়েও বড় হয়ে ওঠে। আল্লাহ্ তা সে ব্যক্তির জন্য বৃদ্ধি করতে থাকেন, যেমন তোমাদের কেউ ঘোড়া অথবা উটের বাচ্চাকে লালন-পালন করে বড় করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "২/১৮৪৩। আদী ইবনু হাতেম (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের সাথেই তোমাদের রব কোন দোভাষীর মধ্যস্থতা ছাড়াই কথা বলবেন। সে তার সামনের দিকে তাকিয়ে কেবল আগুনই দেখতে পাবে। সে তার ডান দিকে তাকিয়ে কেবল তার পূর্বকৃত কার্যকলাপই দেখতে পাবে। সে তার বাম দিকে তাকিয়ে কেবল তার পূর্বকৃত কার্যকলাপই দেখবে। অতএব তোমাদের কেউ যদি আগুন থেকে বাঁচতে চায়, সে যেন এক টুকরা খেজুর দান করে হলেও তাই করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "৩/১৮৪৪। সালমান ইবনু আমের আদ-দাব্বী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (অনাত্মীয়) গরীব-মিসকীনকে যাকাত দান করলে তা যাকাতই (যাকাতের সওয়াব পাওয়া যায়)। আর আত্মীয়-স্বজনকে যাকাত দিলে দ্বিগুণ (যাকাতের সওয়াব এবং আত্মীয়তা সম্পর্ক রক্ষার সওয়াব) হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		}
	]
}