{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"9": "The Chapters on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "১/১৮৪৫। ‘আলক্বামাহ ইবনু কায়েস (রহ.) থেকে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ্ ইবনু মাস‘উদ (রাঃ)-এর সাথে মিনায় উপস্থিত ছিলাম। ‘উসমান (রাঃ) এসে তাঁর সাথে একান্তে কথা বলেন। আমিও তার নিকটেই বসলাম। ‘উসমান (রাঃ) তাঁকে বলেন, আমি কি তোমার সাথে এক কুমারী মেয়ের বিবাহ দিবো, যে তোমার অতীত যৌবনের কথা স্মরণ করিয়ে দিবে? ‘আবদুল্লাহ (রাঃ) যখন দেখলেন যে, তার উদ্দেশ্য কেবল বিবাহ করার উৎসাহ প্রদান করা, তখন তিনি আমাকে হাতের ইশারায় ডাকলেন। আমি তার নিকটে গেলাম এবং তিনি তখন বলছিলেন, তুমি যদি এ কথায় রাযী হয়ে যেতে। কেননা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে যুব সম্প্রদায়! তোমাদের মধ্যে যার বিবাহ করার সামর্থ্য আছে, সে যেন বিবাহ করে। কেননা তা দৃষ্টিশক্তিকে সংযতকারী এবং লজ্জাস্থানের হেফাজতকারী। আর যার এ সামর্থ্য নেই, সে যেন রোযা রাখে। কেননা এটি তার জন্য জৈবিক উত্তেজনা প্রশমনকারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "২/১৮৪৬। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিবাহ করা আমার সুন্নাত। যে ব্যক্তি আমার সুন্নাত মোতাবেক কাজ করলো না সে আমার নয়। তোমরা বিবাহ করো, কেননা আমি তোমাদের সংখ্যাধিক্য নিয়ে অন্যান্য উম্মাতের সামনে গর্ব করবো। অতএব যার সামর্থ্য আছে সে যেন বিবাহ করে এবং যার সামর্থ্য নেই সে যেন রোযা রাখে। কারণ রোযা তার জন্য জৈবিক উত্তেজনা প্রশমনকারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "৩/১৮৪৭। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’জনের পারস্পরিক ভালোবাসা স্থাপনের জন্য বিবাহের বিকল্প নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "১/১৮৪৮। সা‘দ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উসমান ইবনু মাযঊন (রাঃ)-এর স্ত্রী সংসর্গ ত্যাগ করার প্রস্তাব প্রত্যাখ্যান করেন। তিনি তাকে অনুমতি দিলে আমরা অবশ্যই নপুংসক হয়ে যেতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "২/১৮৪৯। সামুরা (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্ত্রী সংসর্গ ত্যাগ করতে নিষেধ করেছেন। যায়দ ইবনু আখ্যামের বর্ণনায় আরো আছেঃ ক্বাতাদাহ (রহ.) এ আয়াত তিলাওয়াত করেন (অনুবাদ) ‘‘আর আমি তোমার আগে রসূল পাঠিয়েছিলাম এবং তাদেরকে স্ত্রী ও সন্তান-সন্ততি দিয়েছিলাম’’ (সূরা রাদঃ ৩৮)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "১/১৮৫০। মুআবিযা বিন হাইদাহ (রহ.) থেকে তার পিতার সূত্রে বর্ণিত। এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করলো, স্বামীর উপর স্ত্রীর কী অধিকার রয়েছে? তিনি বলেনঃ সে আহার করলে তাকেও (একই মানের) আহার করাবে, সে পরিধান করলে তাকেও একই মানের পোশাক পরিধান করাবে (অথবা তোমাদের ভরণপোষণের সাথে তাদের ভরণপোষণের ব্যবস্থা করবে এবং তোমাদের পোশাক-পরিচ্ছদের ব্যবস্থা করার সাথে তাদের পোশাক পরিচ্ছেদেরও ব্যবস্থা করবে)। কখনও তার মুখমন্ডলে আঘাত করবে না, অশ্লীল গালমন্দ করবে না এবং নিজ বাড়ি ছাড়া অন্যত্র তাকে একাকী ত্যাগ করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "২/১৮৫১। ‘আমর ইবনুল আহ্ওয়াস (রাঃ) থেকে বর্ণিত। তিনি বিদায় হাজ্জে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে উপস্থিত ছিলেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর প্রশংসা ও গুণগান করেন এবং ওয়াজ-নসীহত করেন। এরপর তিনি বলেনঃ তোমরা নারীদের সাথে উত্তম ব্যবহারের উপদেশ শুনে নাও। কেননা তারা তোমাদের নিকট আবদ্ধ আছে। এর অধিক তাদের উপর তোমাদের কর্তৃত্ব নাই যে, তারা যদি প্রকাশ্য অশ্লীলতায় লিপ্ত হয়, সত্যিই যদি তারা তাই করে, তবে তোমরা তাদেরকে পৃথক বিছানায় রাখবে এবং আহত হয় না এরূপ হালকা মারধর করবে। অতঃপর তারা তোমাদের অনুগত হয়ে গেলে তাদের উপর আর বাড়াবাড়ি করো না। স্ত্রীদের উপর তোমাদের যেমন অধিকার রয়েছে, তোমাদের উপরও তাদের অধিকার আছে। তোমাদের স্ত্রীদের উপর তোমাদের অধিকার এই যে, তারা তোমাদের শয্যা তোমাদের অপছন্দনীয় লোকেদের দ্বারা মাড়াবে না এবং তোমাদের অপছন্দনীয় লোকেদেরকে তোমাদের ঘরে প্রবেশানুমতি দিবে না। সাবধান! তোমাদের উপর তাদের অধিকার এই যে, তাদের ভরণপোষণ, পোশাক-পরিচ্ছদ ও সজ্জার ব্যাপারে তোমরা তাদের প্রতি শোভনীয় আচরণ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "১/১৮৫২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি যদি কোন ব্যক্তিকে অপর কাউকে সিজদা করার নির্দেশ দিতাম, তাহলে অবশ্যই স্ত্রীকে নির্দেশ দিতাম তার স্বামীকে সিজদা করতে। কোন পুরুষ তার স্ত্রীকে লাল পাহাড় থেকে কালো পাহাড়ে অথবা কালো পাহাড় থেকে লাল পাহাড়ে পাথর স্থানান্তরের নির্দেশ দিলে তা পালন করা তার জন্য অপরিহার্য হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "২/১৮৫৩। ‘আবদুল্লাহ্ ইবনু আবূ আওফা (রাঃ) থেকে বর্ণিত। তিনি বলেন, মুআয (রাঃ) সিরিয়া থেকে ফিরে এসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সিজদা করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে মু‘আয! এ কী? তিনি বলেন, আমি সিরিয়ায় গিয়ে দেখতে পাই যে, তথাকার লোকেরা তাদের ধর্মীয় নেতা ও শাসকদেরকে সিজদা করে। তাই আমি মনে মনে আশা পোষণ করলাম যে, আমি আপনার সামনে তাই করবো। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তা করো না। কেননা আমি যদি কোন ব্যক্তিকে আল্লাহ্ ছাড়া অপর কাউকে সিজদা করার নির্দেশ দিতাম, তাহলে স্ত্রীকে নির্দেশ দিতাম তার স্বামীকে সিজদা করতে। সেই সত্তার শপথ, যাঁর হাতে মুহাম্মাদের প্রাণ! স্ত্রী তার স্বামীর প্রাপ্য অধিকার আদায় না করা পর্যন্ত তার প্রভুর প্রাপ্য অধিকার আদায় করতে সক্ষম হবে না। স্ত্রী শিবিকার মধ্যে থাকা অবস্থায় স্বামী তার সাথে জৈবিক চাহিদা পূরণ করতে চাইলে স্ত্রীর তা প্রত্যাখ্যান করা অনুচিত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "৩/১৮৫৪। আবূ বাকর বিন আবূ শায়বাহ-মুহাম্মাদ বিন ফুযাইল, আবূ নাসর আবদুল্লাহ বিন আবদুর রহমান-মুসাবির হিমইয়ারী মাতা বলেন, আমি উম্মু সালামাহকে বলতে শুনেছি, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, স্বামী খুশী থাকা অবস্থায় কোন স্ত্রীলোক মারা গেলে সে জান্নাতী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "১/১৮৫৫। ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ গোটা দুনিয়াই হলো সম্পদ। আর দুনিয়ার মধ্যে পুণ্যবতী স্ত্রীলোকের চেয়ে অধিক উত্তম কোন সম্পদ নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "২/১৮৫৬। সাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেন, সোনা-রূপা (মূল্যবান সম্পদ) পুঞ্জীভূত করে রাখার সমালোচনায় কুরআনের আয়াত নাযিল হলে সাহাবায়ে কিরাম বলেন, তাহলে আমরা কোন্ সম্পদ ধরে রাখবো? ‘উমার (রাঃ) বলেন, আমি তা জেনে তোমাদের বলে দিবো। অতঃপর তিনি তার উটকে দ্রুত হাঁকিয়ে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাক্ষাত পেয়ে গেলেন। আমিও তার পিছনে পিছনে গেলাম। তিনি বলেন, হে আল্লাহর রসূল আমরা কোন্ সম্পদ সঞ্চয় করবো? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের প্রত্যেকেই যেন অর্জন করে কৃতজ্ঞ অন্তর, যিকিরকারী জিহ্বা এবং আখেরাতের কাজে তাকে সহায়তাকারী ঈমানদার স্ত্রী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "৩/১৮৫৭। আবূ উমামাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ কোন মু’মিন ব্যক্তি আল্লাহ্ভীতির পর উত্তম যা লাভ করে তা হলো পুণ্যময়ী স্ত্রী। স্বামী তাকে কোন নির্দেশ দিলে সে তা পালন করে; সে তার দিকে তাকালে (তার হাস্যাজ্জ্বল চেহারা ও প্রফুল্লতা) তাকে আনন্দিত করে এবং সে তাকে শপথ করে কিছু বললে সে তা পূর্ণ করে। আর স্বামীর অনুপস্থিতিতে সে তার সম্ভ্রম ও সম্পদের হেফাযত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"text": "১/১৮৫৮। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ চারটি বিষয় বিবেচনায় রেখে মহিলাদের বিবাহ করা হয়। তার সম্পদ, তার বংশ মর্যাদা, তার রূপ-সৌন্দর্য এবং তার ধর্মপরায়ণতা। অতএব তুমি ধর্মপরায়ণা নারীর সন্ধান করো। অন্যথায় তোমার দু’ হাত ধূলি ধুসরিত হোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "২/১৮৫৯। ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা শুধু রূপ-সৌন্দর্যে মুগ্ধ হয়ে মহিলাদের বিবাহ করো না। এ রূপ-সৌন্দর্য হয়তো তাদের ধ্বংসের কারণও হতে পারে। হয়তো এ সম্পদই তাদের অপকর্মে লিপ্ত হওয়ার কারণ হতে পারে। অতএব ধর্মপরায়ণতা বিবেচনায় তোমরা তাদের বিবাহ করো। চ্যাপ্টা নাকবিশিষ্ট কুৎসিৎ দাসীও অধিক উত্তম যদি সে হয় ধর্মপরায়ণা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "১/১৮৬০। জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এক মহিলাকে বিবাহ করলাম। অতঃপর আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে সাক্ষাত করলে তিনি বলেন, হে জাবির! তুমি কি বিবাহ করেছো? আমি বললাম, হ্যাঁ। তিনি বললেনঃ কুমারী না বিধবা? আমি বললাম, বিধবা। তিনি বলেনঃ কেন তুমি কুমারী মেয়ে বিবাহ করলে না, তাহলে তার সাথে তুমি রসিকতা ও কৌতুক করতে পারতে? আমি বললাম, আমার কয়েকটি বোন আছে। তাই আমি আমার ও আমার বোনদের মধ্যে একটি কুমারী মেয়ের প্রবেশ করাকে সংকটজনক বোধ করলাম। তিনি বলেনঃ তাতো ভালো কথা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": 1861,
			"text": "২/১৮৬১। উতবা ইবনু ‘উআয়ম ইবনু সাঈদা আল-আনসারী (রহ.) থেকে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত। তিনি বলেন, রসূলুল্লাহ বলেছেনঃ তোমাদের কুমারী মেয়ে বিবাহ করা উচিত। কেননা তারা মিষ্টিমুখী, নির্মল জরায়ুধারী এবং অল্পতেই তুষ্ট হয়। হাসান",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": 1862,
			"text": "১/১৮৬২। আনাস ইবনু মালিক (রাঃ) বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে ব্যক্তি পাক-পবিত্র অবস্থায় আল্লাহর সাথে সাক্ষাত করতে চায় সে যেন স্বাধীন নারী বিবাহ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": 1863,
			"text": "২/১৮৬৩। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা বিবাহ করো আমি তোমাদের সংখ্যাধিক্য নিয়ে গৌরব করবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": 1864,
			"text": "১/১৮৬৪। মুহাম্মাদ ইবনু সালামাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি এক মহিলাকে বিবাহের পয়গাম পাঠালাম। আমি তাকে দেখার জন্য চুপিসারে তার বাগানে যাতায়াত করতাম এবং সেখানে তাকে দেখে ফেললাম। তাকে বলা হলো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী হয়ে তুমি এই কাজ করলে? তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ যখন আল্লাহ্ কারো অন্তরে কোন মহিলাকে বিবাহ করার প্রস্তাব দানের আগ্রহ পয়দা করেন, তখন তাকে দেখে নেয়াতে দোষের কিছু নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": 1865,
			"text": "২/১৮৬৫। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। মুগীরাহ ইবনু শু‘বাহ (রাঃ) এক মহিলাকে বিবাহ করার ইচ্ছা করলে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ তুমি গিয়ে তাকে দেখে নাও। কেননা তা তোমাদের মধ্যে ভালোবাসা সৃষ্টিতে সাহায়ক হবে। অতঃপর তিনি তাই করলেন এবং তাকে বিবাহ করলেন। পরে তাঁর নিকট তাদের দাম্পত্য সমপ্রীতির কথা উল্লেখ করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": 1866,
			"text": "৩/১৮৬৬। মুগীরাহ ইবনু শু‘বাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে এক মহিলাকে বিবাহ করার ব্যাপারে তাঁর সাথে আলাপ করলাম। তিনি বলেনঃ তুমি যাও এবং তাকে দেখে নাও। হয়তো তাতে তোমাদের উভয়ের মধ্যে ভালোবাসার সৃষ্টি হবে। অতএব আমি এক আনসার মহিলার নিকটে এসে তার পিতা-মাতার নিকট তাকে বিবাহ করার প্রস্তাব দিলাম এবং সাথে সাথে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাদীসও তাদের অবহিত করলাম। কিন্তু মনে হলো তার পিতা-মাতা এটা অপছন্দ করলো। রাবী বলেন, মেয়েটি পর্দার আড়াল থেকে উক্ত হাদীস শুনে বললো, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনাকে পাত্রী দেখার আদেশ দিয়ে থাকলে আপনি দেখে নিন। অন্যথায় আমি আপনাকে শপথ দিচ্ছি (না দেখার জন্য)। সে যেন ব্যাপারটিকে অভিনব মনে করলো। রাবী বলেন, আমি তাকে দেখে নিলাম এবং তাকে বিবাহ করলাম। পরে মুগীরাহ (রাঃ) তার সাথে সুসম্পর্কের কথা উল্লেখ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": 1867,
			"text": "১/১৮৬৭। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি যেন তার ভাইয়ের বিবাহের প্রস্তাবের উপর প্রস্তাব না দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": 1868,
			"text": "২/১৮৬৮। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ বলেছেনঃ কোন ব্যক্তি যেন তার ভাইয়ের বিবাহের প্রস্তাবের উপর প্রস্তাব না দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": 1869,
			"text": "৩/১৮৬৯। ফাতেমাহ বিনতে কায়েস (রহ.) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেনঃ তোমার ইদ্দত পূর্ণ হলে আমাকে জানাবে। ইদ্দত শেষ হলে আমি তাঁকে অবহিত করলাম। এরপর মুআবিয়া, আবূল জাহ্ম ইবনু সুখায়র ও উসামাহ ইবনু যায়দ (রাঃ) তাকে বিবাহের প্রস্তাব দেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তাকে) বলেনঃ মুআবিয়া গরীব লোক, তার কোন সম্পদ নেই। আর আবূল জাহম স্ত্রীদের অধিক মারধর করে। তবে উসামাহ। ফাতেমাহ (রাঃ) দু’বার হাত দিয়ে এভাবে ইশারা করে বলেন, উসামাহ, উসামাহ। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ আল্লাহ্ ও তাঁর রসূলের আনুগত্যই তোমার জন্য কল্যাণকর। ফাতেমাহ (রাঃ) বলেন, আমি তাকে বিবাহ করলাম এবং তার নেক আমল আমার জন্য ঈর্ষণীয় ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": 1870,
			"text": "১/১৮৭০। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিধবা নারী নিজের ব্যাপারে তার অভিভাবক অপেক্ষা অধিক কর্তৃত্বশীল এবং কুমারী মেয়ের বিবাহের ব্যাপারে তার সম্মতি গ্রহণ করতে হবে। বলা হলো, ইয়া রাসূলুল্লাহ্! কুমারী তো বিবাহের ব্যাপারে কথা বলতে লজ্জাবোধ করে। তিনি বলেনঃ তার নীরবতাই তার সম্মতি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": 1871,
			"text": "১/১৮৭১। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ বিধবাকে তার নির্দেশ গ্রহণ ব্যতীত বিবাহ দেয়া যাবে না এবং কুমারী মেয়েকেও তার সম্মতি গ্রহণ ব্যতীত বিবাহ দেয়া যাবে না। নীরবতাই তার সম্মতির লক্ষণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": 1872,
			"text": "২/১৮৭২। আদী আল কিনদী হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিধবা মহিলা তার ব্যাপারে সুস্পষ্ট মত প্রকাশ করবে। আর কুমারী মেয়ের নীরবতা তার সম্মতির লক্ষণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": 1873,
			"text": "১/১৮৭৩। ‘আবদুর রহমান ইবনু ইয়াযীদ ও মুজাম্মে ইবনু ইয়াযীদ আল-আনসারী (রাঃ) থেকে বর্ণিত। খিযাম নামক এক ব্যক্তি তার মেয়েকে বিবাহ দেন। সে তার পিতার এই বিবাহ অপছন্দ করে। মেয়েটি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হয়ে বিষয়টি তাঁকে অবহিত করে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পিতার দেয়া তার এই বিবাহ রদ করে দেন। পরে সেই মেয়ে আবূ লুবাবা ইবনু ‘আবদুল মুনযির (রাঃ)-কে বিবাহ করে। ইয়াহ্ইয়া (রহ.) বলেন, সে ছিল সায়্যিবা (বিধবা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": 1874,
			"text": "২/১৮৭৪। বুরাইদাহ (রহ.) থেকে বর্ণিত। তিনি বলেন, এক যুবতী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে বললো, আমার পিতা তার ভ্রাতুষ্পুত্রকে তার দুর্দশাগ্রস্ত অবস্থা থেকে উদ্ধারের জন্য আমাকে তার সাথে বিবাহ দিয়েছেন। রাবী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিষয়টি মেয়েটির এখতিয়ারে ছেড়ে দেন। মেয়েটি বললো, আমার পিতা যা করেছেন তা আমি বহাল রাখলাম। আমার উদ্দেশে ছিলো, মেয়েরা জেনে নিক যে, বিবাহের ব্যাপারে পিতাদের কোন এখতিয়ার নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": 1875,
			"text": "৩/১৮৭৫। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। একটি কুমারী মেয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে তাঁকে জানায় যে, তার পিতা তার অমতে তাকে বিবাহ দিয়েছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (বিবাহ রদের) এখতিয়ার দিলেন। ৩/১৮৭৫ (১)। মুহাম্মাদ বিন সাববাহ-মু‘আম্মার বিন সুলাইমান রাক্কী, যায়দ বিন হিববান-আইউব সাখতিয়ানী, ‘ইকরিমা ইবনু আব্বাস সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণনা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": 1876,
			"text": "১/১৮৭৬। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার ছয় বছর বয়সে আমাকে বিবাহ করেন। অতঃপর আমরা (হিজরত করে) মাদ্বীনাহ্য় চলে এলাম এবং হারিস ইবনুল খাযরাজ গোত্রে আশ্রয় নিলাম। এখানে আমি জ্বরে আক্রান্ত হলে আমার মাথার চুল উঠে যায় এবং অল্প কিছু চুল অবশিষ্ট থাকে। আমি আমার বান্ধবীদের সাথে দোলনায় দোল খাচ্ছিলাম, তখন আমার মা উম্মু রুমান এসে আমাকে উচ্চৈস্বরে ডাকলেন। আমি তার নিকট আসলাম, কিন্তু আমি তার উদ্দেশ্য বুঝতে পারলাম না। তিনি আমার হাত ধরে আমাকে ঘরের দরজায় দাঁড় করিয়ে দেন। আমি তখন সজোরে নিঃম্বাস নিচ্ছিলাম। তিনি পানি নিয়ে তা দ্বারা আমার মুখ ও মাথা মুছে দিলেন, অতঃপর আমাকে ঘরের ভিতরে নিয়ে যান, তখন ঘরের মধ্যে কিছু সংখ্যক আনসারী মহিলা ছিলেন। তারা বললেন, কল্যাণ ও বরকত হোক, ভাগ্য প্রসন্ন হোক। তিনি আমাকে তাদের নিকট সোপর্দ করলেন। তারা আমাকে সুসজ্জিত করেন। দুপুর বেলা হঠাৎ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপস্থিতি আমাকে সচকিত করে। আমার মা আমাকে তাঁর নিকট অর্পণ করেন। তখন আমার বয়স ছিল নয় বছর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": 1877,
			"text": "২/১৮৭৭। ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আয়িশাহ্ (রাঃ)-কে তার সাত বছর বয়সে বিবাহ করেন এবং তার সাথে তার নয় বছর বয়সে বাসর যাপন করেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ইন্তিকালের সময় তার বয়স ছিল আঠার বছর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": 1878,
			"text": "১/১৮৭৮। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। ‘উসমান ইবনু মাযঊন (রাঃ) ইন্তিকালের সময় তার একটি কন্যা সন্তান রেখে যান। ইবনু ‘উমার (রাঃ) বলেন, আমার মামা এবং ঐ মেয়ের চাচা কুদামা মেয়েটির পিতার মৃত্যুর পর মেয়েটির সাথে পরামর্শ না করেই তাকে আমার সাথে বিবাহ দেন। সে তার দেয়া এ বিবাহ অপছন্দ করে এবং মুগীরাহ ইবনু শু’বাহর সাথে বিবাহিত হতে পছন্দ করে। অতএব কুদামা মুগীরার সাথে তার বিবাহ দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": 1879,
			"text": "১/১৮৭৯। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে নারীকে তার অভিভাবক বিবাহ দেয়নি তার বিবাহ বাতিল, তার বিবাহ বাতিল, তার বিবাহ বাতিল। স্বামী তার সাথে সহবাস করলে তাতে সে মাহরের অধিকারী হবে। তাদের মধ্যে মতবিরোধ হলে সে ক্ষেত্রে যার অভিভাবক নাই, শাসক তার অভিভাবক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": 1880,
			"text": "২/১৮৮০। ‘আয়িশাহ্ (রাঃ) ও ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তারা বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অভিভাবক ছাড়া বিবাহ হয় না। ‘আয়িশাহ্ (রাঃ) বর্ণিত হাদীসে আরও আছেঃ যার অভিভাবক নাই, শাসক তার অভিভাবক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": 1881,
			"text": "৩/১৮৮১। আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অভিভাবক ছাড়া বিবাহ হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": 1882,
			"text": "৪/১৮৮২। আবূ হুরাইরা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মহিলা অপর কোন মহিলাকে বিবাহ দিবে না এবং কোন মহিলা নিজেকেও বিবাহ দিবে না। কেননা যে নারী স্বউদ্যোগে বিবাহ করে সে যেনাকারিণী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": 1883,
			"text": "১/১৮৮৩। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিগার বিবাহ নিষিদ্ধ করেছেন। রাবী বলেন, শিগার বিবাহ এই যে, এক ব্যক্তি অপর ব্যক্তিকে প্রস্তাব দিলো, তুমি আমার সাথে তোমার মেয়েকে অথবা বোনকে বিবাহ দাও এবং তার পরিবর্তে আমি আমার মেয়েকে অথবা বোনকে তোমার সাথে বিবাহ দিবো, আর এতে কোন মাহর থাকে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": 1884,
			"text": "২/১৮৮৪। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিগার বিবাহ নিষিদ্ধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "৩/১৮৮৫। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামে শিগার বিবাহের কোন সুযোগ নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": 1886,
			"text": "১/১৮৮৬। আবূ সালামাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ্ (রাঃ) -কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রীদের মাহর কতো ছিলো? তিনি বলেন, তাঁর স্ত্রীদের মাহরের পরিমাণ ছিলো বার উকিয়া ও এক নাশ। তুমি কি জানো, নাশ কী? তাহলো অর্ধ উকিয়া। আর তাহলো পাঁচ শত দিরহামের সমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": 1887,
			"text": "২/১৮৮৭। ‘উমার ইবনুল খাত্তাব থেকে বর্ণিত, তিনি (রাঃ) বলেছেন, মহিলাদের মাহরের ব্যাপারে তোমরা বাড়াবাড়ি করো না। কেননা তা যদি পার্থিব জীবনে সম্মান অথবা আল্লাহর কাছে তাক্ওয়ার প্রতীক হতো, তাহলে তোমাদের মধ্যে মুহাম্মাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ব্যাপারে অধিক যোগ্য ও অগ্রগণ্য ছিলেন। তিনি তাঁর স্ত্রী ও কন্যাদের মাহর বারো উকিয়ার বেশি ধার্য করেননি। কখনও অধিক মাহর স্বামীর উপর বোঝা হয়ে দাঁড়ায়। ফলে স্ত্রীর প্রতি স্বামীর মনে শত্রুতা সৃষ্টি হয়, এমনকি সে বলতে থাকে, আমি তোমার জন্য পানির মশক বহনে বাধ্য হয়েছি অথবা তোমার জন্য ঘর্মাক্ত হয়ে পড়েছি। (রাবী বলেন), আমি একজন বেদুইন। অতএব আমি ‘‘আলাকাল কিরবা’’ বা ‘‘আলাকাল কিরবা’’-এর অর্থ কি তা জানি না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": 1888,
			"text": "৩/১৮৮৮। ‘আমের ইবনু রবীআ (রাঃ) থেকে বর্ণিত। ফাযারা গোত্রের এক ব্যক্তি এক জোড়া পাদুকার বিনিময়ে বিবাহ করে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বিবাহ অনুমোদন করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": 1889,
			"text": "৪/১৮৮৯। সাহল ইবনু সা‘দ (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক মহিলা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হলে তিনি বলেনঃ কে তাকে বিবাহ করবে? এক ব্যক্তি বললো, আমি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাকে একটি লোহার আংটি হলেও তা (মারহস্বরূপ) দাও। সে বললো, আমার কাছে কিছুই নাই। তিনি বলেনঃ তোমার কাছে কুরআনের যে অংশ আছে, তার বিনিময়ে আমি তাকে তোমার সাথে বিবাহ দিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": 1890,
			"text": "৫/১৮৯০। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আয়িশাহ্ (রাঃ) -কে একটি ঘরের আসবাবপত্রের বিনিময়ে বিবাহ করেন, যার মূল্য ছিল পঞ্চাশ দিরহাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": 1891,
			"text": "১/১৮৯১। ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তাকে এক ব্যক্তি সম্পর্কে জিজ্ঞেস করা হলো যে, সে এক মহিলাকে বিবাহ করার পর তার সাথে সহবাস ও মাহর ধার্য করার পূর্বে মারা গেছে। রাবী বলেন, ‘আবদুল্লাহ্ (রাঃ) বললেন, সেই মহিলা মাহর পাবে, মীরাসও পাবে এবং তাকে ইদ্দাতও পালন করতে হবে। মাকিল ইবনু সিনান আল-আশজাঈ (রাঃ) বললেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে সাক্ষ্য দিচ্ছি যে, তিনি বিরওয়া বিনতে ওয়াশিকের ক্ষেত্রেও এরূপ ফয়সালা দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "১/১৮৯২। ‘আবদুল্লাহ্ ইবনু মাস‘উদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে কল্যাণসমূহের উৎস, তাঁর সমষ্টি এবং তার সমাপ্তি দান করা হয়েছে। তিনি আমাদের সালাতের খুতবা এবং প্রয়োজনের (বিবাহের) খুতবা শিক্ষা দিয়েছেন। সালাতের খুত্বা (তাশাহ্হুদ) হলোঃ সমস্ত সম্মান, ‘ইবাদাত ও পবিত্রতা আল্লাহর জন্য। হে নবী! আপনার উপর শান্তি বর্ষিত হোক, আল্লাহর রহমত ও বারাকাতও। আমাদের উপর এবং আল্লাহর নেক বান্দাহ্দের উপরও শান্তি বর্ষিত হোক। আমি সাক্ষ্য দেই যে, আল্লাহ ছাড়া কোন ইলাহ নেই। আমি আরো সাক্ষ্য দেই যে, মুহাম্মাদ আল্লাহর বান্দাহ্ ও তাঁর রসূল। আর বিবাহের খুতবা হলোঃ ‘‘সমস্ত প্রশংসা আল্লাহর জন্য। আমরা তাঁর প্রশংসা করি, তাঁর সাহায্য প্রার্থনা করি, তাঁর নিকট ক্ষমা প্রার্থনা করি। আমরা আমাদের প্রবৃত্তির অনিষ্ট ও আমাদের কাজের নিকৃষ্টতা থেকে আল্লাহর কাছে আশরয় চাই। আল্লাহ্ যাকে সৎপথে পরিচালিত করেন তাকে কেউ পথভ্রষ্ট করতে পারে না এবং যাকে পথভ্রষ্ট করেন তার কোন পথপ্রদর্শক নাই। আমি সাক্ষ্য দেই যে, আল্লাহ্ ছাড়া কোন ইলাহ নাই, তিনি এক এবং তাঁর কোন শরীক নাই। আমি আরো সাক্ষ্য দেই যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বান্দা ও রসূল’’। এরপর তোমরা তোমাদের খুত্বার সাথে কুরআনের এ তিনটি আয়াত যোগ করবেঃ (يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ) (وَاتَّقُوا اللهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللهَ كَانَ عَلَيْكُمْ رَقِيبًا) (اتَّقُوا اللهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعْ اللهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا) ‘‘হে ঈমানদারগণ! আল্লাহকে যেরূপ ভয় করা উচিত তোমরা তাঁকে তদ্রূপ ভয় করো এবং মুসলিম না হয়ে মৃত্যুবরণ করো না’’ (সূরা আল ইমরানঃ ১০২)। ‘‘হে মানবজাতি! তোমরা তোমাদের প্রভুকে ভয় করো, যিনি তোমাদেরকে এক ব্যক্তি থেকে সৃষ্টি করেছেন এবং যিনি তার থেকে তার সঙ্গিণীকে সৃষ্টি করেছেন এবং তাদের দু’জন থেকে অসংখ্য পুরুষ ও নারী ছড়িয়ে দিয়েছেন। অতএব তোমরা আল্লাহকে ভয় করো যাঁর নামে তোমরা একে অপরের নিকট যাচ্ঞা করে থাকো এবং জ্ঞাতিদের ব্যাপারে সতর্কতা অবলম্বন করো। নিশ্চয় আল্লাহ্ তোমাদের উপর পর্যবেক্ষক’’ (সূরা নিসাঃ ১)। ‘‘হে ঈমানদারগণ! তোমরা আল্লাহকে ভয় করো এবং সঠিক কথা বলো। তিনি তোমাদের কার্যাবলি সংশোধন করে দিবেন এবং তোমাদের গুনাহসমূহ ক্ষমা করবেন। যে কেউ আল্লাহ্ ও তাঁর রসূলের আনুগত্য করে সে অবশ্যই মহাসাফল্য অর্জন করবে’’ (সূরা আহযাবঃ ৭০-৭১)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": 1893,
			"text": "২/১৮৯৩। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিম্নোক্ত খুতবাহ পড়েছেনঃ ‘‘সমস্ত প্রশংসা আল্লাহর জন্য। আমরা তাঁর প্রশংসা করি এবং তাঁর কাছে সাহায্য চাই। আমরা আল্লাহর কাছে আমাদের প্রবৃত্তির অনিষ্ট হতে এবং আমাদের কার্যকলাপের নিকৃষ্টতা হতে আশরয় চাই। আল্লাহ্ যাকে সৎপথে পরিচালিত করেন, কেউ তাকে পথভ্রষ্ট করতে পারে না এবং তিনি যাকে পথভ্রষ্ট করেন, তার কোন পথপ্রদর্শক নাই। আমি সাক্ষ্য দেই যে, আল্লাহ্ ব্যতীত কোন ইলাহ নাই, তিনি এক, তাঁর কোন শরীক নাই এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বান্দা ও তাঁর রসূল। অতঃপর...।’’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": 1894,
			"text": "৩/১৮৯৪। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিটি কাজ গুরুত্বপূর্ণ। আল্লাহর প্রশংসা ছাড়া শুরু করা হলে, তা হয় বরকতশূন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": 1895,
			"text": "১/১৮৯৫। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা এই বিবাহের ঘোষণা দাও এবং তাতে ঢোল বাজাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": 1896,
			"text": "২/১৮৯৬। মুহাম্মাদ ইবনু হাতিব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হালাল ও হারাম বিবাহের মধ্যে পার্থক্য হলো- দফ বাজানো এবং শব্দ করা বা ঘোষণা প্রচার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": 1897,
			"text": "১/১৮৯৭। আবূল হুসাইন খারিদ আল-মাদানী (রহ.) থেকে বর্ণিত। তিনি বলেন, আমরা এক আশূরার দিন মদিনায় ছিলাম। বালিকারা দফ বাজাচ্ছিল এবং গান গাচ্ছিল। এরপর আমরা রুবাই বিনতে মুআবিয (রাঃ)-এর নিকট উপস্থিত হলাম এবং ঘটনাটি তাকে জানালাম। তিনি বলেন, আমার বিবাহ বেলা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট আসেন। তখন আমার নিকট দু’টি বালিকা গান গাচ্ছিল এবং বদর যুদ্ধে নিহত আমার পিতৃপুরুষদের কীর্তিগাঁথা গাইছিল। তারা এও বলছিল, আমাদের মধ্যে এমন একজন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আছেন, যিনি আগামী কালের খবরও জানেন। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা একথা বলো না। আগামীকালের খবর আল্লাহ্ ছাড়া আর কেউ জানে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": 1898,
			"text": "২/১৮৯৮। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আবূ বাকর (রাঃ) আমার নিকট আসেন। তখন আমার নিকট দু’টি আনসার বালিকা উপস্থিত ছিল। তারা বুয়াস যুদ্ধে আনসারদের মুখে উচ্চারিত কবিতাগুলো গানের সুরে আবৃত্তি করছিল। ‘আয়িশাহ্ (রাঃ) বলেন, তারা পেশাদার গায়িকা ছিল না। আবু বাকর (রাঃ) বললেন, শয়তানের বাঁশী (বাদ্যযন্ত্র) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামর ঘরে? এ ঘটনাটি ছিল ঈদুল ফিতরের দিনের। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আবূ বাকর! প্রত্যেক জাতিরই ঈদ (আনন্দ উৎসব) রয়েছে। আর এটাই হচ্ছে আমাদের ঈদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": 1899,
			"text": "৩/১৮৯৯। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনাহর গলিপথ দিয়ে যাচ্ছিলেন। কয়েকটি বালিকা দফ বাজিয়ে গান গেয়ে বলছিল, ‘‘আমরা বনু নাজ্জারের বালিকার দল। কত খোশ নসীব! মুহাম্মাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মহৎ প্রতিবেশী’’। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ অবগত আছেন, আমি তো তোমাদের ভালোবাসি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": 1900,
			"text": "৪/১৯০০। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, ‘আয়িশাহ্ (রাঃ) তার এক আত্মীয়ের এক আনসার মেয়ের সাথে বিবাহ দেন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে বলেনঃ তোমরা কি মেয়েটিকে (স্বামীর বাড়ি) পাঠিয়ে দিয়েছ? তারা বলেন, হ্যাঁ। তিনি বলেনঃ তোমরা কি তার সাথে এমন কাউকে পাঠিয়েছ, যে গান গাইতে পারে? ‘আয়িশাহ্ (রাঃ) বলেন, না। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আনসার সম্প্রদায় গানের ভক্ত। অতএব তোমরা যদি তার সাথে কাউকে পাঠাতে, যে গিয়ে এরূপ বলতোঃ ‘‘আমরা এসেছি তোমাদের কাছে, আমরা এসেছি তোমাদের কাছে, আল্লাহ্ আমাদের দীর্ঘজীবী করুন এবং দীর্ঘজীবী করুন তোমাদের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": 1901,
			"text": "৫/১৯০১। মুজাহিদ (রহ.) থেকে বর্ণিত। তিনি বলেন, আমি ইবনু ‘উমার (রাঃ)-এর সাথে ছিলাম। হঠাৎ তিনি তবলার আওয়াজ শুনতে পান। তিনি তার উভয় কানে তার দু’ আঙ্গুল ঢুকিয়ে সরে পড়েন। তিনি তিনবার এরূপ করলেন। অতঃপর তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": 1902,
			"text": "১/১৯০২। উম্মু সালামাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরে প্রবেশ করে এক নুপুংসককে ‘আবদুল্লাহ্ ইবনু আবূ উমাইয়্যাকে লক্ষ্য করে বলতে শুনলেনঃ আগামীকাল যদি আল্লাহ্ তায়েফ বিজয় দান করেন, তাহলে আমি তোমাকে এমন এক নারীর সন্ধান দিবো, যে চার ভাঁজে আগমন করে এবং আট ভাঁজে প্রস্থান করে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ একে তোমাদের ঘর থেকে বের করে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": 1903,
			"text": "২/১৯০৩। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুরুষের বেশধারিণী নারীকে এবং নারীর বেশধারী পুরুষকে অভিসম্পাত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": 1904,
			"text": "৩/১৯০৪। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন নারীর বেশধারী পুরুষদেরকে এবং পুরুষের বেশধারিণী নারীদেরকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "১/১৯০৫। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিবাহ উপলক্ষে কাউকে মুবারকবাদ জানিয়ে বলতেনঃ «بَارَكَ اللهُ لَكُمْ وَبَارَكَ عَلَيْكُمْ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ» ‘‘আল্লাহ্ তোমাদের বরকত দান করুন, তোমাদের উপর বরকত নাযিল করুন এবং কল্যাণের সাথে তোমাদের একত্র করুন।’’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": 1906,
			"text": "২/১৯০৬। আকীল ইবনু আবূ ত্বলিব (রাঃ) থেকে বর্ণিত। তিনি বনু জুশম গোত্রের এক মহিলাকে বিবাহ করলে লোকেরা (মুবারকবাদ দিয়ে) বললো, সুখী হও এবং অধিক সন্তান হোক। তিনি বলেন, তোমরা এরূপ বলো না, বরং যেরূপ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন তদ্রূপ বলোঃ اللّٰهُمَّ بَارِكْ لَهُمْ وَبَارِكْ عَلَيْهِمْ ‘‘হে আল্লাহ্! তাদেরকে বরকত দান করুন এবং তাদের উপর বরকত নাযিল করুন।’’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": 1907,
			"text": "১/১৯০৭। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রহমান ইবনু আওফ (রাঃ)-এর চেহারায় হলুদের রং দেখে তাকে বলেনঃ একী? ‘আবদুর রহমান (রাঃ) বলেন, হে আল্লাহর রসূল! আমি এক মহিলাকে সামান্য সোনার বিনিময়ে বিবাহ করেছি। তিনি বলেনঃ আল্লাহ্ তোমাকে বরকত দান করুন। একটি বকরী দিয়ে হলেও বিবাহ ভোজের আয়োজন করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": 1908,
			"text": "২/১৯০৮। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর কোন স্ত্রীর বেলায় এমন বিবাহ ভোজের আয়োজন করতে দেখিনি, যেরূপ তিনি যয়নব (রাঃ) এর বিবাহ ভোজের আয়োজন করেন। তিনি তাতে একটি বকরী যবহ করেছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": 1909,
			"text": "৩/১৯০৯। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ) এর বিবাহে ছাতু ও খোরমা দিয়ে বিবাহ ভোজের আয়োজন করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": 1910,
			"text": "৪/১৯১০। আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এক বিবাহ ভোজের অনুষ্ঠানে উপস্থিত ছিলাম। এতে না গোশত ছিল, না রুটি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": 1911,
			"text": "৫/১৯১১। ‘আয়িশাহ ও উম্মু সালামাহ (রাযিয়াল্লাহু আনহুমা) থেকে বর্ণিত। তারা বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে ফাতেমাহকে ‘আলীর নিকট পৌঁছানোর জন্য তাকে সাজসজ্জা করিয়ে তৈরি করার নির্দেশ দেন। আমরা (আলীর) ঘরে বাতহা উপত্যকার নরম মাটি বিছিয়ে দিলাম, অতঃপর দু’টি বালিশে খেজুর গাছের ছাল ভরে তা পরিষ্কার করে রেখে দিলাম। এরপর আমরা খোরমা, কিশমিশ ও মিঠা পানির দ্বারা পানাহারের ব্যবস্থা করলাম, কাপড় ও পানির মশক ঝুলিয়ে রাখার জন্য একটি কাঠের খুঁটি ঘরে কোণে দাঁড় করিয়ে দিলাম। আমরা ফাতেমাহর বিবাহের চেয়ে অধিক পরিপাটি ব্যবস্থা আর দেখিনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": 1912,
			"text": "৬/১৯১২। সাহল ইবনু সা‘দ আস-সাইদী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আবূ উসাইদ আস-সাইদী (রাঃ) তার বিবাহ ভোজে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দাওয়াত করেন। কনেই তাঁদের আহার পরিবেশন করেন। তিনি (কনে) বলেন, তুমি কি জানো রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কী পান করিয়েছিলাম? তিনি বলেন, আমি রাতে কিছু শুকনো খেজুর পানিতে ভিজিয়ে রেখেছিলাম, সকালবেলা এগুলো নিংড়িয়ে তাঁকে শরবত পান করিয়েছিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": 1913,
			"text": "১/১৯১৩। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, যে বিবাহ ভোজে ধনীদের দাওয়াত দেয়া হয় এবং গরীবদের উপেক্ষা করা হয় তাহলো সর্বাধিক নিকৃষ্ট বিবাহ ভোজ। যে ব্যক্তি দাওয়াত গ্রহণ করে না, সে আল্লাহ্ ও তাঁর রসূলের অবাধ্যাচরণ করলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": 1914,
			"text": "২/১৯১৪। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের কাউকে বিবাহ ভোজের দাওয়াত দেয়া হলে সে যেন তা কবুল করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": 1915,
			"text": "৩/১৯১৫। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রথম দিনের ওলীমা (বিবাহ ভোজ) আয়োজন করা কর্তব্য, দ্বিতীয় দিনের ওলীমাও ভালো এবং তৃতীয় দিনের ওলীমা হলো প্রদর্শনী এবং যশের জন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": 1916,
			"text": "১/১৯১৬। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বয়স্কা স্ত্রীর পালা হচ্ছে তিন দিন এবং তরুণী স্ত্রীর পালা সাত দিন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": 1917,
			"text": "২/১৯১৭। উম্মু সালামাহ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বিবাহ করার পর তার নিকট তিন দিন অবস্থান করেন এবং বলেনঃ তোমার ব্যাপারে তোমার স্বামীর কোন অনীহা নেই। তুমি যদি চাও, তবে আমি তোমার সঙ্গে সাত দিন অবস্থান করবো। যদি আমি তোমার নিকট সাত দিন কাটাই তবে আমার অন্য স্ত্রীদের নিকটও সাত দিন করে কাটাবো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": 1918,
			"text": "১/১৯১৮। ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যখন তোমাদের কেউ স্ত্রী, খাদেম অথবা আরোহণের পশু লাভ করে তখন সে যেন তার কপালে হাত রেখে বলেঃ ‘‘হে আল্লাহ্! আমি তোমার নিকট এর মধ্যে নিহিত কল্যাণ প্রার্থনা করি এবং যে কল্যাণ এর মধ্যে গচ্ছিত রাখা হয়েছে। আমি তোমার নিকট এর অনিষ্ট হতে এবং যে অনিষ্টসহ একে সৃষ্টি করা হয়েছে তা হতে আশরয় চাই’’।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": 1919,
			"text": "২/১৯১৯। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের কেউ যখন তার স্ত্রীর কাছে আসে, তখন সে যেন বলেঃاللّٰهُمَّ جَنِّبْنِي الشَّيْطَانَ وَجَنِّبْ الشَّيْطَانَ مَا رَزَقْتَنِي ‘‘হে আল্লাহ্! আমাকে শয়তান থেকে দূরে রাখো এবং যে সন্তান আমাদের দান করবে তাকেও শয়তান থেকে দূরো রাখো’’। অতঃপর স্বামী-স্ত্রীর সেই মিলনে যদি কোন সন্তান হয়, তবে আল্লাহ্ তার উপর শয়তানকে কোন প্রভাব বিস্তার করতে দিবেন না অথবা শয়তান তার কোন ক্ষতি করতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": 1920,
			"text": "১/১৯২০। মুয়াবিয়াহ আল কুশাইরী হতে বর্ণিত, তিনি বলেন, আমি বললাম, হে আল্লাহর রসূল! আমাদের লজ্জাস্থানের কতখানি ঢেকে রাখবো, আর কতখানি খুলে রাখবো? তিনি বলেনঃ তোমার লজ্জাস্থান আপন স্ত্রী ও ক্রীতদাসী ছাড়া অন্যদের থেকে হেফাজত করবে। আমি বললাম, হে আল্লাহর রসূল! আপনার অভিমত কী যে, লোকেরা যদি একত্রে বসবাস করে? তিনি বলেনঃ যদি তুমি তা কাউকে না দেখিয়ে পারো, তবে অবশ্যই তা দেখাবে না। আমি বললাম, হে আল্লাহর রসূল! আমাদের কেউ যদি নির্জন থাকে? তিনি বলেনঃ আল্লাহ্ অধিক অগ্রগণ্য যে, মানুষের চেয়ে তাঁর প্রতি বেশি লজ্জাশীল হতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "২/১৯২১। উতবা ইবনু আব্দ আস-সুলামী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ তার স্ত্রীর নিকট এসে যেন (নির্জনে মিলনে) পর্দা (গোপনীয়তা) রক্ষা করে এবং গর্দভের ন্যায় বিবস্ত্র না হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": 1922,
			"text": "৩/১৯২২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি কখনও রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর লজ্জাস্থানের দিকে তাকাইনি বা তা দেখিনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": 1923,
			"text": "১/১৯২৩। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি তার স্ত্রীর মলদ্বারে সঙ্গম করে, আল্লাহ্ তার দিকে (দয়ার- দৃষ্টিতে) তাকান না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": 1924,
			"text": "২/১৯২৪। খুযাইমা ইবনু সাবিত (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ সত্য বলতে লজ্জাবোধ করেন না। কথাটি তিনি তিনবার বলেন। (অতঃপর বলেন) তোমরা মহিলাদের মলদ্বারে সঙ্গম করো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": 1925,
			"text": "৩/১৯২৫। জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, ইহূদীরা বলতো, কোন ব্যক্তি পশ্চাৎদিক থেকে স্ত্রী অঙ্গে সঙ্গম করলে তাতে সন্তান টেরা চোখবিশিষ্ট হয়। এরপর আল্লাহ্ তা’আলা এই আয়াত নাযিল করেন (অনুবাদ) ‘‘তোমাদের স্ত্রীগণ তোমাদের শস্যক্ষেত। অতএব তোমরা তোমাদের শষ্যক্ষেতে যেভাবে ইচ্ছা আসো।’’ (২ঃ ২২৩)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": 1926,
			"text": "১/১৯২৬। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আযল সম্পর্কে জিজ্ঞেস করলে তিনি বলেনঃ তোমরা কি তা করো? তা না করলে তোমাদের কোন ক্ষতি নেই। কেননা যে প্রাণের উদ্ভব হওয়ার ব্যাপারে আল্লাহ্ সিদ্ধান্ত করে রেখেছেন তা হবেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": 1927,
			"text": "২/১৯২৭। জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর জীবদ্দশায় এবং কুরআন নাযিল হওয়া অব্যাহত থাকা অবস্থায় আযল করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": 1928,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "২/১৯৩০। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দু’ ধরনের বিবাহ নিষিদ্ধ করতে শুনেছিঃ কোন স্ত্রীলোক ও তার খালাকে অথবা কোন স্ত্রীলোক ও তার ফুফুকে কোন ব্যক্তির বিবাহাধীনে একত্র করা (নিষিদ্ধ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": 1931,
			"text": "৩/১৯৩১। আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মহিলাকে তার ফুফু অথবা তার খালার সাথে একত্রে বিবাহ করা যাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": 1932,
			"text": "১/১৯৩২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রিফাআ আল-কুরাযী (রাঃ)-এর স্ত্রী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, আমি রিফাআর বিবাহাধীন ছিলাম। সে আমাকে তিন তালাক দিলে পর আমি ‘আবদুর রহমান ইবনুয যুবাইর (রাঃ)-কে বিবাহ করি। কিন্তু তার সাথে কাপড়ের পোটলাবৎ বস্তু ছাড়া কিছু নাই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুচকি হেসে বলেনঃ তুমি কি রিফাআর নিকট ফিরে যেতে চাও? তা হবে না, যতক্ষণ না তুমি তার মধু পান করো এবং সে তোমার মধু পান করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": 1933,
			"text": "২/১৯৩৩। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। এক ব্যক্তি তার স্ত্রীকে তালাক দেয়ার পর অপর এক ব্যক্তি তাকে বিবাহ করে। সে তার সহবাসের পূর্বে পুনরায় তাকে তালাক দেয়। উক্ত স্ত্রীলোকটি কি প্রথম স্বামীর সাথে পুনর্বিবাহে আবদ্ধ হতে পারবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ না, যতক্ষণ না সে তার মধু পান করে (তার সাথে সহবাস করে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": 1934,
			"text": "১/১৯৩৪। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহলীলকারী এবং যার জন্য তাহলীল করা হয় তাদের উভয়কে অভিসম্পাত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": 1935,
			"text": "২/১৯৩৫। ‘আলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহলীলকারী এবং যার জন্য তাহলীল করা হয়, তাদের (উভয়কে) অভিসম্পাত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": 1936,
			"text": "৩/১৯৩৬। ‘উকবা ইবনু ‘আমের (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি তোমাদের ভাড়াটে পাঁঠা সম্পর্কে অবহিত করবো না? তারা বললেন, হ্যাঁ, হে আল্লাহর রসূল! তিনি বলেনঃ সে হলো তাহলীলকারী। আল্লাহ্ তাহলীলকারী এবং যার জন্য তাহলীল করা হয় তাদের উভয়কে অভিসম্পাত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": 1937,
			"text": "১/১৯৩৭। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বংশীয় সম্পর্কের দরুন যারা হারাম হয়, দুধপান জনিত কারণেও তারা হারাম হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": 1938,
			"text": "২/১৯৩৮। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে হামযা ইবনু আবদুল মুত্তালিব (রাঃ)-এর মেয়ের বিবাহের প্রস্তাব দেয়া হলে তিনি বলেনঃ সে তো আমার দুধ ভাইয়ের কন্যা। বংশীয় সম্পর্কের দরুন যাদের সাথে বৈবাহিক সম্পর্ক স্থাপন হারাম, দুধপান জনিত সম্পর্কের দরুণও অনুরূপ মহিলাদের সাথে বৈবাহিক সম্পর্ক স্থাপন হারাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": 1939,
			"text": "৩/১৯৩৯। উম্মু হাবীবা (রাঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলেন, আপনি আমার বোন আয্যাকে বিবাহ করুন। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি কি পছন্দ করো? তিনি বললেন, হ্যাঁ হে আল্লাহর রসূল! আর আমি তো আপনার জন্য একক নই। কল্যাণ লাভে আমার শরীক হওয়ার ব্যাপারে আমার বোন আমার নিকট অধিক অগ্রগণ্য। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে আমার জন্য হালাল নয়। তিনি বলেন, আমরা তো পরস্পর আলোচনা করছিলাম যে, আপনি আবূ সালামাহ (রাঃ)-এর কন্যা দুররাকে বিবাহ করতে ইচ্ছুক। তিনি বলেনঃ উম্মু সালামাহর কন্যা? উম্মু হাবীবা (রাঃ) বলেন, হ্যাঁ। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে যদি আমার প্রতিপালনাধীন আমার স্ত্রীর পূর্ব-স্বামীর কন্যা নাও হতো, তবুও সে আমার জন্য হালাল হতো না। কারণ সে আমার দুধ-ভাইয়ের কন্যা। সুয়াইবা (রাঃ) আমাকে এবং তাঁর পিতাকে দুধ পান করিয়েছে। অতএব তোমরা তোমাদের বোনদের ও মেয়েদের আমার সাথে বিবাহ দেয়ার প্রস্তাব করো না। ৩/১৯৩৯ (১)। আবূ বাকর বিন আবী শায়বাহ-আব্দুল্লাহ বিন নুমাইর, হিশাম বিন ‘উরওয়াহ তাঁর পিতা হতে, তিনি যায়নাব বিনতে উম্মু সালামাহ হতে, উম্মু সালামাহ উম্মে হাবীবাহ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": 1940,
			"text": "১/১৯৪০। উম্মুল ফাদল (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এক ঢোক অথবা দু’ ঢোক ধুধপান (দুধপান জনিত বৈবাহিক সম্পর্ক স্থাপন) হারাম করে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": 1941,
			"text": "২/১৯৪১। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এক ঢোক বা দু’ ঢোক দুধপানে (দুধপান জনিত) বৈবাহিক নিষিদ্ধতা প্রতিষ্ঠিত হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": 1942,
			"text": "৩/১৯৪২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, প্রথমদিকে কুরআনে এই বিধান ছিলো, যা পরে রহিত হয়ে যায়ঃ দশ ঢোক বা পাঁচ ঢোক দুধ পানের কমে নিষিদ্ধতা প্রতিষ্ঠিত হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": 1943,
			"text": "১/১৯৪৩। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, সাহ্লা বিনতে সুহাইল (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো, ইয়া রাসূলুল্লাহ্! আমার নিকট সালেমের যাতায়াতের কারণে আমি (আমার স্বামী) আবূ হুযাইফাহর চেহারায় অসন্তুষ্টির ভাব লক্ষ্য করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি তাকে দুধ পান করিয়ে দাও। সে বললো, আমি তাকে কিভাবে দুধপান করাবো, সে যে বয়স্ক পুরুষ? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুচকি হেসে বলেনঃ আমিও অবশ্য জানি যে, সে বয়স্ক পুরুষ। সে তাই করলো, দুধ পান করানোর পর আবূ হুযাইফাহর চেহারায় আমি কোন অপছন্দের ভাব লক্ষ্য করিনি। (রাবী বলেন), তিনি বদর যুদ্ধে অংশগ্রহণ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": 1944,
			"text": "২/১৯৪৪। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রজম সম্পর্কিত আয়াত এবং বয়স্ক লোকেরও দশ ঢোক দুধপান সম্পর্কিত আয়াত নাযিল হয়েছিল, যা একটি সহীফায় (লিখিত) আমার খাটের নিচে সংরক্ষিত ছিল। যখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইন্তিকাল করেন এবং আমরা তাঁর ইন্তিকালে ব্যতিব্যস্ত হয়ে পড়লাম, তখন একটি ছাগল এসে তা খেয়ে ফেলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": 1945,
			"text": "১/১৯৪৫। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ঘরে প্রবেশ করেন, তখন তার নিকট এক ব্যক্তি উপস্থিত ছিলো। তিনি জিজ্ঞেস করেনঃ এ ব্যক্তি কে? ‘আয়িশাহ্ (রাঃ) বলেন, আমার ভাই। তিনি বলেনঃ তোমরা লক্ষ্য রাখবে যে, কাকে তোমাদের অন্দর মহলে প্রবেশ করাচ্ছো। কেননা সেই দুধপানই ধর্তব্য যা ক্ষুধা নিবারণ করে (অর্থাৎ দুগ্ধপোষ্য শিশুর দুধপানই ধর্তব্য)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": 1946,
			"text": "২/১৯৪৬। ‘আবদুল্লাহ্ ইবনুযু যুবাইর (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দুধপান সেটাই গ্রহণযোগ্য (যা খাদ্যনালী ভেদ করে) পাকস্থলী পূর্ণ করে (অর্থাৎ শিশুর দুধপানই ধর্তব্য)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": 1947,
			"text": "৩/১৯৪৭। যায়নাব বিনতে আবূ সালামাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সকল স্ত্রী ‘আয়িশাহ্ (রাঃ) -এর সাথে এ বিষয়ে ভিন্নমত পোষণ করেন এবং তার মত প্রত্যাখ্যান করেন যে, সালেমের মত বয়স্ক পুরুষ দুধপান করলে তাতে দুধপান জনিত নিষিদ্ধতা প্রতিষ্ঠিত হবে এবং সে তাদের নিকট প্রবেশ করতে পারবে (তাদের মতে তা কার্যকর হবে না)। তারা আরও বলেন, এটা হয়তো কেবল সালেমের একার জন্য প্রযোজ্য (খাস) ছিলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": 1948,
			"text": "১/১৯৪৮। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমার দুধ সম্পর্কীয় চাচা আফলাহ ইবনু আবূ কুআইস পর্দার বিধান নাযিল হওয়ার পর ভেতর বাড়িতে আমার কাছে আসতে অনুমতি চাইলেন। কিন্তু আমি তাকে অনুমতি দিতে অস্বীকার করলাম। ইত্যবসরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট এসে বলেনঃ সে তোমার চাচা, তাকে আসতে অনুমতি দাও। আমি বললাম, আমাকে তো স্ত্রীলোকটি দুধপান করিয়েছে, পুরুষ লোকটি তো দুধপান করায়নি! তিনি বলেনঃ তোমার উভয় হাত বা তোমার ডান হাত ধুলি ধুসরিত হোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "২/১৯৪৯। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমার দুধ সম্পর্কীয় চাচা আমার ভেতর বাড়িতে আসার অনুমতি চাইলেন, কিন্তু আমি তাকে অনুমতি দিতে অস্বীকার করলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার চাচাকে তোমার নিকট আসার অনুমতি দাও। আমি বললাম, আমাকে তো স্ত্রীলোকটি দুধপান করিয়েছে, পুরুষ লোকটি তো দুধপান করায়নি। তিনি আবার বললেনঃ তাকে তোমার নিকট আসার অনুমতি দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": 1950,
			"text": "১/১৯৫০। দায়লামী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হলাম। তখন আমার নিকট দু’ (সহোদর) বোন ছিলো, যাদেরকে আমি জাহিলী যুগে একত্রে বিবাহ করেছিলাম। তিনি বলেনঃ তুমি ফিরে গিয়ে তাদের একজনকে তালাক দিয়ে পৃথক করে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1951,
			"arabicnumber": 1951,
			"text": "২/১৯৫১। ফীরোয দায়লামী (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বললাম, হে আল্লাহর রসূল! আমি ইসলাম গ্রহণ করেছি এবং আমার বিবাহে দু’ (সহোদর) বোন রয়েছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেনঃ তোমার ইচ্ছামত এদের মধ্যে একজনকে তালাক দিয়ে পৃথক করে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": 1952,
			"text": "১/১৯৫২। কায়েস ইবনুল হারিস (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি ইসলাম গ্রহণ করলাম এবং তখন আমার আটজন স্ত্রী ছিল। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে বিষয়টি তাঁকে জানালাম। তিনি বলেনঃ তাদের মধ্যে তোমার পছন্দমত চারজনকে রেখে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": 1953,
			"text": "২/১৯৫৩। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, গাইলান ইবনু সালামাহ যখন ইসলাম গ্রহণ করেন, তখন তার দশজন স্ত্রী ছিলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ তুমি তাদের মধ্যে চারজনকে রাখো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": 1954,
			"text": "১/১৯৫৪। উকবা ইবনু আমের (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে শর্ত পূরণ করা অধিক সংগত তা হলো, যার বিনিময়ে তোমরা (নারীর) লজ্জাস্থান হালাল করেছো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": 1955,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": 1956,
			"text": "১/১৯৫৬। আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার একটি দাসী আছে, সে তাকে উত্তমরূপে আদব-কায়দা শিখায় এবং শিক্ষা-দীক্ষা দান করে, অতঃপর আযাদ করে বিবাহ করে, তার জন্য রয়েছে দু’টি পুরস্কার। আর আহলে কিতাবের কোন ব্যক্তি তার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামর উপর ঈমান আনার পর মুহাম্মাদ রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উপর ঈমান আনলে, তার জন্যও রয়েছে দু’টি পুরস্কার। তদ্রূপ কোন ক্রীতদাস তার উপর ধার্য আল্লাহর হক ও তার মনিবের হক আদায় করলে, তার জন্যও রয়েছে দু’টি পুরস্কার। অধস্তন রাবী সালেহ (রহ.) বলেন, শাবী (রহ.) বলেছেন, আমি কোন বিনিময় ছাড়াই তোমাকে এ হাদীসটি জানিয়ে দিলাম। অথচ এর চেয়ে ক্ষুদ্র একটি হাদীসের জন্য অনেকেই মাদ্বীনাহ পর্যন্ত সফর করতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": 1957,
			"text": "২/১৯৫৭। আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, সাফিয়্যা (রাঃ) প্রথমে দিহ্য়া আল-কালবী (রাঃ)-এর ভাগে পড়েছিলেন। পরে তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অধীনে আসেন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বিবাহ করেন এবং তাকে দাসত্বমুক্ত করাকে তার মাহর গণ্য করেন। অধস্তন রাবী হাম্মাদ বলেন, আবদুল আযীয (রহ.) ছাবিত (রহ.)-কে বললেন, হে আবূ মুহাম্মাদ! আপনি কী আনাস (রাঃ)-কে জিজ্ঞেস করেছিলেন যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-কে কি মাহর দিয়েছিলেন? আনাস (রাঃ) বলেন, তার দাসত্ব মুক্তিই ছিল তার মাহর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": 1958,
			"text": "৩/১৯৫৮। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-কে আযাদ করেন এবং তাঁর দাসত্বমুক্তিকে তার মাহর নির্ধারণ করে তাকে বিবাহ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": 1959,
			"text": "১/১৯৫৯। ইবনে ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গোলাম তার মনিবের অনুমতি ছাড়া বিবাহ করলে সে ব্যভিচারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": 1960,
			"text": "২/১৯৬০। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে গোলামই তার মনিবদের অনুমতি ছাড়া বিবাহ করে, যে যেনাকারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": 1961,
			"text": "১/১৯৬১। ‘আলী ইবনু আবূ ত্বলিব (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার এলাকা বিজয়ের দিন মহিলাদের সাথে মুত‘আ (বিবাহ) করতে এবং গৃহপালিত গাধার গোশত খেতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "২/১৯৬২। সাবরাহ্ (রহ.) থেকে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে বিদায় হাজ্জে রওয়ানা হলাম। সাহাবীগণ বললেন, হে আল্লাহর রসূল! স্ত্রীহীন অবস্থায় থাকা আমাদের জন্য কষ্টকর হয়ে দাঁড়িয়েছে। তিনি বলেন : তাহলে তোমরা এসব মহিলার সাথে মুত‘আ করো (সাময়িকভাবে উপকৃত হও)। অতএব আমরা তাদের সান্নিধ্যে পৌঁছলাম, কিন্তু তারা আমাদের এবং তাদের মাঝে নির্দিষ্ট মেয়াদ নির্ধারণ ব্যতীত আমাদের সঙ্গে বিবাহ বসতে অস্বীকার করলো। সাহাবীগণ বিষয়টি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উল্লেখ করলে তিনি বলেন, তাহলে তোমাদের ও তাদের মাঝে মেয়াদ নির্দিষ্ট করে নাও। অতএব আমি ও আমার এক চাচাত ভাই (এই উদ্দেশে) বের হলাম। তার সাথে ছিল একটি চাদর এবং আমার সাথেও ছিল একটি চাদর। তার চাদরটি ছিল আমার চাদর থেকে বেশি সুন্দর। আর আমি ছিলাম তার চাইতে অধিক যুবক। আমরা দু’জন এক নারীর নিকট আসলাম। সে বললো, চাদর দু’টি তো একই মানের। অতঃপর আমি তাকে বিবাহ করলাম এবং তার কাছেই ঐ রাত কাটালাম। ভোরে আমি ফিরে এলাম, তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা‘বা ঘরের দরজা ও রুকনের মাঝখানে দাঁড়িয়ে বলছিলেন : হে লোকসকল! আমি তোমাদের মুত‘আ বিবাহের অনুমতি দিয়েছিলাম। এখন তোমরা শুনে নাও যে, আল্লাহ্ ক্বিয়ামাত (কিয়ামত) পর্যন্ত এই প্রকার বিবাহ হারাম করেছেন। অতএব তোমাদের কারো কাছে এ ধরনের কোন নারী থাকলে সে যেন তাকে ছেড়ে দেয় এবং তোমরা তাদেরকে যা কিছু দিয়েছো তা থেকে কিছুই ফেরত নিও না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": 1963,
			"text": "৩/১৯৬৩। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, ‘উমার ইবনুল খাত্তাব (রাঃ) খলীফা নির্বাচিত হওয়ার পর লোকেদের উদ্দেশে ভাষণ দিতে গিয়ে বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে মাত্র তিন দিন মুত‘আ বিবাহের অনুমতি দিয়েছিলেন। এরপর তিনি তা হারাম ঘোষণা করেন। আল্লাহর শপথ! আমি যদি কোন বিবাহিত পুরুষের ব্যাপারে জানতে পারি যে, সে মুত‘আ বিবাহ করে তবে আমি প্রস্তরাঘাতে তাকে মৃত্যুদন্ড দিবো। তবে সে যদি আমার সামনে চারজন সাক্ষী উপস্থিত করতে পারে, যারা সাক্ষ্য দিবে যে, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুত‘আ বিবাহ হারাম ঘোষণার পর আবার তা হালাল করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": 1964,
			"text": "১/১৯৬৪। মায়মূনা বিনতুল হারিস (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে হালাল (ইহরামমুক্ত) অবস্থায় বিবাহ করেন। রাবী ইয়াযীদ ইবনু আসম্ম বলেন, মায়মূনা (রাঃ) ছিলেন আমার ও ইবনু ‘আব্বাস (রাঃ)-এর খালা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "৩/১৯৬৬। ‘উসমান ইবনু আফফান (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইহরাম অবস্থায় কোন ব্যক্তি নিজে বিবাহ করবে না, অন্যকেও বিবাহ করাবে না এবং বিবাহের প্রস্তাবও দিবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": 1967,
			"text": "১/১৯৬৭। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের নিকট এমন কোন ব্যক্তি বিবাহের প্রস্তাব নিয়ে এলে, যার চরিত্র ও ধর্মানুরাগ সম্পর্কে তোমরা সন্তুষ্ট, তার সাথে (তোমাদের মেয়েদের) বিবাহ দাও। তোমরা যদি তা না করো, তাহলে পৃথিবীতে বিপর্যয় ও ব্যাপক বিশৃংখলা ছড়িয়ে পড়বে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": 1968,
			"text": "২/১৯৬৮। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ভবিষ্যত বংশধরদের স্বার্থে উত্তম মহিলা গ্রহণ করো এবং সমতা (কুফু) বিবচেনায় বিবাহ করো, আর বিবাহ দিতেও সমতার প্রতি লক্ষ্য রাখো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": 1969,
			"text": "১/১৯৬৯। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার দু’জন স্ত্রী আছে, আর সে তাদের একজনের চেয়ে অপরজনের প্রতি বেশি ঝুঁকে পড়ে, সে কিয়ামতের দিন তার (দেহের) এক পার্শ্ব পতিত অবস্থায় উপস্থিত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": 1970,
			"text": "১/১৯৭০। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে রওয়ানা হলে তাঁর স্ত্রীদের মধ্যে (কে তাঁর সাথে যাবেন তা নির্ধারণের জন্য) লটারির ব্যবস্থা করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": 1971,
			"text": "২/১৯৭১। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপন স্ত্রীদের মধ্যে ইনসাফের সাথে (সব কিছু) সমানভাবে বণ্টন করতেন, অতঃপর বলতেনঃ হে আল্লাহ্! এ হলো আমার সামর্থ্য অনুযায়ী আমার কাজ। যে বিষয়ে তোমার ক্ষমতা আছে, আমার সামর্থ্য নাই, সে বিষয়ে আমাকে তিরস্কার করো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": 1972,
			"text": "১/১৯৭২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, সাওদা বিনতে যামআ (রাঃ) বার্ধক্যগ্রস্ত হয়ে পড়লে তিনি তার নির্ধারিত পালার দিনটি ‘আয়িশাহ্ (রাঃ)-কে হেবা করেন। অতএব রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাওদা (রাঃ)-এর দিনটি ‘আয়িশাহ্ (রাঃ) এর ভাগে ফেলতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": 1973,
			"text": "২/১৯৭৩। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। কোন কারণে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা বিনতে হুয়াই (রাঃ)-এর উপর অসন্তুষ্ট হলে তিনি (সাফিয়্যা) বলেন, হে ‘আয়িশাহ! তুমি কি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আমার প্রতি সন্তুষ্ট করে দিবে? আমি আমার পালার দিনটি তোমাকে দিবো। ‘আয়িশাহ্ (রাঃ) বলেন, হ্যাঁ। এরপর তিনি জাফরান রংয়ে রঞ্জিত তার একটি ওড়না নিলেন এবং তাতে পানি ছিটিয়ে দিলেন, যাতে এর ঘ্রাণ ছড়িয়ে পড়ে। অতঃপর তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পাশে বসলে তিনি বলেনঃ হে ‘আয়িশাহ! তুমি আমার নিকট থেকে সরে যাও। এটা তোমার পালার দিন নয়। ‘আয়িশাহ্ (রাঃ) বলেন, এটি হচ্ছে আল্লাহর অনুগ্রহ যাকে ইচ্ছা তিনি দান করেন। তিনি তাঁকে ব্যাপারটি খুলে বলেন। তাতে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-এর প্রতি সন্তুষ্ট হয়ে যান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": 1974,
			"text": "৩/১৯৭৪। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, ‘‘আপোস-নিষ্পত্তিই উত্তম’’ (৪ঃ ১২৮) আয়াত এমন এক ব্যক্তি সম্পর্কে নাযিল হয়, যার বিবাহাধীনে এক মহিলা দীর্ঘদিন যাবত ছিল এবং সে তার স্বামীর ঔরসে কয়েকটি সন্তানও প্রসব করেছিল। স্বামী তাকে তালাক দিয়ে অন্য স্ত্রী গ্রহণ করতে চাইলে মহিলাটি এ শর্তে স্বামীকে সম্মত করলো যে, সে তার বিবাহ বন্ধনে থাকবে এবং তাকে কোন পালার দিন দিবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": 1975,
			"text": "১/১৯৭৫। আবূ রুহম (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’জনের মধ্যে বিবাহ বন্ধনের সুপারিশই হলো সর্বোত্তম সুপারিশ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": 1976,
			"text": "২/১৯৭৬। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, উসামাহ (রাঃ) পা পিছলে ঘরের দরজার চৌকাঠে পড়ে গেলে তার মুখমন্ডল আহত হয়। তখন রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমাকে) বলেনঃ তার চেহারা থেকে রক্ত পরিষ্কার করে দাও। আমি তা অপছন্দ করলে তিনি নিজেই তার মুখমন্ডল থেকে রক্ত মুছে পরিষ্কার করে দিলেন, অতঃপর বলেনঃ উসামাহ মেয়ে হলে আমি অবশ্যই তাকে অলঙ্কার ও পোশাকে এতটা সজ্জিত করতাম যেমন বিবাহে পর্যাপ্ত খরচ করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": 1977,
			"text": "১/১৯৭৭। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের মধ্যে সেই ব্যক্তি উত্তম যে নিজের পরিবারের কাছে উত্তম। আর আমি তোমাদের চেয়ে আমার পরিবারের কাছে অধিক উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": 1978,
			"text": "২/১৯৭৮। ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে উত্তম লোক তারাই, যারা তাদের স্ত্রীদের কাছে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": 1979,
			"text": "৩/১৯৭৯। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সাথে দৌড় প্রতিযোগিতায় অবতীর্ণ হলে আমি তাঁকে অতিক্রম করে যাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": 1980,
			"text": "৪/১৯৮০। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যা (রাঃ)-কে বিবাহ করে মাদ্বীনাহ্য় নিয়ে এলে আনসারী মহিলাগণ এসে তার ব্যাপারে (আমাকে) অবহিত করে। ‘আয়িশাহ্ (রাঃ) বলেন, আমি বেশভূষা পরিবর্তন করে এবং মুখমন্ডল আবৃত করে তাকে দেখতে গেলাম। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার চোখের দিকে তাকিয়ে আমাকে চিনে ফেলেন। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার দিকে লক্ষ্য করলে আমি দ্রুত সরে যেতে চেষ্টা করলাম। কিন্তু তিনি আমাকে ধরে ফেলে কোলে তুলে নেন এবং বলেনঃ কেমন দেখলে? আমি বললাম, আমাকে ছেড়ে দিন, ইয়াহূদী নারীদের মধ্যকার এক ইয়াহূদিনী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": 1981,
			"text": "৫/১৯৮১। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত, তিনি বলেন, আমার অজ্ঞাতে হঠাৎ যয়নব (রাঃ) অনুমতি ছাড়াই রাগান্বিত অবস্থায় আমার ঘরে আসলেন, অতঃপর বলেন, হে আল্লাহর রসূল! আবূ বাকর (রাঃ)-এর এই ছোট্ট মেয়েটি যখন আপনার সামনে তার দু’হাত নাড়াচাড়া করে, তখন তাই কি আপনার জন্য যথেষ্ট? অতঃপর যয়নব (রাঃ) আমার দিকে ফিরলে আমি তার থেকে মুখ ফিরিয়ে নিলাম। অবশেষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ লও এবং তাঁর থেকে প্রতিশোধ গ্রহণ করো। অতএব আমি তার মুখোমুখী হয়ে তাকে জব্দ করলাম, এমনকি আমি দেখলাম যে, তার মুখ শুকিয়ে গেছে। তিনি আমার কোন কথার প্রতিউত্তর করতে পারলেন না। আমি নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখলাম, তাঁর চেহারা ঝলমল করছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": 1982,
			"text": "৬/১৯৮২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে পুতুল নিয়ে খেলা করতাম। তিনি আমার বান্ধবীদেরকে আমার সাথে খেলা করার জন্য আমার নিকট পাঠিয়ে দিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": 1983,
			"text": "১/১৯৮৩। ‘আবদুল্লাহ্ ইবনু যাম‘আ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভাষণ দিলেন, অতঃপর মহিলাদের উল্লেখ করে তাদের ব্যাপারে লোকজনকে উপদেশ দিলেন। তিনি বলেনঃ তোমাদের কেউ কেন তার স্ত্রীকে দাসীর মত বেত্রাঘাত করে? অথচ দিনের শেষেই সে আবার তার শয্যাসঙ্গী হয়",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": 1984,
			"text": "২/১৯৮৪। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কখনও তাঁর কোন খাদেমকে অথবা তাঁর কোন স্ত্রীকে মারপিট করেননি এবং নিজ হাতে অপর কাউকেও প্রহার করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": 1985,
			"text": "৩/১৯৮৫। ইয়াস ইবনু ‘আবদুল্লাহ্ ইবনু আবূ যুবাব (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আল্লাহর দাসীদের প্রহার করো না। অতঃপর ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বলেনঃ হে আল্লাহর রসূল! নারীরা তো তাদের স্বামীদের অবাধ্যাচরণ করছে। তিনি তাদেরকে মারার অনুমতি দিলেন এবং তারা প্রহৃত হলো। পরে অনেক নারী রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাড়িতে সমবেত হলো। সকাল বেলা তিনি বলেনঃ ‘‘আজ রাতে মুহাম্মাদের পরিবারে সত্তরজন মহিলা এসে তাদের প্রত্যেকেই নিজ নিজ স্বামীর বিরুদ্ধে অভিযোগ করেছে। তোমরা মারপিটকারীদেরকে তোমাদের মধ্যে উত্তম হিসাবে পাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": 1986,
			"text": "৪/১৯৮৬। আশআস ইবনু কায়েস (রহ.) থেকে বর্ণিত। তিনি বলেন, আমি এক রাতে ‘উমার (রাঃ)-এর বাড়িতে মেহমান হলাম। মধ্যরাতে ‘উমার (রাঃ) তার স্ত্রীকে প্রহার করতে উঠলেন। আমি তাদের দু’জনের মাঝে প্রতিবন্ধক হলাম। অতঃপর ‘উমার (রাঃ) শয্যা গ্রহণ করে আমাকে বলেন, হে আশআস! তুমি আমার থেকে একটি বিষয় মনে রাখবে যা আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট শুনেছি। স্বামী তার স্ত্রীকে প্রহার করলে এ ব্যাপারে জওয়াবদিহি করতে হবে না, বিত্র সালাত না পড়ে ঘুমাবে না। রাবী বলেন, আমি তৃতীয় কথাটি ভুলে গেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": 1987,
			"text": "১/১৯৮৭। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই নারীকে অভিসম্পাত করেছেন, যে কৃত্রিম চুল সংযোজন করে এবং যে তা করায় এবং যে দেহে উল্কি অংকন করে এবং যে তা করায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": 1988,
			"text": "২/১৯৮৮। আসমা (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললো, আমার মেয়ের সদ্য বিবাহ হয়েছে, কিন্তু রোগের কারণে তার মাথার চুল ঝরে গেছে। আমি কি তার মাথায় কৃত্রিম চুল জোড়া দিবো? রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে নারী পরচুলা সংযোজন করে এবং যে সংযোজন করায়, আল্লাহ্ তাদের উভয়কে অভিসম্পাত করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "৩/১৯৮৯। ‘আবদুল্লাহ্ বিন মাস‘উদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই সব নারীকে অভিসম্পাত করেছেন, যারা অন্যের দেহে আঁকে এবং যারা নিজেদের দেহে উল্কি অংকন করায়, যারা ভ্রূর চুল উপড়ে ফেলে এবং যারা সৌন্দর্যের জন্য দাঁতের মাঝে ফাঁক সৃষ্টি করে, তারা আল্লাহর সৃষ্টিতে পরিবর্তন করে। আসাদ গোত্রের উম্মু ইয়াকূব নাম্নী মহিলার কাছে এ হাদীস পৌঁছলে, তিনি ‘আবদুল্লাহ্ (রাঃ)-এর কাছে এসে বলেন, আমি অবগত হয়েছি যে, আপনি এমন এমন কথা বলেছেন। ‘আবদুল্লাহ্ (রাঃ) বলেন, আমি তাদেরকে কেন অভিসম্পাত করবো না যাদেরকে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন এবং বিষয়টি আল্লাহর কিতাবে উক্ত আছে! মহিলা বলেন, আমি সম্পূর্ণ কুরআন পড়েছি, কিন্তু কোথাও তো তা পাইনি। ‘আবদুল্লাহ্ (রাঃ) বলেন, তুমি খেয়াল করে তা পড়লে, অবশ্যই পেতে। তুমি কি এ আয়াত পড়োনি (অনুবাদ) ‘‘রসূল তোমাদেরকে যা দেয় তা তোমরা গ্রহণ করো এবং যা থেকে তোমাদের নিষেধ করে তা থেকে তোমরা বিরত থাকো’’ (সূরা হাশরঃ ৭)? মহিলা বললেন, হ্যাঁ। ‘আবদুল্লাহ্ (রাঃ) বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কাজ করতে নিষেধ করেছেন। মহিলা বলেন, আমার মনে হয় আপনার পরিবার (স্ত্রী) এরূপ করে থাকে। তিনি বলেন, তাহলে তুমি গিয়ে লক্ষ্য করে দেখো। অতএব সে গিয়ে লক্ষ্য করলো, কিন্তু তার কোন লক্ষণই দেখতে পেলো না। শেষে সে বললো, আমি এমন কিছু দেখতে পাইনি। ‘আবদুল্লাহ্ (রাঃ) বলেন, তোমরা কথা ঠিক হলে সে আমাদের সাথে একত্রে থাকতে পারতো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": 1990,
			"text": "১/১৯৯০। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে শাওয়াল মাসে বিবাহ করেন এবং শাওয়াল মাসে আমার সাথে বাসর যাপন করেন। আর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন স্ত্রী তাঁর কাছে আমার চেয়ে অধিক প্রিয় ছিল! ‘আয়িশাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিবাহিতার সাথে তার স্বামীর শাওয়াল মাসেই বাসর যাপন পছন্দ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": 1991,
			"text": "২/১৯৯১। আবদুল মালিক ইবনুল হারিস ইবনু হিশাম (রহ.) থেকে তার পিতার সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মু সালামাহ (রাঃ)-কে শাওয়াল মাসে বিবাহ করেন এবং শাওয়াল মাসেই তাকে তাঁর সহবাসে একত্র করেন। আবূ বকর বিন আবদির রহমান বর্ণনায় মুরসাল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mursal"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": 1992,
			"text": "১/১৯৯২। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক কনেকে স্বামীর কিছু (মাহর, উপহার ইত্যাদি) দেয়ার পূর্বেই তার সাথে বাসর যাপনের ব্যবস্থা করে দেয়ার জন্য তাকে নির্দেশ দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": 1993,
			"text": "১/১৯৯৩। মিখমার ইবনু মু‘আবিয়া (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি : অশুভ লক্ষণ বলতে কিছু নেই। অবশ্য তিনটি জিনিসে অশুভ লক্ষণ আছেঃ স্ত্রীলোক, ঘোড়া ও বাড়ি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": 1994,
			"text": "২/১৯৯৪। সাহল ইবনু সা‘দ (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কুলক্ষণ বলতে কিছু থাকলে তা ঘোড়া, স্ত্রীলোক ও ঘরেই থাকতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": 1995,
			"text": "৩/১৯৯৫। ‘আবদুল্লাহ্ বিন ‘উমার (রাঃ) থেকে তার পিতার সূত্রে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ অশুভ লক্ষণ তিন জিনিসের মধ্যে থাকতে পারেঃ ঘোড়া, স্ত্রীলোক ও ঘর। যুহরী (রহ.) বলেন, আবূ ‘উবাইদাহ ইবনু ‘আবদুল্লাহ্ ইবনু যামআ আমাকে বলেছেন যে, তার দাদী যয়নব (রাঃ) উম্মু সালামাহ (রাঃ) থেকে বর্ণনা করেন যে, তিনি এই তিনটির সাথে তরবারিও যোগ করতেন। উম্মু সালমার কথা ব্যতীত, তাদের শব্দ হলো অশুভ লক্ষণ, যে বস্তুর মধ্যে তাহলে ... অতঃপর তরবারী ব্যতীত তিনটি উল্লেখ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": 1996,
			"text": "১/১৯৯৬। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ আত্মমর্যাদাবোধ পছন্দ করেন এবং অপছন্দও করেন। যা থেকে বিপর্যয় সৃষ্টির আশংকা থাকেন তা ত্যাগ করার আত্মমর্যাদাবোধ আল্লাহ্ পছন্দ করেন এবং যাতে বিপর্যয় সৃষ্টির আশংকা নেই তা ত্যাগের আত্মমর্যাদাবোধ আল্লাহ্ অপছন্দ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": 1997,
			"text": "২/১৯৯৭। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি খাদীজা (রাঃ)-এর ক্ষেত্রে যে আত্মমর্যাদাবোধ উপলব্ধি করতাম, তদ্রূপ অপর কোন নারীর ক্ষেত্রে অনুভব করতাম না। কেননা আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে প্রায়ই তার কথা উল্লেখ করতে দেখেছি। আল্লাহ্ তা’আলা তাঁর রসূলকে খাদীজা (রাঃ)-এর জন্য জান্নাতে স্বর্ণ নির্মিত একটি প্রাসাদের সুসংবাদ দেয়ার নির্দেশ দিয়েছেন। ইবনু মাজা (রহ.) তা বলেছেন (অর্থাৎ কাসাব-এর অর্থ সোনা বলেছেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": 1998,
			"text": "৩/১৯৯৮। মিসওয়ার ইবনু মাখরামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মিম্বারে দাঁড়িয়ে বলতে শুনেছিঃ বনূ হিশাম ইবনুল মুগীরাহ তাদের কন্যাকে ‘আলী ইবনু আবূ তালিবের নিকট বিবাহ দিতে আমার নিকট অনুমতি চেয়েছে। আমি তাদেরকে অনুমতি দিবো না, আমি তাদেরকে অনুমতি দিবো না, আমি অনুমতি দিব না, আমি তাদেরকে অনুমতি দিব না। তবে ‘আলী ইবনু আবূ ত্বলিব আমার কন্যাকে তালাক দিলে তা করতে পারে। কেননা ফাতেমাহ অবশ্যি আমার দেহের একটি টুকরা। যা তার মনঃকষ্টের কারণ হয় তা আমারও মনঃকষ্টের কারণ হয় এবং যা তাকে কষ্ট দেয় তা আমাকেও কষ্ট দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": 1999,
			"text": "৪/১৯৯৯। মিসওয়ার ইবনু মাখরামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, ‘আলী ইবনু আবূ ত্বলিব (রাঃ) আবূ জাহলের কন্যাকে বিবাহ করার প্রস্তাব দেন। অথচ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা ফাতেমাহ (রাঃ) তাঁর বিবাহাধীন ছিলেন। ফাতেমাহ (রাঃ) তা শুনতে পেয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলেন, আপনার সম্প্রদায়ের লোক বলাবলি করছে যে, আপনি আপনার কন্যাদের ব্যাপারে কোন কথায় রাগান্বিত হন না। এই ‘আলী আবূ জাহলের কন্যাকে বিবাহ করতে যাচ্ছে। মিসওয়ার (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন, আমি তাঁকে কলেমায়ে শাহাদাত পাঠ করার পর বলতে শুনলামঃ আমি আবূল আস ইবনুর রবীর নিকট আমার এক কন্যাকে (যয়নব) বিবাহ দিয়েছিলাম। সে আমাকে যে কথা দিয়েছিল তা রক্ষা করেছে। নিশ্চয় ফাতেমাহ বিনতে মুহাম্মাদ আমার দেহের একটি অংশ। তোমরা তাকে গুনাহে নিক্ষেপ করবে তা আমি পছন্দ করি না। আল্লাহর শপথ! আল্লাহর রসূলের কন্যা এবং আল্লাহর দুশমনের কন্যা এক ব্যক্তির অধীন কখনো একত্র হতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": 2000,
			"text": "১/২০০০। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলতেন, যে নারী নিজেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য পেশ করে তার কি লজ্জা হয় না? অবশেষে এ আয়াত নাযিল হয় (অনুবাদ) ‘‘তুমি তাদের মধ্যে যাকে ইচ্ছা তোমার নিকট থেকে দূরে রাখতে পারো এবং যাকে ইচ্ছা তোমার নিকট স্থান দিতে পারো’’ (সূরা আহযাবঃ ৫১)। ‘আয়িশাহ্ (রাঃ) বলেন, তখন আমি বললাম, আপনার প্রভু তো আপনার ইচ্ছা পূরণে আপনার চেয়েও অগ্রগামী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": 2001,
			"text": "২/২০০১। সাবিত (রহ.) থেকে বর্ণিত। তিনি বলেন, আমরা আনাস ইবনু মালিক (রাঃ)-এর সাথে বসা ছিলাম। তার সাথে তার এক কন্যাও ছিলো। আনাস (রাঃ) বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে নিজেকে তাঁর জন্য পেশ করে। সে বলে, হে আল্লাহর রসূল! আপনার কি আমাকে প্রয়োজন আছে? (এ হাদীস শুনে) আনাস (রাঃ)-এর মেয়ে বললো, মহিলাটি কত নির্লজ্জ! আনাস (রাঃ) বলেন, সে তোমার চেয়ে অনেক উত্তম। সে রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর প্রতি অনুরক্ত হওয়ার কারণেই নিজেকে তার জন্য পেশ করেছে।",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": 2002,
			"text": "১/২০০২। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, ফাযারা গোত্রের এক ব্যক্তি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, হে আল্লাহর রসূল! আমার স্ত্রী কৃষ্ণ বর্ণের একটি পুত্র সন্তান প্রসব করেছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমার কি উট আছে? সে বললো, হ্যাঁ। তিনি বলেনঃ এগুলো কী বর্ণের? সে বললো, লাল। তিনি বলেন এগুলোর মধ্যে ছাই বর্ণের উট আছে কি? সে বললো, হ্যাঁ, এর মধ্যে অবশ্যই ছাই রং-এর উটও আছে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এগুলো কোথা থেকে এলো? সে বললো, সম্ভবত এটি তার পূর্বপুরুষের কারো রং ধারণ করেছে। তিনি বলেনঃ এখানেও হয়ত পূর্বপুরুষের কালো রং ধারণ করে থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": 2003,
			"text": "২/২০০৩। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। এক গ্রাম্য বেদুইন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললো, হে আল্লাহর রসূল! আমার স্ত্রী আমার ঘরে একটি কালো রং-এর পুত্র সন্তান প্রসব করেছে, অথচ আমাদের পরিবারে কালো রং-এর কেউ কখনো ছিল না। তিনি বলেনঃ তোমার কি উট আছে? সে বললো, হ্যাঁ। তিনি বলেনঃ এগুলোর রং কী? সে বললো, লাল। তিনি বলেনঃ এগুলোর মধ্যে কি কালো বর্ণের উট আছে? সে বললো, না। তিনি বললেনঃ ছাই বর্ণের আছে কি? সে বললো, হ্যাঁ। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন এটা কিরূপে হলো? সে বললো, হয়ত পূর্বপুরুষের রক্ত ধারায় এমনটি হয়ে থাকবে। তিনি বলেনঃ হয়তো তোমার পুত্রের বেলায়ও এমনটি হয়ে থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": 2004,
			"text": "১/২০০৪। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, ইবনু যাম‘আ (রাঃ) ও সা‘দ (রাঃ) যামআর দাসী-পুত্রকে কেন্দ্র করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বিবাদে লিপ্ত হন। সা‘দ (রাঃ) বলেন, হে আল্লাহর রসূল! আমার ভাই আমাকে বলেছেন যে, আমি মক্কাহ্য় গেলে আমি যেন যাম্আর দাসী-পুত্রকে খুঁজে বের করি। আর আব্দ ইবনু যামআ বললো, সে আমার ভাই, আমার পিতার দাসী-পুত্র, সে আমার পিতার শয্যায় জন্মগ্রহণ করে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছেলেটিকে উতবার সাথে (গঠনাকৃতিতে) সাদৃশ্যপূর্ণ লক্ষ্য করেন। তিনি বলেন, হে আব্দ ইবনু যামআ! এটি তোমারই প্রাপ্য। সন্তান বিছানার মালিকের (স্বামীর) এবং ব্যভিচারির জন্য রয়েছে পাথর। আর হে সাওদা! তুমি তার থেকে পর্দা করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": 2005,
			"text": "২/২০০৫। ‘উমার (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফয়সালা দিয়েছেন যে, সন্তান বৈধ শয্যাধারীর (স্বামীর)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": 2006,
			"text": "৩/২০০৬। আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সন্তান বৈধ শয্যাধারীর (স্বামীর) এবং ব্যভিচারির জন্য রয়েছে পাথর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": 2007,
			"text": "৪/২০০৭। আবু উমামাহ আল-বাহিলী (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ সন্তান বৈধ শয্যাধারীর (স্বামীর) এবং ব্যভিভচারীর জন্য রয়েছে পাথর। তাহকীক",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": 2008,
			"text": "১/২০০৮। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে ইসলাম গ্রহণ করার পর এক ব্যক্তি তাকে বিবাহ করলো। রাবী বলেন, তখন পূর্ব-স্বামী এসে বললো, হে আল্লাহর রসূল! আমি তো তার সাথেই ইসলাম গ্রহণ করেছি এবং সে আমার ইসলাম গ্রহণ সম্পর্কে জানে। রাবী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহিলাটিকে তার দ্বিতীয় স্বামীর থেকে বিচ্ছিন্ন করে তার প্রথম স্বামীকে ফেরত দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": 2009,
			"text": "২/২০০৯। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যাকে প্রথম বিবাহের সুবাদে দু’ বছর পর আবূল আস ইবনুর রবী (রাঃ)-এর নিকট ফেরত পাঠান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": 2010,
			"text": "৩/২০১০। ‘আবদুল্লাহ্ বিন ‘আমর (রহ.) থেকে বর্ণিত। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যা যয়নব (রাঃ)-কে নতুন বিবাহের মাধ্যমে আবূল আস ইবনুর রবী (রহ.)-এর নিকট ফেরত পাঠান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": 2011,
			"text": "১/২০১১। জুমামা বিনতে ওয়াহ্ব আল-আসদিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ আমি ইচ্ছা করেছিলাম যে, দুগ্ধদানের মুদ্দতে মহিলাদের সাথে সহবাস করতে নিষেধ করাবো। কিন্তু আমি দেখলাম যে, পারস্য ও রোমের অধিবাসীরা এমনটি করে, অথচ তাদের সন্তানদের কোন ক্ষতি হয় না। রাবী বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আযল সম্পর্কে জিজ্ঞেস করা হলো। আমি তাঁকে বলতে শুনেছিঃ এটি হচ্ছে গোপন হত্যার একটি পদ্ধতি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": 2012,
			"text": "২/২০১২। আসমা বিনতে ইয়াযীদ ইবনুস সাকান (রাঃ) থেকে বর্ণিত। তিনি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেনঃ তোমরা গোপনে তোমাদের সন্তানদের হত্যা করো না। সেই সত্তার শপথ যাঁর হাতে আমার প্রাণ! দুধপানের মেয়াদে স্ত্রীর সাথে সহবাস করলে আরোহীকে ঘোড়া তার পিঠ থেকে ভূলুন্ঠিত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": 2013,
			"text": "১/২০১৩। আবূ উমামাহ (রাঃ) থেকে বর্ণিত। তিনি বলেন, এক মহিলা তার দু’টি সন্তানসহ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসে। সে একটি সন্তানকে কোলে এবং অপরটিকে হাতে ধরে নিয়ে আসে। রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ গর্ভধারিনী (বহনকারিণী), সন্তান জন্মদানকারিণী এবং মমতাময়ী বা তারা তাদের স্বামীদের কষ্ট না দিলে তাদের মধ্যে যারা সালাতী তারা জান্নাতে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": 2014,
			"text": "২/২০১৪। মুআয ইবনু জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন কোন স্ত্রী তার স্বামীকে কষ্ট দেয়, তখন জান্নাতে তার আয়তালোচনা হুর স্ত্রীগণ বলতে থাকেঃ ওহে! আল্লাহ্ তোমার সর্বনাশ করুন। তুমি তাকে কষ্ট দিও না। সে তো তোমার নিকট অল্প দিনের মেহমান। অচিরেই সে তোমাকে ত্যাগ করে আমাদের নিকট চলে আসবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": 2015,
			"text": "১/২০১৫। ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হারাম বস্তু হালাল বস্তুকে হারাম করে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 171
			}
		}
	]
}