{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "ہم سے محمد بن مرحوم بیکندی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، انہوں نے کہا کہ ہم سے شریک بن عبداللہ بن ابی نمر نے بیان کیا کہ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا آپ نے ایک شخص ( کعب بن مرہ یا ابوسفیان ) کا ذکر کیا جو منبر کے سامنے والے دروازے سے جمعہ کے دن مسجد نبوی میں آیا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے خطبہ دے رہے تھے، اس نے بھی کھڑے کھڑے رسول اللہ صلی اللہ علیہ وسلم سے کہا یا رسول اللہ! ( بارش نہ ہونے سے ) جانور مر گئے اور راستے بند ہو گئے آپ اللہ تعالیٰ سے بارش کی دعا فرمائیے انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ کہتے ہی ہاتھ اٹھا دیئے آپ صلی اللہ علیہ وسلم نے دعا کی «اللهم اسقنا،‏‏‏‏ ‏‏‏‏اللهم اسقنا،‏‏‏‏ اللهم اسقنا» کہ اے اللہ! ہمیں سیراب کر۔ اے اللہ! ہمیں سیراب کر۔ اے اللہ! ہمیں سیراب کر۔ انس رضی اللہ عنہ نے کہا بخدا کہیں دور دور تک آسمان پر بادل کا کوئی ٹکڑا نظر نہیں آتا تھا اور نہ کوئی اور چیز ( ہوا وغیرہ جس سے معلوم ہو کہ بارش آئے گی ) اور ہمارے اور سلع پہاڑ کے درمیان کوئی مکان بھی نہ تھا ( کہ ہم بادل ہونے کے باوجود نہ دیکھ سکتے ہوں ) پہاڑ کے پیچھے سے ڈھال کے برابر بادل نمودار ہوا اور بیچ آسمان تک پہنچ کر چاروں طرف پھیل گیا اور بارش شروع ہو گئی، اللہ کی قسم! ہم نے سورج ایک ہفتہ تک نہیں دیکھا۔ پھر ایک شخص دوسرے جمعہ کو اسی دروازے سے آیا۔ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے خطبہ دے رہے تھے، اس شخص نے پھر آپ صلی اللہ علیہ وسلم کو کھڑے کھڑے ہی مخاطب کیا کہ یا رسول اللہ! ( بارش کی کثرت سے ) مال و منال پر تباہی آ گئی اور راستے بند ہو گئے۔ اللہ تعالیٰ سے دعا کیجئے کہ بارش روک دے۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہاتھ اٹھائے اور دعا کی «اللهم حوالينا ولا علينا،‏‏‏‏ ‏‏‏‏ اللهم على الآكام والجبال والآجام والظراب والأودية ومنابت الشجر» کہ یا اللہ اب ہمارے اردگرد بارش برسا ہم سے اسے روک دے۔ ٹیلوں، پہاڑوں، پہاڑیوں، وادیوں اور باغوں کو سیراب کر۔ انہوں نے کہا کہ اس دعا سے بارش ختم ہو گئی اور ہم نکلے تو دھوپ نکل چکی تھی۔ شریک نے کہا کہ میں نے انس رضی اللہ عنہ سے پوچھا کہ یہ وہی پہلا شخص تھا تو انہوں نے فرمایا کہ مجھے معلوم نہیں۔",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		}
	]
}