{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ مجھ سے لیث بن سعد نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے (دوسری سند) اور مجھ سے احمد بن صالح نے بیان کیا کہ ہم سے عنبسہ بن خالد نے بیان کیا، کہا کہ ہم سے یونس بن یزید نے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھ سے عروہ نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی زندگی میں سورج گرہن لگا، اسی وقت آپ صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے۔ انہوں نے بیان کیا کہ لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے پیچھے صف باندھی آپ صلی اللہ علیہ وسلم نے تکبیر کہی اور بہت دیر قرآن مجید پڑھتے رہے پھر تکبیر کہی اور بہت لمبا رکوع کیا پھر «سمع الله لمن حمده‏» کہہ کر کھڑے ہو گئے اور سجدہ نہیں کیا ( رکوع سے اٹھنے کے بعد ) پھر بہت دیر تک قرآن مجید پڑھتے رہے۔ لیکن پہلی قرآت سے کم، پھر تکبیر کے ساتھ رکوع میں چلے گئے اور دیر تک رکوع میں رہے، یہ رکوع بھی پہلے رکوع سے کم تھا۔ اب «سمع الله لمن حمده‏» اور «ربنا ولك الحمد‏» کہا پھر سجدہ میں گئے۔ آپ صلی اللہ علیہ وسلم نے دوسری رکعت میں بھی اسی طرح کیا ( ان دونوں رکعتوں میں ) پورے چار رکوع اور چار سجدے کئے۔ نماز سے فارغ ہونے سے پہلے ہی سورج صاف ہو چکا تھا۔ نماز کے بعد آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر خطبہ فرمایا اور پہلے اللہ تعالیٰ کی اس کی شان کے مطابق تعریف کی پھر فرمایا کہ سورج اور چاند اللہ کی دو نشانیاں ہیں ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا لیکن جب تم گرہن دیکھا کرو تو فوراً نماز کی طرف لپکو۔ زہری نے کہا کہ کثیر بن عباس اپنے بھائی عبداللہ بن عباس سے روایت کرتے تھے وہ سورج گرہن کا قصہ اس طرح بیان کرتے تھے جیسے عروہ نے عائشہ صدیقہ رضی اللہ عنہا سے نقل کیا۔ زہری نے کہا میں نے عروہ سے کہا تمہارے بھائی عبداللہ بن زبیر نے جس دن مدینہ میں سورج گرہن ہوا صبح کی نماز کی طرح دو رکعت پڑھی اور کچھ زیادہ نہیں کیا۔ انہوں نے کہا ہاں مگر وہ سنت کے طریق سے چوک گئے۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		}
	]
}