{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ ہم سے سلیمان بن ابی مسلم نے بیان کیا، ان سے طاؤس نے اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم جب رات میں تہجد کے لیے کھڑے ہوتے تو یہ دعا پڑھتے۔ «اللهم لك الحمد أنت قيم السموات والأرض ومن فيهن ولك الحمد،‏‏‏‏ ‏‏‏‏ لك ملك السموات والأرض ومن فيهن،‏‏‏‏ ‏‏‏‏ ولك الحمد أنت نور السموات والأرض،‏‏‏‏ ‏‏‏‏ ولك الحمد أنت الحق،‏‏‏‏ ‏‏‏‏ ووعدك الحق،‏‏‏‏ ‏‏‏‏ ولقاؤك حق،‏‏‏‏ ‏‏‏‏ وقولك حق،‏‏‏‏ ‏‏‏‏ والجنة حق،‏‏‏‏ ‏‏‏‏ والنار حق،‏‏‏‏ ‏‏‏‏ والنبيون حق،‏‏‏‏ ‏‏‏‏ ومحمد صلى الله عليه وسلم حق،‏‏‏‏ ‏‏‏‏ والساعة حق،‏‏‏‏ ‏‏‏‏ اللهم لك أسلمت،‏‏‏‏ ‏‏‏‏ وبك آمنت وعليك توكلت،‏‏‏‏ ‏‏‏‏ وإليك أنبت،‏‏‏‏ ‏‏‏‏ وبك خاصمت،‏‏‏‏ ‏‏‏‏ وإليك حاكمت،‏‏‏‏ ‏‏‏‏ فاغفر لي ما قدمت وما أخرت،‏‏‏‏ ‏‏‏‏ وما أسررت وما أعلنت،‏‏‏‏ ‏‏‏‏ أنت المقدم وأنت المؤخر،‏‏‏‏ ‏‏‏‏لا إله إلا أنت، لا إله غيرك» ( ترجمہ ) ”اے میرے اللہ! ہر طرح کی تعریف تیرے ہی لیے زیبا ہے، تو آسمان اور زمین اور ان میں رہنے والی تمام مخلوق کا سنبھالنے والا ہے اور حمد تمام کی تمام بس تیرے ہی لیے مناسب ہے آسمان اور زمین اور ان کی تمام مخلوقات پر حکومت صرف تیرے ہی لیے ہے اور تعریف تیرے ہی لیے ہے، تو آسمان اور زمین کا نور ہے اور تعریف تیرے ہی لیے زیبا ہے، تو سچا ہے، تیرا وعدہ سچا، تیری ملاقات سچی، تیرا فرمان سچا ہے، جنت سچ ہے، دوزخ سچ ہے، انبیاء سچے ہیں۔ محمد صلی اللہ علیہ وسلم سچے ہیں اور قیامت کا ہونا سچ ہے۔ اے میرے اللہ! میں تیرا ہی فرماں بردار ہوں اور تجھی پر ایمان رکھتا ہوں، تجھی پر بھروسہ ہے، تیری ہی طرف رجوع کرتا ہوں، تیرے ہی عطا کئے ہوئے دلائل کے ذریعہ بحث کرتا ہوں اور تجھی کو حکم بناتا ہوں۔ پس جو خطائیں مجھ سے پہلے ہوئیں اور جو بعد میں ہوں گی ان سب کی مغفرت فرما، خواہ وہ ظاہر ہوئی ہوں یا پوشیدہ۔ آگے کرنے والا اور پیچھے رکھنے والا تو ہی ہے۔ معبود صرف تو ہی ہے۔ یا ( یہ کہا کہ ) تیرے سوا کوئی معبود نہیں“۔ ابوسفیان نے بیان کیا کہ عبدالکریم ابوامیہ نے اس دعا میں یہ زیادتی کی ہے ( «لا حول ولا قوة إلا بالله» ) سفیان نے بیان کیا کہ سلیمان بن مسلم نے طاؤس سے یہ حدیث سنی تھی، انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		}
	]
}