{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "محمود نے کہا کہ میں نے عتبان بن مالک انصاری رضی اللہ عنہ سے سنا جو بدر کی لڑائی میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک تھے، وہ کہتے تھے کہ میں اپنی قوم بنی سالم کو نماز پڑھایا کرتا تھا میرے ( گھر ) اور قوم کی مسجد کے بیچ میں ایک نالہ تھا، اور جب بارش ہوتی تو اسے پار کر کے مسجد تک پہنچنا میرے لیے مشکل ہو جاتا تھا۔ چنانچہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے میں نے کہا کہ میری آنکھیں خراب ہو گئی ہیں اور ایک نالہ ہے جو میرے اور میری قوم کے درمیان پڑتا ہے، وہ بارش کے دنوں میں بہنے لگ جاتا ہے اور میرے لیے اس کا پار کرنا مشکل ہو جاتا ہے۔ میری یہ خواہش ہے کہ آپ صلی اللہ علیہ وسلم تشریف لا کر میرے گھر کسی جگہ نماز پڑھ دیں تاکہ میں اسے اپنے لیے نماز پڑھنے کی جگہ مقرر کر لوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری یہ خواہش جلد ہی پوری کروں گا۔ پھر دوسرے ہی دن آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کو ساتھ لے کر صبح تشریف لے آئے اور آپ صلی اللہ علیہ وسلم نے اجازت چاہی اور میں نے اجازت دے دی۔ آپ صلی اللہ علیہ وسلم تشریف لا کر بیٹھے بھی نہیں بلکہ پوچھا کہ تم اپنے گھر میں کس جگہ میرے لیے نماز پڑھنا پسند کرو گے۔ میں جس جگہ کو نماز پڑھنے کے لیے پسند کر چکا تھا اس کی طرف میں نے اشارہ کر دیا۔ رسول اللہ صلی اللہ علیہ وسلم نے وہاں کھڑے ہو کر تکبیر تحریمہ کہی اور ہم سب نے آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھ لی۔ آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی پھر سلام پھیرا۔ ہم نے بھی آپ کے ساتھ سلام پھیرا۔ میں نے حلیم کھانے کے لیے آپ صلی اللہ علیہ وسلم کو روک لیا جو تیار ہو رہا تھا۔ محلہ والوں نے جو سنا کہ رسول اللہ صلی اللہ علیہ وسلم میرے گھر تشریف فرما ہیں تو لوگ جلدی جلدی جمع ہونے شروع ہو گئے اور گھر میں ایک خاصا مجمع ہو گیا۔ ان میں سے ایک شخص بولا۔ مالک کو کیا ہو گیا ہے! یہاں دکھائی نہیں دیتا۔ اس پر دوسرا بولا وہ تو منافق ہے۔ اسے اللہ اور رسول سے محبت نہیں ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا۔ ایسا مت کہو، دیکھتے نہیں کہ وہ «لا إله إلا الله‏» پڑھتا ہے اور اس سے اس کا مقصد اللہ تعالیٰ کی خوشنودی ہے۔ تب وہ کہنے لگا کہ ( اصل حال ) تو اللہ اور رسول کو معلوم ہے۔ لیکن واللہ! ہم تو ان کی بات چیت اور میل جول ظاہر میں منافقوں ہی سے دیکھتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا لیکن اللہ تعالیٰ نے ہر اس آدمی پر دوزخ حرام کر دی ہے جس نے «لا إله إلا الله‏» اللہ کی رضا اور خوشنودی کے لیے کہہ لیا۔ محمود بن ربیع نے بیان کیا کہ میں نے یہ حدیث ایک ایسی جگہ میں بیان کی جس میں نبی کریم صلی اللہ علیہ وسلم کے مشہور صحابی ابوایوب انصاری رضی اللہ عنہ بھی موجود تھے۔ یہ روم کے اس جہاد کا ذکر ہے جس میں آپ کی موت واقع ہوئی تھی۔ فوج کے سردار یزید بن معاویہ تھے۔ ابوایوب رضی اللہ عنہ نے اس حدیث سے انکار کیا اور فرمایا کہ اللہ کی قسم! میں نہیں سمجھتا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایسی بات کبھی بھی کہی ہو۔ آپ کی یہ گفتگو مجھ کو بہت ناگوار گزری اور میں نے اللہ تعالیٰ کی منت مانی کہ اگر میں اس جہاد سے سلامتی کے ساتھ لوٹا تو واپسی پر اس حدیث کے بارے میں عتبان بن مالک رضی اللہ عنہ سے ضرور پوچھوں گا۔ اگر میں نے انہیں ان کی قوم کی مسجد میں زندہ پایا۔ آخر میں جہاد سے واپس ہوا۔ پہلے تو میں نے حج اور عمرہ کا احرام باندھا پھر جب مدینہ واپسی ہوئی تو میں قبیلہ بنو سالم میں آیا۔ عتبان رضی اللہ عنہ جو بوڑھے اور نابینا ہو گئے تھے، اپنی قوم کو نماز پڑھاتے ہوئے ملے۔ سلام پھیرنے کے بعد میں نے حاضر ہو کر آپ کو سلام کیا اور بتلایا کہ میں فلاں ہوں۔ پھر میں نے اس حدیث کے متعلق دریافت کیا تو آپ نے مجھ سے اس مرتبہ بھی اس طرح یہ حدیث بیان کی جس طرح پہلے بیان کی تھی۔",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		}
	]
}