{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے عمرو بن حارث نے خبر دی، انہیں بکیر نے، انہیں کریب نے کہ ابن عباس، مسور بن مخرمہ اور عبدالرحمٰن بن ازہر رضی اللہ عنہم نے انہیں عائشہ رضی اللہ عنہا کی خدمت میں بھیجا اور کہا عائشہ رضی اللہ عنہا سے ہم سب کا سلام کہنا اور اس کے بعد عصر کے بعد کی دو رکعتوں کے بارے میں دریافت کرنا۔ انہیں یہ بھی بتا دینا کہ ہمیں خبر ہوئی ہے کہ آپ یہ دو رکعتیں پڑھتی ہیں۔ حالانکہ ہمیں نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث پہنچی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان دو رکعتوں سے منع کیا ہے اور ابن عباس رضی اللہ عنہما نے کہا کہ میں نے عمر بن خطاب رضی اللہ عنہ کے ساتھ ان رکعتوں کے پڑھنے پر لوگوں کو مارا بھی تھا۔ کریب نے بیان کیا کہ میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور پیغام پہنچایا۔ اس کا جواب آپ نے یہ دیا کہ ام سلمہ رضی اللہ عنہا سے اس کے متعلق دریافت کر۔ چنانچہ میں ان حضرات کی خدمت میں واپس ہوا اور عائشہ رضی اللہ عنہا کی گفتگو نقل کر دی، انہوں نے مجھے ام سلمہ رضی اللہ عنہا کی خدمت میں بھیجا انہیں پیغامات کے ساتھ جن کے ساتھ عائشہ رضی اللہ عنہا کے یہاں بھیجا تھا۔ ام سلمہ رضی اللہ عنہا نے یہ جواب دیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ آپ صلی اللہ علیہ وسلم عصر کے بعد نماز پڑھنے سے روکتے تھے لیکن ایک دن میں نے دیکھا کہ عصر کے بعد آپ صلی اللہ علیہ وسلم خود یہ دو رکعتیں پڑھ رہے ہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم میرے گھر تشریف لائے۔ میرے پاس انصار کے قبیلہ بنو حرام کی چند عورتیں بیٹھی ہوئی تھیں۔ اس لیے میں نے ایک باندی کو آپ صلی اللہ علیہ وسلم کی خدمت میں بھیجا۔ میں نے اس سے کہہ دیا تھا کہ وہ آپ صلی اللہ علیہ وسلم کے بازو میں ہو کر یہ پوچھے کہ ام سلمہ کہتی ہیں کہ یا رسول اللہ! آپ تو ان دو رکعتوں سے منع کیا کرتے تھے حالانکہ میں دیکھ رہی ہوں کہ آپ صلی اللہ علیہ وسلم خود انہیں پڑھتے ہیں۔ اگر نبی کریم صلی اللہ علیہ وسلم ہاتھ سے اشارہ کریں تو تم پیچھے ہٹ جانا۔ باندی نے پھر اسی طرح کیا اور آپ صلی اللہ علیہ وسلم نے ہاتھ سے اشارہ کیا تو پیچھے ہٹ گئی۔ پھر جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو ( آپ نے ام سلمہ رضی اللہ عنہا سے ) فرمایا کہ اے ابوامیہ کی بیٹی! تم نے عصر کے بعد کی دو رکعتوں کے متعلق پوچھا، بات یہ ہے کہ میرے پاس عبدالقیس کے کچھ لوگ آ گئے تھے اور ان کے ساتھ بات کرنے میں میں ظہر کے بعد کی دو رکعتیں نہیں پڑھ سکا تھا سو یہ وہی دو رکعت ہیں۔",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		}
	]
}