{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "ہم سے عبدان نے بیان کیا ‘ کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ انہوں نے کہا ہمیں لیث بن سعد نے خبر دی ‘ انہوں نے کہا کہ مجھ سے ابن شہاب نے بیان کیا۔ ان سے عبدالرحمٰن بن کعب بن مالک نے ‘ اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہما نے بیان کیا کہ احد کے شہداء کو نبی کریم صلی اللہ علیہ وسلم ایک کفن میں دو دو کو ایک ساتھ کر کے پوچھتے تھے کہ قرآن کس کو زیادہ یاد تھا۔ پھر جب کسی ایک کی طرف اشارہ کر دیا جاتا تو بغلی قبر میں اسے آگے کر دیا جاتا۔ پھر آپ صلی اللہ علیہ وسلم فرماتے کہ میں قیامت کو ان ( کے ایمان ) پر گواہ بنوں گا۔ آپ صلی اللہ علیہ وسلم نے انہیں بغیر غسل دئیے خون سمیت دفن کرنے کا حکم دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1353.5,
			"arabicnumber": 1353.5,
			"text": "ہم سے عبدان نے بیان کیا ‘ کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ انہیں یونس نے ‘ انہیں زہری نے ‘ کہا کہ مجھے سالم بن عبداللہ نے خبر دی کہ انہیں ابن عمر رضی اللہ عنہما نے خبر دی کہ عمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کچھ دوسرے اصحاب کی معیت میں ابن صیاد کے پاس گئے۔ آپ صلی اللہ علیہ وسلم کو وہ بنو مغالہ کے مکانوں کے پاس بچوں کے ساتھ کھیلتا ہوا ملا۔ ان دنوں ابن صیاد جوانی کے قریب تھا۔ اسے نبی کریم صلی اللہ علیہ وسلم کے آنے کی کوئی خبر ہی نہیں ہوئی۔ لیکن آپ صلی اللہ علیہ وسلم نے اس پر اپنا ہاتھ رکھا تو اسے معلوم ہوا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے ابن صیاد! کیا تم گواہی دیتے ہو کہ میں اللہ کا رسول ہوں۔ ابن صیاد رسول اللہ صلی اللہ علیہ وسلم کی طرف دیکھ کر بولا ہاں میں گواہی دیتا ہوں کہ آپ ان پڑھوں کے رسول ہیں۔ پھر اس نے نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا۔ کیا آپ اس کی گواہی دیتے ہیں کہ میں بھی اللہ کا رسول ہوں؟ یہ بات سن کر رسول اللہ صلی اللہ علیہ وسلم نے اسے چھوڑ دیا اور فرمایا میں اللہ اور اس کے پیغمبروں پر ایمان لایا۔ پھر آپ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ تجھے کیا دکھائی دیتا ہے؟ ابن صیاد بولا کہ میرے پاس سچی اور جھوٹی دونوں خبریں آتی ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر تو تیرا سب کام گڈمڈ ہو گیا۔ پھر آپ صلی اللہ علیہ وسلم نے اس سے فرمایا اچھا میں نے ایک بات دل میں رکھی ہے وہ بتلا۔ ( آپ صلی اللہ علیہ وسلم نے سورۃ الدخان کی آیت کا تصور کیا «فارتقب يوم تاتی السماء بدخان مبين» ) ابن صیاد نے کہا وہ «دخ» ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا چل دور ہو تو اپنی بساط سے آگے کبھی نہ بڑھ سکے گا۔ عمر رضی اللہ عنہ نے فرمایا یا رسول اللہ! مجھ کو چھوڑ دیجئیے میں اس کی گردن مار دیتا ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا ‘ اگر یہ دجال ہے تو، تو اس پر غالب نہ ہو گا اور اگر دجال نہیں ہے تو اس کا مار ڈالنا تیرے لیے بہتر نہ ہو گا۔",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}