{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے جریر بن حازم نے بیان کیا ‘ کہا کہ ہم سے ابورجاء عمران بن تمیم نے بیان کیا اور ان سے سمرہ بن جندب رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نماز ( فجر ) پڑھنے کے بعد ( عموماً ) ہماری طرف منہ کر کے بیٹھ جاتے اور پوچھتے کہ آج رات کسی نے کوئی خواب دیکھا ہو تو بیان کرو۔ راوی نے کہا کہ اگر کسی نے کوئی خواب دیکھا ہوتا تو اسے وہ بیان کر دیتا اور آپ صلی اللہ علیہ وسلم اس کی تعبیر اللہ کو جو منظور ہوتی بیان فرماتے۔ ایک دن آپ صلی اللہ علیہ وسلم نے معمول کے مطابق ہم سے دریافت فرمایا کیا آج رات کسی نے تم میں کوئی خواب دیکھا ہے؟ ہم نے عرض کی کہ کسی نے نہیں دیکھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا لیکن میں نے آج رات ایک خواب دیکھا ہے کہ دو آدمی میرے پاس آئے۔ انہوں نے میرے ہاتھ تھام لیے اور وہ مجھے ارض مقدس کی طرف لے گئے۔ ( اور وہاں سے عالم بالا کی مجھ کو سیر کرائی ) وہاں کیا دیکھتا ہوں کہ ایک شخص تو بیٹھا ہوا ہے اور ایک شخص کھڑا ہے اور اس کے ہاتھ میں ( امام بخاری رحمہ اللہ نے کہا کہ ) ہمارے بعض اصحاب نے ( غالباً عباس بن فضیل اسقاطی نے موسیٰ بن اسماعیل سے یوں روایت کیا ہے ) لوہے کا آنکس تھا جسے وہ بیٹھنے والے کے جبڑے میں ڈال کر اس کے سر کے پیچھے تک چیر دیتا پھر دوسرے جبڑے کے ساتھ بھی اسی طرح کرتا تھا۔ اس دوران میں اس کا پہلا جبڑا صحیح اور اپنی اصلی حالت پر آ جاتا اور پھر پہلے کی طرح وہ اسے دوبارہ چیرتا۔ میں نے پوچھا کہ یہ کیا ہو رہا ہے؟ میرے ساتھ کے دونوں آدمیوں نے کہا کہ آگے چلیں۔ چنانچہ ہم آگے بڑھے تو ایک ایسے شخص کے پاس آئے جو سر کے بل لیٹا ہوا تھا اور دوسرا شخص ایک بڑا سا پتھر لیے اس کے سر پر کھڑا تھا۔ اس پتھر سے وہ لیٹے ہوئے شخص کے سر کو کچل دیتا تھا۔ جب وہ اس کے سر پر پتھر مارتا تو سر پر لگ کر وہ پتھر دور چلا جاتا اور وہ اسے جا کر اٹھا لاتا۔ ابھی پتھر لے کر واپس بھی نہیں آتا تھا کہ سر دوبارہ درست ہو جاتا۔ بالکل ویسا ہی جیسا پہلے تھا۔ واپس آ کر وہ پھر اسے مارتا۔ میں نے پوچھا کہ یہ کون لوگ ہیں؟ ان دونوں نے جواب دیا کہ ابھی اور آگے چلیں۔ چنانچہ ہم آگے بڑھے تو ایک تنور جیسے گڑھے کی طرف چلے۔ جس کے اوپر کا حصہ تو تنگ تھا لیکن نیچے سے خوب فراخ۔ نیچے آگ بھڑک رہی تھی۔ جب آگ کے شعلے بھڑک کر اوپر کو اٹھتے تو اس میں جلنے والے لوگ بھی اوپر اٹھ آتے اور ایسا معلوم ہوتا کہ اب وہ باہر نکل جائیں گے لیکن جب شعلے دب جاتے تو وہ لوگ بھی نیچے چلے جاتے۔ اس تنور میں ننگے مرد اور عورتیں تھیں۔ میں نے اس موقع پر بھی پوچھا کہ یہ کیا ہے؟ لیکن اس مرتبہ بھی جواب یہی ملا کہا کہ ابھی اور آگے چلیں ‘ ہم آگے چلے۔ اب ہم خون کی ایک نہر کے اوپر تھے نہر کے اندر ایک شخص کھڑا تھا اور اس کے بیچ میں ( یزید بن ہارون اور وہب بن جریر نے جریر بن حازم کے واسطہ سے «وسطه النهر» کے بجائے «شط النهر» نہر کے کنارے کے الفاظ نقل کئے ہیں ) ایک شخص تھا۔ جس کے سامنے پتھر رکھا ہوا تھا۔ نہر کا آدمی جب باہر نکلنا چاہتا تو پتھر والا شخص اس کے منہ پر اتنی زور سے پتھر مارتا کہ وہ اپنی پہلی جگہ پر چلا جاتا اور اسی طرح جب بھی وہ نکلنے کی کوشش کرتا وہ شخص اس کے منہ پر پتھر اتنی ہی زور سے پھر مارتا کہ وہ اپنی اصلی جگہ پر نہر میں چلا جاتا۔ میں نے پوچھا یہ کیا ہو رہا ہے؟ انہوں نے جواب دیا کہ ابھی اور آگے چلیں۔ چنانچہ ہم اور آگے بڑھے اور ایک ہرے بھرے باغ میں آئے۔ جس میں ایک بہت بڑا درخت تھا اس درخت کی جڑ میں ایک بڑی عمر والے بزرگ بیٹھے ہوئے تھے اور ان کے ساتھ کچھ بچے بھی بیٹھے ہوئے تھے۔ درخت سے قریب ہی ایک شخص اپنے آگے آگ سلگا رہا تھا۔ وہ میرے دونوں ساتھی مجھے لے کر اس درخت پر چڑھے۔ اس طرح وہ مجھے ایک ایسے گھر میں لے گئے کہ اس سے زیادہ حسین و خوبصورت اور بابرکت گھر میں نے کبھی نہیں دیکھا تھا۔ اس گھر میں بوڑھے، جوان ‘ عورتیں اور بچے ( سب ہی قسم کے لوگ ) تھے۔ میرے ساتھی مجھے اس گھر سے نکال کر پھر ایک اور درخت پر چڑھا کر مجھے ایک اور دوسرے گھر میں لے گئے جو نہایت خوبصورت اور بہتر تھا۔ اس میں بھی بہت سے بوڑھے اور جوان تھے۔ میں نے اپنے ساتھیوں سے کہا تم لوگوں نے مجھے رات بھر خوب سیر کرائی۔ کیا جو کچھ میں نے دیکھا اس کی تفصیل بھی کچھ بتلاؤ گے؟ انہوں نے کہا ہاں وہ جو آپ نے دیکھا تھا اس آدمی کا جبڑا لوہے کے آنکس سے پھاڑا جا رہا تھا تو وہ جھوٹا آدمی تھا جو جھوٹی باتیں بیان کیا کرتا تھا۔ اس سے وہ جھوٹی باتیں دوسرے لوگ سنتے۔ اس طرح ایک جھوٹی بات دور دور تک پھیل جایا کرتی تھی۔ اسے قیامت تک یہی عذاب ہوتا رہے گا۔ جس شخص کو آپ نے دیکھا کہ اس کا سر کچلا جا رہا تھا تو وہ ایک ایسا انسان تھا جسے اللہ تعالیٰ نے قرآن کا علم دیا تھا لیکن وہ رات کو پڑا سوتا رہتا اور دن میں اس پر عمل نہیں کرتا تھا۔ اسے بھی یہ عذاب قیامت تک ہوتا رہے گا اور جنہیں آپ نے تنور میں دیکھا تو وہ زنا کار تھے۔ اور جس کو آپ نے نہر میں دیکھا وہ سود خوار تھا اور وہ بزرگ جو درخت کی جڑ میں بیٹھے ہوئے تھے وہ ابراہیم علیہ السلام تھے اور ان کے اردگرد والے بچے ‘ لوگوں کی نابالغ اولاد تھی اور جو شخص آگ جلا رہا تھا وہ دوزخ کا داروغہ تھا اور وہ گھر جس میں آپ پہلے داخل ہوئے جنت میں عام مومنوں کا گھر تھا اور یہ گھر جس میں آپ اب کھڑے ہیں ‘ یہ شہداء کا گھر ہے اور میں جبرائیل ہوں اور یہ میرے ساتھ میکائیکل ہیں۔ اچھا اب اپنا سر اٹھاؤ میں نے جو سر اٹھایا تو کیا دیکھتا ہوں کہ میرے اوپر بادل کی طرح کوئی چیز ہے۔ میرے ساتھیوں نے کہا کہ یہ آپ کا مکان ہے۔ اس پر میں نے کہا کہ پھر مجھے اپنے مکان میں جانے دو۔ انہوں نے کہا کہ ابھی آپ کی عمر باقی ہے جو آپ نے پوری نہیں کی اگر آپ وہ پوری کر لیتے تو اپنے مکان میں آ جاتے۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		}
	]
}