{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "ہم سے قتیبہ نے بیان کیا ‘ کہا کہ ہم سے جریر نے اعمش سے بیان کیا ‘ ان سے ابووائل نے ‘ انہوں نے حذیفہ بن یمان رضی اللہ عنہ سے کہ عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ فتنہ سے متعلق رسول اللہ صلی اللہ علیہ وسلم کی حدیث آپ لوگوں میں کس کو یاد ہے؟ حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے کہا میں اس طرح یاد رکھتا ہوں جس طرح نبی کریم صلی اللہ علیہ وسلم نے اس کو بیان فرمایا تھا۔ اس پر عمر رضی اللہ عنہ نے فرمایا کہ تمہیں اس کے بیان پر جرات ہے۔ اچھا تو نبی کریم صلی اللہ علیہ وسلم نے فتنوں کے بارے میں کیا فرمایا تھا؟ میں نے کہا کہ ( آپ صلی اللہ علیہ وسلم نے فرمایا تھا ) انسان کی آزمائش ( فتنہ ) اس کے خاندان ‘ اولاد اور پڑوسیوں میں ہوتی ہے اور نماز ‘ صدقہ اور اچھی باتوں کے لیے لوگوں کو حکم کرنا اور بری باتوں سے منع کرنا اس فتنے کا کفارہ بن جاتی ہیں۔ اعمش نے کہا ابووائل کبھی یوں کہتے تھے۔ نماز اور صدقہ اور اچھی باتوں کا حکم دینا بری بات سے روکنا ‘ یہ اس فتنے کو مٹا دینے والے نیک کام ہیں۔ پھر اس فتنے کے متعلق عمر رضی اللہ عنہ نے فرمایا کہ میری مراد اس فتنہ سے نہیں۔ میں اس فتنے کے بارے میں پوچھنا چاہتا ہوں جو سمندر کی طرح ٹھاٹھیں مارتا ہوا پھیلے گا۔ حذیفہ رضی اللہ عنہ نے بیان کیا ‘ میں نے کہا کہ امیرالمؤمنین آپ اس فتنے کی فکر نہ کیجئے آپ کے اور اس فتنہ کے درمیان ایک بند دروازہ ہے۔ عمر رضی اللہ عنہ نے پوچھا کہ وہ دروازہ توڑ دیا جائے گا یا صرف کھولا جائے گا۔ انہوں نے بتلایا نہیں بلکہ وہ دروازہ توڑ دیا جائے گا۔ اس پر عمر رضی اللہ عنہ نے فرمایا کہ جب دروازہ توڑ دیا جائے گا تو پھر کبھی بھی بند نہ ہو سکے گا ابووائل نے کہا کہ ہاں پھر ہم رعب کی وجہ سے حذیفہ رضی اللہ عنہ سے یہ نہ پوچھ سکے کہ وہ دروازہ کون ہے؟ اس لیے ہم نے مسروق سے کہا کہ تم پوچھو۔ انہوں نے کہا کہ مسروق رحمتہ اللہ علیہ نے پوچھا تو حذیفہ رضی اللہ عنہ نے فرمایا کہ دروازہ سے مراد خود عمر رضی اللہ عنہ ہی تھے۔ ہم نے پھر پوچھا تو کیا عمر رضی اللہ عنہ جانتے تھے کہ آپ کی مراد کون تھی؟ انہوں نے کہا ہاں جیسے دن کے بعد رات کے آنے کو جانتے ہیں اور یہ اس لیے کہ میں نے جو حدیث بیان کی وہ غلط نہیں تھی۔",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		}
	]
}