{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "ہم سے محمد بن عبداللہ بن مثنیٰ انصاری نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے میرے والد نے بیان کیا ‘ انہوں نے کہا کہ مجھ ثمامہ بن عبداللہ بن انس نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے کہ ابوبکر رضی اللہ عنہ نے جب انہیں بحرین ( کا حاکم بنا کر ) بھیجا تو ان کو یہ پروانہ لکھ دیا۔ شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم کرنے والا ہے۔ یہ زکوٰۃ کا وہ فریضہ ہے جسے رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں کے لیے فرض قرار دیا ہے اور رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے اس کا حکم دیا۔ اس لیے جو شخص مسلمانوں سے اس پروانہ کے مطابق زکوٰۃ مانگے تو مسلمانوں کو اسے دے دینا چاہیے اور اگر کوئی اس سے زیادہ مانگے تو ہرگز نہ دے۔ چوبیس یا اس سے کم اونٹوں میں ہر پانچ اونٹ پر ایک بکری دینی ہو گی۔ ( پانچ سے کم میں کچھ نہیں ) لیکن جب اونٹوں کی تعداد پچیس تک پہنچ جائے تو پچیس سے پینتیس تک ایک ایک برس کی اونٹنی واجب ہو گی جو مادہ ہوتی ہے۔ جب اونٹ کی تعداد چھتیس تک پہنچ جائے ( تو چھتیس سے ) پینتالیس تک دو برس کی مادہ واجب ہو گی۔ جب تعداد چھیالیس تک پہنچ جائے ( تو چھیالیس سے ) ساٹھ تک میں تین برس کی اونٹنی واجب ہو گی جو جفتی کے قابل ہوتی ہے۔ جب تعداد اکسٹھ تک پہنچ جائے ( تو اکسٹھ سے ) پچھتر تک چار برس کی مادہ واجب ہو گی۔ جب تعداد چھہتر تک پہنچ جائے ( تو چھہتر سے ) نوے تک دو دو برس کی دو اونٹنیاں واجب ہوں گی۔ جب تعداد اکیانوے تک پہنچ جائے تو ( اکیانوے سے ) ایک سو بیس تک تین تین برس کی دو اونٹنیاں واجب ہوں گی جو جفتی کے قابل ہوں۔ پھر ایک سو بیس سے بھی تعداد آگے بڑھ جائے تو ہر چالیس پر دو برس کی اونٹنی واجب ہو گی اور ہر پچاس پر ایک تین برس کی۔ اور اگر کسی کے پاس چار اونٹ سے زیادہ نہیں تو اس پر زکوٰۃ واجب نہ ہو گی مگر جب ان کا مالک اپنی خوشی سے کچھ دے اور ان بکریوں کی زکوٰۃ جو ( سال کے اکثر حصے جنگل یا میدان وغیرہ میں ) چر کر گزارتی ہیں اگر ان کی تعداد چالیس تک پہنچ گئی ہو تو ( چالیس سے ) ایک سو بیس تک ایک بکری واجب ہو گی اور جب ایک سو بیس سے تعداد بڑھ جائے ( تو ایک سو بیس سے ) سے دو سو تک دو بکریاں واجب ہوں گی۔ اگر دو سو سے بھی تعداد بڑھ جائے تو ( تو دو سو سے ) تین سو تک تین بکریاں واجب ہوں گی اور جب تین سو سے بھی تعداد آگے نکل جائے تو اب ہر ایک سو پر ایک بکری واجب ہو گی۔ اگر کسی شخص کی چرنے والی بکریاں چالیس سے ایک بھی کم ہوں تو ان پر زکوٰۃ واجب نہیں ہو گی مگر اپنی خوشی سے مالک کچھ دینا چاہے تو دے سکتا ہے۔ اور چاندی میں زکوٰۃ چالیسواں حصہ واجب ہو گی لیکن اگر کسی کے پاس ایک سو نوے ( درہم ) سے زیادہ نہیں ہیں تو اس پر زکوٰۃ واجب نہیں ہو گی مگر خوشی سے کچھ اگر مالک دینا چاہیے تو اور بات ہے۔",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		}
	]
}