{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "اور ابو کامل فضیل بن حسین بصریٰ نے کہا کہ ہم سے ابومعشر یوسف بن یزید براء نے بیان کیا، کہا کہ ہم سے عثمان بن غیاث نے بیان کیا، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے، ابن عباس رضی اللہ عنہما سے حج میں تمتع کے متعلق پوچھا گیا۔ آپ نے فرمایا کہ حجۃ الوداع کے موقع پر مہاجرین انصار نبی کریم صلی اللہ علیہ وسلم کی ازواج اور ہم سب نے احرام باندھا تھا۔ جب ہم مکہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے احرام کو حج اور عمرہ دونوں کے لیے کر لو لیکن جو لوگ قربانی کا جانور اپنے ساتھ لائے ہیں۔ ( وہ عمرہ کرنے کے بعد حلال نہیں ہوں گے ) چنانچہ ہم نے بیت اللہ کا طواف اور صفا و مروہ کی سعی کر لی تو اپنا احرام کھول ڈالا اور ہم اپنی بیویوں کے پاس گئے اور سلے ہوئے کپڑے پہنے۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جس کے ساتھ قربانی کا جانور ہے وہ اس وقت تک حلال نہیں ہو سکتا جب تک ہدی اپنی جگہ نہ پہنچ لے ( یعنی قربانی نہ ہولے ) ہمیں ( جنہوں نے ہدی ساتھ نہیں لی تھی ) آپ صلی اللہ علیہ وسلم نے آٹھویں تاریخ کی شام کو حکم دیا کہ ہم حج کا احرام باندھ لیں۔ پھر جب ہم مناسک حج سے فارغ ہو گئے تو ہم نے آ کر بیت اللہ کا طواف اور صفا مروہ کی سعی کی، پھر ہمارا حج پورا ہو گیا اور اب قربانی ہم پر لازم ہوئی۔ جیسا کہ اللہ تعالیٰ کا ارشاد ہے ”جسے قربانی کا جانور میسر ہو ( تو وہ قربانی کرے ) اور اگر کسی کو قربانی کی طاقت نہ ہو تو تین روزے حج میں اور سات دن گھر واپس ہونے پر رکھے ( قربانی میں ) بکری بھی کافی ہے۔ تو لوگوں نے حج اور عمرہ دونوں عبادتیں ایک ہی سال میں ایک ساتھ ادا کیں۔ کیونکہ اللہ تعالیٰ نے خود اپنی کتاب میں یہ حکم نازل کیا تھا اور رسول اللہ صلی اللہ علیہ وسلم نے اس پر خود عمل کر کے تمام لوگوں کے لیے جائز قرار دیا تھا۔ البتہ مکہ کے باشندوں کا اس سے استثناء ہے۔ کیونکہ اللہ تعالیٰ کا فرمان ہے ”یہ حکم ان لوگوں کے لیے ہے جن کے گھر والے مسجد الحرام کے پاس رہنے والے نہ ہوں“۔ اور حج کے جن مہینوں کا قرآن میں ذکر ہے وہ شوال، ذیقعدہ اور ذی الحجہ ہیں۔ ان مہینوں میں جو کوئی بھی تمتع کرے وہ یا قربانی دے یا اگر مقدور نہ ہو تو روزے رکھے۔ اور «رفث» کا معنی جماع ( یا فحش باتیں ) اور «فسوق» گناہ اور «جدال» لوگوں سے جھگڑنا۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		}
	]
}