{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابوعامر نے بیان کیا، ان سے قرہ نے بیان کیا، ان سے محمد بن سیرین نے کہا کہ مجھے عبدالرحمٰن بن ابی بکرہ نے اور ایک اور شخص نے جو میرے نزدیک عبدالرحمٰن سے بھی افضل ہے یعنی حمید بن عبدالرحمٰن نے خبر دی کہ ابوبکر رضی اللہ عنہ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے دسویں تاریخ کو منیٰ میں خطبہ سنایا، آپ صلی اللہ علیہ وسلم نے پوچھا لوگو! معلوم ہے آج یہ کون سا دن ہے؟ ہم نے عرض کی اللہ اور اس کا رسول زیادہ جانتے ہیں، آپ صلی اللہ علیہ وسلم اس پر خاموش ہو گئے اور ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس دن کا کوئی اور نام رکھیں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ قربانی کا دن نہیں۔ ہم بولے ہاں ضرور ہے، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ مہینہ کون سا ہے؟ ہم نے کہا اللہ اور اس کے رسول زیادہ جانتے لیے۔ آپ اس مرتبہ بھی خاموش ہو گئے اور ہمیں خیال ہوا کہ آپ صلی اللہ علیہ وسلم اس مہینہ کا نام کوئی اور نام رکھیں گے، لیکن آپ نے فرمایا کیا یہ ذی الحجہ کا مہینہ نہیں ہے؟ ہم بولے کیوں نہیں، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ شہر کون سا ہے؟ ہم نے عرض کی اللہ اور اس کے رسول بہتر جانتے ہیں، اس مرتبہ بھی آپ صلی اللہ علیہ وسلم اس طرح خاموش ہو گئے کہ ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا شہر نہیں ہے؟ ہم نے عرض کی کیوں نہیں ضرور ہے، اس کے بعد آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا بس تمہارا خون اور تمہارے مال تم پر اسی طرح حرام ہیں جیسے اس دن کی حرمت اس مہینہ اور اس شہر میں ہے، تاآنکہ تم اپنے رب سے جا ملو۔ کہو کیا میں نے تم کو اللہ کا پیغام پہنچا دیا؟ لوگوں نے کہا کہ ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ! تو گواہ رہنا اور ہاں! یہاں موجود غائب کو پہنچا دیں کیونکہ بہت سے لوگ جن تک یہ پیغام پہنچے گا سننے والوں سے زیادہ ( پیغام کو ) یاد رکھنے والے ثابت ہوں گے اور میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی ( ناحق ) گردنیں مارنے لگو۔",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 219
			}
		}
	]
}