{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "ہم سے محمد بن مثنی نے بیان کیا، ان سے عبدالوہاب بن عبدالمجید نے، ان سے حبیب معلم نے، ان سے عطاء بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب نے حج کا احرام باندھا تھا اور نبی کریم صلی اللہ علیہ وسلم اور طلحہ رضی اللہ عنہ کے سوا قربانی کسی کے پاس نہیں تھی۔ ان ہی دنوں میں علی رضی اللہ عنہ یمن سے آئے تو ان کے ساتھ بھی قربانی تھی۔ انہوں نے کہا کہ جس چیز کا احرام رسول اللہ صلی اللہ علیہ وسلم نے باندھا ہے میرا بھی احرام وہی ہے، نبی کریم صلی اللہ علیہ وسلم نے اپنے اصحاب کو ( مکہ میں پہنچ کر ) اس کی اجازت دے دی تھی کہ اپنے حج کو عمرہ میں تبدیل کر دیں اور بیت اللہ کا طواف اور صفا و مروہ کی سعی کر کے بال ترشوا لیں اور احرام کھول دیں، لیکن وہ لوگ ایسا نہ کریں جن کے ساتھ قربانی ہو۔ اس پر لوگوں نے کہا کہ ہم منیٰ سے حج کے لیے اس طرح سے جائیں گے کہ ہمارے ذکر سے منی ٹپک رہی ہو۔ یہ بات رسول اللہ صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو بات اب ہوئی اگر پہلے سے معلوم ہوتی تو میں اپنے ساتھ ہدی نہ لاتا اور اگر میرے ساتھ ہدی نہ ہوتی تو ( افعال عمرہ ادا کرنے کے بعد ) میں بھی احرام کھول دیتا۔ عائشہ رضی اللہ عنہا ( اس حج میں ) حائضہ ہو گئی تھیں اس لیے انہوں نے اگرچہ تمام مناسک ادا کئے لیکن بیت اللہ کا طواف نہیں کیا۔ پھر جب وہ پاک ہو گئیں اور طواف کر لیا تو عرض کی یا رسول اللہ! سب لوگ حج اور عمرہ دونوں کر کے واپس ہو رہے ہیں لیکن میں صرف حج کر سکی ہوں، آپ صلی اللہ علیہ وسلم نے اس پر عبدالرحمٰن بن ابوبکر رضی اللہ عنہما سے کہا کہ انہیں ہمراہ لے کر تنعیم جائیں اور عمرہ کرا لائیں، یہ عمرہ حج کے بعد ذی الحجہ کے ہی مہینہ میں ہوا تھا۔ نبی کریم صلی اللہ علیہ وسلم جب جمرہ عقبہ کی رمی کر رہے تھے تو سراقہ بن مالک بن جعشم آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور پوچھا کہ یا رسول اللہ! کیا یہ ( عمرہ اور حج کے درمیان احرام کھول دینا ) صرف آپ ہی کے لیے ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ہمیشہ کے لیے ہے۔",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		}
	]
}