{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے عبدالوہاب نے بیان کیا، کہا کہ ہم سے عبیداللہ نے بیان کیا، ان سے وہب بن کیسان نے بیان کیا اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ ( ذات الرقاع یا تبوک ) میں تھا۔ میرا اونٹ تھک کر سست ہو گیا۔ اتنے میں میرے پاس نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور فرمایا جابر! میں نے عرض کیا: یا رسول اللہ! حاضر ہوں۔ فرمایا کیا بات ہوئی؟ میں نے کہا کہ میرا اونٹ تھک کر سست ہو گیا ہے، چلتا ہی نہیں اس لیے میں پیچھے رہ گیا ہوں۔ پھر آپ اپنی سواری سے اترے اور میرے اسی اونٹ کو ایک ٹیرھے منہ کی لکڑی سے کھینچنے لگے ( یعنی ہانکنے لگے ) اور فرمایا کہ اب سوار ہو جا۔ چنانچہ میں سوار ہو گیا۔ اب تو یہ حال ہوا کہ مجھے اسے رسول اللہ صلی اللہ علیہ وسلم کے برابر پہنچنے سے روکنا پڑ جاتا تھا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، جابر تو نے شادی بھی کر لی ہے؟ میں نے عرض کی جی ہاں! دریافت فرمایا کسی کنواری لڑکی سے کی ہے یا بیوہ سے۔ میں نے عرض کیا کہ میں نے تو ایک بیوہ سے کر لی ہے۔ فرمایا، کسی کنواری لڑکی سے کیوں نہ کی کہ تم اس کے ساتھ کھیلتے اور وہ بھی تمہارے ساتھ کھیلتی۔ ( جابر بھی کنوارے تھے ) میں نے عرض کیا کہ میری کئی بہنیں ہیں۔ ( اور میری ماں کا انتقال ہو چکا ہے ) اس لیے میں نے یہی پسند کیا کہ ایسی عورت سے شادی کروں، جو انہیں جمع رکھے۔ ان کے کنگھا کرے اور ان کی نگرانی کرے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اب تم گھر پہنچ کر خیر و عافیت کے ساتھ خوب مزے اڑانا۔ اس کے بعد فرمایا، کیا تم اپنا اونٹ بیچو گے؟ میں نے کہا جی ہاں! چنانچہ آپ صلی اللہ علیہ وسلم نے ایک اوقیہ چاندی میں خرید لیا، رسول اللہ صلی اللہ علیہ وسلم مجھ سے پہلے ہی مدینہ پہنچ گئے تھے۔ اور میں دوسرے دن صبح کو پہنچا۔ پھر ہم مسجد آئے تو نبی کریم صلی اللہ علیہ وسلم مسجد کے دروازہ پر ملے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، کیا ابھی آئے ہو؟ میں نے عرض کیا کہ جی ہاں! فرمایا، پھر اپنا اونٹ چھوڑ دے اور مسجد میں جا کے دو رکعت نماز پڑھ۔ میں اندر گیا اور نماز پڑھی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو حکم دیا کہ میرے لیے ایک اوقیہ چاندی تول دے۔ انہوں نے ایک اوقیہ چاندی جھکتی ہوئی تول دی۔ میں پیٹھ موڑ کر چلا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جابر کو ذرا بلاؤ۔ میں نے سوچا کہ شاید اب میرا اونٹ پھر مجھے واپس کریں گے۔ حالانکہ اس سے زیادہ ناگوار میرے لیے کوئی چیز نہیں تھی۔ چنانچہ آپ صلی اللہ علیہ وسلم نے یہی فرمایا کہ یہ اپنا اونٹ لے جا اور اس کی قیمت بھی تمہاری ہے۔",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 50
			}
		}
	]
}