{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا کہ ہم سے ابوعاصم نے بیان کیا کہا کہ ہم کو ابن جریج نے خبر دی، کہا کہ مجھے موسیٰ بن عقبہ نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا، تین شخص کہیں باہر جا رہے تھے کہ اچانک بارش ہونے لگی۔ انہوں نے ایک پہاڑ کے غار میں جا کر پناہ لی۔ اتفاق سے پہاڑ کی ایک چٹان اوپر سے لڑھکی ( اور اس غار کے منہ کو بند کر دیا جس میں یہ تینوں پناہ لیے ہوئے تھے ) اب ایک نے دوسرے سے کہا کہ اپنے سب سے اچھے عمل کا جو تم نے کبھی کیا ہو، نام لے کر اللہ تعالیٰ سے دعا کرو۔ اس پر ان میں سے ایک نے یہ دعا کی ”اے اللہ! میرے ماں باپ بہت ہی بوڑھے تھے۔ میں باہر لے جا کر اپنے مویشی چراتا تھا۔ پھر جب شام کو واپس آتا تو ان کا دودھ نکالتا اور برتن میں پہلے اپنے والدین کو پیش کرتا۔ جب میرے والدین پی چکتے تو پھر بچوں کو اور اپنی بیوی کو پلاتا۔ اتفاق سے ایک رات واپسی میں دیر ہو گئی اور جب میں گھر لوٹا تو والدین سو چکے تھے۔ اس نے کہا کہ پھر میں نے پسند نہیں کیا کہ انہیں جگاؤں بچے میرے قدموں میں بھوکے پڑے رو رہے تھے۔ میں برابر دودھ کا پیالہ لیے والدین کے سامنے اسی طرح کھڑا رہا یہاں تک کہ صبح ہو گئی۔ اے اللہ! اگر تیرے نزدیک بھی میں نے یہ کام صرف تیری رضا حاصل کرنے کے لیے کیا تھا، تو ہمارے لیے اس چٹان کو ہٹا کر اتنا راستہ تو بنا دے کہ ہم آسمان کو تو دیکھ سکیں“ نبی کریم صلی اللہ علیہ وسلم نے فرمایا۔ چنانچہ وہ پتھر کچھ ہٹ گیا۔ دوسرے شخص نے دعا کی ”اے اللہ! تو خوب جانتا ہے کہ مجھے اپنے چچا کی ایک لڑکی سے اتنی زیادہ محبت تھی جتنی ایک مرد کو کسی عورت سے ہو سکتی ہے۔ اس لڑکی نے کہا تم مجھ سے اپنی خواہش اس وقت تک پوری نہیں کر سکتے جب تک مجھے سو اشرفی نہ دے دو۔ میں نے ان کے حاصل کرنے کی کوشش کی، اور آخر اتنی اشرفی جمع کر لی۔ پھر جب میں اس کی دونوں رانوں کے درمیان بیٹھا۔ تو وہ بولی، اللہ سے ڈر، اور مہر کو ناجائز طریقے پر نہ توڑ۔ اس پر میں کھڑا ہو گیا اور میں نے اسے چھوڑ دیا۔ اب اگر تیرے نزدیک بھی میں نے یہ عمل تیری ہی رضا کے لیے کیا تھا تو ہمارے لیے ( نکلنے کا ) راستہ بنا دے“ نبی کریم صلی اللہ علیہ وسلم نے فرمایا۔ چنانچہ وہ پتھر دو تہائی ہٹ گیا۔ تیسرے شخص نے دعا کی ”اے اللہ! تو جانتا ہے کہ میں نے ایک مزدور سے ایک فرق جوار پر کام کرایا تھا۔ جب میں نے اس کی مزدوری اسے دے دی تو اس نے لینے سے انکار کر دیا۔ میں نے اس جوار کو لے کر بو دیا ( کھیتی جب کٹی تو اس میں اتنی جوار پیدا ہوئی کہ ) اس سے میں نے ایک بیل اور ایک چرواہا خرید لیا۔ کچھ عرصہ بعد پھر اس نے آ کر مزدوری مانگی کہ اللہ کے بندے مجھے میرا حق دیدے۔ میں نے کہا کہ اس بیل اور اس کے چرواہے کے پاس جاؤ کہ یہ تمہارے ہی ملک ہیں۔ اس نے کہا کہ مجھ سے مذاق کرتے ہو۔ میں نے کہا ”میں مذاق نہیں کرتا“ واقعی یہ تمہارے ہی ہیں۔ تو اے اللہ! اگر تیرے نزدیک یہ کام میں نے صرف تیری رضا حاصل کرنے کے لیے کیا تھا تو یہاں ہمارے لیے ( اس چٹان کو ہٹا کر ) راستہ بنا دے۔ چنانچہ وہ غار پورا کھل گیا اور وہ تینوں شخص باہر آ گئے۔",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 162
			}
		}
	]
}