{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ابراہیم علیہ السلام نے سارہ رضی اللہ عنہا کے ساتھ ( نمرود کے ملک سے ) ہجرت کی تو ایک ایسے شہر میں پہنچے جہاں ایک بادشاہ رہتا تھا یا ( یہ فرمایا کہ ) ایک ظالم بادشاہ رہتا تھا۔ اس سے ابراہیم علیہ السلام کے متعلق کسی نے کہہ دیا کہ وہ ایک نہایت ہی خوبصورت عورت لے کر یہاں آئے ہیں۔ بادشاہ نے آپ علیہ السلام سے پچھوا بھیجا کہ ابراہیم! یہ عورت جو تمہارے ساتھ ہے تمہاری کیا ہوتی ہے؟ انہوں نے فرمایا کہ یہ میری بہن ہے۔ پھر جب ابراہیم علیہ السلام سارہ رضی اللہ عنہا کے یہاں آئے تو ان سے کہا کہ میری بات نہ جھٹلانا، میں تمہیں اپنی بہن کہہ آیا ہوں۔ اللہ کی قسم! آج روئے زمین پر میرے اور تمہارے سوا کوئی مومن نہیں ہے۔ چنانچہ آپ علیہ السلام نے سارہ رضی اللہ عنہا کو بادشاہ کے یہاں بھیجا، یا بادشاہ سارہ رضی اللہ عنہا کے پاس گیا۔ اس وقت سارہ رضی اللہ عنہا وضو کر کے نماز پڑھنے کھڑی ہو گئی تھیں۔ انہوں نے اللہ کے حضور میں یہ دعا کی کہ ”اے اللہ! اگر میں تجھ پر اور تیرے رسول ( ابراہیم علیہ السلام ) پر ایمان رکھتی ہوں اور اگر میں نے اپنے شوہر کے سوا اپنی شرمگاہ کی حفاظت کی ہے، تو تو مجھ پر ایک کافر کو مسلط نہ کر۔“ اتنے میں بادشاہ تھرایا اور اس کا پاؤں زمین میں دھنس گیا۔ اعرج نے کہا کہ ابوسلمہ بن عبدالرحمٰن نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا، کہ سارہ رضی اللہ عنہا نے اللہ کے حضور میں دعا کی کہ اے اللہ! اگر یہ مر گیا تو لوگ کہیں گے کہ اسی نے مارا ہے۔ چنانچہ وہ پھر چھوٹ گیا اور سارہ رضی اللہ عنہا کی طرف بڑھا۔ سارہ رضی اللہ عنہا وضو کر کے پھر نماز پڑھنے لگی تھیں اور یہ دعا کرتی جاتی تھیں ”اے اللہ! اگر میں تجھ پر اور تیرے رسول پر ایمان رکھتی ہوں اور اپنے شوہر ( ابراہیم علیہ السلام ) کے سوا اور ہر موقع پر میں نے اپنی شرمگاہ کی حفاظت کی ہے تو تو مجھ پر اس کافر کو مسلط نہ کر۔“ چنانچہ وہ پھر تھرایا، کانپا اور اس کے پاؤں زمین میں دھنس گئے۔ عبدالرحمٰن نے بیان کیا کہ ابوسلمہ نے بیان کیا ابوہریرہ رضی اللہ عنہ سے کہ سارہ رضی اللہ عنہا نے پھر وہی دعا کی کہ ”اے اللہ! اگر یہ مر گیا تو لوگ کہیں گے کہ اسی نے مارا ہے۔“ اب دوسری مرتبہ یا تیسری مرتبہ بھی وہ بادشاہ چھوڑ دیا گیا۔ آخر وہ کہنے لگا کہ تم لوگوں نے میرے یہاں ایک شیطان بھیج دیا۔ اسے ابراہیم ( علیہ السلام ) کے پاس لے جاؤ اور انہیں آجر ( ہاجرہ ) کو بھی دے دو۔ پھر سارہ ابراہیم علیہ السلام کے پاس آئیں اور ان سے کہا کہ دیکھتے نہیں اللہ نے کافر کو کس طرح ذلیل کیا اور ساتھ میں ایک لڑکی بھی دلوا دی۔",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		}
	]
}