{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا، ان سے ابوبشر نے بیان کیا، ان سے ابوالمتوکل نے بیان کیا، اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے کچھ صحابہ رضی اللہ عنہم سفر میں تھے۔ دوران سفر میں وہ عرب کے ایک قبیلہ پر اترے۔ صحابہ نے چاہا کہ قبیلہ والے انہیں اپنا مہمان بنا لیں، لیکن انہوں نے مہمانی نہیں کی، بلکہ صاف انکار کر دیا۔ اتفاق سے اسی قبیلہ کے سردار کو سانپ نے ڈس لیا، قبیلہ والوں نے ہر طرح کی کوشش کر ڈالی، لیکن ان کا سردار اچھا نہ ہوا۔ ان کے کسی آدمی نے کہا کہ چلو ان لوگوں سے بھی پوچھیں جو یہاں آ کر اترے ہیں۔ ممکن ہے کوئی دم جھاڑنے کی چیز ان کے پاس ہو۔ چنانچہ قبیلہ والے ان کے پاس آئے اور کہا کہ بھائیو! ہمارے سردار کو سانپ نے ڈس لیا ہے۔ اس کے لیے ہم نے ہر قسم کی کوشش کر ڈالی لیکن کچھ فائدہ نہ ہوا۔ کیا تمہارے پاس کوئی چیز دم کرنے کی ہے؟ ایک صحابی نے کہا کہ قسم اللہ کی میں اسے جھاڑ دوں گا لیکن ہم نے تم سے میزبانی کے لیے کہا تھا اور تم نے اس سے انکار کر دیا۔ اس لیے اب میں بھی اجرت کے بغیر نہیں جھاڑ سکتا، آخر بکریوں کے ایک گلے پر ان کا معاملہ طے ہوا۔ وہ صحابی وہاں گئے اور «الحمد لله رب العالمين» پڑھ پڑھ کر دم کیا۔ ایسا معلوم ہوا جیسے کسی کی رسی کھول دی گئی ہو۔ وہ سردار اٹھ کر چلنے لگا، تکلیف و درد کا نام و نشان بھی باقی نہیں تھا۔ بیان کیا کہ پھر انہوں نے طے شدہ اجرت صحابہ کو ادا کر دی۔ کسی نے کہا کہ اسے تقسیم کر لو، لیکن جنہوں نے جھاڑا تھا، وہ بولے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر پہلے ہم آپ صلی اللہ علیہ وسلم سے اس کا ذکر کر لیں۔ اس کے بعد دیکھیں گے کہ آپ صلی اللہ علیہ وسلم کیا حکم دیتے ہیں۔ چنانچہ سب حضرات رسول اللہ صلی اللہ علیہ وسلم خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ تم کو کیسے معلوم ہوا کہ سورۃ فاتحہ بھی ایک رقیہ ہے؟ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے ٹھیک کیا۔ اسے تقسیم کر لو اور ایک میرا حصہ بھی لگاؤ۔ یہ فرما کر رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے۔ شعبہ نے کہا کہ ابوالبشر نے ہم سے بیان کیا، انہوں نے ابوالمتوکل سے ایسا ہی سنا۔",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		}
	]
}