{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "اور عثمان بن ہیثم ابوعمرو نے بیان کیا کہ ہم سے عوف نے بیان کیا، ان سے محمد بن سیرین نے، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے رمضان کی زکوٰۃ کی حفاظت پر مقرر فرمایا۔ ( رات میں ) ایک شخص اچانک میرے پاس آیا اور غلہ میں سے لپ بھربھر کر اٹھانے لگا میں نے اسے پکڑ لیا اور کہا کہ قسم اللہ کی! میں تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے چلوں گا۔ اس پر اس نے کہا کہ اللہ کی قسم! میں بہت محتاج ہوں۔ میرے بال بچے ہیں اور میں سخت ضرورت مند ہوں۔ ابوہریرہ رضی اللہ عنہ نے کہا ( اس کے اظہار معذرت پر ) میں نے اسے چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا، اے ابوہریرہ! گذشتہ رات تمہارے قیدی نے کیا کیا تھا؟ میں نے کہا یا رسول اللہ! اس نے سخت ضرورت اور بال بچوں کا رونا رویا، اس لیے مجھے اس پر رحم آ گیا۔ اور میں نے اسے چھوڑ دیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے۔ اور وہ پھر آئے گا۔ رسول اللہ صلی اللہ علیہ وسلم کے اس فرمانے کی وجہ سے مجھ کو یقین تھا کہ وہ پھر ضرور آئے گا۔ اس لیے میں اس کی تاک میں لگا رہا۔ اور جب وہ دوسری رات آ کے پھر غلہ اٹھانے لگا تو میں نے اسے پھر پکڑا اور کہا کہ تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر کروں گا، لیکن اب بھی اس کی وہی التجا تھی کہ مجھے چھوڑ دے، میں محتاج ہوں۔ بال بچوں کا بوجھ میرے سر پر ہے۔ اب میں کبھی نہ آؤں گا۔ مجھے رحم آ گیا اور میں نے اسے پھر چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اے ابوہریرہ! تمہارے قیدی نے کیا کیا؟ میں نے کہا یا رسول اللہ! اس نے پھر اسی سخت ضرورت اور بال بچوں کا رونا رویا۔ جس پر مجھے رحم آ گیا۔ اس لیے میں نے اسے چھوڑ دیا۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ بھی یہی فرمایا کہ وہ تم سے جھوٹ بول کر گیا ہے اور وہ پھر آئے گا۔ تیسری مرتبہ میں پھر اس کے انتظار میں تھا کہ اس نے پھر تیسری رات آ کر غلہ اٹھانا شروع کیا، تو میں نے اسے پکڑ لیا، اور کہا کہ تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پہنچانا اب ضروری ہو گیا ہے۔ یہ تیسرا موقع ہے۔ ہر مرتبہ تم یقین دلاتے رہے کہ پھر نہیں آؤ گے۔ لیکن تم باز نہیں آئے۔ اس نے کہا کہ اس مرتبہ مجھے چھوڑ دے تو میں تمہیں ایسے چند کلمات سکھا دوں گا جس سے اللہ تعالیٰ تمہیں فائدہ پہنچائے گا۔ میں نے پوچھا وہ کلمات کیا ہیں؟ اس نے کہا، جب تم اپنے بستر پر لیٹنے لگو تو آیت الکرسی «الله لا إله إلا هو الحي القيوم» پوری پڑھ لیا کرو۔ ایک نگراں فرشتہ اللہ تعالیٰ کی طرف سے برابر تمہاری حفاظت کرتا رہے گا۔ اور صبح تک شیطان تمہارے پاس کبھی نہیں آ سکے گا۔ اس مرتبہ بھی پھر میں نے اسے چھوڑ دیا۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا، گذشتہ رات تمہارے قیدی نے تم سے کیا معاملہ کیا؟ میں نے عرض کیا یا رسول اللہ! اس نے مجھے چند کلمات سکھائے اور یقین دلایا کہ اللہ تعالیٰ مجھے اس سے فائدہ پہنچائے گا۔ اس لیے میں نے اسے چھوڑ دیا۔ آپ نے دریافت کیا کہ وہ کلمات کیا ہیں؟ میں نے عرض کیا کہ اس نے بتایا تھا کہ جب بستر پر لیٹو تو آیت الکرسی پڑھ لو، شروع «الله لا إله إلا هو الحي القيوم» سے آخر تک۔ اس نے مجھ سے یہ بھی کہا کہ اللہ تعالیٰ کی طرف سے تم پر ( اس کے پڑھنے سے ) ایک نگراں فرشتہ مقرر رہے گا۔ اور صبح تک شیطان تمہارے قریب بھی نہیں آ سکے گا۔ صحابہ خیر کو سب سے آگے بڑھ کر لینے والے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ( ان کی یہ بات سن کر ) فرمایا کہ اگرچہ وہ جھوٹا تھا۔ لیکن تم سے یہ بات سچ کہہ گیا ہے۔ اے ابوہریرہ! تم کو یہ بھی معلوم ہے کہ تین راتوں سے تمہارا معاملہ کس سے تھا؟ انہوں نے کہا نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ شیطان تھا۔",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}