{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"4": "Ablutions (Wudu')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 240,
			"arabicnumber": 240,
			"text": "ہم سے عبدان نے بیان کیا، کہا مجھے میرے باپ (عثمان) نے شعبہ سے خبر دی، انہوں نے ابواسحاق سے، انہوں نے عمرو بن میمون سے، انہوں نے عبداللہ سے وہ کہتے ہیں کہ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم کعبہ شریف میں سجدہ میں تھے۔ ( ایک دوسری سند سے ) ہم سے احمد بن عثمان نے بیان کیا، کہا ہم سے شریح بن مسلمہ نے، کہا ہم سے ابراہیم بن یوسف نے اپنے باپ کے واسطے سے بیان کیا، وہ ابواسحاق سے روایت کرتے ہیں۔ ان سے عمرو بن میمون نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہما نے ان سے حدیث بیان کی کہ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم کعبہ کے نزدیک نماز پڑھ رہے تھے اور ابوجہل اور اس کے ساتھی ( بھی وہیں ) بیٹھے ہوئے تھے تو ان میں سے ایک نے دوسرے سے کہا کہ تم میں سے کوئی شخص ہے جو قبیلے کی ( جو ) اونٹنی ذبح ہوئی ہے ( اس کی ) اوجھڑی اٹھا لائے اور ( لا کر ) جب محمد صلی اللہ علیہ وسلم سجدہ میں جائیں تو ان کی پیٹھ پر رکھ دے۔ یہ سن کر ان میں سے ایک سب سے زیادہ بدبخت ( آدمی ) اٹھا اور وہ اوجھڑی لے کر آیا اور دیکھتا رہا جب آپ نے سجدہ کیا تو اس نے اس اوجھڑی کو آپ کے دونوں کندھوں کے درمیان رکھ دیا ( عبداللہ بن مسعود کہتے ہیں ) میں یہ ( سب کچھ ) دیکھ رہا تھا مگر کچھ نہ کر سکتا تھا۔ کاش! ( اس وقت ) مجھے روکنے کی طاقت ہوتی۔ عبداللہ کہتے ہیں کہ وہ ہنسنے لگے اور ( ہنسی کے مارے ) لوٹ پوٹ ہونے لگے اور رسول اللہ صلی اللہ علیہ وسلم سجدہ میں تھے ( بوجھ کی وجہ سے ) اپنا سر نہیں اٹھا سکتے تھے۔ یہاں تک کہ فاطمہ رضی اللہ عنہا آئیں اور وہ بوجھ آپ کی پیٹھ سے اتار کر پھینکا، تب آپ صلی اللہ علیہ وسلم نے سر اٹھایا پھر تین بار فرمایا۔ یا اللہ! تو قریش کو پکڑ لے، یہ ( بات ) ان کافروں پر بہت بھاری ہوئی کہ آپ صلی اللہ علیہ وسلم نے انہیں بددعا دی۔ عبداللہ کہتے ہیں کہ وہ سمجھتے تھے کہ اس شہر ( مکہ ) میں جو دعا کی جائے وہ ضرور قبول ہوتی ہے پھر آپ نے ( ان میں سے ) ہر ایک کا ( جدا جدا ) نام لیا کہ اے اللہ! ان ظالموں کو ضرور ہلاک کر دے۔ ابوجہل، عتبہ بن ربیعہ، شیبہ بن ربیعہ، ولید بن عتبہ، امیہ بن خلف اور عقبہ بن ابی معیط کو۔ ساتویں ( آدمی ) کا نام ( بھی ) لیا مگر مجھے یاد نہیں رہا۔ اس ذات کی قسم جس کے قبضے میں میری جان ہے کہ جن لوگوں کے ( بددعا کرتے وقت ) آپ صلی اللہ علیہ وسلم نے نام لیے تھے، میں نے ان کی ( لاشوں ) کو بدر کے کنویں میں پڑا ہوا دیکھا۔",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 106
			}
		}
	]
}