{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے اور ان سے ابن شہاب نے کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ میں ہمیشہ اس بات کا آروز مند رہتا تھا کہ عمر رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے نام پوچھوں جن کے بارے میں اللہ تعالیٰ نے ( سورۃ التحریم میں ) فرمایا ہے «إن تتوبا إلى الله فقد صغت قلوبكما‏» ”اگر تم دونوں اللہ کے سامنے توبہ کرو ( تو بہتر ہے ) کہ تمہارے دل بگڑ گئے ہیں۔“ پھر میں ان کے ساتھ حج کو گیا۔ عمر رضی اللہ عنہ راستے سے قضائے حاجت کے لیے ہٹے تو میں بھی ان کے ساتھ ( پانی کا ایک ) چھاگل لے کر گیا۔ پھر وہ قضائے حاجت کے لیے چلے گئے۔ اور جب واپس آئے تو میں نے ان کے دونوں ہاتھوں پر چھاگل سے پانی ڈالا۔ اور انہوں نے وضو کیا، پھر میں نے پوچھا، یا امیرالمؤمنین! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ دو خواتین کون سی ہیں جن کے متعلق اللہ تعالیٰ نے یہ فرمایا کہ «إن تتوبا إلى الله‏» ”تم دونوں اللہ کے سامنے توبہ کرو“ انہوں نے فرمایا، ابن عباس! تم پر حیرت ہے۔ وہ تو عائشہ اور حفصہ ( رضی اللہ عنہا ) ہیں۔ پھر عمر رضی اللہ عنہ میری طرف متوجہ ہو کر پورا واقعہ بیان کرنے لگے۔ آپ نے بتلایا کہ بنوامیہ بن زید کے قبیلے میں جو مدینہ سے ملا ہوا تھا۔ میں اپنے ایک انصاری پڑوسی کے ساتھ رہتا تھا۔ ہم دونوں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضری کی باری مقرر کر رکھی تھی۔ ایک دن وہ حاضر ہوتے اور ایک دن میں۔ جب میں حاضری دیتا تو اس دن کی تمام خبریں وغیرہ لاتا۔ ( اور ان کو سناتا ) اور جب وہ حاضر ہوتے تو وہ بھی اسی طرح کرتے۔ ہم قریش کے لوگ ( مکہ میں ) اپنی عورتوں پر غالب رہا کرتے تھے۔ لیکن جب ہم ( ہجرت کر کے ) انصار کے یہاں آئے تو انہیں دیکھا کہ ان کی عورتیں خود ان پر غالب تھیں۔ ہماری عورتوں نے بھی ان کا طریقہ اختیار کرنا شروع کر دیا۔ میں نے ایک دن اپنی بیوی کو ڈانٹا تو انہوں نے بھی اس کا جواب دیا۔ ان کا یہ جواب مجھے ناگوار معلوم ہوا۔ لیکن انہوں نے کہا کہ میں اگر جواب دیتی ہوں تو تمہیں ناگواری کیوں ہوتی ہے۔ قسم اللہ کی! نبی کریم صلی اللہ علیہ وسلم کی ازواج تک آپ کو جواب دے دیتی ہیں اور بعض بیویاں تو آپ سے پورے دن اور پوری رات خفا رہتی ہیں۔ اس بات سے میں بہت گھبرایا اور میں نے کہا کہ ان میں سے جس نے بھی ایسا کیا ہو گا وہ بہت بڑے نقصان اور خسارے میں ہے۔ اس کے بعد میں نے کپڑے پہنے اور حفصہ رضی اللہ عنہا ( عمر رضی اللہ عنہ کی صاحبزادی اور ام المؤمنین ) کے پاس پہنچا اور کہا اے حفصہ! کیا تم میں سے کوئی نبی کریم صلی اللہ علیہ وسلم سے پورے دن رات تک ناراض رہتی ہیں۔ انہوں نے کہا کہ ہاں! میں بول اٹھا کہ پھر تو وہ تباہی اور نقصان میں رہیں۔ کیا تمہیں اس سے امن ہے کہ اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم کی خفگی کی وجہ سے ( تم پر ) غصہ ہو جائے اور تم ہلاک ہو جاؤ۔ رسول اللہ صلی اللہ علیہ وسلم سے زیادہ چیزوں کا مطالبہ ہرگز نہ کیا کرو، نہ کسی معاملہ میں آپ صلی اللہ علیہ وسلم کی کسی بات کا جواب دو اور نہ آپ پر خفگی کا اظہار ہونے دو، البتہ جس چیز کی تمہیں ضرورت ہو، وہ مجھ سے مانگ لیا کرو، کسی خود فریبی میں مبتلا نہ رہنا، تمہاری یہ پڑوسن تم سے زیادہ جمیل اور نظیف ہیں اور رسول اللہ صلی اللہ علیہ وسلم کو زیادہ پیاری بھی ہیں۔ آپ کی مراد عائشہ رضی اللہ عنہا سے تھی۔ عمر رضی اللہ عنہ نے کہا، ان دنوں یہ چرچا ہو رہا تھا کہ غسان کے فوجی ہم سے لڑنے کے لیے گھوڑوں کو سم لگا رہے ہیں۔ میرے پڑوسی ایک دن اپنی باری پر مدینہ گئے ہوئے تھے۔ پھر عشاء کے وقت واپس لوٹے۔ آ کر میرا دروازہ انہوں نے بڑی زور سے کھٹکھٹایا، اور کہا کیا آپ سو گئے ہیں؟ میں بہت گھبرایا ہوا باہر آیا انہوں نے کہا کہ ایک بہت بڑا حادثہ پیش آ گیا ہے۔ میں نے پوچھا کیا ہوا؟ کیا غسان کا لشکر آ گیا؟ انہوں نے کہا بلکہ اس سے بھی بڑا اور سنگین حادثہ، وہ یہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق دے دی۔ یہ سن کر عمر رضی اللہ عنہ نے فرمایا، حفصہ تو تباہ و برباد ہو گئی۔ مجھے تو پہلے ہی کھٹکا تھا کہ کہیں ایسا نہ ہو جائے ( عمر رضی اللہ عنہ نے کہا ) پھر میں نے کپڑے پہنے۔ صبح کی نماز رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز پڑھتے ہی ) آپ صلی اللہ علیہ وسلم اپنے بالا خانہ میں تشریف لے گئے اور وہیں تنہائی اختیار کر لی۔ میں حفصہ کے یہاں گیا، دیکھا تو وہ رو رہی تھیں، میں نے کہا، رو کیوں رہی ہو؟ کیا پہلے ہی میں نے تمہیں نہیں کہہ دیا تھا؟ کیا رسول اللہ صلی اللہ علیہ وسلم نے تم سب کو طلاق دے دی ہے؟ انہوں نے کہا کہ مجھے کچھ معلوم نہیں۔ آپ صلی اللہ علیہ وسلم بالاخانہ میں تشریف رکھتے ہیں۔ پھر میں باہر نکلا اور منبر کے پاس آیا۔ وہاں کچھ لوگ موجود تھے اور بعض رو بھی رہے تھے۔ تھوڑی دیر تو میں ان کے ساتھ بیٹھا رہا۔ لیکن مجھ پر رنج کا غلبہ ہوا، اور میں بالاخانے کے پاس پہنچا، جس میں آپ صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ میں نے آپ صلی اللہ علیہ وسلم کے ایک سیاہ غلام سے کہا، ( کہ نبی کریم صلی اللہ علیہ وسلم سے کہو ) کہ عمر اجازت چاہتا ہے۔ وہ غلام اندر گیا اور آپ صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آیا اور کہا کہ میں نے آپ کی بات پہنچا دی تھی، لیکن آپ صلی اللہ علیہ وسلم خاموش ہو گئے، چنانچہ میں واپس آ کر انہیں لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے۔ پھر مجھ پر رنج غالب آیا اور میں دوبارہ آیا۔ لیکن اس دفعہ بھی وہی ہوا۔ پھر آ کر انہیں لوگوں میں بیٹھ گیا جو منبر کے پاس تھے۔ لیکن اس مرتبہ پھر مجھ سے نہیں رہا گیا اور میں نے غلام سے آ کر کہا، کہ عمر کے لیے اجازت چاہو۔ لیکن بات جوں کی توں رہی۔ جب میں واپس ہو رہا تھا کہ غلام نے مجھ کو پکارا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کو اجازت دے دی ہے۔ میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم کھجور کی چٹائی پر لیٹے ہوئے تھے۔ جس پر کوئی بستر بھی نہیں تھا۔ اس لیے چٹائی کے ابھرے ہوئے حصوں کا نشان آپ صلی اللہ علیہ وسلم کے پہلو میں پڑ گیا تھا۔ آپ صلی اللہ علیہ وسلم اس وقت ایک ایسے تکیے پر ٹیک لگائے ہوئے تھے جس کے اندر کھجور کی چھال بھری گئی تھی۔ میں نے آپ صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کی، کہ کیا آپ نے اپنی بیویوں کو طلاق دے دی ہے؟ آپ صلی اللہ علیہ وسلم نے نگاہ میری طرف کر کے فرمایا کہ نہیں۔ میں نے آپ کے غم کو ہلکا کرنے کی کوشش کی اور کہنے لگا…. اب بھی میں کھڑا ہی تھا…. یا رسول اللہ! آپ جانتے ہی ہیں کہ ہم قریش کے لوگ اپنی بیویوں پر غالب رہتے تھے، لیکن جب ہم ایک ایسی قوم میں آ گئے جن کی عورتیں ان پر غالب تھیں، پھر عمر رضی اللہ عنہ نے تفصیل ذکر کی۔ اس بات پر رسول اللہ صلی اللہ علیہ وسلم مسکرا دیئے۔ پھر میں نے کہا میں حفصہ کے یہاں بھی گیا تھا اور اس سے کہہ آیا تھا کہ کہیں کسی خود فریبی میں نہ مبتلا رہنا۔ یہ تمہاری پڑوسن تم سے زیادہ خوبصورت اور پاک ہیں اور رسول اللہ صلی اللہ علیہ وسلم کو زیادہ محبوب بھی ہیں۔ آپ عائشہ رضی اللہ عنہا کی طرف اشارہ کر رہے تھے۔ اس بات پر آپ صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے۔ جب میں نے آپ صلی اللہ علیہ وسلم کو مسکراتے دیکھا، تو ( آپ صلی اللہ علیہ وسلم کے پاس ) بیٹھ گیا۔ اور آپ کے گھر میں چاروں طرف دیکھنے لگا۔ بخدا! سوائے تین کھالوں کے اور کوئی چیز وہاں نظر نہ آئی۔ میں نے کہا۔ یا رسول اللہ! آپ اللہ تعالیٰ سے دعا فرمائیے کہ وہ آپ کی امت کو کشادگی عطا فرما دے۔ فارس اور روم کے لوگ تو پوری فراخی کے ساتھ رہتے ہیں۔ دنیا انہیں خوب ملی ہوئی ہے۔ حالانکہ وہ اللہ تعالیٰ کی عبادت بھی نہیں کرتے۔ آپ صلی اللہ علیہ وسلم ٹیک لگائے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، اے خطاب کے بیٹے! کیا تمہیں ابھی کچھ شبہ ہے؟ ( تو دنیا کی دولت کو اچھی سمجھتا ہے ) یہ تو ایسے لوگ ہیں کہ ان کے اچھے اعمال ( جو وہ معاملات کی حد تک کرتے ہیں ان کی جزا ) اسی دنیا میں ان کو دے دی گئی ہے۔ ( یہ سن کر ) میں بول اٹھا۔ یا رسول اللہ! میرے لیے اللہ سے مغفرت کی دعا کیجئے۔ تو نبی کریم صلی اللہ علیہ وسلم نے ( اپنی ازواج سے ) اس بات پر علیحدگی اختیار کر لی تھی کہ عائشہ رضی اللہ عنہا سے حفصہ رضی اللہ عنہ نے پوشیدہ بات کہہ دی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے اس انتہائی خفگی کی وجہ سے جو آپ صلی اللہ علیہ وسلم کو ہوئی تھی، فرمایا تھا کہ میں اب ان کے پاس ایک مہینے تک نہیں جاؤں گا۔ اور یہی موقعہ ہے جس پر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو متنبہ کیا تھا۔ پھر جب انتیس دن گزر گئے تو آپ عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور انہیں کے یہاں سے آپ صلی اللہ علیہ وسلم نے ابتداء کی۔ عائشہ رضی اللہ عنہا نے کہا کہ آپ نے تو عہد کیا تھا کہ ہمارے یہاں ایک مہینے تک نہیں تشریف لائیں گے۔ اور آج ابھی انتیسویں کی صبح ہے۔ میں تو دن گن رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، یہ مہینہ انتیس دن کا ہے اور وہ مہینہ انتیس ہی دن کا تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر وہ آیت نازل ہوئی جس میں ( ازواج النبی کو ) اختیار دیا گیا تھا۔ اس کی بھی ابتداء آپ صلی اللہ علیہ وسلم نے مجھ ہی سے کی اور فرمایا کہ میں تم سے ایک بات کہتا ہوں، اور یہ ضروری نہیں کہ جواب فوراً دو، بلکہ اپنے والدین سے بھی مشورہ کر لو۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ آپ کو یہ معلوم تھا کہ میرے ماں باپ کبھی آپ سے جدائی کا مشورہ نہیں دے سکتے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے فرمایا ہے کہ ”اے نبی! اپنی بیویوں سے کہہ دو“ اللہ تعالیٰ کے قول عظیما تک۔ میں نے عرض کیا کیا اب اس معاملے میں بھی میں اپنے والدین سے مشورہ کرنے جاؤں گی! اس میں تو کسی شبہ کی گنجائش ہی نہیں ہے۔ کہ میں اللہ اور اس کے رسول اور دار آخرت کو پسند کرتی ہوں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اپنی دوسری بیویوں کو بھی اختیار دیا اور انہوں نے بھی وہی جواب دیا جو عائشہ رضی اللہ عنہا نے دیا تھا۔",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		}
	]
}