{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "ہم سے ابوربیع، سلیمان بن داؤد نے بیان کیا، امام بخاری رحمہ اللہ نے کہا کہ اس حدیث کے بعض مطالب مجھ کو امام احمد بن یونس نے سمجھائے، کہا ہم سے فلیح بن سلیمان نے بیان کیا، ان سے ابن شہاب زہری نے بیان کیا، ان سے عروہ بن زبیر، سعید بن مسیب، علقمہ بن وقاص لیثی اور عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے وہ قصہ بیان کیا جب تہمت لگانے والوں نے ان پر پر تہمت لگائی لیکن اللہ تعالیٰ نے خود انہیں اس سے بری قرار دیا۔ زہری نے بیان کیا ( کہ زہری سے بیان کرنے والے، جن کا سند میں زہری کے بعد ذکر ہے ) تمام راویوں نے عائشہ رضی اللہ عنہا کی اس حدیث کا ایک ایک حصہ بیان کیا تھا، بعض راویوں کو بعض دوسرے راویوں سے حدیث زیادہ یاد تھی اور وہ بیان بھی زیادہ بہتر طریقہ پر کر سکتے تھے۔ بہرحال ان سب راویوں سے میں نے یہ حدیث پوری طرح محفوظ کر لی تھی جسے وہ عائشہ رضی اللہ عنہا سے بیان کرتے تھے۔ ان راویوں میں ہر ایک کی روایت سے دوسرے راوی کی تصدیق ہوتی تھی۔ ان کا بیان تھا کہ عائشہ رضی اللہ عنہا نے کہا رسول اللہ صلی اللہ علیہ وسلم جب سفر میں جانے کا ارادہ کرتے تو اپنی بیویوں کے درمیان قرعہ ڈالتے۔ جس کے نام کا قرعہ نکلتا، سفر میں وہی آپ صلی اللہ علیہ وسلم کے ساتھ جاتی۔ چنانچہ ایک غزوہ کے موقع پر، جس میں آپ صلی اللہ علیہ وسلم بھی شرکت کر رہے تھے، آپ صلی اللہ علیہ وسلم نے قرعہ ڈلوایا اور میرا نام نکلا۔ اب میں آپ صلی اللہ علیہ وسلم کے ساتھ تھی۔ یہ واقعہ پردے کی آیت کے نازل ہونے کے بعد کا ہے۔ خیر میں ایک ہودج میں سوار رہتی تھی، اسی میں بیٹھے بیٹھے مجھ کو اتارا جاتا تھا۔ اس طرح ہم چلتے رہے۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم جہاد سے فارغ ہو کر واپس ہوئے اور ہم مدینہ کے قریب پہنچ گئے تو ایک رات آپ نے کوچ کا حکم دیا۔ میں یہ حکم سنتے ہی اٹھی اور لشکر سے آگے بڑھ گئی۔ جب حاجت سے فارغ ہوئی تو کجاوے کے پاس آ گئی۔ وہاں پہنچ کر جو میں نے اپنا سینہ ٹٹولا تو میرا ظفار کے کالے نگینوں کا ہار موجود نہیں تھا۔ اس لیے میں وہاں دوبارہ پہنچی ( جہاں قضائے حاجت کے لیے گئی تھی ) اور میں نے ہار کو تلاش کیا۔ اس تلاش میں دیر ہو گئی۔ اس عرصے میں وہ اصحاب جو مجھے سوار کراتے تھے، آئے اور میرا ہودج اٹھا کر میرے اونٹ پر رکھ دیا۔ وہ یہی سمجھے کہ میں اس میں بیٹھی ہوں۔ ان دنوں عورتیں ہلکی پھلکی ہوتی تھیں، بھاری بھر کم نہیں۔ گوشت ان میں زیادہ نہیں رہتا تھا کیونکہ بہت معمولی غذا کھاتی تھیں۔ اس لیے ان لوگوں نے جب ہودج کو اٹھایا تو انہیں اس کے بوجھ میں کوئی فرق معلوم نہیں ہوا۔ میں یوں بھی نوعمر لڑکی تھی۔ چنانچہ اصحاب نے اونٹ کو ہانک دیا اور خود بھی اس کے ساتھ چلنے لگے۔ جب لشکر روانہ ہو چکا تو مجھے اپنا ہار ملا اور میں پڑاؤ کی جگہ آئی۔ لیکن وہاں کوئی آدمی موجود نہ تھا۔ اس لیے میں اس جگہ گئی جہاں پہلے میرا قیام تھا۔ میرا خیال تھا کہ جب وہ لوگ مجھے نہیں پائیں گے تو یہیں لوٹ کے آئیں گے۔ ( اپنی جگہ پہنچ کر ) میں یوں ہی بیٹھی ہوئی تھی کہ میری آنکھ لگ گئی اور میں سو گئی۔ صفوان بن معطل رضی اللہ عنہ جو پہلے سلمی تھے پھر ذکوانی ہو گئے لشکر کے پیچھے تھے ( جو لشکریوں کی گری پڑی چیزوں کو اٹھا کر انہیں اس کے مالک تک پہنچانے کی خدمت کے لیے مقرر تھے ) وہ میری طرف سے گزرے تو ایک سوئے ہوئے انسان کا سایہ نظر پڑا اس لیے اور قریب پہنچے۔ پردہ کے حکم سے پہلے وہ مجھے دیکھ چکے تھے۔ ان کے «إنا لله» پڑھنے سے میں بیدار ہو گئی۔ آخر انہوں نے اپنا اونٹ بٹھایا اور اس کے اگلے پاؤں کو موڑ دیا ( تاکہ بلا کسی مدد کے میں خود سوار ہو سکوں ) چنانچہ میں سوار ہو گئی، اب وہ اونٹ پر مجھے بٹھائے ہوئے خود اس کے آگے آگے چلنے لگے۔ اسی طرح ہم جب لشکر کے قریب پہنچے تو لوگ بھری دوپہر میں آرام کے لیے پڑاؤ ڈال چکے تھے۔ ( اتنی ہی بات تھی جس کی بنیاد پر ) جسے ہلاک ہونا تھا وہ ہلاک ہوا اور تہمت کے معاملے میں پیش پیش عبداللہ بن ابی ابن سلول ( منافق ) تھا۔ پھر ہم مدینہ میں آ گئے اور میں ایک مہینے تک بیمار رہی۔ تہمت لگانے والوں کی باتوں کا خوب چرچا ہو رہا تھا۔ اپنی اس بیماری کے دوران مجھے اس سے بھی بڑا شبہ ہوتا تھا کہ ان دنوں رسول اللہ صلی اللہ علیہ وسلم کا وہ لطف و کرم بھی میں نہیں دیکھتی تھی جن کا مشاہدہ اپنی پچھلی بیماریوں میں کر چکی تھی۔ پس آپ صلی اللہ علیہ وسلم گھر میں جب آتے تو سلام کرتے اور صرف اتنا دریافت فرما لیتے، مزاج کیسا ہے؟ جو باتیں تہمت لگانے والے پھیلا رہے تھے ان میں سے کوئی بات مجھے معلوم نہیں تھی۔ جب میری صحت کچھ ٹھیک ہوئی تو ( ایک رات ) میں ام مسطح کے ساتھ مناصع کی طرف گئی۔ یہ ہماری قضائے حاجت کی جگہ تھی، ہم یہاں صرف رات ہی میں آتے تھے۔ یہ اس زمانہ کی بات ہے جب ابھی ہمارے گھروں کے قریب بیت الخلاء نہیں بنے تھے۔ میدان میں جانے کے سلسلے میں ( قضائے حاجت کے لیے ) ہمارا طرز عمل قدیم عرب کی طرح تھا، میں اور ام مسطح بنت ابی رہم چل رہی تھی کہ وہ اپنی چادر میں الجھ کر گر پڑیں اور ان کی زبان سے نکل گیا، مسطح برباد ہو۔ میں نے کہا، بری بات آپ نے اپنی زبان سے نکالی، ایسے شخص کو برا کہہ رہی ہیں آپ، جو بدر کی لڑائی میں شریک تھا، وہ کہنے لگیں، اے بھولی بھالی! جو کچھ ان سب نے کہا ہے وہ آپ نے نہیں سنا، پھر انہوں نے تہمت لگانے والوں کی ساری باتیں سنائیں اور ان باتوں کو سن کر میری بیماری اور بڑھ گئی۔ میں جب اپنے گھر واپس ہوئی تو رسول اللہ صلی اللہ علیہ وسلم اندر تشریف لائے اور دریافت فرمایا، مزاج کیسا ہے؟ میں نے عرض کیا کہ آپ مجھے والدین کے یہاں جانے کی اجازت دیجئیے۔ اس وقت میرا ارادہ یہ تھا کہ ان سے اس خبر کی تحقیق کروں گی۔ آپ صلی اللہ علیہ وسلم نے مجھے جانے کی اجازت دے دی اور میں جب گھر آئی تو میں نے اپنی والدہ ( ام رومان ) سے ان باتوں کے متعلق پوچھا، جو لوگوں میں پھیلی ہوئی تھیں۔ انہوں نے فرمایا، بیٹی! اس طرح کی باتوں کی پرواہ نہ کر، اللہ کی قسم! شاید ہی ایسا ہو کہ تجھ جیسی حسین و خوبصورت عورت کسی مرد کے گھر میں ہو اور اس کی سوکنیں بھی ہوں، پھر بھی اس طرح کی باتیں نہ پھیلائی جایا کریں۔ میں نے کہا سبحان اللہ! ( سوکنوں کا کیا ذکر ) وہ تو دوسرے لوگ اس طرح کی باتیں کر رہے ہیں۔ انہوں نے بیان کیا کہ وہ رات میں نے وہیں گزاری، صبح تک میرے آنسو نہیں تھمتے تھے اور نہ نیند آئی۔ صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیوی کو جدا کرنے کے سلسلے میں مشورہ کرنے کے لیے علی ابن ابی طالب اور اسامہ بن زید رضی اللہ عنہم کو بلوایا۔ کیونکہ وحی ( اس سلسلے میں ) اب تک نہیں آئی تھی۔ اسامہ رضی اللہ عنہ کو آپ کی بیویوں سے آپ کی محبت کا علم تھا۔ اس لیے اسی کے مطابق مشورہ دیا اور کہا، آپ کی بیوی، یا رسول اللہ! واللہ، ہم ان کے متعلق خیر کے سوا اور کچھ نہیں جانتے۔ علی رضی اللہ عنہ نے کہا یا رسول اللہ! اللہ تعالیٰ نے آپ پر کوئی تنگی نہیں کی ہے، عورتیں ان کے سوا بھی بہت ہیں، باندی سے بھی آپ دریافت فرما لیجئے، وہ سچی بات بیان کریں گی۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا کو بلایا ( جو عائشہ رضی اللہ عنہا کی خاص خادمہ تھی ) اور دریافت فرمایا، بریرہ! کیا تم نے عائشہ میں کوئی ایسی چیز دیکھی ہے جس سے تمہیں شبہ ہوا ہو۔ بریرہ رضی اللہ عنہا نے عرض کیا، نہیں، اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث فرمایا ہے۔ میں نے ان میں کوئی ایسی چیز نہیں دیکھی جس کا عیب میں ان پر لگا سکوں۔ اتنی بات ضرور ہے کہ وہ نوعمر لڑکی ہیں۔ آٹا گوندھ کر سو جاتی ہیں پھر بکری آتی ہے اور کھا لیتی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اسی دن ( منبر پر ) کھڑے ہو کر عبداللہ بن ابی ابن سلول کے بارے میں مدد چاہی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، ایک ایسے شخص کے بارے میں میری کون مدد کرے گا جس کی اذیت اور تکلیف دہی کا سلسلہ اب میری بیوی کے معاملے تک پہنچ چکا ہے۔ اللہ کی قسم، اپنی بیوی کے بارے میں خیر کے سوا اور کوئی چیز مجھے معلوم نہیں۔ پھر نام بھی اس معاملے میں انہوں نے ایک ایسے آدمی کا لیا ہے جس کے متعلق بھی میں خیر کے سوا اور کچھ نہیں جانتا۔ خود میرے گھر میں جب بھی وہ آئے ہیں تو میرے ساتھ ہی آئے۔ ( یہ سن کر ) سعد بن معاذ رضی اللہ عنہ کھڑے ہوئے اور عرض کیا، یا رسول اللہ! واللہ میں آپ کی مدد کروں گا۔ اگر وہ شخص ( جس کے متعلق تہمت لگانے کا آپ نے ارشاد فرمایا ہے ) اوس قبیلہ سے ہو گا تو ہم اس کی گردن مار دیں گے ( کیونکہ سعد رضی اللہ عنہ خود قبیلہ اوس کے سردار تھے ) اور اگر وہ خزرج کا آدمی ہوا، تو آپ ہمیں حکم دیں، جو بھی آپ کا حکم ہو گا ہم تعمیل کریں گے۔ اس کے بعد سعد بن عبادہ رضی اللہ عنہ کھڑے ہوئے جو قبیلہ خزرج کے سردار تھے۔ حالانکہ اس سے پہلے اب تک بہت صالح تھے۔ لیکن اس وقت ( سعد بن معاذ رضی اللہ عنہ کی بات پر ) حمیت سے غصہ ہو گئے تھے اور ( سعد بن معاذ رضی اللہ عنہ سے ) کہنے لگے رب کے دوام و بقا کی قسم! تم جھوٹ بولتے ہو، نہ تم اسے قتل کر سکتے ہو اور نہ تمہارے اندر اس کی طاقت ہے۔ پھر اسید بن حضیر رضی اللہ عنہ کھڑے ہوئے ( سعد بن معاذ رضی اللہ عنہ کے چچازاد بھائی ) اور کہا، اللہ کی قسم! ہم اسے قتل کر دیں گے ( اگر رسول اللہ صلی اللہ علیہ وسلم کا حکم ہوا ) کوئی شبہ نہیں رہ جاتا کہ تم بھی منافق ہو۔ کیونکہ منافقوں کی طرفداری کر رہے ہو۔ اس پر اوس و خزرج دونوں قبیلوں کے لوگ اٹھ کھڑے ہوئے اور آگے بڑھنے ہی والے تھے کہ رسول اللہ صلی اللہ علیہ وسلم جو ابھی تک منبر پر تشریف رکھتے تھے۔ منبر سے اترے اور لوگوں کو نرم کیا۔ اب سب لوگ خاموش ہو گئے اور آپ بھی خاموش ہو گئے۔ میں اس دن بھی روتی رہی۔ نہ میرے آنسو تھمتے تھے اور نہ نیند آتی تھی پھر میرے پاس میرے ماں باپ آئے۔ میں ایک رات اور ایک دن سے برابر روتی رہی تھی۔ ایسا معلوم ہوتا تھا کہ روتے روتے میرے دل کے ٹکڑے ہو جائیں گے۔ انہوں نے بیان کیا کہ ماں باپ میرے پاس بیٹھے ہوئے تھے کہ ایک انصاری عورت نے اجازت چاہی اور میں نے انہیں اندر آنے کی اجازت دے دی اور وہ میرے ساتھ بیٹھ کر رونے لگیں۔ ہم سب اسی طرح تھے کہ رسول اللہ صلی اللہ علیہ وسلم اندر تشریف لائے اور بیٹھ گئے۔ جس دن سے میرے متعلق وہ باتیں کہی جا رہی تھیں جو کبھی نہیں کہی گئیں تھیں۔ اس دن سے میرے پاس آپ نہیں بیٹھے تھے۔ آپ صلی اللہ علیہ وسلم ایک مہینے تک انتظار کرتے رہے تھے۔ لیکن میرے معاملے میں کوئی وحی آپ صلی اللہ علیہ وسلم پر نازل نہیں ہوئی تھی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر آپ صلی اللہ علیہ وسلم نے تشہد پڑھی اور فرمایا، عائشہ! تمہارے متعلق مجھے یہ یہ باتیں معلوم ہوئیں۔ اگر تم اس معاملے میں بری ہو تو اللہ تعالیٰ بھی تمہاری برات ظاہر کر دے گا اور اگر تم نے گناہ کیا ہے تو اللہ تعالیٰ سے مغفرت چاہو اور اس کے حضور توبہ کرو کہ بندہ جب اپنے گناہ کا اقرار کر کے توبہ کرتا ہے تو اللہ تعالیٰ بھی اس کی توبہ قبول کرتا ہے۔ جونہی آپ صلی اللہ علیہ وسلم نے اپنی گفتگو ختم کی، میرے آنسو اس طرح خشک ہو گئے کہ اب ایک قطرہ بھی محسوس نہیں ہوتا تھا۔ میں نے اپنے باپ سے کہا کہ آپ رسول اللہ صلی اللہ علیہ وسلم سے میرے متعلق کہئے۔ لیکن انہوں نے کہا، قسم اللہ کی! مجھے نہیں معلوم کہ آپ صلی اللہ علیہ وسلم سے مجھے کیا کہنا چاہئے۔ میں نے اپنی ماں سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے جو کچھ فرمایا، اس کے متعلق آپ صلی اللہ علیہ وسلم سے آپ ہی کچھ کہئے، انہوں نے بھی یہی فرما دیا کہ قسم اللہ کی! مجھے معلوم نہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم سے کیا کہنا چاہئے۔ انہوں نے بیان کیا کہ میں نوعمر لڑکی تھی۔ قرآن مجھے زیادہ یاد نہیں تھا۔ میں نے کہا اللہ گواہ ہے، مجھے معلوم ہوا کہ آپ لوگوں نے بھی لوگوں کی افواہ سنی ہیں اور آپ لوگوں کے دلوں میں وہ بات بیٹھ گئی ہے اور اس کی تصدیق بھی آپ لوگ کر چکے ہیں، اس لیے اب اگر میں کہوں کہ میں ( اس بہتان سے ) بری ہوں، اور اللہ خوب جانتا ہے کہ میں واقعی اس سے بری ہوں تو آپ لوگ میری اس معاملے میں تصدیق نہیں کریں گے۔ لیکن اگر میں ( گناہ کو ) اپنے ذمہ لے لوں، حالانکہ اللہ تعالیٰ خوب جانتا ہے کہ میں اس سے بری ہوں، تو آپ لوگ میری بات کی تصدیق کر دیں گے۔ قسم اللہ کی! میں اس وقت اپنی اور آپ لوگوں کی کوئی مثال یوسف علیہ السلام کے والد ( یعقوب علیہ السلام ) کے سوا نہیں پاتی کہ انہوں نے بھی فرمایا تھا «فصبر جميل والله المستعان على ما تصفون‏» ”صبر ہی بہتر ہے اور جو کچھ تم کہتے ہو اس معاملے میں میرا مددگار اللہ تعالیٰ ہے“۔ اس کے بعد بستر پر میں نے اپنا رخ دوسری طرف کر لیا اور مجھے امید تھی کہ خود اللہ تعالیٰ میری برات کرے گا۔ لیکن میرا یہ خیال کبھی نہ تھا کہ میرے متعلق وحی نازل ہو گی۔ میری اپنی نظر میں حیثیت اس سے بہت معمولی تھی کہ قرآن مجید میں میرے متعلق کوئی آیت نازل ہو۔ ہاں مجھے اتنی امید ضرور تھی کہ آپ صلی اللہ علیہ وسلم کوئی خواب دیکھیں گے جس میں اللہ تعالیٰ مجھے بری فرما دے گا۔ اللہ گواہ ہے کہ ابھی آپ صلی اللہ علیہ وسلم اپنی جگہ سے اٹھے بھی نہ تھے اور نہ اس وقت گھر میں موجود کوئی باہر نکلا تھا کہ آپ صلی اللہ علیہ وسلم پر وحی نازل ہونے لگی اور ( شدت وحی سے ) آپ صلی اللہ علیہ وسلم جس طرح پسینے پسینے ہو جایا کرتے تھے وہی کیفیت آپ صلی اللہ علیہ وسلم کی اب بھی تھی۔ پسینے کے قطرے موتیوں کی طرح آپ صلی اللہ علیہ وسلم کے جسم مبارک سے گرنے لگے۔ حالانکہ سردی کا موسم تھا۔ جب وحی کا سلسلہ ختم ہوا تو آپ صلی اللہ علیہ وسلم ہنس رہے تھے اور سب سے پہلا کلمہ جو آپ کی زبان مبارک سے نکلا، وہ یہ تھا اے عائشہ! اللہ کی حمد بیان کر کہ اس نے تمہیں بری قرار دے دیا ہے۔ میری والدہ نے کہا بیٹی جا، رسول اللہ صلی اللہ علیہ وسلم کے سامنے جا کر کھڑی ہو جا۔ میں نے کہا، نہیں قسم اللہ کی میں آپ کے پاس جا کر کھڑی نہ ہوں گی اور میں تو صرف اللہ کی حمد و ثنا کروں گی۔ اللہ تعالیٰ نے یہ آیت نازل فرمائی تھی «إن الذين جاءوا بالإفك عصبة منكم‏» ”جن لوگوں نے تہمت تراشی کی ہے۔ وہ تم ہی میں سے کچھ لوگ ہیں“۔ جب اللہ تعالیٰ نے میری برات میں یہ آیت نازل فرمائی تو ابوبکر رضی اللہ عنہ نے جو مسطح بن اثاثہ رضی اللہ عنہ کے اخراجات قرابت کی وجہ سے خود ہی اٹھاتے تھے کہا کہ قسم اللہ کی اب میں مسطح پر کبھی کوئی چیز خرچ نہیں کروں گا کہ وہ بھی عائشہ پر تہمت لگانے میں شریک تھا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «ولا يأتل أولو الفضل منكم والسعة‏ إلى قوله ‏غفور رحيم‏» ‏‏‏‏ ”تم میں سے صاحب فضل و صاحب مال لوگ قسم نہ کھائیں۔ اللہ تعالیٰ کے ارشاد غفور رحیم تک“۔ ابوبکر رضی اللہ عنہ نے کہا اللہ کی قسم! بس میری یہی خواہش ہے کہ اللہ تعالیٰ میری مغفرت کر دے۔ چنانچہ مسطح رضی اللہ عنہ کو جو آپ پہلے دیا کرتے تھے وہ پھر دینے لگے۔ رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش ( رضی اللہ عنہا ام المؤمنین ) سے بھی میرے متعلق پوچھا تھا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ زینب! تم ( عائشہ رضی اللہ عنہا کے متعلق ) کیا جانتی ہو؟ اور کیا دیکھا ہے؟ انہوں نے جواب دیا میں اپنے کان اور اپنی آنکھ کی حفاظت کرتی ہوں ( کہ جو چیز میں نے دیکھی ہو یا نہ سنی ہو وہ آپ سے بیان کرنے لگوں ) اللہ گواہ ہے کہ میں نے ان میں خیر کے سوا اور کچھ نہیں دیکھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ یہی میری برابر کی تھیں، لیکن اللہ تعالیٰ نے انہیں تقویٰ کی وجہ سے بچا لیا۔ ابوالربیع نے بیان کیا کہ ہم سے فلیح نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے عروہ نے، ان سے عائشہ اور عبداللہ بن زبیر رضی اللہ عنہم نے اسی حدیث کی طرح۔ ابوالربیع نے ( دوسری سند میں ) بیان کیا کہ ہم سے فلیح نے بیان کیا، ان سے ربیعہ بن ابی عبدالرحمٰن اور یحییٰ بن سعید نے اور ان سے قاسم بن محمد بن ابی بکر نے اسی حدیث کی طرح۔",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		}
	]
}