{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"53": "Peacemaking"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2699,
			"arabicnumber": 2699,
			"text": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا اسرائیل سے، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ذی قعدہ کے مہینے میں عمرہ کا احرام باندھا۔ لیکن مکہ والوں نے آپ صلی اللہ علیہ وسلم کو شہر میں داخل نہیں ہونے دیا۔ آخر صلح اس پر ہوئی کہ ( آئندہ سال ) آپ صلی اللہ علیہ وسلم مکہ میں تین روز قیام کریں گے۔ جب صلح نامہ لکھا جانے لگا تو اس میں لکھا گیا کہ یہ وہ صلح نامہ ہے جو محمد رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے۔ لیکن مشرکین نے کہا کہ ہم تو اسے نہیں مانتے۔ اگر ہمیں علم ہو جائے کہ آپ اللہ کے رسول ہیں تو ہم آپ کو نہ روکیں۔ بس آپ صرف محمد بن عبداللہ ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں رسول اللہ بھی ہوں اور محمد بن عبداللہ بھی ہوں۔ اس کے بعد آپ نے علی رضی اللہ عنہ سے فرمایا کہ رسول اللہ کا لفظ مٹا دو، انہوں نے عرض کیا نہیں اللہ کی قسم! میں تو یہ لفظ کبھی نہ مٹاؤں گا۔ آخر آپ صلی اللہ علیہ وسلم نے خود دستاویز لی اور لکھا کہ یہ اس کی دستاویز ہے کہ محمد بن عبداللہ نے اس شرط پر صلح کی ہے کہ مکہ میں وہ ہتھیار میان میں رکھے بغیر داخل نہ ہوں گے۔ اگر مکہ کا کوئی شخص ان کے ساتھ جانا چاہے گا تو وہ اسے ساتھ نہ لے جائیں گے۔ لیکن اگر ان کے اصحاب میں سے کوئی شخص مکہ میں رہنا چاہے گا تو اسے وہ نہ روکیں گے۔ جب ( آئندہ سال ) آپ صلی اللہ علیہ وسلم مکہ تشریف لے گئے اور ( مکہ میں قیام کی ) مدت پوری ہو گئی تو قریش علی رضی اللہ عنہ کے پاس آئے اور کہا کہ اپنے صاحب سے کہئے کہ مدت پوری ہو گئی ہے اور اب وہ ہمارے یہاں سے چلے جائیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم مکہ سے روانہ ہونے لگے۔ اس وقت حمزہ رضی اللہ عنہ کی ایک بچی چچا چچا کرتی آئیں۔ علی رضی اللہ عنہ نے انہیں اپنے ساتھ لے لیا، پھر فاطمہ رضی اللہ عنہا کے پاس ہاتھ پکڑ کر لائے اور فرمایا، اپنی چچا زاد بہن کو بھی ساتھ لے لو، انہوں نے اس کو اپنے ساتھ سوار کر لیا، پھر علی، زید اور جعفر رضی اللہ عنہم کا جھگڑا ہوا۔ علی رضی اللہ عنہ نے فرمایا کہ اس کا میں زیادہ مستحق ہوں، یہ میرے چچا کی بچی ہے۔ جعفر رضی اللہ عنہ نے فرمایا کہ یہ میرے بھی چچا کی بچی ہے اور اس کی خالہ میرے نکاح میں بھی ہیں۔ زید رضی اللہ عنہ نے فرمایا کہ میرے بھائی کی بچی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے بچی کی خالہ کے حق میں فیصلہ کیا اور فرمایا کہ خالہ ماں کی جگہ ہوتی ہے، پھر علی رضی اللہ عنہ سے فرمایا کہ تم مجھ سے ہو اور میں تم سے ہوں۔ جعفر رضی اللہ عنہ سے فرمایا کہ تم صورت اور عادات و اخلاق سب میں مجھ سے مشابہ ہو۔ زید رضی اللہ عنہ سے فرمایا کہ تم ہمارے بھائی بھی ہو اور ہمارے مولا بھی۔",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 9
			}
		}
	]
}