{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"53": "Peacemaking"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابوموسیٰ نے بیان کیا کہ میں نے امام حسن بصری سے سنا، وہ بیان کرتے تھے کہ قسم اللہ کی جب حسن بن علی رضی اللہ عنہما ( معاویہ رضی اللہ عنہ کے مقابلے میں ) پہاڑوں میں لشکر لے کر پہنچے، تو عمرو بن العاص رضی اللہ عنہ نے کہا ( جو امیر معاویہ رضی اللہ عنہ کے مشیر خاص تھے ) کہ میں ایسا لشکر دیکھ رہا ہوں جو اپنے مقابل کو نیست و نابود کیے بغیر واپس نہ جائے گا۔ معاویہ رضی اللہ عنہ نے اس پر کہا اور قسم اللہ کی، وہ ان دونوں اصحاب میں زیادہ اچھے تھے، کہ اے عمرو! اگر اس لشکر نے اس لشکر کو قتل کر دیا، یا اس نے اس کو قتل کر دیا، تو ( اللہ تعالیٰ کی بارگاہ میں ) لوگوں کے امور ( کی جواب دہی کے لیے ) میرے ساتھ کون ذمہ داری لے گا، لوگوں کی بیوہ عورتوں کی خبرگیری کے سلسلے میں میرے ساتھ کون ذمہ دار ہو گا۔ لوگوں کی آل اولاد کے سلسلے میں میرے ساتھ کون ذمہ دار ہو گا۔ آخر معاویہ رضی اللہ عنہ نے حسن رضی اللہ عنہ کے یہاں قریش کی شاخ بنو عبد شمس کے دو آدمی بھیجے۔ عبدالرحمٰن بن سمرہ اور عبداللہ بن عامر بن کریز، آپ نے ان دونوں سے فرمایا کہ حسن بن علی رضی اللہ عنہ کے یہاں جاؤ اور ان کے سامنے صلح پیش کرو، ان سے اس پر گفتگو کرو اور فیصلہ انہیں کی مرضی پر چھوڑ دو۔ چنانچہ یہ لوگ آئے اور آپ سے گفتگو کی اور فیصلہ آپ ہی کی مرضی پر چھوڑ دیا۔ حسن بن علی رضی اللہ عنہ نے فرمایا، ہم بنو عبدالمطلب کی اولاد ہیں اور ہم کو خلافت کی وجہ سے روپیہ پیسہ خرچ کرنے کی عادت ہو گئی ہے اور ہمارے ساتھ یہ لوگ ہیں، یہ خون خرابہ کرنے میں طاق ہیں، بغیر روپیہ دئیے ماننے والے نہیں۔ وہ کہنے لگے امیر معاویہ رضی اللہ عنہ آپ کو اتنا اتنا روپیہ دینے پر راضی ہیں اور آپ سے صلح چاہتے ہیں۔ فیصلہ آپ کی مرضی پر چھوڑا ہے اور آپ سے پوچھا ہے۔ حسن رضی اللہ عنہ نے فرمایا کہ اس کی ذمہ داری کون لے گا؟ ان دونوں قاصدوں نے کہا کہ ہم اس کے ذمہ دار ہیں۔ حسن نے جس چیز کے متعلق بھی پوچھا، تو انہوں نے یہی کہا کہ ہم اس کے ذمہ دار ہیں۔ آخر آپ نے صلح کر لی، پھر فرمایا کہ میں نے ابوبکرہ رضی اللہ عنہ سے سنا تھا، وہ بیان کرتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر یہ فرماتے سنا ہے اور حسن بن علی رضی اللہ عنہما آپ صلی اللہ علیہ وسلم کے پہلو میں تھے، آپ صلی اللہ علیہ وسلم کبھی لوگوں کی طرف متوجہ ہوتے اور کبھی حسن رضی اللہ عنہ کی طرف اور فرماتے کہ میرا یہ بیٹا سردار ہے اور شاید اس کے ذریعہ اللہ تعالیٰ مسلمانوں کے دو عظیم گروہوں میں صلح کرائے گا۔ امام بخاری رحمہ اللہ نے کہا مجھ سے علی بن عبداللہ مدینی نے بیان کیا کہ ہمارے نزدیک اس حدیث سے حسن بصری کا ابوبکرہ رضی اللہ عنہ سے سننا ثابت ہوا ہے۔",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		}
	]
}