{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"54": "Conditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "ہم سے ابواحمد مرار بن حمویہ نے بیان کیا ‘ کہا کہ ہم سے محمد بن یحییٰ ابوغسان کنانی نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی نافع سے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ جب ان کے ہاتھ پاؤں خیبر والوں نے توڑ ڈالے تو عمر رضی اللہ عنہ خطبہ دینے کے لیے کھڑے ہوئے ‘ آپ رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے جب خیبر کے یہودیوں سے ان کی جائیداد کا معاملہ کیا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب تک اللہ تعالیٰ تمہیں قائم رکھے ہم بھی قائم رکھیں گے اور عبداللہ بن عمر رضی اللہ عنہما وہاں اپنے اموال کے سلسلے میں گئے تو رات میں ان کے ساتھ مار پیٹ کا معاملہ کیا گیا جس سے ان کے پاؤں ٹوٹ گئے۔ خیبر میں ان کے سوا اور کوئی ہمارا دشمن نہیں ‘ وہی ہمارے دشمن ہیں اور انہیں پر ہمیں شبہ ہے اس لیے میں انہیں جلا وطن کر دینا ہی مناسب جانتا ہوں۔ جب عمر رضی اللہ عنہ نے اس کا پختہ ارادہ کر لیا تو بنو ابی حقیق ( ایک یہودی خاندان ) کا ایک شخص تھا ’ آیا اور کہا یا امیرالمؤمنین کیا آپ ہمیں جلا وطن کر دیں گے حالانکہ محمد صلی اللہ علیہ وسلم نے ہمیں یہاں باقی رکھا تھا اور ہم سے جائیداد کا ایک معاملہ بھی کیا تھا اور اس کی ہمیں خیبر میں رہنے دینے کی شرط بھی آپ نے لگائی تھی۔ عمر رضی اللہ عنہ نے اس پر فرمایا کیا تم یہ سمجھتے ہو کہ میں رسول اللہ صلی اللہ علیہ وسلم کا فرمان بھول گیا ہوں۔ جب رسول اللہ صلی اللہ علیہ وسلم نے کہا تھا کہ تمہارا کیا حال ہو گا جب تم خیبر سے نکالے جاؤ گے اور تمہارے اونٹ تمہیں راتوں رات لیے پھریں گے۔ اس نے کہا یہ ابوالقاسم ( آپ صلی اللہ علیہ وسلم ) کا ایک مذاق تھا۔ عمر رضی اللہ عنہ نے فرمایا: اللہ کے دشمن! تم نے جھوٹی بات کہی۔ چنانچہ عمر رضی اللہ عنہ نے انہیں شہر بدر کر دیا اور ان کے پھلوں کی کچھ نقد قیمت کچھ مال اور اونٹ اور دوسرے سامان یعنی کجاوے اور رسیوں کی صورت میں ادا کر دی۔ اس کی روایت حماد بن سلمہ نے عبیداللہ سے نقل کی ہے جیسا کہ مجھے یقین ہے نافع سے اور انہوں نے ابن عمر رضی اللہ عنہما سے اور انہوں نے عمر رضی اللہ عنہ سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے مختصر طور پر۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 18
			}
		}
	]
}