{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"54": "Conditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "عقیل نے زہری سے بیان کیا ‘ ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم عورتوں کا ( جو مکہ سے مسلمان ہونے کی وجہ سے ہجرت کر کے مدینہ آتی تھیں ) امتحان لیتے تھے ( زہری نے ) بیان کیا کہ ہم تک یہ روایت پہنچی ہے کہ جب اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ مسلمان وہ سب کچھ ان مشرکوں کو واپس کر دیں جو انہوں نے اپنی ان بیویوں پر خرچ کیا ہو جو ( اب مسلمان ہو کر ) ہجرت کر آئی ہیں اور مسلمانوں کو حکم دیا کہ کافر عورتوں کو اپنے نکاح میں نہ رکھیں تو عمر رضی اللہ عنہ نے اپنی دو بیویوں قریبہ بنت ابی امیہ اور ایک جرول خزاعی کی لڑکی کو طلاق دے دی۔ بعد میں قریبہ سے معاویہ رضی اللہ عنہ نے شادی کر لی تھی ( کیونکہ اس وقت معاویہ رضی اللہ عنہ مسلمان نہیں ہوئے تھے ) اور دوسری بیوی سے ابوجہم نے شادی کر لی تھی لیکن جب کفار نے مسلمانوں کے ان اخراجات کو ادا کرنے سے انکار کیا جو انہوں نے اپنی ( کافرہ ) بیویوں پر کئے تھے تو اللہ تعالیٰ نے یہ آیت نازل فرمائی «وإن فاتكم شىء من أزواجكم إلى الكفار فعاقبتم‏» ”اور تمہاری بیویوں میں سے کوئی کافروں کے ہاں چلی گئی تو وہ معاوضہ تم خود ہی لے لو۔“ یہ وہ معاوضہ تھا جو مسلمان کفار میں سے اس شخص کو دیتے جس کی بیوی ہجرت کر کے ( مسلمان ہونے کے بعد کسی مسلمان کے نکاح میں آ گئی ہو ) پس اللہ نے اب یہ حکم دیا کہ جس مسلمان کی بیوی مرتد ہو کر ( کفار کے یہاں ) چلی جائے اس کے ( مہر و نفقہ کے ) اخراجات ان کفار کی عورتوں کے مہر سے ادا کر دئیے جائیں جو ہجرت کر کے آ گئی ہیں ( اور کسی مسلمان نے ان سے نکاح کر لیا ہے ) اگرچہ ہمارے پاس اس کا کوئی ثبوت نہیں کہ کوئی مہاجرہ بھی ایمان کے بعد مرتد ہوئی ہوں اور ہمیں یہ روایت بھی معلوم ہوئی کہ ابوبصیر بن اسید ثقفی رضی اللہ عنہ جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مومن و مہاجر کی حیثیت سے معاہدہ کی مدت کے اندر ہی حاضر ہوئے تو اخنس بن شریق نے نبی کریم صلی اللہ علیہ وسلم کو ایک تحریر لکھی جس میں اس نے ( ابوبصیر رضی اللہ عنہ کی واپسی کا ) مطالبہ آپ صلی اللہ علیہ وسلم سے کیا تھا۔ پھر انہوں نے حدیث پوری بیان کی۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 20
			}
		}
	]
}