{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"55": "Wills and Testaments (Wasaayaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "اور اسماعیل بن جعفر نے بیان کیا کہ مجھے عبدالعزیز بن عبداللہ بن ابی سلمہ نے خبر دی ‘ انہیں اسحاق بن عبداللہ بن ابی طلحہ نے (امام بخاری رحمہ اللہ نے کہا کہ) میں سمجھتا ہوں کہ یہ روایت انہوں نے انس رضی اللہ عنہ سے کی ہے کہ انہوں نے بیان کیا ( جب سورۃ آل عمران کی ) یہ آیت نازل ہوئی «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے۔“ تو ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ! اللہ تبارک و تعالیٰ اپنی کتاب میں فرماتا ہے «لن تنالوا البر حتى تنفقوا مما تحبون‏» ”تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے۔“ اور میرے اموال میں سب سے پسند مجھے بیرحاء ہے۔ بیان کیا کہ بیرحاء ایک باغ تھا۔ رسول اللہ صلی اللہ علیہ وسلم بھی اس میں تشریف لے جایا کرتے ‘ اس کے سائے میں بیٹھتے اور اس کا پانی پیتے ( ابوطلحہ نے کہا کہ ) اس لیے وہ اللہ عزوجل کی راہ میں صدقہ اور رسول اللہ صلی اللہ علیہ وسلم کے لیے ہے۔ میں اس کی نیکی اور اس کے ذخیرہ آخرت ہونے کی امید رکھتا ہوں۔ پس یا رسول اللہ! جس طرح اللہ آپ کو بتائے اسے خرچ کیجئے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا واہ واہ شاباش ابوطلحہ یہ تو بڑا نفع بخش مال ہے ‘ ہم تم سے اسے قبول کر کے پھر تمہارے ہی حوالے کر دیتے ہیں اور اب تم اسے اپنے عزیزوں کو دیدو۔ چنانچہ ابوطلحہ رضی اللہ عنہ نے وہ باغ اپنے عزیزوں کو دے دیا۔ انس رضی اللہ عنہ نے بیان کیا کہ جن لوگوں کو باغ آپ نے دیا تھا ان میں ابی اور حسان رضی اللہ عنہ تھے۔ انہوں نے بیان کیا کہ حسان رضی اللہ عنہ نے اپنا حصہ معاویہ رضی اللہ عنہ کو بیچ دیا تو کسی نے ان سے کہا کہ کیا آپ ابوطلحہ رضی اللہ عنہ کا دیا ہوا مال بیچ رہے ہو؟ حسان رضی اللہ عنہ نے جواب دیا کہ میں کھجور کا ایک صاع روپوں کے ایک صاع کے بدل کیوں نہ بیچوں۔ انس رضی اللہ عنہ نے کہا یہ باغ بنی حدیلہ کے محلہ کے قریب تھا جسے معاویہ رضی اللہ عنہ نے ( بطور قلعہ کے ) تعمیر کیا تھا۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		}
	]
}