{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "ہم سے قتیبہ بن سعید نے کہا، ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا، ان سے عمرو بن عمرو نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے فرمایا کہ اپنے بچوں میں سے کوئی بچہ میرے ساتھ کر دو جو خیبر کے غزوے میں میرے کام کر دیا کرے، جب کہ میں خیبر کا سفر کروں۔ ابوطلحہ اپنی سواری پر اپنے پیچھے بٹھا کر مجھے ( انس رضی اللہ عنہ کو ) لے گئے، میں اس وقت ابھی لڑکا تھا۔ بالغ ہونے کے قریب۔ جب بھی آپ صلی اللہ علیہ وسلم کہیں قیام فرماتے تو میں آپ صلی اللہ علیہ وسلم کی خدمت کرتا۔ اکثر میں سنتا کہ آپ صلی اللہ علیہ وسلم یہ دعا کرتے۔ «اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال» ”اے اللہ! میں تیری پناہ مانگتا ہوں غم، عاجزی، سستی، بخل، بزدلی، قرض داری کے بوجھ اور ظالم کے اپنے اوپر غلبہ سے، آخر ہم خیبر پہنچے اور جب اللہ تعالیٰ نے خیبر کے قلعہ پر آپ صلی اللہ علیہ وسلم کو فتح دی تو آپ صلی اللہ علیہ وسلم کے سامنے صفیہ بنت حی بن اخطب رضی اللہ عنہا کے جمال ( ظاہری و باطنی ) کا ذکر کیا گیا ان کا شوہر ( یہودی ) لڑائی میں کام آ گیا تھا اور وہ ابھی دلہن ہی تھیں ( اور چونکہ قبیلہ کے سردار کی لڑکی تھیں ) اس لیے رسول اللہ صلی اللہ علیہ وسلم نے ( ان کا اکرام کرنے کے لیے کہا ) انہیں اپنے لیے پسند فرما لیا۔ پھر آپ صلی اللہ علیہ وسلم انہیں ساتھ لے کر وہاں سے چلے۔ جب ہم سدا الصبہاء پر پہنچے تو وہ حیض سے پاک ہوئیں، تو آپ صلی اللہ علیہ وسلم نے ان سے خلوت کی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے حیس ( کھجور، پنیر اور گھی سے تیار کیا ہوا ایک کھانا ) تیار کرا کر ایک چھوٹے سے دستر خوان پر رکھوایا اور مجھ سے فرمایا کہ اپنے آس پاس کے لوگوں کو دعوت دے دو اور یہی آپ صلی اللہ علیہ وسلم کا سیدہ صفیہ رضی اللہ عنہا کے ساتھ نکاح کا ولیمہ تھا۔ آخر ہم مدینہ کی طرف چلے، انس رضی اللہ عنہ نے کہا کہ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم صفیہ رضی اللہ عنہا کی وجہ سے اپنے پیچھے ( اونٹ کے کوہان کے اردگرد ) اپنی عباء سے پردہ کئے ہوئے تھے ( سواری پر جب صفیہ رضی اللہ عنہا سوار ہوتیں ) تو آپ صلی اللہ علیہ وسلم اپنے اونٹ کے پاس بیٹھ جاتے اور اپنا گھٹنا کھڑا رکھتے اور صفیہ رضی اللہ عنہا اپنا پاؤں نبی کریم صلی اللہ علیہ وسلم کے گھٹنے پر رکھ کر سوار ہو جاتیں۔ اس طرح ہم چلتے رہے اور جب مدینہ منورہ کے قریب پہنچے تو آپ صلی اللہ علیہ وسلم نے احد پہاڑ کو دیکھا اور فرمایا یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں، اس کے بعد آپ صلی اللہ علیہ وسلم نے مدینہ کی طرف نگاہ اٹھائی اور فرمایا: اے اللہ! میں اس کے دونوں پتھریلے میدانوں کے درمیان کے خطے کو حرمت والا قرار دیتا ہوں جس طرح ابراہیم علیہ السلام نے مکہ معظمہ کو حرمت والا قرار دیا تھا اے اللہ! مدینہ کے لوگوں کو ان کی مد اور صاع میں برکت دیجئیے",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		}
	]
}