{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "ہم سے اسحاق بن محمد فروی نے بیان کیا ‘ کہا ہم سے مالک بن انس نے ‘ ان سے ابن شہاب نے ‘ ان سے مالک بن اوس بن حدثان نے ( زہری نے بیان کیا کہ ) محمد بن جبیر نے مجھ سے ( اسی آنے والی ) حدیث کا ذکر کیا تھا۔ اس لیے میں نے مالک بن اوس کی خدمت میں خود حاضر ہو کر ان سے اس حدیث کے متعلق ( بطور تصدیق ) پوچھا۔ انہوں نے کہا کہ دن چڑھ آیا تھا اور میں اپنے گھر والوں کے ساتھ بیٹھا ہوا تھا ‘ اتنے میں عمر بن خطاب رضی اللہ عنہ کا ایک بلانے والا میرے پاس آیا اور کہا کہ امیرالمؤمنین آپ کو بلا رہے ہیں۔ میں اس قاصد کے ساتھ ہی چلا گیا اور عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا۔ آپ ایک تخت پر بوریا بچھائے ‘ بورئیے پر کوئی بچھونا نہ تھا ‘ صرف ایک چمڑے کے تکئے پر ٹیک لگائے ہوئے تھے۔ میں سلام کر کے بیٹھ گیا۔ پھر انہوں نے فرمایا ‘ مالک! تمہاری قوم کے کچھ لوگ میرے پاس آئے تھے ‘ میں نے ان کے لیے کچھ حقیر سی امداد کا فیصلہ کر لیا ہے۔ تم اسے اپنی نگرانی میں ان میں تقسیم کرا دو ‘ میں نے عرض کیا ‘ یا امیرالمؤمنین! اگر آپ اس کام پر کسی اور کو مقرر فرما دیتے تو بہتر ہوتا۔ لیکن عمر رضی اللہ عنہ نے یہی اصرار کیا کہ نہیں ‘ اپنی ہی تحویل میں بانٹ دو۔ ابھی میں وہیں حاضر تھا کہ امیرالمؤمنین کے دربان یرفا آئے اور کہا کہ عثمان بن عفان ‘ عبدالرحمٰن بن عوف ‘ زبیر بن عوام اور سعد بن ابی وقاص رضی اللہ عنہما اندر آنے کی اجازت چاہتے ہیں؟ عمر رضی اللہ عنہ نے فرمایا کہ ہاں انہیں اندر بلا لو۔ آپ کی اجازت پر یہ حضرات داخل ہوئے اور سلام کر کے بیٹھ گئے۔ یرفا بھی تھوڑی دیر بیٹھے رہے اور پھر اندر آ کر عرض کیا علی اور عباس رضی اللہ عنہما کو بھی اندر آنے کی اجازت ہے؟ آپ نے فرمایا کہ ہاں انہیں بھی اندر بلا لو۔ آپ کی اجازت پر یہ حضرات بھی اندر تشریف لے آئے۔ اور سلام کر کے بیٹھ گئے۔ عباس رضی اللہ عنہ نے کہا ‘ یا امیرالمؤمنین! میرا اور ان کا فیصلہ کر دیجئیے۔ ان حضرات کا جھگڑا اس جائیداد کے بارے میں تھا جو اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو بنی نضیر کے اموال میں سے ( خمس کے طور پر ) عنایت فرمائی تھی۔ اس پر عثمان اور ان کے ساتھ جو دیگر صحابہ تھے کہنے لگے ‘ ہاں ‘ امیرالمؤمنین! ان حضرات میں فیصلہ فرما دیجئیے اور ہر ایک کو دوسرے کی طرف سے بےفکر کر دیجئیے۔ عمر رضی اللہ عنہ نے کہا ‘ اچھا ‘ تو پھر ذرا ٹھہرئیے اور دم لے لیجئے میں آپ لوگوں سے اس اللہ کی قسم دے کر پوچھتا ہوں جس کے حکم سے آسمان اور زمین قائم ہیں۔ کیا آپ لوگوں کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ”ہم پیغمبروں کا کوئی وارث نہیں ہوتا ‘ جو کچھ ہم ( انبیاء ) چھوڑ کر جاتے ہیں وہ صدقہ ہوتا ہے۔“ جس سے آپ صلی اللہ علیہ وسلم کی مراد خود اپنی ذات گرامی بھی تھی۔ ان حضرات نے تصدیق کی ‘ کہ جی ہاں ‘ بیشک آپ صلی اللہ علیہ وسلم نے یہ فرمایا تھا۔ اب عمر رضی اللہ عنہ، علی اور عباس رضی اللہ عنہما کی طرف مخاطب ہوئے ‘ ان سے پوچھا۔ میں آپ حضرات کو اللہ کی قسم دیتا ہوں ‘ کیا آپ حضرات کو بھی معلوم ہے کہ آپ صلی اللہ علیہ وسلم نے ایسا فرمایا ہے یا نہیں؟ انہوں نے بھی اس کی تصدیق کی کہ آپ صلی اللہ علیہ وسلم نے بیشک ایسا فرمایا ہے۔ عمر رضی اللہ عنہ نے کہا کہ اب میں آپ لوگوں سے اس معاملہ کی شرح بیان کرتا ہوں۔ بات یہ ہے کہ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کے لیے اس غنیمت کا ایک مخصوص حصہ مقرر کر دیا تھا۔ جسے آپ صلی اللہ علیہ وسلم نے بھی کسی دوسرے کو نہیں دیا تھا۔ پھر آپ نے اس آیت کی تلاوت کی «وما أفاء الله على رسوله منهم‏» سے اللہ تعالیٰ کے ارشاد «قدير‏» تک اور وہ حصہ آپ صلی اللہ علیہ وسلم کے لیے خاص رہا۔ مگر قسم اللہ کی یہ جائیداد آپ صلی اللہ علیہ وسلم نے تم کو چھوڑ کر اپنے لیے جوڑ نہ رکھی ‘ نہ خاص اپنے خرچ میں لائے ‘ بلکہ تم ہی لوگوں کو دیں اور تمہارے ہی کاموں میں خرچ کیں۔ یہ جو جائیداد بچ رہی ہے اس میں سے آپ اپنی بیویوں کا سال بھر کا خرچ لیا کرتے اس کے بعد جو باقی بچتا وہ اللہ کے مال میں شریک کر دیتے ( جہاد کے سامان فراہم کرنے میں ) خیر آپ صلی اللہ علیہ وسلم تو اپنی زندگی میں ایسا ہی کرتے رہے۔ حاضرین تم کو اللہ کی قسم! کیا تم یہ نہیں جانتے؟ انہوں نے کہا بیشک جانتے ہیں۔ پھر عمر رضی اللہ عنہ نے علی اور عباس رضی اللہ عنہما سے کہا میں آپ حضرات سے بھی قسم دے کر پوچھتا ہوں ‘ کیا آپ لوگ یہ نہیں جانتے ہیں؟ ( دونوں حضرات نے جواب دیا ہاں! ) پھر عمر رضی اللہ عنہ نے یوں فرمایا کہ پھر اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو دنیا سے اٹھا لیا تو ابوبکر صدیق رضی اللہ عنہ کہنے لگے کہ میں رسول اللہ صلی اللہ علیہ وسلم کا خلیفہ ہوں ‘ اور اس لیے انہوں نے ( آپ صلی اللہ علیہ وسلم کی اس مخلص ) جائیداد پر قبضہ کیا اور جس طرح آپ صلی اللہ علیہ وسلم اس میں مصارف کیا کرتے تھے ‘ وہ کرتے رہے۔ اللہ خوب جانتا ہے کہ ابوبکر رضی اللہ عنہ اپنے اس طرز عمل میں سچے مخلص ‘ نیکوکار اور حق کی پیروی کرنے والے تھے۔ پھر اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو بھی اپنے پاس بلا لیا اور اب میں ابوبکر رضی اللہ عنہ کا نائب مقرر ہوا۔ میری خلافت کو دو سال ہو گئے ہیں۔ اور میں نے بھی اس جائیداد کو اپنی تحویل میں رکھا ہے۔ جو مصارف رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ اس میں کیا کرتے تھے ویسا ہی میں بھی کرتا رہا اور اللہ خوب جانتا ہے کہ میں اپنے اس طرز عمل میں سچا ‘ مخلص اور حق کی پیروی کرنے والا ہوں۔ پھر آپ دونوں میرے پاس مجھ سے گفتگو کرنے آئے اور بالاتفاق گفتگو کرنے لگے کہ دونوں کا مقصد ایک تھا۔ جناب عباس! آپ تو اس لیے تشریف لائے کہ آپ کو اپنے بھتیجے ( صلی اللہ علیہ وسلم ) کی میراث کا دعویٰ میرے سامنے پیش کرنا تھا۔ پھر علی رضی اللہ عنہ سے فرمایا کہ آپ اس لیے تشریف لائے کہ آپ کو اپنی بیوی ( فاطمہ رضی اللہ عنہا ) کا دعویٰ پیش کرنا تھا کہ ان کے والد ( رسول اللہ صلی اللہ علیہ وسلم ) کی میراث انہیں ملنی چاہئے ‘ میں نے آپ دونوں حضرات سے عرض کر دیا کہ رسول اللہ صلی اللہ علیہ وسلم خود فرما گئے کہ ہم پیغمبروں کا کوئی میراث تقسیم نہیں ہوتی ‘ ہم جو کچھ چھوڑ جاتے ہیں وہ صدقہ ہوتا ہے۔ پھر مجھ کو یہ مناسب معلوم ہوا کہ میں ان جائیدادوں کو تمہارے قبضے میں دے دوں ‘ تو میں نے تم سے کہا ‘ دیکھو اگر تم چاہو تو میں یہ جائیداد تمہارے سپرد کر دیتا ہوں ‘ لیکن اس عہد اور اس اقرار پر کہ تم اس کی آمدنی سے وہ سب کام کرتے رہو گے جو آپ صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ اپنی خلافت میں کرتے رہے اور جو کام میں اپنی حکومت کے شروع سے کرتا رہا۔ تم نے اس شرط کو قبول کر کے درخواست کی کہ جائیدادیں ہم کو دے دو۔ میں نے اسی شرط پر دے دی ‘ حاضرین کہو میں نے یہ جائیدادیں اسی شرط پر ان کے حوالے کی ہیں یا نہیں؟ انہوں نے کہا ‘ بیشک اسی شرط پر آپ نے دی ہیں۔ پھر عمر رضی اللہ عنہ نے علی رضی اللہ عنہ اور عباس رضی اللہ عنہ سے فرمایا ‘ میں تم کو اللہ کی قسم دیتا ہوں ‘ میں نے اسی شرط پر یہ جائیدادیں آپ حضرات کے حوالے کی ہیں یا نہیں؟ انہوں نے کہا بیشک۔ عمر رضی اللہ عنہ نے کہا ‘ پھر مجھ سے کس بات کا فیصلہ چاہتے ہو؟ ( کیا جائیداد کو تقسیم کرانا چاہتے ہو ) قسم اللہ کی! جس کے حکم سے زمین اور آسمان قائم ہیں میں تو اس کے سوا اور کوئی فیصلہ کرنے والا نہیں۔ ہاں! یہ اور بات ہے کہ اگر تم سے اس کا انتظام نہیں ہو سکتا تو پھر جائیداد میرے سپرد کر دو۔ میں اس کا بھی کام دیکھ لوں گا۔",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		}
	]
}