{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "ہم سے سعید بن محمد جرمی نے بیان کیا ‘ کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا ہم سے میرے والد نے بیان کیا ‘ ان سے ولید بن کثیر نے ‘ ان سے محمد بن عمرو بن حلحلہ ڈولی نے ‘ ان سے ابن شہاب نے ‘ ان سے علی بن حسین (زین العابدین رحمہ اللہ) نے بیان کیا کہ جب ہم سب حضرات حسین بن علی رضی اللہ عنہما کی شہادت کے بعد یزید بن معاویہ کے یہاں سے مدینہ منورہ تشریف لائے تو مسور بن مخرمہ رضی اللہ عنہ نے آپ سے ملاقات کی ‘ اور کہا اگر آپ کو کوئی ضرورت ہو تو مجھے حکم فرما دیجئیے۔ ( زین العابدین نے بیان کیا کہ ) میں نے کہا ‘ مجھے کوئی ضرورت نہیں ہے۔ پھر مسور رضی اللہ عنہ نے کہا تو کیا آپ مجھے رسول اللہ صلی اللہ علیہ وسلم کی تلوار عنایت فرمائیں گے؟ کیونکہ مجھے خوف ہے کہ کچھ لوگ ( بنو امیہ ) اسے آپ سے نہ چھین لیں اور اللہ کی قسم! اگر وہ تلوار آپ مجھے عنایت فرما دیں تو کوئی شخص بھی جب تک میری جان باقی ہے اسے چھین نہیں سکے گا۔ پھر مسور رضی اللہ عنہ نے ایک قصہ بیان کیا کہ علی بن ابی طالب رضی اللہ عنہ نے فاطمہ رضی اللہ عنہا کی موجودگی میں ابوجہل کی ایک بیٹی ( جمیلہ نامی رضی اللہ عنہا ) کو پیغام نکاح دے دیا تھا۔ میں نے خود سنا کہ اسی مسئلہ پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے اسی منبر پر کھڑے ہو کر صحابہ کو خطاب فرمایا۔ میں اس وقت بالغ تھا۔ آپ صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ فاطمہ مجھ سے ہے۔ اور مجھے ڈر ہے کہ کہیں وہ ( اس رشتہ کی وجہ سے ) کسی گناہ میں نہ پڑ جائے کہ اپنے دین میں وہ کسی فتنہ میں مبتلا ہو۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خاندان بنی عبد شمس کے ایک اپنے داماد ( عاص بن ربیع ) کا ذکر کیا اور دامادی سے متعلق آپ نے ان کی تعریف کی ‘ آپ نے فرمایا کہ انہوں نے مجھ سے جو بات کہی سچ کہی ‘ جو وعدہ کیا ‘ اسے پورا کیا۔ میں کسی حلال ( یعنی نکاح ثانی ) کو حرام نہیں کر سکتا اور نہ کسی حرام کو حلال بناتا ہوں۔ لیکن اللہ کی قسم! رسول اللہ کی بیٹی اور اللہ کے دشمن کی بیٹی ایک ساتھ جمع نہیں ہوں گی۔",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 19
			}
		}
	]
}