{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے کہا کہ ہم سے حماد نے بیان کیا ‘ کہا ہم سے ایوب نے بیان کیا ‘ ان سے ابوقلابہ نے بیان کیا اور (ایوب نے ایک دوسری سند کے ساتھ اس طرح روایت کی ہے کہ) مجھ سے قاسم بن عاصم کلیبی نے بیان کیا اور کہا کہ قاسم کی حدیث (ابوقلابہ کی حدیث کی بہ نسبت) مجھے زیادہ اچھی طرح یاد ہے ‘ زہدم سے ‘ انہوں نے بیان کیا کہ ہم ابوموسیٰ اشعری رضی اللہ عنہ کی مجلس میں حاضر تھے ( کھانا لایا گیا اور ) وہاں مرغی کا ذکر ہونے لگا۔ بنی تمیم اللہ کے ایک آدمی سرخ رنگ والے وہاں موجود تھے۔ غالباً موالی میں سے تھے۔ انہیں بھی ابوموسیٰ رضی اللہ عنہ نے کھانے پر بلایا ‘ وہ کہنے لگے کہ میں نے مرغی کو گندی چیزیں کھاتے ایک مرتبہ دیکھا تھا تو مجھے بڑی نفرت ہوئی اور میں نے قسم کھا لی کہ اب کبھی مرغی کا گوشت نہ کھاؤں گا۔ ابوموسیٰ رضی اللہ عنہ نے کہا کہ قریب آ جاؤ ( تمہاری قسم پر ) میں تم سے ایک حدیث اسی سلسلے کی بیان کرتا ہوں ‘ قبیلہ اشعر کے چند لوگوں کو ساتھ لے کر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( غزوہ تبوک کے لیے ) حاضر ہوا اور سواری کی درخواست کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ کی قسم! میں تمہارے لیے سواری کا انتظام نہیں کر سکتا ‘ کیونکہ میرے پاس کوئی ایسی چیز نہیں ہے جو تمہاری سواری کے کام آ سکے۔“ پھر آپ صلی اللہ علیہ وسلم کی خدمت میں غنیمت کے کچھ اونٹ آئے ‘ تو آپ صلی اللہ علیہ وسلم نے ہمارے متعلق دریافت فرمایا ‘ اور فرمایا کہ قبیلہ اشعر کے لوگ کہاں ہیں؟ چنانچہ آپ صلی اللہ علیہ وسلم نے پانچ اونٹ ہمیں دیئے جانے کا حکم صادر فرمایا ‘ خوب موٹے تازے اور فربہ۔ جب ہم چلنے لگے تو ہم نے آپس میں کہا کہ جو نامناسب طریقہ ہم نے اختیار کیا اس سے آپ صلی اللہ علیہ وسلم کے اس عطیہ میں ہمارے لیے کوئی برکت نہیں ہو سکتی۔ چنانچہ ہم پھر آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ ہم نے پہلے جب آپ سے درخواست کی تھی تو آپ نے قسم کھا کر فرمایا تھا کہ میں تمہاری سواری کا انتظام نہیں کر سکوں گا۔ شاید آپ کو وہ قسم یاد نہ رہی ہو ‘ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہاری سواری کا انتظام واقعی نہیں کیا ‘ وہ اللہ تعالیٰ ہے جس نے تمہیں یہ سواریاں دے دی ہیں۔ اللہ کی قسم! تم اس پر یقین رکھو کہ ان شاءاللہ جب بھی میں کوئی قسم کھاؤں ‘ پھر مجھ پر یہ بات ظاہر ہو جائے کہ بہتر اور مناسب طرز عمل اس کے سوا میں ہے تو میں وہی کروں گا جس میں اچھائی ہو گی اور قسم کا کفارہ دے دوں گا۔",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		}
	]
}