{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3464,
			"arabicnumber": 3464,
			"text": "مجھ سے احمد بن اسحاق نے بیان کیا، کہا ہم سے عمرو بن عاصم نے بیان کیا، ان سے ہمام نے بیان کیا، ان سے اسحاق بن عبداللہ نے بیان کیا، کہا مجھ سے عبدالرحمٰن بن ابی حمزہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا (دوسری سند) اور مجھ سے محمد نے بیان کیا، کہا ہم سے عبداللہ بن رجاء نے بیان کیا، انہیں ہمام نے خبر دی، ان سے اسحاق بن عبداللہ نے بیان کیا، انہیں عبدالرحمٰن بن ابی عمرہ نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ بنی اسرائیل میں تین شخص تھے، ایک کوڑھی، دوسرا اندھا اور تیسرا گنجا، اللہ تعالیٰ نے چاہا کہ ان کا امتحان لے۔ چنانچہ اللہ تعالیٰ نے ان کے پاس ایک فرشتہ بھیجا۔ فرشتہ پہلے کوڑھی کے پاس آیا اور اس سے پوچھا کہ تمہیں سب سے زیادہ کیا چیز پسند ہے؟ اس نے جواب دیا کہ اچھا رنگ اور اچھی چمڑی کیونکہ مجھ سے لوگ پرہیز کرتے ہیں۔ بیان کیا کہ فرشتے نے اس پر اپنا ہاتھ پھیرا تو اس کی بیماری دور ہو گئی اور اس کا رنگ بھی خوبصورت ہو گیا اور چمڑی بھی اچھی ہو گئی۔ فرشتے نے پوچھا کس طرح کا مال تم زیادہ پسند کرو گے؟ اس نے کہا کہ اونٹ! یا اس نے گائے کہی، اسحاق بن عبداللہ کو اس سلسلے میں شک تھا کہ کوڑھی اور گنجے دونوں میں سے ایک نے اونٹ کی خواہش کی تھی اور دوسرے نے گائے کی۔ چنانچہ اسے حاملہ اونٹنی دی گئی اور کہا گیا کہ اللہ تعالیٰ تمہیں اس میں برکت دے گا، پھر فرشتہ گنجے کے پاس آیا اور اس سے پوچھا کہ تمہیں کیا چیز پسند ہے؟ اس نے کہا کہ عمدہ بال اور موجودہ عیب میرا ختم ہو جائے کیونکہ لوگ اس کی وجہ سے مجھ سے پرہیز کرتے ہیں۔ بیان کیا کہ فرشتے نے اس کے سر پر ہاتھ پھیرا اور اس کا عیب جاتا رہا اور اس کے بجائے عمدہ بال آ گئے۔ فرشتے نے پوچھا، کس طرح کا مال پسند کرو گے؟ اس نے کہا کہ گائے! بیان کیا کہ فرشتے نے اسے حاملہ گائے دے دی اور کہا کہ اللہ تعالیٰ اس میں برکت دے گا۔ پھر اندھے کے پاس فرشتہ آیا اور کہا کہ تمہیں کیا چیز پسند ہے؟ اس نے کہا کہ اللہ تعالیٰ مجھے آنکھوں کی روشنی دیدے تاکہ میں لوگوں کو دیکھ سکوں۔ بیان کیا کہ فرشتے نے ہاتھ پھیرا اور اللہ تعالیٰ نے اس کی بینائی اسے واپس دے دی۔ پھر پوچھا کہ کس طرح کا مال تم پسند کرو گے؟ اس نے کہا کہ بکریاں! فرشتے نے اسے حاملہ بکری دے دی۔ پھر تینوں جانوروں کے بچے پیدا ہوئے، یہاں تک کہ کوڑھی کے اونٹوں سے اس کی وادی بھر گئی، گنجے کی گائے بیل سے اس کی وادی بھر گئی اور اندھے کی بکریوں سے اس کی وادی بھر گئی۔ پھر دوبارہ فرشتہ اپنی اسی پہلی شکل میں کوڑھی کے پاس آیا اور کہا کہ میں ایک نہایت مسکین و فقیر آدمی ہوں، سفر کا تمام سامان و اسباب ختم ہو چکا ہے اور اللہ تعالیٰ کے سوا اور کسی سے حاجت پوری ہونے کی امید نہیں، لیکن میں تم سے اسی ذات کا واسطہ دے کر جس نے تمہیں اچھا رنگ اور اچھا چمڑا اور مال عطا کیا، ایک اونٹ کا سوال کرتا ہوں جس سے سفر کو پورا کر سکوں۔ اس نے فرشتے سے کہا کہ میرے ذمہ حقوق اور بہت سے ہیں۔ فرشتہ نے کہا، غالباً میں تمہیں پہچانتا ہوں، کیا تمہیں کوڑھ کی بیماری نہیں تھی جس کی وجہ سے لوگ تم سے گھن کھاتے تھے۔ تم ایک فقیر اور قلاش تھے۔ پھر تمہیں اللہ تعالیٰ نے یہ چیزیں عطا کیں؟ اس نے کہا کہ یہ ساری دولت تو میرے باپ دادا سے چلی آ رہی ہے۔ فرشتے نے کہا کہ اگر تم جھوٹے ہو تو اللہ تمہیں اپنی پہلی حالت پر لوٹا دے۔ پھر فرشتہ گنجے کے پاس اپنی اسی پہلی صورت میں آیا اور اس سے بھی وہی درخواست کی اور اس نے بھی وہی کوڑھی والا جواب دیا۔ فرشتے نے کہا کہ اگر تم جھوٹے ہو تو اللہ تعالیٰ تمہیں اپنی پہلی حالت پر لوٹا دے۔ اس کے بعد فرشتہ اندھے کے پاس آیا، اپنی اسی پہلی صورت میں اور کہا کہ میں ایک مسکین آدمی ہوں، سفر کے تمام سامان ختم ہو چکے ہیں اور سوا اللہ تعالیٰ کے کسی سے حاجت پوری ہونے کی توقع نہیں۔ میں تم سے اس ذات کا واسطہ دے کر جس نے تمہیں تمہاری بینائی واپس دی ہے، ایک بکری مانگتا ہوں جس سے اپنے سفر کی ضروریات پوری کر سکوں۔ اندھے نے جواب دیا کہ واقعی میں اندھا تھا اور اللہ تعالیٰ نے مجھے اپنے فضل سے بینائی عطا فرمائی اور واقعی میں فقیر و محتاج تھا اور اللہ تعالیٰ نے مجھے مالدار بنایا۔ تم جتنی بکریاں چاہو لے سکتے ہو، اللہ کی قسم جب تم نے اللہ کا واسطہ دیا ہے تو جتنا بھی تمہارا جی چاہے لے جاؤ، میں تمہیں ہرگز نہیں روک سکتا۔ فرشتے نے کہا کہ تم اپنا مال اپنے پاس رکھو، یہ تو صرف امتحان تھا اور اللہ تعالیٰ تم سے راضی اور خوش ہے اور تمہارے دونوں ساتھیوں سے ناراض ہے۔",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 131
			}
		}
	]
}