{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"7": "Rubbing hands and feet with dust (Tayammum)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 347,
			"arabicnumber": 347,
			"text": "ہم سے محمد بن سلام نے بیان کیا، کہا ہمیں ابومعاویہ نے خبر دی اعمش سے، انہوں نے شقیق سے، انہوں نے بیان کیا کہ میں عبداللہ بن مسعود رضی اللہ عنہ اور ابوموسیٰ اشعری رضی اللہ عنہ کی خدمت میں حاضر تھا۔ ابوموسیٰ رضی اللہ عنہ نے عبداللہ بن مسعود رضی اللہ عنہا سے کہا کہ اگر ایک شخص کو غسل کی حاجت ہو اور مہینہ بھر پانی نہ پائے تو کیا وہ تیمم کر کے نماز نہ پڑھے؟ شقیق کہتے ہیں کہ عبداللہ بن مسعود رضی اللہ عنہما نے جواب دیا کہ وہ تیمم نہ کرے اگرچہ وہ ایک مہینہ تک پانی نہ پائے ( اور نماز موقوف رکھے ) ابوموسیٰ رضی اللہ عنہ نے اس پر کہا کہ پھر سورۃ المائدہ کی اس آیت کا کیا مطلب ہو گا ”اگر تم پانی نہ پاؤ تو پاک مٹی پر تیمم کر لو۔“ عبداللہ بن مسعود رضی اللہ عنہما بولے کہ اگر لوگوں کو اس کی اجازت دے دی جائے تو جلد ہی یہ حال ہو جائے گا کہ جب ان کو پانی ٹھنڈا معلوم ہو گا تو وہ مٹی سے تیمم ہی کر لیں گے۔ اعمش نے کہا میں نے شقیق سے کہا تو تم نے جنبی کے لیے تیمم اس لیے برا جانا۔ انہوں نے کہا ہاں۔ پھر ابوموسیٰ اشعری رضی اللہ عنہ نے فرمایا کہ کیا آپ کو عمار کا عمر بن خطاب رضی اللہ عنہ کے سامنے یہ قول معلوم نہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے کسی کام کے لیے بھیجا تھا۔ سفر میں مجھے غسل کی ضرورت ہو گئی، لیکن پانی نہ ملا۔ اس لیے میں مٹی میں جانور کی طرح لوٹ پوٹ لیا۔ پھر میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے لیے صرف اتنا کرنا کافی تھا۔ اور آپ نے اپنے ہاتھوں کو زمین پر ایک مرتبہ مارا پھر ان کو جھاڑ کر بائیں ہاتھ سے داہنے کی پشت کو مل لیا یا بائیں ہاتھ کا داہنے ہاتھ سے مسح کیا۔ پھر دونوں ہاتھوں سے چہرے کا مسح کیا۔ عبداللہ نے اس کا جواب دیا کہ آپ عمر کو نہیں دیکھتے کہ انہوں نے عمار کی بات پر قناعت نہیں کی تھی۔ اور یعلیٰ ابن عبید نے اعمش کے واسطہ سے شقیق سے روایت میں یہ زیادتی کی ہے کہ انہوں نے کہا کہ میں عبداللہ اور ابوموسیٰ کی خدمت میں تھا اور ابوموسیٰ نے فرمایا تھا کہ آپ نے عمر سے عمار کا یہ قول نہیں سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے اور آپ کو بھیجا۔ پس مجھے غسل کی حاجت ہو گئی اور میں نے مٹی میں لوٹ پوٹ لیا۔ پھر میں رات رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے صورت حال کے متعلق ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں صرف اتنا ہی کافی تھا اور اپنے چہرے اور ہتھیلیوں کا ایک ہی مرتبہ مسح کیا۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		}
	]
}