{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے سلم بن زریر نے بیان کیا، انہوں نے ابورجاء سے سنا کہ ہم سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے، رات بھر سب لوگ چلتے رہے جب صبح کا وقت قریب ہوا تو پڑاؤ کیا ( چونکہ ہم تھکے ہوئے تھے ) اس لیے سب لوگ اتنی گہری نیند سو گئے کہ سورج پوری طرح نکل آیا۔ سب سے پہلے ابوبکر صدیق رضی اللہ عنہ جاگے۔ لیکن آپ صلی اللہ علیہ وسلم کو، جب آپ سوتے ہوتے تو جگاتے نہیں تھے تاآنکہ آپ خود ہی جاگتے، پھر عمر رضی اللہ عنہ بھی جاگ گئے۔ آخر ابوبکر رضی اللہ عنہ آپ کے سر مبارک کے قریب بیٹھ گئے اور بلند آواز سے اللہ اکبر کہنے لگے۔ اس سے آپ صلی اللہ علیہ وسلم بھی جاگ گئے اور وہاں سے کوچ کا حکم دے دیا۔ ( پھر کچھ فاصلے پر تشریف لائے ) اور یہاں آپ صلی اللہ علیہ وسلم اترے اور آپ نے ہمیں صبح کی نماز پڑھائی۔ ایک شخص ہم سے دور کونے میں بیٹھا رہا۔ اس نے ہمارے ساتھ نماز نہیں پڑھی۔ آپ صلی اللہ علیہ وسلم جب نماز سے فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: اے فلاں! ہمارے ساتھ نماز پڑھنے سے تجھے کس چیز نے روکا؟ اس نے عرض کیا کہ مجھے غسل کی حاجت ہو گئی ہے۔ آپ صلی اللہ علیہ وسلم نے اسے حکم دیا کہ پاک مٹی سے تیمم کر لو ( پھر اس نے بھی تیمم کے بعد ) نماز پڑھی۔ عمران رضی اللہ عنہ کہتے ہیں کہ پھر آپ صلی اللہ علیہ وسلم نے مجھے چند سواروں کے ساتھ آگے بھیج دیا۔ ( تاکہ پانی تلاش کریں کیونکہ ) ہمیں سخت پیاس لگی ہوئی تھی، اب ہم اسی حالت میں چل رہے تھے کہ ہمیں ایک عورت ملی جو دو مشکوں کے درمیان ( سواری پر ) اپنے پاؤں لٹکائے ہوئے جا رہی تھی۔ ہم نے اس سے کہا کہ پانی کہاں ملتا ہے؟ اس نے جواب دیا کہ یہاں پانی نہیں ہے۔ ہم نے اس سے پوچھا کہ تمہارے گھر سے پانی کتنے فاصلے پر ہے؟ اس نے جواب دیا کہ ایک دن ایک رات کا فاصلہ ہے، ہم نے اس سے کہا کہ اچھا تم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں چلو، وہ بولی رسول اللہ کے کیا معنی ہیں؟ عمران رضی اللہ عنہ کہتے ہیں، آخر ہم اسے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لائے، اس نے آپ سے بھی وہی کہا جو ہم سے کہہ چکی تھی۔ ہاں اتنا اور کہا کہ وہ یتیم بچوں کی ماں ہے ( اس لیے واجب الرحم ہے ) آپ صلی اللہ علیہ وسلم کے حکم سے اس کے دونوں مشکیزوں کو اتارا گیا اور آپ نے ان کے دہانوں پر دست مبارک پھیرا۔ ہم چالیس پیاسے آدمیوں نے اس میں سے خوب سیراب ہو کر پیا اور اپنے تمام مشکیزے اور بالٹیاں بھی بھر لیں صرف ہم نے اونٹوں کو پانی نہیں پلایا، اس کے باوجود اس کی مشکیں پانی سے اتنی بھری ہوئی تھیں کہ معلوم ہوتا تھا ابھی بہہ پڑیں گی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو کچھ تمہارے پاس ہے ( کھانے کی چیزوں میں سے ) میرے پاس لاؤ۔ چنانچہ اس عورت کے لیے روٹی کے ٹکڑے اور کھجوریں لا کر جمع کر دیں گئیں۔ پھر جب وہ اپنے قبیلے میں آئی تو اپنے آدمیوں سے اس نے کہا کہ آج میں سب سے بڑے جادوگر سے مل کر آئی ہوں یا پھر جیسا کہ ( اس کے ماننے والے ) لوگ کہتے ہیں، وہ واقعی نبی ہے۔ آخر اللہ تعالیٰ نے اس کے قبیلے کو اسی عورت کی وجہ سے ہدایت دی، وہ خود بھی اسلام لائی اور تمام قبیلے والوں نے بھی اسلام قبول کر لیا۔",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 80
			}
		}
	]
}