{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو مالک نے خبر دی، انہیں اسحٰق بن عبداللہ بن ابی طلحہ نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے کہا کہ ابوطلحہ رضی اللہ عنہ نے ( میری والدہ ) ام سلیم رضی اللہ عنہما سے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی آواز سنی تو آپ کی آواز میں بہت ضعف معلوم ہوا۔ میرا خیال ہے کہ آپ بہت بھوکے ہیں۔ کیا تمہارے پاس کچھ کھانا ہے؟ انہوں نے کہا جی ہاں، چنانچہ انہوں نے جَو کی چند روٹیاں نکالیں، پھر اپنی اوڑھنی نکالی او اس میں روٹیوں کو لپیٹ کر میرے ہاتھ میں چھپا دیا اور اس اوڑھنی کا دوسرا حصہ میرے بدن پر باندھ دیا۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں مجھے بھیجا۔ میں جو گیا تو آپ مسجد میں تشریف رکھتے تھے۔ آپ کے ساتھ بہت سے صحابہ بھی بیٹھے ہوئے تھے۔ میں آپ کے پاس کھڑا ہو گیا تو آپ نے فرمایا کیا ابوطلحہ نے تمہیں بھیجا ہے؟ میں نے عرض کیا جی ہاں۔ آپ نے دریافت فرمایا، کچھ کھانا دے کر؟ میں نے عرض کیا جی ہاں، جو صحابہ آپ کے ساتھ اس وقت موجود تھے، ان سب سے آپ نے فرمایا کہ چلو اٹھو، آپ تشریف لانے لگے اور میں آپ کے آگے آگے لپک رہا تھا اور ابوطلحہ رضی اللہ عنہ کے گھر پہنچ کر میں نے انہیں خبر دی۔ ابوطلحہ رضی اللہ عنہ بولے، ام سلیم! نبی کریم صلی اللہ علیہ وسلم تو بہت سے لوگوں کو ساتھ لائے ہیں ہمارے پاس اتنا کھانا کہاں ہے کہ سب کو کھلایا جا سکے؟ ام سلیم رضی اللہ عنہ نے کہا: اللہ اور اس کے رسول زیادہ جانتے ہیں ( ہم فکر کیوں کریں؟ ) خیر ابوطلحہ آگے بڑھ کر نبی کریم صلی اللہ علیہ وسلم سے ملے۔ اب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وہ بھی چل رہے تھے۔ ام سلیم نے وہی روٹی لا کر آپ کے سامنے رکھ دی، پھر نبی کریم صلی اللہ علیہ وسلم کے حکم سے روٹیوں کا چورا کر دیا گیا، ام سلیم رضی اللہ عنہا نے کپی نچوڑ کر اس پر کچھ گھی ڈال دیا، اور اس طرح سالن ہو گیا، آپ نے اس کے بعد اس پر دعا کی جو کچھ بھی اللہ تعالیٰ نے چاہا۔ پھر فرمایا دس آدمیوں کو بلا لو، انہوں نے ایسا ہی کیا، ان سب نے روٹی پیٹ بھر کر کھائی اور جب یہ لوگ باہر گئے تو آپ نے فرمایا کہ پھر دس آدمیوں کو بلا لو۔ چنانچہ دس آدمیوں کو بلایا گیا، انہوں نے بھی پیٹ بھر کر کھایا، جب یہ لوگ باہر گئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر دس ہی آدمیوں کو اندر بلا لو۔ انہوں نے ایسا ہی کیا اور انہوں نے بھی پیٹ بھر کر کھایا۔ جب وہ باہر گئے تو آپ نے فرمایا کہ پھر دس آدمیوں کو دعوت دے دو۔ اس طرح سب لوگوں نے پیٹ بھر کر کھانا کھایا۔ ان لوگوں کی تعداد ستر یا اسی تھی۔",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 87
			}
		}
	]
}