{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "مجھ سے محمد بن حکم نے بیان کیا، کہا ہم کو نضر نے خبر دی، کہا ہم کو اسرائیل نے خبر دی، کہا ہم کو سعد طائی نے خبر دی، انہیں محل بن خلیفہ نے خبر دی، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا کہ ایک صاحب آئے اور آپ صلی اللہ علیہ وسلم سے فقر و فاقہ کی شکایت کی، پھر دوسرے صاحب آئے اور راستوں کی بدامنی کی شکایت کی، اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا: عدی! تم نے مقام حیرہ دیکھا ہے؟ ( جو کوفہ کے پاس ایک بستی ہے ) میں نے عرض کیا کہ میں نے دیکھا تو نہیں، البتہ اس کا نام میں نے سنا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تمہاری زندگی کچھ اور لمبی ہوئی تو تم دیکھو گے کہ ہودج میں ایک عورت اکیلی حیرہ سے سفر کرے گی اور ( مکہ پہنچ کر ) کعبہ کا طواف کرے گی اور اللہ کے سوا اسے کسی کا بھی خوف نہ ہو گا۔ میں نے ( حیرت سے ) اپنے دل میں کہا، پھر قبیلہ طے کے ان ڈاکوؤں کا کیا ہو گا جنہوں نے شہروں کو تباہ کر دیا ہے اور فساد کی آگ سلگا رکھی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: اگر تم کچھ اور دنوں تک زندہ رہے تو کسریٰ کے خزانے ( تم پر ) کھولے جائیں گے۔ میں ( حیرت میں ) بول پڑا کسریٰ بن ہرمز ( ایران کا بادشاہ ) کسریٰ؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں کسریٰ بن ہرمز! اور اگر تم کچھ دنوں تک اور زندہ رہے تو یہ بھی دیکھو گے کہ ایک شخص اپنے ہاتھ میں سونا چاندی بھر کر نکلے گا، اسے کسی ایسے آدمی کی تلاش ہو گی ( جو اس کی زکوٰۃ ) قبول کر لے لیکن اسے کوئی ایسا آدمی نہیں ملے گا جو اسے قبول کر لے۔ اللہ تعالیٰ سے ملاقات کا جو دن مقرر ہے اس وقت تم میں سے ہر کوئی اللہ سے اس حال میں ملاقات کرے گا کہ درمیان میں کوئی ترجمان نہ ہو گا ( بلکہ پروردگار اس سے بلاواسطہ باتیں کرے گا ) اللہ تعالیٰ اس سے دریافت کرے گا۔ کیا میں نے تمہارے پاس رسول نہیں بھیجے تھے جنہوں نے تم تک میرا پیغام پہنچا دیا ہو؟ وہ عرض کرے گا بیشک تو نے بھیجا تھا۔ اللہ تعالیٰ دریافت فرمائے گا کیا میں نے مال اور اولاد تمہیں نہیں دی تھی؟ کیا میں نے ان کے ذریعہ تمہیں فضیلت نہیں دی تھی؟ وہ جواب دے گا بیشک تو نے دیا تھا۔ پھر وہ اپنی داہنی طرف دیکھے گا تو سوا جہنم کے اسے اور کچھ نظر نہ آئے گا پھر وہ بائیں طرف دیکھے گا تو ادھر بھی جہنم کے سوا اور کچھ نظر نہیں آئے گا۔ عدی رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے کہ جہنم سے ڈرو، اگرچہ کھجور کے ایک ٹکڑے کے ذریعہ ہو۔ اگر کسی کو کھجور کا ایک ٹکڑا بھی میسر نہ آ سکے تو ( کسی سے ) ایک اچھا کلمہ ہی کہہ دے۔ عدی رضی اللہ عنہ نے بیان کیا کہ میں نے ہودج میں بیٹھی ہوئی ایک اکیلی عورت کو تو خود دیکھ لیا کہ حیرہ سے سفر کے لیے نکلی اور ( مکہ پہنچ کر ) اس نے کعبہ کا طواف کیا اور اسے اللہ کے سوا اور کسی سے ( ڈاکو وغیرہ ) کا ( راستے میں ) خوف نہیں تھا اور مجاہدین کی اس جماعت میں تو میں خود شریک تھا جس نے کسریٰ بن ہرمز کے خزانے فتح کئے۔ اور اگر تم لوگ کچھ دنوں اور زندہ رہے تو وہ بھی دیکھ لو گے جو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص اپنے ہاتھ میں ( زکوٰۃ کا سونا چاندی ) بھر کر نکلے گا ( لیکن اسے لینے والا کوئی نہیں ملے گا ) مجھ سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابوعاصم نے بیان کیا، کہا ہم کو سعدان بن بشر نے خبر دی، ان سے ابومجاہد نے بیان کیا، ان سے محل بن خلیفہ نے بیان کیا، اور انہوں نے عدی رضی اللہ سنے سنا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا، پھر یہی حدیث نقل کی جو اوپر مذکور ہوئی۔",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 102
			}
		}
	]
}