{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3632,
			"arabicnumber": 3632,
			"text": "ہم سے احمد بن اسحٰق نے بیان کیا، کہا ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا، ان سے ابواسحٰق نے، ان سے عمرو بن میمون نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ سعد بن معاذ رضی اللہ عنہ عمرہ کی نیت سے ( مکہ ) آئے اور ابوصفوان امیہ بن خلف کے یہاں اترے۔ امیہ بھی شام جاتے ہوئے ( تجارت وغیرہ کے لیے ) جب مدینہ سے گزرتا تو سعد بن معاذ رضی اللہ عنہ کے یہاں قیام کیا کرتا تھا۔ امیہ نے سعد رضی اللہ عنہ سے کہا: ابھی ٹھہرو، جب دوپہر کا وقت ہو جائے اور لوگ غافل ہو جائیں ( تب طواف کرنا کیونکہ مکہ کے مشرک مسلمانوں کے دشمن تھے ) سعد رضی اللہ عنہ کہتے ہیں، چنانچہ میں نے جا کر طواف شروع کر دیا۔ سعد رضی اللہ عنہ ابھی طواف کر ہی رہے تھے کہ ابوجہل آ گیا اور کہنے لگا، یہ کعبہ کا طواف کون کر رہا ہے؟ سعد رضی اللہ عنہ بولے کہ میں سعد ہوں۔ ابوجہل بولا: تم کعبہ کا طواف خوب امن سے کر رہے ہو حالانکہ محمد صلی اللہ علیہ وسلم اور اس کے ساتھیوں کو پناہ دے رکھی ہے۔ سعد رضی اللہ عنہ نے کہا: ہاں ٹھیک ہے۔ اس طرح دونوں میں بات بڑھ گئی۔ پھر امیہ نے سعد رضی اللہ عنہ سے کہا: ابوالحکم ( ابوجہل ) کے سامنے اونچی آواز سے نہ بولو۔ وہ اس وادی ( مکہ ) کا سردار ہے۔ اس پر سعد رضی اللہ عنہ نے کہا: اللہ کی قسم اگر تم نے مجھے بیت اللہ کے طواف سے روکا تو میں بھی تمہاری شام کی تجارت خاک میں ملا دوں گا ( کیونکہ شام جانے کا صرف ایک ہی راستہ ہے جو مدینہ سے جاتا ہے ) بیان کیا کہ امیہ برابر سعد رضی اللہ عنہ سے یہی کہتا رہا کہ اپنی آواز بلند نہ کرو اور انہیں ( مقابلہ سے ) روکتا رہا۔ آخر سعد رضی اللہ عنہ کو اس پر غصہ آ گیا اور انہوں نے امیہ سے کہا۔ چل پرے ہٹ میں نے محمد صلی اللہ علیہ وسلم سے تیرے متعلق سنا ہے۔ آپ نے فرمایا تھا کہ تجھ کو ابوجہل ہی قتل کرائے گا۔ امیہ نے پوچھا: مجھے؟ سعد رضی اللہ عنہ کہا: ہاں تجھ کو۔ تب تو امیہ کہنے لگا۔ اللہ کی قسم محمد ( صلی اللہ علیہ وسلم ) جب کوئی بات کہتے ہیں تو وہ غلط نہیں ہوتی پھر وہ اپنی بیوی کے پاس آیا اور اس نے اس سے کہا تمہیں معلوم نہیں، میرے یثربی بھائی نے مجھے کیا بات بتائی ہے؟ اس نے پوچھا: انہوں نے کیا کہا؟ امیہ نے بتایا کہ محمد ( صلی اللہ علیہ وسلم ) کہہ چکے ہیں کہ ابوجہل مجھ کو قتل کرائے گا۔ وہ کہنے لگی۔ اللہ کی قسم محمد صلی اللہ علیہ وسلم غلط بات زبان سے نہیں نکالتے۔ پھر ایسا ہوا کہ اہل مکہ بدر کی لڑائی کے لیے روانہ ہونے لگے اور امیہ کو بھی بلانے والا آیا تو امیہ سے اس کی بیوی نے کہا، تمہیں یاد نہیں رہا تمہارا یثربی بھائی تمہیں کیا خبر دے گیا تھا۔ بیان کیا کہ اس یاددہانی پر امیہ نے چاہا کہ اس جنگ میں شرکت نہ کرے۔ لیکن ابوجہل نے کہا: تم وادی مکہ کے رئیس ہو۔ اس لیے کم از کم ایک یا دو دن کے لیے ہی تمہیں چلنا پڑے گا۔ اس طرح وہ ان کے ساتھ جنگ میں شرکت کے لیے نکلا اور اللہ تعالیٰ نے اس کو قتل کرا دیا۔",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 136
			}
		}
	]
}