{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "ہم سے ابوالحسن محمد بن مسکین نے بیان کیا، کہا ہم سے یحییٰ بن حسان نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، ان سے شریک بن ابی نمر نے، ان سے سعید بن مسیب نے بیان کیا، کہا مجھ کو ابوموسیٰ اشعری رضی اللہ عنہ نے خبر دی کہ انہوں نے ایک دن اپنے گھر میں وضو کیا اور اس ارادہ سے نکلے کہ آج دن بھر رسول اللہ صلی اللہ علیہ وسلم کا ساتھ نہ چھوڑوں گا۔ انہوں نے بیان کیا کہ پھر وہ مسجد نبوی میں حاضر ہوئے اور نبی کریم صلی اللہ علیہ وسلم کے متعلق پوچھا تو وہاں موجود لوگوں نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم تو تشریف لے جا چکے ہیں اور آپ اس طرف تشریف لے گئے ہیں۔ چنانچہ میں آپ کے متعلق پوچھتا ہوا آپ کے پیچھے پیچھے نکلا اور آخر میں نے دیکھا کہ آپ ( قباء کے قریب ) بئراریس میں داخل ہو رہے ہیں، میں دروازے پر بیٹھ گیا اور اس کا دروازہ کھجور کی شاخوں سے بنا ہوا تھا۔ جب آپ قضائے حاجت کر چکے اور آپ نے وضو بھی کر لیا تو میں آپ کے پاس گیا۔ میں نے دیکھا کہ آپ بئراریس ( اس باغ کے کنویں ) کی منڈیر پر بیٹھے ہوئے ہیں، اپنی پنڈلیاں آپ نے کھول رکھی ہیں اور کنویں میں پاؤں لٹکائے ہوئے ہیں۔ میں نے آپ کو سلام کیا اور پھر واپس آ کر باغ کے دروازے پر بیٹھ گیا۔ میں نے سوچا کہ آج رسول اللہ صلی اللہ علیہ وسلم کا دربان رہوں گا۔ پھر ابوبکر رضی اللہ عنہ آئے اور دروازہ کھولنا چاہا تو میں نے پوچھا کہ کون صاحب ہیں؟ انہوں نے کہا کہ ابوبکر! میں نے کہا تھوڑی دیر ٹھہر جائیے۔ پھر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا کہ ابوبکر دروازے پر موجود ہیں اور اندر آنے کی اجازت آپ سے چاہتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور جنت کی بشارت بھی۔ میں دروازہ پر آیا اور ابوبکر رضی اللہ عنہ سے میں نے کہا کہ اندر تشریف لے جائیے اور رسول اللہ صلی اللہ علیہ وسلم نے آپ کو جنت کی بشارت دی ہے۔ ابوبکر رضی اللہ عنہ اندر داخل ہوئے اور اسی کنویں کی منڈیر پر آپ صلی اللہ علیہ وسلم کی داہنی طرف بیٹھ گئے اور اپنے دونوں پاؤں کنویں میں لٹکا لیے۔ جس طرح آپ صلی اللہ علیہ وسلم نے لٹکائے ہوئے تھے اور اپنی پنڈلیوں کو بھی کھول لیا تھا۔ پھر میں واپس آ کر اپنی جگہ پر بیٹھ گیا۔ میں آتے وقت اپنے بھائی کو وضو کرتا ہوا چھوڑ آیا تھا۔ وہ میرے ساتھ آنے والے تھے۔ میں نے اپنے دل میں کہا، کاش اللہ تعالیٰ فلاں کو خبر دے دیتا۔ ان کی مراد اپنے بھائی سے تھی اور انہیں یہاں پہنچا دیتا۔ اتنے میں کسی صاحب نے دروازہ پر دستک دی میں نے پوچھا کون صاحب ہیں؟ کہا کہ عمر بن خطاب۔ میں نے کہا کہ تھوڑی دیر کے لیے ٹھہر جائیے، چنانچہ میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور سلام کے بعد عرض کیا کہ عمر بن خطاب رضی اللہ عنہ دروازے پر کھڑے ہیں اندر آنے کی اجازت چاہتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور جنت کی بشارت بھی پہنچا دو۔ میں واپس آیا اور کہا کہ اندر تشریف لے جائیے اور آپ کو رسول اللہ صلی اللہ علیہ وسلم نے جنت کی بشارت دی ہے۔ وہ بھی داخل ہوئے اور آپ کے ساتھ اسی منڈیر پر بائیں طرف بیٹھ گئے اور اپنے پاؤں کنویں میں لٹکا لیے۔ میں پھر دروازے پر آ کر بیٹھ گیا اور سوچتا رہا کہ اگر اللہ تعالیٰ فلاں ( ان کے بھائی ) کے ساتھ خیر چاہے گا تو اسے یہاں پہنچا دے گا، اتنے میں ایک اور صاحب آئے اور دروازے پر دستک دی، میں نے پوچھا کون صاحب ہیں؟ بولے کہ عثمان بن عفان، میں نے کہا تھوڑی دیر کے لیے رک جائیے، میں آپ کے پاس آیا اور میں نے آپ کو ان کی اطلاع دی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دے دو اور ایک مصیبت پر جو انہیں پہنچے گی جنت کی بشارت پہنچا دو۔ میں دروازے پر آیا اور میں نے ان سے کہا کہ اندر تشریف لے جائیے۔ نبی کریم صلی اللہ علیہ وسلم نے آپ کو جنت کی بشارت دی ہے، ایک مصیبت پر جو آپ کو پہنچے گی۔ وہ جب داخل ہوئے تو دیکھا چبوترہ پر جگہ نہیں ہے اس لیے وہ دوسری طرف آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گئے۔ شریک نے بیان کیا کہ سعید بن مسیب نے کہا میں نے اس سے ان کی قبروں کی تاویل لی ہے ( کہ اسی طرح بنیں گی ) ۔",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 24
			}
		}
	]
}