{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "موسیٰ نے بیان کیا، ان سے سالم بن عبداللہ نے بیان کیا اور مجھے یقین ہے کہ انہوں نے یہ ابن عمر رضی اللہ عنہما سے بیان کیا تھا کہ زید بن عمرو بن نفیل شام گئے دین ( خالص ) کی تلاش میں نکلے، وہاں وہ ایک یہودی عالم سے ملے تو انہوں نے ان کے دین کے بارے میں پوچھا اور کہا ممکن ہے کہ میں تمہارا دین اختیار کر لوں اس لیے تم مجھے اپنے دین کے متعلق بتاؤ یہودی عالم نے کہا کہ ہمارے دین میں تم اس وقت تک داخل نہیں ہو سکتے جب تک تم اللہ کے غضب کے ایک حصہ کے لیے تیار نہ ہو جاؤ، اس پر زید رضی اللہ عنہ نے کہا کہ واہ میں اللہ کے غضب ہی سے بھاگ کر آیا ہوں، پھر اللہ کے غضب کو میں اپنے اوپر کبھی نہ لوں گا اور نہ مجھ کو اسے اٹھانے کی طاقت ہے! کیا تم مجھے کسی اور دوسرے دین کا کچھ پتہ بتا سکتے ہو؟ اس عالم نے کہا میں نہیں جانتا ( کوئی دین سچا ہو تو دین حنیف ہو ) ۔ زید رضی اللہ عنہ نے پوچھا دین حنیف کیا ہے؟ اس عالم نے کہا کہ ابراہیم علیہ السلام کا دین جو نہ یہودی تھے اور نہ نصرانی اور وہ اللہ کے سوا کسی کی عبادت نہیں کرتے تھے۔ زید رضی اللہ عنہ وہاں سے چلے آئے اور ایک نصرانی پادری سے ملے، ان سے بھی اپنا خیال بیان کیا اس نے بھی یہی کہا کہ تم ہمارے دین میں آؤ گے تو اللہ تعالیٰ کی لعنت میں سے ایک حصہ لو گے۔ زید رضی اللہ عنہ نے کہا میں اللہ کی لعنت سے ہی بچنے کے لیے تو یہ سب کچھ کر رہا ہوں اللہ کی لعنت اٹھانے کی مجھ میں طاقت نہیں اور نہ میں اس کا یہ غضب کس طرح اٹھا سکتا ہوں! کیا تم میرے لیے اس کے سوا کوئی اور دین بتلا سکتے ہو؟ پادری نے کہا کہ میری نظر میں ہو تو صرف ایک دین حنیف سچا دین ہے زید نے پوچھا دین حنیف کیا ہے؟ کہا کہ وہ دین ابراہیم ہے جو نہ یہودی تھے اور نہ نصرانی اور اللہ کے سوا وہ کسی کی پوجا نہیں کرتے تھے۔ زید نے جب دین ابراہیم کے بارے میں ان کی یہ رائے سنی تو وہاں سے روانہ ہو گئے اور اس سر زمین سے باہر نکل کر اپنے دونوں ہاتھ آسمان کی طرف اٹھائے اور یہ دعا کی «اللهم إني أشهد أني على دين إبراهيم‏.‏» اے اللہ! میں گواہی دیتا ہوں کہ میں دین ابراہیم پر ہوں۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 52
			}
		}
	]
}