{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا ہم سے قطن ابوالہیثم نے کہا، ہم سے ابویزید مدنی نے، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا جاہلیت میں سب سے پہلا قسامہ ہمارے ہی قبیلہ بنو ہاشم میں ہوا تھا، بنو ہاشم کے ایک شخص عمرو بن علقمہ کو قریش کے کسی دوسرے خاندان کے ایک شخص ( خداش بن عبداللہ عامری ) نے نوکری پر رکھا، اب یہ ہاشمی نوکر اپنے صاحب کے ساتھ اس کے اونٹ لے کر شام کی طرف چلا وہاں کہیں اس نوکر کے پاس سے ایک دوسرا ہاشمی شخص گزرا، اس کی بوری کا بندھن ٹوٹ گیا تھا۔ اس نے اپنے نوکر بھائی سے التجا کی میری مدد کر اونٹ باندھنے کی مجھے ایک رسی دیدے، میں اس سے اپنا تھیلا باندھوں اگر رسی نہ ہو گی تو وہ بھاگ تھوڑے جائے گا۔ اس نے ایک رسی اسے دے دی اور اس نے اپنی بوری کا منہ اس سے باندھ لیا ( اور چلا گیا ) ۔ پھر جب اس نوکر اور صاحب نے ایک منزل پر پڑاؤ کیا تو تمام اونٹ باندھے گئے لیکن ایک اونٹ کھلا رہا۔ جس صاحب نے ہاشمی کو نوکری پر اپنے ساتھ رکھا تھا اس نے پوچھا سب اونٹ تو باندھے، یہ اونٹ کیوں نہیں باندھا گیا کیا بات ہے؟ نوکر نے کہا اس کی رسی موجود نہیں ہے۔ صاحب نے پوچھا کیا ہوا اس کی رسی؟ اور غصہ میں آ کر ایک لکڑی اس پر پھینک ماری اس کی موت آن پہنچی۔ اس کے ( مرنے سے پہلے ) وہاں سے ایک یمنی شخص گزر رہا تھا۔ ہاشمی نوکر نے پوچھا کیا حج کے لیے ہر سال تم مکہ جاتے ہو؟ اس نے کہا ابھی تو ارادہ نہیں ہے لیکن میں کبھی جاتا رہتا ہوں۔ اس نوکر نے کہا جب بھی تم مکہ پہنچو کیا میرا ایک پیغام پہنچا دو گے؟ اس نے کہا ہاں پہنچا دوں گا۔ اس نوکر نے کہا کہ جب بھی تم حج کے لیے جاؤ تو پکارنا: اے قریش کے لوگو! جب وہ تمہارے پاس جمع ہو جائیں تو پکارنا: اے بنی ہاشم! جب وہ تمہارے پاس آ جائیں تو ان سے ابوطالب پوچھنا اور انہیں بتلانا کہ فلاں شخص نے مجھے ایک رسی کے لیے قتل کر دیا۔ اس وصیت کے بعد وہ نوکر مر گیا، پھر جب اس کا صاحب مکہ آیا تو ابوطالب کے یہاں بھی گیا۔ جناب ابوطالب نے دریافت کیا ہمارے قبیلہ کے جس شخص کو تم اپنے ساتھ نوکری کے لیے لے گئے تھے اس کا کیا ہوا؟ اس نے کہا کہ وہ بیمار ہو گیا تھا میں نے خدمت کرنے میں کوئی کسر نہیں اٹھا رکھی ( لیکن وہ مر گیا تو ) میں نے اسے دفن کر دیا۔ ابوطالب نے کہا کہ اس کے لیے تمہاری طرف سے یہی ہونا چاہئے تھا۔ ایک مدت کے بعد وہی یمنی شخص جسے ہاشمی نوکر نے پیغام پہنچانے کی وصیت کی تھی، موسم حج میں آیا اور آواز دی: اے قریش کے لوگو! لوگوں نے بتا دیا کہ یہاں ہیں قریش اس نے آواز دی، اے بنو ہاشم! لوگوں نے بتایا کہ بنو ہاشم یہ ہیں اس نے پوچھا ابوطالب کہاں ہیں؟ لوگوں نے بتایا تو اس نے کہا کہ فلاں شخص نے مجھے ایک پیغام پہنچانے کے لیے کہا تھا کہ فلاں شخص نے اسے ایک رسی کی وجہ سے قتل کر دیا ہے۔ اب جناب ابوطالب اس صاحب کے یہاں آئے اور کہا کہ ان تین چیزوں میں سے کوئی چیز پسند کر لو اگر تم چاہو تو سو اونٹ دیت میں دے دو کیونکہ تم نے ہمارے قبیلہ کے آدمی کو قتل کیا ہے اور اگر چاہو تو تمہاری قوم کے پچاس آدمی اس کی قسم کھا لیں کہ تم نے اسے قتل نہیں کیا۔ اگر تم اس پر تیار نہیں تو ہم تمہیں اس کے بدلے میں قتل کر دیں گے۔ وہ شخص اپنی قوم کے پاس آیا تو وہ اس کے لیے تیار ہو گئے کہ ہم قسم کھا لیں گے۔ پھر بنو ہاشم کی ایک عورت ابوطالب کے پاس آئی جو اسی قبیلہ کے ایک شخص سے بیاہی ہوئی تھی اور اپنے اس شوہر سے اس کا بچہ بھی تھا۔ اس نے کہا: اے ابوطالب! آپ مہربانی کریں اور میرے اس لڑکے کو ان پچاس آدمیوں میں معاف کر دیں اور جہاں قسمیں لی جاتی ہیں ( یعنی رکن اور مقام ابراہیم کے درمیان ) اس سے وہاں قسم نہ لیں۔ ابوطالب نے اسے معاف کر دیا۔ اس کے بعد ان میں کا ایک اور شخص آیا اور کہا: اے ابوطالب! آپ نے سو اونٹوں کی جگہ پچاس آدمیوں سے قسم طلب کی ہے، اس طرح ہر شخص پر دو دو اونٹ پڑتے ہیں۔ یہ دو اونٹ میری طرف سے آپ قبول کر لیں اور مجھے اس مقام پر قسم کھانے کے لیے مجبور نہ کریں جہاں قسم لی جاتی ہے۔ ابوطالب نے اسے بھی منظور کر لیا۔ اس کے بعد بقیہ جو اڑتالیس آدمی آئے اور انہوں نے قسم کھائی۔ ابن عباس رضی اللہ عنہما نے کہا: اس ذات کی قسم! جس کے ہاتھ میں میری جان ہے ابھی اس واقعہ کو پورا سال بھی نہیں گزرا تھا کہ ان اڑتالیس آدمیوں میں سے ایک بھی ایسا نہیں رہا جو آنکھ ہلاتا۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		}
	]
}