{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن محمد بن زید نے بیان کیا، ان سے سالم نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ جب بھی عمر رضی اللہ عنہ نے کسی چیز کے متعلق کہا کہ میرا خیال ہے کہ یہ اس طرح ہے تو وہ اسی طرح ہوئی جیسا وہ اس کے متعلق اپنا خیال ظاہر کرتے تھے۔ ایک دن وہ بیٹھے ہوئے تھے کہ ایک خوبصورت شخص وہاں سے گزرا۔ انہوں نے کہا یا تو میرا گمان غلط ہے یا یہ شخص اپنے جاہلیت کے دین پر اب بھی قائم ہے یا یہ زمانہ جاہلیت میں اپنی قوم کا کاہن رہا ہے۔ اس شخص کو میرے پاس بلاؤ۔ وہ شخص بلایا گیا تو عمر رضی اللہ عنہ نے اس کے سامنے بھی یہی بات دہرائی۔ اس پر اس نے کہا میں نے تو آج کے دن کا سا معاملہ کبھی نہیں دیکھا جو کسی مسلمان کو پیش آیا ہو۔ عمر رضی اللہ عنہ نے کہا لیکن میں تمہارے لیے ضروری قرار دیتا ہوں کہ تم مجھے اس سلسلے میں بتاؤ۔ اس نے اقرار کیا کہ زمانہ جاہلیت میں، میں اپنی قوم کا کاہن تھا۔ عمر رضی اللہ عنہ نے کہا غیب کی جو خبریں تمہاری جنیہ تمہارے پاس لاتی تھی، اس کی سب سے حیرت انگیز کوئی بات سناؤ؟ شخص مذکور نے کہا کہ ایک دن میں بازار میں تھا کہ جنیہ میرے پاس آئی۔ میں نے دیکھا کہ وہ گھبرائی ہوئی ہے، پھر اس نے کہا جنوں کے متعلق تمہیں معلوم نہیں۔ جب سے انہیں آسمانی خبروں سے روک دیا گیا ہے وہ کس درجہ ڈرے ہوئے ہیں، مایوس ہو رہے ہیں اور اونٹنیوں کے پالان کی کملیوں سے مل گئے ہیں۔ عمر رضی اللہ عنہ نے کہا کہ تم نے سچ کہا۔ ایک مرتبہ میں بھی ان دنوں بتوں کے قریب سویا ہوا تھا۔ ایک شخص ایک بچھڑا لایا اور اس نے بت پر اسے ذبح کر دیا اس کے اندر سے اس قدر زور کی آواز نکلی کہ میں نے ایسی شدید چیخ کبھی نہیں سنی تھی۔ اس نے کہا: اے دشمن! ایک بات بتلاتا ہوں جس سے مراد مل جائے ایک فصیح خوش بیان شخص یوں کہتا ہے لا الہٰ الا اللہ یہ سنتے ہی تمام لوگ ( جو وہاں موجود تھے ) چونک پڑے ( چل دئیے ) میں نے کہا میں تو نہیں جانے کا، دیکھو اس کے بعد کیا ہوتا ہے۔ پھر یہی آواز آئی ارے دشمن تجھ کو ایک بات بتلاتا ہوں جس سے مراد بر آئے ایک فصیح شخص یوں کہہ رہا ہے لا الہٰ الا اللہ۔ اس وقت میں کھڑا ہوا اور ابھی کچھ دیر نہیں گزری تھی کہ لوگ کہنے لگے یہ ( محمد صلی اللہ علیہ وسلم ) اللہ کے سچے رسول ہیں۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		}
	]
}