{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "ابن شہاب نے بیان کیا اور مجھے عبدالرحمٰن بن مالک مدلجی نے خبر دی، وہ سراقہ بن مالک بن جعشم کے بھتیجے ہیں کہ ان کے والد نے انہیں خبر دی اور انہوں نے سراقہ بن جعشم رضی اللہ عنہ کو یہ کہتے سنا کہ ہمارے پاس کفار قریش کے قاصد آئے اور یہ پیش کش کی کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کو اگر کوئی شخص قتل کر دے یا قید کر لائے تو اسے ہر ایک کے بدلے میں ایک سو اونٹ دیئے جائیں گے۔ میں اپنی قوم بنی مدلج کی ایک مجلس میں بیٹھا ہوا تھا کہ ان کا ایک آدمی سامنے آیا اور ہمارے قریب کھڑا ہو گیا۔ ہم ابھی بیٹھے ہوئے تھے۔ اس نے کہا سراقہ! ساحل پر میں ابھی چند سائے دیکھ کر آ رہا ہوں میرا خیال ہے کہ وہ محمد اور ان کے ساتھی ہی ہیں ( صلی اللہ علیہ وسلم ) ۔ سراقہ رضی اللہ عنہ نے کہا میں سمجھ گیا اس کا خیال صحیح ہے لیکن میں نے اس سے کہا کہ وہ لوگ نہیں ہیں میں نے فلاں فلاں آدمی کو دیکھا ہے ہمارے سامنے سے اسی طرف گئے ہیں۔ اس کے بعد میں مجلس میں تھوڑی دیر اور بیٹھا رہا اور پھر اٹھتے ہی گھر گیا اور لونڈی سے کہا کہ میرے گھوڑے کو لے کر ٹیلے کے پیچھے چلی جائے اور وہیں میرا انتظار کرے، اس کے بعد میں نے اپنا نیزہ اٹھایا اور گھر کی پشت کی طرف سے باہر نکل آیا میں نیزے کی نوک سے زمین پر لکیر کھینچتا ہوا چلا گیا اور اوپر کے حصے کو چھپائے ہوئے تھا۔ ( سراقہ یہ سب کچھ اس لیے کر رہا تھا کہ کسی کو خبر نہ ہو ورنہ وہ بھی میرے انعام میں شریک ہو جائے گا ) میں گھوڑے کے پاس آ کر اس پر سوار ہوا اور صبا رفتاری کے ساتھ اسے لے چلا، جتنی جلدی کے ساتھ بھی میرے لیے ممکن تھا، آخر میں نے ان کو پا ہی لیا۔ اسی وقت گھوڑے نے ٹھوکر کھائی اور مجھے زمین پر گرا دیا۔ لیکن میں کھڑا ہو گیا اور اپنا ہاتھ ترکش کی طرف بڑھایا اس میں سے تیر نکال کر میں نے فال نکالی کہ آیا میں انہیں نقصان پہنچا سکتا ہوں یا نہیں۔ فال ( اب بھی ) وہ نکلی جسے میں پسند نہیں کرتا تھا۔ لیکن میں دوبارہ اپنے گھوڑے پر سوار ہو گیا اور تیروں کے فال کی پرواہ نہیں کی۔ پھر میرا گھوڑا مجھے تیزی کے ساتھ دوڑائے لیے جا رہا تھا۔ آخر جب میں نے رسول اللہ صلی اللہ علیہ وسلم کی قرآت سنی، نبی کریم صلی اللہ علیہ وسلم میری طرف کوئی توجہ نہیں کر رہے تھے لیکن ابوبکر رضی اللہ عنہ باربار مڑ کر دیکھتے تھے، تو میرے گھوڑے کے آگے کے دونوں پاؤں زمین میں دھنس گئے جب وہ ٹخنوں تک دھنس گیا تو میں اس کے اوپر گر پڑا اور اسے اٹھنے کے لیے ڈانٹا میں نے اسے اٹھانے کی کوشش کی لیکن وہ اپنے پاؤں زمین سے نہیں نکال سکا۔ بڑی مشکل سے جب اس نے پوری طرح کھڑے ہونے کی کوشش کی تو اس کے آگے کے پاؤں سے منتشر سا غبار اٹھ کر دھوئیں کی طرح آسمان کی طرف چڑھنے لگا۔ میں نے تیروں سے فال نکالی لیکن اس مرتبہ بھی وہی فال آئی جسے میں پسند نہیں کرتا تھا۔ اس وقت میں نے نبی کریم صلی اللہ علیہ وسلم کو امان کے لیے پکارا۔ میری آواز پر وہ لوگ کھڑے ہو گئے اور میں اپنے گھوڑے پر سوار ہو کر ان کے پاس آیا۔ ان تک برے ارادے کے ساتھ پہنچنے سے جس طرح مجھے روک دیا گیا تھا۔ اسی سے مجھے یقین ہو گیا تھا کہ رسول اللہ صلی اللہ علیہ وسلم کی دعوت غالب آ کر رہے گی۔ اس لیے میں نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ آپ کی قوم نے آپ کے مارنے کے لیے سو اونٹوں کے انعام کا اعلان کیا ہے۔ پھر میں نے آپ کو قریش کے ارادوں کی اطلاع دی۔ میں نے ان حضرات کی خدمت میں کچھ توشہ اور سامان پیش کیا لیکن آپ صلی اللہ علیہ وسلم نے اسے قبول نہیں فرمایا مجھ سے کسی اور چیز کا بھی مطالبہ نہیں کیا صرف اتنا کہا کہ ہمارے متعلق راز داری سے کام لینا لیکن میں نے عرض کیا کہ آپ میرے لیے ایک امن کی تحریر لکھ دیجئیے۔ آپ صلی اللہ علیہ وسلم نے عامر بن فہیرہ رضی اللہ عنہ کو حکم دیا اور انہوں نے چمڑے کے ایک رقعہ پر تحریر امن لکھ دی۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم آگے بڑھے۔ ابن شہاب نے بیان کیا اور انہیں عروہ بن زبیر نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کی ملاقات زبیر رضی اللہ عنہ سے ہوئی جو مسلمانوں کے ایک تجارتی قافلہ کے ساتھ شام سے واپس آ رہے تھے۔ زبیر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کی خدمت میں سفید پوشاک پیش کی۔ ادھر مدینہ میں بھی مسلمانوں کو نبی کریم صلی اللہ علیہ وسلم کی مکہ سے ہجرت کی اطلاع ہو چکی تھی اور یہ لوگ روزانہ صبح کو مقام حرہ تک آتے اور انتظار کرتے رہتے لیکن دوپہر کی گرمی کی وجہ سے ( دوپہر کو ) انہیں واپس جانا پڑتا تھا۔ ایک دن جب بہت طویل انتظار کے بعد سب لوگ آ گئے اور اپنے گھر پہنچ گئے تو ایک یہودی اپنے ایک محل پر کچھ دیکھنے چڑھا۔ اس نے نبی کریم صلی اللہ علیہ وسلم اور آپ کے ساتھیوں کو دیکھا سفید سفید چلے آ رہے ہیں۔ ( یا تیزی سے جلدی جلدی آ رہے ہیں ) جتنا آپ نزدیک ہو رہے تھے اتنی ہی دور سے پانی کی طرح ریتی کا چمکنا کم ہوتا جاتا۔ یہودی بے اختیار چلا اٹھا کہ اے عرب کے لوگو! تمہارے یہ بزرگ سردار آ گئے جن کا تمہیں انتظار تھا۔ مسلمان ہتھیار لے کر دوڑ پڑے اور نبی کریم صلی اللہ علیہ وسلم کا مقام حرہ پر استقبال کیا۔ آپ نے ان کے ساتھ داہنی طرف کا راستہ اختیار کیا اور بنی عمرو بن عوف کے محلہ میں قیام کیا۔ یہ ربیع الاول کا مہینہ اور پیر کا دن تھا۔ ابوبکر رضی اللہ عنہ لوگوں سے ملنے کے لیے کھڑے ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم خاموش بیٹھے رہے۔ انصار کے جن لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو اس سے پہلے نہیں دیکھا تھا، وہ ابوبکر رضی اللہ عنہ ہی کو سلام کر رہے تھے۔ لیکن جب نبی کریم صلی اللہ علیہ وسلم پر دھوپ پڑنے لگی تو ابوبکر رضی اللہ عنہ نے اپنی چادر سے نبی کریم صلی اللہ علیہ وسلم پر سایہ کیا۔ اس وقت سب لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو پہچان لیا۔ آپ صلی اللہ علیہ وسلم نے بنی عمرو بن عوف میں تقریباً دس راتوں تک قیام کیا اور وہ مسجد ( قباء ) جس کی بنیاد تقویٰ پر قائم ہے وہ اسی دوران میں تعمیر ہوئی اور آپ نے اس میں نماز پڑھی پھر ( جمعہ کے دن ) نبی کریم صلی اللہ علیہ وسلم اپنی اونٹنی پر سوار ہوئے اور صحابہ بھی آپ کے ساتھ پیدل روانہ ہوئے۔ آخر آپ کی سواری مدینہ منورہ میں اس مقام پر آ کر بیٹھ گئی جہاں اب مسجد نبوی ہے۔ اس مقام پر چند مسلمان ان دنوں نماز ادا کیا کرتے تھے۔ یہ جگہ سہیل اور سہل ( رضی اللہ عنہما ) دو یتیم بچوں کی تھی اور کھجور کا یہاں کھلیان لگتا تھا۔ یہ دونوں بچے اسعد بن زرارہ رضی اللہ عنہ کی پرورش میں تھے جب آپ کی اونٹنی وہاں بیٹھ گئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ان شاءاللہ یہی ہمارے قیام کی جگہ ہو گی۔ اس کے بعد آپ نے دونوں یتیم بچوں کو بلایا اور ان سے اس جگہ کا معاملہ کرنا چاہا تاکہ وہاں مسجد تعمیر کی جا سکے۔ دونوں بچوں نے کہا کہ نہیں یا رسول اللہ! ہم یہ جگہ آپ کو مفت دے دیں گے، لیکن نبی کریم صلی اللہ علیہ وسلم نے مفت طور پر قبول کرنے سے انکار کیا۔ زمین کی قیمت ادا کر کے لے لی اور وہیں مسجد تعمیر کی۔ اس کی تعمیر کے وقت خود آپ صلی اللہ علیہ وسلم بھی صحابہ رضی اللہ عنہم کے ساتھ اینٹوں کے ڈھونے میں شریک تھے۔ اینٹ ڈھوتے وقت آپ فرماتے جاتے تھے کہ ”یہ بوجھ خیبر کے بوجھ نہیں ہیں بلکہ اس کا اجر و ثواب اللہ کے یہاں باقی رہنے والا ہے اس میں بہت طہارت اور پاکی ہے“ اور نبی کریم صلی اللہ علیہ وسلم دعا فرماتے تھے کہ ”اے اللہ! اجر تو بس آخرت ہی کا ہے پس، تو انصار اور مہاجرین پر اپنی رحمت نازل فرما۔“ اس طرح آپ نے ایک مسلمان شاعر کا شعر پڑھا جن کا نام مجھے معلوم نہیں، ابن شہاب نے بیان کیا کہ احادیث سے ہمیں یہ اب تک معلوم نہیں ہوا کہ نبی کریم صلی اللہ علیہ وسلم نے اس شعر کے سوا کسی بھی شاعر کے پورے شعر کو کسی موقعہ پر پڑھا ہو۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		}
	]
}