{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا، کہا مجھ سے میرے باپ عبدالوارث نے بیان کیا، ان سے عبدالعزیز بن صہیب نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو ابوبکر صدیق رضی اللہ عنہ آپ کی سواری پر پیچھے بیٹھے ہوئے تھے۔ ابوبکر رضی اللہ عنہ بوڑھے ہو گئے تھے اور ان کو لوگ پہچانتے بھی تھے لیکن نبی کریم صلی اللہ علیہ وسلم ابھی جوان معلوم ہوتے تھے اور آپ کو لوگ عام طور سے پہچانتے بھی نہ تھے۔ بیان کیا کہ اگر راستہ میں کوئی ملتا اور پوچھتا کہ اے ابوبکر! یہ تمہارے ساتھ کون صاحب ہیں؟ تو آپ جواب دیتے کہ یہ میرے ہادی ہیں، مجھے راستہ بتاتے ہیں پوچھنے والا یہ سمجھتا کہ مدینہ کا راستہ بتلانے والا ہے اور ابوبکر رضی اللہ عنہ کا مطلب اس کلام سے یہ تھا کہ آپ دین و ایمان کا راستہ بتلاتے ہیں۔ ایک مرتبہ ابوبکر رضی اللہ عنہ پیچھے مڑے تو ایک سوار نظر آیا جو ان کے قریب آ چکا تھا۔ انہوں نے کہا: یا رسول اللہ! یہ سوار آ گیا اور اب ہمارے قریب ہی پہنچنے والا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے بھی اسے مڑ کر دیکھا اور دعا فرمائی کہ اے اللہ! اسے گرا دے چنانچہ گھوڑی نے اسے گرا دیا۔ پھر جب وہ ہنہناتی ہوئی اٹھی تو سوار ( سراقہ ) نے کہا: اے اللہ کے نبی! آپ جو چاہیں مجھے حکم دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اپنی جگہ کھڑا رہ اور دیکھ کسی کو ہماری طرف نہ آنے دینا۔ راوی نے بیان کیا کہ وہی شخص جو صبح آپ کے خلاف تھا شام جب ہوئی تو آپ کا وہ ہتھیار تھا دشمن کو آپ سے روکنے لگا۔ اس کے بعد آپ صلی اللہ علیہ وسلم ( مدینہ پہنچ کر ) حرہ کے قریب اترے اور انصار کو بلا بھیجا۔ اکابر انصار آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور دونوں کو سلام کیا اور عرض کیا آپ سوار ہو جائیں آپ کی حفاظت اور فرمانبرداری کی جائے گی، چنانچہ آپ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ سوار ہو گئے اور ہتھیار بند انصار نے آپ دونوں کو حلقہ میں لے لیا۔ اتنے میں مدینہ میں بھی سب کو معلوم ہو گیا کہ نبی کریم صلی اللہ علیہ وسلم تشریف لا چکے ہیں سب لوگ آپ کو دیکھنے کے لیے بلندی پر چڑھ گئے اور کہنے لگے کہ اللہ کے نبی آ گئے۔ اللہ کے نبی آ گئے۔ نبی کریم صلی اللہ علیہ وسلم مدینہ کی طرف چلتے رہے اور ( مدینہ پہنچ کر ) ابوایوب رضی اللہ عنہ کے گھر کے پاس سواری سے اتر گئے۔ عبداللہ بن سلام رضی اللہ عنہ ( ایک یہودی عالم نے ) اپنے گھر والوں سے آپ صلی اللہ علیہ وسلم کا ذکر سنا، وہ اس وقت اپنے ایک کھجور کے باغ میں تھے اور کھجور جمع کر رہے تھے انہوں نے ( سنتے ہی ) بڑی جلدی کے ساتھ جو کچھ کھجور جمع کر چکے تھے اسے رکھ دینا چاہا جب آپ کی خدمت میں وہ حاضر ہوئے تو جمع شدہ کھجوریں ان کے ساتھ ہی تھیں۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم کی باتیں سنیں اور اپنے گھر واپس چلے آئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہمارے ( نانہالی ) اقارب میں کس کا گھر یہاں سے زیادہ قریب ہے؟ ابوایوب رضی اللہ عنہ نے عرض کیا کہ میرا اے اللہ کے نبی! یہ میرا گھر ہے اور یہ اس کا دروازہ ہے فرمایا ( اچھا تو جاؤ ) دوپہر کو آرام کرنے کی جگہ ہمارے لیے درست کرو ہم دوپہر کو وہیں آرام کریں گے۔ ابوایوب رضی اللہ عنہ نے عرض کیا پھر آپ دونوں تشریف لے چلیں، اللہ مبارک کرے۔ آپ صلی اللہ علیہ وسلم ابھی ان کے گھر میں داخل ہوئے تھے کہ عبداللہ بن سلام بھی آ گئے اور کہا کہ ”میں گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں اور یہ کہ آپ حق کے ساتھ مبعوث ہوئے ہیں، اور یہودی میرے متعلق اچھی طرح جانتے ہیں کہ میں ان کا سردار ہوں اور ان کے سردار کا بیٹا ہوں اور ان میں سب سے زیادہ جاننے والا ہوں اور ان کے سب سے بڑے عالم کا بیٹا ہوں، اس لیے آپ اس سے پہلے کہ میرے اسلام لانے کا خیال انہیں معلوم ہو، بلایئے اور ان سے میرے بارے میں دریافت فرمایئے، کیونکہ انہیں اگر معلوم ہو گیا کہ میں اسلام لا چکا ہوں تو میرے متعلق غلط باتیں کہنی شروع کر دیں گے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے انہیں بلا بھیجا اور جب وہ آپ کی خدمت حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اے یہودیو! افسوس تم پر، اللہ سے ڈرو، اس ذات کی قسم! جس کے سوا کوئی معبود نہیں، تم لوگ خوب جانتے ہو کہ میں اللہ کا رسول برحق ہوں اور یہ بھی کہ میں تمہارے پاس حق لے کر آیا ہوں، پھر اب اسلام میں داخل ہو جاؤ، انہوں نے کہا کہ ہمیں معلوم نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس طرح تین مرتبہ کہا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا۔ اچھا عبداللہ بن سلام تم میں کون صاحب ہیں؟ انہوں نے کہا ہمارے سردار اور ہمارے سردار کے بیٹے، ہم میں سب سے زیادہ جاننے والے اور ہمارے سب سے بڑے عالم کے بیٹے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہ اسلام لے آئیں۔ پھر تمہارا کیا خیال ہو گا۔ کہنے لگے اللہ ان کی حفاظت کرے، وہ اسلام کیوں لانے لگے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ابن سلام! اب ان کے سامنے آ جاؤ۔ عبداللہ بن سلام رضی اللہ عنہ باہر آ گئے اور کہا: اے یہود! اللہ سے ڈرو، اس اللہ کی قسم! جس کے سوا کوئی معبود نہیں تمہیں خوب معلوم ہے کہ آپ اللہ کے رسول ہیں اور یہ کہ آپ حق کے ساتھ مبعوث ہوئے ہیں۔ یہودیوں نے کہا تم جھوٹے ہو۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان سے باہر چلے جانے کے لیے فرمایا۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		}
	]
}