{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "ہم سے احمد بن عثمان نے بیان کیا، کہا کہ ان سے شریح بن مسلمہ نے بیان کیا، ان سے ابراہیم بن یوسف نے، ان سے ان کے والد یوسف بن اسحاق نے، ان سے ابواسحاق سبیعی نے بیان کیا کہ میں نے براء بن عازب رضی اللہ عنہما سے حدیث سنی وہ بیان کرتے تھے کہ ابوبکر رضی اللہ عنہ نے عازب رضی اللہ عنہ سے ایک پالان خریدا اور میں ان کے ساتھ اٹھا کر پہنچانے لایا تھا۔ انہوں نے بیان کیا کہ ابوبکر رضی اللہ عنہ سے عازب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے سفر ہجرت کا حال پوچھا تو انہوں نے بیان کیا کہ چونکہ ہماری نگرانی ہو رہی تھی ( یعنی کفار ہماری تاک میں تھے ) اس لیے ہم ( غار سے ) رات کے وقت باہر آئے اور پوری رات اور دن بھر بہت تیزی کے ساتھ چلتے رہے، جب دوپہر ہوئی تو ہمیں ایک چٹان دکھائی دی۔ ہم اس کے قریب پہنچے تو اس کی آڑ میں تھوڑا سا سایہ بھی موجود تھا۔ ابوبکر رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے ایک چمڑا بچھا دیا جو میرے ساتھ تھا۔ آپ اس پر لیٹ گئے، اور میں قرب و جوار کی گرد جھاڑنے لگا۔ اتفاق سے ایک چرواہا نظر پڑا جو اپنی بکریوں کے تھوڑے سے ریوڑ کے ساتھ اسی چٹان کی طرف آ رہا تھا اس کا مقصد اس چٹان سے وہی تھا جس کے لیے ہم یہاں آئے تھے ( یعنی سایہ حاصل کرنا ) میں نے اس سے پوچھا لڑکے تو کس کا غلام ہے؟ اس نے بتایا کہ فلاں کا ہوں۔ میں نے اس سے پوچھا کیا تم اپنی بکریوں سے کچھ دودھ نکال سکتے ہو اس نے کہا کہ ہاں پھر وہ اپنے ریوڑ سے ایک بکری لایا تو میں نے اس سے کہا کہ پہلے اس کا تھن جھاڑ لو۔ انہوں نے بیان کیا کہ پھر اس نے کچھ دودھ دوہا۔ میرے ساتھ پانی کا ایک چھاگل تھا۔ اس کے منہ پر کپڑا بندھا ہوا تھا۔ یہ پانی میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے ساتھ لے رکھا تھا۔ وہ پانی میں نے اس دودھ پر اتنا ڈالا کہ وہ نیچے تک ٹھنڈا ہو گیا تو میں اسے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوا اور عرض کیا دودھ نوش فرمایئے یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے اسے نوش فرمایا جس سے مجھے بہت خوشی حاصل ہوئی۔ اس کے بعد ہم نے پھر کوچ شروع کیا اور ڈھونڈنے والے لوگ ہماری تلاش میں تھے۔",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 142
			}
		}
	]
}