{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "ہم سے یوسف بن موسیٰ نے بیان کیا، کہا ہم سے عبیداللہ بن موسیٰ نے بیان کیا، ان سے اسرائیل نے، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ابورافع یہودی ( کے قتل ) کے لیے چند انصاری صحابہ کو بھیجا اور عبداللہ بن عتیک رضی اللہ عنہ کو ان کا امیر بنایا۔ یہ ابورافع نبی کریم صلی اللہ علیہ وسلم کو ایذا دیا کرتا تھا اور آپ کے دشمنوں کی مدد کیا کرتا تھا۔ حجاز میں اس کا ایک قلعہ تھا اور وہیں وہ رہا کرتا تھا۔ جب اس کے قلعہ کے قریب یہ پہنچے تو سورج غروب ہو چکا تھا۔ اور لوگ اپنے مویشی لے کر ( اپنے گھروں کو ) واپس ہو چکے تھے۔ عبداللہ بن عتیک رضی اللہ عنہ نے اپنے ساتھیوں سے کہا کہ تم لوگ یہیں ٹھہرے رہو میں ( اس قلعہ پر ) جا رہا ہوں اور دربان پر کوئی تدبیر کروں گا۔ تاکہ میں اندر جانے میں کامیاب ہو جاؤں۔ چنانچہ وہ ( قلعہ کے پاس ) آئے اور دروازے کے قریب پہنچ کر انہوں نے خود کو اپنے کپڑوں میں اس طرح چھپا لیا جیسے کوئی قضائے حاجت کر رہا ہو۔ قلعہ کے تمام آدمی اندر داخل ہو چکے تھے۔ دربان نے آواز دی، اے اللہ کے بندے! اگر اندر آنا ہے تو جلد آ جا، میں اب دروازہ بند کر دوں گا۔ ( عبداللہ بن عتیک رضی اللہ عنہ نے کہا ) چنانچہ میں بھی اندر چلا گیا اور چھپ کر اس کی کارروائی دیکھنے لگا۔ جب سب لوگ اندر آ گئے تو اس نے دروازہ بند کیا اور کنجیوں کا گچھا ایک کھونٹی پر لٹکا دیا۔ انہوں نے بیان کیا کہ اب میں ان کنجیوں کی طرف بڑھا اور میں نے انہیں لے لیا، پھر میں نے قلعہ کا دروازہ کھول لیا۔ ابورافع کے پاس رات کے وقت داستانیں بیان کی جا رہی تھیں اور وہ اپنے خاص بالاخانے میں تھا۔ جب داستان گو اس کے یہاں سے اٹھ کر چلے گئے تو میں اس کمرے کی طرف چڑھنے لگا۔ اس عرصہ میں، میں جتنے دروازے اس تک پہنچنے کے لیے کھولتا تھا انہیں اندر سے بند کرتا جاتا تھا۔ میرا مطلب یہ تھا کہ اگر قلعہ والوں کو میرے متعلق علم بھی ہو جائے تو اس وقت تک یہ لوگ میرے پاس نہ پہنچ سکیں جب تک میں اسے قتل نہ کر لوں۔ آخر میں اس کے قریب پہنچ گیا۔ اس وقت وہ ایک تاریک کمرے میں اپنے بال بچوں کے ساتھ ( سو رہا ) تھا مجھے کچھ اندازہ نہیں ہو سکا کہ وہ کہاں ہے۔ اس لیے میں نے آواز دی، یا ابا رافع؟ وہ بولا کون ہے؟ اب میں نے آواز کی طرف بڑھ کر تلوار کی ایک ضرب لگائی۔ اس وقت میرا دل دھک دھک کر رہا تھا۔ یہی وجہ ہوئی کہ میں اس کا کام تمام نہیں کر سکا۔ وہ چیخا تو میں کمرے سے باہر نکل آیا اور تھوڑی دیر تک باہر ہی ٹھہرا رہا۔ پھر دوبارہ اندر گیا اور میں نے آواز بدل کر پوچھا، ابورافع! یہ آواز کیسی تھی؟ وہ بولا تیری ماں غارت ہو۔ ابھی ابھی مجھ پر کسی نے تلوار سے حملہ کیا ہے۔ انہوں نے بیان کیا کہ پھر ( آواز کی طرف بڑھ کر ) میں نے تلوار کی ایک ضرب اور لگائی۔ انہوں نے بیان کیا کہ اگرچہ میں اسے زخمی تو بہت کر چکا تھا لیکن وہ ابھی مرا نہیں تھا۔ اس لیے میں نے تلوار کی نوک اس کے پیٹ پر رکھ کر دبائی جو اس کی پیٹھ تک پہنچ گئی۔ مجھے اب یقین ہو گیا کہ میں اسے قتل کر چکا ہوں۔ چنانچہ میں نے دروازے ایک ایک کر کے کھولنے شروع کئے۔ آخر میں ایک زینے پر پہنچا۔ میں یہ سمجھا کہ زمین تک میں پہنچ چکا ہوں ( لیکن ابھی میں پہنچا نہ تھا ) اس لیے میں نے اس پر پاؤں رکھ دیا اور نیچے گر پڑا۔ چاندنی رات تھی۔ اس طرح گر پڑنے سے میری پنڈلی ٹوٹ گئی۔ میں نے اسے اپنے عمامہ سے باندھ لیا اور آ کر دروازے پر بیٹھ گیا۔ میں نے یہ ارادہ کر لیا تھا کہ یہاں سے اس وقت تک نہیں جاؤں گا جب تک یہ نہ معلوم کر لوں کہ آیا میں اسے قتل کر چکا ہوں یا نہیں؟ جب مرغ نے آواز دی تو اسی وقت قلعہ کی فصیل پر ایک پکارنے والے نے کھڑے ہو کر پکارا کہ میں اہل حجاز کے تاجر ابورافع کی موت کا اعلان کرتا ہوں۔ میں اپنے ساتھیوں کے پاس آیا اور ان سے کہا کہ چلنے کی جلدی کرو۔ اللہ تعالیٰ نے ابورافع کو قتل کرا دیا۔ چنانچہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ کو اس کی اطلاع دی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنا پاؤں پھیلاؤ میں نے پاؤں پھیلایا تو آپ نے اس پر اپنا دست مبارک پھیرا اور پاؤں اتنا اچھا ہو گیا جیسے کبھی اس میں مجھ کو کوئی تکلیف ہوئی ہی نہ تھی۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 86
			}
		}
	]
}