{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں معمر بن راشد نے، انہیں زہری نے، انہیں عمرو بن ابی سفیان ثقفی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جاسوسی کے لیے ایک جماعت ( مکہ، قریش کی خبر لانے کے لیے ) بھیجی اور اس کا امیر عاصم بن ثابت رضی اللہ عنہ کو بنایا، جو عاصم بن عمر بن خطاب کے نانا ہیں۔ یہ جماعت روانہ ہوئی اور جب عسفان اور مکہ کے درمیان پہنچی تو قبیلہ ہذیل کے ایک قبیلے کو جسے بنو لحیان کہا جاتا تھا، ان کا علم ہو گیا اور قبیلہ کے تقریباً سو تیر اندازوں نے ان کا پیچھا کیا اور ان کے نشانات قدم کو تلاش کرتے ہوئے چلے۔ آخر ایک ایسی جگہ پہنچنے میں کامیاب ہو گئے جہاں صحابہ کی اس جماعت نے پڑاؤ کیا تھا۔ وہاں ان کھجوروں کی گٹھلیاں ملیں جو صحابہ مدینہ سے لائے تھے۔ قبیلہ والوں نے کہا کہ یہ تو یثرب کی کھجور ( کی گھٹلی ) ہے اب انہوں نے پھر تلاش شروع کی اور صحابہ کو پا لیا۔ عاصم رضی اللہ عنہ اور ان کے ساتھیوں نے جب یہ صورت حال دیکھی تو صحابہ کی اس جماعت نے ایک ٹیلے پر چڑھ کر پناہ لی۔ قبیلہ والوں نے وہاں پہنچ کر ٹیلہ کو اپنے گھیرے میں لے لیا اور صحابہ سے کہا کہ ہم تمہیں یقین دلاتے ہیں اور عہد کرتے ہیں کہ اگر تم نے ہتھیار ڈال دیئے تو ہم تم میں سے کسی کو بھی قتل نہیں کریں گے۔ اس پر عاصم رضی اللہ عنہ بولے کہ میں تو کسی کافر کی حفاظت و امن میں خود کو کسی صورت میں بھی نہیں دے سکتا۔ اے اللہ! ہمارے ساتھ پیش آنے والے حالات کی خبر اپنے نبی کو پہنچا دے۔ چنانچہ ان صحابہ نے ان سے قتال کیا اور عاصم اپنے سات ساتھیوں کے ساتھ ان کے تیروں سے شہید ہو گئے۔ خبیب، زید اور ایک اور صحابی ان کے حملوں سے ابھی محفوظ تھے۔ قبیلہ والوں نے پھر حفاظت و امان کا یقین دلایا۔ یہ حضرات ان کی یقین دہانی پر اتر آئے۔ پھر جب قبیلہ والوں نے انہیں پوری طرح اپنے قبضے میں لے لیا تو ان کی کمان کی تانت اتار کر ان صحابہ کو انہیں سے باندھ دیا۔ تیسرے صحابہ جو خبیب اور زید کے ساتھ تھے، انہوں نے کہا کہ یہ تمہاری پہلی غداری ہے۔ انہوں نے ان کے ساتھ جانے سے انکار کر دیا۔ پہلے تو قبیلہ والوں نے انہیں گھسیٹا اور اپنے ساتھ لے جانے کے لیے زور لگاتے رہے لیکن جب وہ کسی طرح تیار نہ ہوئے تو انہیں وہیں قتل کر دیا اور خبیب اور زید کو ساتھ لے کر روانہ ہوئے۔ پھر انہیں مکہ میں لا کر بیچ دیا۔ خبیب رضی اللہ عنہ کو تو حارث بن عامر بن نوفل کے بیٹوں نے خرید لیا کیونکہ خبیب رضی اللہ عنہ نے بدر کی جنگ میں حارث کو قتل کیا تھا۔ وہ ان کے یہاں کچھ دنوں تک قیدی کی حیثیت سے رہے۔ جس وقت ان سب کا خبیب رضی اللہ عنہ کے قتل پر اتفاق ہو چکا تو اتفاق سے انہیں دنوں حارث کی ایک لڑکی ( زینب ) سے انہوں نے موئے زیر ناف صاف کرنے کے لیے استرہ مانگا اور انہوں نے ان کو استرہ بھی دے دیا تھا۔ ان کا بیان تھا کہ میرا لڑکا میری غفلت میں خبیب رضی اللہ عنہ کے پاس چلا گیا۔ انہوں نے اسے اپنی ران پر بٹھا لیا۔ میں نے جو اسے اس حالت میں دیکھا تو بہت گھبرائی۔ انہوں نے میری گھبراہٹ کو جان لیا، استرہ ان کے ہاتھ میں تھا۔ انہوں نے مجھ سے کہا، کیا تمہیں اس کا خطرہ ہے کہ میں اس بچے کو قتل کر دوں گا؟ ان شاءاللہ میں ہرگز ایسا نہیں کر سکتا۔ ان کا بیان تھا کہ خبیب رضی اللہ عنہ سے بہتر قیدی میں نے کبھی نہیں دیکھا تھا۔ میں نے انہیں انگور کا خوشہ کھاتے ہوئے دیکھا حالانکہ اس وقت مکہ میں کسی طرح کا پھل موجود نہیں تھا جبکہ وہ زنجیروں میں جکڑے ہوئے بھی تھے، تو وہ اللہ کی بھیجی ہوئی روزی تھی۔ پھر حارث کے بیٹے قتل کرنے کے لیے انہیں لے کر حرم کے حدود سے باہر گئے۔ خبیب رضی اللہ عنہ نے ان سے فرمایا کہ مجھے دو رکعت نماز پڑھنے کی اجازت دو ( انہوں نے اجازت دے دی اور ) ۔ جب وہ نماز سے فارغ ہوئے تو ان سے فرمایا کہ اگر تم یہ خیال نہ کرنے لگتے کہ میں موت سے گھبرا گیا ہوں تو اور زیادہ نماز پڑھتا۔ خبیب رضی اللہ عنہ ہی پہلے وہ شخص ہیں جن سے قتل سے پہلے دو رکعت نماز کا طریقہ چلا ہے۔ اس کے بعد انہوں نے ان کے لیے بددعا کی، اے اللہ! انہیں ایک ایک کر کے ہلاک کر دے اور یہ اشعار پڑھے ”جب کہ میں مسلمان ہونے کی حالت میں قتل کیا جا رہا ہوں تو مجھے اس کی کوئی پرواہ نہیں کہ کس پہلو پر اللہ کی راہ میں مجھے قتل کیا جائے گا۔ یہ سب کچھ اللہ کی راہ میں ہے اور اگر وہ چاہے گا تو جسم کے ایک ایک کٹے ہوئے ٹکڑے میں برکت دے گا۔“ پھر عقبہ بن حارث نے کھڑے ہو کر انہیں شہید کر دیا اور قریش نے عاصم رضی اللہ عنہ کی لاش کے لیے آدمی بھیجے تاکہ ان کے جسم کا کوئی بھی حصہ لائیں جس سے انہیں پہچانا جا سکے۔ عاصم رضی اللہ عنہ نے قریش کے ایک بہت بڑے، سردار کو بدر کی لڑائی میں قتل کیا تھا لیکن اللہ تعالیٰ نے بھڑوں کی ایک فوج کو بادل کی طرح ان کے اوپر بھیجا اور ان بھڑوں نے ان کی لاش کو قریش کے آدمیوں سے محفوظ رکھا اور قریش کے بھیجے ہوئے یہ لوگ ( ان کے پاس نہ پھٹک سکے ) کچھ نہ کر سکے۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 130
			}
		}
	]
}