{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4091,
			"arabicnumber": 4091,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ٰ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے ماموں، ام سلیم ( انس کی والدہ ) کے بھائی کو بھی ان ستر سواروں کے ساتھ بھیجا تھا۔ اس کی وجہ یہ ہوئی تھی کہ مشرکوں کے سردار عامر بن طفیل نے نبی کریم صلی اللہ علیہ وسلم کے سامنے ( شرارت اور تکبر سے ) تین صورتیں رکھی تھیں۔ اس نے کہا کہ یا تو یہ کیجئے کہ دیہاتی آبادی پر آپ کی حکومت ہو اور شہری آبادی پر میری ہو یا پھر مجھے آپ کا جانشیں مقرر کیا جائے ورنہ پھر میں ہزاروں غطفانیوں کو لے کر آپ پر چڑھائی کر دوں گا۔ ( اس پر نبی کریم صلی اللہ علیہ وسلم نے اس کے لیے بددعا کی ) اور ام فلاں کے گھر میں وہ مرض طاعون میں گرفتار ہوا۔ کہنے لگا کہ اس فلاں کی عورت کے گھر کے جوان اونٹ کی طرح مجھے بھی غدود نکل آیا ہے۔ میرا گھوڑا لاؤ۔ چنانچہ وہ اپنے گھوڑے کی پشت پر ہی مر گیا۔ بہرحال ام سلیم کے بھائی حرام بن ملحان ایک اور صحابی جو لنگڑے تھے اور تیسرے صحابی جن کا تعلق بنی فلاں سے تھا، آگے بڑھے۔ حرام نے ( اپنے دونوں ساتھیوں سے بنو عامر تک پہنچ کر پہلے ہی ) کہہ دیا کہ تم دونوں میرے قریب ہی کہیں رہنا۔ میں ان کے پاس پہلے جاتا ہوں اگر انہوں نے مجھے امن دے دیا تو تم لوگ قریب ہی ہو اور اگر انہوں نے قتل کر دیا تو آپ حضرات اپنے ساتھیوں کے پاس چلے جانا۔ چنانچہ قبیلہ میں پہنچ کر انہوں نے ان سے کہا، کیا تم مجھے امان دیتے ہو کہ میں رسول اللہ صلی اللہ علیہ وسلم کا پیغام تمہیں پہنچا دوں؟ پھر وہ آپ صلی اللہ علیہ وسلم کا پیغام انہیں پہنچانے لگے تو قبیلہ والوں نے ایک شخص کو اشارہ کیا اور اس نے پیچھے سے آ کر ان پر نیزہ سے وار کیا۔ ہمام نے بیان کیا، میرا خیال ہے کہ نیزہ آر پار ہو گیا تھا۔ حرام کی زبان سے اس وقت نکلا ”اللہ اکبر، کعبہ کے رب کی قسم! میں نے تو اپنی مراد حاصل کر لی۔“ اس کے بعد ان میں سے ایک صحابی کو بھی مشرکین نے پکڑ لیا ( جو حرام رضی اللہ عنہ کے ساتھ تھے اور انہیں بھی شہید کر دیا ) پھر اس مہم کے تمام صحابہ کو شہید کر دیا۔ صرف لنگڑے صحابی بچ نکلنے میں کامیاب ہو گئے وہ پہاڑ کی چوٹی پر چڑھ گئے تھے۔ ان شہداء کی شان میں اللہ تعالیٰ نے آیت نازل فرمائی، بعد میں وہ آیت منسوخ ہو گئی ( آیت یہ تھی ) «إنا قد لقينا ربنا فرضي عنا وأرضانا‏.‏» ۔ نبی کریم صلی اللہ علیہ وسلم نے ان قبائل رعل، ذکوان، بنو لحیان اور عصیہ کے لیے جنہوں نے اللہ اور اس کے رسول کی نافرمانی کی تھی تیس دن تک صبح کی نماز میں بددعا کی۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 135
			}
		}
	]
}