{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4122,
			"arabicnumber": 4122,
			"text": "ہم سے زکریا بن یحییٰ نے بیان کیا ‘ کہا ہم سے عبداللہ بن نمیر نے بیان کیا ‘ ان سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ غزوہ خندق کے موقع پر سعد رضی اللہ عنہ زخمی ہو گئے تھے۔ قریش کے ایک کافر شخص ‘ حسان بن عرفہ نامی نے ان پر تیر چلایا تھا اور وہ ان کے بازو کی رگ میں آ کے لگا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے مسجد میں ایک خیمہ لگا دیا تھا تاکہ قریب سے ان کی عیادت کرتے رہیں۔ پھر جب آپ غزوہ خندق سے واپس ہوئے اور ہتھیار رکھ کر غسل کیا تو جبرائیل علیہ السلام آپ کے پاس آئے۔ وہ اپنے سر سے غبار جھاڑ رہے تھے۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہا آپ نے ہتھیار رکھ دیئے۔ اللہ کی قسم! ابھی میں نے ہتھیار نہیں اتارے ہیں۔ آپ کو ان پر فوج کشی کرنی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کن پر؟ تو انہوں نے بنو قریظہ کی طرف اشارہ کیا۔ آپ صلی اللہ علیہ وسلم بنو قریظہ تک پہنچے ( اور انہوں نے اسلامی لشکر کے پندرہ دن کے سخت محاصرہ کے بعد ) سعد بن معاذ رضی اللہ عنہ کو ثالث مان کر ہتھیار ڈال دیئے۔ آپ صلی اللہ علیہ وسلم نے سعد رضی اللہ عنہ کو فیصلہ کا اختیار دیا۔ سعد رضی اللہ عنہ نے کہا کہ میں ان کے بارے میں فیصلہ کرتا ہوں کہ جتنے لوگ ان کے جنگ کرنے کے قابل ہیں وہ قتل کر دیئے جائیں ‘ ان کی عورتیں اور بچے قید کر لیے جائیں اور ان کا مال تقسیم کر لیا جائے۔ ہشام نے بیان کیا کہ پھر مجھے میرے والد نے عائشہ رضی اللہ عنہا سے خبر دی کہ سعد رضی اللہ عنہ نے یہ دعا کی تھی ”اے اللہ! تو خوب جانتا ہے کہ اس سے زیادہ مجھے کوئی چیز عزیز نہیں کہ میں تیرے راستے میں اس قوم سے جہاد کروں جس نے تیرے رسول کو جھٹلایا اور انہیں ان کے وطن سے نکالا لیکن اب ایسا معلوم ہوتا ہے کہ تو نے ہماری اور ان کی لڑائی اب ختم کر دی ہے۔ لیکن اگر قریش سے ہماری لڑائی کا کوئی بھی سلسلہ ابھی باقی ہو تو مجھے اس کے لیے زندہ رکھنا۔ یہاں تک کہ میں تیرے راستے میں ان سے جہاد کروں اور اگر لڑائی کے سلسلے کو تو نے ختم ہی کر دیا ہے تو میرے زخموں کو پھر سے ہرا کر دے اور اسی میں میری موت واقع کر دے۔ اس دعا کے بعد سینے پر ان کا زخم پھر سے تازہ ہو گیا۔ مسجد میں قبیلہ بنو غفار کے کچھ صحابہ کا بھی ایک خیمہ تھا۔ خون ان کی طرف بہہ کر آیا تو وہ گھبرائے اور انہوں نے کہا: اے خیمہ والو! تمہاری طرف سے یہ خون ہماری طرف بہہ کر آ رہا ہے؟ دیکھا تو سعد رضی اللہ عنہ کے زخم سے خون بہہ رہا تھا ‘ ان کی وفات اسی میں ہوئی۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 166
			}
		}
	]
}