{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4143,
			"arabicnumber": 4143,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابوعوانہ نے بیان کیا ‘ ان سے حصین بن عبدالرحمٰن نے ‘ ان سے ابووائل شقیق بن سلمہ نے بیان کیا ‘ ان سے مسروق بن اجدع نے بیان کیا ‘ کہا کہ مجھ سے ام رومان رضی اللہ عنہا نے بیان کیا ‘ وہ عائشہ رضی اللہ عنہا کی والدہ ہیں۔ انہوں نے بیان کیا کہ میں اور عائشہ رضی اللہ عنہا بیٹھی ہوئی تھیں کہ ایک انصاری خاتون آئیں اور کہنے لگیں کہ اللہ فلاں، فلاں کو تباہ کرے۔ ام رومان نے پوچھا کہ کیا بات ہے؟ انہوں نے کہا کہ میرا لڑکا بھی ان لوگوں کے ساتھ شریک ہو گیا ہے۔ جنہوں نے اس طرح کی بات کی ہے۔ ام رومان رضی اللہ عنہا نے پوچھا کہ آخر بات کیا ہے؟ اس پر انہوں نے تہمت لگانے والوں کی باتیں نقل کر دیں۔ عائشہ رضی اللہ عنہا نے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم نے بھی یہ باتیں سنیں ہیں؟ انہوں نے بیان کیا کہ ہاں۔ انہوں نے پوچھا اور ابوبکر رضی اللہ عنہ نے بھی؟ انہوں نے کہا کہ ہاں ‘ انہوں نے بھی۔ یہ سنتے ہی وہ غش کھا کر گر پڑیں اور جب ہوش آیا تو جاڑے کے ساتھ بخار چڑھا ہوا تھا۔ میں نے ان پر ان کے کپڑے ڈال دیئے اور اچھی طرح ڈھک دیا۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور دریافت فرمایا کہ انہیں کیا ہوا ہے؟ میں نے عرض کیا: یا رسول اللہ! جاڑے کے ساتھ بخار چڑھ گیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ غالباً اس نے اس طوفان کی بات سن لی ہے۔ ام رومان رضی اللہ عنہا نے کہا کہ جی ہاں۔ پھر عائشہ رضی اللہ عنہا نے بیٹھ کر کہا کہ اللہ کی قسم! اگر میں قسم کھاؤں کہ میں بےگناہ ہوں تو آپ لوگ میری تصدیق نہیں کریں گے اور اگر کچھ کہوں تب بھی میرا عذر نہیں سنیں گے۔ میری اور آپ لوگوں کی یعقوب علیہ السلام اور ان کے بیٹوں جیسی مثال ہے کہ انہوں نے کہا تھا «والله المستعان على ما تصفون» یعنی ”اللہ ان باتوں پر جو تم بناتے ہو مدد کرنے والا ہے۔“ ام رومان رضی اللہ عنہا نے کہا: نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کی یہ تقریر سن کر لوٹ گئے ‘ کچھ جواب نہیں دیا۔ چنانچہ اللہ تعالیٰ نے خود ان کی تلافی نازل کی۔ وہ نبی کریم صلی اللہ علیہ وسلم سے کہنے لگیں بس میں اللہ ہی کا شکر ادا کرتی ہوں نہ آپ کا نہ کسی اور کا۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 187
			}
		}
	]
}