{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے عمرو بن دینار نے بیان کیا ‘ انہیں حسن بن محمد بن علی نے خبر دی اور انہوں نے عبیداللہ بن رافع سے سنا ‘ انہوں نے بیان کیا کہ میں نے علی رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ مجھے، زبیر اور مقداد رضی اللہ عنہم کو رسول اللہ صلی اللہ علیہ وسلم نے روانہ کیا اور ہدایت کی کہ ( مکہ کے راستے پر ) چلے جانا جب تم مقام روضہ خاخ پر پہنچو تو وہاں تمہیں ہودج میں ایک عورت ملے گی۔ وہ ایک خط لیے ہوئے ہے ‘ تم اس سے وہ لے لینا۔ انہوں نے کہا کہ ہم روانہ ہوئے۔ ہمارے گھوڑے ہمیں تیزی کے ساتھ لیے جا رہے تھے۔ جب ہم روضہ خاخ پر پہنچے تو واقعی وہاں ہمیں ایک عورت ہودج میں سوار ملی ( جس کا نام سارا یا کناد ہے ) ہم نے اس سے کہا کہ خط نکال۔ وہ کہنے لگی کہ میرے پاس تو کوئی خط نہیں ہے لیکن جب ہم نے اس سے یہ کہا کہ اگر تو نے خود سے خط نکال کر ہمیں نہیں دیا تو ہم تیرا کپڑا اتار کر ( تلاشی لیں گے ) تب اس نے اپنی چوٹی میں سے وہ خط نکالا۔ ہم وہ خط لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں واپس ہوئے۔ اس میں یہ لکھا تھا کہ حاطب بن ابی بلتعہ کی طرف سے چند مشرکین مکہ کے نام ( صفوان بن امیہ اور سہیل بن عمرو اور عکرمہ بن ابوجہل ) پھر انہوں نے اس میں مشرکین کو نبی کریم صلی اللہ علیہ وسلم کے بعض بھیدوں کی خبر بھی دی تھی۔ ( آپ فوج لے کر آنا چاہتے ہیں ) نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اے حاطب! تو نے یہ کیا کیا؟ انہوں نے عرض کیا یا رسول اللہ! میرے بارے میں فیصلہ کرنے میں آپ جلدی نہ فرمائیں ‘ میں اس کی وجہ عرض کرتا ہوں۔ بات یہ ہے کہ میں دوسرے مہاجرین کی طرح قریش کے خاندان سے نہیں ہوں ‘ صرف ان کا حلیف بن کر ان سے جڑ گیا ہوں اور دوسرے مہاجرین کے وہاں عزیز و اقرباء ہیں جو ان کے گھر بار مال و اسباب کی نگرانی کرتے ہیں۔ میں نے چاہا کہ خیر جب میں خاندان کی رو سے ان کا شریک نہیں ہوں تو کچھ احسان ہی ان پر ایسا کر دوں جس کے خیال سے وہ میرے کنبہ والوں کو نہ ستائیں۔ میں نے یہ کام اپنے دین سے پھر کر نہیں کیا اور نہ اسلام لانے کے بعد میرے دل میں کفر کی حمایت کا جذبہ ہے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ واقعی انہوں نے تمہارے سامنے سچی بات کہہ دی ہے۔ عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! اجازت ہو تو میں اس منافق کی گردن اڑا دوں لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ غزوہ بدر میں شریک رہے ہیں اور تمہیں کیا معلوم اللہ تعالیٰ جو غزوہ بدر میں شریک ہونے والوں کے کام سے واقف ہے سورۃ الممتحنہ میں اس نے ان کے متعلق خود فرما دیا ہے کہ ”جو چاہو کرو میں نے تمہارے گناہ معاف کر دیئے“ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة‏» ”اے وہ لوگو جو ایمان لا چکے ہو! میرے اور اپنے دشمنوں کو دوست نہ بناؤ کہ ان سے تم اپنی محبت کا اظہار کرتے رہو۔ آیت «فقد ضل سواء السبيل» تک۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 308
			}
		}
	]
}