{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب بن خالد نے بیان کیا، ان سے عمرو بن یحییٰ نے، ان سے عباد بن تمیم نے، ان سے عبداللہ بن زید بن عاصم رضی اللہ عنہ نے بیان کیا کہ غزوہ حنین کے موقع پر اللہ تعالیٰ نے اپنے رسول کو جو غنیمت دی تھی آپ نے اس کی تقسیم کمزور ایمان کے لوگوں میں ( جو فتح مکہ کے بعد ایمان لائے تھے ) کر دی اور انصار کو اس میں سے کچھ نہیں دیا۔ اس کا انہیں کچھ ملال ہوا کہ وہ مال جو نبی کریم صلی اللہ علیہ وسلم نے دوسروں کو دیا انہیں کیوں نہیں دیا۔ آپ نے اس کے بعد انہیں خطاب کیا اور فرمایا: اے انصاریو! کیا میں نے تمہیں گمراہ نہیں پایا تھا پھر تم کو میرے ذریعہ اللہ تعالیٰ نے ہدایت نصیب کی اور تم میں آپس میں دشمنی اور نااتفاقی تھی تو اللہ تعالیٰ نے میرے ذریعہ تم میں باہم الفت پیدا کی اور تم محتاج تھے اللہ تعالیٰ نے میرے ذریعہ غنی کیا۔ آپ کے ایک ایک جملے پر انصار کہتے جاتے تھے کہ اللہ اور اس کے رسول کے ہم سب سے زیادہ احسان مند ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میری باتوں کا جواب دینے سے تمہیں کیا چیز مانع رہی؟ بیان کیا کہ آپ صلی اللہ علیہ وسلم کے ہر اشارہ پر انصار عرض کرتے جاتے کہ اللہ اور اس کے رسول کے ہم سب سے زیادہ احسان مند ہیں پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم چاہتے تو مجھ سے اس طرح بھی کہہ سکتے تھے ( کہ آپ آئے تو لوگ آپ کو جھٹلا رہے تھے، لیکن ہم نے آپ کی تصدیق کی وغیرہ ) کیا تم اس پر خوش نہیں ہو کہ جب لوگ اونٹ اور بکریاں لے جا رہے ہوں تو تم اپنے گھروں کی طرف رسول اللہ صلی اللہ علیہ وسلم کو ساتھ لے جاؤ؟ اگر ہجرت کی فضیلت نہ ہوتی تو میں بھی انصار کا ایک آدمی ہوتا۔ لوگ خواہ کسی گھاٹی یا وادی میں رہیں گے میں تو انصار کی گھاٹی اور وادی میں رہوں گا۔ انصار استر کی طرح ہیں جو جسم سے ہمیشہ لگا رہتا ہے اور دوسرے لوگ اوپر کے کپڑے یعنی ابرہ کی طرح ہیں۔ تم لوگ ( انصار ) دیکھو گے کہ میرے بعد تم پر دوسروں کو ترجیح دی جائے گی۔ تم ایسے وقت میں صبر کرنا یہاں تک کہ مجھ سے حوض پر آ ملو۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 359
			}
		}
	]
}