{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے معاذ نے بیان کیا، کہا ہم سے عبداللہ بن عون نے، ان سے ہشام بن زید بن انس بن مالک نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ جب حنین کا دن ہوا تو قبیلہ ہوازن اور غطفان اپنے مویشی اور بال بچوں کو ساتھ لے کر جنگ کے لیے نکلے۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ دس ہزار کا لشکر تھا۔ ان میں کچھ لوگ وہ بھی تھے، جنہیں نبی کریم صلی اللہ علیہ وسلم نے فتح مکہ کے بعد احسان رکھ کر چھوڑ دیا تھا، پھر ان سب نے پیٹھ پھیر لی اور نبی کریم صلی اللہ علیہ وسلم تنہا رہ گئے۔ اس دن آپ صلی اللہ علیہ وسلم نے دو مرتبہ پکارا دونوں پکار ایک دوسرے سے الگ الگ تھیں، آپ صلی اللہ علیہ وسلم نے دائیں طرف متوجہ ہو کر پکارا: اے انصاریو! انہوں نے جواب دیا ہم حاضر ہیں: یا رسول اللہ! آپ کو بشارت ہو، ہم آپ کے ساتھ ہیں، لڑنے کو تیار ہیں۔ پھر آپ بائیں طرف متوجہ ہوئے اور آواز دی، اے انصاریو! انہوں نے ادھر سے جواب دیا کہ ہم حاضر ہیں، یا رسول اللہ! بشارت ہو، ہم آپ کے ساتھ ہیں۔ آپ صلی اللہ علیہ وسلم اس وقت ایک سفید خچر پر سوار تھے پھر آپ اتر گئے اور فرمایا کہ میں اللہ کا بندہ اور اس کا رسول ہوں۔ انجام کار کافروں کو ہار ہوئی اور اس لڑائی میں بہت زیادہ غنیمت حاصل ہوئی۔ آپ صلی اللہ علیہ وسلم نے اسے مہاجرین میں اور قریشیوں میں تقسیم کر دیا ( جنہیں فتح مکہ کے موقع پر احسان رکھ کر چھوڑ دیا تھا ) انصار کو ان میں سے کچھ نہیں عطا فرمایا۔ انصار ( کے بعض نوجوانوں ) نے کہا کہ جب سخت وقت آتا ہے تو ہمیں بلایا جاتا ہے اور غنیمت دوسروں کو تقسیم کر دی جاتی ہے۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ نے انصار کو ایک خیمہ میں جمع کیا اور فرمایا اے انصاریو! کیا وہ بات صحیح ہے جو تمہارے بارے میں مجھے معلوم ہوئی ہے؟ اس پر وہ خاموش ہو گئے پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اے انصاریو! کیا تم اس پر خوش نہیں ہو کہ لوگ دنیا اپنے ساتھ لے جائیں اور تم رسول اللہ کو اپنے گھر لے جاؤ۔ انصاریوں نے عرض کیا ہم اسی پر خوش ہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر لوگ کسی وادی میں چلیں اور انصار کسی گھاٹی میں چلیں تو میں انصار ہی کی گھاٹی میں چلنا پسند کروں گا۔ اس پر ہشام نے پوچھا: اے ابوحمزہ! کیا آپ وہاں موجود تھے؟ انہوں نے کہا کہ میں آپ صلی اللہ علیہ وسلم سے غائب ہی کب ہوتا تھا۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 366
			}
		}
	]
}