{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، ان سے عمارہ بن قعقاع بن شبرمہ نے بیان کیا، ان سے عبدالرحمٰن بن ابی نعیم نے بیان کیا، کہا کہ میں نے ابو سعید خدری رضی اللہ عنہ سے سنا وہ کہتے تھے کہ یمن سے علی بن ابی طالب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پاس بیری کے پتوں سے دباغت دئیے ہوئے چمڑے کے ایک تھیلے میں سونے کے چند ڈلے بھیجے۔ ان سے ( کان کی ) مٹی بھی ابھی صاف نہیں کی گئی تھی۔ راوی نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے وہ سونا چار آدمیوں میں تقسیم کر دیا۔ عیینہ بن بدر، اقرع بن حابس، زید بن خیل اور چوتھے علقمہ رضی اللہ عنہم تھے یا عامر بن طفیل رضی اللہ عنہ تھے۔ آپ کے اصحاب میں سے ایک صاحب نے اس پر کہا کہ ان لوگوں سے زیادہ ہم اس سونے کے مستحق تھے۔ راوی نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم مجھ پر اعتبار نہیں کرتے حالانکہ اس اللہ نے مجھ پر اعتبار کیا ہے جو آسمان پر ہے اور اس کی جو آسمان پر ہے وحی میرے پاس صبح و شام آتی ہے۔ راوی نے بیان کیا کہ پھر ایک شخص جس کی آنکھیں دھنسی ہوئی تھیں، دونوں رخسار پھولے ہوئے تھے، پیشانی بھی ابھری ہوئی تھی، گھنی داڑھی اور سر منڈا ہوا، تہبند اٹھائے ہوئے تھا، کھڑا ہوا اور کہنے لگا: یا رسول اللہ! اللہ سے ڈرئیے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ افسوس تجھ پر، کیا میں اس روئے زمین پر اللہ سے ڈرنے کا سب سے زیادہ مستحق نہیں ہوں؟ راوی نے بیان کیا پھر وہ شخص چلا گیا۔ خالد بن ولید رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میں کیوں نہ اس شخص کی گردن مار دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں شاید وہ نماز پڑھتا ہو اس پر خالد رضی اللہ عنہ نے عرض کیا کہ بہت سے نماز پڑھنے والے ایسے ہیں جو زبان سے اسلام کا دعویٰ کرتے ہیں اور ان کے دل میں وہ نہیں ہوتا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا حکم نہیں ہوا ہے کہ لوگوں کے دلوں کی کھوج لگاؤں اور نہ اس کا حکم ہوا کہ ان کے پیٹ چاک کروں۔ راوی نے کہا پھر نبی کریم صلی اللہ علیہ وسلم نے اس ( منافق ) کی طرف دیکھا تو وہ پیٹھ پھیر کر جا رہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی نسل سے ایک ایسی قوم نکلے گی جو کتاب اللہ کی تلاوت بڑی خوش الحانی کے ساتھ کرے گی لیکن وہ ان کے حلق سے نیچے نہیں اترے گا۔ دین سے وہ لوگ اس طرح نکل چکے ہوں گے جیسے تیر جانور کے پار نکل جاتا ہے اور میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ اگر میں ان کے دور میں ہوا تو ثمود کی قوم کی طرح ان کو بالکل قتل کر ڈالوں گا۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 378
			}
		}
	]
}