{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4370,
			"arabicnumber": 4370,
			"text": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا مجھ سے عبداللہ بن وہب نے، کہا مجھ کو عمرو بن حارث نے خبر دی اور بکر بن مضر نے یوں بیان کیا کہ عبداللہ بن وہب نے عمرو بن حارث سے روایت کیا، ان سے بکیر نے اور ان سے کریب (ابن عباس رضی اللہ عنہما کے غلام) نے بیان کیا کہ ابن عباس، عبدالرحمٰن بن ازہر اور مسور بن مخرمہ نے انہیں عائشہ رضی اللہ عنہا کی خدمت میں بھیجا اور کہا کہ ام المؤمنین سے ہم سب کا سلام کہنا اور عصر کے بعد دو رکعتوں کے متعلق ان سے پوچھنا اور یہ کہ ہمیں معلوم ہوا ہے کہ آپ انہیں پڑھتی ہیں اور ہمیں یہ بھی معلوم ہوا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں پڑھنے سے روکا تھا۔ ابن عباس رضی اللہ عنہما نے کہا کہ میں ان دو رکعتوں کے پڑھنے پر عمر رضی اللہ عنہ کے ساتھ ( ان کے دور خلافت میں ) لوگوں کو مارا کرتا تھا۔ کریب نے بیان کیا کہ پھر میں ام المؤمنین کی خدمت میں حاضر ہوا اور ان کا پیغام پہنچایا۔ عائشہ رضی اللہ عنہا نے فرمایا کہ اس کے متعلق ام سلمہ سے پوچھو، میں نے ان حضرات کو آ کر اس کی اطلاع دی تو انہوں نے مجھ کو ام سلمہ رضی اللہ عنہا کی خدمت میں بھیجا، وہ باتیں پوچھنے کے لیے جو عائشہ سے انہوں نے پچھوائی تھیں۔ ام سلمہ رضی اللہ عنہا نے فرمایا کہ میں نے خود بھی رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آپ عصر کے بعد دو رکعتوں سے منع کرتے تھے لیکن آپ صلی اللہ علیہ وسلم نے ایک مرتبہ عصر کی نماز پڑھی، پھر میرے یہاں تشریف لائے، میرے پاس اس وقت قبیلہ بنو حرام کی کچھ عورتیں بیٹھی ہوئی تھیں اور آپ نے دو رکعت نماز پڑھی۔ یہ دیکھ کر میں نے خادمہ کو آپ کی خدمت میں بھیجا اور اسے ہدایت کر دی کہ نبی کریم صلی اللہ علیہ وسلم کے پہلو میں کھڑی ہو جانا اور عرض کرنا کہ ام سلمہ رضی اللہ عنہا نے پوچھا ہے: یا رسول اللہ! میں نے تو آپ سے ہی سنا تھا اور آپ نے عصر کے بعد ان دو رکعتوں کے پڑھنے سے منع کیا تھا لیکن میں آج خود آپ کو دو رکعت پڑھتے دیکھ رہی ہوں۔ اگر نبی کریم صلی اللہ علیہ وسلم ہاتھ سے اشارہ کریں تو پھر پیچھے ہٹ جانا۔ خادمہ نے میری ہدایت کے مطابق کیا اور نبی کریم صلی اللہ علیہ وسلم نے ہاتھ سے اشارہ کیا تو وہ پیچھے ہٹ گئی۔ پھر جب آپ فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوامیہ کی بیٹی! عصر کے بعد کی دو رکعتوں کے متعلق تم نے سوال کیا ہے، وجہ یہ ہوئی تھی کہ قبیلہ عبدالقیس کے کچھ لوگ میرے یہاں اپنی قوم کا اسلام لے کر آئے تھے اور ان کی وجہ سے ظہر کے بعد کی دو رکعتیں میں نہیں پڑھ سکا تھا یہ وہی دو رکعتیں ہیں۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 396
			}
		}
	]
}