{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4383,
			"arabicnumber": 4383,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ انہوں نے محمد بن المنکدر سے سنا، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا جب میرے پاس بحرین سے روپیہ آئے گا تو میں تمہیں اتنا اتنا تین لپ بھر کر روپیہ دوں گا، لیکن بحرین سے جس وقت روپیہ آیا تو نبی کریم صلی اللہ علیہ وسلم کی وفات ہو چکی تھی۔ اس لیے وہ روپیہ ابوبکر صدیق رضی اللہ عنہ کے پاس آیا اور انہوں نے اعلان کروا دیا کہ اگر کسی کا نبی کریم صلی اللہ علیہ وسلم پر قرض یا کسی سے نبی کریم صلی اللہ علیہ وسلم کا کوئی وعدہ ہو تو وہ میرے پاس آئے۔ جابر رضی اللہ عنہ نے بیان کیا کہ میں ان کے یہاں آ گیا اور انہیں بتایا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ اگر بحرین سے میرے پاس روپیہ آیا تو میں تمہیں اتنا اتنا تین لپ بھر کر دوں گا۔ جابر رضی اللہ عنہ نے بیان کیا کہ پھر میں نے ان سے ملاقات کی اور ان سے اس کے متعلق کہا لیکن انہوں نے اس مرتبہ مجھے نہیں دیا۔ میں پھر ان کے یہاں گیا اس مرتبہ بھی انہوں نے نہیں دیا۔ میں تیسری مرتبہ گیا، اس مرتبہ بھی انہوں نے نہیں دیا۔ اس لیے میں نے ان سے کہا کہ میں آپ کے یہاں ایک مرتبہ آیا۔ آپ نے نہیں دیا، پھر آیا اور آپ نے نہیں دیا۔ پھر تیسری مرتبہ آیا ہوں اور آپ اس مرتبہ بھی نہیں دے رہے ہیں۔ اگر آپ کو مجھے دینا ہے تو دے دیجئیے ورنہ صاف کہہ دیجئیے کہ میرا دل دینے کو نہیں چاہتا، میں بخیل ہوں۔ اس پر ابوبکر رضی اللہ عنہ نے فرمایا تم نے کہا ہے کہ میرے معاملہ میں بخل کر لو، بھلا بخل سے بڑھ کر اور کیا عیب ہو سکتا ہے۔ تین مرتبہ انہوں نے یہ جملہ دہرایا اور کہا میں نے تمہیں جب بھی ٹالا تو میرا ارادہ یہی تھا کہ بہرحال تمہیں دینا ہے۔ اور اسی سند سے عمرو بن دینار سے روایت ہے، ان سے محمد بن علی باقر نے بیان کیا، انہوں نے کہا کہ میں نے جابر رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ میں حاضر ہوا تو ابوبکر رضی اللہ عنہ نے مجھے ایک لپ بھر کر روپیہ دیا اور کہا کہ اسے گن لو۔ میں نے گنا تو پانچ سو تھا۔ فرمایا کہ دو مرتبہ اتنا ہی اور لے لو۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 406
			}
		}
	]
}