{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4385,
			"arabicnumber": 4385,
			"text": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے عبدالسلام بن حرب نے بیان کیا، ان سے ایوب سختیانی نے، ان سے ابوقلابہ نے اور ان سے زہدم نے کہ جب ابوموسیٰ رضی اللہ عنہ ( کوفہ کے امیر بن کر عثمان رضی اللہ عنہ کے عہد خلافت میں ) آئے تو اس قبیلہ جرم کا انہوں نے بہت اعزاز کیا۔ زہدم کہتے ہیں ہم آپ کی خدمت میں بیٹھے ہوئے تھے اور وہ مرغ کا ناشتہ کر رہے تھے۔ حاضرین میں ایک اور صاحب بھی بیٹھے ہوئے تھے۔ ابوموسیٰ رضی اللہ عنہ نے انہیں بھی کھانے پر بلایا تو ان صاحب نے کہا کہ جب سے میں نے مرغیوں کو کچھ ( گندی ) چیزیں کھاتے دیکھا ہے، اسی وقت سے مجھے اس کے گوشت سے گھن آنے لگی ہے۔ ابوموسیٰ رضی اللہ عنہ نے کہا کہ آؤ بھائی میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کا گوشت کھاتے دیکھا ہے۔ ان صاحب نے کہا لیکن میں نے اس کا گوشت نہ کھانے کی قسم کھا رکھی ہے۔ انہوں نے کہا کہ تم آ تو جاؤ میں تمہیں تمہاری قسم کے بارے میں بھی علاج بتاؤں گا۔ ہم قبیلہ اشعر کے چند لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے ( غزوہ تبوک کے لیے ) جانور مانگے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ سواری نہیں ہے۔ ہم نے پھر آپ سے مانگا تو آپ نے اس مرتبہ قسم کھائی کہ آپ ہم کو سواری نہیں دیں گے لیکن ابھی کچھ زیادہ دیر نہیں ہوئی تھی کہ غنیمت میں کچھ اونٹ آئے اور نبی کریم صلی اللہ علیہ وسلم نے ان میں سے پانچ اونٹ ہم کو دلائے۔ جب ہم نے انہیں لے لیا تو پھر ہم نے کہا کہ یہ تو ہم نے نبی کریم صلی اللہ علیہ وسلم کو دھوکا دیا۔ آپ کو غفلت میں رکھا، قسم یاد نہیں دلائی۔ ایسی حالت میں ہماری بھلائی کبھی نہیں ہو گی۔ آخر میں آپ کے پاس آیا اور میں نے کہا: یا رسول اللہ! آپ نے تو قسم کھا لی تھی کہ آپ ہم کو سواری نہیں دیں گے پھر آپ نے سواری دے دی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ٹھیک ہے لیکن جب بھی میں کوئی قسم کھاتا ہوں اور اس کے سوا دوسری صورت مجھے اس سے بہتر نظر آتی ہے تو میں وہی کرتا ہوں جو بہتر ہوتا ہے ( اور قسم کا کفارہ دے دیتا ہوں ) ۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 408
			}
		}
	]
}