{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4406,
			"arabicnumber": 4406,
			"text": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے محمد بن سیرین نے، ان سے عبدالرحمٰن بن ابی بکرہ رضی اللہ عنہما نے اور ان سے ابوبکرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زمانہ اپنی اصل حالت پر گھوم کر آ گیا ہے۔ اس دن کی طرح جب اللہ نے زمین و آسمان کو پیدا کیا تھا۔ دیکھو! سال کے بارہ مہینے ہوتے ہیں۔ چار ان میں سے حرمت والے مہینے ہیں۔ تین لگاتار ہیں، ذی قعدہ، ذی الحجہ اور محرم ( اور چوتھا ) رجب مضر جو جمادی الاولیٰ اور شعبان کے بیچ میں پڑتا ہے۔ ( پھر آپ نے دریافت فرمایا ) یہ کون سا مہینہ ہے؟ ہم نے کہا کہ اللہ اور ان کے رسول کو بہتر علم ہے۔ اس پر آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔ ہم نے سمجھا شاید آپ مشہور نام کے سوا اس کا کوئی اور نام رکھیں گے۔ لیکن آپ نے فرمایا: کیا یہ ذی الحجہ نہیں ہے؟ ہم بولے کہ کیوں نہیں۔ پھر دریافت فرمایا اور یہ شہر کون سا ہے؟ ہم بولے کہ اللہ اور اس کے رسول کو زیادہ بہتر علم ہے۔ پھر آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔ ہم نے سمجھا شاید اس کا کوئی اور نام آپ صلی اللہ علیہ وسلم رکھیں گے، جو مشہور نام کے علاوہ ہو گا۔، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ مکہ نہیں ہے؟ ہم بولے کیوں نہیں ( یہ مکہ ہی ہے ) پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا اور یہ دن کون سا ہے؟ ہم بولے کہ اللہ اور اس کے رسول کو زیادہ بہتر علم ہے، پھر آپ صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا شاید اس کا آپ صلی اللہ علیہ وسلم اس کے مشہور نام کے سوا کوئی اور نام رکھیں گے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ یوم النحر ( قربانی کا دن ) نہیں ہے؟ ہم بولے کہ کیوں نہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا: پس تمہارا خون اور تمہارا مال۔ محمد نے بیان کیا کہ میرا خیال ہے کہ ابوبکرہ رضی اللہ عنہ نے یہ بھی کہا، اور تمہاری عزت تم پر اسی طرح حرام ہے جس طرح یہ دن کا تمہارے اس شہر اور تمہارے اس مہینے میں اور تم بہت جلد اپنے رب سے ملو گے اور وہ تم سے تمہارے اعمال کے بارے میں سوال کرے گا۔ ہاں، پس میرے بعد تم گمراہ نہ ہو جانا کہ ایک دوسرے کی گردن مارنے لگو۔ ہاں اور جو یہاں موجود ہیں وہ ان لوگوں کو پہنچا دیں جو موجود نہیں ہیں، ہو سکتا ہے کہ جسے وہ پہنچائیں ان میں سے کوئی ایسا بھی ہو جو یہاں بعض سننے والوں سے زیادہ اس ( حدیث ) کو یاد رکھ سکتا ہو۔ محمد بن سیرین جب اس حدیث کا ذکر کرتے تو فرماتے کہ محمد صلی اللہ علیہ وسلم نے سچ فرمایا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو کیا میں نے پہنچا دیا۔ آپ صلی اللہ علیہ وسلم نے دو مرتبہ یہ جملہ فرمایا۔",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 428
			}
		}
	]
}