{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4677,
			"arabicnumber": 4677,
			"text": "مجھ سے محمد بن نصر نیشاپوری نے بیان کیا، کہا ہم سے احمد بن ابی شعیب نے بیان کیا، کہا ہم سے موسیٰ بن اعین نے بیان کیا، کہا ہم سے اسحاق بن راشد نے بیان کیا، ان سے زہری نے بیان کیا، کہا کہ مجھے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے خبر دی، ان سے ان کے والد عبداللہ نے بیان کیا کہ میں نے اپنے والد کعب بن مالک رضی اللہ عنہ سے سنا۔ وہ ان تین صحابہ میں سے تھے جن کی توبہ قبول کی گئی تھی۔ انہوں نے بیان کیا کہ دو غزووں، غزوہ عسرت ( یعنی غزوہ تبوک ) اور غزوہ بدر کے سوا اور کسی غزوے میں کبھی میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جانے سے نہیں رکا تھا۔ انہوں نے بیان کیا چاشت کے وقت جب رسول اللہ صلی اللہ علیہ وسلم ( غزوہ سے واپس تشریف لائے ) تو میں نے سچ بولنے کا پختہ ارادہ کر لیا اور آپ کا سفر سے واپس آنے میں معمول یہ تھا کہ چاشت کے وقت ہی آپ ( مدینہ ) پہنچتے تھے اور سب سے پہلے مسجد میں تشریف لے جاتے اور دو رکعت نماز پڑھتے ( بہرحال ) آپ صلی اللہ علیہ وسلم نے مجھ سے اور میری طرح عذر بیان کرنے والے دو اور صحابہ سے دوسرے صحابہ کو بات چیت کرنے سے منع کر دیا۔ ہمارے علاوہ اور بھی بہت سے لوگ ( جو ظاہر میں مسلمان تھے ) اس غزوے میں شریک نہیں ہوئے لیکن آپ نے ان میں سے کسی سے بھی بات چیت کی ممانعت نہیں کی تھی۔ چنانچہ لوگوں نے ہم سے بات چیت کرنا چھوڑ دیا۔ میں اسی حالت میں ٹھہرا رہا۔ معاملہ بہت طول پکڑتا جا رہا تھا۔ ادھر میری نظر میں سب سے اہم معاملہ یہ تھا کہ اگر کہیں ( اس عرصہ میں ) میں مر گیا تو آپ صلی اللہ علیہ وسلم مجھ پر نماز جنازہ نہیں پڑھائیں گے یا آپ صلی اللہ علیہ وسلم کی وفات ہو جائے تو افسوس لوگوں کا یہی طرز عمل میرے ساتھ پھر ہمیشہ کے لیے باقی رہ جائے گا، نہ مجھ سے کوئی گفتگو کرے گا اور نہ مجھ پر نماز جنازہ پڑھے گا۔ آخر اللہ تعالیٰ نے ہماری توبہ کی بشارت آپ صلی اللہ علیہ وسلم پر اس وقت نازل کی جب رات کا آخری تہائی حصہ باقی رہ گیا تھا۔ آپ صلی اللہ علیہ وسلم اس وقت ام سلمہ رضی اللہ عنہا کے گھر میں تشریف رکھتے تھے۔ ام سلمہ رضی اللہ عنہا کا مجھ پر بڑا احسان و کرم تھا اور وہ میری مدد کیا کرتی تھیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ام سلمہ! کعب کی توبہ قبول ہو گئی۔ انہوں نے عرض کیا۔ پھر میں ان کے یہاں کسی کو بھیج کر یہ خوشخبری نہ پہنچوا دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ خبر سنتے ہی لوگ جمع ہو جائیں گے اور ساری رات تمہیں سونے نہیں دیں گے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے فجر کی نماز پڑھنے کے بعد بتایا کہ اللہ نے ہماری توبہ قبول کر لی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے جب یہ خوشخبری سنائی تو آپ کا چہرہ مبارک منور ہو گیا جیسے چاند کا ٹکڑا ہو اور ( غزوہ میں نہ شریک ہونے والے دوسرے لوگوں سے ) جنہوں نے معذرت کی تھی اور ان کی معذرت قبول بھی ہو گئی تھی۔ ہم تین صحابہ کا معاملہ بالکل مختلف تھا کہ اللہ تعالیٰ نے ہماری توبہ قبول ہونے کے متعلق وحی نازل کی، لیکن جب ان دوسرے غزوہ میں شریک نہ ہونے والے لوگوں کا ذکر کیا، جنہوں نے آپ صلی اللہ علیہ وسلم کے سامنے جھوٹ بولا تھا اور جھوٹی معذرت کی تھی تو اس درجہ برائی کے ساتھ کیا کہ کسی کا بھی اتنی برائی کے ساتھ ذکر نہ کیا ہو گا۔ اللہ تعالیٰ نے فرمایا «يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله‏» کہ ”یہ لوگ تمہارے سب کے سامنے عذر پیش کریں گے، جب تم ان کے پاس واپس جاؤ گے تو آپ کہہ دیں کہ بہانے نہ بناؤ ہم ہرگز تمہاری بات نہ مانیں گے! بیشک ہم کو اللہ تمہاری خبر دے چکا ہے اور عنقریب اللہ اور اس کا رسول تمہارا عمل دیکھ لیں گے۔“ آخر آیت تک۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 199
			}
		}
	]
}