{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": 4701,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، ان سے عکرمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب اللہ تعالیٰ آسمان میں کوئی فیصلہ فرماتا ہے تو ملائکہ عاجزی سے اپنے پر مارنے لگتے ہیں۔ جیسا کہ اللہ تعالیٰ کے ارشاد میں ہے کہ جیسے کسی صاف چکنے پتھر پر زنجیر کے ( مارنے سے آواز پیدا ہوتی ہے ) اور علی بن عبداللہ المدینی نے بیان کیا کہ سفیان بن عیینہ کے سوا اور راویوں نے «صفوان» کے بعد «ينفذهم ذلك» ( جس سے ان پر دہشت طاری ہوتی ہے ) کے الفاظ کہے ہیں۔ پھر اللہ پاک اپنا حکم فرشتوں تک پہنچا دیتا ہے، جب ان کے دلوں پر سے ڈر جاتا رہتا ہے تو دوسرے دور والے فرشتے نزدیک والے فرشتوں سے پوچھتے ہیں پروردگار نے کیا حکم صادر فرمایا۔ نزدیک والے فرشتے کہتے ہیں بجا ارشاد فرمایا اور وہ اونچا ہے بڑا۔ فرشتوں کی یہ باتیں چوری سے بات اڑانے والے شیطان پا لیتے ہیں۔ یہ بات اڑانے والے شیطان اوپر تلے رہتے ہیں ( ایک پر ایک ) سفیان نے اپنے دائیں ہاتھ کی انگلیاں کھول کر ایک پر ایک کر کے بتلایا کہ اس طرح شیطان اوپر تلے رہ کر وہاں جاتے ہیں۔ پھر بھی کبھی ایسا ہوتا ہے۔ فرشتے خبر پا کر آگ کا شعلہ پھینکتے ہیں وہ بات سننے والے کو اس سے پہلے جلا ڈالتا ہے کہ وہ اپنے پیچھے والے کو وہ بات پہنچا دے۔ کبھی ایسا ہوتا ہے کہ وہ شعلہ اس تک نہیں پہنچتا اور وہ اپنے نیچے والے شیطان کو وہ بات پہنچا دیتا ہے، وہ اس سے نیچے والے کو اس طرح وہ بات زمین تک پہنچا دیتے ہیں۔ یہاں تک کہ زمین تک آ پہنچتی ہے۔ ( کبھی سفیان نے یوں کہا ) پھر وہ بات نجومی کے منہ پر ڈالی جاتی ہے۔ وہ ایک بات میں سو باتیں جھوٹ اپنی طرف سے ملا کر لوگوں سے بیان کرتا ہے۔ کوئی کوئی بات اس کی سچ نکلتی ہے تو لوگ کہنے لگتے ہیں دیکھو اس نجومی نے فلاں دن ہم کو یہ خبر دی تھی کہ آئندہ ایسا ایسا ہو گا اور ویسا ہی ہوا۔ اس کی بات سچ نکلی۔ یہ وہ بات ہوتی ہے جو آسمان سے چرائی گئی تھی۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 223
			}
		}
	]
}