{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو ابوحیان (یحییٰ بن سعید) تیمی نے خبر دی۔ انہیں ابوزرعہ (ہرم) بن عمرو بن جریر نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں گوشت لایا گیا اور دست کا حصہ آپ کو پیش کیا گیا۔ تو آپ نے اپنے دانتوں سے اسے ایک بار نوچا اور نبی کریم صلی اللہ علیہ وسلم کو دست کا گوشت بہت پسند تھا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن میں سب لوگوں کا سردار ہوں گا تمہیں معلوم بھی ہے یہ کون سا دن ہو گا؟ اس دن دنیا کے شروع سے قیامت کے دن تک کی ساری خلقت ایک چٹیل میدان میں جمع ہو گی کہ ایک پکارنے والے کی آواز سب کے کانوں تک پہنچ سکے گی اور ایک نظر سب کو دیکھ سکے گی۔ سورج بالکل قریب ہو جائے گا اور لوگوں کی پریشانی اور بےقراری کی کوئی حد نہ رہے گی جو برداشت سے باہر ہو جائے گی۔ لوگ آپس میں کہیں گے، دیکھتے نہیں کہ ہماری کیا حالت ہو گئی ہے۔ کیا ایسا کوئی مقبول بندہ نہیں ہے جو اللہ پاک کی بارگاہ میں تمہاری شفاعت کرے؟ بعض لوگ بعض سے کہیں گے کہ آدم علیہ السلام کے پاس چلنا چاہئے۔ چنانچہ سب لوگ آدم علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے آپ انسانوں کے پردادا ہیں، اللہ تعالیٰ نے آپ کو اپنے ہاتھ سے پیدا کیا اور اپنی طرف سے خصوصیت کے ساتھ آپ میں روح پھونکی۔ فرشتوں کو حکم دیا اور انہوں نے آپ کو سجدہ کیا اس لیے آپ رب کے حضور میں ہماری شفاعت کر دیں، آپ دیکھ رہے ہیں کہ ہم کس حال کو پہنچ چکے ہیں۔ آدم علیہ السلام کہیں گے کہ میرا رب آج انتہائی غضبناک ہے۔ اس سے پہلے اتنا غضبناک وہ کبھی نہیں ہوا تھا اور نہ آج کے بعد کبھی اتنا غضب ناک ہو گا اور رب العزت نے مجھے بھی درخت سے روکا تھا لیکن میں نے اس کی نافرمانی کی، پس نفسی، نفسی، نفسی مجھ کو اپنی فکر ہے تم کسی اور کے پاس جاؤ۔ ہاں نوح علیہ السلام کے پاس جاؤ۔ چنانچہ سب لوگ نوح علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے، اے نوح! آپ سب سے پہلے پیغمبر ہیں جو اہل زمین کی طرف بھیجے گئے تھے اور آپ کو اللہ نے ”شکر گزار بندہ“ ( عبد شکور ) کا خطاب دیا۔ آپ ہی ہمارے لیے اپنے رب کے حضور میں شفاعت کر دیں، آپ دیکھ رہے ہیں کہ ہم کس حالت کو پہنچ گئے ہیں۔ نوح علیہ السلام بھی کہیں گے کہ میرا رب آج اتنا غضبناک ہے کہ اس سے پہلے کبھی اتنا غضبناک نہیں تھا اور نہ آج کے بعد کبھی اتنا غضبناک ہو گا اور مجھے ایک دعا کی قبولیت کا یقین دلایا گیا تھا جو میں نے اپنی قوم کے خلاف کر لی تھی۔ نفسی، نفسی، نفسی آج مجھ کو اپنے ہی نفس کی فکر ہے تم میرے سوا کسی اور کے پاس جاؤ، ابراہیم علیہ السلام کے پاس جاؤ۔ سب لوگ ابراہیم علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے، اے ابراہیم! آپ اللہ کے نبی اور اللہ کے خلیل ہیں روئے زمین میں منتخب، آپ ہماری شفاعت کیجئے، آپ ملاحظہ فرما رہے ہیں کہ ہم کس حالت کو پہنچ چکے ہیں۔ ابراہیم علیہ السلام بھی کہیں گے کہ آج میرا رب بہت غضبناک ہے؟ اتنا غضبناک نہ وہ پہلے ہوا تھا اور نہ آج کے بعد ہو گا اور میں نے تین جھوٹ بولے تھے ( راوی ) ابوحیان نے اپنی روایت میں تینوں کا ذکر کیا ہے۔ نفسی، نفسی، نفسی مجھ کو اپنے نفس کی فکر ہے۔ میرے سوا کسی اور کے پاس جاؤ۔ ہاں موسیٰ علیہ السلام پاس کے جاؤ۔ سب لوگ موسیٰ علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے اے موسیٰ! آپ اللہ کے رسول ہیں، اللہ تعالیٰ نے آپ کو اپنی طرف سے رسالت اور اپنے کلام کے ذریعہ فضیلت دی۔ آپ ہماری شفاعت اپنے رب کے حضور میں کریں، آپ ملاحظہ فرما سکتے ہیں کہ ہم کس حالت کو پہنچ چکے ہیں۔ موسیٰ علیہ السلام کہیں گے کہ آج اللہ تعالیٰ بہت غضبناک ہے، اتنا غضبناک کہ وہ نہ پہلے کبھی ہوا تھا اور نہ آج کے بعد کبھی ہو گا اور میں نے ایک شخص کو قتل کر دیا تھا، حالانکہ اللہ کی طرف سے مجھے اس کا کوئی حکم نہیں ملا تھا۔ نفسی، نفسی، نفسی بس مجھ کو آج اپنی فکر ہے، میرے سوا کسی اور کے پاس جاؤ۔ ہاں عیسیٰ علیہ السلام کے پاس جاؤ۔ سب لوگ عیسیٰ علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے۔ اے عیسیٰ! آپ اللہ کے رسول اور اس کا کلمہ ہیں جسے اللہ نے مریم علیھا السلام پر ڈالا تھا اور اللہ کی طرف سے روح ہیں، آپ نے بچپن میں ماں کی گود ہی میں لوگوں سے بات کی تھی، ہماری شفاعت کیجئے، آپ ملاحظہ فرما سکتے ہیں کہ ہماری کیا حالت ہو چکی ہے۔ عیسیٰ بھی کہیں گے کہ میرا رب آج اس درجہ غضبناک ہے کہ نہ اس سے پہلے کبھی اتنا غضبناک ہوا تھا اور نہ کبھی ہو گا اور آپ کسی لغزش کا ذکر نہیں کریں گے ( صرف ) اتنا کہیں گے، نفسی، نفسی، نفسی میرے سوا کسی اور کے پاس جاؤ۔ ہاں، محمد ( صلی اللہ علیہ وسلم ) کے پاس جاؤ۔ سب لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوں گے اور عرض کریں گے، اے محمد ( صلی اللہ علیہ وسلم ) ! آپ اللہ کے رسول اور سب سے آخری پیغمبر ہیں اور اللہ تعالیٰ نے آپ کے تمام اگلے پچھلے گناہ معاف کر دیئے ہیں، اپنے رب کے دربار میں ہماری شفاعت کیجئے۔ آپ خود ملاحظہ فرما سکتے ہیں کہ ہم کس حالت کو پہنچ چکے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آخر میں آگے بڑھوں گا اور عرش تلے پہنچ کر اپنے رب عزوجل کے لیے سجدہ میں گر پڑوں گا، پھر اللہ تعالیٰ مجھ پر اپنی حمد اور حسن ثناء کے دروازے کھول دے گا کہ مجھ سے پہلے کسی کو وہ طریقے اور وہ محامد نہیں بتائے تھے۔ پھر کہا جائے گا، اے محمد! اپنا سر اٹھایئے، مانگئے آپ کو دیا جائے گا۔ شفاعت کیجئے، آپ کی شفاعت قبول ہو جائے گی۔ اب میں اپنا سر اٹھاؤں گا اور عرض کروں گا۔ اے میرے رب! میری امت، اے میرے رب! میری امت پر کرم کر، کہا جائے گا اے محمد! اپنی امت کے ان لوگوں کو جن پر کوئی حساب نہیں ہے، جنت کے داہنے دروازے سے داخل کیجئے ویسے انہیں اختیار ہے، جس دروازے سے چاہیں دوسرے لوگوں کے ساتھ داخل ہو سکتے ہیں۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس ذات کی قسم! جس کے ہاتھ میں میری جان ہے۔ جنت کے دروازے کے دونوں کناروں میں اتنا فاصلہ ہے جتنا مکہ اور حمیر میں ہے یا جتنا مکہ اور بصریٰ میں ہے۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 234
			}
		}
	]
}