{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4725,
			"arabicnumber": 4725,
			"text": "ہم سے عبدااللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے عمرو بن دینار نے بیان کیا، کہا کہ مجھے سعید بن جبیر نے خبر دی، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے کہا نوف بکالی کہتا ہے ( جو کعب احبار کا رہیب تھا ) کہ جن موسیٰ کی خضر کے ساتھ ملاقات ہوئی تھی وہ بنی اسرائیل کے ( رسول ) موسیٰ کے علاوہ دوسرے ہیں۔ ( یعنی موسیٰ بن میثا بن افراثیم بن یوسف بن یعقوب ) ابن عباس رضی اللہ عنہما نے کہا دشمن خدا نے غلط کہا۔ مجھ سے ابی بن کعب نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ موسیٰ علیہ السلام بنی اسرائیل کو وعظ سنانے کے لیے کھڑے ہوئے تو ان سے پوچھا گیا کہ انسانوں میں سب سے زیادہ علم کسے ہے؟ انہوں نے فرمایا کہ مجھے۔ اس پر اللہ تعالیٰ نے ان پر غصہ کیا کیونکہ انہوں نے علم کو اللہ تعالیٰ کی طرف منسوب نہیں کیا تھا۔ اللہ تعالیٰ نے انہیں وحی کے ذریعہ بتایا کہ دو دریاؤں ( فارس اور روم ) کے سنگم پر میرا ایک بندہ ہے جو تم سے زیادہ علم رکھتا ہے۔ موسیٰ علیہ السلام نے عرض کیا: اے رب! میں ان تک کیسے پہنچ پاؤں گا؟ اللہ تعالیٰ نے بتایا کہ اپنے ساتھ ایک مچھلی لے لو اور اسے ایک زنبیل میں رکھ لو، وہ جہاں گم ہو جائے ( زندہ ہو کر دریا میں کود جائے ) بس میرا وہ بندہ وہیں ملے گا چنانچہ آپ نے مچھلی لی اور زنبیل میں رکھ کر روانہ ہوئے۔ آپ کے ساتھ آپ کے خادم یوشع بن نون بھی تھے۔ جب یہ دونوں چٹان کے پاس آئے تو سر رکھ کر سو گئے، ادھر مچھلی زنبیل میں تڑپی اور اس سے نکل گئی اور اس نے دریا میں اپنا راستہ پا لیا۔ مچھلی جہاں گری تھی اللہ تعالیٰ نے وہاں پانی کی روانی کو روک دیا اور پانی ایک طاق کی طرح اس پر بن گیا ( یہ حال یوشع اپنی آنکھوں سے دیکھ رہے تھے ) پھر جب موسیٰ علیہ السلام بیدار ہوئے تو یوشع ان کو مچھلی کے متعلق بتانا بھول گئے۔ اس لیے دن اور رات کا جو حصہ باقی تھا اس میں چلتے رہے، دوسرے دن موسیٰ علیہ السلام نے اپنے خادم سے فرمایا کہ اب کھانا لاؤ، ہم کو سفر نے بہت تھکا دیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ موسیٰ علیہ السلام اس وقت تک نہیں تھکے جب تک وہ اس مقام سے نہ گزر چکے جس کا اللہ تعالیٰ نے انہیں حکم دیا تھا۔ اب ان کے خادم نے کہا آپ نے نہیں دیکھا جب ہم چٹان کے پاس تھے تو مچھلی کے متعلق بتانا بھول گیا تھا اور صرف شیطانوں نے یاد رہنے نہیں دیا۔ اس نے تو عجیب طریقہ سے اپنا راستہ بنا لیا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: مچھلی نے تو دریا میں اپنا راستہ لیا اور موسیٰ اور ان کے خادم کو ( مچھلی کا جو نشان پانی میں اب تک موجود تھا ) دیکھ کر تعجب ہوا۔ موسیٰ علیہ السلام نے فرمایا کہ یہ وہی جگہ تھی جس کی تلاش میں ہم تھے، چنانچہ دونوں حضرات پیچھے اسی راستہ سے لوٹے۔ بیان کیا کہ دونوں حضرات پیچھے اپنے نقش قدم پر چلتے چلتے آخر اس چٹان تک پہنچ گئے وہاں انہوں نے دیکھا کہ ایک صاحب ( خضر علیہ السلام ) کپڑے میں لپٹے ہوئے وہاں بیٹھے ہیں۔ موسیٰ علیہ السلام نے انہیں سلام کیا۔ خضر علیہ السلام نے کہا ( تم کون ہو ) تمہارے ملک میں ”سلام“ کہاں سے آ گیا۔ موسیٰ علیہ السلام نے فرمایا کہ میں موسیٰ ہوں۔ پوچھا بنی اسرائیل کے موسیٰ؟ فرمایا کہ جی ہاں۔ آپ کے پاس اس غرض سے حاضر ہوا ہوں تاکہ جو ہدایت کا علم آپ کو حاصل ہے وہ مجھے بھی سکھا دیں۔ خضر علیہ السلام نے فرمایا، موسیٰ! آپ میرے ساتھ صبر نہیں کر سکتے مجھے اللہ تعالیٰ کی طرف سے ایک خاص علم ملا ہے جسے آپ نہیں جانتے، اسی طرح آپ کو اللہ تعالیٰ کی طرف سے جو علم ملا ہے وہ میں نہیں جانتا۔ موسیٰ علیہ السلام نے فرمایا ان شاءاللہ آپ مجھے صابر پائیں گے اور میں کسی معاملے میں آپ کے خلاف نہیں کروں گا۔ خضر علیہ السلام نے فرمایا، اچھا اگر آپ میرے ساتھ چلیں تو کسی چیز کے متعلق سوال نہ کریں یہاں تک کہ میں خود آپ کو اس کے متعلق بتا دوں گا۔ اب یہ دونوں سمندر کے کنارے کنارے روانہ ہوئے اتنے میں ایک کشتی گزری، انہوں نے کشتی والوں سے بات کی کہ انہیں بھی اس پر سوار کر لیں۔ کشتی والوں نے خضر علیہ السلام کو پہچان لیا اور کسی کرایہ کے بغیر انہیں سوار کر لیا۔ جب یہ دونوں کشتی پر بیٹھ گئے تو خضر علیہ السلام نے کلہاڑے سے کشتی کا ایک تختہ نکال ڈالا۔ اس پر موسیٰ علیہ السلام نے دیکھا تو خضر علیہ السلام سے کہا کہ ان لوگوں نے ہمیں بغیر کسی کرایہ کے اپنی کشتی میں سوار کر لیا تھا اور آپ نے انہیں کی کشتی چیر ڈالی تاکہ سارے مسافر ڈوب جائیں۔ بلاشبہ آپ نے یہ بڑا ناگوار کام کیا ہے۔ خضر علیہ السلام نے فرمایا، کیا میں نے آپ سے پہلے ہی نہ کہا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے۔ موسیٰ علیہ السلام نے فرمایا جو بات میں بھول گیا تھا اس پر مجھے معاف کر دیں اور میرے معاملہ میں تنگی نہ کریں۔ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، یہ پہلی مرتبہ موسیٰ علیہ السلام نے بھول کر انہیں ٹوکا تھا۔ راوی نے بیان کیا کہ اتنے میں ایک چڑیا آئی اور اس نے کشتی کے کنارے بیٹھ کر سمندر میں ایک مرتبہ اپنی چونچ ماری تو خضر علیہ السلام نے موسیٰ علیہ السلام سے کہا کہ میرے اور آپ کے علم کی حیثیت اللہ کے علم کے مقابلے میں اس سے زیادہ نہیں ہے جتنا اس چڑیا نے اس سمندر کے پانی سے کم کیا ہے۔ پھر یہ دونوں کشتی سے اتر گئے، ابھی وہ سمندر کے کنارے چل ہی رہے تھے کہ خضر علیہ السلام نے ایک بچہ کو دیکھا جو دوسرے بچوں کے ساتھ کھیل رہا تھا۔ آپ نے اس بچے کا سر اپنے ہاتھ میں دبایا اور اسے ( گردن سے ) اکھاڑ دیا اور اس کی جان لے لی۔ موسیٰ علیہ السلام اس پر بولے، آپ نے ایک بےگناہ کی جان بغیر کسی جان کے بدلے کے لے لی، یہ آپ نے بڑا ناپسند کام کیا۔ خضر علیہ السلام نے فرمایا کہ میں تو پہلے ہی کہہ چکا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے۔ سفیان بن عیینہ ( راوی حدیث ) نے کہا اور یہ کام تو پہلے سے بھی زیادہ سخت تھا۔ موسیٰ علیہ السلام نے آخر اس مرتبہ بھی معذرت کی کہ اگر میں نے اس کے بعد پھر آپ سے سوال کیا تو آپ مجھے ساتھ نہ رکھئے گا۔ آپ میرا باربار عذر سن چکے ہیں ( اس کے بعد میرے لیے بھی عذر کا کوئی موقع نہ رہے گا ) پھر دونوں روانہ ہوئے، یہاں تک کہ ایک بستی میں پہنچے اور بستی والوں سے کہا کہ ہمیں اپنا مہمان بنا لو، لیکن انہوں نے میزبانی سے انکار کیا، پھر انہیں بستی میں ایک دیوار دکھائی دی جو بس گرنے ہی والی تھی۔ بیان کیا کہ دیوار جھک رہی تھی۔ خضر علیہ السلام کھڑے ہو گئے اور دیوار اپنے ہاتھ سے سیدھی کر دی۔ موسیٰ علیہ السلام نے فرمایا کہ ان لوگوں کے یہاں ہم آئے اور ان سے کھانے کے لیے کہا، لیکن انہوں نے ہماری میزبانی سے انکار کیا، اگر آپ چاہتے تو دیوار کے اس سیدھا کرنے کے کام پر اجرت لے سکتے تھے۔ خضر علیہ السلام نے فرمایا کہ بس اب میرے اور آپ کے درمیان جدائی ہے، اللہ تعالیٰ کے ارشاد «ذلك تأويل ما لم تسطع عليه صبرا‏» تک۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ہم تو چاہتے تھے کہ موسیٰ نے صبر کیا ہوتا تاکہ اللہ تعالیٰ ان کے اور واقعات ہم سے بیان کرتا۔ سعید بن جبیر نے بیان کیا کہ عبداللہ بن عباس رضی اللہ عنہما اس آیت کی تلاوت کرتے تھے ( جس میں خضر علیہ السلام نے اپنے کاموں کی وجہ بیان کی ہے کہ ) کشتی والوں کے آگے ایک بادشاہ تھا جو ہر اچھی کشتی کو چھین لیا کرتا تھا اور اس کی بھی آپ تلاوت کرتے تھے کہ اور وہ غلام ( جس کی گردن خضر علیہ السلام نے توڑ دی تھی ) تو وہ ( اللہ کے علم میں ) کافر تھا اور اس کے والدین مومن تھے۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 247
			}
		}
	]
}