{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4745,
			"arabicnumber": 4745,
			"text": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے محمد بن یوسف فریابی نے، کہا ہم سے امام اوزاعی نے، کہا کہ مجھ سے زہری نے بیان کیا۔ ان سے سہل بن سعد نے بیان کیا کہ عویمر بن حارث بن زید بن جد بن عجلان عاصم بن عدی کے پاس آئے۔ عاصم بنی عجلان کے سردار تھے۔ انہوں نے آپ سے کہا کہ آپ لوگوں کا ایک ایسے شخص کے بارے میں کیا خیال ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو پا لیتا ہے کیا وہ اسے قتل کر دے؟ لیکن تم پھر اسے قصاص میں قتل کر دو گے! آخر ایسی صورت میں انسان کیا طریقہ اختیار کرے؟ رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھ کے مجھے بتائیے۔ چنانچہ عاصم، نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا: یا رسول اللہ! ( صورت مذکورہ میں خاوند کیا کرے ) نبی کریم صلی اللہ علیہ وسلم نے ان مسائل ( میں سوال و جواب ) کو ناپسند فرمایا۔ جب عویمر نے ان سے پوچھا تو انہوں نے بتا دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان مسائل کو ناپسند فرمایا ہے۔ عویمر نے ان سے کہا کہ واللہ میں خود نبی کریم صلی اللہ علیہ وسلم سے اسے پوچھوں گا۔ چنانچہ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا۔ یا رسول اللہ! ایک شخص اپنی بیوی کے ساتھ ایک غیر مرد کو دیکھتا ہے کیا وہ اس کو قتل کر دے؟ لیکن پھر آپ قصاص میں اس کو قتل کریں گے۔ ایسی صورت میں اس کو کیا کرنا چاہئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے تمہارے اور تمہاری بیوی کے بارے میں قرآن کی آیت اتاری ہے۔ پھر آپ نے انہیں قرآن کے بتائے ہوئے طریقہ کے مطابق لعان کا حکم دیا۔ اور عویمر نے اپنی بیوی کے ساتھ لعان کیا، پھر انہوں نے کہا: یا رسول اللہ! اگر میں اپنی بیوی کو روکے رکھوں تو میں ظالم ہوں گا۔ اس لیے عویمر نے اسے طلاق دے دی۔ اس کے لعان کے بعد میاں بیوی میں جدائی کا طریقہ جاری ہو گیا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ دیکھتے رہو اگر اس عورت کے کالا، بہت کالی پتلیوں والا، بھاری سرین اور بھری ہوئی پنڈلیوں والا بچہ پیدا ہو تو میرا خیال ہے کہ عویمر نے الزام غلط نہیں لگایا ہے۔ لیکن اگر سرخ سرخ گر گٹ جیسا پیدا ہو تو میرا خیال ہے کہ عویمر نے غلط الزام لگایا ہے۔ اس کے بعد ان عورت کے جو بچہ پیدا ہوا وہ انہیں صفات کے مطابق تھا جو نبی کریم صلی اللہ علیہ وسلم نے بیان کی تھیں اور جس سے عویمر کی تصدیق ہوتی تھی۔ چنانچہ اس لڑکے کا نسب اس کی ماں کی طرف رکھا گیا۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 267
			}
		}
	]
}