{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4757,
			"arabicnumber": 4757,
			"text": "اور ابواسامہ حماد بن اسامہ نے ہشام بن عروہ سے بیان کیا کہ انہوں نے کہا کہ مجھے میرے والد عروہ بن زبیر نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ جب میرے متعلق ایسی باتیں کہی گئیں جن کا مجھے گمان بھی نہیں تھا تو رسول اللہ صلی اللہ علیہ وسلم میرے معاملہ میں لوگوں کو خطبہ دینے کے لیے کھڑے ہوئے۔ آپ صلی اللہ علیہ وسلم نے شہادت کے بعد اللہ کی حمد و ثنا اس کی شان کے مطابق بیان کی، پھر فرمایا، امابعد! تم لوگ مجھے ایسے لوگوں کے بارے میں مشورہ دو جنہوں نے میری بیوی کو بدنام کیا ہے اور اللہ کی قسم! کہ میں نے اپنی بیوی میں کوئی برائی نہیں دیکھی اور تہمت بھی ایسے شخص ( صفوان بن معطل ) کے ساتھ لگائی ہے کہ اللہ کی قسم! ان میں بھی میں نے کبھی کوئی برائی نہیں دیکھی۔ وہ میرے گھر میں جب بھی داخل ہوا تو میری موجودگی ہی میں داخل ہوا اور اگر میں کبھی سفر کی وجہ سے مدینہ نہیں ہوتا تو وہ بھی نہیں ہوتا اور وہ میرے ساتھ ہی رہتے ہیں۔ اس کے بعد سعد بن معاذ رضی اللہ عنہ کھڑے ہوئے اور عرض کیا: یا رسول اللہ! ہمیں حکم فرمایئے کہ ہم ایسے مردود لوگوں کی گردنیں اڑا دیں۔ اس کے بعد قبیلہ خزرج کے ایک صاحب ( سعد بن عبادہ ) کھڑے ہوئے، حسان بن ثابت کی والدہ اسی قبیلہ خزرج سے تھیں، انہوں نے کھڑے ہو کر کہا کہ تم جھوٹے ہو، اگر وہ لوگ ( تہمت لگانے والے ) قبیلہ اوس کے ہوتے تو تم کبھی انہیں قتل کرنا پسند نہ کرتے۔ نوبت یہاں تک پہنچی کہ مسجد ہی میں اوس و خزرج کے قبائل میں باہم فساد کا خطرہ ہو گیا، اس فساد کی مجھ کو کچھ خبر نہ تھی، اسی دن کی رات میں، میں قضائے حاجت کے لیے باہر نکلی، میرے ساتھ ام مسطح بھی تھیں۔ وہ ( راستے میں ) پھسل گئیں اور ان کی زبان سے نکلا کہ مسطح کو اللہ غارت کرے۔ میں نے کہا، آپ اپنے بیٹے کو کوستی ہیں، اس پر وہ خاموش ہو گئیں، پھر دوبارہ وہ پھسلیں اور ان کی زبان سے وہی الفاظ نکلے کہ مسطح کو اللہ غارت کرے۔ میں نے پھر کہا کہ اپنے بیٹے کو کوستی ہو، پھر وہ تیسری مرتبہ پھسلیں تو میں نے پھر انہیں ٹوکا۔ انہوں نے بتایا کہ اللہ کی قسم! میں تو تیری ہی وجہ سے اسے کوستی ہوں۔ میں نے کہا کہ میرے کس معاملہ میں انہیں آپ کوس رہی ہیں؟ بیان کیا۔ کہ اب انہوں نے طوفان کا سارا قصہ بیان کیا میں نے پوچھا، کیا واقعی یہ سب کچھ کہا گیا ہے؟ انہوں نے کہا کہ ہاں، اللہ کی قسم! پھر میں اپنے گھر گئی۔ لیکن ( ان واقعات کو سن کر غم کا یہ حال تھا کہ ) مجھے کچھ خبر نہیں کہ کس کام کے لیے میں باہر گئی تھی اور کہاں سے آئی ہوں، ذرہ برابر بھی مجھے اس کا احساس نہیں رہا۔ اس کے بعد مجھے بخار چڑھ گیا اور میں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ آپ مجھے ذرا میرے والد کے گھر پہنچوا دیجئیے۔ آپ صلی اللہ علیہ وسلم نے میرے ساتھ ایک بچہ کو کر دیا۔ میں گھر پہنچی تو میں نے دیکھا کہ ام رومان نیچے کے حصہ میں ہیں اور ابوبکر رضی اللہ عنہ بالاخانے میں قرآن پڑھ رہے ہیں۔ والدہ نے پوچھا بیٹی اس وقت کیسے آ گئیں۔ میں نے وجہ بتائی اور واقعہ کی تفصیلات سنائیں ان باتوں سے جتنا غم مجھ کو تھا ایسا معلوم ہوا کہ ان کو اتنا غم نہیں ہے۔ انہوں نے فرمایا، بیٹی اتنا فکر کیوں کرتی ہو کم ہی ایسی کوئی خوبصورت عورت کسی ایسے مرد کے نکاح میں ہو گی جو اس سے محبت رکھتا ہو اور اس کی سوکنیں بھی ہوں اور وہ اس سے حسد نہ کریں اور اس میں سو عیب نہ نکالیں۔ اس تہمت سے وہ اس درجہ بالکل بھی متاثر نہیں معلوم ہوتی تھیں جتنا میں متاثر تھی۔ میں نے پوچھا والد کے علم میں بھی یہ باتیں آ گئیں ہیں؟ انہوں نے کہا کہ ہاں، میں نے پوچھا اور رسول اللہ صلی اللہ علیہ وسلم کے؟ انہوں نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم کے بھی علم میں سب کچھ ہے۔ میں یہ سن کر رونے لگی تو ابوبکر رضی اللہ عنہ نے بھی میری آواز سن لی، وہ گھر کے بالائی حصہ میں قرآن پڑھ رہے تھے، اتر کر نیچے آئے اور والدہ سے پوچھا کہ اسے کیا ہو گیا ہے؟ انہوں نے کہا کہ وہ تمام باتیں اسے بھی معلوم ہو گئی ہیں جو اس کے متعلق کہی جا رہی ہیں۔ ان کی بھی آنکھیں بھر آئیں اور فرمایا: بیٹی! تمہیں قسم دیتا ہوں، اپنے گھر واپس چلی جاؤ چنانچہ میں واپس چلی آئی۔ ( جب میں اپنے والدین کے گھر آ گئی تھی تو ) رسول اللہ صلی اللہ علیہ وسلم میرے حجرہ میں تشریف لائے تھے اور میری خادمہ ( بریرہ ) سے میرے متعلق پوچھا تھا۔ اس نے کہا تھا کہ نہیں، اللہ کی قسم! میں ان کے اندر کوئی عیب نہیں جانتی، البتہ ایسا ہو جایا کرتا تھا ( کم عمری کی غفلت کی وجہ سے ) کہ ( آٹا گوندھتے ہوئے ) سو جایا کرتیں اور بکری آ کر ان کا گندھا ہوا آٹا کھا جاتی۔ رسول اللہ صلی اللہ علیہ وسلم کے بعض صحابہ نے ڈانٹ کر ان سے کہا کہ نبی کریم صلی اللہ علیہ وسلم کو بات صحیح صحیح کیوں نہیں بتا دیتی۔ پھر انہوں نے کھول کر صاف لفظوں میں ان سے واقعہ کی تصدیق چاہی۔ اس پر وہ بولیں کہ سبحان اللہ، میں تو عائشہ رضی اللہ عنہا کو اس طرح جانتی ہوں جس طرح سنار کھرے سونے کو جانتا ہے۔ اس تہمت کی خبر جب ان صاحب کو معلوم ہوئی جن کے ساتھ تہمت لگائی گئی تھی تو انہوں نے کہا کہ سبحان اللہ، اللہ کی قسم! کہ میں نے آج تک کسی ( غیر ) عورت کا کپڑا نہیں کھولا۔ عائشہ رضی اللہ عنہا نے کہا کہ پھر انہوں نے اللہ کے راستے میں شہادت پائی۔ بیان کیا کہ صبح کے وقت میرے والدین میرے پاس آ گئے اور میرے پاس ہی رہے۔ آخر عصر کی نماز سے فارغ ہو کر رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لائے۔ میرے والدین مجھے دائیں اور بائیں طرف سے پکڑے ہوئے تھے، نبی کریم صلی اللہ علیہ وسلم نے اللہ کی حمد و ثنا کی اور فرمایا: امابعد! اے عائشہ! اگر تم نے واقعی کوئی برا کام کیا ہے اور اپنے اوپر ظلم کیا ہے تو پھر اللہ سے توبہ کرو، کیونکہ اللہ اپنے بندوں کی توبہ قبول کرتا ہے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک انصاری خاتون بھی آ گئی تھیں اور دروازے پر بیٹھی ہوئی تھیں، میں نے عرض کی، آپ ان خاتون کا لحاظ نہیں فرماتے کہیں یہ ( اپنی سمجھ کے مطابق کوئی الٹی سیدھی ) بات باہر کہہ دیں۔ پھر نبی کریم صلی اللہ علیہ وسلم نے نصیحت فرمائی، اس کے بعد میں اپنے والد کی طرف متوجہ ہوئی اور ان سے عرض کیا کہ آپ ہی جواب دیجئیے، انہوں نے بھی یہی کہا کہ میں کیا کہوں جب کسی نے میری طرف سے کچھ نہیں کہا تو میں نے شہادت کے بعد اللہ کی شان کے مطابق اس کی حمد و ثنا کی اور کہا: امابعد! اللہ کی قسم! اگر میں آپ لوگوں سے یہ کہوں کہ میں نے اس طرح کی کوئی بات نہیں کی اور اللہ عزوجل گواہ ہے کہ میں اپنے اس دعوے میں سچی ہوں، تو آپ لوگوں کے خیال کو بدلنے میں میری یہ بات مجھے کوئی نفع نہیں پہنچائے گی، کیونکہ یہ بات آپ لوگوں کے دل میں رچ بس گئی ہے اور اگر میں یہ کہہ دوں کہ میں نے واقعتاً یہ کام کیا ہے حالانکہ اللہ خوب جانتا ہے کہ میں نے ایسا نہیں کیا ہے، تو آپ لوگ کہیں گے کہ اس نے تو جرم کا اقرار کر لیا ہے۔ اللہ کی قسم! میری اور آپ لوگوں کی مثال یوسف علیہ السلام کے والد کی سی ہے کہ انہوں نے فرمایا تھا «فصبر جميل والله المستعان على ما تصفون‏» ”پس صبر ہی اچھا ہے اور تم لوگ جو کچھ بیان کرتے ہو اس پر اللہ ہی مدد کرے۔“ میں نے ذہن پر بہت زور دیا کہ یعقوب علیہ السلام کا نام یاد آ جائے لیکن نہیں یاد آیا۔ اسی وقت رسول اللہ صلی اللہ علیہ وسلم پر وحی کا نزول شروع ہو گیا اور ہم سب خاموش ہو گئے۔ پھر آپ سے یہ کیفیت ختم ہوئی تو میں نے دیکھا کہ خوشی نبی کریم صلی اللہ علیہ وسلم کے چہرہ مبارک سے ظاہر ہو رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے ( پسینہ سے ) اپنی پیشانی صاف کرتے ہوئے فرمایا کہ عائشہ! تمہیں بشارت ہو اللہ تعالیٰ نے تمہاری پاکی نازل کر دی ہے۔ بیان کیا کہ اس وقت مجھے بڑا غصہ آ رہا تھا۔ میرے والدین نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے کھڑی ہو جاؤ، میں نے کہا کہ اللہ کی قسم! میں نبی کریم صلی اللہ علیہ وسلم کے سامنے کھڑی نہیں ہوں گی نہ آپ کا شکریہ ادا کروں گی اور نہ آپ لوگوں کا شکریہ ادا کروں گی، میں تو صرف اللہ کا شکر ادا کروں گی جس نے میری برات نازل کی ہے۔ آپ لوگوں نے تو یہ افواہ سنی اور اس کا انکار بھی نہ کر سکے، اس کے ختم کرنے کی بھی کوشش نہیں کی۔ عائشہ رضی اللہ عنہا فرماتی تھیں کہ زینب بنت جحش کو اللہ تعالیٰ نے ان کی دینداری کی وجہ سے اس تہمت میں پڑنے سے بچا لیا۔ میری بابت انہوں نے خیر کے سوا اور کوئی بات نہیں کہی، البتہ ان کی بہن حمنہ ہلاک ہونے والوں کے ساتھ ہلاک ہوئیں۔ اس طوفان کو پھیلانے میں مسطح اور حسان اور منافق عبداللہ بن ابی نے حصہ لیا تھا۔ عبداللہ بن ابی منافق ہی تو کھود کھود کر اس کو پوچھتا اور اس پر حاشیہ چڑھاتا، وہی اس طوفان کا بانی مبانی تھا۔ «وهو الذي تولى كبره» سے وہ اور حمنہ مراد ہیں۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ابوبکر رضی اللہ عنہ نے قسم کھائی کہ مسطح کو کوئی فائدہ آئندہ کبھی وہ نہیں پہنچائیں گے۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «ولا يأتل أولو الفضل منكم‏» ”اور جو لوگ تم میں بزرگی والے اور فراخ دست ہیں“ الخ، اس سے مراد ابوبکر رضی اللہ عنہ ہیں۔ ”وہ قرابت والوں اور مسکینوں کو“ اس سے مراد مسطح ہیں۔ ( دینے سے قسم نہ کھا بیٹھیں ) اللہ تعالیٰ کے ارشاد «ألا تحبون أن يغفر الله لكم والله غفور رحيم‏» ”کیا تم یہ نہیں چاہتے کہ اللہ تمہارے قصور معاف کرتا رہے، بیشک اللہ بڑی مغفرت کرنے والا بڑا ہی مہربان ہے“ تک۔ چنانچہ ابوبکر رضی اللہ عنہ نے کہا کہ ہاں، اللہ کی قسم! اے ہمارے رب! ہم تو اسی کے خواہشمند ہیں کہ تو ہماری مغفرت فرما۔ پھر وہ پہلے کی طرح مسطح کو جو دیا کرتے تھے وہ جاری کر دیا۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 279
			}
		}
	]
}