{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4774,
			"arabicnumber": 4774,
			"text": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے منصور اور اعمش نے بیان کیا، ان سے ابوالضحیٰ نے، ان سے مسروق نے بیان کیا کہ ایک شخص نے قبیلہ کندہ میں وعظ بیان کرتے ہوئے کہا کہ قیامت کے دن ایک دھواں اٹھے گا جس سے منافقوں کے آنکھ کان بالکل بیکار ہو جائیں گے لیکن مومن پر اس کا اثر صرف زکام جیسا ہو گا۔ ہم اس کی بات سے بہت گھبرا گئے۔ پھر میں ابن مسعود رضی اللہ عنہ کی خدمت میں حاضر ہوا ( اور انہیں ان صاحب کی یہ بات سنائی ) وہ اس وقت ٹیک لگائے بیٹھے تھے، اسے سن کر بہت غصہ ہوئے اور سیدھے بیٹھ گئے۔ پھر فرمایا کہ اگر کسی کو کسی بات کا واقعی علم ہے تو پھر اسے بیان کرنا چاہئے لیکن اگر علم نہیں ہے تو کہہ دینا چاہئے کہ اللہ زیادہ جاننے والا ہے۔ یہ بھی علم ہی ہے کہ آدمی اپنی لاعلمی کا اقرار کر لے اور صاف کہہ دے کہ میں نہیں جانتا۔ اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم سے فرمایا تھا «قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏» ”آپ کہہ دیجئیے کہ میں اپنی تبلیغ و دعوت پر تم سے کوئی اجر نہیں چاہتا اور نہ میں بناوٹ کرتا ہوں۔“ اصل میں واقعہ یہ ہے کہ قریش کسی طرح اسلام نہیں لاتے تھے۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے ان کے حق میں بددعا کی کہ اے اللہ! ان پر یوسف علیہ السلام کے زمانے جیسا قحط بھیج کر میری مدد کر پھر ایسا قحط پڑا کہ لوگ تباہ ہو گئے اور مردار اور ہڈیاں کھانے لگے کوئی اگر فضا میں دیکھتا ( تو فاقہ کی وجہ سے ) اسے دھویں جیسا نظر آتا۔ پھر ابوسفیان آئے اور کہا کہ اے محمد! آپ ہمیں صلہ رحمی کا حکم دیتے ہیں لیکن آپ کی قوم تباہ ہو رہی ہے، اللہ سے دعا کیجئے ( کہ ان کی یہ مصیبت دور ہو ) ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے یہ آیت پڑھی «فارتقب يوم تأتي السماء بدخان مبين‏» سے «عائدون‏» تک۔ ابن مسعود رضی اللہ عنہ نے بیان کیا کہ قحط کا یہ عذاب تو نبی کریم صلی اللہ علیہ وسلم کی دعا کے نتیجہ میں ختم ہو گیا تھا لیکن کیا آخرت کا عذاب بھی ان سے ٹل جائے گا؟ چنانچہ قحط ختم ہونے کے بعد پھر وہ کفر سے باز نہ آئے، اس کی طرف اشارہ «يوم نبطش البطشة الكبرى‏» میں ہے، یہ بطش کفار پر غزوہ بدر کے موقع پر نازل ہوئی تھی ( کہ ان کے بڑے بڑے سردار قتل کر دیئے گئے ) اور «لزاما» ( قید ) سے اشارہ بھی معرکہ بدر ہی کی طرف ہے «الم * غلبت الروم‏» سے «سيغلبون‏» تک کا واقعہ گزر چکا ہے کہ ( کہ روم والوں نے فارس والوں پر فتح پالی تھی ) ۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 296
			}
		}
	]
}