{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4844,
			"arabicnumber": 4844,
			"text": "ہم سے احمد بن اسحاق سلمی نے بیان کیا، کہا ہم سے یعلیٰ نے، کہا ہم سے عبدالعزیز بن سیاہ نے، ان سے حبیب بن ثابت نے، کہ میں ابووائل رضی اللہ عنہ کی خدمت میں ایک مسئلہ پوچھنے کے لیے ( خوارج کے متعلق ) گیا، انہوں نے فرمایا کہ ہم مقام صفین میں پڑاؤ ڈالے ہوئے تھے ( جہاں علی اور معاویہ رضی اللہ عنہما کی جنگ ہوئی تھی ) ایک شخص نے کہا کہ آپ کا کیا خیال ہے اگر کوئی شخص کتاب اللہ کی طرف صلح کے لیے بلائے؟ علی رضی اللہ عنہ نے فرمایا ٹھیک ہے۔ لیکن خوارج نے معاویہ رضی اللہ عنہ کے خلاف علی رضی اللہ عنہ کے ساتھ تھے اس کے خلاف آواز اٹھائی۔ اس پر سہل بن حنیف نے فرمایا تم پہلے اپنا جائزہ لو۔ ہم لوگ حدیبیہ کے موقع پر موجود تھے آپ کی مراد اس صلح سے تھی جو مقام حدیبیہ میں نبی کریم صلی اللہ علیہ وسلم اور مشرکین کے درمیان ہوئی تھی اور جنگ کا موقع آتا تو ہم اس سے پیچھے ہٹنے والے نہیں تھے۔ ( لیکن صلح کی بات چلی تو ہم نے اس میں بھی صبر و ثبات کا دامن ہاتھ سے نہیں چھوڑا ) اتنے میں عمر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کیا ہم حق پر نہیں ہیں؟ اور کیا کفار باطل پر نہیں ہیں؟ کیا ہمارے مقتولین جنت میں نہیں جائیں گے اور کیا ان کے مقتولین دوزخ میں نہیں جائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیوں نہیں! عمر رضی اللہ عنہ نے کہا پھر ہم اپنے دین کے بارے میں ذلت کا مظاہرہ کیوں کریں ( یعنی دب کر صلح کیوں کریں ) اور کیوں واپس جائیں، جبکہ اللہ تعالیٰ نے ہمیں اس کا حکم فرمایا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: اے ابن خطاب! میں اللہ کا رسول ہوں اور اللہ تعالیٰ مجھے کبھی ضائع نہیں کرے گا۔ عمر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے پاس سے واپس آ گئے ان کو غصہ آ رہا تھا، صبر نہیں آیا اور ابوبکر رضی اللہ عنہ کے پاس آئے اور کہا، اے ابوبکر! کیا ہم حق پر اور وہ باطل پر نہیں ہیں؟ ابوبکر نے بھی وہی جواب دیا کہ اے ابن خطاب! نبی کریم صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور اللہ انہیں ہرگز ضائع نہیں کرے گا۔ پھر سورۃ الفتح نازل ہوئی۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 365
			}
		}
	]
}