{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4913,
			"arabicnumber": 4913,
			"text": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، ان سے یحییٰ نے، ان سے عبید بن حنین نے کہ انہوں نے ابن عباس رضی اللہ عنہما کو حدیث بیان کرتے ہوئے سنا، انہوں نے کہا ایک آیت کے متعلق عمر بن خطاب رضی اللہ عنہ سے پوچھنے کے لیے ایک سال تک میں تردد میں رہا، ان کا اتنا ڈر غالب تھا کہ میں ان سے نہ پوچھ سکا۔ آخر وہ حج کے لیے گئے تو میں بھی ان کے ساتھ ہو لیا، واپسی میں جب ہم راستہ میں تھے تو رفع حاجت کے لیے وہ پیلو کے درخت میں گئے۔ بیان کیا کہ میں ان کے انتظار میں کھڑا رہا جب وہ فارغ ہو کر آئے تو پھر میں ان کے ساتھ چلا اس وقت میں نے عرض کیا۔ امیرالمؤمنین! امہات المؤمنین میں وہ کون دو عورتیں تھیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے لیے متفقہ منصوبہ بنایا تھا؟ انہوں نے بتلایا کہ حفصہ اور عائشہ رضی اللہ عنہما تھیں۔ بیان کیا کہ میں نے عرض کیا اللہ کی قسم میں یہ سوال آپ سے کرنے کے لیے ایک سال سے ارادہ کر رہا تھا لیکن آپ کے رعب کی وجہ سے پوچھنے کی ہمت نہیں ہوتی تھی۔ عمر رضی اللہ عنہ نے کہا ایسا نہ کیا کرو جس مسئلہ کے متعلق تمہارا خیال ہو کہ میرے پاس اس سلسلے میں کوئی علم ہے تو اسے پوچھ لیا کرو، اگر میرے پاس اس کا کوئی علم ہو گا تو تمہیں بتا دیا کروں گا۔ بیان کیا کہ عمر رضی اللہ عنہ نے کہا: اللہ کی قسم! جاہلیت میں ہماری نظر میں عورتوں کی کوئی عزت نہ تھی۔ یہاں تک کہ اللہ تعالیٰ نے ان کے بارے میں وہ احکام نازل کئے جو نازل کرنے تھے اور ان کے حقوق مقرر کئے جو مقرر کرنے تھے۔ بتلایا کہ ایک دن میں سوچ رہا تھا کہ میری بیوی نے مجھ سے کہا کہ بہتر ہے اگر تم اس معاملہ کا فلاں فلاں طرح کرو، میں نے کہا تمہارا اس میں کیا کام۔ معاملہ مجھ سے متعلق ہے تم اس میں دخل دینے والی کون ہوتی ہو؟ میری بیوی نے اس پر کہا: خطاب کے بیٹے! تمہارے اس طرز عمل پر حیرت ہے تم اپنی باتوں کا جواب برداشت نہیں کر سکتے تمہاری لڑکی ( حفصہ ) تو رسول اللہ صلی اللہ علیہ وسلم کو بھی جواب دے دیتی ہیں ایک دن تو اس نے نبی کریم صلی اللہ علیہ وسلم کو غصہ بھی کر دیا تھا۔ یہ سن کر عمر رضی اللہ عنہ کھڑے ہو گئے اور اپنی چادر اوڑھ کر حفصہ کے گھر پہنچے اور فرمایا بیٹی! کیا تم رسول اللہ صلی اللہ علیہ وسلم کی باتوں کا جواب دے دیتی ہو یہاں تک کہ ایک دن تم نے نبی کریم صلی اللہ علیہ وسلم کو دن بھر ناراض بھی رکھا ہے۔ حفصہ رضی اللہ عنہا نے عرض کیا: جی ہاں، اللہ کی قسم! ہم نبی کریم صلی اللہ علیہ وسلم کو کبھی جواب دے دیتے ہیں۔ عمر رضی اللہ عنہ نے کہا کہ میں نے کہا جان لو میں تمہیں اللہ کی سزا اور اس کے رسول کی سزا ( ناراضگی ) سے ڈراتا ہوں۔ بیٹی! اس عورت کی وجہ سے دھوکا میں نہ آ جانا جس نے نبی کریم صلی اللہ علیہ وسلم کی محبت حاصل کر لی ہے۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا کہا کہ پھر میں وہاں سے نکل کر ام المؤمنین ام سلمہ رضی اللہ عنہا کے پاس آیا کیونکہ وہ بھی میری رشتہ دار تھیں۔ میں نے ان سے بھی گفتگو کی انہوں نے کہا ابن خطاب! تعجب ہے کہ آپ ہر معاملہ میں دخل اندازی کرتے ہیں اور آپ چاہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم اور ان کی ازواج کے معاملات میں بھی دخل دیں۔ اللہ کی قسم! انہوں نے میری ایسی گرفت کی کہ میرے غصہ کو ٹھنڈا کر کے رکھ دیا، میں ان کے گھر سے باہر نکل آیا۔ میرے ایک انصاری دوست تھے، جب میں نبی کریم صلی اللہ علیہ وسلم کی مجلس میں حاضر نہ ہوتا تو وہ مجلس کی تمام باتیں مجھ سے آ کر بتایا کرتے اور جب وہ حاضر نہ ہوتے تو میں انہیں آ کر بتایا کرتا تھا۔ اس زمانہ میں ہمیں غسان کے بادشاہ کی طرف سے ڈر تھا اطلاع ملی تھی کہ وہ مدینہ پر چڑھائی کرنے کا ارادہ کر رہا ہے، اس زمانہ میں کئی عیسائی اور ایرانی بادشاہ ایسا غلط گھمنڈ رکھتے تھے کہ یہ مسلمان کیا ہیں ہم جب چاہیں گے ان کا صفایا کر دیں گے مگر یہ سارے خیالات غلط ثابت ہوئے اللہ نے اسلام کو غالب کیا۔ چنانچہ ہم کو ہر وقت یہی خطرہ رہتا تھا، ایک دن اچانک میرے انصاری دوست نے دروازہ کھٹکھٹایا اور کہا کھولو! کھولو! کھولو! میں نے کہا معلوم ہوتا ہے غسانی آ گئے۔ انہوں نے کہا بلکہ اس سے بھی زیادہ اہم معاملہ پیش آ گیا ہے، وہ یہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں سے علیحدگی اختیار کر لی ہے۔ میں نے کہا حفصہ اور عائشہ رضی اللہ عنہما کی ناک غبار آلود ہو۔ چنانچہ میں نے اپنا کپڑا پہنا اور باہر نکل آیا۔ میں جب پہنچا تو نبی کریم صلی اللہ علیہ وسلم اپنے بالاخانہ میں تشریف رکھتے تھے جس پر سیڑھی سے چڑھا جاتا تھا۔ نبی کریم کا ایک حبشی غلام ( رباح ) سیڑھی کے سرے پر موجود تھا، میں نے کہا: نبی کریم صلی اللہ علیہ وسلم سے عرض کرو کہ عمر بن خطاب آیا ہے اور اندر آنے کی اجازت چاہتا ہے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچ کر اپنا سارا واقعہ سنایا۔ جب میں ام سلمہ رضی اللہ عنہما کی گفتگو پر پہنچا تو آپ کو ہنسی آ گئی۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کھجور کی ایک چٹائی پر تشریف رکھتے تھے آپ صلی اللہ علیہ وسلم کے جسم مبارک اور اس چٹائی کے درمیان کوئی اور چیز نہیں تھی آپ کے سر کے نیچے ایک چمڑے کا تکیہ تھا۔ جس میں کھجور کی چھال بھری ہوئی تھی۔ پاؤں کی طرف کیکر کے پتوں کا ڈھیر تھا اور سر کی طرف مشکیزہ لٹک رہا تھا۔ میں نے چٹائی کے نشانات آپ کے پہلو پر دیکھے تو رو پڑا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، کس بات پر رونے لگے ہو میں نے عرض کی یا رسول اللہ! قیصر و کسریٰ کو دنیا کا ہر طرح کا آرام مل رہا ہے آپ اللہ کے رسول ہیں ( آپ پھر ایسی تنگ زندگی گزارتے ہیں ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا تم اس پر خوش نہیں ہو کہ ان کے حصہ میں دنیا ہے اور ہمارے حصہ میں آخرت ہے۔",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 433
			}
		}
	]
}