{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "ہم سے مسدد نے بیان کیا، انہوں نے کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم کو ابوحیان تیمی نے ابوزرعہ سے خبر دی، انہوں نے ابوہریرہ رضی اللہ عنہ سے نقل کیا کہ ایک دن نبی کریم صلی اللہ علیہ وسلم لوگوں میں تشریف فرما تھے کہ آپ کے پاس ایک شخص آیا اور پوچھنے لگا کہ ایمان کسے کہتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایمان یہ ہے کہ تم اللہ پاک کے وجود اور اس کی وحدانیت پر ایمان لاؤ اور اس کے فرشتوں کے وجود پر اور اس ( اللہ ) کی ملاقات کے برحق ہونے پر اور اس کے رسولوں کے برحق ہونے پر اور مرنے کے بعد دوبارہ اٹھنے پر ایمان لاؤ۔ پھر اس نے پوچھا کہ اسلام کیا ہے؟ آپ صلی اللہ علیہ وسلم نے پھر جواب دیا کہ اسلام یہ ہے کہ تم خالص اللہ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ بناؤ اور نماز قائم کرو۔ اور زکوٰۃ فرض ادا کرو۔ اور رمضان کے روزے رکھو۔ پھر اس نے احسان کے متعلق پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا احسان یہ کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اگر یہ درجہ نہ حاصل ہو تو پھر یہ تو سمجھو کہ وہ تم کو دیکھ رہا ہے۔ پھر اس نے پوچھا کہ قیامت کب آئے گی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے بارے میں جواب دینے والا پوچھنے والے سے کچھ زیادہ نہیں جانتا ( البتہ ) میں تمہیں اس کی نشانیاں بتلا سکتا ہوں۔ وہ یہ ہیں کہ جب لونڈی اپنے آقا کو جنے گی اور جب سیاہ اونٹوں کے چرانے والے ( دیہاتی لوگ ترقی کرتے کرتے ) مکانات کی تعمیر میں ایک دوسرے سے بازی لے جانے کی کوشش کریں گے ( یاد رکھو ) قیامت کا علم ان پانچ چیزوں میں ہے جن کو اللہ کے سوا کوئی نہیں جانتا۔ پھر آپ نے یہ آیت پڑھی کہ اللہ ہی کو قیامت کا علم ہے کہ وہ کب ہو گی ( آخر آیت تک ) پھر وہ پوچھنے والا پیٹھ پھیر کر جانے لگا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے واپس بلا کر لاؤ۔ لوگ دوڑ پڑے مگر وہ کہیں نظر نہیں آیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ جبرائیل تھے جو لوگوں کو ان کا دین سکھانے آئے تھے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) فرماتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے ان تمام باتوں کو ایمان ہی قرار دیا ہے۔",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		}
	]
}