{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5126,
			"arabicnumber": 5126,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا، ان سے ابوحازم سلمہ بن دینار نے، ان سے سہل بن سعد رضی اللہ عنہ نے کہ ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا: یا رسول اللہ! میں آپ کی خدمت میں اپنے آپ کو ہبہ کرنے آئی ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور نظر اٹھا کر دیکھا، پھر نظر نیچی کر لی اور سر کو جھکا لیا۔ جب خاتون نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے بارے میں کوئی فیصلہ نہیں فرمایا تو بیٹھ گئیں۔ اس کے بعد آپ کے صحابہ میں سے ایک صاحب کھڑے ہوئے اور عرض کیا کہ یا رسول اللہ! اگر آپ کو ان کی ضرورت نہیں تو ان کا نکاح مجھ سے کرا دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کوئی چیز ہے؟ انہوں نے عرض کی کہ نہیں یا رسول اللہ، اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنے گھر جاؤ اور دیکھو شاید کوئی چیز مل جائے۔ وہ گئے اور واپس آ کر عرض کی کہ نہیں یا رسول اللہ! میں نے کوئی چیز نہیں پائی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور دیکھ لو، اگر ایک لوہے کی انگوٹھی بھی مل جائے۔ وہ گئے اور واپس آ کر عرض کیا: یا رسول اللہ! مجھے لوہے کی انگوٹھی بھی نہیں ملی، البتہ یہ میرا تہمد ہے۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی ( ان صحابی نے کہا کہ ) ان خاتون کو اس تہمد میں سے آدھا عنایت فرما دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے تہمد کا کیا کرے گی اگر تم اسے پہنو گے تو اس کے لیے اس میں سے کچھ باقی نہیں رہے گا۔ اس کے بعد وہ صاحب بیٹھ گئے اور دیر تک بیٹھے رہے پھر کھڑے ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں واپس جاتے ہوئے دیکھا اور انہیں بلانے کے لیے فرمایا، انہیں بلایا گیا۔ جب وہ آئے تو آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ تمہارے پاس قرآن مجید کتنا ہے۔ انہوں نے عرض کیا فلاں فلاں سورتیں۔ انہوں نے ان سورتوں کو گنایا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم ان سورتوں کو زبانی پڑھ لیتے ہو۔ انہوں نے ہاں میں جواب دیا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ جاؤ میں نے اس خاتون کو تمہارے نکاح میں اس قرآن کی وجہ سے دیا جو تمہارے پاس ہے۔ ان سورتوں کو اس سے یاد کرا دو۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 62
			}
		}
	]
}