{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5191,
			"arabicnumber": 5191,
			"text": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ بہت دنوں تک میرے دل میں خواہش رہی کہ میں عمر بن خطاب رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے متعلق پوچھوں جن کے بارے میں اللہ نے یہ آیت نازل کی تھی۔ «إن تتوبا إلى الله فقد صغت قلوبكما‏» الخ۔ ایک مرتبہ انہوں نے حج کیا اور ان کے ساتھ میں نے بھی حج کیا۔ ایک جگہ جب وہ راستہ سے ہٹ کر ( قضائے حاجت کے لیے ) گئے تو میں بھی ایک برتن میں پانی لے کر ان کے ساتھ راستہ سے ہٹ گیا۔ پھر انہوں نے قضائے حاجت کی اور واپس آئے تو میں نے ان کے ہاتھوں پر پانی ڈالا۔ پھر انہوں نے وضو کیا تو میں نے اس وقت ان سے پوچھا کہ یا امیرالمؤمنین! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ کون ہیں جن کے متعلق اللہ نے یہ ارشاد فرمایا کہ «إن تتوبا إلى الله فقد صغت قلوبكما‏» عمر بن خطاب رضی اللہ عنہ نے اس پر کہا اے ابن عباس! تم پر حیرت ہے۔ وہ عائشہ رضی اللہ عنہا اور حفصہ رضی اللہ عنہا ہیں پھر عمر رضی اللہ عنہ نے تفصیل کے ساتھ حدیث بیان کرنی شروع کی۔ انہوں نے کہا کہ میں اور میرے ایک انصاری پڑوسی جو بنو امیہ بن زید سے تھے اور عوالی مدینہ میں رہتے تھے۔ ہم نے ( عوالی سے ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے لیے باری مقرر کر رکھی تھی۔ ایک دن وہ حاضری دیتے اور ایک دن میں حاضری دیتا، جب میں حاضر ہوتا تو اس دن کی تمام خبریں جو وحی وغیرہ سے متعلق ہوتیں لاتا ( اور اپنے پڑوسی سے بیان کرتا ) اور جس دن وہ حاضر ہوتے تو وہ بھی ایسے کرتے۔ ہم قریشی لوگ اپنی عورتوں پر غالب تھے لیکن جب ہم مدینہ تشریف لائے تو یہ لوگ ایسے تھے کہ عورتوں سے مغلوب تھے، ہماری عورتوں نے بھی انصار کی عورتوں کا طریقہ سیکھنا شروع کر دیا۔ ایک دن میں نے اپنی بیوی کو ڈانٹا تو اس نے بھی میرا ترکی بہ ترکی جواب دیا۔ میں نے اس کے اس طرح جواب دینے پر ناگواری کا اظہار کیا تو اس نے کہا کہ میرا جواب دینا تمہیں برا کیوں لگتا ہے، اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم کی ازواج بھی ان کو جوابات دے دیتی ہیں اور بعض تو نبی کریم صلی اللہ علیہ وسلم سے ایک دن رات تک الگ رہتی ہیں۔ میں اس بات پر کانپ اٹھا اور کہا کہ ان میں سے جس نے بھی یہ معاملہ کیا یقیناً وہ نامراد ہو گئی۔ پھر میں نے اپنے کپڑے پہنے اور ( مدینہ کے لیے ) روانہ ہوا پھر میں حفصہ کے گھر گیا اور میں نے اس سے کہا: اے حفصہ! کیا تم میں سے کوئی بھی نبی کریم صلی اللہ علیہ وسلم سے ایک ایک دن رات تک غصہ رہتی ہے؟ انہوں نے کہا کہ جی ہاں کبھی ( ایسا ہو جاتا ہے ) میں نے اس پر کہا کہ پھر تم نے اپنے آپ کو خسارہ میں ڈال لیا اور نامراد ہوئی۔ کیا تمہیں اس کا کوئی ڈر نہیں کہ نبی کریم صلی اللہ علیہ وسلم کے غصہ کی وجہ سے اللہ تم پر غصہ ہو جائے اور پھر تم تنہا ہی ہو جاؤ گی۔ خبردار! نبی کریم صلی اللہ علیہ وسلم سے مطالبات نہ کیا کرو نہ کسی معاملہ میں نبی کریم صلی اللہ علیہ وسلم کو جواب دیا کرو اور نہ نبی کریم صلی اللہ علیہ وسلم کو چھوڑا کرو۔ اگر تمہیں کوئی ضرورت ہو تو مجھ سے مانگ لیا کرو۔ تمہاری سوکن جو تم سے زیادہ خوبصورت ہے اور نبی کریم صلی اللہ علیہ وسلم کو تم سے زیادہ پیاری ہے، ان کی وجہ سے تم کسی غلط فہمی میں نہ مبتلا ہو جانا۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا۔ عمر رضی اللہ عنہ نے بیان کیا کہ ہمیں معلوم ہوا تھا کہ ملک غسان ہم پر حملہ کے لیے فوجی تیاریاں کر رہا ہے۔ میرے انصاری ساتھی اپنی باری پر مدینہ منورہ گئے ہوئے تھے۔ وہ رات گئے واپس آئے اور میرے دروازے پر بڑی زور زور سے دستک دی اور کہا کہ کیا عمر رضی اللہ عنہ گھر میں ہیں۔ میں گھبرا کر باہر نکلا تو انہوں نے کہا کہ آج تو بڑا حادثہ ہو گیا۔ میں نے کہا کیا بات ہوئی، کیا غسانی چڑھ آئے ہیں؟ انہوں نے کہا کہ نہیں، حادثہ اس سے بھی بڑا اور اس سے بھی زیادہ خوفناک ہے۔ نبی کریم صلی اللہ علیہ وسلم نے ازواج مطہرات کو طلاق دے دی ہے۔ میں نے کہا کہ حفصہ تو خاسر و نامراد ہوئی۔ مجھے تو اس کا خطرہ لگا ہی رہتا تھا کہ اس طرح کا کوئی حادثہ جلد ہی ہو گا پھر میں نے اپنے تمام کپڑے پہنے ( اور مدینہ کے لیے روانہ ہو گیا ) میں نے فجر کی نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز کے بعد ) نبی کریم صلی اللہ علیہ وسلم اپنے ایک بالا خانہ میں چلے گئے اور وہاں تنہائی اختیار کر لی۔ میں حفصہ کے پاس گیا تو وہ رو رہی تھی۔ میں نے کہا اب روتی کیا ہو۔ میں نے تمہیں پہلے ہی متنبہ کر دیا تھا۔ کیا نبی کریم صلی اللہ علیہ وسلم نے تمہیں طلاق دے دی ہے؟ انہوں نے کہا کہ مجھے معلوم نہیں۔ نبی کریم صلی اللہ علیہ وسلم اس وقت بالا خانہ میں تنہا تشریف رکھتے ہیں۔ میں وہاں سے نکلا اور منبر کے پاس آیا۔ اس کے گرد کچھ صحابہ کرام موجود تھے اور ان میں سے بعض رو رہے تھے۔ تھوڑی دیر تک میں ان کے ساتھ بیٹھا رہا۔ اس کے بعد میرا غم مجھ پر غالب آ گیا اور میں اس بالا خانہ کے پاس آیا۔ جہاں نبی کریم صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کے ایک حبشی غلام سے کہا کہ عمر رضی اللہ عنہ کے لیے اندر آنے کی اجازت لے لو۔ غلام اندر گیا اور نبی کریم صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آ گیا۔ اس نے مجھ سے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے عرض کی اور نبی کریم صلی اللہ علیہ وسلم سے آپ کا ذکر کیا لیکن آپ خاموش رہے۔ چنانچہ میں واپس چلا آیا اور پھر ان لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے۔ میرا غم مجھ پر غالب آیا اور دوبارہ آ کر میں نے غلام سے کہا کہ عمر کے لیے اجازت لے لو۔ اس غلام نے واپس آ کر پھر کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے سامنے آپ کا ذکر کیا تو نبی کریم صلی اللہ علیہ وسلم خاموش رہے۔ میں پھر واپس آ گیا اور منبر کے پاس جو لوگ موجود تھے ان کے ساتھ بیٹھ گیا۔ لیکن میرا غم مجھ پر غالب آیا اور میں نے پھر آ کر غلام سے کہا کہ عمر کے لیے اجازت طلب کرو۔ غلام اندر گیا اور واپس آ کر جواب دیا کہ میں نے آپ کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا اور نبی کریم صلی اللہ علیہ وسلم خاموش رہے۔ میں وہاں سے واپس آ رہا تھا کہ غلام نے مجھ کو پکارا اور کہا نبی کریم صلی اللہ علیہ وسلم نے تمہیں اجازت دے دی ہے۔ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ اس بان کی چارپائی پر جس سے چٹائی بنی جاتی ہے لیٹے ہوئے تھے۔ اس پر کوئی بستر نہیں تھا۔ بان کے نشانات آپ کے پہلو مبارک پر پڑے ہوئے تھے۔ جس تکیہ پر آپ ٹیک لگائے ہوئے تھے اس میں چھال بھری ہوئی تھی۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کیا: یا رسول اللہ! کیا آپ نے اپنی ازواج کو طلاق دے دی ہے؟ نبی کریم صلی اللہ علیہ وسلم نے میری طرف نگاہ اٹھائی اور فرمایا نہیں۔ میں ( خوشی کی وجہ سے ) کہہ اٹھا۔ اللہ اکبر۔ پھر میں نے کھڑے ہی کھڑے نبی کریم صلی اللہ علیہ وسلم کو خوش کرنے کے لیے کہا کہ یا رسول اللہ! آپ کو معلوم ہے ہم قریش کے لوگ عورتوں پر غالب رہا کرتے تھے۔ پھر جب ہم مدینہ آئے تو یہاں کے لوگوں پر ان کی عورتیں غالب تھیں۔ نبی کریم صلی اللہ علیہ وسلم اس پر مسکرا دیئے۔ پھر میں نے عرض کیا: یا رسول اللہ! آپ کو معلوم ہے میں حفصہ کے پاس ایک مرتبہ گیا تھا اور اس سے کہہ آیا تھا کہ اپنی سوکن کی وجہ سے جو تم سے زیادہ خوبصورت اور تم سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کو عزیز ہے، دھوکا میں مت رہنا۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا۔ اس پر نبی کریم صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو مسکراتے دیکھا تو بیٹھ گیا پھر نظر اٹھا کر میں نبی کریم صلی اللہ علیہ وسلم کے گھر کا جائزہ لیا۔ اللہ کی قسم! میں نے نبی کریم صلی اللہ علیہ وسلم کے گھر میں کوئی ایسی چیز نہیں دیکھی جس پر نظر رکتی۔ سوا تین چمڑوں کے ( جو وہاں موجود تھے ) میں نے عرض کیا: یا رسول اللہ! اللہ سے دعا فرمائیں کہ وہ آپ کی امت کو فراخی عطا فرمائے۔ فارس و روم کو فراخی اور وسعت حاصل ہے اور انہیں دنیا دی گئی ہے حالانکہ وہ اللہ کی عبادت نہیں کرتے۔ نبی کریم صلی اللہ علیہ وسلم ابھی تک ٹیک لگائے ہوئے تھے لیکن اب سیدھے بیٹھ گئے اور فرمایا: ابن خطاب! تمہاری نظر میں بھی یہ چیزیں اہمیت رکھتی ہیں، یہ تو وہ لوگ ہیں جنہیں جو کچھ بھلائی ملنے والی تھی سب اسی دنیا میں دے دی گئی ہے۔ میں نے عرض کیا: یا رسول اللہ! میرے لیے اللہ سے مغفرت کی دعا کر دیجئیے ( کہ میں نے دنیاوی شان و شوکت کے متعلق یہ غلط خیال دل میں رکھا ) چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اپنی ازواج کو اسی وجہ سے انتیس دن تک الگ رکھا کہ حفصہ نے نبی کریم صلی اللہ علیہ وسلم کا راز عائشہ سے کہہ دیا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ ایک مہینہ تک میں اپنی ازواج کے پاس نہیں جاؤں گا۔ کیونکہ جب اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم پر عتاب کیا تو نبی کریم صلی اللہ علیہ وسلم کو اس کا بہت رنج ہوا ( اور آپ نے ازواج سے الگ رہنے کا فیصلہ کیا ) پھر جب انتیسویں رات گزر گئی تو نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور آپ سے ابتداء کی۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ یا رسول اللہ! آپ نے قسم کھائی تھی کہ ہمارے یہاں ایک مہینہ تک تشریف نہیں لائیں گے اور ابھی تو انتیس ہی دن گزرے ہیں میں تو ایک ایک دن گن رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس کا ہے۔ وہ مہینہ انتیس ہی کا تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر اللہ تعالیٰ نے آیت «تخير» نازل کی اور نبی کریم صلی اللہ علیہ وسلم اپنی تمام ازواج میں سب سے پہلے میرے پاس تشریف لائے ( اور مجھ سے اللہ کی وحی کا ذکر کیا ) تو میں نے نبی کریم صلی اللہ علیہ وسلم کو ہی پسند کیا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے اپنی تمام دوسری ازواج کو اختیار دیا اور سب نے وہی کہا جو عائشہ رضی اللہ عنہا کہہ چکی تھیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 125
			}
		}
	]
}