{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5197,
			"arabicnumber": 5197,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی، انہیں زید بن اسلم نے، انہیں عطاء بن یسار نے اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو نبی کریم صلی اللہ علیہ وسلم نے لوگوں کے ساتھ اس کی نماز پڑھی۔ آپ نے بہت لمبا قیام کی اتنا طویل کہ سورۃ البقرہ پڑھی جا سکے پھر طویل رکوع کیا۔ رکوع سے سر اٹھا کر بہت دیر تک قیام کیا۔ یہ قیام پہلے قیام سے کچھ کم تھا۔ پھر آپ نے دوسرا طویل رکوع کیا۔ یہ رکوع طوالت میں پہلے رکوع سے کچھ کم تھا۔ پھر سر اٹھایا اور سجدہ کیا۔ پھر دوبارہ قیام کیا اور بہت دیر تک حالت قیام میں رہے۔ یہ قیام پہلی رکعت کے قیام سے کچھ کم تھا۔ پھر طویل رکوع کیا، یہ رکوع پہلے رکوع سے کچھ کم طویل تھا۔ پھر سر اٹھایا اور طویل قیام کیا۔ یہ قیام پہلے قیام سے کچھ کم تھا۔ پھر رکوع کیا، طویل رکوع۔ اور یہ رکوع پہلے رکوع سے کچھ کم طویل تھا۔ پھر سر اٹھایا اور سجدہ میں گئے۔ جب آپ نماز سے فارغ ہوئے تو گرہن ختم ہو چکا تھا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں۔ ان میں گرہن کسی کی موت یا کسی کی حیات کی وجہ سے نہیں ہوتا۔ اس لیے جب تم گرہن دیکھو تو اللہ کو یاد کرو۔ صحابہ نے عرض کیا: یا رسول اللہ! ہم نے آپ کو دیکھا کہ آپ نے اپنی جگہ سے کوئی چیز بڑھ کر لی۔ پھر ہم نے دیکھا کہ آپ ہم سے ہٹ گئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی تھی یا ( نبی کریم صلی اللہ علیہ وسلم نے فرمایا راوی کو شک تھا ) مجھے جنت دکھائی گئی تھی۔ میں نے اس کا خوشہ توڑنے کے لیے ہاتھ بڑھایا تھا اور اگر میں اسے توڑ لیتا تو تم رہتی دنیا تک اسے کھاتے اور میں نے دوزخ دیکھی آج کا اس سے زیادہ ہیبت ناک منظر میں نے کبھی نہیں دیکھا اور میں نے دیکھا کہ اس میں عورتوں کی تعداد زیادہ ہے۔ صحابہ نے عرض کیا: یا رسول اللہ! ایسا کیوں ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ شوہر کی ناشکری کرتی ہیں اور ان کے احسان کا انکار کرتی ہیں، اگر تم ان میں سے کسی ایک کے ساتھ زندگی بھر بھی حسن سلوک کا معاملہ کرو پھر بھی تمہاری طرف سے کوئی چیز اس کے لیے ناگواری خاطر ہوئی تو کہہ دے گی کہ میں نے تو تم سے کبھی بھلائی دیکھی ہی نہیں۔",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 131
			}
		}
	]
}