{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5259,
			"arabicnumber": 5259,
			"text": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے خبر دی کہ عویمر العجانی رضی اللہ عنہ عاصم بن عدی انصاری رضی اللہ عنہ کے پاس آئے اور ان سے کہا کہ اے عاصم! تمہارا کیا خیال ہے، اگر کوئی اپنی بیوی کے ساتھ کسی غیر کو دیکھے تو کیا اسے وہ قتل کر سکتا ہے؟ لیکن پھر تم قصاص میں اسے ( شوہر کو ) بھی قتل کر دو گے یا پھر وہ کیا کرے گا؟ عاصم میرے لیے یہ مسئلہ آپ رسول اللہ صلی اللہ علیہ وسلم سے پوچھ دیجئیے۔ عاصم رضی اللہ عنہ نے جب نبی کریم صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھا تو نبی کریم صلی اللہ علیہ وسلم نے اس سوالات کو ناپسند فرمایا اور اس سلسلے میں نبی کریم صلی اللہ علیہ وسلم کے کلمات عاصم رضی اللہ عنہ پر گراں گزرے اور جب وہ واپس اپنے گھر آ گئے تو عویمر رضی اللہ عنہ نے آ کر ان سے پوچھا کہ بتائیے آپ سے نبی کریم صلی اللہ علیہ وسلم نے کیا فرمایا؟ عاصم نے اس پر کہا تم نے مجھ کو آفت میں ڈالا۔ جو سوال تم نے پوچھا تھا وہ نبی کریم صلی اللہ علیہ وسلم کو ناگوار گزرا۔ عویمر نے کہا کہ اللہ کی قسم! یہ مسئلہ نبی کریم صلی اللہ علیہ وسلم سے پوچھے بغیر میں باز نہیں آؤں گا۔ چنانچہ وہ روانہ ہوئے اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچے۔ نبی کریم صلی اللہ علیہ وسلم لوگوں کے درمیان میں تشریف رکھتے تھے۔ عویمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! اگر کوئی شخص اپنی بیوی کے ساتھ کسی غیر کو پا لیتا ہے تو آپ کا کیا خیال ہے؟ کیا وہ اسے قتل کر دے؟ لیکن اس صورت میں آپ اسے قتل کر دیں گے یا پھر اسے کیا کرنا چاہیے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے تمہاری بیوی کے بارے میں وحی نازل کی ہے، اس لیے تم جاؤ اور اپنی بیوی کو بھی ساتھ لاؤ۔ سہل نے بیان کیا کہ پھر دونوں ( میاں بیوی ) نے لعان کیا۔ لوگوں کے ساتھ میں بھی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اس وقت موجود تھا۔ لعان سے جب دونوں فارغ ہوئے تو عویمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! اگر اس کے بعد بھی میں اسے اپنے پاس رکھوں تو ( اس کا مطلب یہ ہو گا کہ ) میں جھوٹا ہوں۔ چنانچہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کے حکم سے پہلے ہی اپنی بیوی کو تین طلاق دی۔ ابن شہاب نے بیان کیا کہ پھر لعان کرنے والے کے لیے یہی طریقہ جاری ہو گیا۔",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 9
			}
		}
	]
}