{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5308,
			"arabicnumber": 5308,
			"text": "ہم سے اسماعیل بن ابی ایاس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابن شہاب نے اور انہیں سہل بن سعد ساعدی نے خبر دی کہ عویمر عجلانی، عاصم بن عدی انصاری کے پاس آئے اور ان سے کہا کہ عاصم آپ کا کیا خیال ہے کہ ایک شخص اگر اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے تو کیا اسے قتل کر دے گا لیکن پھر آپ لوگ اسے بھی قتل کر دیں گے۔ آخر اسے کیا کرنا چاہیئے؟ عاصم! میرے لیے یہ مسئلہ پوچھ دو۔ چنانچہ عاصم رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھا۔ نبی کریم نے اس طرح کے سوالات کو ناپسند فرمایا اور اظہار ناگواری کیا۔ عاصم رضی اللہ عنہ نے اس سلسلے میں نبی کریم صلی اللہ علیہ وسلم سے جو کچھ سنا اس کا بہت اثر لیا۔ پھر جب گھر واپس آئے تو عویمر ان کے پاس آئے اور پوچھا۔ عاصم! آپ کو رسول اللہ صلی اللہ علیہ وسلم نے کیا جواب دیا۔ عاصم رضی اللہ عنہ نے کہا، عویمر! تم نے میرے ساتھ اچھا معاملہ نہیں کیا، جو مسئلہ تم نے پوچھا تھا، نبی کریم صلی اللہ علیہ وسلم نے اسے ناپسند فرمایا۔ عویمر رضی اللہ عنہ نے کہا کہ اللہ کی قسم! جب تک میں یہ مسئلہ نبی کریم صلی اللہ علیہ وسلم سے معلوم نہ کر لوں، باز نہیں آؤں گا۔ چنانچہ عویمر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، نبی کریم صلی اللہ علیہ وسلم اس وقت صحابہ کے درمیان میں موجود تھے۔ انہوں نے عرض کیا: یا رسول اللہ! آپ کا اس شخص کے متعلق کیا ارشاد ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے، کیا اسے قتل کر دے؟ لیکن پھر آپ لوگ اسے ( قصاص ) میں قتل کر دیں گے، تو پھر اسے کیا کرنا چاہیئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اور تمہاری بیوی کے بارے میں ابھی وحی نازل ہوئی ہے۔ جاؤ اور اپنی بیوی کو لے کر آؤ۔ سہل نے بیان کیا کہ پھر ان دونوں نے لعان کیا۔ میں بھی نبی کریم صلی اللہ علیہ وسلم کے پاس اس وقت موجود تھا۔ جب لعان سے فارغ ہوئے تو عویمر رضی اللہ عنہ نے کہا کہ یا رسول اللہ! اگر اب بھی میں اسے ( اپنی بیوی کو ) اپنے ساتھ رکھتا ہوں تو اس کا مطلب یہ ہے کہ میں جھوٹا ہوں۔ چنانچہ انہوں نے انہیں تین طلاقیں نبی کریم صلی اللہ علیہ وسلم کے حکم سے پہلے ہی دے دیں۔ ابن شہاب نے بیان کیا کہ پھر لعان کرنے والوں کے لیے سنت طریقہ مقرر ہو گیا۔",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 57
			}
		}
	]
}