{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5381,
			"arabicnumber": 5381,
			"text": "ہم سے اسماعیل بن علیہ نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ابوطلحہ رضی اللہ عنہ نے اپنی بیوی ام سلیم رضی اللہ عنہا سے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی آواز میں ضعف و نقاہت کو محسوس کیا ہے اور معلوم ہوتا ہے کہ آپ فاقہ سے ہیں۔ کیا تمہارے پاس کوئی چیز ہے؟ چنانچہ انہوں نے جَو کی چند روٹیاں نکالیں، پھر اپنا دوپٹہ نکالا اور اس کے ایک حصہ میں روٹیوں کو لپیٹ کر میرے ( یعنی انس رضی اللہ عنہ کے ) کپڑے کے نیچے چھپا دیا اور ایک حصہ مجھے چادر کی طرح اوڑھا دیا، پھر مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا۔ بیان کیا کہ میں جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ کو مسجد میں پایا اور آپ کے ساتھ صحابہ تھے۔ میں ان سب حضرات کے سامنے جا کر کھڑا ہو گیا۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اے انس! تمہیں ابوطلحہ نے بھیجا ہو گا۔ میں نے عرض کی جی ہاں۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا: کھانے کے ساتھ؟ میں نے عرض کی، جی ہاں۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے اپنے ساتھیوں سے فرمایا کہ کھڑے ہو جاؤ۔ چنانچہ آپ روانہ ہوئے۔ میں سب کے آگے آگے چلتا رہا۔ جب ابوطلحہ رضی اللہ عنہ کے پاس واپس پہنچا تو انہوں نے کہا: ام سلیم! نبی کریم صلی اللہ علیہ وسلم صحابہ کو ساتھ لے کر تشریف لائے ہیں، حالانکہ ہمارے پاس کھانے کا اتنا سامان نہیں جو سب کو کافی ہو سکے۔ ام سلیم رضی اللہ عنہا اس پر بولیں کہ اللہ اور اس کا رسول خوب جانتے ہیں۔ بیان کیا کہ پھر ابوطلحہ رضی اللہ عنہ ( استقبال کے لیے ) نکلے اور نبی کریم صلی اللہ علیہ وسلم سے ملاقات کی۔ اس کے بعد ابوطلحہ رضی اللہ عنہ اور نبی کریم صلی اللہ علیہ وسلم گھر کی طرف متوجہ ہوئے اور گھر میں داخل ہو گئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ام سلیم! جو کچھ تمہارے پاس ہے وہ یہاں لاؤ۔ ام سلیم رضی اللہ عنہا روٹی لائیں، نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور اس کا چورا کر لیا گیا۔ ام سلیم رضی اللہ عنہ نے اپنے گھی کے ڈبہ میں سے گھی نچوڑ کر اس کا ملیدہ بنا لیا، پھر نبی کریم صلی اللہ علیہ وسلم نے دعا کی جو کچھ اللہ تعالیٰ نے آپ سے دعا کرانی چاہی، اس کے بعد فرمایا کہ ان دس دس آدمیوں کو کھانے کے لیے بلا لو۔ چنانچہ دس صحابہ کو بلایا۔ سب نے کھایا اور شکم سیر ہو کر باہر چلے گئے۔ پھر فرمایا کہ دس کو اور بلا لو، انہیں بلایا گیا اور سب نے شکم سیر ہو کر کھایا اور باہر چلے گئے۔ پھر آپ نے فرمایا کہ دس صحابہ کو اور بلا لو، پھر دس صحابہ کو بلایا گیا اور ان لوگوں نے بھی خوب پیٹ بھر کر کھایا اور باہر تشریف لے گئے۔ اس کے بعد پھر دس صحابہ کو بلایا گیا اس طرح تمام صحابہ نے پیٹ بھر کر کھایا، اس وقت اسی ( 80 ) صحابہ کی جماعت وہاں موجود تھی۔",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 9
			}
		}
	]
}