{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5401,
			"arabicnumber": 5401,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، ان سے امام لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا، انہیں محمود بن ربیع انصاری نے خبر دی کہ عتبان بن مالک رضی اللہ عنہ جو نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے تھے اور قبیلہ انصار کے ان لوگوں میں سے تھے جنہوں نے بدر کی لڑائی میں شرکت کی تھی۔ آپ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ! میری بصارت کمزور ہے اور میں اپنی قوم کو نماز پڑھاتا ہوں۔ برسات میں وادی جو میرے اور ان کے درمیان حائل ہے۔ بہنے لگتی ہے اور میرے لیے ان کی مسجد میں جانا اور ان میں نماز پڑھنا ممکن نہیں رہتا۔ اس لیے یا رسول اللہ! میری یہ خواہش ہے کہ آپ میرے گھر تشریف لے چلیں اور میرے گھر میں آپ نماز پڑھیں تاکہ میں اسی جگہ کو نماز پڑھنے کی جگہ بنا لوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان شاءاللہ میں جلد ہی ایسا کروں گا۔ عتبان رضی اللہ عنہ نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے ساتھ چاشت کے وقت جب سورج کچھ بلند ہو گیا تشریف لائے اور نبی کریم صلی اللہ علیہ وسلم نے اندر آنے کی اجازت چاہی۔ میں نے آپ کو اجازت دے دی۔ آپ بیٹھے نہیں بلکہ گھر میں داخل ہو گئے اور دریافت فرمایا کہ اپنے گھر میں کس جگہ تم پسند کرتے ہو کہ میں نماز پڑھوں؟ میں نے گھر کے ایک کونے کی طرف اشارہ کیا۔ نبی کریم صلی اللہ علیہ وسلم وہاں کھڑے ہو گئے اور ( نماز کے لیے ) تکبیر کہی۔ ہم نے بھی ( آپ کے پیچھے ) صف بنا لی۔ نبی کریم صلی اللہ علیہ وسلم کو خزیرہ ( حریرہ کی ایک قسم ) کے لیے جو آپ کے لیے ہم نے بنایا تھا روک لیا۔ گھر میں قبیلہ کے بہت سے لوگ آ آ کر جمع ہو گئے۔ ان میں سے ایک صاحب نے کہا مالک بن دخشن کہاں ہیں؟ اس پر کسی نے کہا کہ وہ تو منافق ہے اللہ اور اس کے رسول سے اسے محبت نہیں ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ نہ کہو، کیا تم نہیں دیکھتے کہ انہوں نے اقرار کیا ہے کہ «لا إله إلا الله» یعنی اللہ کے سوا اور کوئی معبود نہیں اور اس سے ان کا مقصد صرف اللہ کی خوشنودی حاصل کرنا ہے۔ ان صحابی نے کہا کہ اللہ اور اس کے رسول ہی زیادہ جانتے ہیں۔ راوی نے بیان کیا کہ ہم نے عرض کیا ( یا رسول اللہ! ) لیکن ہم ان کی توجہ اور ان کا لگاؤ منافقین کے ساتھ ہی دیکھتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: لیکن اللہ نے دوزخ کی آگ کو اس شخص پر حرام کر دیا ہے جس نے کلمہ «لا إله إلا الله» کا اقرار کر لیا ہو اور اس سے اس کا مقصد اللہ کی خوشنودی ہو۔ ابن شہاب نے بیان کیا کہ پھر میں نے حصین بن محمد انصاری سے جو بنی سالم کے ایک فرد اور ان کے سردار تھے۔ محمود کی حدیث کے متعلق پوچھا تو انہوں نے اس کی تصدیق کی۔",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 29
			}
		}
	]
}