{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5425,
			"arabicnumber": 5425,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، ان سے مطلب بن عبداللہ بن حنطب کے غلام عمرو بن ابی عمرو نے، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے فرمایا کہ اپنے یہاں کے بچوں میں کوئی بچہ تلاش کر لاؤ جو میرے کام کر دیا کرے۔ چنانچہ ابوطلحہ رضی اللہ عنہ مجھے اپنی سواری پر اپنے پیچھے بٹھا کر لائے۔ میں نبی کریم صلی اللہ علیہ وسلم کی، جب بھی آپ کہیں پڑاؤ کرتے خدمت کرتا۔ میں سنا کرتا تھا کہ نبی کریم صلی اللہ علیہ وسلم بکثرت یہ دعا پڑھا کرتے تھے «اللهم إني أعوذ بك من الهم والحزن،‏‏‏‏ ‏‏‏‏ والعجز والكسل،‏‏‏‏ ‏‏‏‏ والبخل والجبن وضلع الدين،‏‏‏‏ ‏‏‏‏ وغلبة الرجال» ”اے اللہ! میں تیری پناہ مانگتا ہوں غم سے، رنج سے، عجز سے، سستی سے، بخل سے، بزدلی سے، قرض کے بوجھ سے اور لوگوں کے غلبہ سے۔“ ( انس رضی اللہ عنہ نے بیان کیا کہ ) پھر میں اس وقت سے برابر آپ کی خدمت کرتا رہا۔ یہاں تک کہ ہم خیبر سے واپس ہوئے اور صفیہ بنت حیی رضی اللہ عنہا بھی ساتھ تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں پسند فرمایا تھا۔ میں دیکھتا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے اپنی سواری پر پیچھے کپڑے سے پردہ کیا اور پھر انہیں وہاں بٹھایا۔ آخر جب مقام صہبا میں پہنچے تو آپ نے دستر خوان پر حیس ( کھجور، پنیر اور گھی وغیرہ کا ملیدہ ) بنایا پھر مجھے بھیجا اور میں نے لوگوں کو بلا لایا، پھر سب لوگوں نے اسے کھایا۔ یہی نبی کریم صلی اللہ علیہ وسلم کی طرف سے صفیہ رضی اللہ عنہا سے نکاح کی دعوت ولیمہ تھی۔ پھر آپ روانہ ہوئے اور جب احد دکھائی دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں۔ اس کے بعد جب مدینہ نظر آیا تو فرمایا کہ اے اللہ! میں اس کے دونوں پہاڑوں کے درمیانی علاقے کو اسی طرح حرمت والا علاقہ بناتا ہوں جس طرح ابراہیم علیہ السلام نے مکہ کو حرمت والا شہر بنایا تھا۔ اے اللہ! اس کے رہنے والوں کو برکت عطا فرما۔ ان کے مد میں اور ان کے صاع میں برکت فرما۔",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 53
			}
		}
	]
}