{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5443,
			"arabicnumber": 5443,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم سے ابوغسان نے بیان کیا، کہا کہ مجھ سے ابوحازم نے بیان کیا، ان سے ابراہیم بن عبدالرحمٰن بن عبداللہ بن ابی ربیعہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ مدینہ میں ایک یہودی تھا اور وہ مجھے قرض اس شرط پر دیا کرتا تھا کہ میری کھجوریں تیار ہونے کے وقت لے لے گا۔ جابر رضی اللہ عنہ کی ایک زمین بئررومہ کے راستہ میں تھی۔ ایک سال کھجور کے باغ میں پھل نہیں آئے۔ پھل چنے جانے کا جب وقت آیا تو وہ یہودی میرے پاس آیا لیکن میں نے تو باغ سے کچھ بھی نہیں توڑا تھا۔ اس لیے میں آئندہ سال کے لیے مہلت مانگنے لگا لیکن اس نے مہلت دینے سے انکار کیا۔ اس کی خبر جب رسول اللہ صلی اللہ علیہ وسلم کو دی گئی تو آپ نے اپنے صحابہ سے فرمایا کہ چلو، یہودی سے جابر رضی اللہ عنہ کے لیے ہم مہلت مانگیں گے۔ چنانچہ یہ سب میرے باغ میں تشریف لائے۔ نبی کریم صلی اللہ علیہ وسلم اس یہودی سے گفتگو فرماتے رہے لیکن وہ یہی کہتا رہا کہ ابوالقاسم میں مہلت نہیں دے سکتا۔ جب نبی کریم صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ کھڑے ہو گئے اور کھجور کے باغ میں چاروں طرف پھرے پھر تشریف لائے اور اس سے گفتگو کی لیکن اس نے اب بھی انکار کیا پھر میں کھڑا ہوا اور تھوڑی سی تازہ کھجور لا کر نبی کریم صلی اللہ علیہ وسلم کے سامنے رکھی۔ نبی کریم صلی اللہ علیہ وسلم نے ان کو تناول فرمایا پھر فرمایا جابر! تمہاری جھونپڑی کہاں ہے؟ میں نے آپ کو بتایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس میں میرے لیے کچھ فرش بچھا دو۔ میں نے بچھا دیا تو آپ داخل ہوئے اور آرام فرمایا پھر بیدار ہوئے تو میں ایک مٹھی اور کھجور لایا۔ نبی کریم صلی اللہ علیہ وسلم نے اس میں سے بھی تناول فرمایا پھر آپ کھڑے ہوئے اور یہودی سے گفتگو فرمائی۔ اس نے اب بھی انکار کیا۔ نبی کریم صلی اللہ علیہ وسلم دوبارہ باغ میں کھڑے ہوئے پھر فرمایا کہ جابر! جاؤ اب پھل توڑو اور قرض ادا کر دو۔ آپ کھجوروں کے توڑے جانے کی جگہ کھڑے ہو گئے اور میں نے باغ میں سے اتنی کھجوریں توڑ لیں جن سے میں نے قرض ادا کر دیا اور اس میں سے کھجوریں بچ بھی گئی پھر میں وہاں سے نکلا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر یہ خوشخبری سنائی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں گواہی دیتا ہوں کہ میں اللہ کا رسول ہوں۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ اس حدیث میں جو «عروش» کا لفظ ہے «عروش» اور «عريش» عمارت کی چھت کو کہتے ہیں۔ ابن عباس رضی اللہ عنہما نے کہا کہ ( سورۃ الانعام میں لفظ ) «معروشات» سے مراد انگور وغیرہ کی ٹٹیاں ہیں۔ دوسری آیت ( سورۃ البقرہ ) «عروشها خاویة علی» یعنی اپنی چھتوں پر گرے ہوئے۔",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 72
			}
		}
	]
}