{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5518,
			"arabicnumber": 5518,
			"text": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا ہم سے ایوب بن ابی تمیمہ نے بیان کیا، ان سے قاسم نے، ان سے زہدم جرمی نے بیان کیا کہ ہم سے ابوموسیٰ اشعری رضی اللہ عنہ کے پاس تھے ہم میں اور اس قبیلہ جرم میں بھائی چارہ تھا پھر کھانا لایا گیا جس میں مرغی کا گوشت بھی تھا، حاضرین میں ایک شخص سرخ رنگ کا بیٹھا ہوا تھا لیکن وہ کھانے میں شریک نہیں ہوا، ابوموسیٰ رضی اللہ عنہ نے اس سے کہا کہ تم بھی شریک ہو جاؤ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کا گوشت کھاتے ہوئے دیکھا ہے۔ اس نے کہا کہ میں نے مرغی کو گندگی کھاتے دیکھا تھا اسی وقت سے مجھے اس سے گھن آنے لگی ہے اور میں نے قسم کھا لی ہے کہ اب اس کا گوشت نہیں کھاؤں گا۔ ابوموسیٰ رضی اللہ عنہ نے کہا کہ شریک ہو جاؤ میں تمہیں خبر دیتا ہوں یا انہوں نے کہا کہ میں تم سے بیان کرتا ہوں کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں قبیلہ اشعر کے چند لوگوں کو ساتھ لے کر حاضر ہوا، میں نبی کریم صلی اللہ علیہ وسلم کے سامنے آیا تو آپ خفا تھے آپ صدقہ کے اونٹ تقسیم فرما رہے تھے۔ اسی وقت ہم نے نبی کریم صلی اللہ علیہ وسلم سے سواری کے لیے اونٹ کا سوال کیا نبی کریم صلی اللہ علیہ وسلم نے قسم کھا لی کہ آپ ہمیں سواری کے لیے اونٹ نہیں دیں گے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس تمہارے لیے سواری کا کوئی جانور نہیں ہے۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم کے پاس غنیمت کے اونٹ لائے گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اشعری کہاں ہیں، اشعری کہاں ہیں؟ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں پانچ سفید کوہان والے اونٹ دے دیئے۔ تھوڑی دیر تک تو ہم خاموش رہے لیکن پھر میں نے اپنے ساتھیوں سے کہا کہ نبی کریم صلی اللہ علیہ وسلم اپنی قسم بھول گئے ہیں اور اگر ہم نے نبی کریم صلی اللہ علیہ وسلم کو آپ کی قسم کے بارے میں غافل رکھا تو ہم کبھی فلاح نہیں پا سکیں گے۔ چنانچہ ہم آپ کی خدمت میں واپس آئے اور عرض کیا کہ یا رسول اللہ! ہم نے آپ سے سواری کے اونٹ ایک مرتبہ مانگے تھے تو آپ نے ہمیں سواری کے لیے کوئی جانور نہ دینے کی قسم کھا لی تھی ہمارے خیال میں آپ اپنی قسم بھول گئے ہیں نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بلاشبہ اللہ ہی کی وہ ذات ہے جس نے تمہیں سواری کے لیے جانور عطا فرمایا۔ اللہ کی قسم! اگر اللہ نے چاہا تو کبھی ایسا نہیں ہو سکتا کہ میں کوئی قسم کھا لوں اور پھر بعد میں مجھ پر واضح ہو جائے کہ اس کے سوا دوسری چیز اس سے بہتر ہے اور پھر وہی میں نہ کروں جو بہتر ہے، میں قسم توڑ دوں گا اور وہی کروں گا جو بہتر ہو گا اور قسم توڑنے کا کفارہ ادا کر دوں گا۔",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 44
			}
		}
	]
}