{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ نے، انہیں اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم گدھے کی پالان پر فدک کی چادر ڈال کر اس پر سوار ہوئے اور اسامہ بن زید رضی اللہ عنہما کو اپنے پیچھے سوار کیا، نبی کریم صلی اللہ علیہ وسلم سعد بن عبادہ رضی اللہ عنہ کی عیادت کو تشریف لے جا رہے تھے، یہ جنگ بدر سے پہلے کا واقعہ ہے۔ نبی کریم صلی اللہ علیہ وسلم روانہ ہوئے اور ایک مجلس سے گزرے جس میں عبداللہ بن ابی بن سلول بھی تھا۔ عبداللہ ابھی مسلمان نہیں ہوا تھا اس مجلس میں ہر گروہ کے لوگ تھے مسلمان بھی، مشرکین بھی یعنی بت پرست اور یہودی بھی۔ مجلس میں عبداللہ بن رواحہ رضی اللہ عنہ بھی تھے، سواری کی گرد جب مجلس تک پہنچی تو عبداللہ بن ابی نے اپنی چادر اپنی ناک پر رکھ لی اور کہا کہ ہم پر گرد نہ اڑاؤ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے انہیں سلام کیا اور سواری روک کر وہاں اتر گئے پھر آپ نے انہیں اللہ کے طرف بلایا اور قرآن مجید پڑھ کر سنایا۔ اس پر عبداللہ بن ابی نے کہا میاں تمہاری باتیں میری سمجھ میں نہیں آتیں اگر حق ہیں تو ہماری مجلس میں انہیں بیان کر کے ہم کو تکلیف نہ پہنچایا کرو، اپنے گھر جاؤ وہاں جو تمہارے پاس آئے اس سے بیان کرو۔ اس پر ابن رواحہ رضی اللہ عنہ نے کہا کیوں نہیں یا رسول اللہ! آپ ہماری مجلسوں میں ضرور تشریف لائیں کیونکہ ہم ان باتوں کو پسند کرتے ہیں۔ اس پر مسلمانوں، مشرکوں اور یہودیوں میں جھگڑے بازی ہو گئی اور قریب تھا کہ ایک دوسرے پر حملہ کر بیٹھتے لیکن آپ انہیں خاموش کرتے رہے یہاں تک کہ سب خاموش ہو گئے پھر نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر سوار ہو کر سعد بن عبادہ رضی اللہ عنہ کے یہاں تشریف لے گئے اور ان سے فرمایا سعد! تم نے سنا نہیں ابوحباب نے کیا کہا، آپ کا اشارہ عبداللہ بن ابی کی طرف تھا۔ اس پر سعد رضی اللہ عنہ بولے کہ یا رسول اللہ! اسے معاف کر دیجئیے اور اس سے درگزر فرمایئے۔ اللہ تعالیٰ نے آپ کو وہ نعمت عطا فرما دی جو عطا فرمانی تھی ( آپ کے مدینہ تشریف لانے سے پہلے ) اس بستی کے لوگ اس پر متفق ہو گئے تھے کہ اسے تاج پہنا دیں اور اپنا سردار بنا لیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کے ذریعہ جو آپ کو اس نے عطا فرمایا ہے ختم کر دیا تو وہ اس پر بگڑ گیا یہ جو کچھ معاملہ اس نے آپ کے ساتھ کیا ہے اسی کا نتیجہ ہے۔",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 23
			}
		}
	]
}