{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5729,
			"arabicnumber": 5729,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عبدالحمید بن عبدالرحمٰن بن زید بن خطاب نے، انہیں عبداللہ بن عبداللہ بن حارث بن نوفل نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ شام تشریف لے جا رہے تھے جب آپ مقام سرغ پر پہنچے تو آپ کی ملاقات فوجوں کے امراء ابوعبیدہ بن جراح رضی اللہ عنہ اور آپ کے ساتھیوں سے ہوئی۔ ان لوگوں نے امیرالمؤمنین کو بتایا کہ طاعون کی وبا شام میں پھوٹ پڑی ہے۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ اس پر عمر رضی اللہ عنہ نے کہا کہ میرے پاس مہاجرین اولین کو بلا لاؤ۔ آپ انہیں بلا لائے تو عمر رضی اللہ عنہ نے ان سے مشورہ کیا اور انہیں بتایا کہ شام میں طاعون کی وبا پھوٹ پڑی ہے، مہاجرین اولین کی رائیں مختلف ہو گئیں۔ بعض لوگوں نے کہا کہ صحابہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کی باقی ماندہ جماعت آپ کے ساتھ ہے اور یہ مناسب نہیں ہے کہ آپ انہیں اس وبا میں ڈال دیں۔ عمر رضی اللہ عنہ نے کہا کہ اچھا اب آپ لوگ تشریف لے جائیں پھر فرمایا کہ انصار کو بلاؤ۔ میں انصار کو بلا کر لایا آپ نے ان سے بھی مشورہ کیا اور انہوں نے بھی مہاجرین کی طرح اختلاف کیا کوئی کہنے لگا چلو، کوئی کہنے لگا لوٹ جاؤ۔ امیرالمؤمنین نے فرمایا کہ اب آپ لوگ بھی تشریف لے جائیں پھر فرمایا کہ یہاں پر جو قریش کے بڑے بوڑھے ہیں جو فتح مکہ کے وقت اسلام قبول کر کے مدینہ آئے تھے انہیں بلا لاؤ، میں انہیں بلا کر لایا۔ ان لوگوں میں کوئی اختلاف رائے پیدا نہیں ہوا سب نے کہا کہ ہمارا خیال ہے کہ آپ لوگوں کو ساتھ لے کر واپس لوٹ چلیں اور وبائی ملک میں لوگوں کو نہ لے کر جائیں۔ یہ سنتے ہی عمر رضی اللہ عنہ نے لوگوں میں اعلان کرا دیا کہ میں صبح کو اونٹ پر سوار ہو کر واپس مدینہ منورہ لوٹ جاؤں گا تم لوگ بھی واپس چلو۔ صبح کو ایسا ہی ہوا ابوعبیدہ ابن جراح رضی اللہ عنہ نے کہا کیا اللہ کی تقدیر سے فرار اختیار کیا جائے گا۔ عمر رضی اللہ عنہ نے کہا: کاش! یہ بات کسی اور نے کہی ہوتی ہاں ہم اللہ کی تقدیر سے فرار اختیار کر رہے ہیں لیکن اللہ ہی کی تقدیر کی طرف۔ کیا تمہارے پاس اونٹ ہوں اور تم انہیں لے کر کسی ایسی وادی میں جاؤ جس کے دو کنارے ہوں ایک سرسبز شاداب اور دوسرا خشک۔ کیا یہ واقعہ نہیں کہ اگر تم سرسبز کنارے پر چراؤ گے تو وہ بھی اللہ کی تقدیر سے ہو گا۔ اور خشک کنارے پر چراؤ گے تو وہ بھی اللہ کی تقدیر سے ہی ہو گا۔ بیان کیا کہ پھر عبدالرحمٰن بن عوف رضی اللہ عنہ آ گئے وہ اپنی کسی ضرورت کی وجہ سے اس وقت موجود نہیں تھے انہوں نے بتایا کہ میرے پاس مسئلہ سے متعلق ایک علم ہے۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم کسی سر زمین میں ( وبا کے متعلق ) سنو تو وہاں نہ جاؤ اور جب ایسی جگہ وبا آ جائے جہاں تم خود موجود ہو تو وہاں سے مت نکلو۔ راوی نے بیان کیا کہ اس پر عمر رضی اللہ عنہ نے اللہ تعالیٰ کی حمد کی اور پھر واپس ہو گئے۔",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 44
			}
		}
	]
}