{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5749,
			"arabicnumber": 5749,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے ابوبشر (جعفر) ان سے ابوالمتوکل علی بن داؤد نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم کے چند صحابہ ( 300 نفر ) ایک سفر کے لیے روانہ ہوئے جسے انہیں طے کرنا تھا راستے میں انہوں نے عرب کے ایک قبیلہ میں پڑاؤ کیا اور چاہا کہ قبیلہ والے ان کی مہمانی کریں لیکن انہوں نے انکار کیا، پھر اس قبیلہ کے سردار کو بچھو نے کاٹ لیا اسے اچھا کرنے کی ہر طرح کی کوشش انہوں نے کر ڈالی لیکن کسی سے کچھ فائدہ نہیں ہوا۔ آخر انہیں میں سے کسی نے کہا کہ یہ لوگ جنہوں نے تمہارے قبیلہ میں پڑاؤ کر رکھا ہے ان کے پاس بھی چلو، ممکن ہے ان میں سے کسی کے پاس کوئی منتر ہو۔ چنانچہ وہ صحابہ کے پاس آئے اور کہا لوگو! ہمارے سردار کو بچھو نے کاٹ لیا ہے ہم نے ہر طرح کی بہت کوشش اس کے لیے کر ڈالی لیکن کسی سے کوئی فائدہ نہیں ہوا کیا تم لوگوں میں سے کسی کے پاس اس کے لیے منتر ہے؟ صحابہ میں سے ایک صاحب ( ابو سعید خدری رضی اللہ عنہ ) نے کہا کہ ہاں واللہ میں جھاڑنا جانتا ہوں لیکن ہم نے تم سے کہا تھا کہ ہماری مہمانی کرو ( ہم مسافر ہیں ) تو تم نے انکار کر دیا تھا اس لیے میں بھی اس وقت تک نہیں جھاڑوں گا جب تک تم میرے لیے اس کی مزدوری نہ ٹھہرا دو۔ چنانچہ ان لوگوں نے کچھ بکریوں ( 30 ) پر معاملہ کر لیا۔ اب یہ صحابی روانہ ہوئے۔ یہ زمین پر تھوکتے جاتے اور «‏‏‏‏الحمد لله رب العالمين» ‏‏‏‏ پڑھتے جاتے اس کی برکت سے وہ ایسا ہو گیا جیسے اس کی رسی کھل گئی ہو اور وہ اس طرح چلنے لگا جیسے اسے کوئی تکلیف ہی نہ رہی ہو۔ بیان کیا کہ پھر وعدہ کے مطابق قبیلہ والوں نے ان صحابی کی مزدوری ( 30 بکریاں ) ادا کر دی بعض لوگوں نے کہا کہ ان کو تقسیم کر لو لیکن جنہوں نے جھاڑا تھا انہوں نے کہا کہ ابھی نہیں، پہلے ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوں پوری صورت حال آپ کے سامنے بیان کر دیں پھر دیکھیں نبی کریم صلی اللہ علیہ وسلم ہمیں کیا حکم فرماتے ہیں۔ چنانچہ سب لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ سے اس کا ذکر کیا آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں کیسے معلوم ہو گیا تھا کہ اس سے دم کیا جا سکتا ہے؟ تم نے اچھا کیا جاؤ ان کو تقسیم کر لو اور میرا بھی اپنے ساتھ ایک حصہ لگاؤ۔",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 64
			}
		}
	]
}