{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5763,
			"arabicnumber": 5763,
			"text": "ہم سے ابراہیم بن موسیٰ اشعری نے بیان کیا، کہا ہم کو عیسیٰ بن یونس نے خبر دی، انہیں ہشام بن عروہ نے، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ بنی زریق کے ایک شخص یہودی لبید بن اعصم نے رسول اللہ صلی اللہ علیہ وسلم پر جادو کر دیا تھا اور اس کی وجہ سے نبی کریم صلی اللہ علیہ وسلم کسی چیز کے متعلق خیال کرتے کہ آپ نے وہ کام کر لیا ہے حالانکہ آپ نے وہ کام نہ کیا ہوتا۔ ایک دن یا ( راوی نے بیان کیا کہ ) ایک رات نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف رکھتے تھے اور مسلسل دعا کر رہے تھے پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ عائشہ! تمہیں معلوم ہے اللہ سے جو بات میں پوچھ رہا تھا، اس نے اس کا جواب مجھے دے دیا۔ میرے پاس دو ( فرشتے جبرائیل و میکائیل علیہما السلام ) آئے۔ ایک میرے سر کی طرف کھڑا ہو گیا اور دوسرا میرے پاؤں کی طرف۔ ایک نے اپنے دوسرے ساتھی سے پوچھا ان صاحب کی بیماری کیا ہے؟ دوسرے نے کہا کہ ان پر جادو ہوا ہے۔ اس نے پوچھا کس نے جادو کیا ہے؟ جواب دیا کہ لبید بن اعصم نے۔ پوچھا کس چیز میں؟ جواب دیا کہ کنگھے اور سر کے بال میں جو نر کھجور کے خوشے میں رکھے ہوئے ہیں۔ سوال کیا اور یہ جادو ہے کہاں؟ جواب دیا کہ زروان کے کنویں میں۔ پھر نبی کریم صلی اللہ علیہ وسلم اس کنویں پر اپنے چند صحابہ کے ساتھ تشریف لے گئے اور جب واپس آئے تو فرمایا عائشہ! اس کا پانی ایسا ( سرخ ) تھا جیسے مہندی کا نچوڑ ہوتا ہے اور اس کے کھجور کے درختوں کے سر ( اوپر کا حصہ ) شیطان کے سروں کی طرح تھے میں نے عرض کیا یا رسول اللہ! آپ نے اس جادو کو باہر کیوں نہیں کر دیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مجھے اس سے عافیت دے دی اس لیے میں نے مناسب نہیں سمجھا کہ اب میں خواہ مخواہ لوگوں میں اس برائی کو پھیلاؤں پھر نبی کریم صلی اللہ علیہ وسلم نے اس جادو کا سامان کنگھی بال خرما کا غلاف ہوتے ہیں اسی میں دفن کرا دیا۔ عیسیٰ بن یونس کے ساتھ اس حدیث کو ابواسامہ اور ابوضمرہ ( انس بن عیاض ) اور ابن ابی الزناد تینوں نے ہشام سے یوں روایت کیا اور لیث بن مسور اور سفیان بن عیینہ نے ہشام سے یوں روایت کیا ہے «في مشط ومشاقة‏.‏، المشاطة» اسے کہتے ہیں جو بال کنگھی کرنے میں نکلیں سر یا داڑھی کے اور «مشاقة‏.‏» روئی کے تار یعنی سوت کے تار کو کہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 77
			}
		}
	]
}