{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5807,
			"arabicnumber": 5807,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں معمر نے، انہیں زہری نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ بہت سے مسلمان حبشہ ہجرت کر کے چلے گئے اور ابوبکر رضی اللہ عنہ بھی ہجرت کی تیاریاں کرنے لگے لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ابھی ٹھہر جاؤ کیونکہ مجھے بھی امید ہے کہ مجھے ( ہجرت کی ) اجازت دی جائے گی۔ ابوبکر رضی اللہ عنہ نے عرض کیا: کیا آپ کو بھی امید ہے؟ میرا باپ آپ پر قربان۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں۔ چنانچہ ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ رہنے کے خیال سے رک گئے اور اپنی دو اونٹنیوں کو ببول کے پتے کھلا کر چار مہینے تک انہیں خوب تیار کرتے رہے۔ عروہ نے بیان کیا کہ عائشہ رضی اللہ عنہا نے کہا ہم ایک دن دوپہر کے وقت اپنے گھر میں بیٹھے ہوئے تھے کہ ایک شخص نے ابوبکر رضی اللہ عنہ سے کہا رسول اللہ صلی اللہ علیہ وسلم سر ڈھکے ہوئے تشریف لا رہے ہیں۔ اس وقت عموماً نبی کریم صلی اللہ علیہ وسلم ہمارے یہاں تشریف نہیں لاتے تھے۔ ابوبکر رضی اللہ عنہ نے کہا میرے ماں باپ نبی کریم صلی اللہ علیہ وسلم پر قربان ہوں، نبی کریم صلی اللہ علیہ وسلم ایسے وقت کسی وجہ ہی سے تشریف لا سکتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے مکان پر پہنچ کر اجازت چاہی اور ابوبکر صدیق رضی اللہ عنہ نے انہیں اجازت دی۔ نبی کریم صلی اللہ علیہ وسلم اندر تشریف لائے اور اندر داخل ہوتے ہی ابوبکر رضی اللہ عنہ سے فرمایا کہ جو لوگ تمہارے پاس اس وقت ہیں انہیں اٹھا دو۔ ابوبکر صدیق رضی اللہ عنہ نے عرض کی میرا باپ آپ پر قربان ہو یا رسول اللہ! یہ سب آپ کے گھر ہی کے افراد ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ہجرت کی اجازت مل گئی ہے۔ ابوبکر صدیق رضی اللہ عنہ نے عرض کی پھر یا رسول اللہ! مجھے رفاقت کا شرف حاصل رہے گا؟ آپ نے فرمایا کہ ہاں۔ عرض کی یا رسول اللہ! میرے باپ آپ پر قربان ہوں ان دو اونٹنیوں میں سے ایک آپ لے لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا لیکن قیمت سے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ہم نے بہت جلدی جلدی سامان سفر تیار کیا اور سفر کا ناشتہ ایک تھیلے میں رکھا۔ اسماء بنت ابی بکر رضی اللہ عنہا نے اپنے پٹکے کے ایک ٹکڑے سے تھیلہ کے منہ کو باندھا۔ اسی وجہ سے انہیں ”ذات النطاق“ ( پٹکے والی ) کہنے لگے۔ پھر نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ثور نامی پہاڑ کی ایک غار میں جا کر چھپ گئے اور تین دن تک اسی میں ٹھہرے رہے۔ عبداللہ بن ابی بکر رضی اللہ عنہما رات آپ حضرات کے پاس ہی گزارتے تھے۔ وہ نوجوان ذہین اور سمجھدار تھے۔ صبح تڑکے میں وہاں سے چل دیتے تھے اور صبح ہوتے ہوتے مکہ کے قریش میں پہنچ جاتے تھے۔ جیسے رات میں مکہ ہی میں رہے ہوں۔ مکہ مکرمہ میں جو بات بھی ان حضرات کے خلاف ہوتی اسے محفوظ رکھتے اور جوں ہی رات کا اندھیرا چھا جاتا غار ثور میں ان حضرات کے پاس پہنچ کر تمام تفصیلات کی اطلاع دیتے۔ ابوبکر رضی اللہ عنہ کے مولیٰ عامر بن فہیرہ رضی اللہ عنہ دودھ دینے والی بکریاں چراتے تھے اور جب رات کا ایک حصہ گزر جاتا تو ان بکریوں کو غار ثور کی طرف ہانک لاتے تھے۔ آپ حضرات بکریوں کے دودھ پر رات گزارتے اور صبح کی پو پھٹتے ہی عامر بن فہیرہ رضی اللہ عنہ وہاں سے روانہ ہو جاتے۔ ان تین راتوں میں انہوں نے ہر رات ایسا ہی کیا۔",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 25
			}
		}
	]
}