{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں معمر نے، انہیں زہری نے، ان سے عروہ بن زبیر نے بیان کیا کہ مجھے اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر پالان بندھا ہوا تھا اور نیچے فدک کی بنی ہوئی ایک مخملی چادر بچھی ہوئی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے سواری پر اپنے پیچھے اسامہ بن زید رضی اللہ عنہما کو بٹھایا تھا۔ آپ بنی حارث بن خزرج میں سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لیے تشریف لے جا رہے تھے۔ یہ جنگ بدر سے پہلے کا واقعہ ہے۔ نبی کریم صلی اللہ علیہ وسلم ایک مجلس پر سے گزرے جس میں مسلمان، بت پرست، مشرک اور یہودی سب ہی شریک تھے۔ عبداللہ بن ابی ابن سلول بھی ان میں تھا۔ مجلس میں عبداللہ بن رواحہ بھی موجود تھے۔ جب مجلس پر سواری کا گرد پڑا تو عبداللہ نے اپنی چادر سے اپنی ناک چھپا لی اور کہا کہ ہمارے اوپر غبار نہ اڑاؤ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے سلام کیا اور وہاں رک گئے اور اتر کر انہیں اللہ کی طرف بلایا اور ان کے لیے قرآن مجید کی تلاوت کی۔ عبداللہ بن ابی ابن سلول بولا، میاں میں ان باتوں کے سمجھنے سے قاصر ہوں اگر وہ چیز حق ہے جو تم کہتے ہو تو ہماری مجلسوں میں آ کر ہمیں تکلیف نہ دیا کرو۔ اس پر ابن رواحہ نے کہا یا رسول اللہ! آپ ہماری مجلسوں میں تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں۔ پھر مسلمانوں، مشرکوں اور یہودیوں میں اس بات پر تو تو میں میں ہونے لگی اور قریب تھا کہ وہ کوئی ارادہ کر بیٹھیں اور ایک دوسرے پر حملہ کر دیں۔ لیکن نبی کریم صلی اللہ علیہ وسلم انہیں برابر خاموش کراتے رہے اور جب وہ خاموش ہو گئے تو نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر بیٹھ کر سعد بن عبادہ رضی اللہ عنہ کے یہاں گئے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا، سعد تم نے نہیں سنا کہ ابوحباب نے آج کیا بات کہی ہے۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ یہ باتیں کہی ہیں۔ سعد نے عرض کیا کہ یا رسول اللہ! اسے معاف کر دیجئیے اور درگزر فرمائیے۔ اللہ تعالیٰ نے وہ حق آپ کو عطا فرمایا ہے جو عطا فرمانا تھا۔ اس بستی ( مدینہ منورہ ) کے لوگ ( آپ کی تشریف آوری سے پہلے ) اس پر متفق ہو گئے تھے کہ اسے تاج پہنا دیں اور شاہی عمامہ اس کے سر پر باندھ دیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کی وجہ سے ختم کر دیا جو اس نے آپ کو عطا فرمایا ہے تو اسے حق سے حسد ہو گیا اور اسی وجہ سے اس نے یہ معاملہ کیا ہے جو آپ نے دیکھا۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اسے معاف کر دیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		}
	]
}