{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "ہم سے یوسف بن بہلول نے بیان کیا، کہا ہم سے ابن ادریس نے بیان کیا، کہا کہ مجھ سے حصین بن عبدالرحمٰن نے بیان کیا، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے زبیر بن عوام اور ابومرثد غنوی کو بھیجا۔ ہم سب گھوڑ سوار تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور جب روضہ خاخ ( مکہ اور مدینہ کے درمیان ایک مقام ) پر پہنچو تو وہاں تمہیں مشرکین کی ایک عورت ملے گی اس کے پاس حاطب بن ابی بلتعہ کا ایک خط ہے جو مشرکین کے پاس بھیجا گیا ہے ( اسے لے آؤ ) ۔ بیان کیا کہ ہم نے اس عورت کو پا لیا وہ اپنے اونٹ پر جا رہی تھی اور وہیں پر ملی ( جہاں ) نبی کریم صلی اللہ علیہ وسلم نے بتایا تھا۔ بیان کیا کہ ہم نے اس سے کہا کہ خط جو تم ساتھ لے جا رہی ہو وہ کہاں ہے؟ اس نے کہا کہ میرے پاس کوئی خط نہیں ہے۔ ہم نے اس کے اونٹ کو بٹھایا اور اس کے کجاوہ میں تلاشی لی لیکن ہمیں کوئی چیز نہیں ملی۔ میرے دونوں ساتھیوں نے کہا کہ ہمیں کوئی خط تو نظر آتا نہیں۔ بیان کیا کہ میں نے کہا، مجھے یقین ہے کہ نبی کریم صلی اللہ علیہ وسلم نے غلط بات نہیں کہی ہے۔ قسم ہے اس کی جس کی قسم کھائی جاتی ہے، تم خط نکالو ورنہ میں تمہیں ننگا کر دوں گا۔ بیان کیا کہ جب اس عورت نے دیکھا کہ میں واقعی اس معاملہ میں سنجیدہ ہوں تو اس نے ازار باندھنے کی جگہ کی طرف ہاتھ بڑھایا، وہ ایک چادر ازار کے طور پر باندھے ہوئے تھی اور خط نکالا۔ بیان کیا کہ ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ حاطب تم نے ایسا کیوں کیا؟ انہوں نے کہا کہ میں اب بھی اللہ اور اس کے رسول پر ایمان رکھتا ہوں۔ میرے اندر کوئی تغیر و تبدیلی نہیں آئی ہے، میرا مقصد ( خط بھیجنے سے ) صرف یہ تھا کہ ( قریش پر آپ کی فوج کشی کی اطلاع دوں اور اس طرح ) میرا ان لوگوں پر احسان ہو جائے اور اس کی وجہ سے اللہ میرے اہل اور مال کی طرف سے ( ان سے ) مدافعت کرائے۔ آپ کے جتنے مہاجر صحابہ ہیں ان کے مکہ مکرمہ میں ایسے افراد ہیں جن کے ذریعہ اللہ ان کے مال اور ان کے گھر والوں کی حفاظت کرائے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے سچ کہ دیا ہے اب تم لوگ ان کے بارے میں سوا بھلائی کے اور کچھ نہ کہو بیان کیا کہ اس پر عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ اس شخص نے اللہ اور اس کے رسول اور مومنوں کے ساتھ خیانت کی، مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: عمر! تمہیں کیا معلوم، اللہ تعالیٰ بدر کی لڑائی میں شریک صحابہ کی زندگی پر مطلع تھا اور اس کے باوجود فرمایا کہ تم جو چاہو کرو، تمہارے لیے جنت لکھ دی گئی ہے، بیان کیا کہ اس پر عمر رضی اللہ عنہ کی آنکھیں اشک آلود ہو گئیں اور عرض کیا: اللہ اور اس کے رسول ہی زیادہ جاننے والے ہیں۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		}
	]
}