{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا کہا ہم سے اعمش نے بیان کیا، کہا ہم سے زید بن وہب نے بیان کیا ( کہا کہ ) واللہ ہم سے ابوذر رضی اللہ عنہ نے مقام ربذہ میں بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رات کے وقت مدینہ منورہ کی کالی پتھروں والی زمین پر چل رہا تھا کہ احد پہاڑ دکھائی دیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوذر! مجھے پسند نہیں کہ اگر احد پہاڑ کے برابر بھی میرے پاس سونا ہو اور مجھ پر ایک رات بھی اس طرح گزر جائے یا تین رات کہ اس میں سے ایک دینار بھی میرے پاس باقی بچے۔ سوائے اس کے جو میں قرض کی ادائیگی کے لیے محفوظ رکھ لوں میں اس سارے سونے کو اللہ کی مخلوق میں اس اس طرح تقسیم کر دوں گا۔ ابوذر رضی اللہ عنہ نے اس کی کیفیت ہمیں اپنے ہاتھ سے لپ بھر کر دکھائی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اے ابوذر! میں نے عرض کیا «لبيك وسعديك‏.‏» یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زیادہ جمع کرنے والے ہی ( ثواب کی حیثیت سے ) کم حاصل کرنے والے ہوں گے۔ سوائے اس کے جو اللہ کے بندوں پر مال اس اس طرح یعنی کثرت کے ساتھ خرچ کرے۔ پھر فرمایا یہیں ٹھہرے رہو ابوذر! یہاں سے اس وقت تک نہ ہٹنا جب تک میں واپس نہ آ جاؤں۔ پھر آپ صلی اللہ علیہ وسلم تشریف لے گئے اور نظروں سے اوجھل ہو گئے۔ اس کے بعد میں نے آواز سنی اور مجھے خطرہ ہوا کہ کہیں نبی کریم صلی اللہ علیہ وسلم کو کوئی پریشانی نہ پیش آ گئی ہو۔ اس لیے میں نے ( نبی کریم صلی اللہ علیہ وسلم کو دیکھنے کے لیے ) جانا چاہا لیکن فوراً ہی نبی کریم صلی اللہ علیہ وسلم کا یہ ارشاد یاد آیا کہ یہاں سے نہ ہٹنا۔ چنانچہ میں وہیں رک گیا ( جب آپ تشریف لائے تو ) میں نے عرض کی۔ میں نے آواز سنی تھی اور مجھے خطرہ ہو گیا تھا کہ کہیں آپ کو کوئی پریشانی نہ پیش آ جائے پھر مجھے آپ کا ارشاد یاد آیا اس لیے میں یہیں ٹھہر گیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ جبرائیل علیہ السلام تھے۔ میرے پاس آئے تھے اور مجھے خبر دی ہے کہ میری امت کا جو شخص بھی اس حال میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہ ٹھہراتا ہو تو وہ جنت میں جائے گا۔ میں نے عرض کیا: یا رسول اللہ! اگرچہ اس نے زنا اور چوری کی ہو؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر اس نے زنا اور چوری بھی کی ہو۔ ( اعمش نے بیان کیا کہ ) میں نے زید بن وہب سے کہا کہ مجھے معلوم ہوا ہے کہ اس حدیث کے راوی ابودرداء رضی اللہ عنہ ہیں؟ زید نے فرمایا میں گواہی دیتا ہوں کہ یہ حدیث مجھ سے ابوذر رضی اللہ عنہ نے مقام ربذہ میں بیان کی تھی۔ اعمش نے بیان کیا کہ مجھ سے ابوصالح نے حدیث بیان کی اور ان سے ابو الدرداء رضی اللہ عنہ نے اسی طرح بیان کیا اور ابوشہاب نے اعمش سے بیان کیا۔",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		}
	]
}