{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6316,
			"arabicnumber": 6316,
			"text": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے عبدالرحمٰن ابن مہدی نے، ان سے سفیان ثوری نے، ان سے سلمہ بن کہیل نے، ان سے کریب نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ میں میمونہ ( رضی اللہ عنہا ) کے یہاں ایک رات سویا تو نبی کریم صلی اللہ علیہ وسلم اٹھے اور آپ نے اپنی حوائج ضرورت پوری کرنے کے بعد اپنا چہرہ دھویا، پھر دونوں ہاتھ دھوئے اور پھر سو گئے اس کے بعد آپ کھڑے ہو گئے اور مشکیزہ کے پاس گئے اور آپ نے اس کا منہ کھولا پھر درمیانہ وضو کیا ( نہ مبالغہ کے ساتھ نہ معمولی اور ہلکے قسم کا، تین تین مرتبہ سے ) کم دھویا۔ البتہ پانی ہر جگہ پہنچا دیا۔ پھر آپ نے نماز پڑھی۔ میں بھی کھڑا ہوا اور آپ کے پیچھے ہی رہا کیونکہ میں اسے پسند نہیں کرتا تھا کہ نبی کریم صلی اللہ علیہ وسلم یہ سمجھیں کہ میں آپ کا انتظار کر رہا تھا۔ میں نے بھی وضو کر لیا تھا۔ نبی کریم صلی اللہ علیہ وسلم جب کھڑے ہو کر نماز پڑھنے لگے تو میں بھی آپ کے بائیں طرف کھڑا ہو گیا۔ آپ نے میرا کان پکڑ کر دائیں طرف کر دیا، میں نے نبی کریم صلی اللہ علیہ وسلم ( کی اقتداء میں ) تیرہ رکعت نماز مکمل کی۔ اس کے بعد آپ سو گئے اور آپ کی سانس میں آواز پیدا ہونے لگی۔ نبی کریم صلی اللہ علیہ وسلم جب سوتے تھے تو آپ کی سانس میں آواز پیدا ہونے لگتی تھی۔ اس کے بعد بلال رضی اللہ عنہ نے آپ کو نماز کی اطلاع دی چنانچہ آپ نے ( نیا وضو ) کئے بغیر نماز پڑھی۔ نبی کریم صلی اللہ علیہ وسلم اپنی دعا میں یہ کہتے تھے «اللهم اجعل في قلبي نورا،‏‏‏‏ وفي بصري نورا،‏‏‏‏ وفي سمعي نورا،‏‏‏‏ وعن يميني نورا،‏‏‏‏ وعن يساري نورا،‏‏‏‏ وفوقي نورا،‏‏‏‏ وتحتي نورا،‏‏‏‏ وأمامي نورا،‏‏‏‏ وخلفي نورا،‏‏‏‏ واجعل لي نورا» ”اے اللہ! میرے دل میں نور پیدا کر، میری نظر میں نور پیدا کر، میرے کان میں نور پیدا کر، میرے دائیں طرف نور پیدا کر، میرے بائیں طرف نور پیدا کر، میرے اوپر نور پیدا کر، میرے نیچے نور پیدا کر میرے آگے نور پیدا کر، میرے پیچھے نور پیدا کر اور مجھے نور عطا فرما۔“ کریب ( راوی حدیث ) نے بیان کیا کہ میرے پاس مزید سات لفظ محفوظ ہیں۔ پھر میں نے عباس رضی اللہ عنہما کے ایک صاحب زادے سے ملاقات کی تو انہوں نے مجھ سے ان کے متعلق بیان کیا کہ «عصبي ولحمي ودمي وشعري وبشري،‏‏‏‏ وذكر خصلتين‏.‏» ”میرے پٹھے، میرا گوشت، میرا خون، میرے بال اور میرا چمڑا ان سب میں نور بھر دے۔“ اور دو چیزوں کا اور بھی ذکر کیا۔",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 13
			}
		}
	]
}