{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6565,
			"arabicnumber": 6565,
			"text": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے ابوعوانہ نے، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ قیامت کے دن لوگوں کو جمع کرے گا۔ اس وقت لوگ کہیں گے کہ اگر ہم اپنے رب کے حضور میں کسی کی شفاعت لے جائیں تو نفع بخش ثابت ہو سکتی ہے۔ ممکن ہے ہم اپنی اس حالت سے نجات پا جائیں۔ چنانچہ لوگ آدم علیہ السلام کے پاس آئیں گے اور عرض کریں گے آپ ہی وہ بزرگ نبی ہیں جنہیں اللہ تعالیٰ نے اپنے ہاتھ سے بنایا اور آپ کے اندر اپنی چھپائی ہوئی روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا، آپ ہمارے رب کے حضور میں ہماری شفاعت کریں۔ وہ کہیں گے کہ میں تو اس لائق نہیں ہوں، پھر وہ اپنی لغزش یاد کریں گے اور کہیں گے کہ نوح کے پاس جاؤ، وہ سب سے پہلے رسول ہیں جنہیں اللہ تعالیٰ نے بھیجا۔ لوگ نوح علیہ السلام کے پاس آئیں گے لیکن وہ بھی یہی جواب دیں گے کہ میں اس لائق نہیں ہوں۔ وہ اپنی لغزش کا ذکر کریں گے اور کہیں کہ تم ابراہیم کے پاس جاؤ جنہیں اللہ تعالیٰ نے اپنا خلیل بنایا تھا۔ لوگ ان کے پاس آئیں گے لیکن یہ بھی یہی کہیں گے کہ میں اس لائق نہیں ہوں، اپنی خطا کا ذکر کریں گے اور کہیں گے کہ تم لوگ موسیٰ کے پاس جاؤ جن سے اللہ تعالیٰ نے کلام کیا تھا۔ لوگ موسیٰ علیہ السلام کے پاس جائیں گے لیکن وہ بھی یہی جواب دیں گے کہ میں اس لائق نہیں ہوں، اپنی خطا کا ذکر کریں گے اور کہیں گے کہ عیسیٰ علیہ السلام کے پاس جاؤ۔ لوگ عیسیٰ علیہ السلام کے پاس جائیں گے، لیکن یہ بھی کہیں گے کہ میں اس لائق نہیں ہوں، محمد صلی اللہ علیہ وسلم کے پاس جاؤ کیونکہ ان کے تمام اگلے پچھلے گناہ معاف کر دئیے گئے ہیں۔ چنانچہ لوگ میرے پاس آئیں گے۔ اس وقت میں اپنے رب سے ( شفاعت کی ) اجازت چاہوں گا اور سجدہ میں گر جاؤں گا۔ اللہ تعالیٰ جتنی دیر تک چاہے گا مجھے سجدہ میں رہنے دے گا۔ پھر کہا جائے گا کہ اپنا سر اٹھا لو، مانگو دیا جائے گا، کہو سنا جائے گا، شفاعت کرو، شفاعت قبول کی جائے گی۔ میں اپنے رب کی اس وقت ایسی حمد بیان کروں گا کہ جو اللہ تعالیٰ مجھے سکھائے گا۔ پھر شفاعت کروں گا اور میرے لیے حد مقرر کر دی جائے گی اور میں لوگوں کو جہنم سے نکال کر جنت میں داخل کر دوں گا اور اسی طرح سجدہ میں گر جاؤں گا، تیسری یا چوتھی مرتبہ جہنم میں صرف وہی لوگ باقی رہ جائیں گے جنہیں قرآن نے روکا ہے ( یعنی جن کے جہنم میں ہمیشہ رہنے کا ذکر قرآن میں صراحت کے ساتھ ہے ) قتادہ رحمہ اللہ اس موقع پر کہا کرتے کہ اس سے وہ لوگ مراد ہیں جن پر جہنم میں ہمیشہ رہنا واجب ہو گیا ہے۔",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 154
			}
		}
	]
}