{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6688,
			"arabicnumber": 6688,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ ابوطلحہ رضی اللہ عنہ نے ( اپنی بیوی ) ام سلیم رضی اللہ عنہا سے کہا کہ میں سن کر آ رہا ہوں نبی کریم صلی اللہ علیہ وسلم کی آواز ( فاقوں کی وجہ سے ) کمزور پڑ گئی ہے اور میں نے آواز سے آپ کے فاقہ کا اندازہ لگایا ہے۔ کیا تمہارے پاس کھانے کی کوئی چیز ہے؟ انہوں نے کہا ہاں۔ چنانچہ انہوں نے جَو کی چند روٹیاں نکالیں اور ایک اوڑھنی لے کر روٹی کو اس کے ایک کونے سے لپیٹ دیا اور اسے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھجوایا۔ میں لے کر گیا تو میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف رکھتے ہیں اور آپ کے ساتھ کچھ لوگ ہیں، میں ان کے پاس جا کے کھڑا ہو گیا تو نبی کریم صلی اللہ علیہ وسلم نے پوچھا، کیا تمہیں ابوطلحہ نے بھیجا ہے، میں نے عرض کیا: جی ہاں۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان لوگوں سے کہا جو ساتھ تھے کہ اٹھو اور چلو، میں ان کے آگے آگے چل رہا تھا۔ آخر میں ابوطلحہ رضی اللہ عنہ کے یہاں پہنچا اور ان کو اطلاع دی۔ ابوطلحہ نے کہا: ام سلیم! رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ہیں اور ہمارے پاس تو کوئی ایسا کھانا نہیں ہے جو سب کو پیش کیا جا سکے؟ انہوں نے کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے۔ پھر ابوطلحہ رضی اللہ عنہ باہر نکلے اور نبی کریم صلی اللہ علیہ وسلم سے ملے، اس کے بعد نبی کریم صلی اللہ علیہ وسلم اور ابوطلحہ گھر کی طرف بڑھے اور اندر گئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ام سلیم! جو کچھ تمہارے پاس ہے میرے پاس لاؤ۔ وہ یہی روٹیاں لائیں۔ راوی نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم کے حکم سے ان روٹیوں کو چورا کر دیا گیا اور ام سلیم رضی اللہ عنہا نے اپنی ایک ( گھی کی ) کپی کو نچوڑا گیا یہی سالن تھا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے جیسا کہ اللہ نے چاہا دعا پڑھی اور فرمایا کہ دس دس آدمیوں کو اندر بلاؤ انہیں بلایا گیا اور اس طرح سب لوگوں نے کھایا اور خوب سیر ہو گئے، حاضرین کی تعداد ستر یا اسی آدمیوں کی تھی۔",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 65
			}
		}
	]
}