{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6830,
			"arabicnumber": 6830,
			"text": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ میں کئی مہاجرین کو ( قرآن مجید ) پڑھایا کرتا تھا۔ عبدالرحمٰن بن عوف رضی اللہ عنہ بھی ان میں سے ایک تھے۔ ابھی میں منیٰ میں ان کے مکان پر تھا اور وہ عمر رضی اللہ عنہ کے آخری حج میں ( سنہ 23 ھ ) ان کے ساتھ تھے کہ وہ میرے پاس لوٹ کر آئے اور کہا کہ کاش تم اس شخص کو دیکھتے جو آج امیرالمؤمنین کے پاس آیا تھا۔ اس نے کہا کہ اے امیرالمؤمنین! کیا آپ فلاں صاحب سے یہ پوچھ گچھ کریں گے جو یہ کہتے ہیں کہ اگر عمر کا انتقال ہو گیا تو میں صلاح صاحب طلحہ بن عبیداللہ سے بیعت کروں گا کیونکہ واللہ ابوبکر رضی اللہ عنہ کی بغیر سوچے سمجھے بیعت تو اچانک ہو گئی اور پھر وہ مکمل ہو گئی تھی۔ اس پر عمر رضی اللہ عنہ بہت غصہ ہوئے اور کہا میں ان شاءاللہ شام کے وقت لوگوں سے خطاب کروں گا اور انہیں ان لوگوں سے ڈراؤں گا جو زبردستی سے دخل درمعقولات کرنا چاہتے ہیں۔ عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا کہ اس پر میں نے عرض کیا: یا امیرالمؤمنین! ایسا نہ کیجئے۔ حج کے موسم میں کم سمجھی اور برے بھلے ہر ہی قسم کے لوگ جمع ہیں اور جب آپ خطاب کے لیے کھڑے ہوں گے تو آپ کے قریب یہی لوگ زیادہ ہوں گے اور مجھے ڈر ہے کہ آپ کھڑے ہو کر کوئی بات کہیں اور وہ چاروں طرف پھیل جائے، لیکن پھیلانے والے اسے صحیح طور پر یاد نہ رکھ سکیں گے اور اس کے غلط معانی پھیلانے لگیں گے، اس لیے مدینہ منورہ پہنچنے تک کا انتظار کر لیجئے کیونکہ وہ ہجرت اور سنت کا مقام ہے۔ وہاں آپ کو خالص دینی سمجھ بوجھ رکھنے والے اور شریف لوگ ملیں گے، وہاں آپ جو کچھ کہنا چاہتے ہیں اعتماد کے ساتھ ہی فرما سکیں گے اور علم والے آپ کی باتوں کو یاد بھی رکھیں گے اور جو صحیح مطلب ہے وہی بیان کریں گے۔ عمر رضی اللہ عنہ نے کہا ہاں اچھا اللہ کی قسم میں مدینہ منورہ پہنچتے ہی سب سے پہلے لوگوں کو اسی مضمون کا خطبہ دوں گا۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر ہم ذی الحجہ کے مہینہ کے آخر میں مدینہ منورہ پہنچے۔ جمعہ کے دن سورج ڈھلتے ہی ہم نے ( مسجد نبوی ) پہنچنے میں جلدی کی اور میں نے دیکھا کہ سعید بن زید بن عمرو بن نفیل ممبر کی جڑ کے پاس بیٹھے ہوئے تھے۔ میں بھی ان کے پاس بیٹھ گیا۔ میرا ٹخنہ ان کے ٹخنے سے لگا ہوا تھا۔ تھوڑی ہی دیر میں عمر رضی اللہ عنہ بھی باہر نکلے، جب میں نے انہیں آتے دیکھا تو سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ سے میں نے کہا کہ آج عمر رضی اللہ عنہ ایسی بات کہیں گے جو انہوں نے اس سے پہلے خلیفہ بنائے جانے کے بعد کبھی نہیں کہی تھی۔ لیکن انہوں نے اس کو نہ مانا اور کہا کہ میں تو نہیں سمجھتا کہ آپ کوئی ایسی بات کہیں گے جو پہلے کبھی نہیں کہی تھی۔ پھر عمر رضی اللہ عنہ ممبر پر بیٹھے اور جب مؤذن اذان دے کر خاموش ہوا تو آپ کھڑے ہوئے اور اللہ تعالیٰ کی ثنا اس کی شان کے مطابق بیان کرنے کے بعد فرمایا: امابعد! آج میں تم سے ایک ایسی بات کہوں گا جس کا کہنا میری تقدیر میں لکھا ہوا تھا، مجھ کو نہیں معلوم کہ شاید میری یہ گفتگو موت کے قریب کی آخری گفتگو ہو۔ پس جو کوئی اسے سمجھے اور محفوظ رکھے اسے چاہئے کہ اس بات کو اس جگہ تک پہنچا دے جہاں تک اس کی سواری اسے لے جا سکتی ہے اور جسے خوف ہو کہ اس نے بات نہیں سمجھی ہے تو اس کے لیے جائز نہیں ہے کہ میری طرف غلط بات منسوب کرے۔ بلاشبہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا اور آپ پر کتاب نازل کی، کتاب اللہ کی صورت میں جو کچھ آپ پر نازل ہوا، ان میں آیت رجم بھی تھی۔ ہم نے اسے پڑھا تھا سمجھا تھا اور یاد رکھا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے خود ( اپنے زمانہ میں ) رجم کرایا۔ پھر آپ کے بعد ہم نے بھی رجم کیا لیکن مجھے ڈر ہے کہ اگر وقت یوں ہی آگے بڑھتا رہا تو کہیں کوئی یہ نہ دعویٰ کر بیٹھے کہ رجم کی آیت ہم کتاب اللہ میں نہیں پاتے اور اس طرح وہ اس فریضہ کو چھوڑ کر گمراہ ہوں جسے اللہ تعالیٰ نے نازل کیا تھا۔ یقیناً رجم کا حکم کتاب اللہ سے اس شخص کے لیے ثابت ہے جس نے شادی ہونے کے بعد زنا کیا ہو۔ خواہ مرد ہوں یا عورتیں، بشرطیکہ گواہی مکمل ہو جائے یا حمل ظاہر ہو یا وہ خود اقرار کر لے پھر کتاب اللہ کی آیتوں میں ہم یہ بھی پڑھتے تھے کہ اپنے حقیقی باپ دادوں کے سوا دوسروں کی طرف اپنے آپ کو منسوب نہ کرو۔ کیونکہ یہ تمہارا کفر اور انکار ہے کہ تم اپنے اصل باپ دادوں کے سوا دوسروں کی طرف اپنی نسبت کرو۔ ہاں اور سن لو کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ میری تعریف حد سے بڑھا کر نہ کرنا جس طرح عیسیٰ ابن مریم عیلہما السلام کی حد سے بڑھا کر تعریفیں کی گئیں ( ان کو اللہ کو بیٹا بنا دیا گیا ) بلکہ ( میرے لیے صرف یہ کہو کہ ) میں اللہ کا بندہ اور اس کا رسول ہوں اور مجھے یہ بھی معلوم ہوا ہے کہ تم میں سے کسی نے یوں کہا ہے کہ واللہ اگر عمر کا انتقال ہو گیا تو میں فلاں سے بیعت کروں گا دیکھو تم میں سے کسی کو یہ دھوکا نہ ہو کہ ابوبکر رضی اللہ عنہ کی بیعت ناگاہ ہوئی اور اللہ نے ناگہانی بیعت میں جو برائی ہوئی ہے اس سے تم کو بچائے رکھا اس کی وجہ یہ ہوئی کہ تم کو اللہ تعالیٰ نے اس کے شر سے محفوظ رکھا اور تم میں کوئی شخص ایسا نہیں جو ابوبکر رضی اللہ عنہ جیسا متقی، خدا ترس ہو۔ تم میں کون ہے جس سے ملنے کے لیے اونٹ چلائے جاتے ہوں۔ دیکھو خیال رکھو کوئی شخص کسی سے بغیر مسلمانوں کے صلاح مشورہ اور اتفاق اور غلبہ آراء کے بغیر بیعت نہ کرے جو کوئی ایسا کرے گا اس کا نتیجہ یہی ہو گا کہ بیعت کرنے والا اور بیعت لینے والا دونوں اپنی جان گنوا دیں گے اور سن لو بلاشبہ جس وقت نبی کریم صلی اللہ علیہ وسلم کی وفات ہوی تو ابوبکر رضی اللہ عنہ ہم سب سے بہتر تھے البتہ انصار نے ہماری مخالفت کی تھی اور وہ سب لوگ سقیفہ بن ساعدہ میں جمع ہو گئے تھے۔ اسی طرح علی اور زبیر رضی اللہ عنہما اور ان کے ساتھیوں نے بھی ہماری مخالفت کی تھی اور باقی مہاجرین ابوبکر رضی اللہ عنہ کے پاس جمع ہو گئے تھے۔ اس وقت میں نے ابوبکر رضی اللہ عنہ سے کہا: اے ابوبکر! ہمیں اپنے ان انصاری بھائیوں کے پاس لے چلئے۔ چنانچہ ہم ان سے ملاقات کے ارادہ سے چل پڑے۔ جب ہم ان کے قریب پہنچے تو ہماری، انہیں کے دو نیک لوگوں سے ملاقات ہوئی اور انہوں نے ہم سے بیان کیا کہ انصاری آدمیوں نے یہ بات ٹھہرائی ہے کہ ( سعد بن عبادہ کو خلیفہ بنائیں ) اور انہوں نے پوچھا۔ حضرات مہاجرین آپ لوگ کہاں جا رہے ہیں۔ ہم نے کہا کہ ہم اپنے ان انصاری بھائیوں کے پاس جا رہے ہیں۔ انہوں نے کہا کہ آپ لوگ ہرگز وہاں نہ جائیں بلکہ خود جو کرنا ہے کر ڈالو لیکن میں نے کہا کہ بخدا ہم ضرور جائیں گے۔ چنانچہ ہم آگے بڑھے اور انصار کے پاس سقیفہ بنی ساعدہ میں پہنچے مجلس میں ایک صاحب ( سردار خزرج ) چادر اپنے سارے جسم پر لپیٹے درمیان میں بیٹھے تھے۔ میں نے پوچھا کہ یہ کون صاحب ہیں تو لوگوں نے بتایا کہ سعد بن عبادہ رضی اللہ عنہ ہیں۔ میں نے پوچھا کہ انہیں کیا ہو گیا ہے؟ لوگوں نے بتایا کہ بخار آ رہا ہے۔ پھر ہمارے تھوڑی دیر تک بیٹھنے کے بعد ان کے خطیب نے کلمہ شہادت پڑھا اور اللہ تعالیٰ کی اس کی شان کے مطابق تعریف کی۔ پھر کہا: امابعد! ہم اللہ کے دین کے مددگار ( انصار ) اور اسلام کے لشکر ہیں اور تم اے گروہ مہاجرین! کم تعداد میں ہو۔ تمہاری یہ تھوڑی سی تعداد اپنی قوم قریش سے نکل کر ہم لوگوں میں آ رہے ہو۔ تم لوگ یہ چاہتے ہو کہ ہماری بیخ کنی کرو اور ہم کو خلافت سے محروم کر کے آپ خلیفہ بن بیٹھو یہ کبھی نہیں ہو سکتا۔ جب وہ خطبہ پورا کر چکے تو میں نے بولنا چاہا۔ میں نے ایک عمدہ تقریر اپنے ذہن میں ترتیب دے رکھی تھی۔ میری بڑی خواہش تھی کہ ابوبکر رضی اللہ عنہ کے بات کرنے سے پہلے ہی میں اس کو شروع کر دوں اور انصار کی تقریر سے جو ابوبکر رضی اللہ عنہ کو غصہ پیدا ہوا ہے اس کو دور کر دوں جب میں نے بات کرنی چاہی تو ابوبکر رضی اللہ عنہ نے کہا ذرا ٹھہرو میں نے ان کو ناراض کرنا برا جانا۔ آخر انہوں نے ہی تقریر شروع کی اور اللہ کی قسم! وہ مجھ سے زیادہ عقلمند اور مجھ سے زیادہ سنجیدہ اور متین تھے۔ میں نے جو تقریر اپنے دل میں سوچ لی تھی اس میں سے انہوں نے کوئی بات نہیں چھوڑی۔ فی البدیہہ وہی کہی بلکہ اس سے بھی بہتر پھر وہ خاموش ہو گئے۔ ابوبکر رضی اللہ عنہ کی تقریر کا خلاصہ یہ تھا کہ انصاری بھائیو! تم نے جو اپنی فضیلت اور بزرگی بیان کی ہے وہ سب درست ہے اور تم بیشک اس کے لیے سزاوار ہو مگر خلافت قریش کے سوا اور کسی خاندان والوں کے لیے نہیں ہو سکتی۔ کیونکہ قریش ازروئے نسب اور ازروئے خاندان تمام عرب قوموں میں بڑھ چڑھ کر ہیں اب تم لوگ ایسا کرو کہ ان دو آدمیوں میں سے کسی سے بیعت کر لو۔ ابوبکر رضی اللہ عنہ نے میرا اور ابوعبیدہ بن جراح کا ہاتھ تھاما وہ ہمارے بیچ میں بیٹھے ہوئے تھے، ان ساری گفتگو میں صرف یہی ایک بات مجھ سے میرے سوا ہوئی۔ واللہ میں آگے کر دیا جاتا اور بےگناہ میری گردن مار دی جاتی تو یہ مجھے اس سے زیادہ پسند تھا کہ مجھے ایک ایسی قوم کا امیر بنایا جاتا جس میں ابوبکر رضی اللہ عنہ خود موجود ہوں۔ میرا اب تک یہی خیال ہے یہ اور بات ہے کہ وقت پر نفس مجھے بہکا دے اور میں کوئی دوسرا خیال کروں جو اب نہیں کرنا۔ پھر انصار میں سے ایک کہنے والا حباب بن منذر یوں کہنے لگا سنو سنو میں ایک لکڑی ہوں کہ جس سے اونٹ اپنا بدن رگڑ کر کھجلی کی تکلیف رفع کرتے ہیں اور میں وہ باڑ ہوں جو درختوں کے اردگرد حفاظت کے لیے لگائی جاتی ہے۔ میں ایک عمدہ تدبیر بتاتا ہوں ایسا کرو دو خلیفہ رہیں ( دونوں مل کر کام کریں ) ایک ہماری قوم کا اور ایک قریش والوں کا۔ مہاجرین قوم کا اب خوب شورغل ہونے لگا کوئی کچھ کہتا کوئی کچھ کہتا۔ میں ڈر گیا کہ کہیں مسلمانوں میں پھوٹ نہ پڑ جائے آخر میں کہہ اٹھا ابوبکر! اپنا ہاتھ بڑھاؤ، انہوں نے ہاتھ بڑھایا میں نے ان سے بیعت کی اور مہاجرین جتنے وہاں موجود تھے انہوں نے بھی بیعت کر لی پھر انصاریوں نے بھی بیعت کر لی ( چلو جھگڑا تمام ہوا جو منظور الٰہی تھا وہی ظاہر ہوا ) اس کے بعد ہم سعد بن عبادہ کی طرف بڑھے ( انہوں نے بیعت نہیں کی ) ایک شخص انصار میں سے کہنے لگا: بھائیو! بیچارے سعد بن عبادہ کا تم نے خون کر ڈالا۔ میں نے کہا اللہ اس کا خون کرے گا۔ عمر رضی اللہ عنہ نے اس خطبے میں یہ بھی فرمایا اس وقت ہم کو ابوبکر رضی اللہ عنہ کی خلافت سے زیادہ کوئی چیز ضروری معلوم نہیں ہوتی کیونکہ ہم کو ڈر پیدا ہوا کہیں ایسا نہ ہو ہم لوگوں سے جدا رہیں اور ابھی انہوں نے کسی سے بیعت نہ کی ہو وہ کسی اور شخص سے بیعت کر بیٹھیں تب دو صورتوں سے خالی نہیں ہوتا یا تو ہم بھی جبراً و قہراً اسی سے بیعت کر لیتے یا لوگوں کی مخالفت کرتے تو آپس میں فساد پیدا ہوتا ( پھوٹ پڑ جاتی ) دیکھو پھر یہی کہتا ہوں جو شخص کسی سے بن سوچے سمجھے، بن صلاح و مشورہ بیعت کر لے تو دوسرے لوگ بیعت کرنے والے کی پیروی نہ کرے، نہ اس کی جس سے بیعت کی گئی ہے کیونکہ وہ دونوں اپنی جان گنوائیں گے۔",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 56
			}
		}
	]
}