{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "ہم سے احمد بن یونس نے بیان کیا، کہا کہ ہمیں زائدہ بن قدامہ نے موسیٰ بن ابی عائشہ سے خبر دی، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے، انہوں نے کہا کہ میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور کہا، کاش! رسول اللہ صلی اللہ علیہ وسلم کی بیماری کی حالت آپ ہم سے بیان کرتیں، ( تو اچھا ہوتا ) انہوں نے فرمایا کہ ہاں ضرور سن لو۔ آپ صلی اللہ علیہ وسلم کا مرض بڑھ گیا۔ تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا لوگوں نے نماز پڑھ لی؟ ہم نے عرض کی جی نہیں یا رسول اللہ! لوگ آپ کا انتظام کر رہے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے لیے ایک لگن میں پانی رکھ دو۔ عائشہ رضی اللہ عنہا نے کہا کہ ہم نے پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا۔ پھر آپ اٹھنے لگے، لیکن آپ بیہوش ہو گئے۔ جب ہوش ہوا تو پھر آپ نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہے۔ ہم نے عرض کی نہیں، یا رسول اللہ! لوگ آپ کا انتظار کر رہے ہیں۔ آپ صلی اللہ علیہ وسلم نے ( پھر ) فرمایا کہ لگن میں میرے لیے پانی رکھ دو۔ عائشہ رضی اللہ عنہا فرماتی ہیں کہ ہم نے پھر پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل فرمایا۔ پھر اٹھنے کی کوشش کی لیکن ( دوبارہ ) پھر آپ بیہوش ہو گئے۔ جب ہوش ہوا تو آپ نے پھر یہی فرمایا کہ کیا لوگوں نے نماز پڑھ لی ہے۔ ہم نے عرض کی کہ نہیں یا رسول اللہ! لوگ آپ کا انتظار کر رہے ہیں۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ لگن میں پانی لاؤ اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا۔ پھر اٹھنے کی کوشش کی، لیکن پھر آپ بیہوش ہو گئے۔ پھر جب ہوش ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہم نے عرض کی کہ نہیں یا رسول اللہ! وہ آپ کا انتظار کر رہے ہیں۔ لوگ مسجد میں عشاء کی نماز کے لیے بیٹھے ہوئے نبی کریم صلی اللہ علیہ وسلم کا انتظار کر رہے تھے۔ آخر آپ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کے پاس آدمی بھیجا اور حکم فرمایا کہ وہ نماز پڑھا دیں۔ بھیجے ہوئے شخص نے آ کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کو نماز پڑھانے کے لیے حکم فرمایا ہے۔ ابوبکر رضی اللہ عنہ بڑے نرم دل انسان تھے۔ انہوں نے عمر رضی اللہ عنہ سے کہا کہ تم نماز پڑھاؤ، لیکن عمر رضی اللہ عنہ نے جواب دیا کہ آپ اس کے زیادہ حقدار ہیں۔ آخر ( بیماری ) کے دنوں میں ابوبکر رضی اللہ عنہ نماز پڑھاتے رہے۔ پھر جب نبی کریم صلی اللہ علیہ وسلم کو مزاج کچھ ہلکا معلوم ہوا تو دو مردوں کا سہارا لے کر جن میں ایک عباس رضی اللہ عنہ تھے ظہر کی نماز کے لیے گھر سے باہر تشریف لائے اور ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے، جب انہوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا تو پیچھے ہٹنا چاہا، لیکن نبی کریم صلی اللہ علیہ وسلم نے اشارے سے انہیں روکا کہ پیچھے نہ ہٹو! پھر آپ نے ان دونوں مردوں سے فرمایا کہ مجھے ابوبکر کے بازو میں بٹھا دو۔ چنانچہ دونوں نے آپ کو ابوبکر رضی اللہ عنہ کے بازو میں بٹھا دیا۔ راوی نے کہا کہ پھر ابوبکر رضی اللہ عنہ نماز میں نبی کریم صلی اللہ علیہ وسلم کی پیروی کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی نماز کی پیروی کر رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم بیٹھے بیٹھے نماز پڑھ رہے تھے۔ عبیداللہ نے کہا کہ پھر میں عبداللہ بن عباس رضی اللہ عنہما کی خدمت میں گیا اور ان سے عرض کی کہ عائشہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کی بیماری کے بارے میں جو حدیث بیان کی ہے کیا میں وہ آپ کو سناؤں؟ انہوں نے فرمایا کہ ضرور سناؤ۔ میں نے یہ حدیث سنا دی۔ انہوں نے کسی بات کا انکار نہیں کیا۔ صرف اتنا کہا کہ عائشہ رضی اللہ عنہا نے ان صاحب کا نام بھی تم کو بتایا جو عباس رضی اللہ عنہ کے ساتھ تھے۔ میں نے کہا نہیں۔ آپ نے فرمایا وہ علی رضی اللہ عنہ تھے۔",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		}
	]
}