{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6899,
			"arabicnumber": 6899,
			"text": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے ابوبشر اسماعیل بن ابراہیم الاسدی نے بیان کیا، کہا ہم سے حجاج بن ابی عثمان نے بیان کیا، ان سے آل ابوقلابہ کے غلام ابورجاء نے بیان کیا اس نے کہا کہ مجھ سے ابوقلابہ نے بیان کیا کہ عمر بن عبدالعزیز نے ایک دن دربار عام کیا اور سب کو اجازت دی۔ لوگ داخل ہوئے تو انہوں نے پوچھا: قسامہ کے بارے میں تمہارا کیا خیال ہے؟ کسی نے کہا کہ قسامہ کے ذریعہ قصاص لینا حق ہے اور خلفاء نے اس کے ذریعہ قصاص لیا ہے۔ اس پر انہوں نے مجھ سے پوچھا: ابوقلابہ! تمہاری کیا رائے ہے؟ اور مجھے عوام کے ساتھ لا کھڑا کر دیا۔ میں نے عرض کیا: یا امیرالمؤمنین! آپ کے پاس عرب کے سردار اور شریف لوگ رہتے ہیں آپ کی کیا رائے ہو گی اگر ان میں سے پچاس آدمی کسی دمشقی کے شادی شدہ شخص کے بارے میں زنا کی گواہی دیں جبکہ ان لوگوں نے اس شخص کو دیکھا بھی نہ ہو کیا آپ ان کی گواہی پر اس شخص کو رجم کر دیں گے۔ امیرالمؤمنین نے فرمایا کہ نہیں۔ پھر میں نے کہا کہ آپ کا کیا خیال ہے اگر انہیں ( اشراف عرب ) میں سے پچاس افراد حمص کے کسی شخص کے متعلق چوری کی گواہی دے دیں اس کو بغیر دیکھے تو کیا آپ اس کا ہاتھ کاٹ دیں گے؟ فرمایا کہ نہیں۔ پھر میں نے کہا، پس اللہ کی قسم کہ رسول اللہ صلی اللہ علیہ وسلم نے کبھی کسی کو تین حالتوں کے سوا قتل نہیں کرایا۔ ایک وہ شخص جس نے کسی کو ظلماً قتل کیا ہو اور اس کے بدلے میں قتل کیا گیا ہو۔ دوسرا وہ شخص جس نے شادی کے بعد زنا کیا ہو۔ تیسرا وہ شخص جس نے اللہ اور اس کے رسول سے جنگ کی ہو اور اسلام سے پھر گیا ہو۔ لوگوں نے اس پر کہا، کیا انس بن مالک رضی اللہ عنہ نے یہ حدیث نہیں بیان کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے چوری کے معاملہ میں ہاتھ پیر کاٹ دئیے تھے اور آنکھوں میں سلائی پھروائی تھی اور پھر انہیں دھوپ میں ڈلوا دیا تھا۔ میں نے کہا کہ میں آپ لوگوں کو انس بن مالک رضی اللہ عنہ کی حدیث سناتا ہوں۔ مجھ سے انس رضی اللہ عنہ نے بیان کیا کہ قبیلہ عکل کے آٹھ افراد نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور آپ سے اسلام پر بیعت کی، پھر مدینہ منورہ کی آب و ہوا انہیں ناموافق ہوئی اور وہ بیمار پڑ گئے تو انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کی شکایت کی۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھر کیوں نہیں تم ہمارے چرواہے کے ساتھ اس کے اونٹوں میں چلے جاتے اور اونٹوں کا دودھ اور ان کا پیشاب پیتے۔ انہوں نے عرض کیا کیوں نہیں۔ چنانچہ وہ نکل گئے اور اونٹوں کا دودھ اور پیشاب پیا اور صحت مند ہو گئے۔ پھر انہوں نے نبی کریم صلی اللہ علیہ وسلم کے چرواہے کو قتل کر دیا اور اونٹ ہنکا لے گئے۔ اس کی اطلاع جب نبی کریم صلی اللہ علیہ وسلم کو پہنچی تو آپ نے ان کی تلاش میں آدمی بھیجے، پھر وہ پکڑے گئے اور لائے گئے۔ نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور ان کے بھی ہاتھ اور پاؤں کاٹ دئیے گئے اور ان کی آنکھوں میں سلائی پھیر دی گئی پھر انہیں دھوپ میں ڈلوا دیا اور آخر وہ مر گئے۔ میں نے کہا کہ ان کے عمل سے بڑھ کر اور کیا جرم ہو سکتا ہے اسلام سے پھر گئے اور قتل کیا اور چوری کی۔ عنبہ بن سعید نے کہا میں نے آج جیسی بات کبھی نہیں سنی تھی۔ میں نے کہا: عنبہ! کیا تم میری حدیث رد کرتے ہو؟ انہوں نے کہا کہ نہیں آپ نے یہ حدیث واقعہ کے مطابق بیان کر دی ہے۔ واللہ! اہل شام کے ساتھ اس وقت تک خیر و بھلائی رہے گی جب تک یہ شیخ ( ابوقلابہ ) ان میں موجود رہیں گے۔ میں نے کہا کہ اس قسامہ کے سلسلہ میں نبی کریم صلی اللہ علیہ وسلم کی ایک سنت ہے۔ انصار کے کچھ لوگ آپ کے پاس آئے اور نبی کریم صلی اللہ علیہ وسلم سے بات کی پھر ان میں سے ایک صاحب ان کے سامنے ہی نکلے ( خیبر کے ارادہ سے ) اور وہاں قتل کر دئیے گئے۔ اس کے بعد دوسرے صحابہ بھی گئے اور دیکھا کہ ان کے ساتھ خون میں تڑپ رہے ہیں۔ ان لوگوں نے واپس آ کر آپ صلی اللہ علیہ وسلم کو اس کی اطلاع دی اور کہا: یا رسول اللہ! ہمارے ساتھ گفتگو کر رہے تھے اور اچانک وہ ہمیں ( خیبر میں ) خون میں تڑپتے ملے۔ پھر نبی کریم صلی اللہ علیہ وسلم نکلے اور پوچھا کہ تمہارا کس پر شبہ ہے کہ انہوں نے ان کو قتل کیا ہے۔ صحابہ نے کہا کہ ہم سمجھتے ہیں کہ یہودیوں نے ہی قتل کیا ہے پھر آپ نے یہودیوں کو بلا بھیجا اور ان سے پوچھا کیا تم نے انہیں قتل کیا ہے؟ انہوں نے انکار کر دیا تو آپ نے فرمایا، کیا تم مان جاؤ گے اگر پچاس یہودی اس کی قسم لیں کہ انہوں نے مقتول کو قتل نہیں کیا ہے۔ صحابہ نے عرض کیا: یہ لوگ ذرا بھی پرواہ نہیں کریں گے کہ ہم سب کو قتل کرنے کے بعد پھر قسم کھا لیں ( کہ قتل انہوں نے نہیں کیا ہے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا تو پھر تم میں سے پچاس آدمی قسم کھا لیں اور خون بہا کے مستحق ہو جائیں۔ صحابہ نے عرض کیا: ہم بھی قسم کھانے کے لیے تیار نہیں ہیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے انہیں اپنے پاس سے خون بہا دیا ( ابوقلابہ نے کہا کہ ) میں نے کہا کہ زمانہ جاہلیت میں قبیلہ ہذیل کے لوگوں نے اپنے ایک آدمی کو اپنے میں سے نکال دیا تھا پھر وہ شخص بطحاء میں یمن کے ایک شخص کے گھر رات کو آیا۔ اتنے میں ان میں سے کوئی شخص بیدار ہو گیا اور اس نے اس پر تلوار سے حملہ کر کے قتل کر دیا۔ اس کے بعد ہذیل کے لوگ آئے اور انہوں نے یمنی کو ( جس نے قتل کیا تھا ) پکڑا کہ عمر رضی اللہ عنہ کے پاس لے گئے حج کے زمانہ میں اور کہا کہ اس نے ہمارے آدمی کو قتل کر دیا ہے۔ یمنی نے کہا کہ انہوں نے اسے اپنی برادری سے نکال دیا تھا۔ عمر رضی اللہ عنہ نے فرمایا کہ اب ہذیل کے پچاس آدمی اس کی قسم کھائیں کہ انہوں نے اسے نکالا نہیں تھا۔ بیان کیا کہ پھر ان میں سے انچاس آدمیوں نے قسم کھائی پھر انہیں کے قبیلہ کا ایک شخص شام سے آیا تو انہوں نے اس سے بھی مطالبہ کیا کہ وہ قسم کھائے لیکن اس نے اپنی قسم کے بدلہ میں ایک ہزار درہم دے کر اپنا پیچھا قسم سے چھڑا لیا۔ ہذلیوں نے اس کی جگہ ایک دوسرے آدمی کو تیار کر لیا پھر وہ مقتول کے بھائی کے پاس گیا اور اپنا ہاتھ اس کے ہاتھ سے ملایا۔ انہوں نے بیان کیا کہ پھر ہم پچاس جنہوں نے قسم کھائی تھی روانہ ہوئے۔ جب مقام نخلہ پر پہنچے تو بارش نے انہیں آیا۔ سب لوگ پہاڑ کے ایک غار میں گھس گئے اور غار ان پچاسوں کے اوپر گر پڑا۔ جنہوں نے قسم کھائی تھی اور سب کے سب مر گئے۔ البتہ دونوں ہاتھ ملانے والے بچ گئے۔ لیکن ان کے پیچھے سے ایک پتھر لڑھک کر گرا اور اس سے مقتول کے بھائی کی ٹانگ ٹوٹ گئی اس کے بعد وہ ایک سال اور زندہ رہا پھر مر گیا۔ میں نے کہا کہ عبدالملک بن مروان نے قسامہ پر ایک شخص سے قصاص لی تھی پھر اسے اپنے کئے ہوئے پر ندامت ہوئی اور اس نے ان پچاسوں کے متعلق جنہوں نے قسم کھائی تھی حکم دیا اور ان کے نام رجسٹر سے کاٹ دئیے گئے پھر انہوں نے شام بھیج دیا۔",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 38
			}
		}
	]
}