{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7046,
			"arabicnumber": 7046,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے، ان سے عبیداللہ بن عبداللہ بن عتبہ نے، ان سے ابن عباس رضی اللہ عنہما بیان کرتے تھے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے کہا کہ رات میں نے خواب میں دیکھا کہ ایک ابر کا ٹکڑا ہے جس سے گھی اور شہد ٹپک رہا ہے میں دیکھتا ہوں کہ لوگ انہیں اپنے ہاتھوں میں لے رہے ہیں۔ کوئی زیادہ اور کوئی کم اور ایک رسی ہے جو زمین سے آسمان تک لٹکی ہوئی ہے۔ میں نے دیکھا کہ پہلے آپ صلی اللہ علیہ وسلم نے آ کر اسے پکڑ اور اوپر چڑھ گئے پھر ایک دوسرے صاحب نے بھی اسے پکڑا اور وہ بھی اوپر چڑھ گئے پھر ایک تیسرے صاحب نے پکڑا اور وہ بھی چڑھ گئے پھر چوتھے صاحب نے پکڑا اور وہ بھی اس کے ذریعہ چڑھ گئے۔ پھر وہ رسی ٹوٹ گئی، پھر جڑ گئی۔ ابوبکر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میرے ماں باپ آپ پر فدا ہوں۔ مجھے اجازت دیجئیے میں اس کی تعبیر بیان کر دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بیان کرو۔ انہوں نے کہا سایہ سے مراد دین اسلام ہے اور شہد اور گھی ٹپک رہا تھا وہ قرآن مجید کی شیرینی ہے اور بعض قرآن کو زیادہ حاصل کرنے والے ہیں، بعض کم اور آسمان سے زمین تک کی رسی سے مراد وہ سچا طریق ہے جس پر آپ صلی اللہ علیہ وسلم قائم ہیں، آپ صلی اللہ علیہ وسلم اسے پکڑے ہوئے ہیں یہاں تک کہ اس کے ذریعہ اللہ آپ کو اٹھا لے گا پھر آپ کے بعد ایک دوسرے صاحب آپ کے خلیفہ اول اسے پکڑیں گے وہ بھی مرتے دم تک اس پر قائم رہیں گے۔ پھر تیسرے صاحب پکڑیں گے ان کا بھی یہی حال ہو گا۔ پھر چوتھے صاحب پکڑیں گے تو ان کا معاملہ خلافت کا کٹ جائے گا وہ بھی اوپر چڑھ جائیں گے۔ یا رسول اللہ! میرے ماں باپ آپ پر قربان ہوں مجھے بتائیے کیا میں نے جو تعبیر دی ہے وہ غلط ہے یا صحیح۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بعض حصہ کی صحیح تعبیر دی ہے اور بعض کی غلط۔ ابوبکر رضی اللہ عنہ نے عرض کیا: پس واللہ! آپ میری غلطی کو ظاہر فرما دیں نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قسم نہ کھاؤ۔",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 60
			}
		}
	]
}