{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7078,
			"arabicnumber": 7078,
			"text": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ قطان نے بیان کیا، کہا ہم سے قرہ بن خالد نے بیان کیا، کہا ہم سے ابن سیرین نے بیان کیا، ان سے عبدالرحمٰن بن ابی بکرہ نے بیان کیا اور ایک دوسرے شخص ( حمید بن عبدالرحمٰن ) سے بھی سنا جو میری نظر میں عبدالرحمٰن بن ابی بکرہ سے اچھے ہیں اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ رسول صلی اللہ علیہ وسلم نے لوگوں کو یوم النحر کو خطبہ دیا اور فرمایا ”تمہیں معلوم ہے یہ کون سا دن ہے؟“ لوگوں نے کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے۔ بیان کیا کہ ( اس کے بعد نبی کریم صلی اللہ علیہ وسلم کی خاموشی سے ) ہم یہ سمجھے کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا ”کیا یہ قربانی کا دن ( یوم النحر ) نہیں ہے؟“ ہم نے عرض کیا: کیوں نہیں، یا رسول اللہ! آپ نے پھر پوچھا ”یہ کون سا شہر ہے؟ کیا یہ البلدہ ( مکہ مکرمہ ) نہیں ہے؟“ ہم نے عرض کیا: کیوں نہیں، یا رسول اللہ! نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”پھر تمہارا خون، تمہارے مال، تمہاری عزت اور تمہاری کھال تم پر اسی طرح حرمت والے ہیں جس طرح اس دن کی حرمت اس مہینے اور اس شہر میں ہے۔ کیا میں نے پہنچا دیا؟“ ہم نے کہا جی ہاں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے اللہ! گواہ رہنا۔ پس میرا یہ پیغام موجود لوگ غیر موجود لوگوں کو پہنچا دیں کیونکہ بہت سے پہنچانے والے اس پیغام کو اس تک پہنچائیں گے جو اس کو زیادہ محفوظ رکھنے والا ہو گا۔“ چنانچہ ایسا ہی ہوا اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میرے بعد کافر نہ ہو جانا کہ بعض بعض کی گردن مارنے لگو۔“ پھر جب وہ دن آیا جب عبداللہ عمرو بن حضرمی کو جاریہ بن قدامہ نے ایک مکان میں گھیر کر جلا دیا تو جاریہ نے اپنے لشکر والوں سے کہا زرا ابوبکرہ کو تو جھانکو وہ کس خیال میں ہے۔ انہوں نے کہا یہ ابوبکرہ موجود ہیں تم کو دیکھ رہے ہیں۔ عبدالرحمٰن بن ابی بکرہ کہتے ہیں مجھ سے میری والدہ ہالہ بنت غلیظ نے کہا کہ ابوبکرہ نے کہا اگر یہ لوگ ( تین جاریہ کے لشکر والے ) میرے گھر میں بھی گھس آئیں اور مجھ کو مارنے لگیں تو میں ان پر ایک بانس کی چھڑی بھی نہیں چلاؤں گا۔",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 29
			}
		}
	]
}