{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7097,
			"arabicnumber": 7097,
			"text": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم کو محمد بن جعفر نے خبر دی، انہیں شریک بن عبداللہ نے، انہیں سعید بن مسیب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مدینہ کے باغات میں کسی باغ کی طرف اپنی کسی ضرورت کے لیے گئے، میں بھی آپ کے پیچھے پیچھے گیا۔ جب نبی کریم صلی اللہ علیہ وسلم باغ میں داخل ہوئے تو میں اس کے دروازے پر بیٹھ گیا اور اپنے دل میں کہا کہ آج میں آپ کا دربان بنوں گا حالانکہ آپ نے مجھے اس کا حکم نہیں دیا تھا۔ آپ اندر چلے گئے اور اپنی حاجت پوری کی۔ پھر آپ کنوئیں کی منڈیر پر بیٹھ گئے اور اپنی دونوں پنڈلیوں کو کھول کر انہیں کنوئیں میں لٹکا لیا۔ پھر ابوبکر رضی اللہ عنہ آئے اور اندر جانے کی اجازت چاہی۔ میں نے ان سے کہا کہ آپ یہیں رہیں، میں آپ کے لیے اجازت لے کر آتا ہوں۔ چنانچہ وہ کھڑے رہے اور میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا: یا نبی اللہ! ابوبکر رضی اللہ عنہ آپ کے پاس آنے کی اجازت چاہتے ہیں۔ فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت سنا دو۔ چنانچہ وہ اندر آ گئے اور نبی کریم صلی اللہ علیہ وسلم کی دائیں جانب آ کر انہوں نے بھی اپنی پنڈلیوں کو کھول کر کنوئیں میں لٹکا لیا۔ اتنے میں عمر رضی اللہ عنہ آئے۔ میں نے کہا ٹھہرو میں نبی کریم صلی اللہ علیہ وسلم سے اجازت لے لوں ( اور میں نے اندر جا کر آپ سے عرض کیا ) آپ صلی اللہ علیہ وسلم نے فرمایا ان کو بھی اجازت دے اور بہشت کی خوشخبری بھی۔ خیر وہ بھی آئے اور اسی کنوئیں کی منڈیر پر نبی کریم صلی اللہ علیہ وسلم کے بائیں جانب بیٹھے اور اپنی پنڈلیاں کھول کر کنوئیں میں لٹکا دیں۔ اور کنوئیں کی منڈیر بھر گئی اور وہاں جگہ نہ رہی۔ پھر عثمان رضی اللہ عنہ آئے اور میں نے ان سے بھی کہا کہ یہیں رہئیے یہاں تک کہ آپ کے لیے نبی کریم صلی اللہ علیہ وسلم سے اجازت مانگ لوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دو اور جنت کی بشارت دے دو اور اس کے ساتھ ایک آزمائش ہے جو انہیں پہنچے گی۔ پھر وہ بھی داخل ہوئے، ان کے ساتھ بیٹھنے کے لیے کوئی جگہ نہ تھی۔ چنانچہ وہ گھوم کر ان کے سامنے کنوئیں کے کنارے پر آ گئے پھر انہوں نے اپنی پنڈلیاں کھول کر کنوئیں میں پاؤں لٹکا لیے، پھر میرے دل میں بھائی ( غالباً ابوبردہ یا ابورہم ) کی تمنا پیدا ہوئی اور میں دعا کرنے لگا کہ وہ بھی آ جاتے، ابن المسیب نے بیان کیا کہ میں نے اس سے ان کی قبروں کی تعبیر لی کہ سب کی قبریں ایک جگہ ہوں گی لیکن عثمان رضی اللہ عنہ کی الگ بقیع غرقد میں ہے۔",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 48
			}
		}
	]
}