{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7190,
			"arabicnumber": 7190,
			"text": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ابوحازم المدینی نے بیان کیا اور ان سے سہل بن سعد الساعدی رضی اللہ عنہ نے بیان کیا کہ قبیلہ بنی عمرو بن عوف میں باہم لڑائی ہو گئی۔ جب نبی کریم صلی اللہ علیہ وسلم کو اس کی اطلاع ملی تو آپ نے ظہر کی نماز پڑھی اور ان کے یہاں صلح کرانے کے لیے تشریف لائے۔ جب عصر کی نماز کا وقت ہوا ( مدینہ میں ) تو بلال رضی اللہ عنہ نے اذان دی اور اقامت کہی۔ آپ نے ابوبکر رضی اللہ عنہ کو نماز پڑھانے کا حکم دیا تھا۔ چنانچہ وہ آگے بڑھے، اتنے میں نبی کریم صلی اللہ علیہ وسلم تشریف لے آئے ابوبکر رضی اللہ عنہ نماز ہی میں تھے ‘ پھر نبی کریم صلی اللہ علیہ وسلم لوگوں کی صف کو چیرتے ہوئے آگے بڑھے اور ابوبکر رضی اللہ عنہ کے پیچھے کھڑے ہو گئے اور اس صف میں آ گئے جو ان سے قریب تھی۔ سہل رضی اللہ عنہ نے کہا کہ لوگوں نے نبی کریم صلی اللہ علیہ وسلم کی آمد کو بتانے کے لیے ہاتھ مارے۔ ابوبکر رضی اللہ عنہ جب نماز شروع کرتے تو ختم کرنے سے پہلے کسی طرف توجہ نہیں کرتے تھے۔ جب انہوں نے دیکھا کہ ہاتھ پر ہاتھ مارنا رکتا ہی نہیں تو آپ متوجہ ہوئے اور نبی کریم صلی اللہ علیہ وسلم کو اپنے پیچھے دیکھا لیکن نبی کریم صلی اللہ علیہ وسلم نے اشارہ کیا کہ نماز پوری کریں اور آپ نے اس طرح ہاتھ سے اپنی جگہ ٹھہرے رہنے کا اشارہ کیا۔ ابوبکر رضی اللہ عنہ تھوڑی دیر نبی کریم صلی اللہ علیہ وسلم کے حکم پر اللہ کی حمد کرنے کے لیے ٹھہرے رہے، پھر آپ الٹے پاؤں پیچھے آ گئے۔ جب نبی کریم صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ آگے بڑھے اور لوگوں کو آپ نے نماز پڑھائی۔ نماز پوری کرنے کے بعد آپ نے فرمایا، ابوبکر! جب میں نے ارشاد کر دیا تھا تو آپ کو نماز پوری پڑھانے میں کیا چیز مانع تھی؟ انہوں نے عرض کیا، ابن ابی قحافہ کے لیے مناسب نہیں تھا کہ وہ نبی کریم صلی اللہ علیہ وسلم کی امامت کرے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ( نماز میں ) جب کوئی معاملہ پیش آئے تو مردوں کو سبحان اللہ کہنا چاہئیے اور عورتوں کو ہاتھ پر ہاتھ مارنا چاہئے۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 52
			}
		}
	]
}