{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7191,
			"arabicnumber": 7191,
			"text": "ہم سے محمد بن عبداللہ ابوثابت نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے عبید بن سابق نے اور ان سے زید بن ثابت رضی اللہ عنہ نے کہ جنگ یمامہ میں بکثرت ( قاری صحابہ کی ) شہادت کی وجہ سے ابوبکر رضی اللہ عنہ نے مجھے بلا بھیجا۔ ان کے پاس عمر رضی اللہ عنہ بھی تھے۔ ابوبکر رضی اللہ عنہ نے مجھ سے کہا کہ عمر میرے پاس آئے اور کہا کہ جنگ یمامہ میں قرآن کے قاریوں کا قتل بہت ہوا ہے اور میرا خیال ہے کہ دوسری جنگوں میں بھی اسی طرح وہ شہید کئے جائیں گے اور قرآن اکثر ضائع ہو جائے گا۔ میں سمجھتا ہوں کہ آپ قرآن مجید کو ( کتابی صورت میں ) جمع کرنے کا حکم دیں۔ اس پر میں نے عمر رضی اللہ عنہ سے کہا کہ میں کوئی ایسا کام کیسے کر سکتا ہوں جسے رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا۔ عمر رضی اللہ عنہ نے کہا واللہ! یہ تو کار خیر ہے۔ عمر رضی اللہ عنہ اس معاملہ میں برابر مجھ سے کہتے رہے یہاں تک کہ اللہ تعالیٰ نے اسی طرح اس معاملے میں میرا بھی سینہ کھول دیا جس طرح عمر رضی اللہ عنہ کا تھا اور میں بھی وہی مناسب سمجھنے لگا جسے عمر رضی اللہ عنہ مناسب سمجھتے تھے۔ زید رضی اللہ عنہ نے بیان کیا کہ مجھ سے ابوبکر رضی اللہ عنہ نے کہا کہ تم جوان ہو، عقلمند ہو اور ہم تمہیں کسی بارے میں متہم بھی نہیں سمجھتے تم نبی کریم صلی اللہ علیہ وسلم کی وحی بھی لکھتے تھے، پس تم اس قرآن مجید ( کی آیات ) کو تلاش کرو اور ایک جگہ جمع کر دو۔ زید رضی اللہ عنہ نے بیان کیا کہ واللہ! اگر ابوبکر رضی اللہ عنہ مجھے کسی پہاڑ کو اٹھا کر دوسری جگہ رکھنے کا مکلف کرتے تو اس کا بوجھ بھی میں اتنا نہ محسوس کرتا جتنا کہ مجھے قرآن مجید کو جمع کرنے کے حکم سے محسوس ہوا۔ میں نے ان لوگوں سے کہا کہ آپ کس طرح ایسا کام کرتے ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا۔ ابوبکر نے کہا کہ واللہ! یہ خیر ہے۔ چنانچہ مجھے آمادہ کرنے کی کوشش کرتے رہے، یہاں تک کہ اللہ تعالیٰ نے اس کام کے لیے میرا بھی سینہ کھول دیا جس کے لیے ابوبکر و عمر رضی اللہ عنہما کا سینہ کھولا تھا اور میں بھی وہی مناسب خیال کرنے لگا جسے وہ لوگ مناسب خیال کر رہے تھے۔ چنانچہ میں نے قرآن مجید کی تلاش شروع کی۔ اسے میں کھجور کی چھال، چمڑے وغیرہ کے ٹکڑوں، پتلے پتھر کے ٹکڑوں اور لوگوں کے سینوں سے جمع کرنے لگا۔ میں نے سورۃ التوبہ کی آخری آیت «لقد جاءكم رسول من أنفسكم‏» آخر تک خزیمہ یا ابوخزیمہ رضی اللہ عنہ کے پاس پائی اور اس کو سورت میں شامل کر لیا۔ ( قرآن مجید کے یہ مرتب ) صحیفے ابوبکر رضی اللہ عنہ کے پاس رہے جب تک وہ زندہ ہے۔ یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دی پھر وہ عمر رضی اللہ عنہ کے پاس آ گئے اور آخر وقت تک ان کے پاس رہے۔ جب آپ کو بھی اللہ تعالیٰ نے وفات دی تو وہ حفصہ بنت عمر رضی اللہ عنہا کے پاس محفوظ رہے۔ محمد بن عبیداللہ نے کہا کہ «اللخاف» کے لفظ سے ٹھیکری مراد ہے جسے «خزف‏.‏» کہتے ہیں۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 53
			}
		}
	]
}