{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7192,
			"arabicnumber": 7192,
			"text": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن ابی لیلیٰ نے (دوسری سند) امام بخاری رحمہ اللہ نے کہا کہ ہم سے اسماعیل نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ابولیلیٰ بن عبداللہ بن عبدالرحمٰن بن سہل نے، ان سے سہل بن ابی حثمہ نے، انہیں سہل اور ان کی قوم کے بعض دوسرے ذمہ داروں نے خبر دی کہ عبداللہ، سہل اور محیصہ رضی اللہ عنہم خیبر کی طرف ( کھجور لینے کے لیے ) گئے۔ کیونکہ تنگ دستی میں مبتلا تھے۔ پھر محیصہ کو بتایا گیا کہ عبداللہ کو کسی نے قتل کر کے گڑھے یا کنویں میں ڈال دیا ہے۔ پھر وہ یہودیوں کے پاس گئے اور کہا کہ واللہ! تم نے ہی قتل کیا ہے۔ انہوں نے کہا: واللہ! ہم نے انہیں نہیں قتل کیا۔ پھر وہ واپس آئے اور اپنی قوم کے پاس آئے اور ان سے ذکر کیا۔ اس کے بعد وہ اور ان کے بھائی حویصہ جو ان سے بڑے تھے اور عبدالرحمٰن بن سہل رضی اللہ عنہ آئے، پھر محیصہ رضی اللہ عنہ نے بات کرنی چاہی کیونکہ آپ ہی خیبر میں موجود تھے لیکن نبی کریم صلی اللہ علیہ وسلم نے ان سے کہا کہ بڑے کو آگے کرو، بڑے کو آپ کی مراد عمر کی بڑائی تھی۔ چنانچہ حویصہ نے بات کی، پھر محیصہ نے بھی بات کی۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہودی تمہارے ساتھی کی دیت ادا کریں ورنہ لڑائی کے لیے تیار ہو جائیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے یہودیوں کو اس مقدمہ میں لکھا۔ انہوں نے جواب میں یہ لکھا کہ ہم نے انہیں نہیں قتل کیا ہے۔ پھر آپ نے حویصہ، محیصہ اور عبدالرحمٰن رضی اللہ عنہ سے کہا کہ کیا آپ لوگ قسم کھا کر اپنے شہید ساتھی کے خون کے مستحق ہو سکتے ہیں؟ ان لوگوں نے کہا کہ نہیں ( کیونکہ جرم کرتے دیکھا نہیں تھا ) پھر آپ نے فرمایا، کیا آپ لوگوں کے بجائے یہودی قسم کھائیں ( کہ انہوں نے قتل نہیں کیا ہے ) ؟ انہوں نے کہا کہ وہ مسلمان نہیں ہیں اور وہ جھوٹی قسم کھا سکتے ہیں۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اپنی طرف سے سو اونٹوں کی دیت ادا کی اور وہ اونٹ گھر میں لائے گئے۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان میں سے ایک اونٹنی نے مجھے لات ماری۔",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 54
			}
		}
	]
}