{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "مجھ سے معاذ بن فضالہ نے بیان کیا، کہا ہم سے ہشام دستوائی نے، انہوں نے قتادہ بن دعامہ سے، انہوں نے انس رضی اللہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ قیامت کے دن اسی طرح جیسے ہم دنیا میں جمع ہوتے ہیں، مومنوں کو اکٹھا کرے گا ( وہ گرمی وغیرہ سے پریشان ہو کر ) کہیں گے کاش ہم کسی کی سفارش اپنے مالک کے پاس لے جاتے تاکہ ہمیں اپنی اس حالت سے آرام ملتا۔ چنانچہ سب مل کر آدم علیہ السلام کے پاس آئیں گے۔ ان سے کہیں گے آدم! آپ لوگوں کا حال نہیں دیکھتے کس بلا میں گرفتار ہیں۔ آپ کو اللہ تعالیٰ نے ( خاص ) اپنے ہاتھ سے بنایا اور فرشتوں سے آپ کو سجدہ کرایا اور ہر چیز کے نام آپ کو بتلائے ( ہر لغت میں بولنا بات کرنا سکھلایا ) کچھ سفارش کیجئے تاکہ ہم لوگوں کو اس جگہ سے نجات ہو کر آرام ملے۔ کہیں گے میں اس لائق نہیں، ان کو وہ گناہ یاد آ جائے گا جو انہوں نے کیا تھا ( ممنوع درخت میں سے کھانا ) ۔ ( وہ کہیں گے ) مگر تم لوگ ایسا کرو نوح علیہ السلام پیغمبر کے پاس جاؤ وہ پہلے پیغمبر ہیں جن کو اللہ تعالیٰ نے زمین والوں کی طرف بھیجا تھا۔ آخر وہ لوگ سب نوح علیہ السلام کے پاس آئیں گے، وہ بھی یہی جواب دیں گے، میں اس لائق نہیں اپنی خطا جو انہوں نے ( دنیا میں ) کی تھی یاد کریں گے۔ کہیں گے تم لوگ ایسا کرو پیغمبر ابراہیم علیہ السلام کے پاس جاؤ جو اللہ کے خلیل ہیں ( لوگ ان کے پاس جائیں گے ) وہ بھی اپنی خطائیں یاد کر کے کہیں گے میں اس لائق نہیں تم موسیٰ علیہ السلام پیغمبر کے پاس جاؤ اللہ نے ان کو توراۃ عنائت فرمائی، ان سے بول کر باتیں کیں۔ یہ لوگ موسیٰ علیہ السلام کے پاس آئیں گے وہ بھی یہی کہیں گے میں اس لائق نہیں اپنی خطا جو انہوں نے دنیا میں کی تھی یاد کریں گے مگر تم ایسا کرو عیسیٰ علیہ السلام پیغمبر کے پاس جاؤ وہ اللہ کے بندے، اس کے رسول، اس کے خاص کلمہ اور خاص روح ہیں۔ یہ لوگ عیسیٰ علیہ السلام کے پاس آئیں گے وہ کہیں گے میں اس لائق نہیں تم ایسا کرو محمد صلی اللہ علیہ وسلم کے پاس جاؤ وہ اللہ کے ایسے بندے ہیں جن کی اگلی پچھلی خطائیں سب بخش دی گئی ہیں۔ آخر یہ سب لوگ جمع ہو کر میرے پاس آئیں گے۔ میں چلوں گا اور اپنے پروردگار کی بارگاہ میں حاضر ہونے کی اجازت مانگوں گا، مجھ کو اجازت ملے گی۔ میں اپنے پروردگار کو دیکھتے ہی سجدے میں گر پڑوں گا اور جب تک اس کو منظور ہے وہ مجھ کو سجدے ہی میں پڑا رہنے دے گا۔ اس کے بعد حکم ہو گا ”محمد صلی اللہ علیہ وسلم اپنا سر اٹھاؤ اور عرض کرو تمہاری عرض سنی جائے گی تمہاری درخواست منظور ہو گی، تمہاری سفارش مقبول ہو گی اس وقت میں اپنے مالک کی ایسی ایسی تعریفیں کروں گا جو وہ مجھ کو سکھا چکا ہے۔ ( یا سکھلائے گا ) پھر لوگوں کی سفارش شروع کر دوں گا۔ سفارش کی ایک حد مقرر کر دی جائے گی۔ میں ان کو بہشت میں لے جاؤں گا، پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا اور اس کو دیکھتے ہی سجدے میں گر پڑوں گا جب تک پروردگار چاہے گا مجھ کو سجدے میں پڑا رہنے دے گا۔ اس کے بعد ارشاد ہو گا ”محمد اپنا سر اٹھاؤ جو تم کہو گے سنا جائے گا اور سفارش کرو گے تو قبول ہو گی پھر میں اپنے پروردگار کی ایسی تعریفیں کروں گا جو اللہ نے مجھ کو سکھلائیں ( یا سکھلائے گا ) اس کے بعد سفارش کر دوں گا لیکن سفارش کی ایک حد مقرر کر دی جائے گی۔ میں ان کو بہشت میں لے جاؤں گا پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا اس کو دیکھتے ہی سجدے میں گر پڑوں گا جب تک پروردگار چاہے گا مجھ کو سجدے میں پڑا رہنے دیے گا۔ اس کے بعد ارشاد ہو گا محمد اپنا سر اٹھاؤ جو تم کہو گے سنا جائے گا اور سفارش کرو گے تو قبول ہو گی پھر میں اپنے پروردگار کی ایسی تعریفیں کروں گا جو اللہ نے مجھ کو سکھلائیں ( یا سکھلائے گا ) اس کے بعد سفارش شروع کر دوں گا لیکن سفارش کی ایک حد مقرر کر دی جائے گی۔ میں ان کو بہشت میں لے جاؤں گا پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا۔ عرض کروں گا: یا پاک پروردگار! اب تو دوزخ میں ایسے ہی لوگ رہ گئے ہیں جو قرآن کے بموجب دوزخ ہی میں ہمیشہ رہنے کے لائق ہیں ( یعنی کافر اور مشرک ) ۔ انس رضی اللہ عنہ نے کہا نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دوزخ سے وہ لوگ نکال لیے جائیں گے جنہوں نے ( دنیا میں ) لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں ایک جَو برابر ایمان ہو گا پھر وہ لوگ بھی نکال لیے جائیں گے جنہوں نے لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں گیہوں برابر ایمان ہو گا۔ ( گیہوں جَو سے چھوٹا ہوتا ہے ) پھر وہ بھی نکال لیے جائیں گے جنہوں نے لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں چیونٹی برابر ( یا بھنگے برابر ) ایمان ہو گا۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		}
	]
}