{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "ہم سے قبیصہ نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے ان کے والد نے بیان کیا، ان سے ابن ابی نعم یا ابونعم نے۔۔۔ قبیصہ کو شک تھا۔۔۔ اور ان سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ سونا بھیجا گیا تو آپ نے اسے چار آدمیوں میں تقسیم کر دیا۔ اور مجھ سے اسحاق بن نصر نے بیان کیا، ان سے عبدالرزاق نے بیان کیا، انہیں سفیان نے خبر دی، انہیں ان کے والد نے، انہیں ابن ابی نعم نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ علی رضی اللہ عنہ نے یمن سے کچھ سونا نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا تو نبی کریم صلی اللہ علیہ وسلم نے اسے اقرع بن حابس حنظلی، عیینہ بن بدری فزاری، علقمہ بن علاثہ العامری اور زید الخیل الطائی میں تقسیم کر دیا۔ اس پر قریش اور انصار کو غصہ آ گیا اور انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نجد کے رئیسوں کو تو دیتے ہیں اور ہمیں چھوڑ دیتے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں ایک مصلحت کے لیے ان کا دل بہلاتا ہوں۔ پھر ایک شخص جس کی آنکھیں دھنسی ہوئی تھیں، پیشانی ابھری ہوئی تھی، داڑھی گھنی تھی، دونوں کلے پھولے ہوئے تھے اور سر گٹھا ہوا تھا۔ اس مردود نے کہا: اے محمد! اللہ سے ڈر۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں بھی اس ( اللہ ) کی نافرمانی کروں گا تو پھر کون اس کی اطاعت کرے گا؟ اس نے مجھے زمین پر امین بنایا ہے اور تم مجھے امین نہیں سمجھتے۔ پھر حاضرین میں سے ایک صحابی خالد رضی اللہ عنہ یا عمر رضی اللہ عنہ نے اس کے قتل کی اجازت چاہی تو نبی کریم صلی اللہ علیہ وسلم نے منع فرمایا۔ پھر جب وہ جانے لگا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شخص کی نسل سے ایسے لوگ پیدا ہوں گے جو قرآن کے صرف لفظ پڑھیں گے لیکن قرآن ان کے حلق سے نیچے نہیں اترے گا، وہ اسلام سے اس طرح نکال کر پھینک دئیے جائیں گے جس طرح تیر شکاری جانور میں سے پار نکل جاتا ہے، وہ اہل اسلام کو ( کافر کہہ کر ) قتل کریں اور بت پرستوں کو چھوڑ دیں گے اگر میں نے ان کا دور پایا تو انہیں قوم عاد کی طرح نیست و نابود کر دوں گا۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		}
	]
}