{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"text": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے، ان سے خالد بن یزید نے، ان سے سعید بن ابی ہلال نے، ان سے زید بن اسلم نے، ان سے عطاء بن یسار نے اور ان سے ابوسعید خدری رضی اللہ عنہ نے بیان کیا کہ ہم نے کہا: یا رسول اللہ! کیا ہم قیامت کے دن اپنے رب کو دیکھیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا تم کو سورج اور چاند دیکھنے میں کچھ تکلیف ہوتی ہے جب کہ آسمان بھی صاف ہو؟ ہم نے کہا کہ نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ پھر اپنے رب کے دیدار میں تمہیں کوئی تکلیف نہیں پیش آئے گی جس طرح سورج اور چاند کو دیکھنے میں نہیں پیش آتی۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک آواز دینے والا آواز دے گا کہ ہر قوم اس کے ساتھ جائے جس کی وہ پوجا کیا کرتی تھی۔ چنانچہ صلیب کے پجاری اپنی صلیب کے ساتھ، بتوں کے پجاری اپنے بتوں کے ساتھ، تمام جھوٹے معبودوں کے پجاری اپنے جھوٹے معبودوں کے ساتھ چلے جائیں گے اور صرف وہ لوگ باقی رہ جائیں گے جو خالص اللہ کی عبادت کرنے والے تھے۔ ان میں نیک و بد دونوں قسم کے مسلمانوں ہوں گے اور اہل کتاب کے کچھ باقی ماندہ لوگ بھی ہوں گے۔ پھر دوزخ ان کے سامنے پیش کی جائے گی وہ ایسی چمکدار ہو گی جیسے میدان کا ریت ہوتا ہے۔ ( جو دور سے پانی معلوم ہوتا ہے ) پھر یہود سے پوچھا جائے گا کہ تم کس کے پوجا کرتے تھے۔ وہ کہیں گے کہ ہم عزیر ابن اللہ کی پوجا کیا کرتے تھے۔ انہیں جواب ملے گا کہ تم جھوٹے ہو اللہ کے نہ کوئی بیوی ہے اور نہ کوئی لڑکا۔ تم کیا چاہتے ہو؟ وہ کہیں گے کہ ہم پانی پینا چاہتے ہیں کہ ہمیں اس سے سیراب کیا جائے۔ ان سے کہا جائے گا کہ پیو وہ اس چمکتی ریت کی طرف پانی جان کر چلیں گے اور پھر وہ جہنم میں ڈال دئیے جائیں گے۔ پھر نصاریٰ سے کہا جائے گا کہ تم کس کی پوجا کرتے تھے؟ وہ جواب دیں گے کہ ہم مسیح ابن اللہ کی پوجا کرتے تھے۔ ان سے کہا جائے گا کہ تم جھوٹے ہو۔ اللہ کے نہ بیوی تھی اور نہ کوئی بچہ، اب تم کیا چاہتے ہو؟ وہ کہیں گے کہ ہم چاہتے ہیں کہ پانی سے سیراب کئے جائیں۔ ان سے کہا جائے گا کہ پیو ( ان کو بھی اس چمکتی ریت کی طرف چلایا جائے گا ) اور انہیں بھی جہنم میں ڈال دیا جائے گا۔ یہاں تک کہ وہی باقی رہ جائیں گے جو خالص اللہ کی عبادت کرتے تھے، نیک و بد دونوں قسم کے مسلمان، ان سے کہا جائے گا کہ تم لوگ کیوں رکے ہوئے ہو جب کہ سب لوگ جا چکے ہیں؟ وہ کہیں گے ہم دنیا میں ان سے ایسے وقت جدا ہوئے کہ ہمیں ان کی دنیاوی فائدوں کے لیے بہت زیادہ ضرورت تھی اور ہم نے ایک آواز دینے والے کو سنا ہے کہ ہر قوم اس کے ساتھ ہو جائے جس کی وہ عبادت کرتی تھی اور ہم اپنے رب کے منتظر ہیں۔ بیان کیا کہ پھر اللہ جبار ان کے سامنے اس صورت کے علاوہ دوسری صورت میں آئے گا جس میں انہوں نے اسے پہلی مرتبہ دیکھا ہو گا اور کہے گا کہ میں تمہارا رب ہوں! لوگ کہیں گے کہ تو ہی ہمارا رب ہے اور اس دن انبیاء کے سوا اور کوئی بات نہیں کرے گا۔ پھر پوچھے گا: کیا تمہیں اس کی کوئی نشانی معلوم ہے؟ وہ کہیں گے کہ «ساق‏.‏» پنڈلی، پھر اللہ تعالیٰ اپنی پنڈلی کھولے گا اور ہر مومن اس کے لیے سجدہ میں گر جائے گا۔ صرف وہ لوگ باقی رہ جائیں گے جو دکھاوے اور شہرت کے لیے اسے سجدہ کرتے تھے، وہ بھی سجدہ کرنا چاہیں گے لیکن ان کی پیٹھ تختہ کی طرح ہو کر رہ جائے گی۔ پھر انہیں پل پر لایا جائے گا۔ ہم نے پوچھا: یا رسول اللہ! پل کیا چیز ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا , وہ ایک پھسلواں گرنے کا مقام ہے اس پر سنسنیاں ہیں، آنکڑے ہیں، چوڑے چوڑے کانٹے ہیں، ان کے سر خمدار سعدان کے کانٹوں کی طرح ہیں جو نجد کے ملک میں ہوتے ہیں۔ مومن اس پر پلک مارنے کی طرح، بجلی کی طرح، ہوا کی طرح، تیز رفتار گھوڑے اور سواری کی طرح گزر جائیں گے۔ ان میں بعض تو صحیح سلامت نجات پانے والے ہوں گے اور بعض جہنم کی آگ سے جھلس کر بچ نکلنے والے ہوں گے یہاں تک کہ آخری شخص اس پر سے گھسٹتے ہوئے گزرے گا تم لوگ آج کے دن اپنا حق لینے کے لیے جتنا تقاضا اور مطالبہ مجھ سے کرتے ہو اس سے زیادہ مسلمان لوگ اللہ سے تقاضا اور مطالبہ کریں گے اور جب وہ دیکھیں گے کہ اپنے بھائیوں میں سے انہیں نجات ملی ہے تو وہ کہیں گے کہ اے ہمارے رب! ہمارے بھائی بھی ہمارے ساتھ نماز پڑھتے تھے اور ہمارے ساتھ روزے رکھتے تھے اور ہمارے ساتھ دوسرے ( نیک ) اعمال کرتے تھے ( ان کو بھی دوزخ سے نجات فرما ) چنانچہ اللہ تعالیٰ فرمائے گا کہ جاؤ اور جس کے دل میں ایک اشرفی کے برابر بھی ایمان پاؤ اسے دوزخ سے نکال لو اور اللہ ان کے چہروں کو دوزخ پر حرام کر دے گا۔ چنانچہ وہ آئیں گے اور دیکھیں گے کہ بعض کا تو جہنم میں قدم اور آدھی پنڈلی جلی ہوئی ہے۔ چنانچہ جنہیں وہ پہچانیں گے انہیں دوزخ سے نکالیں گے، پھر واپس آئیں گے اور اللہ تعالیٰ ان سے فرمائے گا کہ جاؤ اور جس کے دل میں آدھی اشرفی کے برابر بھی ایمان ہو اسے بھی نکال لاؤ۔ چنانچہ جن کو وہ پہچانتے ہوں گے ان کو نکالیں گے۔ پھر وہ واپس آئیں گے اور اللہ تعالیٰ فرمائے گا کہ جاؤ اور جس کے دل میں ذرہ برابر ایمان ہو اسے بھی نکال لاؤ۔ چنانچہ پہچانے جانے والوں کو نکالیں گے۔ ابوسعید رضی اللہ عنہ نے اس پر کہا کہ اگر تم میری تصدیق نہیں کرتے تو یہ آیت پڑھو «إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها‏» ”اللہ تعالیٰ ذرہ برابر بھی کسی پر ظلم نہیں کرتا۔“ اگر نیکی ہے تو اسے بڑھاتا ہے۔ پھر انبیاء اور مومنین اور فرشتے شفاعت کریں گے اور پروردگار کا ارشاد ہو گا کہ اب خاص میری شفاعت باقی رہ گئی ہے۔ چنانچہ اللہ تعالیٰ دوزخ سے ایک مٹھی بھر لے گا اور ایسے لوگوں کو نکالے گا جو کوئلہ ہو گئے ہوں گے۔ پھر وہ جنت کے سرے پر ایک نہر میں ڈال دئیے جائیں گے جسے نہر آب حیات کہا جاتا ہے اور یہ لوگ اس کے کنارے سے اس طرح ابھریں گے جس طرح سیلاب کے کوڑے کرکٹ سے سبزہ ابھر آتا ہے۔ تم نے یہ منظر کسی چٹان کے یا کسی درخت کے کنارے دیکھا ہو گا تو جس پر دھوپ پڑتی رہتی ہے وہ سبزا بھرتا ہے اور جس پر سایہ ہوتا ہے وہ سفید ابھرتا ہے۔ پھر وہ اس طرح نکلیں گے جیسے موتی چمکتا ہے۔ اس کے بعد ان کی گردنوں پر مہر کر دی جائیں گے ( کہ یہ اللہ کے آزاد کردہ غلام ہیں ) اور انہیں جنت میں داخل کیا جائے گا۔ اہل جنت انہیں «عتقاء الرحمن» کہیں گے۔ انہیں اللہ نے بلا عمل کے جو انہوں نے کیا ہو اور بلا خیر کے جو ان سے صادر ہوئی ہو جنت میں داخل کیا ہے۔ اور ان سے کہا جائے گا کہ تمہیں وہ سب کچھ ملے گا جو تم دیکھتے ہو اور اتنا ہی اور بھی ملے گا۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		}
	]
}