{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "اور حجاج بن منہال نے بیان کیا، کہا ہم سے حمام بن یحییٰ نے بیان کیا، کہا ہم سے قتادہ بن دعامہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”قیامت کے دن مومنوں کو ( گرم میدان میں ) روک دیا جائے گا یہاں تک کہ اس کی وجہ سے وہ غمگین ہو جائیں گے اور ( صلاح کر کے ) کہیں گے کہ کاش کوئی ہمارے رب سے ہماری شفاعت کرتا کہ ہمیں اس حالت سے نجات ملتی۔ چنانچہ وہ مل کر آدم علیہ السلام کے پاس آئیں گے اور کہیں گے کہ آپ انسانوں کے باپ ہیں، اللہ نے آپ کو اپنے ہاتھ سے پیدا کیا اور آپ کو جنت میں مقام عطا کیا، آپ کو سجدہ کرنے کا فرشتوں کو حکم دیا اور آپ کو ہر چیز کے نام سکھائے۔ آپ ہماری شفاعت اپنے رب کے حضور میں کریں تاکہ ہمیں اس حالت سے نجات دے۔ بیان کیا کہ آدم علیہ السلام کہیں گے کہ میں اس لائق نہیں وہ اپنی اس غلطی کو یاد کریں گے جو باوجود رکنے کے درخت کھا لینے کی وجہ سے ان سے ہوئی تھی اور کہیں گے کہ نوح علیہ السلام کے پاس جاؤ کیونکہ وہ پہلے نبی ہیں جنہیں اللہ تعالیٰ نے زمین والوں کی طرف رسول بنا کر بھیجا تھا۔ چنانچہ لوگ نوح علیہ السلام کے پاس آئیں گے تو وہ بھی یہ فرمائیں گے کہ میں اس لائق نہیں اور اپنی اس غلطی کو یاد کریں گے جو بغیر علم کے اللہ رب العزت سے سوال کر کے ( اپنے بیٹے کی بخشش کے لیے ) انہوں نے کی تھی اور کہیں گے کہ ابراہیم علیہ السلام کے پاس جاؤ جو اللہ کے خلیل ہیں۔ بیان کیا کہ ہم سب لوگ ابراہیم علیہ السلام کے پاس آئیں گے تو وہ بھی یہی عذر کریں گے کہ میں اس لائق نہیں اور وہ ان تین باتوں کو یاد کریں گے جن میں آپ نے بظاہر غلط بیانی کی تھی اور کہیں گے کہ موسیٰ علیہ السلام کے پاس جاؤ۔ وہ ایسے بندے ہیں جنہیں اللہ تعالیٰ نے توریت دی اور ان سے بات کی اور ان کو نزدیک کر کے ان سے سرگوشی کی۔ بیان کیا کہ پھر لوگ موسیٰ علیہ السلام کے پاس آئیں گے تو وہ بھی کہیں گے کہ میں اس لائق نہیں ہوں اور وہ غلطی یاد کریں گے جو ایک شخص کو قتل کر کے انہوں نے کی تھی۔ ( وہ کہیں گے ) البتہ عیسیٰ علیہ السلام کے پاس جاؤ وہ اللہ کے بندے، اس کے رسول، اللہ کی روح اور اس کا کلمہ ہیں۔ چنانچہ لوگ عیسیٰ علیہ السلام کے پاس آئیں گے۔ وہ فرمائیں گے کہ میں اس لائق نہیں ہوں تم لوگ محمد صلی اللہ علیہ وسلم کے پاس جاؤ۔ وہ ایسے بندے ہیں کہ اللہ نے ان کے اگلے پچھلے تمام گناہ معاف کر دئیے۔ چنانچہ لوگ میرے پاس آئیں گے اور میں اپنے رب سے اس کے در دولت یعنی عرش معلی پر آنے کے لیے اجازت چاہوں گا۔ مجھے اس کی اجازت دی جائے گی پھر میں اللہ تعالیٰ کو دیکھتے ہی سجدہ میں گر پڑوں گا اور اللہ تعالیٰ مجھے جب تک چاہے گا اسی حالت میں رہنے دے گا۔ پھر فرمائے گا کہ اے محمد! سر اٹھاؤ، کہو سنا جائے گا، شفاعت کرو تمہاری شفاعت قبول کی جائے گی، جو مانگو گے دیا جائے گا۔ بیان کیا کہ پھر میں اپنا سر اٹھاؤں گا اور اپنے رب کی حمد و ثنا کروں گا جو وہ مجھے سکھائے گا۔ بیان کیا کہ پھر میں شفاعت کروں گا۔ چنانچہ میرے لیے حد مقرر کی جائے گی اور میں اس کے مطابق لوگوں کو دوزخ سے نکال کر جنت میں داخل کروں گا۔ قتادہ نے بیان کیا کہ میں نے انس رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ پھر میں نکالوں گا اور جہنم سے نکال کر جنت میں داخل کروں گا۔ پھر تیسری مرتبہ اپنے رب سے اس کے در دولت کے لیے اجازت چاہوں گا اور مجھے اس کی اجازت دی جائے گی۔ پھر میں اللہ رب العزت کو دیکھتے ہی اس کے لیے سجدہ میں گر پڑوں گا اور اللہ تعالیٰ جب تک چاہے گا مجھے یوں ہی چھوڑے رکھے گا۔ پھر فرمائے گا: اے محمد! سر اٹھاؤ، کہو سنا جائے گا شفاعت کرو قبول کی جائے گی، مانگو دیا جائے گا۔ آپ نے بیان کیا کہ میں اپنا سر اٹھاؤں گا اور اپنے رب کی ایسی حمد و ثنا کروں گا جو وہ مجھے سکھائے گا بیان کیا کہ پھر شفاعت کروں گا اور میرے لیے حد مقرر کر دی جائے گا اور میں اس کے مطابق جہنم سے لوگوں کو نکال کر جنت میں داخل کروں گا۔ قتادہ نے بیان کیا کہ میں نے انس رضی اللہ عنہ کو یہ کہتے سنا کہ پھر میں لوگوں کو نکالوں گا اور انہیں جہنم سے نکال کر جنت میں داخل کروں گا، یہاں تک کہ جہنم میں صرف وہی لوگ باقی رہ جائیں گے جنہیں قرآن نے روک رکھا ہو گا یعنی انہیں ہمیشہ ہی اس میں رہنا ہو گا ( یعنی کفار و مشرکین ) پھر آپ نے یہ آیت تلاوت کی «عسى أن يبعثك ربك مقاما محمودا‏» ”قریب ہے کہ آپ کا رب مقام محمود پر آپ کو بھیجے گا“ فرمایا کہ یہی وہ مقام محمود ہے جس کے لیے اللہ تعالیٰ نے اپنے حبیب صلی اللہ علیہ وسلم سے وعدہ کیا ہے۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		}
	]
}