{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، ان سے سعید بن ہلال العنزی نے بیان کیا، انہوں نے کہا کہ بصرہ کے کچھ لوگ ہمارے پاس جمع ہو گئے۔ پھر ہم انس بن مالک رضی اللہ عنہ کے پاس گئے اور اپنے ساتھ ثابت رضی اللہ عنہ کو بھی لے گئے تاکہ وہ ہمارے لیے شفاعت کی حدیث پوچھیں۔ انس رضی اللہ عنہ اپنے محل میں تھے اور جب ہم پہنچے تو وہ چاشت کی نماز پڑھ رہے تھے۔ ہم نے ملاقات کی اجازت چاہی اور ہمیں اجازت مل گئی۔ اس وقت وہ اپنے بستر پر بیٹھے تھے۔ ہم نے ثابت سے کہا تھا کہ حدیث شفاعت سے پہلے ان سے اور کچھ نہ پوچھنا۔ چنانچہ انہوں نے کہا: اے ابوحمزہ! یہ آپ کے بھائی بصرہ سے آئے ہیں اور آپ سے شفاعت کی حدیث پوچھنا چاہتے ہیں۔ انہوں نے کہا کہ ہم سے محمد صلی اللہ علیہ وسلم نے بیان کیا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کا دن جب آئے گا تو لوگ ٹھاٹھیں مارتے ہوئے سمندر کی طرح ظاہر ہوں گے۔ پھر وہ آدم علیہ السلام کے پاس آئیں گے اور ان سے کہیں گے کہ ہماری اپنے رب کے پاس شفاعت کیجئے۔ وہ کہیں گے کہ میں اس قابل نہیں ہوں تم ابراہیم علیہ السلام کے پاس جاؤ، وہ اللہ کے خلیل ہیں۔ لوگ ابراہیم علیہ السلام کے پاس آئیں گے وہ بھی کہیں گے کہ میں اس قابل نہیں ہوں، ہاں تم موسیٰ علیہ السلام کے پاس جاؤ کہ وہ اللہ سے شرف ہم کلامی پانے والے ہیں۔ لوگ موسیٰ علیہ السلام کے پاس آئیں گے اور وہ بھی کہیں گے کہ میں اس قابل نہیں ہوں، البتہ تم عیسیٰ علیہ السلام کے پاس جاؤ کہ وہ اللہ کی روح اور اس کا کلمہ ہیں۔ چنانچہ لوگ عیسیٰ علیہ السلام کے پاس آئیں گے وہ بھی کہیں گے کہ میں اس قابل نہیں ہوں، ہاں تم محمد صلی اللہ علیہ وسلم کے پاس جاؤ۔ لوگ میرے پاس آئیں گے اور میں کہوں گا کہ میں شفاعت کے لیے ہوں اور پھر میں اپنے رب سے اجازت چاہوں گا اور مجھے اجازت دی جائے گی اور اللہ تعالیٰ تعریفوں کے الفاظ مجھے الہام کرے گا جن کے ذریعہ میں اللہ کی حمد بیان کروں گا جو اس وقت مجھے یاد نہیں ہیں۔ چنانچہ جب میں یہ تعریفیں بیان کروں گا اللہ کے حضور میں سجدہ کرنے والا ہو جاؤں گا تو مجھ سے کہا جائے گا: اے محمد! اپنا سر اٹھاؤ، جو کہو وہ سنا جائے گا، جو مانگو گے وہ دیا جائے گا، جو شفاعت کرو گے قبول کی جائے گی۔ پھر میں کہوں گا: اے رب! میری امت، میری امت، کہا جائے گا کہ جاؤ اور ان لوگوں کو دوزخ سے نکال لو جن کے دل میں ذرہ یا رائی برابر بھی ایمان ہو۔ چنانچہ میں جاؤں گا اور ایسا ہی کروں گا۔ پھر میں لوٹوں گا اور یہی تعریفیں پھر کروں گا اور اللہ کے لیے سجدہ میں چلا جاؤں گا مجھ سے کہا جائے گا۔ اپنا سر اٹھاؤ کہو، آپ کی سنی جائے گی، میں کہوں گا: اے رب! میری امت، میری امت۔ اللہ تعالیٰ فرمائے گا: جاؤ اور جس کے دل میں ایک رائی کے دانہ کے کم سے کم تر حصہ کے برابر بھی ایمان ہو اسے بھی جہنم سے نکال لو۔ پھر میں جاؤں گا اور نکالوں گا۔ پھر جب ہم انس رضی اللہ عنہ کے پاس سے نکلے تو میں نے اپنے بعض ساتھیوں سے کہا کہ ہمیں امام حسن بصری کے پاس بھی چلنا چاہئیے، وہ اس وقت ابوخلیفہ کے مکان میں تھے اور ان سے وہ حدیث بیان کرنا چاہئیے جو انس رضی اللہ عنہ نے ہم سے بیان کی ہے۔ چنانچہ ہم ان کے پاس آئے اور انہیں سلام کیا۔ پھر انہوں نے ہمیں اجازت دی اور ہم نے ان سے کہا: اے ابوسعید! ہم آپ کے پاس آپ کے بھائی انس بن مالک رضی اللہ عنہ کے یہاں سے آئے ہیں اور انہوں نے ہم سے جو شفاعت کے متعلق حدیث بیان کی، اس جیسی حدیث ہم نے نہیں سنی، انہوں نے کہا کہ بیان کرو۔ ہم نے ان سے حدیث بیان کی جب اس مقام تک پہنچے تو انہوں نے کہا کہ اور بیان کرو، ہم نے کہا کہ اس سے زیادہ انہوں نے نہیں بیان کی۔ انہوں نے کہا کہ انس رضی اللہ عنہ جب صحت مند تھے، بیس سال اب سے پہلے تو انہوں نے مجھ سے یہ حدیث بیان کی تھی۔ مجھے معلوم نہیں کہ وہ باقی بھول گئے یا اس لیے بیان کرنا ناپسند کیا کہ کہیں لوگ بھروسہ نہ کر بیٹھیں۔ ہم نے کہا ابوسعید! پھر ہم سے وہ حدیث بیان کیجئے۔ آپ اس پر ہنسے اور فرمایا: انسان بڑا جلد باز پیدا کیا گیا ہے۔ میں نے اس کا ذکر ہی اس لیے کیا ہے کہ تم سے بیان کرنا چاہتا ہوں۔ انس رضی اللہ عنہ نے مجھ سے اسی طرح حدیث بیان کی جس طرح تم سے بیان کی ( اور اس میں یہ لفظ اور بڑھائے ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں چوتھی مرتبہ لوٹوں گا اور وہی تعریفیں کروں گا اور اللہ کے لیے سجدہ میں چلا جاؤں گا۔ اللہ فرمائے گا: اے محمد! اپنا سر اٹھاؤ، جو کہو گے سنا جائے گا، جو مانگو کے دیا جائے گا، جو شفاعت کرو کے قبول کی جائے گی۔ میں کہوں گا: اے رب! مجھے ان کے بارے میں بھی اجازت دیجئیے جنہوں نے لا الہٰ الا اللہ کہا ہے۔ اللہ تعالیٰ فرمائے گا میری عزت، میرے جلال، میری کبریائی، میری بڑائی کی قسم! اس میں سے ( میں ) انہیں بھی نکالوں گا جنہوں نے کلمہ لا الہٰ الا اللہ کہا ہے۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		}
	]
}