{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے ابوعوانہ وضاح یشکری نے بیان کیا، کہا کہ ہم سے عبدالملک بن عمیر نے جابر بن سمرہ رضی اللہ عنہ سے بیان کیا، کہا کہ اہل کوفہ نے سعد بن ابی وقاص رضی اللہ عنہ کی عمر فاروق رضی اللہ عنہ سے شکایت کی۔ اس لیے عمر رضی اللہ عنہ نے ان کو مغزول کر کے عمار رضی اللہ عنہ کو کوفہ کا حاکم بنایا، تو کوفہ والوں نے سعد کے متعلق یہاں تک کہہ دیا کہ وہ تو اچھی طرح نماز بھی نہیں پڑھا سکتے۔ چنانچہ عمر رضی اللہ عنہ نے ان کو بلا بھیجا۔ آپ نے ان سے پوچھا کہ اے ابواسحاق! ان کوفہ والوں کا خیال ہے کہ تم اچھی طرح نماز نہیں پڑھا سکتے ہو۔ اس پر آپ نے جواب دیا کہ اللہ کی قسم! میں تو انہیں نبی کریم صلی اللہ علیہ وسلم ہی کی طرح نماز پڑھاتا تھا، اس میں کوتاہی نہیں کرتا عشاء کی نماز پڑھاتا تو اس کی دو پہلی رکعات میں ( قرآت ) لمبی کرتا اور دوسری دو رکعتیں ہلکی پڑھاتا۔ عمر رضی اللہ عنہ نے فرمایا کہ اے ابواسحاق! مجھ کو تم سے امید بھی یہی تھی۔ پھر آپ نے سعد رضی اللہ عنہ کے ساتھ ایک یا کئی آدمیوں کو کوفہ بھیجا۔ قاصد نے ہر ہر مسجد میں جا کر ان کے متعلق پوچھا۔ سب نے آپ کی تعریف کی لیکن جب مسجد بنی عبس میں گئے۔ تو ایک شخص جس کا نام اسامہ بن قتادہ اور کنیت ابوسعدہ تھی کھڑا ہوا۔ اس نے کہا کہ جب آپ نے اللہ کا واسطہ دے کر پوچھا ہے تو ( سنیے کہ ) سعد نہ فوج کے ساتھ خود جہاد کرتے تھے، نہ مال غنیمت کی تقسیم صحیح کرتے تھے اور نہ فیصلے میں عدل و انصاف کرتے تھے۔ سعد رضی اللہ عنہ نے ( یہ سن کر ) فرمایا کہ اللہ کی قسم میں ( تمہاری اس بات پر ) تین دعائیں کرتا ہوں۔ اے اللہ! اگر تیرا یہ بندہ جھوٹا ہے اور صرف ریا و نمود کے لیے کھڑا ہوا ہے تو اس کی عمردراز کر اور اسے خوب محتاج بنا اور اسے فتنوں میں مبتلا کر۔ اس کے بعد ( وہ شخص اس درجہ بدحال ہوا کہ ) جب اس سے پوچھا جاتا تو کہتا کہ ایک بوڑھا اور پریشان حال ہوں مجھے سعد رضی اللہ عنہ کی بددعا لگ گئی۔ عبدالملک نے بیان کیا کہ میں نے اسے دیکھا اس کی بھویں بڑھاپے کی وجہ سے آنکھوں پر آ گئی تھی۔ لیکن اب بھی راستوں میں وہ لڑکیوں کو چھیڑتا۔",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 149
			}
		}
	]
}