{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، ان سے عبدالوہاب نے، کہا ہم سے ایوب سختیانی نے، ان سے ابوقلابہ اور قاسم تمیمی نے، ان سے زہدم نے بیان کیا کہ اس قبیلہ جرم اور اشعریوں میں محبت اور بھائی چارہ کا معاملہ تھا۔ ایک مرتبہ ہم ابوموسیٰ اشعری رضی اللہ عنہ کے پاس تھے کہ ان کے پاس کھانا لایا گیا جس میں مرغی کا گوشت بھی تھا۔ ان کے ہاں ایک بنی تیم اللہ کا بھی شخص تھا۔ غالباً وہ عرب کے غلام لوگوں میں سے تھا۔ ابوموسیٰ رضی اللہ عنہ نے اسے اپنے پاس بلایا تو اس نے کہا کہ میں نے مرغی کو گندگی کھاتے دیکھا ہے اور اسی وقت سے قسم کھا لی کہ اس کا گوشت نہیں کھاؤں گا۔ ابوموسیٰ رضی اللہ عنہ نے کہا، سنو! میں تم سے اس کے متعلق ایک حدیث رسول اللہ صلی اللہ علیہ وسلم کی بیان کرتا ہوں۔ میں نبی کریم صلی اللہ علیہ وسلم کے پاس اشعریوں کے کچھ افراد کو لے کر حاضر ہوا اور ہم نے آپ سے سواری مانگی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ واللہ! میں تمہارے لیے سواری کا انتظام نہیں کر سکتا، نہ میرے پاس کوئی ایسی چیز ہے جسے میں تمہیں سواری کے لیے دوں۔ پھر نبی کریم صلی اللہ علیہ وسلم کے پاس مال غنیمت میں سے کچھ اونٹ آئے تو نبی کریم صلی اللہ علیہ وسلم نے ہمارے متعلق پوچھا کہ اشعری لوگ کہاں ہیں؟ چنانچہ آپ نے ہمیں پانچ عمدہ اونٹ دینے کا حکم دیا۔ ہم انہیں لے کر چلے تو ہم نے اپنے عمل کے متعلق سوچا کہ نبی کریم صلی اللہ علیہ وسلم نے قسم کھائی تھی کہ ہمیں سواری کے لیے کوئی جانور نہیں دیں گے اور نہ آپ کے پاس کوئی ایسا جانور ہے جو ہمیں سواری کے لیے دیں۔ ہم نے سوچا کہ نبی کریم صلی اللہ علیہ وسلم اپنی قسم بھول گئے ہیں، واللہ! ہم کبھی فلاح نہیں پا سکتے۔ ہم واپس نبی کریم صلی اللہ علیہ وسلم کے پاس پہنچے اور آپ سے صورت حال کے متعلق پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں یہ سواری نہیں دے رہا ہوں بلکہ اللہ دے رہا ہے۔ واللہ! میں اگر کوئی قسم کھا لیتا ہوں اور پھر اس کے خلاف میں دیکھتا ہوں تو میں وہی کرتا ہوں جس میں بھلائی ہوتی ہے اور قسم کا کفارہ دے دیتا ہوں۔",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		}
	]
}