{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "حدثنا حفص بن عمر، حدثنا همام، حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، قال ‏:‏ طلقت امرأتي فأتيت المدينة لأبيع عقارا كان لي بها، فأشتري به السلاح وأغزو، فلقيت نفرا من أصحاب النبي صلى الله عليه وسلم فقالوا ‏:‏ قد أراد نفر منا ستة أن يفعلوا ذلك فنهاهم النبي صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ لقد كان لكم في رسول الله أسوة حسنة ‏\"‏ ‏.‏ فأتيت ابن عباس فسألته عن وتر النبي صلى الله عليه وسلم فقال ‏:‏ أدلك على أعلم الناس بوتر رسول الله صلى الله عليه وسلم فأت عائشة رضى الله عنها ‏.‏ فأتيتها فاستتبعت حكيم بن أفلح فأبى فناشدته فانطلق معي، فاستأذنا على عائشة، فقالت ‏:‏ من هذا قال ‏:‏ حكيم بن أفلح ‏.‏ قالت ‏:‏ ومن معك قال ‏:‏ سعد بن هشام ‏.‏ قالت ‏:‏ هشام بن عامر الذي قتل يوم أحد قال قلت ‏:‏ نعم ‏.‏ قالت ‏:‏ نعم المرء كان عامرا ‏.‏ قال قلت ‏:‏ يا أم المؤمنين حدثيني عن خلق رسول الله صلى الله عليه وسلم ‏.‏ قالت ‏:‏ ألست تقرأ القرآن فإن خلق رسول الله صلى الله عليه وسلم كان القرآن ‏.‏ قال قلت ‏:‏ حدثيني عن قيام الليل قالت ‏:‏ ألست تقرأ ‏{‏ يا أيها المزمل ‏}‏ قال قلت ‏:‏ بلى ‏.‏ قالت ‏:‏ فإن أول هذه السورة نزلت، فقام أصحاب رسول الله صلى الله عليه وسلم حتى انتفخت أقدامهم، وحبس خاتمتها في السماء اثنى عشر شهرا، ثم نزل آخرها فصار قيام الليل تطوعا بعد فريضة ‏.‏ قال قلت ‏:‏ حدثيني عن وتر النبي صلى الله عليه وسلم ‏.‏ قالت ‏:‏ كان يوتر بثمان ركعات لا يجلس إلا في الثامنة، ثم يقوم فيصلي ركعة أخرى، لا يجلس إلا في الثامنة والتاسعة، ولا يسلم إلا في التاسعة، ثم يصلي ركعتين وهو جالس فتلك إحدى عشرة ركعة يا بنى، فلما أسن وأخذ اللحم أوتر بسبع ركعات لم يجلس إلا في السادسة والسابعة، ولم يسلم إلا في السابعة، ثم يصلي ركعتين وهو جالس، فتلك هي تسع ركعات يا بنى، ولم يقم رسول الله صلى الله عليه وسلم ليلة يتمها إلى الصباح، ولم يقرإ القرآن في ليلة قط، ولم يصم شهرا يتمه غير رمضان، وكان إذا صلى صلاة داوم عليها، وكان إذا غلبته عيناه من الليل بنوم صلى من النهار ثنتى عشرة ركعة ‏.‏ قال ‏:‏ فأتيت ابن عباس فحدثته ‏.‏ فقال ‏:‏ هذا والله هو الحديث، ولو كنت أكلمها لأتيتها حتى أشافهها به مشافهة ‏.‏ قال قلت ‏:‏ لو علمت أنك لا تكلمها ما حدثتك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		}
	]
}