{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "حدثنا عبد الله بن محمد النفيلي، وعثمان بن أبي شيبة، وهشام بن عمار، وسليمان بن عبد الرحمن الدمشقيان، - وربما زاد بعضهم على بعض الكلمة والشىء - قالوا حدثنا حاتم بن إسماعيل حدثنا جعفر بن محمد عن أبيه قال دخلنا على جابر بن عبد الله فلما انتهينا إليه سأل عن القوم حتى انتهى إلى فقلت أنا محمد بن علي بن حسين ‏.‏ فأهوى بيده إلى رأسي فنزع زري الأعلى ثم نزع زري الأسفل ثم وضع كفه بين ثديى وأنا يومئذ غلام شاب ‏.‏ فقال مرحبا بك وأهلا يا ابن أخي سل عما شئت ‏.‏ فسألته وهو أعمى وجاء وقت الصلاة فقام في نساجة ملتحفا بها يعني ثوبا ملفقا كلما وضعها على منكبه رجع طرفاها إليه من صغرها فصلى بنا ورداؤه إلى جنبه على المشجب ‏.‏ فقلت أخبرني عن حجة رسول الله صلى الله عليه وسلم ‏.‏ فقال بيده فعقد تسعا ‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم مكث تسع سنين لم يحج ثم أذن في الناس في العاشرة أن رسول الله صلى الله عليه وسلم حاج فقدم المدينة بشر كثير كلهم يلتمس أن يأتم برسول الله صلى الله عليه وسلم ويعمل بمثل عمله فخرج رسول الله صلى الله عليه وسلم وخرجنا معه حتى أتينا ذا الحليفة فولدت أسماء بنت عميس محمد بن أبي بكر فأرسلت إلى رسول الله صلى الله عليه وسلم كيف أصنع قال ‏\"‏ اغتسلي واستذفري بثوب وأحرمي ‏\"‏ ‏.‏ فصلى رسول الله صلى الله عليه وسلم في المسجد ثم ركب القصواء حتى إذا استوت به ناقته على البيداء ‏.‏ قال جابر نظرت إلى مد بصري من بين يديه من راكب وماش وعن يمينه مثل ذلك وعن يساره مثل ذلك ومن خلفه مثل ذلك ورسول الله صلى الله عليه وسلم بين أظهرنا وعليه ينزل القرآن وهو يعلم تأويله فما عمل به من شىء عملنا به فأهل رسول الله صلى الله عليه وسلم بالتوحيد ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ وأهل الناس بهذا الذي يهلون به فلم يرد عليهم رسول الله صلى الله عليه وسلم شيئا منه ولزم رسول الله صلى الله عليه وسلم تلبيته ‏.‏ قال جابر لسنا ننوي إلا الحج لسنا نعرف العمرة حتى إذا أتينا البيت معه استلم الركن فرمل ثلاثا ومشى أربعا ثم تقدم إلى مقام إبراهيم فقرأ ‏{‏ واتخذوا من مقام إبراهيم مصلى ‏}‏ فجعل المقام بينه وبين البيت قال فكان أبي يقول قال ابن نفيل وعثمان ولا أعلمه ذكره إلا عن النبي صلى الله عليه وسلم ‏.‏ قال سليمان ولا أعلمه إلا قال كان رسول الله صلى الله عليه وسلم يقرأ في الركعتين بـ ‏{‏ قل هو الله أحد ‏}‏ وبـ ‏{‏ قل يا أيها الكافرون ‏}‏ ثم رجع إلى البيت فاستلم الركن ثم خرج من الباب إلى الصفا فلما دنا من الصفا قرأ ‏{‏ إن الصفا والمروة من شعائر الله ‏}‏ ‏\"‏ نبدأ بما بدأ الله به ‏\"‏ ‏.‏ فبدأ بالصفا فرقي عليه حتى رأى البيت فكبر الله ووحده وقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شىء قدير لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ ثم دعا بين ذلك وقال مثل هذا ثلاث مرات ثم نزل إلى المروة حتى إذا انصبت قدماه رمل في بطن الوادي حتى إذا صعد مشى حتى أتى المروة فصنع على المروة مثل ما صنع على الصفا حتى إذا كان آخر الطواف على المروة قال ‏\"‏ إني لو استقبلت من أمري ما استدبرت لم أسق الهدى ولجعلتها عمرة فمن كان منكم ليس معه هدى فليحلل وليجعلها عمرة ‏\"‏ ‏.‏ فحل الناس كلهم وقصروا إلا النبي صلى الله عليه وسلم ومن كان معه هدى فقام سراقة بن جعشم فقال يا رسول الله ألعامنا هذا أم للأبد فشبك رسول الله صلى الله عليه وسلم أصابعه في الأخرى ثم قال ‏\"‏ دخلت العمرة في الحج ‏\"‏ ‏.‏ هكذا مرتين ‏\"‏ لا بل لأبد أبد لا بل لأبد أبد ‏\"‏ ‏.‏ قال وقدم علي - رضى الله عنه - من اليمن ببدن النبي صلى الله عليه وسلم فوجد فاطمة - رضى الله عنها - ممن حل ولبست ثيابا صبيغا واكتحلت فأنكر علي ذلك عليها وقال من أمرك بهذا فقالت أبي ‏.‏ فكان علي يقول بالعراق ذهبت إلى رسول الله صلى الله عليه وسلم محرشا على فاطمة في الأمر الذي صنعته مستفتيا لرسول الله صلى الله عليه وسلم في الذي ذكرت عنه فأخبرته أني أنكرت ذلك عليها فقالت إن أبي أمرني بهذا ‏.‏ فقال ‏\"‏ صدقت صدقت ماذا قلت حين فرضت الحج ‏\"‏ ‏.‏ قال قلت اللهم إني أهل بما أهل به رسول الله صلى الله عليه وسلم ‏.‏ قال ‏\"‏ فإن معي الهدى فلا تحلل ‏\"‏ ‏.‏ قال وكان جماعة الهدى الذي قدم به علي من اليمن والذي أتى به النبي صلى الله عليه وسلم من المدينة مائة فحل الناس كلهم وقصروا إلا النبي صلى الله عليه وسلم ومن كان معه هدى قال فلما كان يوم التروية ووجهوا إلى منى أهلوا بالحج فركب رسول الله صلى الله عليه وسلم فصلى بمنى الظهر والعصر والمغرب والعشاء والصبح ثم مكث قليلا حتى طلعت الشمس وأمر بقبة له من شعر فضربت بنمرة فسار رسول الله صلى الله عليه وسلم ولا تشك قريش أن رسول الله صلى الله عليه وسلم واقف عند المشعر الحرام بالمزدلفة كما كانت قريش تصنع في الجاهلية فأجاز رسول الله صلى الله عليه وسلم حتى أتى عرفة فوجد القبة قد ضربت له بنمرة فنزل بها حتى إذا زاغت الشمس أمر بالقصواء فرحلت له فركب حتى أتى بطن الوادي فخطب الناس فقال ‏\"‏ إن دماءكم وأموالكم عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا إن كل شىء من أمر الجاهلية تحت قدمى موضوع ودماء الجاهلية موضوعة وأول دم أضعه دماؤنا دم ‏\"‏ ‏.‏ قال عثمان ‏\"‏ دم ابن ربيعة ‏\"‏ ‏.‏ وقال سليمان ‏\"‏ دم ربيعة بن الحارث بن عبد المطلب ‏\"‏ ‏.‏ وقال بعض هؤلاء كان مسترضعا في بني سعد فقتلته هذيل ‏\"‏ وربا الجاهلية موضوع وأول ربا أضعه ربانا ربا عباس بن عبد المطلب فإنه موضوع كله اتقوا الله في النساء فإنكم أخذتموهن بأمانة الله واستحللتم فروجهن بكلمة الله وإن لكم عليهن أن لا يوطئن فرشكم أحدا تكرهونه فإن فعلن فاضربوهن ضربا غير مبرح ولهن عليكم رزقهن وكسوتهن بالمعروف وإني قد تركت فيكم ما لن تضلوا بعده إن اعتصمتم به كتاب الله وأنتم مسئولون عني فما أنتم قائلون ‏\"‏ ‏.‏ قالوا نشهد أنك قد بلغت وأديت ونصحت ‏.‏ ثم قال بأصبعه السبابة يرفعها إلى السماء وينكبها إلى الناس ‏\"‏ اللهم اشهد اللهم اشهد اللهم اشهد ‏\"‏ ‏.‏ ثم أذن بلال ثم أقام فصلى الظهر ثم أقام فصلى العصر ولم يصل بينهما شيئا ثم ركب القصواء حتى أتى الموقف فجعل بطن ناقته القصواء إلى الصخرات وجعل حبل المشاة بين يديه فاستقبل القبلة فلم يزل واقفا حتى غربت الشمس وذهبت الصفرة قليلا حين غاب القرص وأردف أسامة خلفه فدفع رسول الله صلى الله عليه وسلم وقد شنق للقصواء الزمام حتى إن رأسها ليصيب مورك رحله وهو يقول بيده اليمنى ‏\"‏ السكينة أيها الناس السكينة أيها الناس ‏\"‏ ‏.‏ كلما أتى حبلا من الحبال أرخى لها قليلا حتى تصعد حتى أتى المزدلفة فجمع بين المغرب والعشاء بأذان واحد وإقامتين - قال عثمان ولم يسبح بينهما شيئا ثم اتفقوا - ثم اضطجع رسول الله صلى الله عليه وسلم حتى طلع الفجر فصلى الفجر حين تبين له الصبح - قال سليمان بنداء وإقامة ثم اتفقوا - ثم ركب القصواء حتى أتى المشعر الحرام فرقي عليه قال عثمان وسليمان فاستقبل القبلة فحمد الله وكبره وهلله زاد عثمان ووحده فلم يزل واقفا حتى أسفر جدا ثم دفع رسول الله صلى الله عليه وسلم قبل أن تطلع الشمس وأردف الفضل بن عباس وكان رجلا حسن الشعر أبيض وسيما فلما دفع رسول الله صلى الله عليه وسلم مر الظعن يجرين فطفق الفضل ينظر إليهن فوضع رسول الله صلى الله عليه وسلم يده على وجه الفضل وصرف الفضل وجهه إلى الشق الآخر وحول رسول الله صلى الله عليه وسلم يده إلى الشق الآخر وصرف الفضل وجهه إلى الشق الآخر ينظر حتى أتى محسرا فحرك قليلا ثم سلك الطريق الوسطى الذي يخرجك إلى الجمرة الكبرى حتى أتى الجمرة التي عند الشجرة فرماها بسبع حصيات يكبر مع كل حصاة منها بمثل حصى الخذف فرمى من بطن الوادي ثم انصرف رسول الله صلى الله عليه وسلم إلى المنحر فنحر بيده ثلاثا وستين وأمر عليا فنحر ما غبر - يقول ما بقي - وأشركه في هديه ثم أمر من كل بدنة ببضعة فجعلت في قدر فطبخت فأكلا من لحمها وشربا من مرقها قال سليمان ثم ركب ثم أفاض رسول الله صلى الله عليه وسلم إلى البيت فصلى بمكة الظهر ثم أتى بني عبد المطلب وهم يسقون على زمزم فقال ‏\"‏ انزعوا بني عبد المطلب فلولا أن يغلبكم الناس على سقايتكم لنزعت معكم ‏\"‏ ‏.‏ فناولوه دلوا فشرب منه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 185
			}
		}
	]
}