{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2174,
			"arabicnumber": 2174,
			"text": "حدثنا مسدد، حدثنا بشر، حدثنا الجريري، ح وحدثنا مؤمل، حدثنا إسماعيل، ح وحدثنا موسى، حدثنا حماد، كلهم عن الجريري، عن أبي نضرة، حدثني شيخ، من طفاوة قال تثويت أبا هريرة بالمدينة فلم أر رجلا من أصحاب النبي صلى الله عليه وسلم أشد تشميرا ولا أقوم على ضيف منه فبينما أنا عنده يوما وهو على سرير له ومعه كيس فيه حصى أو نوى - وأسفل منه جارية له سوداء - وهو يسبح بها حتى إذا أنفد ما في الكيس ألقاه إليها فجمعته فأعادته في الكيس فدفعته إليه فقال ألا أحدثك عني وعن رسول الله صلى الله عليه وسلم قال قلت بلى ‏.‏ قال بينا أنا أوعك في المسجد إذ جاء رسول الله صلى الله عليه وسلم حتى دخل المسجد ‏.‏ فقال ‏\"‏ من أحس الفتى الدوسي ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ فقال رجل يا رسول الله هو ذا يوعك في جانب المسجد فأقبل يمشي حتى انتهى إلى فوضع يده على فقال لي معروفا فنهضت فانطلق يمشي حتى أتى مقامه الذي يصلي فيه فأقبل عليهم ومعه صفان من رجال وصف من نساء أو صفان من نساء وصف من رجال فقال ‏\"‏ إن أنساني الشيطان شيئا من صلاتي فليسبح القوم وليصفق النساء ‏\"‏ ‏.‏ قال فصلى رسول الله صلى الله عليه وسلم ولم ينس من صلاته شيئا ‏.‏ فقال ‏\"‏ مجالسكم مجالسكم ‏\"‏ ‏.‏ زاد موسى ‏\"‏ ها هنا ‏\"‏ ‏.‏ ثم حمد الله تعالى وأثنى عليه ثم قال ‏\"‏ أما بعد ‏\"‏ ‏.‏ ثم اتفقوا ثم أقبل على الرجال فقال ‏\"‏ هل منكم الرجل إذا أتى أهله فأغلق عليه بابه وألقى عليه ستره واستتر بستر الله ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ ثم يجلس بعد ذلك فيقول فعلت كذا فعلت كذا ‏\"‏ ‏.‏ قال فسكتوا قال فأقبل على النساء فقال ‏\"‏ هل منكن من تحدث ‏\"‏ ‏.‏ فسكتن فجثت فتاة - قال مؤمل في حديثه فتاة كعاب - على إحدى ركبتيها وتطاولت لرسول الله صلى الله عليه وسلم ليراها ويسمع كلامها فقالت يا رسول الله إنهم ليتحدثون وإنهن ليتحدثنه فقال ‏\"‏ هل تدرون ما مثل ذلك ‏\"‏ ‏.‏ فقال ‏\"‏ إنما ذلك مثل شيطانة لقيت شيطانا في السكة فقضى منها حاجته والناس ينظرون إليه ألا وإن طيب الرجال ما ظهر ريحه ولم يظهر لونه ألا إن طيب النساء ما ظهر لونه ولم يظهر ريحه ‏\"‏ ‏.‏ قال أبو داود من ها هنا حفظته عن مؤمل وموسى ‏\"‏ ألا لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا إلى ولد أو والد ‏\"‏ ‏.‏ وذكر ثالثة فأنسيتها وهو في حديث مسدد ولكني لم أتقنه كما أحب وقال موسى حدثنا حماد عن الجريري عن أبي نضرة عن الطفاوي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		}
	]
}