{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 281,
			"arabicnumber": 281,
			"text": "حدثنا يوسف بن موسى، حدثنا جرير، عن سهيل، - يعني ابن أبي صالح - عن الزهري، عن عروة بن الزبير، حدثتني فاطمة بنت أبي حبيش، أنها أمرت أسماء - أو أسماء حدثتني أنها، أمرتها فاطمة بنت أبي حبيش - أن تسأل، رسول الله صلى الله عليه وسلم فأمرها أن تقعد الأيام التي كانت تقعد ثم تغتسل ‏.1 قال أبو داود ورواه قتادة عن عروة بن الزبير عن زينب بنت أم سلمة أن أم حبيبة بنت جحش استحيضت فأمرها النبي صلى الله عليه وسلم أن تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏.‏ قال أبو داود لم يسمع قتادة من عروة شيئا ‏.2 وزاد ابن عيينة في حديث الزهري عن عمرة عن عائشة أن أم حبيبة كانت تستحاض فسألت النبي صلى الله عليه وسلم فأمرها أن تدع الصلاة أيام أقرائها ‏.‏ قال أبو داود وهذا وهم من ابن عيينة ليس هذا في حديث الحفاظ عن الزهري إلا ما ذكر سهيل بن أبي صالح وقد روى الحميدي هذا الحديث عن ابن عيينة لم يذكر فيه ‏\"‏ تدع الصلاة أيام أقرائها ‏\"‏ ‏.1 وروت قمير بنت عمرو زوج مسروق عن عائشة المستحاضة تترك الصلاة أيام أقرائها ثم تغتسل ‏.3 وقال عبد الرحمن بن القاسم عن أبيه إن النبي صلى الله عليه وسلم أمرها أن تترك الصلاة قدر أقرائها ‏.2 وروى أبو بشر جعفر بن أبي وحشية عن عكرمة عن النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش استحيضت فذكر مثله وروى شريك عن أبي اليقظان عن عدي بن ثابت عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏\"‏ المستحاضة تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏\"‏ ‏.1 وروى العلاء بن المسيب عن الحكم عن أبي جعفر أن سودة استحيضت فأمرها النبي صلى الله عليه وسلم إذا مضت أيامها اغتسلت وصلت ‏.1 وروى سعيد بن جبير عن علي وابن عباس ‏\"‏ المستحاضة تجلس أيام قرئها ‏\"‏ ‏.1 وكذلك رواه عمار مولى بني هاشم وطلق بن حبيب عن ابن عباس 1 وكذلك رواه معقل الخثعمي عن علي رضي الله عنه 4 وكذلك روى الشعبي عن قمير امرأة مسروق عن عائشة رضى الله عنها ‏. قال أبو داود وهو قول الحسن وسعيد بن المسيب وعطاء ومكحول وإبراهيم وسالم والقاسم إن المستحاضة تدع الصلاة أيام أقرائها ‏.‏ قال أبو داود لم يسمع قتادة من عروة شيئا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 281
			}
		}
	]
}