{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "حدثنا محمد بن داود بن سفيان، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبد الرحمن بن كعب بن مالك، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن كفار قريش كتبوا إلى ابن أبى ومن كان يعبد معه الأوثان من الأوس والخزرج ورسول الله صلى الله عليه وسلم يومئذ بالمدينة قبل وقعة بدر إنكم آويتم صاحبنا وإنا نقسم بالله لتقاتلنه أو لتخرجنه أو لنسيرن إليكم بأجمعنا حتى نقتل مقاتلتكم ونستبيح نساءكم ‏.‏ فلما بلغ ذلك عبد الله بن أبى ومن كان معه من عبدة الأوثان اجتمعوا لقتال النبي صلى الله عليه وسلم فلما بلغ ذلك النبي صلى الله عليه وسلم لقيهم فقال ‏\"‏ لقد بلغ وعيد قريش منكم المبالغ ما كانت تكيدكم بأكثر مما تريدون أن تكيدوا به أنفسكم تريدون أن تقاتلوا أبناءكم وإخوانكم ‏\"‏ ‏.‏ فلما سمعوا ذلك من النبي صلى الله عليه وسلم تفرقوا فبلغ ذلك كفار قريش فكتبت كفار قريش بعد وقعة بدر إلى اليهود إنكم أهل الحلقة والحصون وإنكم لتقاتلن صاحبنا أو لنفعلن كذا وكذا ولا يحول بيننا وبين خدم نسائكم شىء - وهي الخلاخيل - فلما بلغ كتابهم النبي صلى الله عليه وسلم أجمعت بنو النضير بالغدر فأرسلوا إلى رسول الله صلى الله عليه وسلم اخرج إلينا في ثلاثين رجلا من أصحابك وليخرج منا ثلاثون حبرا حتى نلتقي بمكان المنصف فيسمعوا منك ‏.‏ فإن صدقوك وآمنوا بك آمنا بك فقص خبرهم فلما كان الغد غدا عليهم رسول الله صلى الله عليه وسلم بالكتائب فحصرهم فقال لهم ‏\"‏ إنكم والله لا تأمنون عندي إلا بعهد تعاهدوني عليه ‏\"‏ ‏.‏ فأبوا أن يعطوه عهدا فقاتلهم يومهم ذلك ثم غدا الغد على بني قريظة بالكتائب وترك بني النضير ودعاهم إلى أن يعاهدوه فعاهدوه فانصرف عنهم وغدا على بني النضير بالكتائب فقاتلهم حتى نزلوا على الجلاء فجلت بنو النضير واحتملوا ما أقلت الإبل من أمتعتهم وأبواب بيوتهم وخشبها فكان نخل بني النضير لرسول الله صلى الله عليه وسلم خاصة أعطاه الله إياها وخصه بها فقال ‏{‏ وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ‏}‏ يقول بغير قتال فأعطى النبي صلى الله عليه وسلم أكثرها للمهاجرين وقسمها بينهم وقسم منها لرجلين من الأنصار وكانا ذوي حاجة لم يقسم لأحد من الأنصار غيرهما وبقي منها صدقة رسول الله صلى الله عليه وسلم التي في أيدي بني فاطمة رضي الله عنها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		}
	]
}