{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "حدثنا داود بن معاذ، حدثنا عبد الوارث، عن نافع أبي غالب، قال كنت في سكة المربد فمرت جنازة معها ناس كثير قالوا جنازة عبد الله بن عمير فتبعتها فإذا أنا برجل عليه كساء رقيق على بريذينته وعلى رأسه خرقة تقيه من الشمس فقلت من هذا الدهقان قالوا هذا أنس بن مالك ‏.‏ فلما وضعت الجنازة قام أنس فصلى عليها وأنا خلفه لا يحول بيني وبينه شىء فقام عند رأسه فكبر أربع تكبيرات لم يطل ولم يسرع ثم ذهب يقعد فقالوا يا أبا حمزة المرأة الأنصارية فقربوها وعليها نعش أخضر فقام عند عجيزتها فصلى عليها نحو صلاته على الرجل ثم جلس فقال العلاء بن زياد يا أبا حمزة هكذا كان رسول الله صلى الله عليه وسلم يصلي على الجنازة كصلاتك يكبر عليها أربعا ويقوم عند رأس الرجل وعجيزة المرأة قال نعم ‏.‏ قال يا أبا حمزة غزوت مع رسول الله صلى الله عليه وسلم قال نعم غزوت معه حنينا فخرج المشركون فحملوا علينا حتى رأينا خيلنا وراء ظهورنا وفي القوم رجل يحمل علينا فيدقنا ويحطمنا فهزمهم الله وجعل يجاء بهم فيبايعونه على الإسلام فقال رجل من أصحاب النبي صلى الله عليه وسلم إن على نذرا إن جاء الله بالرجل الذي كان منذ اليوم يحطمنا لأضربن عنقه ‏.‏ فسكت رسول الله صلى الله عليه وسلم وجيء بالرجل فلما رأى رسول الله صلى الله عليه وسلم قال يا رسول الله تبت إلى الله ‏.‏ فأمسك رسول الله صلى الله عليه وسلم لا يبايعه ليفي الآخر بنذره ‏.‏ قال فجعل الرجل يتصدى لرسول الله صلى الله عليه وسلم ليأمره بقتله وجعل يهاب رسول الله صلى الله عليه وسلم أن يقتله فلما رأى رسول الله صلى الله عليه وسلم أنه لا يصنع شيئا بايعه فقال الرجل يا رسول الله نذري ‏.‏ فقال ‏\"‏ إني لم أمسك عنه منذ اليوم إلا لتوفي بنذرك ‏\"‏ ‏.‏ فقال يا رسول الله ألا أومضت إلى فقال النبي صلى الله عليه وسلم ‏\"‏ إنه ليس لنبي أن يومض ‏\"‏ ‏.‏ قال أبو غالب فسألت عن صنيع أنس في قيامه على المرأة عند عجيزتها فحدثوني أنه إنما كان لأنه لم تكن النعوش فكان الإمام يقوم حيال عجيزتها يسترها من القوم ‏.‏ قال أبو داود قول النبي صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ‏\"‏ ‏.‏ نسخ من هذا الحديث الوفاء بالنذر في قتله بقوله إني قد تبت ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		}
	]
}