{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"25": "The Office of the Judge (Kitab Al-Aqdiyah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3612,
			"arabicnumber": 3612,
			"text": "حدثنا أحمد بن عبدة، حدثنا عمار بن شعيب بن عبد الله بن الزبيب العنبري، حدثني أبي قال، سمعت جدي الزبيب، يقول بعث نبي الله صلى الله عليه وسلم جيشا إلى بني العنبر فأخذوهم بركبة من ناحية الطائف فاستاقوهم إلى نبي الله صلى الله عليه وسلم فركبت فسبقتهم إلى النبي صلى الله عليه وسلم فقلت السلام عليك يا نبي الله ورحمة الله وبركاته أتانا جندك فأخذونا وقد كنا أسلمنا وخضرمنا آذان النعم فلما قدم بلعنبر قال لي نبي الله صلى الله عليه وسلم ‏\"‏ هل لكم بينة على أنكم أسلمتم قبل أن تؤخذوا في هذه الأيام ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ من بينتك ‏\"‏ ‏.‏ قلت سمرة رجل من بني العنبر ورجل آخر سماه له فشهد الرجل وأبى سمرة أن يشهد فقال نبي الله صلى الله عليه وسلم ‏\"‏ قد أبى أن يشهد لك فتحلف مع شاهدك الآخر ‏\"‏ ‏.‏ قلت نعم ‏.‏ فاستحلفني فحلفت بالله لقد أسلمنا يوم كذا وكذا وخضرمنا آذان النعم ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ اذهبوا فقاسموهم أنصاف الأموال ولا تمسوا ذراريهم لولا أن الله لا يحب ضلالة العمل ما رزيناكم عقالا ‏\"‏ ‏.‏ قال الزبيب فدعتني أمي فقالت هذا الرجل أخذ زربيتي فانصرفت إلى النبي صلى الله عليه وسلم - يعني فأخبرته - فقال لي ‏\"‏ احبسه ‏\"‏ ‏.‏ فأخذت بتلبيبه وقمت معه مكاننا ثم نظر إلينا نبي الله صلى الله عليه وسلم قائمين فقال ‏\"‏ ما تريد بأسيرك ‏\"‏ ‏.‏ فأرسلته من يدي فقام نبي الله صلى الله عليه وسلم فقال للرجل ‏\"‏ رد على هذا زربية أمه التي أخذت منها ‏\"‏ ‏.‏ فقال يا نبي الله إنها خرجت من يدي ‏.‏ قال فاختلع نبي الله صلى الله عليه وسلم سيف الرجل فأعطانيه ‏.‏ وقال للرجل ‏\"‏ اذهب فزده آصعا من طعام ‏\"‏ ‏.‏ قال فزادني آصعا من شعير ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		}
	]
}