{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 93,
			"arabicnumber": "8.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": "8.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": "8.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": "8.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": "8.05",
			"text": "Abou Hourayra (que Dieu l'agrée) a dit : Le Prophète (paix et bénédiction de Dieu sur lui) s'étant un jour montré au public, un homme vint lui dire : \"Ô Envoyé de Dieu! Qu'est-ce que la foi?\". - \"C'est, répondit-il, de croire en Dieu, à Ses anges, à Son Livre, à Sa rencontre, à Ses Prophètes et à la Résurrection\". - \"Ô Envoyé de Dieu! Qu'est-ce que l'Islam?\", reprit l'homme. - \"L'Islam, dit le Prophète, consiste à adorer Dieu sans jamais Lui donner d'associés, à s'acquitter de la prière prescrite, à verser l'aumône légale (Az-Zakâ), à jeûner le ramadan\". - \"Ô Envoyé de Dieu! Qu'est-ce que la perfection (al-'ihsân)?\", demanda l'homme. - \"C'est, répliqua le Prophète, d'adorer Dieu comme si vous Le voyiez. Car bien que vous ne le voyiez pas, Lui certes vous voit\". - \"Ô Envoyé de Dieu! Quand est-ce qu'aura lieu l'Heure Suprême?\", reprit l'homme. \"L'interrogé, dit-il, n'en sait pas plus que celui qui interroge. Je vous parlerai plutôt de ses prodromes : Quand l'esclave enfantera son maître; que les va-nu-pieds seront à la tête des gens; et que les pâtres des moutons se vautreront dans leurs constructions élevées. Cette Heure fait partie des cinq (événements) que Seul Dieu détient le secret\". Et le Prophète (paix et bénédiction de Dieu sur lui) de réciter ce verset : La connaissance de l'Heure et auprès de Dieu; et c'est Lui qui fait tomber la pluie salvatrice; et Il sait ce qu'il y a dans les matrices. Et personne ne sait ce qu'il acquerra demain, et personne ne sait dans quelle terre il mourra. Certes Dieu est Omniscient et Parfaitement Connaisseur. L'homme s'éloigna aussitôt et quand le Prophète (paix et bénédiction de Dieu sur lui) ordonna de le faire revenir, personne ne put déceler la moindre trace de l'homme. \"Cet homme, dit alors le Prophète (paix et bénédiction de Dieu sur lui), est Gabriel; il est venu enseigner aux hommes leur religion\". Prières considérées comme l'un des piliers de l'Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": "9",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": "10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": "11.01",
			"text": "Talha Ibn 'Oubaydillâh (que Dieu l'agrée) a dit : Un homme du Nedjd aux cheveux hirsutes vint trouver le Prophète (paix et bénédiction de Dieu sur lui). Nous entendîmes le retentissement de sa voix sans distinguer ce qu'il disait. Quand il s'approcha du Prophète (paix et bénédiction de Dieu sur lui), nous nous aperçûmes qu'il l'interrogeait sur l'Islam. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) lui répondit : \"Cinq prières à accomplir pendant le jour et la nuit\". - \"Dois-je accomplir d'autres prières?\", demanda l'homme. - \"Non, à moins que tu ne veuilles faire œuvre supplémentaire\". - \"Il y a aussi le jeûne du ramadan\", reprit le Prophète. - \"Dois-je observer d'autres jeûnes?\", ajouta l'homme. - \"Non, à moins que tu ne veuilles faire œuvre supplémentaire\", dit le Prophète (paix et bénédiction de Dieu sur lui), qui mentionna alors l'aumône légale (Az-Zakâ). - \"Dois-je payer d'autre aumône?\", demanda l'homme. - \"Non, à moins que tu ne veuilles faire œuvre supplémentaire\", répéta le Prophète. L'homme s'en alla en disant : \"Par Dieu! Je n'en ferai rien de plus ni rien de moins\". Le Prophète (paix et bénédiction de Dieu sur lui) dit alors : \"Il réussira s'il est sincère\". Interrogation au sujet des piliers de l'Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": "11.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": "12.01",
			"text": "Anas Ibn Mâlik (que Dieu l'agrée) a dit : Il nous fut interdit de poser des questions inutiles à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui); aussi nous plaisait-il qu'un bédouin sensé vint lui (paix et bénédiction de Dieu sur lui) demander des éclaircissements et nous d'entendre ses réponses. Il arriva qu'un bédouin se présenta chez le Prophète et lui dit :\" Ô Muhammad! Ton messager est venu nous informer que tu prétends que Dieu t'a chargé d'une Mission\". - \"Il a dit vrai\", répliqua le Prophète. - \"Qui est donc le Créateur du ciel?\", reprit le bédouin. - \"Dieu\". - \"Qui est le Créateur de la terre?\". - \"Dieu\". - \"Qui a dressé ces montagnes et y a mis les choses utiles?\". - \"Dieu\". - \"Alors! Par le Créateur du ciel et de la terre, qui a dressé ces montagnes, est-ce Dieu qui t'a envoyé?\". - \"Oui\". - \"Ton messager a prétendu aussi que nous devions accomplir cinq prières tout au long du jour et de la nuit\". - \"Il a dit vrai\". - \"Par Celui qui t'a envoyé! Est-ce Dieu qui te les a prescrits?\". \"Oui\" -\"Ton messager a prétendu aussi que nous devions verser une aumône légale (Az-Zakâ) prélevée sur nos biens (pour les purifier)\". - \"Il a dit vrai\". - \"Par Celui qui t'a envoyé! Est-ce Dieu qui te l'a prescrite?\". - \"Oui\". - \"Ton messager a prétendu aussi que nous devions jeûner annuellement pendant le mois du ramadan?\". - \"Il a dit vrai\". - \"Par Celui qui t'a envoyé! Est-ce Dieu qui te l'a prescrit?\". - \"Oui\". - \"Ton messager a encore prétendu que chacun de nous devrait accomplir le Hajj s'il en possédait les moyens\". - \"Il a dit vrai\". - \"Eh bien!, conclut l'homme, par Celui qui t'a envoyé avec la Vérité, je me conformerai à ces prescriptions sans n'y rien ajouter ni omettre\". - \"Si cet homme est sincère, dit enfin le Prophète (paix et bénédiction de Dieu sur lui), il entrera sûrement au Paradis\". Celui qui observe ce dont on lui a ordonné, entrera au Paradis",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": "12.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": "13.01",
			"text": "D'après Abou Ayyoûb Al-Ansâri (que Dieu l'agrée), un bédouin se présenta au Prophète (paix et bénédiction de Dieu sur lui) pendant l'un de ses voyages, saisit le licol de sa chamelle, puis dit : \"Ô Envoyé de Dieu (ou \"ô Muhammad\") Indiquez-moi ce qui me frayera les voies au Paradis et m'écartera de l'Enfer\". Le Prophète (paix et bénédiction de Dieu sur lui) s'arrêta, se tourna vers ses compagnons et dit : \"C'est bien un but qu'il recherche. Répétez ce que vous venez de dire!\". A la question répétée, le Prophète (paix et bénédiction de Dieu sur lui) répondit : \"Adorez Dieu, sans rien Lui associer; observez la prière; versez l'aumône légale (Az-Zakâ) et soignez tes liens de sang... Lâchez la chamelle",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": "13.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": "14.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": "14.02",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), un bédouin vint trouver le Prophète (paix et bénédiction de Dieu sur lui) et lui dit : \"Ô Envoyé de Dieu! Indique-moi une œuvre qui me frayera la voie au Paradis\". - \"Tu n'as qu'à adorer Dieu, répondit le Prophète; sans rien Lui associer, à observer la prière prescrite; à payer l'aumône légale (Az-Zakâ) et à jeûner pendant le ramadan\". - \"Par Celui qui tient ma vie entre Ses mains! Je ne ferai rien de plus ni de moins\", répliqua le bédouin. Aussitôt l'homme partit, le Prophète dit : \"Que celui qui se réjouit de voir l'un des hôtes du Paradis, regarde cet homme\". Piliers et assises de l'Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": "15.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": "15.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": "15.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": "16.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": "16.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": "16.03",
			"text": "Selon Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (le Très-Haut) a dit : \"L'Islam est bâti sur cinq piliers : l'unicité de Dieu; la pratique de la prière (As-Salâ); l'acquittement de l'aumône légale (Az-Zakâ); le jeûne du ramadan (As-Siyâm) et l'accomplissement du Hajj\". Ordre de croire en Dieu le Très-Haut, en Son Envoyé, et en la loi de la religion, d'inciter à embrasser cette religion, de s'enquérir à son sujet, de l'observer, et de la communiquer à celui qui n'en a pas pris connaissance",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": "16.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": "17.01",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما) : Une députation des 'Abd Al-Qays vint trouver le Prophète (paix et bénédiction de Dieu sur lui). Les députés dirent : \"Ô Messager de Dieu! Nous sommes les gens de Rabî'a. Il nous est impossible de venir vers toi excepté durant les Mois Sacrés à cause de cette tribu mécréante de Mudar. qui s'interposait entre vous et nous. Signalez-nous donc quelques prescriptions pour que nous les suivrons et les prêcherons chez nous (à notre retour)\". Le Prophète répondit : \"Je vous prescrivis quatre choses et vous interdis quatre autres. Je vous enjoignis de croire en Dieu, -il explicita ceci en disant- Cela consiste à déclarer qu'il n'y a d'autre divinité que Dieu et que Muhammad est l'Envoyé de Dieu\". Il leur ordonna ensuite de pratiquer la prière, de s'acquitter de l'aumône légale (Az-Zakâ) et de payer le cinquième du butin. Il leur interdit l'usage de la calebasse, du hantam (récipient fait de la boue, du poil et du sang), de l'auge (naqîr, tronc de palmier creusé en tonneau) et de muqayyar (récipient enduit de résine). (N.B : Ces ustensiles étaient destinés à y fermenter les boissons enivrantes). Ordre d'attester qu'il n'y a d'autre divinité que Dieu et que Muhammad est l'Envoyé de Dieu",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": "17.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": "17.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": "18.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": "18.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": "18.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": "19.01",
			"text": "D'après Mou'âdh Ibn Jabal (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) me chargea d'une mission au Yémen. (Avant de partir), il me dit : \"Tu iras chez des gens du Livre. Quand tu seras parmi eux, invite-les à attester qu'il n'y a d'autre divinité que Dieu, et que Muhammad est l'Envoyé de Dieu. S'ils se conforment à cette invitation, informe-les que Dieu leur prescrit cinq prières à accomplir le jour et la nuit. S'ils y consentent, informe-les que Dieu leur prescrit une aumône qui sera perçue sur les riches parmi eux pour être dépensée aux pauvres parmi eux. S'ils se soumettent à tout cela, garde-toi de toucher à leurs biens précieux et redoute la plainte de l'opprimé, car rien ne s'interpose entre Dieu et elle\". Ordre de combattre les gens jusqu'à ce qu'ils témoignent qu'il n'y a d'autre divinité que Dieu et que Muhammad est l'Envoyé de Dieu d'accomplir les prières, de verser l'aumône légale, de croire à l'ensemble de la mission prophétique. Celui qui se plie à ces règles mettra à l'abri son âme et ses biens. Ce que cachera son cœur sera une affaire à régler devant Dieu, l'Exalté. Ordre de combattre ceux qui négligent l'aumône légale ou autre droit islamique. L'imam se préoccupe des rites de l'Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": "19.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": "19.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": "20",
			"text": "Abou Hourayra (que Dieu l'agrée) a dit : A la mort de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), quand Abou Bakr fut investi du califat et qu'un certain nombre d'Arabes renièrent leur foi, dit à Abou Bakr : \"Comment vas-tu les combattre alors que l'Envoyé de Dieu (le Très-Haut) a dit : J'ai reçu l'ordre de combattre les idolâtres jusqu'à ce qu'ils confessent qu'il n'y a d'autre divinité que Dieu. Celui qui témoigne de l'unicité de Dieu, rends sa vie et ses biens inviolables, sauf au cas où il serait jugé coupable et c'est à Dieu qu'il appartiendra de régler son compte\". Abou Bakr répondit : \"Par Dieu! Je combattrai quiconque fait de distinction entre la prière et l'aumône légale (Az-Zakâ); car celle-ci est le dû des biens (c.-à-d. le droit de Dieu sur nos biens comme la prière et le jeûne sont le droit de Dieu sur notre corps). Par Dieu! S'ils me refusent un licou qu'ils livraient en impôt à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), je les combattrai pour ce refus",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": "21.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": "21.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": "21.03",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"J'ai reçu l'ordre de combattre les idolâtres jusqu'à ce qu'ils confessent qu'il n'y a d'autre divinité que Dieu. Celui qui le confesse n'a rien à craindre de moi : sa vie et ses biens resteront inviolables, sauf au cas où il serait accusé par la loi, et c'est Dieu qui se chargera de régler son compte",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": "22",
			"text": "D'après Abdoullâh Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"J'ai reçu l'ordre de combattre les idolâtres sans relâche jusqu'à ce qu'ils professent qu'il n'y a d'autre divinité que Dieu et que Muhammad est l'Envoyé de Dieu; qu'ils accomplissent la prière et qu'ils payent l'aumône légale (Az-Zakâ). S'ils le font, leurs vies et leurs biens me seront inviolables, sauf au cas où ils seraient condamnés par la loi et c'est Dieu qui se chargera de régler leurs comptes\". Validité de l'Islam du moribond s'il n'est pas encore à l'article de la mort. Abrogation de la permission de demander pardon en faveur des polythéistes et preuve que celui qui meurt polythéiste sera un damné et ne pourra jamais être racheté",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": "23.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": "23.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": "24.01",
			"text": "Al-Musayyab Ibn Hazn (que Dieu l'agrée) a dit : Au moment où Abou Tâlib était à l'article de la mort, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) vint le voir et trouva chez lui Abou Jahl et 'Abdallâh Ibn 'Abî 'Umayya Ibn Al-Mughîra. L'Envoyé de Dieu s'adressa à Abou Tâlib en disant : \"Ô mon oncle, Atteste qu'il n'y a d'autre divinité que Dieu. C'est là un mot dont je serai témoin en ta faveur auprès de Dieu\". Aussitôt Abou Jahl et 'Abdallâh Ibn 'Abî 'Umayya s'écrièrent : \"Ô Abou Tâlib Vas-tu renier la foi de 'Abd Al-Muttalib?\" L'Envoyé de Dieu ne cessa de lui proposer de prononcer la profession de foi en répétant les mêmes mots, (tandis que les deux autres lui répétaient les mêmes propos). Mais, les dernières paroles de Abou Tâlib furent qu'il persistait dans la foi de 'Abd Al-Muttalib en refusant d'attester qu'il n'y a d'autre divinité que Dieu. - \"Par Dieu!, s'écria l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), je demanderai à Dieu de te pardonner, tant que cela ne me soit pas défendu\". Ce fut à cette occasion que Dieu, le Très-Haut, révéla ce verset : Il n'appartient pas au Prophète et aux Croyants d'implorer le pardon en faveur des polythéistes, fussent-ils des parents alors qu'il leur est apparu clairement que ce sont les gens de l'Enfer. Ensuite, Dieu, le Très-Haut, révéla au sujet de Abou Tâlib, en s'adressant à l'Envoyé de Dieu ce verset : Tu (Muhammad) ne diriges pas celui que tu aimes : mais c'est Dieu qui guide qui Il veut. Il connaît mieux cependant les bien-guidés. Celui qui témoigne de l'unicité de Dieu et meurt sur cet état, entrera assurément au Paradis",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": "24.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": "25.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": "25.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": "26.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": "26.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": "27.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": "27.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": "28.01",
			"text": "D'après 'Oubâda Ibn Sâmit (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Quiconque témoigne qu'il n'y d'autre divinité que Dieu, l'Unique qui n'a point d'associés; que Muhammad est son Adorateur et son Envoyé; que Jésus ('Isa) est l'adorateur de Dieu, fils de Son adoratrice, Sa parole qu'Il envoya à Marie et Son esprit; et que le Paradis est vrai et que l'Enfer est vrai, Dieu le fera accéder, à volonté, au Paradis par n'importe laquelle de ces huit portes",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": "28.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": "29",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": "30.01",
			"text": "Mou'âdh Ibn Jabal (que Dieu l'agrée) a dit : Un jour que j'étais en croupe derrière le Prophète (paix et bénédiction de Dieu sur lui), séparé de lui seulement par l'extrémité du bât, il me dit : \"Hé! Mou'âdh!\". - \"Ô Envoyé de Dieu! A votre service! A vos ordres!\". Après que nous avançâmes un instant, il m'appellera de nouveau : \"Hé! Mou'âdh!\". - \"Ô Envoyé de Dieu! A votre service! A vos ordres!\". Nous marchâmes encore un instant et le voilà qu'il me répéta à nouveau : \"Hé! Mou'âdh!\". - \"Ô Envoyé de Dieu! A votre service! A vos ordres!!\" - \"Connais-tu, reprit-il, les droits de Dieu sur Ses adorateurs?\". - \"Dieu et Son envoyé le savent mieux que personne\", dis-je. - \"Les droits de Dieu sur les adorateurs, dit-il, c'est qu'ils L'adorent sans Lui rien associer\". Nous poursuivâmes la marche encore un instant, puis il me dit : \"Hé! Mou'âdh!\" - \"Ô Envoyé de Dieu! A votre service! A vos ordres!\". - \"Connais-tu ce que Dieu devra aux hommes s'ils agissent de la sorte?\". - \"Dieu et Son envoyé le savent mieux que personne\", répondis-je. Et lui d'ajouter : \"C'est de ne les châtier pas",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": "30.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": "30.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 146,
			"arabicnumber": "30.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": "31",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": "32",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": "33.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": "33.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": "34",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": "35.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": "35.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": "36.01",
			"text": "D'après Ibn 'Omar (رضي الله عنهما), le Prophète (paix et bénédiction de Dieu sur lui), ayant un jour entendu un homme en train de prêcher la pudeur à son coreligionnaire, il dit : \"La pudeur fait partie de la foi",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": "36.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": "37.02",
			"text": "Selon 'Imrân Ibn Husayn (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"La pudeur n'emporte que le bien\". Les meilleurs des actes en Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": "37.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": "37.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": "38",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": "39",
			"text": "Selon 'Abdoullâh Ibn 'Amr (que Dieu l'agrée), un homme ayant demandé au Prophète (paix et bénédiction de Dieu sur lui) quel était le meilleur Islam, celui-ci répondit : \"Donne à manger et salue ceux que tu connais et ceux que tu ne connais pas",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": "40",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": "41",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": "42.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": "42.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": "43.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": "43.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 167,
			"arabicnumber": "43.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": "44.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": "44.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": "45.01",
			"text": "Selon Anas Ibn Mâlik (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Aucun de vous n'aura vraiment la foi que s'il ne désire pour son coreligionnaire (ou pour son voisin) ce qu'il désire pour lui-même\". Incitation à honorer le voisin et l'hôte, et à contenir sa langue à moins qu'il ne soit pour le bien. Ceci fait partie de la foi",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": "45.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": "46",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": "47.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": "47.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": "47.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": "48",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": "49.01",
			"text": "D'après Abou Sa'îd Al-Khoudri (que Dieu l'agrée) : Târiq Ibn Chihâb transmet que Marwân fut le premier à faire devancer la prière au jour de la fête par le prône. Un homme intervint à l'instant et lui dit : \"La prière doit se faire avant le prône (selon la pratique du Prophète)!\". - \"Ceci n'est plus\", répondit Marwân. Abou Sa'îd dit alors : Cet homme a ainsi rempli son devoir. J'ai entendu le Prophète (paix et bénédiction de Dieu sur lui) dire : \"Celui d'entre vous qui assiste à quelque action blâmable, qu'il intervienne pour la changer de sa main; sinon, de sa langue; sinon, de son cœur, et c'est là la plus faible manifestation de la foi\". Superposition des degrés des Croyants. Les gens du Yémen sont les plus voués à la foi",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": "49.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": "50.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": "50.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": "51",
			"text": "Abou Mas'ûd 'Uqba Ibn 'Amr (que Dieu l'agrée) a dit : Le Prophète (paix et bénédiction de Dieu sur lui), montrant de la main la direction du Yémen, dit : \"La foi réside là-bas! Mais la dureté et la grossièreté des cœurs se trouvent chez ceux qui braillent en conduisant leurs chameaux, et qui habitent là où se lèvent les deux cornes du diable, chez les tribus de Rabî'a et de Mudar",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": "52.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": "52.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": "52.03",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Vous avez reçu la visite des gens du Yémen qui ont les cœurs les plus tendres. La foi, la jurisprudence et la sagesse sont toutes yéménites\". La religion comporte le bon conseil",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": "52.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": "52.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": "52.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": "52.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": "52.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": "52.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": "52.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": "52.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": "53",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": "54.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": "54.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": "55.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": "55.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": "55.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": "56.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": "56.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": "56.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": "57.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": "57.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": "57.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": "57.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": "57.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": "57.06",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Le fornicateur ne reste pas Croyant au moment où il fornique, le voleur ne reste pas Croyant au moment où il vole, le buveur ne reste pas Croyant au moment où il consomme l'alcool\". Signes distinctifs de l'hypocrite",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": "57.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": "58",
			"text": "Selon 'Abdoullâh Ibn 'Amr (رضي الله عنهما) rapporte que le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Il est quatre défauts qui lorsqu'ils entachent quelqu'un, le rendent un parfait hypocrite. Celui qui en possède un, est atteint d'une des caractéristiques de l'hypocrisie, à moins qu'il ne s'en débarrasse, à savoir : Tenir des propos mensongers; trahir ses serments; manquer à ses promesses et être de mauvaise foi au cours des disputes",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": "59.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": "59.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": "59.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": "59.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": "60.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": "60.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": "61",
			"text": "Abou Dharr (que Dieu l'agrée) a entendu le Prophète (paix et bénédiction de Dieu sur lui) dire : \"Tout homme qui prétend sciemment être issu d'un autre père que le sien sera (considéré comme un) mécréant. Quant à celui qui prétend la possession de ce qui ne lui appartient pas, il n'est point des nôtres et qu'il aille chercher sa place en Enfer. Celui qui accuse faussement un homme d'incrédulité ou le qualifie d'être l'ennemi de Dieu, ceci ne manque de tourner contre lui",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": "62",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Ne désavouez pas vos pères (par mépris pour votre lignage). Celui qui le fait sera (considéré comme un) mécréant",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": "63.01",
			"text": "Sa'd Ibn Abi Waqqâs (que Dieu l'agrée) a entendu le Prophète (paix et bénédiction de Dieu sur lui) dire : \"Le Paradis sera interdit à tout musulman qui prétend sciemment être issu d'un autre père que le sien\". A propos des paroles du Prophète : \"Injurier un musulman c'est faire acte d'impiété; le combattre, c'est faire acte de perversité",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": "63.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": "64.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 222,
			"arabicnumber": "64.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 223,
			"arabicnumber": "65",
			"text": "Jarîr (que Dieu l'agrée) a dit : Au cours du Hajj d'adieu, le Prophète (paix et bénédiction de Dieu sur lui) m'ordonna de demander aux gens de lui prêter une oreille attentive, puis il s'adressa à eux en disant : \"Gardez-vous, après ma mort, de renier votre foi et de vous entre-tuer\". Incrédulité de celui qui dit : \"Nous avons reçu de la pluie grâce à telle étoile",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 224,
			"arabicnumber": "66.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 225,
			"arabicnumber": "66.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 226,
			"arabicnumber": "66.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 227,
			"arabicnumber": "67",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 228,
			"arabicnumber": "68",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 229,
			"arabicnumber": "69",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 230,
			"arabicnumber": "70",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 231,
			"arabicnumber": "71",
			"text": "Zayd Ibn Khâlid Al-Juhanî (que Dieu l'agrée) a dit : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) nous guida pendant la prière de subh (du matin) à Al-Hudaybiya, à la suite d'une pluie qui était tombée pendant la nuit. Quand le Prophète eut terminé la prière, il se tourna vers les fidèles et dit : \"Savez-vous ce qu'a dit votre Seigneur?\". - \"Dieu et son Envoyé en sont les plus informés\", répondirent-ils. - Ce matin, Dieu a dit, répliqua le Prophète, il y a parmi Mes adorateurs qui ont cru en Moi et d'autres qui n'y ont pas cru. Ceux qui ont dit : \"Nous avons reçu la pluie par la grâce de Dieu et Sa bénédiction\" ont cru en Moi et n'ont pas cru aux étoiles. Mais ceux qui ont dit que c'était grâce à telle ou telle étoile (auxquelles les Arabes attribuaient la chute des pluies avant l'Islam), n'avaient pas cru en Moi et avaient cru aux étoiles. Le fait d'aimer les 'Ansâr (Auxiliaires du Prophète) est un signe de la foi, et les haïr est une marque de l'hypocrisie",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 232,
			"arabicnumber": "72.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 233,
			"arabicnumber": "72.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 234,
			"arabicnumber": "73",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 235,
			"arabicnumber": "74.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 236,
			"arabicnumber": "74.02",
			"text": "Selon Anas (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Haïr les 'Ansâr, c'est le signe de l'hypocrisie; aimer les 'Ansâr, c'est le signe de la foi",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 237,
			"arabicnumber": "75",
			"text": "Al-Barâ (que Dieu l'agrée) a dit : Le Prophète (paix et bénédiction de Dieu sur lui) a dit à propos des 'Ansâr : \"Seul le Croyant les aime et seul l'hypocrite les hait. Dieu aime ceux qui les aiment; et hait ceux qui les haïssent \". La diminution des actes d'obéissance diminue la foi. Emploi des expressions : \"incroyance aux bienfaits (ingratitude)\" et \"incroyance aux droits (manque de reconnaissance)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 238,
			"arabicnumber": "76",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 239,
			"arabicnumber": "77",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 240,
			"arabicnumber": "78",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 241,
			"arabicnumber": "79.01",
			"text": "D'après Abdoullâh Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Ô femmes! Faites l'aumône et sollicitez plus fréquemment le pardon de Dieu, car je vous ai vu former la majorité des réprouvés de l'Enfer\". Une femme -parmi elles ayant l'esprit judicieux- s'exclama : \"Et pourquoi cela, ô Envoyé de Dieu?\". - \"C'est, répondit-il, que vous multipliez vos malédictions et vous êtes ingrates envers vos époux. Je n'ai vu parmi les êtres faibles en intelligence et en religion personne qui, mieux que l'une de vous, fasse perdre l'esprit à un homme sensé\". - \"En quoi, reprit-elle, ô Envoyé de Dieu, consiste le défaut de notre intelligence et de notre religion?\". - \"Le témoignage de deux femmes équivaut à celui d'un homme... Voilà pour le défaut de l'intelligence, répliqua le Prophète, et quand elles ont leurs menstrues, les femmes ne cessent-elles pas de prier et de jeûner des nuits durant?... Eh bien! Voilà pour celui de la religion\". La croyance en Dieu le Très-Haut est le meilleur acte",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 242,
			"arabicnumber": "79.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 243,
			"arabicnumber": "80.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 244,
			"arabicnumber": "81.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 245,
			"arabicnumber": "81.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 246,
			"arabicnumber": "82.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 247,
			"arabicnumber": "82.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": "83",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": "84.01",
			"text": "Abou Dharr (que Dieu l'agrée) a dit : Je demandai au Prophète (paix et bénédiction de Dieu sur lui) quelles étaient les œuvres les plus méritoires. \"La foi en Dieu, répondit-il, et le djihad\". - \"Et lequel des esclaves est celui dont l'affranchissement est le plus méritoire?\", lui demandai-je. - \"Celui qui a coûté le plus cher, répondit-il, et auquel son maître tient le plus\". - \"Et si j'en suis incapable?\", repris-je. - \"Alors, répliqua-t-il, aide quelqu'un à accomplir son travail ou travaille pour le compte d'un autre qui ne sait rien faire\". - \"Et si j'en suis incapable?\". - \"Alors tu t'abstiendras de nuire aux gens et ce sera une sorte d'aumône dont tu bénéficieras",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": "84.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": "85.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": "85.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 254,
			"arabicnumber": "85.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 255,
			"arabicnumber": "85.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 256,
			"arabicnumber": "85.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 257,
			"arabicnumber": "86.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 258,
			"arabicnumber": "86.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 259,
			"arabicnumber": "87",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 260,
			"arabicnumber": "88.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 261,
			"arabicnumber": "88.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 262,
			"arabicnumber": "89",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Evitez les sept turpitudes!\". - \"Quelles sont-elles, ô Envoyé de Dieu?\", demandèrent les fidèles. - \"Ce sont, répondit-il, le polythéisme, la magie; le meurtre que Dieu a interdit sauf à bon droit; l'usurpation des biens de l'orphelin; l'usure; la fuite du front au jour du djihad et la fausse accusation (de fornication) des femmes vertueuses, chastes et Croyantes",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 263,
			"arabicnumber": "90.01",
			"text": "D'après 'Abdoullâh Ibn 'Amr Ibn Al-'As (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Parmi les péchés capitaux figure le fait qu'un homme injure ses parents\". - \"Arrive-t-il, ô Envoyé de Dieu, qu'un homme insulte ses parents?\", s'exclama-t-on. - \"Oui, c'est quand on injure le père d'un autre qui à son tour répond en insultant le père de l'injurier et quand on injure la mère de quelqu'un qui se venge en insultant celle de l'injurier\". Celui qui meurt sans ne rien associer à Dieu entrera au Paradis, et celui qui meurt polythéiste ira en Enfer",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 264,
			"arabicnumber": "90.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 265,
			"arabicnumber": "91.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 266,
			"arabicnumber": "91.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 267,
			"arabicnumber": "91.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 268,
			"arabicnumber": "92",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 269,
			"arabicnumber": "93.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 270,
			"arabicnumber": "93.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 271,
			"arabicnumber": "93.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 272,
			"arabicnumber": "94.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 273,
			"arabicnumber": "94.02",
			"text": "D'après Abou Dharr (que Dieu l'agrée) : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Gabriel (que la paix soit sur lui) vint m'annoncer cette bonne nouvelle : \"Quiconque de ta Communauté meurt sans rien associer à Dieu, entrera au Paradis\". - \"Même, m'exclamai-je, s'il avait commis la fornication ou le vol?\". - \"Même s'il avait forniqué ou volé\", m'assura-t-il. Interdiction de tuer un polythéiste après qu'il eut témoigné qu'il n'y a d'autre divinité à part Dieu",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 274,
			"arabicnumber": "95.01",
			"text": "D'après Al-Miqdâd Ibn Al-'Aswad (que Dieu l'agrée) J'ai dit à l'Envoyé de Dieu : \"Figurez-vous que je me suis heurté à un polythéiste qui en m'ayant livré combat, m'amputerait la main avec son sabre, puis se réfugierait derrière un arbre où il prononcerait la profession de foi. Aurais-je droit à le tuer ou non (pour se venger) après qu'il eut prononcé la profession de foi?\". L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) me répondit par le négatif. - \"Mais, ai-je repris, il m'a coupé la main, et ce n'est qu'après cela qu'il a déclaré sa conversion à l'Islam. Pourrais-je donc le tuer?\". - \"Ne le tue pas, répéta l'Envoyé de Dieu, car si tu le tues, il sera dans l'état où tu étais avant de l'exécuter (musulman), et toi tu te trouveras dans celui où il était avant de se convertir (mécréant)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 275,
			"arabicnumber": "95.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 276,
			"arabicnumber": "95.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 277,
			"arabicnumber": "96.01",
			"text": "Ousâma Ibn Zayd (رضي الله عنهما) a dit : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) nous envoya à la tête d'un escadron contre les Al-Huraqât de la tribu de Juhayna. Nous les surprîmes au matin et les mîmes en déroute. J'attrapai un des ennemis qui s'écria aussitôt : \"Il n'y a d'autre divinité que Dieu!\". Quand même, je le tuai; mais je ne puis pour autant rester la conscience en paix. A notre retour (à Médine), je racontai cet événement au Prophète (paix et bénédiction de Dieu sur lui) qui me dit : \"A-t-il dit qu'il n'y avait d'autre divinité que Dieu et tu l'as tué quand même?!\". - \"Il ne l'a dit que pour éviter la mort!\", me justifiai-je. - \"As-tu sondé son cœur pour vérifier s'il est sincère ou non dans cette attestation?\". Le Prophète ne cessa de répéter cette réprimande au point que je souhaitai que je n'aurais embrassé l'Islam que ce jour-ci (pour qu'une telle faute sévère ne lui soit pas inscrite dans son passif de musulman). Sa'd commenta (voyant Ousâma rangé de regrets amers) : \"Moi, par Dieu! Je ne jugerai qu'un homme doit être tué sans que Dhû Al-Bûtayn (il voulait dire Ousâma qui était un gros ventru) ne le trouve tel\". Or, un homme s'exclama : Dieu n'a-t-il pas dit : {Et combattez-les jusqu'à ce qu'il ne subsiste plus d'association, et que la religion soit entièrement à Dieu...!} Et Sa'd d'ajouter : \"Nous avons évidemment combattu pour qu'il ne subsiste pas d'association; cherchez-vous, toi et tes compagnons à combattre pour qu'il y ait association?\" A propos des paroles du Prophète : \"Il n'est pas des nôtres celui qui porte les armes contre nous",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 278,
			"arabicnumber": "96.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 279,
			"arabicnumber": "97",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 280,
			"arabicnumber": "98",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 281,
			"arabicnumber": "99",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 282,
			"arabicnumber": "100",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 283,
			"arabicnumber": "101",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 284,
			"arabicnumber": "102",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 285,
			"arabicnumber": "103.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 286,
			"arabicnumber": "103.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 287,
			"arabicnumber": "104.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": "104.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": "104.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": "105.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": "105.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": "105.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": "106.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 294,
			"arabicnumber": "106.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": "106.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": "107",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": "108.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée) l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Il est trois personnes à qui Dieu n'adressera pas la parole au Jour de la Résurrection, ni les regardera, ni les purifiera et auxquelles Il a réservé un châtiment douloureux. L'homme, se trouvant dans le désert et ayant de l'eau en surplus, la refuse à un voyageur en détresse. Un second vendant sa marchandise à un autre à qui il jure par Dieu -après l'heure du 'asr- qu'il l'avait achetée à tel ou tel prix (en vue d'un surcroît de profit), prenant ainsi l'acheteur pour dupe. Et un troisième qui, prêtant serment de fidélité à un souverain, ne le fait qu'en vue d'un profit temporel, et qui, reste fidèle tant qu'on le lui donne, sinon, il ne tient aucunement à ses engagements\". Interdiction de se suicider, celui qui se donne la mort au moyen de quelque chose, en sera torturé en Enfer. N'entrera au Paradis qu'une âme Soumise (musulmane)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": "108.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 299,
			"arabicnumber": "108.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 300,
			"arabicnumber": "109.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Quiconque se suicida d'un tranchant, s'en percera incessamment le ventre dans le feu de la Géhenne où il demeurera éternellement. Quiconque s'empoisonna, absorbera incessamment ce poison dans le feu de la Géhenne où il demeurera éternellement. Quiconque se donna la mort en se précipitant du haut d'une montagne, se précipitera incessamment dans le feu de la Géhenne où il demeurera éternellement",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": "109.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": "110.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": "110.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": "110.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": "111",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": "112",
			"text": "D'après Sahl Ibn Sa'd As-Sâ'idî (que Dieu l'agrée), A l'issue d'un combat mené contre les polythéistes, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) se dirigea vers son campement, et les ennemis firent de même. Il y eut sous la bannière de l'Envoyé de Dieu un homme qui ne cessa de poursuivre n'importe quel membre isolé de la troupe ennemie en vue de l'exécuter de son sabre. On dit alors : \"Certes, untel nous a surpassés aujourd'hui en mérite (à cause de sa bravoure)\". - \"Pourtant, cet homme ira en Enfer\", dit le Prophète (paix et bénédiction de Dieu sur lui). - \"Moi, s'écria un des fidèles, je vais suivre de près cet homme\". Et à vrai dire, il put emboîter le pas à cet homme, jusqu'au moment où celui-ci, étant grièvement blessé; se hâta de mettre un terme à sa souffrance et enfonça son sabre dans le sol de telle sorte que sa pointe soit dirigée au sein de sa poitrine, et s'enferra lui-même. Et ainsi trouva-t-il la mort. L'autre homme retourna à l'Envoyé de Dieu et lui dit : \"Je témoigne que tu es l'Envoyé de Dieu\". - \"Pourquoi tu le dis en ce moment?\", demanda le Prophète. - \"L'homme dont tu as dit tout à l'heure qu'il sera parmi les damnés de l'Enfer, répondit l'homme; ce qui a suscité l'étonnement des fidèles, et alors je me suis décider de le suivre (pour percer son secret). Je l'ai poursuivi donc jusqu'à ce qu'il avait reçu une grave blessure. Et alors voulant devancer son trépas, il enfonça son sabre dans le sol de telle sorte que sa pointe soit dirigé vers le sein de sa poitrine et il rendit ainsi le dernier soupir. A ce moment, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) commenta en disant : \"Il se peut qu'un homme suit apparemment la conduite des gens du Paradis, mais en vérité il sera parmi les damnés de l'Enfer; et qu'un autre suit apparemment la conduite des gens de l'Enfer, alors qu'il sera parmi les bienheureux du Paradis",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": "113.01",
			"text": "D'après Jundab (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Il y avait, parmi ceux qui vous ont précédés, un homme qui eut une tumeur inflammatoire. Ne pouvant supporter la douleur, il tira une flèche de son carquois et perça sa tumeur. L'effusion de sang ne cessa pas alors et il en meurt. Dieu dit à son sujet : \"Je l'ai privé du Paradis\". Interdiction de voler du butin. N'entreront au Paradis que les Croyants",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": "113.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": "114",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": "115",
			"text": "Abou Hourayra (que Dieu l'agrée) a dit : Nous sortîmes avec le Prophète (paix et bénédiction de Dieu sur lui) pour la conquête de Khaybar et Dieu nous accorda la victoire. Pourtant, nous n'eûmes pour butin ni or ni argent, mais surtout des objets, des aliments et des vêtements. Nous prîmes ensuite avec l'Envoyé de Dieu la direction de Wâdî Al-Qurâ. Celui-ci (paix et bénédiction de Dieu sur lui) était accompagné d'un esclave que lui avait donné Rifâ'a Ibn Zayd, originaire des Judhâm de la tribu des Banû Ad-Dubayb. A Wâdî Al-Qurâ, cet esclave fut atteint d'une flèche pendant qu'il ôtait la selle de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). Les fidèles s'écrièrent alors : \"Heureux homme! Il est martyr, ô Envoyé de Dieu!\" - \"Pas du tout, répondit le Prophète (paix et bénédiction de Dieu sur lui). J'en jure par Celui qui tient l'âme de Muhammad en Son pouvoir, certes la pèlerine qu'il a dérobée du butin au jour de Khaybar -avant le partage- lui consumera le corps!\". A ces paroles, les fidèles furent choqués. Un homme vint alors trouver le Prophète, tenant à la main un ou deux courroies de sandales. \"Ô Envoyé de Dieu! Voilà, dit cet homme, ce que j'ai dérobé au jour de la prise de Khaybar\". - \"C'est une courroie de feu (ou ce sont deux courroies de feu)\", dit le Prophète. Crainte qu'éprouve le Croyant de perdre les fruits de ses œuvres",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": "116",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": "117",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": "118",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": "119.01",
			"text": "Anas Ibn Mâlik (que Dieu l'agrée) a dit : Après la révélation de ce verset : Ô vous qui avez cru! N'élevez pas vos voix au-dessus de la voix du Prophète,... Thâbit Ibn Qays se retira dans sa maison et dit : \"Ah! Je serai au nombre des damnés!\" Il s'est abstenu d'aller voir le Prophète (paix et bénédiction de Dieu sur lui). Se rendant compte de son absence, l'Envoyé de Dieu demanda de ses nouvelles à Sa'd Ibn Mu'âdh, en disant : \"Ô Abou 'Amr! Est-ce que Thâbit est malade?\". - \"Il est mon voisin, répliqua Sa'd, et je n'ai pas entendu qu'il souffre\". Sa'd se rendit aussitôt à son voisin et l'informa de ce que l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) avait dit. Thâbit s'exprima ainsi : \"Ne voyez-vous pas que je suis visé par ce verset car c'est ma voix qui s'élève le plus souvent au-dessus de celle du Prophète (paix et bénédiction de Dieu sur lui)? Je serai donc l'un des damnés!\". Sa'd revint auprès du Prophète (paix et bénédiction de Dieu sur lui) et lui fit part de ce que Thâbit avait dit. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dit : \"Non, il sera au nombre des bienheureux du Paradis\". Le Croyant sera-t-il châtié pour ce qu'il avait commis à l'époque préislamique",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": "119.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": "119.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": "119.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": "120.01",
			"text": "D'après 'Abdoullâh Ibn Mas'oûd (que Dieu l'agrée), Quelques personnes s'adressèrent à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) en disant : \"Ô Envoyé de Dieu! Serons-nous punis pour ce que nous avons fait au temps de l'idolâtrie?\" - \"Celui, répondit-il, qui fait le bien après sa conversion à l'Islam, n'en sera pas puni. Mais celui qui pèche (après sa conversion à l'Islam), ses fautes commises avant et après l'Islam seront toutes punies\". L'Islam, l'émigration et le Hajj annulent les péchés qui les ont précédés",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": "120.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": "120.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": "121",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": "122",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما), Des polythéistes qui avaient commis nombre de meurtres et nombre d'adultères, vinrent trouver Muhammad (paix et bénédiction de Dieu sur lui) et lui dirent : \"Ce que vous nous dites et ce à quoi vous nous invitez est bien; mais veuillez nous indiquer comment racheter nos fautes\". C'est alors que fut révélé ce verset : Qui n'invoquent pas d'autre dieu avec Dieu et ne tuent pas la vie que Dieu a rendue sacrée, sauf à bon droit; et qui ne commettent pas de fornication - car quiconque fait cela encourra une punition et ce verset : Ô Mes serviteurs qui avez commis des excès à votre propre détriment ne désespérez pas de la miséricorde de Dieu... Jugement porté sur les œuvres du polythéiste avant qu'il ne se convertisse à l'Islam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": "123.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": "123.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": "123.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 326,
			"arabicnumber": "123.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": "124.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": "124.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 329,
			"arabicnumber": "125",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": "126",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": "127.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": "127.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": "127.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 334,
			"arabicnumber": "128.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 335,
			"arabicnumber": "128.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 336,
			"arabicnumber": "129",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 337,
			"arabicnumber": "130",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 338,
			"arabicnumber": "131.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 339,
			"arabicnumber": "131.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 340,
			"arabicnumber": "132.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 341,
			"arabicnumber": "132.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 342,
			"arabicnumber": "133",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 343,
			"arabicnumber": "134.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 344,
			"arabicnumber": "134.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 345,
			"arabicnumber": "134.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 346,
			"arabicnumber": "134.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 347,
			"arabicnumber": "135.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 348,
			"arabicnumber": "135.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 349,
			"arabicnumber": "135.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": "135.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": "136.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": "136.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": "137.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": "137.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": "138.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": "138.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": "138.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": "139.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": "139.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": "140",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": "141.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": "141.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": "142.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": "142.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": "142.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": "142.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": "143.01",
			"text": "Houdhayfa (que Dieu l'agrée) a dit : l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) nous fit deux récits que j'ai vu l'un et j'attends l'autre. Il nous dit : \"L'Honnêteté (de faire le bien et d'éviter le mal) fut déposée dans le fin fond des cœurs des hommes; puis, ils connurent son existence grâce au Coran et à la Sunna\". Ensuite, il nous expliqua comment cette Honnêteté disparaîtra-t-elle, en ces termes : \"On enlèvera l'Honnêteté du cœur de l'homme, pendant qu'il dort de sorte qu'il n'en restera que la trace d'une petite tache. Puis, pendant qu'il est encore endormi, on lui enlèvera son reste dont il ne restera qu'une trace pareille à une ampoule -comparable à la vésicule que produit le charbon ardent quand il roule sur la jambe qui se couvre alors de pustules que tu vois renflés d'air\". Il prit alors un caillou et le fit rouler sur sa jambe, puis reprit : Au lendemain, les gens se réveilleront et se livreront à leurs affaires (commerciales) et presque personne n'y appliquera l'Honnêteté; au point d'arriver à dire : \"Il y a chez les Banû untel un homme digne de confiance!\"; et à juger d'un homme, en disant : \"Qu'il est endurant! Qu'il est aimable! Qu'il est raisonnable!\"; et cependant cet homme n'aura pas dans le cœur le poids d'un grain de moutarde de foi. Il m'est venu un temps où je ne me souciais de savoir avec qui je contracte des actes de commerce : s'il est musulman, il sera retenu par l'Islam; s'il est chrétien ou juif, il sera retenu par son chef. Mais, aujourd'hui je ne fais plus de contrats qu'avec untel et untel parmi vous\". L'Islam, né \"étranger\", redeviendra \"étranger\" et se concentrera dans Médine",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": "143.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": "144.01",
			"text": "Houdhayfa (que Dieu l'agrée) a dit : Un jour que nous étions chez 'Omar (que Dieu l'agrée), il nous demanda : \"Lequel parmi vous a entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) parler des épreuves?\". Quelques-uns répondirent : \"Nous l'avons entendu\".- \"Il se peut, répliqua-t-il, que vous voulez dire l'épreuve de l'homme dans sa famille et son voisin\". Ils répliquèrent par l'affirmatif. \"Les péchés issus de ce type d'épreuves peuvent être expiées par la prière, le jeûne et l'aumône. Mais qui d'entre vous a entendu le Prophète (paix et bénédiction de Dieu sur lui) parler des épreuves (nombreuses et répandues) qui s'agitent telles les ondes de la mer?\". Houdhayfa poursuivit : Les hommes gardèrent le silence, tandis que je lui répondis : \"Moi (l'ai entendu)\". - \"Toi?; dit 'Omar, que Dieu garde ton père!\". Houdhayfa dit alors : J'ai entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dire : \"Les épreuves troublantes seront exposées aux cœurs (des Croyants) et les biens marqueront comme les traces que laissent les joncs de la natte sur le flanc du dormeur. Tout cœur qui en sera passionnément épris, sera marqué d'un point noir, et tout cœur qui les repoussera, sera marqué d'un point blanc. De sorte qu'à ces épreuves, deux cœurs feront face : le premier au point blanc sera comparable au rocher (inébranlable et lisse); aucune épreuve ne le nuira donc jamais aussi longtemps que dureront les cieux et la terre, tandis que l'autre au point noir deviendra presque grisâtre et sera comparable à une gargoulette renversée, incapable de distinguer le convenable du blâmable tant que ni l'un ni l'autre ne correspond à ses propres désirs",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": "144.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": "144.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": "145",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": "146",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": "147",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": "148.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": "148.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": "149",
			"text": "D'après Houdhayfa (que Dieu l'agrée), Pendant que nous étions chez le Prophète (paix et bénédiction de Dieu sur lui), il nous dit : \"Dénombrez-moi tous ceux qui professent l'Islam\". Nous répondîmes alors : \"Que regrettes-tu pour nous, alors que nous comptons de six à sept cent fidèles?\". - \"Vous ne savez pas! Il se peut que vous soyez éprouvés\". Houdhayfa ajouta : \"Et à vrai dire, nous avons passé par des épreuves troublantes au point que le fidèle ne faisait la prière qu'en sourdine\". Incitation à gagner les cœurs de foi incertaine et interdiction de juger le degré de la foi de quiconque sans preuve décisive",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": "150.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": "150.02",
			"text": "Sa'd (que Dieu l'agrée) a dit : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) était en train de faire un partage, quand je me suis adressé à lui en disant : \"Ô Envoyé de Dieu! Donne à untel, car il est Croyant\". - \"Il est plutôt musulman!\" répondit le Prophète (paix et bénédiction de Dieu sur lui). A ma demande répétée à trois reprises, le Prophète (paix et bénédiction de Dieu sur lui) donna la même réponse; puis, il ajouta : \"Parfois, je donne à un homme, alors que je préfère donner à un autre, dans la crainte que Dieu ne précipite celui-là dans le feu de l'Enfer\". (N.B : Le Croyant sincère ne convoite rien; mais c'est surtout un néophyte dont la foi n'est pas encore stable, qui mérite l'aide matérielle pour faire graduellement croître sa foi) Les preuves rassurent le cœur",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": "150.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": "150.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": "151.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": "151.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": "152",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": "153",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": "154.01",
			"text": "D'après Abou Moûsa (que Dieu l'agrée) l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Il est trois personnes qui auront une double récompense : un homme des gens du Livre qui -ayant cru en son Prophète et survécu jusqu'à l'avènement de Muhammad - a cru sincèrement en celui-ci et l'a suivi; un esclave qui s'acquitte de ses devoirs envers Dieu et envers son maître, enfin un homme qui, possédant une esclave, la bien nourrit, lui donne une bonne éducation, puis l'affranchit et l'épouse\". Descente de Jésus, fils de Marie, appliquant la religion de notre Prophète Muhammad",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": "155.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Je jure par Celui qui tient mon âme en Son pouvoir, il s'en faut de bien peu que le fils de Marie (que la paix soit sur lui) descende pour vous juger équitablement. Il brisera le crucifix, tuera les porcs, fera disparaître la capitation. Alors, la richesse débordera au point que personne n'en voudra plus recevoir\". Le temps où le repentir ne profitera pas",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": "155.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": "155.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": "155.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": "155.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": "155.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": "156",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": "157.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : L'Heure n'arrivera pas avant que le soleil ne se soit levé du couchant. A ce moment-là, tous les gens auront la foi; mais, {la foi en Lui ne profitera à aucune âme qui n'avait pas cru auparavant ou qui n'avait acquis aucun mérite de sa croyance}",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": "157.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": "158",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": "159.01",
			"text": "D'après Abou Dharr (que Dieu l'agrée), Le Prophète (paix et bénédiction de Dieu sur lui) a dit un jour : \"Savez-vous où va le soleil (au moment du couchant)?\". - \"Dieu et Son Envoyé le savent mieux\", nous répliquâmes. - \"Eh bien!, reprit-il, il poursuit sa course jusqu'à atteindre son gîte sous le Trône divin; puis se prosterna et demeura ainsi jusqu'à ce qu'on lui dise : \"Retourne au lieu d'où tu t'es levé\". Le soleil obéit et, le jour suivant, il se leva de l'Est (comme d'habitude). Et ainsi de suite. Les hommes ne verront rien d'étrange, jusqu'au jour où on lui dira : \"Lève-toi du couchant\". Et lui d'obéir. Savez-vous quand cela arrivera-t-il? C'est lorsque {la foi en Lui ne profitera à aucune âme qui n'avait pas cru auparavant ou qui n'avait acquis aucun mérite de sa croyance...} Début de la Révélation à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": "159.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": "159.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": "159.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": "160.01",
			"text": "Aïcha, l'épouse du Prophète, (raa) a dit : La Révélation se présenta d'abord au Prophète (paix et bénédiction de Dieu sur lui) sous forme de visions pieuses qu'il voyait pendant son sommeil. Toutes lui parurent avec une très vive clarté. Puis, il eut de l'inclination à la retraite. Il se retirait alors dans la caverne de Hirâ', où il se livrait à la pratique d'actes d'adoration durant des nuits consécutives, avant qu'il ne rentre chez lui pour se munir de provisions de bouche. Il revenait ensuite vers Khadîja et prenait les provisions nécessaires pour une nouvelle retraite. Cela dura jusqu'à ce que la Vérité lui fut enfin révélée dans la caverne de Hirâ'. L'archange y vint alors lui dire : \"Lis!\". - \"Je ne suis point de ceux qui lisent\", répondit-il. Le Prophète raconta cet événement en ces termes : L'archange me saisit aussitôt, me pressa contre lui au point de me faire perdre toute force, puis me lâcha enfin en répétant : \"Lis!\". - \"Je ne suis point de ceux qui lisent\", répliquai-je encore. Cette scène se répéta à deux autres reprises. A la troisième fois, l'archange me dit : {Lis, au nom de ton Seigneur qui a créé, qui a créé l'homme d'une adhérence. Lis! Ton Seigneur est le Très Noble, qui a enseigné par la plume (le calame), a enseigné à l'homme ce qu'il ne savait pas}. Après avoir entendu ces versets, le Prophète (paix et bénédiction de Dieu sur lui), tremblant et palpitant, rentra chez son épouse Khadîja et s'écria : \"Enveloppez-moi! Enveloppez-moi!\". On s'empressa de le couvrir jusqu'au moment où son effroi fut dissipé. Alors, s'adressant à Khadîja, il la mit au courant de ce qui s'était passé, puis il ajouta : \"Ah! J'ai cru que j'en allais mourir!\". - \"Au contraire, réjouis-toi!, répondit Khadîja, certes jamais Dieu ne te plongera dans l'ignominie; car tu maintiens tes liens de parenté, tu ne dis que la vérité, tu soutiens les faibles, tu donnes aux indigents, tu héberges les hôtes, et tu viens en aide aux éprouvés\". Ensuite Khadîja emmena Muhammad chez Waraqa Ibn Nawfal Ibn 'Asad Ibn 'Abd Al-'Uzzâ Cet homme, qui était le cousin paternel de Khadîja, avait embrassé le christianisme aux temps antéislamiques. Il savait l'arabe par écrit, et avait traduit vers l'arabe des passages de l'Evangile autant que Dieu avait voulu. A cette époque, il était âgé et était devenu aveugle : \"Ô mon cousin, lui dit Khadîja, écoute ce que va te dire le fils de ton frère\". - \"Ô fils de mon frère!, répondit Waraqa Ibn Nawfal, de quoi s'agit-il?\". Le Prophète (paix et bénédiction de Dieu sur lui) lui raconta alors ce qu'il avait vu. \"C'est l'archange, dit Waraqa Ibn Nawfal, que Dieu a envoyé autrefois à Moïse (Mûsa) (paix et bénédiction de Dieu sur lui). Plût à Dieu que je fusse jeune en ce moment! Ah! Comme je voudrais être encore vivant à l'époque où tes concitoyens te banniront!\". - \"Ils m'exileront donc?\", s'écria le Prophète (paix et bénédiction de Dieu sur lui). - \"Oui, reprit Waraqa Jamais un homme n'a apporté ce que tu apportes sans être persécuté! Si je vis encore en ce jour-là, je t'aiderai de toutes mes forces",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": "160.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": "160.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": "161.01",
			"text": "D'après Jâbir Ibn 'Abdillâh Al-'Ansârî (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), ayant parlé de l'interruption de la Révélation, a dit : \"Tandis que je marchais, j'entendis une voix provenant du ciel. Levant alors les yeux, j'aperçus l'Archange qui était venu me trouver à Hirâ'; il était assis sur un siège entre le ciel et la terre\". Le Prophète (paix et bénédiction de Dieu sur lui) poursuivit : \"Effrayé à sa vue, je rentrai chez moi en criant : \"Enveloppez-moi! Enveloppez-moi!\". Et on me revêtit d'un manteau. C'est à cette occasion que Dieu - A Lui la puissance et la gloire - révéla ces versets : {O, toi (Muhammad)! Le revêtu d'un manteau! Lève-toi et avertis. Et de ton Seigneur, célèbre la grandeur. Et tes vêtements purifie-les. Et de tout péché, écarte-toi}. - par (tout péché), on entend (les idoles). Ensuite, la Révélation se succéda d'affilée. Voyage Nocturne de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et prescription de la Salâ",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": "161.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": "161.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": "161.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": "161.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": "162.01",
			"text": "Selon Anas Ibn Mâlik (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Al-Burâq\" -une monture blanche, plus grande qu'un âne et plus petite qu'une mule, qui se trouvait d'un bond où son regard s'arrêtait- me fut amenée. Je la montai et fus transporté à Jérusalem. Là-bas, je l'attachai à l'anneau destiné à l'usage des Prophètes. Je pénétrai dans la mosquée où je pria deux rak'a. A ma sortie, Gabriel (que la paix soit sur lui) m'offrit deux récipients : l'un contenant du vin, l'autre du lait. Je choisis le lait; et Gabriel me déclara alors que j'avais élu la voie primordiale. Porté par lui, je m'élevai jusqu'aux régions célestes. Gabriel demanda la permission d'y accéder. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je vis aussitôt Adam qui me souhaita la bienvenue et invoqua (Dieu) en ma faveur. Puis, je fus porté au second ciel, Gabriel (que la paix soit sur lui) demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je vis aussitôt les deux cousins maternels : Jésus ('Isa), le fils de Marie et Jean Baptiste, fils de Zacharie (que Dieu leur accorde Ses bénédictions) qui me souhaitèrent la bienvenue et le bien. Puis, je fus porté au troisième ciel, et Gabriel demanda aussi la permission d'y pénétrer. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je trouvai aussitôt Joseph (Yûsuf) (paix et bénédiction de Dieu sur lui) à qui a été assignée la moitié de la beauté humaine. Celui-ci me souhaita la bienvenue et le bien. Je fus ensuite porté au quatrième ciel et Gabriel (que la paix soit sur lui) demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je trouvai Anoch ('Idris) qui me souhaita la bienvenue et le bien. Dieu - à Lui la puissance et la gloire - dit à ce sujet : {Et Nous l'élevâmes à un haut rang}. Je fus alors porté au cinquième ciel et Gabriel demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je trouvai Aaron (Hârûn) (paix et bénédiction de Dieu sur lui) qui me souhaita la bienvenue et le bien. Je fus ensuite porté au sixième ciel et Gabriel (que la paix soit sur lui) demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je trouvai Moïse (Mûsa) (paix et bénédiction de Dieu sur lui) qui me souhaita la bienvenue et le bien. Je fus porté enfin au septième ciel et Gabriel (que la paix soit sur lui) demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit et je trouvai Abraham ('Ibrâhim) (paix et bénédiction de Dieu sur lui), le dos appuyé contre la Maison Peuplée dans laquelle pénètrent journellement un nouveau groupe de soixante-dix mille anges. Puis, il m'emmena vers \"Sidrat al-Muntaha\" (le Lotus de la limite extrême) dont les feuilles ressemblaient aux oreilles d'éléphants et les fruits étaient (grands) comme les cruches. Au moment où -par l'ordre de Dieu- le lotus fut couvert de ce qui le couvrit, il se transforma et aucun des créatures de Dieu ne pourrait décrire sa splendeur. Dieu me révéla, alors, ce qu'Il voulut, et prescrivit l'accomplissement de cinquante prières par jour. Je retournai voir Moïse (Mûsa) qui me demanda : \"Qu'est-ce qu'a prescrit le Seigneur à ta Communauté?\". - \"Une cinquantaine de prières\", lui dis-je. - \"Retourne à ton Seigneur et demande-Lui la réduction de ce nombre, car ta Communauté ne supportera point cette prescription. Je connais bien les israélites; je les avais mis à l'épreuve et je m'étais employé à les ramener sur la bonne voie\". Le Prophète poursuivit : Je retournai à mon Seigneur et je Lui demandai de réduire le nombre des prières pour la faveur de ma Communauté. Il m'exauça en les amoindrissant de cinq prières. J'allai ensuite trouver Moïse (Mûsa) pour l'informer de la réduction des cinq prières. Toutefois, il me répéta : \"Retourne à ton Seigneur et demande-Lui la réduction de ce nombre, car ta Communauté ne le supportera point\". Je ne cessai alors de faire la navette entre mon Seigneur (à Lui la puissance et la gloire) et Moïse (Mûsa) (que la paix soit sur lui) pour demander plus de réduction encore jusqu'à ce que Dieu me décréta : \"Ô Muhammad! Je prescris irrévocablement cinq prières jour et nuit, dont chacune équivaut à dix, cela fait alors cinquante. Quiconque a dessein de faire une bonne action et ne la faite pas, on lui inscrira une récompense à son actif; s'il l'exécute, une récompense équivalente à dix bonnes actions lui sera inscrite. Tandis que quiconque a l'intention de perpétrer une mauvaise action et qu'il ne l'accomplit pas, rien ne sera inscrit à son passif; si au contraire il l'accomplit, on lui inscrira la punition d'une seule mauvaise action\". Je redescendai et arrivai auprès de Moïse (que la paix soit sur lui) pour l'informer de la chose, mais il me dit : \"Retourne à ton Seigneur et demande-Lui une nouvelle réduction\". \"Je suis déjà retourné plusieurs fois à mon Seigneur, jusqu'à ce que j'aie trouvé inconvenant de Lui adresser encore une fois cette demande.\" répondis-je à Mûsa",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": "162.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": "162.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": "162",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": "163",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": "164.01",
			"text": "D'après Mâlik Ibn Sa'sa'a (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : Pendant que je me trouvais auprès de la Maison sacrée (la Ka'ba) dans un état intermédiaire entre le réveil et le sommeil, j'entendis quelqu'un appeler : \"L'homme se trouvant entre les deux autres!\". (il y avait, selon les commentateurs, deux hommes à côté du Prophète). J'y répondis. On m'emmena et m'offrit ensuite un bassin d'or rempli de l'eau de Zamzam. On me fendit la poitrine d'ici jusque là. Un autre transmetteur, Qatâda, s'enquérit : \"Et qu'a-t-il entendu par (d'ici jusque là)?\". - \"Jusqu'au bas-ventre\", répliqua Anas. - On m'extraira le cœur, dit le Prophète, et après l'avoir lavé avec l'eau de Zamzam, on me le remit à sa place en le bourrant de la foi et de la sagesse. Puis, me fut amenée \"Al-Burâq\" -une monture blanche, plus grande qu'un âne et plus petite qu'une mule, qui se trouvait d'un bond où son regard s'arrêtait-; sur laquelle on me fit monter. Puis, je m'en allai avec Gabriel, jusqu'à atteindre le ciel le plus proche où il demanda qu'on nous ouvrît. - \"Qui est-ce?\", demanda-t-on. - \"C'est Gabriel \", répondit-il. - \"Et qui t'accompagne?\". - \"C'est Muhammad \". - \"A-t-il donc reçu la Mission?\". - \"Oui\". On nous ouvrit donc en disant : \"Qu'il soit donc le bienvenu! Quelle heureuse arrivée que la sienne!\". J'y trouvai alors Adam (que la paix soit sur lui)\". Et le Prophète se mit à relater la suite des événements (déjà mentionnés dans le hadith précédent) en disant qu'il avait rencontré au second ciel, Jésus ('Isa) et Jean-Baptiste (Yahiya) (que la paix soit sur les deux); au troisième, Joseph (Yûsuf); au quatrième, Anoch ('Idris); et au cinquième, Aaron (Hârûn) (que la bénédiction de Dieu soit sur eux tous). - Nous parvînmes enfin au sixième ciel, continua le Prophète, là je vis Moïse (Mûsa) (que la paix soit sur lui) que je saluai. Et lui de me répondre : \"Que tu sois le bienvenu, frère vertueux et Prophète vertueux!\". A peine l'avais-je dépassé, qu'il se mit à pleurer. \"Pourquoi tu pleures?\", lui demanda-t-on. - \"Ô Seigneur, répondit-il, ce jeune homme, vous l'avez envoyé après moi; et pourtant une multitude de sa Communauté iront au Paradis, tandis que ceux qui y accéderont parmi ma Communauté seront moins nombreux\". Puis, nous montâmes au septième ciel où je vis Abraham ('Ibrâhim). Or, le Prophète (paix et bénédiction de Dieu sur lui) raconta qu'il avait vu quatre fleuves : deux apparents et deux autres sous terre. \"Ô Gabriel! Quels sont donc ces fleuves?\", demanda-t-il. L'Archange répondit : \"Les deux fleuves souterrains sont du Paradis; quant aux deux autres, ils sont le Nil et l'Euphrate\". Le Prophète poursuivit son récit : Puis, on me montra la Maison Peuplée à son endroit sur laquelle j'interrogeai Gabriel qui me dit : \"C'est la Maison Peuplée où chaque jour, soixante-dix mille anges font la prière pour une seule fois dans leur vie\". Ensuite, on m'apporta deux récipients : l'un contenant du vin et l'autre de lait. Je choisis celui-ci. \"Vous y êtes! Que Dieu te bénis pour la faveur de ta Communauté! Tu as opté pour la voie primordiale\", constata Gabriel. Aussi, il me fut prescrit d'accomplir cinquante prières par jour...\" Et le Prophète relata ce qui s'était passé à ce sujet",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": "164.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": "165.01",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما) le Prophète (paix et bénédiction de Dieu sur lui) évoquant son Voyage Nocturne, dit : \"Moïse (Mûsa) était brun et de haute taille; on en dirait un homme de la tribu Chanû'a. Quant à Jésus ('Isa), il était d'un corps charnu et de taille moyenne\". Le Prophète mentionna aussi Mâlik, le gardien de l'Enfer et l'Antéchrist",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": "165.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": "166.01",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما), comme le Prophète (paix et bénédiction de Dieu sur lui) passait par la vallée d'Al-'Azraq, il demanda : \"Quelle est cette vallée?\". - On lui répondit : \"C'est la vallée d'Al-'Azraq\". Le Prophète dit alors : \"Il me semble voir Moïse (Mûsa) (que la paix soit sur lui) descendre du haut du plissement en faisant la Talbiya à haute voix\". Ensuite, ayant passé par le plissement de Harchâ, il demanda : \"Quel est ce plissement?\". - \"C'est le plissement de Harchâ \", lui répondit-on. Le Prophète dit alors : \"Il me semble voir Jonas (Yûnus) fils d'Amittaï (que la paix soit sur lui), vêtu d'une tunique de laine et enfourchant une grosse chamelle rousse dont la bride est en fibre, en train de faire la Talbiya",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": "166.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": "166.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": "167",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": "168",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : Lors de mon Voyage Nocturne, je rencontrai Moïse (Mûsa) (que la paix soit sur lui). C'était un homme fébrile, aux cheveux ni très lisses, ni très hérissés, dont on dirait un homme de la tribu Chanû'a. Je rencontrai aussi Jésus ('Isa); c'était un homme de taille moyenne, rougeaud tel l'homme qui vient de sortir du bain. Je vis également Abraham ('Ibrâhim) (que la paix soit sur lui), de ses descendants c'est moi qui lui ressemble le plus. Ensuite on m'offrit deux récipients : l'un contenant du vin et l'autre du lait. \"Bois celui des deux que tu voudras\", me dit-on. Je pris le lait et le bus. \"Tu as élu la voie primordiale, ajouta-t-il; si tu avais pris le vin, ta Communauté aurait été égarée\". Mention de Jésus, fils de Marie, et de l'Antéchrist",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": "169.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": "169.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": "169.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 428,
			"arabicnumber": "170",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": "171",
			"text": "D'après Abdoullâh Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Une nuit, je me suis vu (en songe) auprès de la Ka'ba où j'ai vu un homme brun, le plus beau brun que vous puissiez voir; il avait les plus beaux cheveux descendant derrière ses oreilles; ils dégouttaient encore d'eau comme s'il venait de les peigner; il était appuyé sur deux hommes ou, -suivant une variante-, soulevé sur les épaules de deux hommes et faisait ainsi le Tawâf (les tournées rituelles autour de la Maison). Je demandai qui était-il, et on me répondit : \"C'est le Messie, fils de Marie\". Je vis ensuite un homme boulot aux cheveux crépus; il était borgne de l'œil droit; celui-ci ressemblait à un grain de raisin saillant. Je demandai qui était-il; et on me répondit : \"C'est l'Antéchrist",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": "172",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Je me vis (en songe) dans l'enceinte de la Ka'ba (le Hijr), pendant que les Qoraychites me questionnaient sur mon Voyage Nocturne. Ceux-ci m'interrogèrent alors sur des détails concernant le Temple de Jérusalem que je n'avais pas retenus; ce qui me causa une affliction qui me fut inconnue jusqu'alors. Le Prophète ajouta : \"Dieu fit alors apparaître le monument à ma vue, et ainsi je pus répondre à toutes leurs questions\". Je me vis ensuite parmi un groupe de Prophètes dont Moïse (Mûsa) qui faisait la prière. Puis, j'aperçus un homme de haute stature, on en aurait dit de la tribu Chanû'a, c'était, en fait, Jésus le fils de Marie (que la paix soit sur lui), faisant la prière; de tous les hommes c'est 'Urwa Ibn Mas'ûd Ath-Thaqafî qui lui ressemble le plus. Je vis ensuite Abraham ('Ibrâhim) (que la paix soit sur lui) debout, faisant la prière; c'est votre ami qui lui ressemble le plus (il faisait allusion à lui-même). L'heure de la prière étant venue, j'y présidai les Prophètes. Une fois l'ayant terminée, on me dit : \"Ô Muhammad! Voilà Mâlik le gardien de l'Enfer, salue-lui\". Alors que je me tournai vers lui, le voilà qui me salua le premier. Interprétation de ces paroles de Dieu : \"Il l'a pourtant vu, lors d'une autre descente\". Le Prophète a-t-il vu son Seigneur la nuit de l'Ascension?",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": "173",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": "174.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": "174.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": "174.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 435,
			"arabicnumber": "175",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": "176.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": "176.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": "176.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": "177.01",
			"text": "Masroûq a dit : Un jour que j'étais accoudé chez 'Aïcha, elle me dit : \"Ô Abou 'Aïcha! Trois choses, quiconque prétend l'une d'elles aura forgé un grand mensonge sur Dieu\". Je lui dis : \"Lesquelles?\". - \"Quiconque prétend que Muhammad, (paix et bénédiction de Dieu sur lui) a vu son Seigneur, aura forgé un grand mensonge sur Dieu\". Etant appuyé sur mes coudes, ajouta Masroûq, je me mis sur mon séant et dis : \"Ô Mère des Croyants! Donnez-moi du temps (pour comprendre) et ne me pressez pas : Dieu, l'Exalté, n'a-t-Il pas dit : {Il l'a effectivement vu, au clair horizon, et Il l'a pourtant vu, lors d'une autre descente}. - Parmi les gens de cette Communauté, répondit-elle, j'étais la première à poser cette question à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) qui m'avait alors répondu : \"Il s'agit de Gabriel que je n'ai vu sous sa forme originelle que deux fois : dont une fois quand je l'ai vu descendre du ciel couvrant de sa grande stature tout ce qui se trouve entre le ciel et la terre\". Puis, 'Aïcha ajouta : N'as-tu pas entendu ce verset que Dieu a révélé à Son Prophète : {Les regards ne peuvent l'atteindre, cependant qu'Il saisit tous les regards. Et il est le Doux, le Parfaitement Connaisseur}. N'as-tu pas non plus entendu ce verset : {Il n'a pas été donné à un mortel que Dieu lui parle autrement que par révélation, ou de derrière un voile, ou qu'Il (lui) envoie un messager (Ange) qui révèle, par Sa permission, ce qu'Il (Dieu) veut. Il est Sublime et Sage.} 'Aïcha poursuivit : Quiconque présume que l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) avait caché quoi que ce soit du Livre de Dieu aurait forgé un grand mensonge sur Dieu. Dieu en effet dit : {Ô Messager, transmets ce qui t'a été descendu de la part de ton Seigneur. Si tu ne le faisais pas, alors tu n'aurais pas communiqué Son }... De plus, celui qui présume que le Prophète prévoit l'avenir, aura forgé un grand mensonge sur Dieu; Dieu (le Très-Haut) a dit : {Dis : Nul de ceux qui sont dans les cieux et sur la terre ne connaît l'Inconnaissable, à part Dieu}. (Mouslim n°259) Ces dires du Prophète : \"Dieu ne dort pas. Son voile est la lumière, s'Il l'enlève, la splendeur de Sa mine brûlera tout ce que Sa vision atteindra",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": "177.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 441,
			"arabicnumber": "177.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": "177.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": "178.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": "178.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 445,
			"arabicnumber": "179.01",
			"text": "Abou Moûsa (que Dieu l'agrée) a dit : Un jour, le Prophète (paix et bénédiction de Dieu sur lui) se leva parmi nous et fit état de cinq choses, il dit : Dieu, l'Exalté, ne dort pas et il ne Lui convient pas de dormir. Il abaisse la Balance et l'élève. Il prend connaissance des actes nocturnes (accomplis par Ses créatures) avant que le jour ne se lève, et des actes diurnes avant que la nuit ne tombe. La lumière, ou selon Abou Bakr \"le feu\", est Son voile; s'Il l'ôte, la splendeur de Sa mine brûlera certes quiconque de Ses créatures qui aurait pu l'apercevoir. Affirmation que les Croyants verront leur Seigneur le Très-Haut dans la vie future",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": "179.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": "179.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": "180",
			"text": "D'après Abou Moûsa (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Il y aura deux jardins dont les vases et tout ce qui y existe seront en argent, et deux autres jardins dont les vases et tout ce qui y existe seront en or. Dans le jardin d'Eden, rien ne sera interposé entre les bienheureux et la vue du Seigneur, sinon le voile de la grandeur sur Son visage",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 449,
			"arabicnumber": "181.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 450,
			"arabicnumber": "181.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 451,
			"arabicnumber": "182.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), des gens interrogèrent un jour le Prophète (paix et bénédiction de Dieu sur lui) s'ils verraient le Seigneur le Jour de la Résurrection. Et le Prophète (paix et bénédiction de Dieu sur lui) de répondre : \"Trouvez-vous de la peine à voir la lune quand elle est pleine?\". - \"Non, ô Envoyé de Dieu\" - \"Trouvez-vous de la peine à voir le soleil quand aucun nuage ne le cache?\". - \"Non, ô Envoyé de Dieu!\". - Eh bien, reprit-il, de même vous verrez le Seigneur. Le Jour de la Résurrection, Dieu rassemblera les gens, et leur dira : \"Que chacun suive ce qu'il adorait!\". Ceux qui adoraient le soleil, le suivront; ceux qui adoraient la lune, la suivront; et ceux qui adoraient les taghût (toute fausse divinité), les suivront. Tout le monde s'en ira donc, sauf cette Communauté y compris ses hypocrites. Ensuite Dieu (que soient exaltées Sa toute puissance et Sa grandeur) s'incarnera à elle dans une forme qu'elle ne connaît pas et leur dira : \"Je suis votre Seigneur\". - \"Nous nous réfugions contre toi auprès de Dieu, diront-ils, nous resterons ici jusqu'à ce que notre Seigneur vienne, et alors nous Le reconnaîtrons\". Dieu (que soient exaltées Sa toute puissance et Sa grandeur) leur viendra ensuite sous la forme qu'ils connaissent et leur dira : \"Je suis votre Seigneur\". - \"Certes, Tu es notre Seigneur\", répondront-ils; et ils Le suivront. A ce moment-là, le Sirât (pont aussi fin qu'un fil) sera établi entre les deux extrémités de l'Enfer. Ma Communauté et moi serons les premiers à le traverser. Ce jour-là, personne ne parlera sauf les Prophètes qui imploreront Dieu en ces termes : \"Ô Seigneur! Sauve-nous, sauve-nous!\". En Enfer, il y aura des grappins pareils aux épines du Sa'dân (plante épineuse), avez-vous vu le Sa'dân? - Certes oui, ô Envoyé de Dieu. - Ces grappins ressembleront donc aux épines du Sa'dân mais personne -si ce n'est que Dieu- ne connaît leur grandeur. Ils saisiront les gens suivant leurs actions : les croyants y échapperont tandis que les coupables y demeureront jusqu'à l'expiation de leurs fautes. Puis, quand Dieu achèvera le jugement de Ses serviteurs, et qu'Il voudra faire sortir par Sa miséricorde et selon Sa volonté certains des réprouvés de l'Enfer, Il donnera l'ordre aux anges de faire sortir du Feu, quiconque ne Lui associait rien parmi ceux à qui Il voudra accorder Sa miséricorde parce qu'ils attestaient qu'il n'y avait d'autre divinité que Dieu. Les anges les reconnaîtront grâce aux traces de la prosternation (marquées sur leur front), car le Feu dévorera entièrement le corps du fils d'Adam, à l'exception de cette partie, parce que Dieu lui a interdit de le faire. Ils sortiront donc de l'Enfer consumés par le Feu; mais grâce à l'eau de la vie qu'on versera sur eux, ils renaîtront comme renaît le pourpier dans le limon de l'inondation. Quand Dieu achèvera de régler les comptes des hommes et qu'il ne restera qu'un seul homme, ayant la face tournée vers le Feu. Celui-ci entrera au Paradis le dernier. Il s'écriera : \"Seigneur! Détourne mon visage de l'Enfer dont le souffle m'étouffe et les flammes me brûlent!\". L'homme implorera Dieu autant qu'Il lui inspirera. - \"Mais, lui dira-t-Il alors, est-ce que si J'exauce ton vœu, me demanderas-tu un autre?\". - \"Non, je ne Te demanderai pas autre chose\", dira l'homme en faisant maintes promesses et en prenant maints engagements vis-à-vis de Dieu qui détournera alors son visage de l'Enfer. Mais quand il arrivera au seuil du Paradis et qu'il le verra, l'homme gardera le silence aussi longtemps que Dieu le voudra et finira par dire : \"Seigneur! Approche-moi de la porte du Paradis\". - \"N'as-tu pas pris, répliquera Dieu, l'engagement formel de ne plus jamais rien Me demander après ce que Je t'ai déjà donné. Malheur à toi, ô fils d'Adam! Combien tu es perfide!\". - \"Si Seigneur\", dira l'homme qui continuera à invoquer et à implorer Dieu jusqu'à ce qu'Il lui dise : \"Me promets-tu de ne Me rien demander si J'exauce ton vœu?\". L'homme Lui promettra et confirmera sa promesse par autant d'engagements formels que Dieu voudra. Puis, Dieu l'approchera de la porte du Paradis, qui s'ouvrira alors devant lui. Voyant les biens et les félicités qu'il renferme, il gardera d'abord le silence aussi longtemps que Dieu voudra, puis s'écriera : \"Seigneur! Fais-moi entrer au Paradis\". - \"N'as-tu pas pris l'engagement formel de ne Me plus rien demander. Malheur à toi, ô fils d'Adam! Combien tu es perfide!\". \"Ô Seigneur! Fais que je ne sois pas le plus malheureux de Tes créatures\", dira l'homme qui poursuivra ses implorations jusqu'à provoquer le rire de Dieu (que soient exaltées Sa toute puissance et Sa grandeur). Dieu le fera alors entrer au Paradis et lui dira ensuite : \"Demande ce que tu désire\". L'homme ne cessera de demander et de formuler ses désirs, Dieu, de même, lui rappellera des vœux oubliés, jusqu'à ce que l'homme n'ait point de souhaits à exprimer et ce sera alors que Dieu lui dira : \"Tout cela est à toi et autant encore",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 452,
			"arabicnumber": "182.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 453,
			"arabicnumber": "182.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 455,
			"arabicnumber": "183.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": "183.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": "184.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": "184.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": "185.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": "185.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": "186.01",
			"text": "D'après 'Abdoullâh Ibn Mas'oûd (que Dieu l'agrée) le Prophète (paix et bénédiction de Dieu sur lui) a dit : Certes, je connais bien celui qui sortira le dernier de l'Enfer et qui entrera le dernier au Paradis. C'est un homme qui sortira de l'Enfer en se traînant et Dieu (que Son nom soit béni et exalté) lui dira : \"Entre au Paradis\". L'homme s'y rendra et ayant l'impression que le Paradis est encombré, il retournera dire à Dieu : \"Seigneur, je l'ai trouvé encombré\". - \"Va, lui répétera Dieu, et entre au Paradis\". L'homme s'y rendra de nouveau; et ayant toujours l'impression qu'il est encombré, il retournera dire à Dieu : \"Seigneur, je l'ai trouvé encombré\". - \"Va, répétera Dieu, et entre au Paradis; tu y auras ce qui équivaut aux biens temporels et dix fois plus encore ou, suivant une variante, ce qui équivaut au décuple des biens temporels\". - \"Tu Te moques de moi ou, suivant une variante, Tu ris de moi Toi qui es le Souverain Maître\", répliquera l'homme. - \"J'ai vu alors, ajoute 'Abdallâh, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) rire à gorge déployée. Et on disait que cet homme occuperait le rang le plus inférieur parmi les bienheureux du Paradis\". Ceux des hôtes du Paradis qui occupent les places mineures",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": "186.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": "187",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": "188",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": "189.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": "189.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": "190.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": "190.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": "191.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 470,
			"arabicnumber": "191.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": "191.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": "191.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": "191.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": "192",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": "193.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": "193.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": "193.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": "193.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": "193.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": "194.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": "194.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": "195",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": "196.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": "196.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": "196.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": "197",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": "198.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": "198.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": "198.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": "198.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": "199.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": "199.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": "199.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": "200.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": "200.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": "200.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 402
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": "200.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 403
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": "201",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 404
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": "202",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 405
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": "203",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 406
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": "204.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), lorsque fut révélé ce verset : {Et avertis les gens qui te sont les plus proches.} l'Envoyé de Dieu appela les Qoraychites à se réunir. Allant du général au particulier, il s'adressa à eux en ces termes : \"Ô Banû Ka'b Ibn Lu'ay, sauvez-vous du Feu; Ô Banû Murra Ibn Ka'b, sauvez-vous du Feu; Ô Banû 'Abd Chams, sauvez-vous du Feu; Ô Banû 'Abd Manâf, sauvez-vous du Feu; Ô Banû Hâchim, sauvez-vous du Feu; Ô Banû 'Abd Al-Muttalib, sauvez-vous du Feu; Ô Fâtima, sauve-toi du Feu. Car je ne puis rien pour vous tous auprès de Dieu sinon que le maintien de nos liens de parenté que je maintiendrai",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 407
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": "204.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 408
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": "205",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 409
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": "206.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 410
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": "206.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 411
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": "207.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 412
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": "207.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 413
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": "208.01",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما) : Lorsque fut révélé ce verset : {Et avertis les gens qui te sont les plus proches} le Prophète (paix et bénédiction de Dieu sur lui) se dirigea vers le mont As-Safâ et l'escalade, puis poussa un cri d'avertissement. Les gens se demandèrent alors qui appelait ainsi. Connaissant que c'était Muhammad, ils allèrent le retrouver. - Hé! les Banû untel! Hé! les Banû untel! Hé! les Banû untel! Hé les Banû 'Abd Manâf! Hé! les Banû 'Abd Al-Muttalib. Quand ils s'étaient tous assemblés, le Prophète leur dit : \"Eh bien! Figurez-vous que je vous annonce qu'il y a au pied de cette montagne des cavaliers qui veulent vous attaquer, me croiriez-vous?\". - \"Certes oui, répondirent-ils, car, tu n'as jamais menti\". - \"Eh bien! reprit-il, je vous avertis que vous êtes menacés d'un châtiment terrible\". - \"Que tu périsses!, s'écria Abou Lahab, est-ce pour cela que tu nous as rassemblés?\". C'est alors que fut révélé ce verset : {Que périssent les deux mains de Abou Lahab}, et en fait, il périt. Intercession du Prophète (paix et bénédiction de Dieu sur lui) en faveur de son oncle Abou Tâlib, et allégement du châtiment de ce dernier par la suite",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 414
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": "208.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 415
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": "209.01",
			"text": "Al-'Abbâs Ibn 'Abd Al-Mouttalib (que Dieu l'agrée) a dit : \"J'ai demandé à l'Envoyé de Dieu : \"Est-ce que vous vous êtes rendus utiles en quelque sorte à Abou Tâlib qui -de son vivant- vous favorisait et vous protégeait contre vos ennemis?\". - \"Oui, répondit le Prophète, il est dans une sorte de haut-fond de Feu; or sans mon intercession, il aurait été au bas-fond de l'Enfer",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 416
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": "209.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 417
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": "209.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 418
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": "210",
			"text": "D'après Abou Sa'îd Al-Khoudri (que Dieu l'agrée), comme on évoqua un jour devant le Prophète (paix et bénédiction de Dieu sur lui) son oncle paternel Abou Tâlib, il dit : \"Peut-être qu'au Jour du Jugement Dernier mon intercession lui sera utile, en sorte qu'il sera seulement mis au haut-fond du Feu qui lui arrivera jusqu'aux chevilles et lui fera bouillir le cerveau\". Les gens qui subiront le moindre châtiment",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 419
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": "211",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 420
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": "212",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 421
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": "213.01",
			"text": "An-Nu'mân Ibn Bachîr (que Dieu l'agrée) a entendu le Prophète (paix et bénédiction de Dieu sur lui) dire : \"Au Jour de la Résurrection, le réprouvé le plus légèrement châtié sera l'homme à qui on mettra sous la plante des pieds deux braises qui feront bouillir son cerveau\". S'allier aux fidèles et rompre avec les incrédules",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 422
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": "213.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 423
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": "214",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 424
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": "215",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 425
			}
		},
		{
			"hadithnumber": 520,
			"arabicnumber": "216.01",
			"text": "Selon Abou Hourayra (que la paix soit sur lui), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dit : \"Soixante-dix mille de ma Communauté entreront au Paradis sans jugement\". Un homme dit alors : \"Ô Envoyé de Dieu! Invoque Dieu pour que je sois l'un d'eux\". - \"Seigneur, s'écria le Prophète, fais qu'il soit parmi eux!\". Un autre homme se leva et dit : \"Ô Envoyé de Dieu! Invoque Dieu pour que je sois l'un d'eux\". Mais, l'Envoyé de Dieu lui répondit : \"'Oukkâcha t'a devancé",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 426
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": "216.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 427
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": "216.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 428
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": "217",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 429
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": "218.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 430
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": "218.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 431
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": "219",
			"text": "D'après Abou Hâzim, Sahl Ibn Sa'd (que Dieu l'agrée) transmet que le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Entreront au Paradis soixante-dix mille ou sept cent mille de ma Communauté (Abou Hâzim ne sait pas lequel des deux nombres est le plus correct) liés les uns aux autres de sorte que leur premier ne franchira pas le seuil (du Paradis) sans que le dernier aussi le franchisse. Leurs visages auront l'aspect de la lune quand elle est pleine",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 432
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": "220.01",
			"text": "D'après Ibn 'Abbâs (رضي الله عنهما), le Prophète (paix et bénédiction de Dieu sur lui) a dit : On fit défiler devant moi les diverses communautés (religieuses). Je vis alors un Prophète passait, étant accompagné d'une petite troupe de fidèles (presque une dizaine), un autre qui passait tout en n'ayant à sa compagnie qu'un ou deux hommes, et un troisième qui passait tout seul. Ensuite, je vis une multitude de gens et je crus qu'il s'agissait de ma Communauté; mais on me dit que c'était Moïse (Mûsa) (que la paix soit sur lui) et son peuple. On me demanda ensuite de regarder une masse nombreuse qui barrait l'horizon. - \"Regarde aussi de l'autre horizon\", ajouta-t-on. J'y vis également une autre masse nombreuse, c'est alors qu'on me dit : \"Voici ta Communauté et il y aura en outre soixante-dix mille qui entreront au Paradis sans qu'on leur demande aucun compte et sans qu'ils subissent de châtiment\". Ceci dit, le Prophète se leva et rentra chez lui. Les assistants, eux, se mirent à discuter au sujet de ceux qui entreront au Paradis sans qu'on leur demande de compte et sans qu'ils subissent de châtiment. Quelques-uns dirent alors : \"Peut-être s'agit-il des compagnons du Prophète (paix et bénédiction de Dieu sur lui)\". D'autres dirent : \"Ce sont plutôt ceux qui naissent musulmans et qui n'ont jamais associé de divinité à Dieu, etc.\". Comme le Prophète (paix et bénédiction de Dieu sur lui) revint et apprit le sujet de leur discussion, il dit : \"Il s'agit de ceux qui ne s'exorcisent pas et ne pratiquent pas l'exorcisme, de ceux qui ne sont pas superstitieux et de ceux qui mettent toute leur confiance en leur Seigneur\". 'Oukkâcha Ibn Mihsan se leva alors et dit : \"Ô Envoyé de Dieu! Invoque Dieu pour que je sois l'un d'eux\". - \"Tu le seras\", répondit le Prophète. Un autre musulman se leva ensuite et demanda la même chose au Prophète, celui-ci lui répondit : \"Tu as été devancé par 'Oukkâcha\". La Communauté musulmane constituera la moitié des hôtes du Paradis",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 433
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": "220.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 434
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": "221.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 435
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": "221.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 436
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": "221.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 437
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": "222.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 438
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": "222.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 439
			}
		}
	]
}