{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2263,
			"arabicnumber": "979.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2264,
			"arabicnumber": "979.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2265,
			"arabicnumber": "979.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2266,
			"arabicnumber": "979.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2267,
			"arabicnumber": "979.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2268,
			"arabicnumber": "979.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2269,
			"arabicnumber": "979.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2270,
			"arabicnumber": "979.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2271,
			"arabicnumber": "980",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2272,
			"arabicnumber": "981",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2273,
			"arabicnumber": "982.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2274,
			"arabicnumber": "982.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2275,
			"arabicnumber": "982.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2276,
			"arabicnumber": "982.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2277,
			"arabicnumber": "983",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2278,
			"arabicnumber": "984.01",
			"text": "D'après Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) fixa l'aumône légale de la rupture du jeûne (Zakâ al-fitr) à un sâ' (un quart de litre de grain) de dattes ou un sâ' d'orge imposable à chaque personne libre ou esclave, homme ou femme",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2279,
			"arabicnumber": "984.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2280,
			"arabicnumber": "984.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2281,
			"arabicnumber": "984.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2282,
			"arabicnumber": "984.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2283,
			"arabicnumber": "985.01",
			"text": "Abou Sa'îd Al-Khoudri (que Dieu l'agrée) a dit : Nous versions comme aumône légale de la rupture du jeûne (Zakâ al-fitr), un sâ' (un quart de litre de grain) de froment, d'orge, de dattes, de fromage blanc ('aqit) ou de raisins secs. Obligation de s'acquitter de Zakâ al-Fitr avant la prière",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2284,
			"arabicnumber": "985.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2285,
			"arabicnumber": "985.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2286,
			"arabicnumber": "985.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2287,
			"arabicnumber": "985.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2288,
			"arabicnumber": "986.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2289,
			"arabicnumber": "986.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Nul homme qui thésaurise de l'or ou de l'argent sans en payer l'aumône légale, au Jour de la Résurrection, des plaques métalliques portées à incandescence dans le feu de la Géhenne lui seront appliquées sur le flanc, le front et le dos. Dès qu'elles se refroidissent, elles seront à nouveau portées à incandescence, et lui seront appliquées durant un jour de cinquante mille ans, jusqu'à ce que les comptes des hommes soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda : \"Ô Envoyé de Dieu! Si les biens étaient des chameaux?\" Il répondit : \"La même chose pour le possesseur des chameaux qui n'en paye pas l'aumône légale qui consiste à distribuer un peu de leurs laits le jour où il les mène à l'abreuvoir. Au Jour de la Résurrection, il sera jeté à terre et on amènera tous ses chameaux sans même qu'un chamelon ne manque. Ceux-ci le piétineront avec leurs sabots et le mordront. Ils le fouleront dans un va-et-vient continuel et cela durera un jour de cinquante mille ans, jusqu'à ce que les comptes des Serviteurs soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda ensuite : \"Qu'en est donc du sort du possesseur des vaches et des moutons?\" L'Envoyé de Dieu répondit : \"La même chose pour le possesseur des vaches et des moutons qui n'en paye pas l'aumône légale. Au Jour de la Résurrection, il sera jeté à terre et on amènera tout son bétail sans exception. Aucun d'eux n'aura ni des cornes courbées, ni sera décornu, ni aura l'oreille fendue! Ces animaux l'attaqueront avec leurs cornes et le fouleront aux pieds dans un va-et-vient continuel et cela durera un jour de cinquante mille ans, jusqu'à ce que les comptes des Serviteurs soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda de nouveau : \"Qu'en est-il du possesseur des chevaux, ô Envoyé de Dieu?\" Il répondit : \"Les chevaux sont de trois catégories : ils représentent un péché pour un homme, un rempart pour un autre et une récompense pour un troisième. Le cheval est un péché pour son propriétaire, quand celui-ci le destine par vanité et ostentation pour s'attaquer aux musulmans. Le cheval est un rempart à son propriétaire, quand celui-ci le destine à servir dans le chemin de Dieu, sans négliger d'en payer le dû de Dieu soit en donnant à un combattant (pour la cause de Dieu) le droit de s'en servir, soit en versant l'aumône légale. Le cheval est une récompense pour son propriétaire, lorsque celui-ci le consacre aux musulmans pour s'en servir dans la cause de Dieu en l'attachant au sein d'une prairie ou d'un jardin, autant que le cheval mange de ce pâturage, autant que l'homme amasse de bonnes actions, le montant de celles-ci augmentera même suivant la quantité des crottins et des urines de l'animal. Même si ces chevaux se détacheront de leurs longs licous et courront à une longue allure une colline ou plus, Dieu inscrira à leur propriétaire de bonnes actions équivalentes au nombre de leurs traces et de leurs crottins. Et quand leur propriétaire passera par un fleuve, et que ces chevaux s'y abreuveront, même s'il n'avait pas l'intention de les abreuver, Dieu lui inscrira de bonnes actions équivalant à la quantité de l'eau bue\". On demanda enfin : \"Ô Envoyé de Dieu! Qu'en est-il des ânes?\" Il répondit : \"Dieu ne m'a rien révélé à leur sujet sauf ce verset exceptionnel et exhaustif : Quiconque fait un bien fût-ce du poids d'un atome, le verra, et quiconque fait un mal fût-ce du poids d'un atome, le verra\". Dureté du châtiment de celui qui refuse la Zakâ",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2291,
			"arabicnumber": "987.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2292,
			"arabicnumber": "987.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2293,
			"arabicnumber": "987.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2294,
			"arabicnumber": "987.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": "988.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": "988.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": "989.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2299,
			"arabicnumber": "989.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": "990.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": "990.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": "991.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée) le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Je ne serai pas heureux si je possède de l'or autant que la montagne de 'Uhud et qu'à la troisième nuit, j'en ai encore un dinar, sauf au cas où celui-ci aurait été conservé pour que je m'acquitte d'une dette\". Ceux qui thésaurisent des fortunes et la dureté de leur châtiment",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": "991.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2304,
			"arabicnumber": "94.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": "94.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": "992.01",
			"text": "D'après Abou Dharr (que Dieu l'agrée) : Al-'Ahnaf Ibn Qays a dit : Je gagnai Médine et alors que j'étais assis parmi un groupe de Qoraychites, arriva un homme grossier de traits, d'aspect et de vêtements. Il s'adressa à eux en disant : \"Annonce aux thésauriseurs (des biens et des fortunes qui ne s'acquittent pas de l'aumône légale) qu'on fera rougir dans le feu de la Géhenne pour les punir des pierres qu'on appliquera sur le mamelon de chacun d'eux, qu'on laissera là jusqu'à ce qu'elle pénètre la clavicule de son épaule; et qu'on posera ensuite sur sa clavicule jusqu'à ce qu'elle pénètre son mamelon; ce qui le fera trembler\". Ceci dit, les gens inclinèrent leur tête sans souffler mot. Quant à l'homme, il s'en alla et moi, de le suivre. Il s'installa auprès d'un pilier. Je lui dis : \"Je crois que ces gens ont pris en horreur ce que tu leur avais dit\". - \"Ceux-ci ne comprennent rien. Mon ami, Abou Al-Qâsim (paix et bénédiction de Dieu sur lui) m'appela un jour et me dit : \"Vois-tu le mont 'Uhud ?\". Alors, je regardai le soleil (pour savoir l'heure), car je pensai qu'il (paix et bénédiction de Dieu sur lui) voulait me charger de quelque mission, et je répondis : \"Oui, je le vois\". - \"Ah! reprit-il, je ne serais pas heureux de posséder une quantité d'or égale à la montagne de 'Uhud, sinon que pour la dépenser toute en aumône et n'en conserver que trois dinars. Et voilà que ces gens-là, ajouta Abou Dharr, s'acharnent à amasser les biens de l'ici-bas sans penser\". Je lui dis alors : \"Pourquoi ne demandes-tu pas de l'argent à tes coreligionnaires Qoraychites?\". - \"Non, par Dieu! Je ne leur demanderai jamais des biens temporels ni ne leur expliquerai leur religion jusqu'à ce que j'aille rejoindre Dieu et Son Envoyé\". Encouragement à dépenser l'argent et la compensation que recevra celui qui le fait",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": "992.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": "993.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Dieu, l'Exalté et le Très-Haut, a dit : \"Ô fils d' Adam, dépense (en aumônes) et Je te compenserai\". Puis il poursuivit : \"La main de Dieu est pleine de dons et de bénédictions à déborder, - selon Ibn Numayr -, aucune dépense, durât-elle nuit et jour, ne saurait l'épuiser\". Il faut commencer par dépenser l'argent pour subvenir à ses besoins, à ceux de sa famille et de ses proches",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": "993.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": "994",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": "995",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": "996",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2313,
			"arabicnumber": "997.01",
			"text": "Selon Jâbir (que Dieu l'agrée) : Un homme de la tribu 'Udhra a promis l'affranchissement à son esclave après sa mort. Ceci parvint à la connaissance de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) qui demanda à l'homme : \"Possèdes-tu d'autre bien?\" - \"Non\", répondit l'homme - \"Qui désire l'acheter?\", dit le Prophète (paix et bénédiction de Dieu sur lui) en s'adressant aux fidèles. Na'îm Ibn 'Abdoullâh Al-'Adawî l'acheta à huit cent dirhams. Il apporta la somme à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) qui l'avait remise à l'homme en lui disant : \"Commence par faire la charité à toi-même, s'il en reste quelque chose, dépense-la au profit de ta famille, s'il en reste encore, dépense-la au profit de tes proches, enfin s'il en reste encore, dépense-la par-ci et par-là\". Il voulut dire : \"Aux besogneux qui t'entourent de droite et de gauche\". Mérite de dépenser l'argent et de verser l'aumône aux proches, à l'épouse, aux enfants et aux parents même s'ils étaient des polythéistes",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2314,
			"arabicnumber": "997.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2315,
			"arabicnumber": "998.01",
			"text": "Anas Ibn Mâlik (que Dieu l'agrée) a dit : \"Abou Talha était le plus riche de tous les 'Ansâr de Médine. De tous ses biens, celui auquel il tenait le plus était une palmeraie (Bayrahâ) qui se trouvait en face de la mosquée. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) y pénétrait souvent pour boire de son eau douce. Anas, ajoute : A la révélation du verset suivant : Vous n'atteindrez la (vraie) piété que si vous faites largesse de ce que vous chérissez. Abou Talha alla trouver l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et lui dit : \"Ô Envoyé de Dieu, Dieu a dit dans le Coran : Vous n'atteindrez la (vraie) pitié que si vous faites largesse de ce que vous chérissez. Or, de tous mes biens, celui auquel je tiens le plus c'est Bayrahâ; j'en fais aumône pour la face de Dieu; espérant qu'elle me sera comptée comme bonne œuvre et ajoutée à mon compte auprès de Lui. Ô Envoyé de Dieu, dispose-toi de cette palmeraie comme bon te semble\". - \"Comme c'est merveilleux!, répondit l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), c'est un bien fructueux! C'est un bien fructueux! J'ai bien entendu ce que tu avais dit, mais je te suggère d'en faire aumône au profit de tes proches\". Et Abou Talha de la partager entre ses proches parents et ses cousins paternels",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2316,
			"arabicnumber": "998.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2317,
			"arabicnumber": "999",
			"text": "Maymûna bint Al-Hârith (رضي الله عنها) a transmis qu' elle avait affranchi une femme esclave au temps du Prophète (paix et bénédiction de Dieu sur lui). Comme elle lui raconta ce qu'elle avait fait, le Prophète (paix et bénédiction de Dieu sur lui) lui dit : \"Eh bien! Si tu en avais fait don à tes oncles maternels, cela t'aurait valu une meilleure récompense",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2318,
			"arabicnumber": "1000.01",
			"text": "Selon Zaynab (رضي الله عنها) : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit, en s'adressant aux femmes : \"Femmes! Faites l'aumône, même avec vos bijoux\". Je retournai chez moi et je dis à -mon mari- : \"Tu es un homme pauvre et l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) vient de nous ordonner de faire l'aumône. Va lui demander s'il m'est possible de te faire la charité; sinon je la donnerai à quelqu'un d'autre\". Il me répondit : \"Il vaut mieux que tu ailles toi-même lui demander cela\". Zaynab poursuivit : Je me rendis chez l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et je trouvai à sa porte une femme des 'Ansâr qui était venu pour la même raison. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) avait un aspect majestueux et impressionnant. Ce fut Bilâl qui nous reçut et nous lui dîmes : \"Rends-toi chez l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et informe-le qu'il y a deux femmes à sa porte et qu'elles voudraient savoir s'il leur était permis de donner l'aumône à leurs maris et aux orphelins qui sont à leurs charges, et ne lui communique pas surtout notre identité\". Bilâl entra chez l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et lui fit part de notre question. Il l'interrogea : \"Qui sont-elles?\" - \"Une femme des 'Ansâr, lui répondit-il, et Zaynab\". - \"Laquelle des Zaynab?\", demanda-t-il. - \"La femme de L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) lui dit : \"Elles auront ainsi deux récompenses : celle d'entretenir le lien familial, et celle de faire l'aumône",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2319,
			"arabicnumber": "1000.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2320,
			"arabicnumber": "1001.01",
			"text": "Oum Salama (رضي الله عنها) a transmis qu' elle avait demandé à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) : \"Ô Envoyé de Dieu! Serai-je récompensée si je dépense pour les fils de Abou Salama qui sont mes enfants, bien que ce n'ait pas de mon devoir de le faire?!\". Il lui répondit : \"Autant que tu dépenses pour eux, autant que tu seras récompensée",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2321,
			"arabicnumber": "1001.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2322,
			"arabicnumber": "1002.01",
			"text": "Selon Abou Mas'ûd Al-Badrî (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Tout argent que le musulman dépense pour l'entretien de sa famille, en ne visant rien d'autre que la rétribution de Dieu, lui sera compté pour aumône",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2323,
			"arabicnumber": "1002.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2324,
			"arabicnumber": "1003.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2325,
			"arabicnumber": "1003.02",
			"text": "Selon Asma (رضي الله عنها) : Je demandai à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) : \"Ô Envoyé de Dieu! Ma mère (qui était polythéiste) vint me trouver dans le désir de rétablir nos liens familiaux. Devrais-je lui afficher de la piété filiale?\". Il me répondit : \"Certes oui\". Récompense du mort au nom duquel une aumône est faite",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2326,
			"arabicnumber": "1004.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2327,
			"arabicnumber": "1004.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2328,
			"arabicnumber": "1005",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2329,
			"arabicnumber": "1006",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2330,
			"arabicnumber": "1007.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2331,
			"arabicnumber": "1007.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2332,
			"arabicnumber": "1007.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2333,
			"arabicnumber": "1008.01",
			"text": "D'après Abou Moûsa (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Tout musulman est tenu de faire l'aumône\". - \"Mais, objecta-t-on, et s'il ne trouve pas (d'argent) pour la faire?\". - \"Qu'il travaille de ses mains, répondit le Prophète, pour gagner sa vie et faire l'aumône\". - \"Mais s'il ne le peut pas?\". - \"Qu'il prête une main secourable à un besogneux victime d'une affliction\". - \"Et s'il ne le peut pas non plus?\". - \"Alors qu'il préconise le bien\". - \"Qu'en est-il s'il ne le fait pas?\". - \"Qu'il s'abstienne de faire le mal, ce qui lui sera compté pour aumône",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2334,
			"arabicnumber": "1008.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2335,
			"arabicnumber": "1009",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2336,
			"arabicnumber": "1010",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2337,
			"arabicnumber": "1011",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2338,
			"arabicnumber": "1012",
			"text": "D'après Abou Moûsa (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Il sera un temps où l'homme, voulant faire une aumône en or, ne trouvera personne qui veuille l'accepter. On verra alors l'homme suivi de quarante femmes qui se réfugieront auprès de lui; ce que les hommes seront très peu nombreux par rapport aux femmes",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2340,
			"arabicnumber": "157.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2341,
			"arabicnumber": "1013",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2342,
			"arabicnumber": "1014.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Toute aumône faite d'un argent licite -et Dieu n'accepte que le licite-, tombera dans la main droite du Miséricordieux. Même si elle était une datte, celle-ci augmenterait au creux de la main du Miséricordieux jusqu'à ce qu'elle devienne plus grande encore qu'une montagne, tel qu'un poulain ou un chamelon ne grandissent\". Encouragement à faire l'aumône fût-ce d'une demi-datte ou d'une bonne parole, l'aumône passant pour un bouclier contre le feu de l'Enfer",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2343,
			"arabicnumber": "1014.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2344,
			"arabicnumber": "1014.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2345,
			"arabicnumber": "1014.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2346,
			"arabicnumber": "1015",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2347,
			"arabicnumber": "1016.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2348,
			"arabicnumber": "1016.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2349,
			"arabicnumber": "1016.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2350,
			"arabicnumber": "1016.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2351,
			"arabicnumber": "1017.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2352,
			"arabicnumber": "1017.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2353,
			"arabicnumber": "1017.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2354,
			"arabicnumber": "1017.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2355,
			"arabicnumber": "1018.01",
			"text": "Abou Mas'ûd (que Dieu l'agrée) a dit : Lorsque l'aumône nous fut prescris, nous faisions métier de portefaix (pour gagner de quoi la faire). Alors Abou 'Aqîl fit aumône d'un demi sâ' (mesure des grains chez les Médinois, équivalent à huit poignées), alors qu'une autre personne vint faire une aumône plus grande que lui. - \"Dieu, dirent les hypocrites, se passera certes de l'aumône du premier. Quant au second, il ne l'a faite que par ostentation\". Tel fut l'occasion de la révélation de ce verset : Ceux-là qui dirigent leurs calomnies contre les Croyants qui font des aumônes volontaires et contre ceux qui ne trouvent que leurs faibles moyens (à offrir)... Mérite de la \"Maniha",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2356,
			"arabicnumber": "1018.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2357,
			"arabicnumber": "1019",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2358,
			"arabicnumber": "1020",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2359,
			"arabicnumber": "1021.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"L'avare et le charitable sont comparables à deux hommes qui portent chacun une cotte de mailles qui leur serre la torse. Lorsque le charitable veut faire l'aumône, sa cotte se dilate. Tandis que lorsque l'avare veut la faire, les mailles de sa cotte se rétrécissent de sorte que ses mains se joignent l'une à l'autre, et que les traces de ses pas s'effacent\". Abou Hourayra ajouta : Et bien que ce dernier s'efforce d'élargir sa cotte, il ne le pourra plus\". L'aumône, même si elle est faite à celui qui ne la mérite pas sera récompensée par Dieu",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2360,
			"arabicnumber": "1021.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2361,
			"arabicnumber": "1021.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2362,
			"arabicnumber": "1022",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2363,
			"arabicnumber": "1023",
			"text": "D'après Abou Moûsa (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"L'honnête dépositaire musulman qui exécute -ou qui donne la personne qu'on lui désigne-, ce qu'on lui ordonne d'une façon intégrale, complète et de bon gré, est considéré comme l'un de ceux qui font l'aumône",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2364,
			"arabicnumber": "1024.01",
			"text": "D'après 'Aïcha (رضي الله عنها), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Quand la femme fait l'aumône des vivres de sa maison sans gaspillage, elle aura une récompense. Son mari aura également sa part de la récompense puisque c'est lui qui a acquis ce bien. Le dépositaire en aura aussi sa part; sans toutefois que la récompense de l'un amoindrira celle des deux autres",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2365,
			"arabicnumber": "1024.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2366,
			"arabicnumber": "1024.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2367,
			"arabicnumber": "1024.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2368,
			"arabicnumber": "1025.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2369,
			"arabicnumber": "1025.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2370,
			"arabicnumber": "1026",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"La femme ne doit pas entamer un jeûne (supplémentaire) en la présence de son mari qu'avec sa permission. Elle ne doit pas non plus accueillir quelqu'un chez elle qu'avec sa permission. Quant aux aumônes qu'elle fait avec son argent et sans son autorisation, il aura la moitié de leurs récompenses\". Celui qui a recueilli l'aumône et les bonnes actions",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2371,
			"arabicnumber": "1027.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée) : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Celui qui aura dépensé une paire de quoi que ce soit dans la voie de Dieu, sera ainsi appelé au Paradis : \"Ô Adorateur de Dieu, voilà une bonne action!\". Celui qui tenait assidûment à accomplir la prière, sera appelé par la porte de la prière. Celui qui tenait à faire le djihad, sera appelé par la porte du djihad. Celui qui tenait à faire l'aumône, sera appelé par la porte de l'aumône. Celui qui pratiquait assidûment le jeûne, sera appelé par la porte dite Ar-Rayyân\". Abou Bakr As-Siddîq ayant demandé : \"Y aura-t-il un inconvénient à ne pas être appelé par toutes ces portes, et y aura-t-il quelqu'un qui sera appelé par toutes ces portes à la fois, ô Envoyé de Dieu?\". - \"J'espère, répondit le Prophète (paix et bénédiction de Dieu sur lui), que tu seras au nombre de ces derniers\". Incitation à faire l'aumône et interdiction de faire le compte de ses dépenses",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2372,
			"arabicnumber": "1027.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2373,
			"arabicnumber": "1027.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2374,
			"arabicnumber": "1028",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2375,
			"arabicnumber": "1029.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2376,
			"arabicnumber": "1029.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2377,
			"arabicnumber": "1029.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2378,
			"arabicnumber": "1029.04",
			"text": "Selon Asma bint 'Abî Bakr (رضي الله عنها), le Prophète (paix et bénédiction de Dieu sur lui) lui a dit : \"Dépense en aumône, fais des dons et sois charitable. Ne lésine pas pour que Dieu ne te rendes pas impécunieuse\". Encouragement à faire l'aumône même en versant de petites sommes d'argent",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2379,
			"arabicnumber": "1031.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2380,
			"arabicnumber": "1031.02",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Sept personnes seront à l'ombre de Dieu le Jour où il n'y aura plus d'ombre que la Sienne : le souverain équitable; le jeune homme qui a éteint l'ardeur de sa jeunesse dans l'adoration de Dieu; l'homme dont le cœur est attaché aux mosquées (qui tient à s'y rendre et à y attendre la prière); deux hommes qui, s'aimant en Dieu, se réunissent pour Dieu et se séparent selon Son décret (par la mort); l'homme qui refuse l'invitation à la fornication offerte par une belle femme de haute naissance, en disant : \"Je crains Dieu\"; l'homme qui fait l'aumône en secret au point que sa main droite ignore ce que vient de dépenser sa main gauche; et l'homme, en retraite spirituelle, qui invoque Dieu et a, par attendrissement, les larmes aux yeux\". La meilleure des aumônes est celle versée par l'homme sain et avare",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2382,
			"arabicnumber": "1032.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2383,
			"arabicnumber": "1032.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2384,
			"arabicnumber": "1032.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2385,
			"arabicnumber": "1033",
			"text": "D'après 'Abdoullâh Ibn 'Omar (رضي الله عنهما) : Pendant qu'il était en chaire sermonnant au sujet de la charité et de l'abstention d'acquérir des biens illicites ou de mendier, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"La main de dessus vaut mieux que la main de dessous. La première est celle qui donne et la seconde est celle qui reçoit",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2386,
			"arabicnumber": "1034",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2387,
			"arabicnumber": "1035",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2388,
			"arabicnumber": "1036",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2389,
			"arabicnumber": "1037.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2390,
			"arabicnumber": "1038.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": "1038.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": "1037.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": "1039.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"L'indigent n'est pas celui qui demande la charité aux gens; se contentant d'une ou de deux bouchées de nourriture ou d'une ou deux dattes\". - \"Qui est-ce donc l'indigent, ô Envoyé de Dieu?\", lui demanda-t-on. - \"Il est, répondit le Prophète, celui qui ne trouve pas de richesse pour s'épargner le besoin; dont on ne se rend pas compte de son besoin pour lui faire l'aumône, et qui s'abstient de demander aux gens\". Il est répréhensible de mendier",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": "1039.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": "1039.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": "1040.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": "1040.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": "1040.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": "1041",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": "1042.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée) : J'ai entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dire : \"Il vaudrait mieux à l'un de vous d'aller de bonne heure ramasser du bois et porter les bûches à dos en vue de faire l'aumône et de rester à l'abri du besoin; plutôt que de demander la charité à quelqu'un qui peut la lui faire ou la lui refuser. C'est pourquoi la main qui donne est de beaucoup meilleure que celle qui reçoit. Subviens d'abord aux besoins de ceux qui sont à ta charge\". L'aumône peut être reçue par celui qui ne l'a ni demandée ni convoitée",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": "1042.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": "1042.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": "1043",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": "1044",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": "1045.01",
			"text": "Selon 'Omar Ibn Al-Khattâb (que Dieu l'agrée) : Quand l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) me faisait un don, je lui disais : \"Donne-le à quelqu'un qui en a plus besoin que moi\". Un jour, il m'a donné de l'argent, et comme je lui répétai : \"Donne-le à quelqu'un de plus besogneux que moi\", l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) me dit : \"Prends-le, et chaque fois qu'il te viendra quelque bien sans que tu l'aies demandé ou l'aies avidement désiré, accepte-le. Sinon, ne cherche pas à en acquérir\". Mépris d'être avide de l'ici-bas",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": "1045.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": "1045.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": "1045.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": "1045.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2410,
			"arabicnumber": "1046.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": "1046.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": "1047.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": "1047.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": "1047.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2415,
			"arabicnumber": "1048.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": "1048.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": "1048.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": "1049",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": "1050",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": "1051",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"La richesse ne consiste pas dans l'abondance des biens; mais, elle est plutôt celle de l'âme\". Redoute des splendeurs du monde",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": "1052.01",
			"text": "D'après Abou Sa'îd Al-Khoudri (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), prononçant un jour un sermon, dit : \"Certes, par Dieu! Je ne crains pour vous, ô gens, que les splendeurs que Dieu vous procure en ce bas monde\". Un homme demanda alors : \"Ô Envoyé de Dieu! Est-ce que le bien peut apporter le mal?\". Le Prophète (paix et bénédiction de Dieu sur lui) garda le silence un moment; puis ayant demandé à l'homme de répéter sa question, répondit : \"Le bien n'apporte que le bien. Mais est-ce qu'il s'agit vraiment de bien (c'est plutôt une tentation)? (A titre d'exemple), tout ce qui pousse au printemps risque de causer la mort par météorisme (pour en avoir trop mangé) ou au moins de nuire à la santé. Seul, l'animal herbivore échappera à ce danger. Quand celui-ci mange de l'herbe jusqu'au rassasiement, il se met au soleil et quand il fiente ou urine, puis rumine l'herbe, il pourra recommencer de paître. Celui qui use équitablement des richesses (de ce monde) gardera la bénédiction. Quant à celui qui en use injustement, il sera semblable à celui qui mange sans jamais se rassasier\". Mérite de la chasteté et de la patience",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": "1052.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": "1052.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": "1053.01",
			"text": "D'après Abou Sa'îd Al-Khoudri (que Dieu l'agrée), quelques gens des 'Ansâr vinrent demander l'aumône à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). Celui-ci leur ayant donné, ils la lui demandèrent de nouveau. Et le Prophète de continuer à leur donner jusqu'à l'épuisement de ses ressources. \"Quels que soient les biens que je possède, leur dit alors le Prophète, je ne les mettrai pas de côté pour vous en priver. Pourtant, quiconque s'abstient d'acquérir des biens illicites ou de demander l'aumône aux gens, Dieu le protégera et préservera son amour-propre, quiconque essaye de se mettre à l'abri du besoin, Dieu l'enrichira; quiconque essaye de faire preuve de patience, Dieu fortifiera son endurance. Certes, personne n'a reçu un don meilleur et plus avantageux que la patience\". Contentement et sobriété",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": "1053.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2426,
			"arabicnumber": "1054",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": "1055",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": "1056",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": "1057.01",
			"text": "Anas Ibn Mâlik (que Dieu l'agrée) a dit : Je marchais en compagnie du Prophète (paix et bénédiction de Dieu sur lui) qui était vêtu d'une robe najrânite, ayant un ourlet râpeux, quand un bédouin vint le rejoindre et le tira par sa robe si violemment que je vis les traces de l'ourlet marquer le cou du Prophète (paix et bénédiction de Dieu sur lui). - \"Ô Muhammad! Ordonne qu'on me donne des biens de Dieu dont tu disposes\", lui dit le bédouin. Le Prophète (paix et bénédiction de Dieu sur lui) se tourna vers lui en riant; puis ordonna qu'on lui donnât quelque chose",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": "1057.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": "1058.01",
			"text": "Selon Al-Miswar Ibn Makhrama (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) distribua des vêtements de dessus sans rien donner à Makhrama. - \"Ô mon fils, dit Makhrama, conduis-moi auprès de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui)\". Je l'y donc accompagnai. - \"Entre, me dit-il, et appelle le Prophète\". Dès que je l'eus appelé, le Prophète sortit, mettant sur ses épaules l'un de ces vêtements, et dit : \"Je l'ai mis de côté pour toi\". Makhrama alors examina le vêtement et fut satisfait. Le fait de donner à ceux dont les cœurs sont à rallier à l'Islam et la constance de ceux dont la foi est ferme",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": "1058.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": "150.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": "150.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2435,
			"arabicnumber": "150.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": "1059.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": "1059.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": "1059.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": "1059.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2440,
			"arabicnumber": "1059.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": "1059.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": "1059.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": "1060.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": "1060.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": "1060.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": "1061",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": "1062.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": "1062.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": "1063.01",
			"text": "Selon Jâbir Ibn 'Abdoullâh (رضي الله عنهما), un homme vint trouver l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) à Al-Ji'râna après la bataille de Hunayn. Il le trouva en train de puiser des billets d'argent dans les pans du vêtement de Bilâl pour en distribuer aux gens. - \"Ô Muhammad! Sois équitable!\", dit l'homme. - \"Malheur à toi!, répliqua le Prophète, et qui donc serait équitable; si moi, je ne l'étais pas! Tu aurais certainement beaucoup perdu si je n'étais pas équitable\". 'Omar Ibn Al-Khattâb dit : \"Ô Envoyé de Dieu! Laisse-moi tuer cet hypocrite!\". Mais le Prophète dit : \"A Dieu ne plaise qu'on dit de moi que j'assassine mes compagnons. Cet homme et les siens récitent le Coran sans que sa récitation ne dépasse leur gosier (sans en avoir de récompense) et abandonneront précipitamment l'Islam comme une flèche qui perce un gibier et sort de l'autre côté",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": "1063.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": "1064.01",
			"text": "D'après Abou Sa'îd Al-Khoudri (que Dieu l'agrée), 'Ali (que Dieu l'agrée), étant au Yémen, envoya de l'or brut à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) qui le partagea entre quatre hommes : Al-'Aqra' Ibn Hâbis Al-Hanzalî, 'Uyayna Ibn Badr Al-Fazârî, 'Alqama Ibn 'Ulâtha Al-'Amirî. Puis, il en donna à l'un des Banû Kilâb, à Zayd Al-Khayr At-Tâ'î et à l'un des Banû Nabhân. Les Qoraychites en furent très irrités et lui dirent : \"Comment donnes-tu aux chefs de Nedjd et tu nous prives?\". Le Prophète (paix et bénédiction de Dieu sur lui) répliqua : \"Je ne fais cela que dans le but de gagner leurs cœurs à l'Islam\". Alors un homme ayant la barbe touffue, les pommettes saillantes, les yeux creux, le front accusé et la tête rasée, vint lui dire : \"Ô Muhammad! Crains Dieu!\". L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) lui répondit : \"Qui donc obéirait à Dieu si moi je Lui désobéissais? Dieu m'a confié tous les gens de la terre, et vous n'avez pas confiance en moi?\". Quand l'homme s'en alla, l'un des fidèles (on raconte qu'il s'agit de Khâlid Ibn Al-Walîd) demanda l'autorisation de le tuer. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dit : \"De la descendance de cet homme, naîtront des gens qui réciteront le Coran sans qu'il ne dépasse leur gosier, qui tueront les musulmans, qui laisseront en vie les idolâtres et qui abandonneront précipitamment l'Islam comme une flèche qui perce un gibier et sort de l'autre côté. Si je vis encore à cette époque, je les mettrai à mort comme les 'Ad. Incitation à tuer les \"Kharijites",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": "1064.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": "1064.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": "1064.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": "1064.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": "1064.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": "1065.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": "1065.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": "1065.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": "1065.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": "1065.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": "1066.01",
			"text": "Sawayd Ibn Ghafala (que Dieu l'agrée) a dit : J'ai entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dire : \"A la fin des temps, viendront de jeunes gens faibles d'esprit qui répéteront quelques-unes des meilleures paroles de l'humanité; mais qui pourtant réciteront le Coran sans que sa récitation ne dépasse leur gosier (sans en avoir de récompense) et abandonneront précipitamment l'Islam comme une flèche perce un gibier et sort de l'autre côté. Partout où vous les trouverez, tuez-les; car, leur meurtre vaudra, au Jour de la Résurrection, une récompense à celui qui l'a commis\". Les \"Kharijites\" sont les pires des créatures",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": "1066.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": "1066.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": "1066.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": "1066.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": "1066.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": "1066.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": "1067",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": "1068.01",
			"text": "Yusayr Ibn 'Amr a demandé à Sahl Ibn Hunayf s'il avait entendu le Prophète (paix et bénédiction de Dieu sur lui) citer les Kharijites. Sahl lui répondit : Je l'ai entendu dire, en dirigeant sa main vers l'Orient : \"De là sortiront des gens qui réciteront le Coran du bout de leurs langues, sans que sa récitation ne dépasse leur gosier; ils abandonneront précipitamment l'Islam comme une flèche perce un gibier et sort de l'autre côté\". Prohibition à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) de s'approprier les biens de l'aumône légale (Az-Zakâ), ainsi qu'à sa famille : les Banû Hâchim et les Banû 'Abd Al-Muttalib",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": "1068.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": "1068.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": "1069.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), Al-Hasan Ibn 'Alî prit une des dattes destinées aux aumônes et la mit dans sa bouche. - \"Arrête! Arrête et jette-la, s'écria le Prophète (paix et bénédiction de Dieu sur lui) en ajoutant : \"Ne sais-tu pas que, nous ne mangeons guère de ce qui est destiné à l'aumône?",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": "1069.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": "1069.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": "1070.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Quand je rentre chez moi, que je trouve une datte tombée sur mon lit et que je la prends pour la manger; je crains qu'elle ne fasse partie de ce qu'avait été destiné à l'aumône et je la rejette tout de suite",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": "1070.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": "1071.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": "1071.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": "1071.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": "1072.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": "1072.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 2483,
			"arabicnumber": "1073.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": "1073.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": "1074.01",
			"text": "Selon Anas (que Dieu l'agrée), Barîra offrit comme cadeau au Prophète (paix et bénédiction de Dieu sur lui) de la viande qui lui avait été donnée en aumône. - \"Cette viande, dit le Prophète, est une aumône pour elle et un cadeau pour nous",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": "1075.01",
			"text": "Aïcha (رضي الله عنها) a dit : Le Prophète (paix et bénédiction de Dieu sur lui) reçut comme cadeau de la viande de bœuf. - \"C'est de l'aumône faite à Barîra \", dit-on. - \"C'est une aumône pour elle et un cadeau pour nous\", répondit-il",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": "1075.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": "1075.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": "1075.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": "1076",
			"text": "Umm 'Atiyya (رضي الله عنها) a dit : Le Prophète (paix et bénédiction de Dieu sur lui) m'a donné une brebis en aumône; alors, j'en ai envoyé un morceau à 'Aïcha. Quand il entra chez 'Aïcha, le Prophète (paix et bénédiction de Dieu sur lui) dit : \"Avez-vous quelque chose (à manger)?\". Elle répondit : \"Non, excepté ce morceau de la brebis provenant de l'aumône faite à Nusayba que celle-ci nous a envoyés\". - \"Apporte-le, reprit le Prophète, il est arrivé à sa place\". Le Prophète (paix et bénédiction de Dieu sur lui) a accepté le cadeau et a refusé l'aumône légale",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": "1077",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": "1078.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": "1078.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": "989.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 231
			}
		}
	]
}