{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3743,
			"arabicnumber": "1492.01",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": "1492.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": "1492.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": "1493.01",
			"text": "Sa'îd Ibn Jubayr a dit : Pendant le gouvernement de Mus'ab, on m'a interrogé au sujet des conjoints qui doivent - l'épouse étant accusée d'adultère - se lancer les serments d'anathème; prononcera-t-on la séparation entre eux? Comme je ne savais pas comment répondre, je me rendis chez Ibn 'Omar à La Mecque. Là-bas, je dis au serviteur : \"Demande-moi la permission d'entrer\". - \"Mais il fait la sieste!\", répondit-il. - \"Ibn Jubayr, c'est toi?\", s'enquit de l'intérieur mon hôte qui eut reconnu ma voix. - \"Oui\", répondis-je. - \"Entre donc! Par Dieu, à une telle heure, ce n'est qu'une question urgente qui t'a amené ici\". Quand je fus entré, je trouvai Ibn 'Omar étendu sur un bât et se servant d'un oreiller bourré de fibres de palmiers. - \"Abou 'Abdourrahmân!, demandai-je, les époux qui prononcent les serments d'anathème (pour confirmer ou dénier l'acte d'adultère), doivent-ils se séparer?\" - Gloire et pureté à Dieu! Oui! Cette question a été posée la première fois au Prophète par untel Ibn untel; celui-ci s'était exprimé comme suit : Ô Envoyé de Dieu, que penses-tu du mari qui voit sa femme commettre le grand péché (d'adultère)? Ce serait une affaire épineuse et pesante, aussi difficile à en parler qu'à la laisser passer sous silence! - Le Prophète (paix et bénédiction de Dieu sur lui) garda le silence et s'abstint de répondre. Plus tard, l'homme vint trouver le Prophète et lui dit : Me voici éprouvé personnellement par la même question sur laquelle je m'enquérais auparavant! - Des versets traitant cette cause furent révélés dans la sourate An-Nûr : Et quant à ceux qui lancent des accusations contre leurs propres épouses,... Le Prophète récita ces versets à l'homme et procéda à calmer sa révolte par les conseils et le rappel des prescriptions et des recommandations divines. Il lui fit savoir que le châtiment de l'ici-bas est beaucoup moins pénible que celui de l'au-delà -'Non, par Celui qui t'a envoyé avec la Vérité, je n'ai point menti sur son compte', dit l'homme. Le Prophète fit ensuite venir la femme accusée d'adultère, l'exhorta de même, lui rappela les prescriptions et les recommandations divines et l'avisa que le châtiment de l'ici-bas est beaucoup moins pénible que celui de l'au-delà. 'Non, par Celui qui t'a envoyé avec la Vérité, il est menteur', s'exprima-t-elle. Le Prophète commença, alors, par l'époux : celui-ci fit une quadruple attestation par Dieu qu'il est du nombre des véridiques et la cinquième est que la malédiction de Dieu tombe sur lui s'il est du nombre des menteurs. A son tour, la femme atteste quatre fois par Dieu qu'il (son mari) est certainement du nombre des menteurs et la cinquième (attestation) est que la colère de Dieu soit sur elle, s'il était du nombre des véridiques. Le Prophète prononça enfin la séparation des deux conjoints",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": "1493.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": "1493.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": "1493.04",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": "1493.05",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": "1493.06",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": "1494.01",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": "1494.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": "1494.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": "1495.01",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": "1495.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": "1496",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": "1497.01",
			"text": "Ibn 'Abbâs (رضي الله عنهما) a dit : Comme on fit mention de l'anathème proférée réciproquement par les deux époux quand la femme est accusée d'adultère, en présence du Prophète (paix et bénédiction de Dieu sur lui), 'Asim Ibn 'Adî dit quelque chose à ce sujet, puis partit. Un homme de sa tribu vint alors le trouver et se plaignit d'avoir trouvé un homme avec sa femme. \"Cette épreuve, lui dit ne m'arrive qu'à cause de ce que j'ai dit\". Puis, il l'emmena chez le Prophète (paix et bénédiction de Dieu sur lui) à qui le mari raconta dans quelle situation il avait trouvé sa femme. Or cet homme avait le teint très jaune, le corps maigre et les cheveux lisses tandis que celui qu'il prétendait avoir trouvé chez sa femme était corpulent, brun et fort en chair. \"Grand Dieu, s'écria le Prophète (paix et bénédiction de Dieu sur lui), fais éclater la vérité!\" La femme accoucha d'un enfant qui ressemblait à l'homme que le mari avait dit avoir trouvé chez sa femme. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) leur fit prononcer les serments d'anathème. Un homme qui se trouvait à cette réunion dit à Ibn 'Abbâs : \"La femme en question n'est-elle pas celle à propos de laquelle le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Si jamais j'avais dû faire lapider quelqu'un sans preuve, c'eût été cette femme-là\". - \"Non, répondit Ibn 'Abbâs, il s'agissait d'une femme qui scandalisait l'Islam par sa conduite",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": "1497.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": "1497.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": "1498.01",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": "1498.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": "1498.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": "1499.01",
			"text": "D'après Al-Mughîra Ibn Chu'ba (que Dieu l'agrée), Sa'd Ibn 'Ubâda a dit : \"Si je trouvais un homme avec ma femme, je le frapperais de mon sabre et pas avec le plat de la lame\". L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), ayant eu connaissance de ces propos, dit : \"Vous êtes étonnés de la jalousie de Sa'd? Par Dieu, je suis plus jaloux que lui et Dieu est encore plus Jaloux que moi. C'est à cause de Sa jalousie que Dieu a interdit les turpitudes aussi manifestes que secrètes. Nul être n'est plus jaloux que Dieu. Personne n'aime autant que Dieu l'excuse et c'est à cause de cela qu'Il a envoyé des Prophètes pour promettre des récompenses et menacer de châtiments. Personne n'aime plus que Lui la louange et c'est pour cela que Dieu a promis le Paradis",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": "1499.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": "1500.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), un homme des Banû Fazâra vint trouver le Prophète (paix et bénédiction de Dieu sur lui) et lui dit : \"Ma femme a accouché d'un enfant noir\". - \"As-tu des chameaux?\", demanda le Prophète (paix et bénédiction de Dieu sur lui). - \"Oui\", répondit l'homme. - \"Et de quelle couleur sont-ils?\", ajouta le Prophète. - \"Roux\", répliqua l'homme. - \"Y en a-t-il parmi eux de gris?\", reprit le Prophète. - \"Oui\", dit l'homme. - \"Et comment cela se fait-il?\", demanda le Prophète. - \"Peut-être est-ce un phénomène d'atavisme\", reprit l'homme. - \"Alors, répliqua le Prophète, peut-être en est-il de même pour ton fils\". L'authentique de Mouslim 20 - Affranchissement",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": "1500.02",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": "1500.03",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": "1500.04",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		}
	]
}