{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4519,
			"arabicnumber": "1730.01",
			"text": "Abdoullâh Ibn 'Omar (رضي الله عنهما) a dit : \"D'après Nâfi`, le Prophète (paix et bénédiction de Dieu sur lui) fit une expédition contre les Banû Al-Mustaliq et les surprit au moment où ils abreuvaient leurs troupeaux; il tua un certain nombre de combattants et emmena quelques captifs; ce fut ce jour-là que le Prophète captiva Juwayriya. C'est 'Abdoullâh Ibn 'Omar qui faisait partie de cette expédition, qui m'a transmis ce hadîth\". Ordre de faciliter les choses pour ne pas dégoûter les gens de la religion",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": "1730.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": "1731.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": "1731.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": "1732",
			"text": "D'après Abou Moûsa (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) disait à ceux parmi ses compagnons qu'il envoyait en mission : \"Promettez aux gens (la bonne récompense) et ne les dégoûtez pas (de la religion), facilitez-leur et ne leur créez pas de difficultés",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": "1733.01",
			"text": "D'après Anas (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Facilitez aux gens et ne leur créez pas de difficultés; attachez-les (à l'Islam) et ne les en dégoûtez pas\". Interdiction de la trahison",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": "1733.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": "1734",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": "1735.01",
			"text": "D'après Ibn 'Omar (رضي الله عنهما), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Au Jour de la Résurrection, quand Dieu rassemblera les premiers et les derniers, on hissera un drapeau pour marquer chaque traître et on dira : Ceci est la trahison d'untel, fils d'untel",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": "1735.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": "1735.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": "1735.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": "1736.01",
			"text": "D'après `Abdoullah Ibn Mas'oûd (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Au Jour de la Résurrection, on hissera un drapeau pour marquer chaque traître et on dira : Voici la trahison d'untel",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": "1736.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": "1736.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": "1737",
			"text": "D'après Anas (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Au Jour la Résurrection, tout traître sera désigné par un drapeau\". Le stratagème dans la guerre",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": "1738.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": "1738.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": "1739",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": "1740",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": "1741",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": "1742.01",
			"text": "D'après `Abdoullah Ibn 'Abî 'Awfâ (que Dieu l'agrée), Abou An-Nadr rapporte qu'un homme de la tribu de 'Aslam, `Abdoullah Ibn 'Abî 'Awfâ, écrivit à `Umar Ibn `Ubayd-Dieu au moment où ce dernier allait partir contre Al-Harûriyya, (une des sectes des Kharidjites), lui disant : Lors l'une de ses batailles menées contre l'ennemi, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) se leva, lors du déclin du soleil, au milieu des musulmans et leur dit : \"Ô gens, ne souhaitez pas la rencontre de l'ennemi et demandez plutôt à Dieu la paix; mais, si vous le rencontrez, montrez de l'endurance et sachez que le Paradis est à l'ombre des sabres\". Puis il ajouta : \"Ô mon Seigneur! Toi qui as révélé le Livre Saint, qui as fait courir les nuages au ciel, qui as mis les Coalisés en déroute, mets l'ennemi en déroute et apporte-nous la victoire sur eux!\" Interdiction de tuer les femmes et les enfants pendant la guerre",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": "1742.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": "1742.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": "1742.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": "1743",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": "1744.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": "1744.02",
			"text": "D'après 'Abdoullâh Ibn 'Omar (رضي الله عنهما), on trouva une femme tuée dans l'une des batailles du Prophète (paix et bénédiction de Dieu sur lui). L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) réprouva alors le meurtre des femmes et des enfants. Tuer les femmes et les enfants la nuit, sans le faire exprès",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": "1745.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": "1745.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": "1745.03",
			"text": "As-Sa`b Ibn Jaththâma (رضي الله عنهما) a dit : Le Prophète (paix et bénédiction de Dieu sur lui), interrogé au sujet des femmes et des enfants des polythéistes qui sont tués (involontairement) dans une attaque nocturne (menée par les musulmans), dit : \"Ils font partie d'eux\" (c.-à-d., vous n'avez pas de tort de les avoir tuer involontairement). Permission de couper les arbres des infidèles et de les brûler",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": "1746.01",
			"text": "D'après 'Abdoullâh Ibn 'Omar (رضي الله عنهما), le Prophète (paix et bénédiction de Dieu sur lui) fit brûler et couper les palmiers d' Al-Buwayra, une palmeraie appartenant à Banû An-Nadîr. Qutayba et Ibn Rumh ajoutent : \"C'est à cette occasion que Dieu, l'Exalté, révéla le verset suivant : Tout palmier que vous avez coupé ou que vous avez laissé debout sur ses racines, c'est avec la permission de Dieu et afin qu'Il couvre ainsi d'ignominie les pervers\". Les butins sont licites à la communauté musulmane",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": "1746.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": "1746.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Un des Prophètes partit en expédition et dit à son peuple : \"Que ne me suivent pas : celui qui a contracté mariage et ne l'a pas encore consommé et qui désire le faire; celui qui a construit une maison dont il n'a pas encore élevé le toit et celui ayant acheté des brebis ou des chamelles pleines, attend qu'elles mettent bas\". Puis, il partit et, étant arrivé près d'un village à l'heure de la prière de `asr, ou tout près de cette heure, il dit au soleil : \"Toi, soleil, tu es ordonné par Dieu ainsi que moi. Ô mon Seigneur! Retiens-le dans sa course, qu'il nous éclaire\". Le soleil fut alors arrêté, jusqu'à ce que Dieu eut donné la victoire à Son Prophète. La bataille terminée, les hommes rassemblèrent ce qu'ils avaient gagné comme butin et voulurent le sacrifier en le mettant au feu, mais le feu ne le dévora pas, alors le Prophète s'écria : \"Il y a eu de la fraude parmi vous; qu'un homme de chaque tribu vienne me prêter serment (en lui touchant la main)!\". Or la main d'un homme resta collée à la sienne et le Prophète s'écria : \"Il y a certains parmi vous qui ont fraudé le butin; que chaque homme de cette tribu vienne me prêter serment (en lui touchant la main)!\" Or les mains de deux ou de trois hommes restèrent collées à la main du Prophète. - \"C'est bien vous qui avez fraudé le butin!\", s'écria-t-il. Alors ces hommes lui apportèrent une tête de bœuf en or et la déposèrent part-terre avec le reste du butin et le feu dévora le tout. L'Envoyé de Dieu ajouta : \"Ainsi, la consommation des butins n'a jamais été rendue licite à aucune nation avant nous; c'est que Dieu, que soient exaltées Sa toute puissance et Sa grandeur, a vu notre faiblesse et notre impuissance nous les a rendus bons\". Butin",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": "1748.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": "1748.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": "1749.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": "1749.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": "1749.03",
			"text": "D'après Ibn 'Omar (رضي الله عنهما), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) envoya dans la direction du Nedjd un détachement dont je fis partie. Cette troupe ayant capturé de nombreux chameaux, la part de chaque homme s'éleva à onze ou douze chameaux; et, (à titre de gratification) hors part, chacun reçut encore un chameau. Celui qui tue (un ennemi) a droit à ses dépouilles",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": "1749.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": "1749.05",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": "1750.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": "1750.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": "1750.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": "1751.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": "1751.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "Abou Qatâda (que Dieu l'agrée) a dit : L'année de Hunayn, nous partîmes avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). Au moment de la rencontre avec l'ennemi, il y eut du désordre parmi les musulmans. Je vis alors un des polythéistes qui allait tuer un musulman. Je me détournai vers lui et, m'approchant par derrière, lui déchargeai un coup de sabre sur l'artère de l'épaule. Cet homme se retourna alors contre moi, me serra dans ses bras au point que je me crus perdu. Mais ce fut lui qui tomba mort et alors, il me lâcha. Comme je rejoignis `Umar Ibn Al-Khattâb, il me dit : \"Qu'ont donc les hommes?\". - \"C'est l'ordre de Dieu\", lui répondis-je. Les musulmans revinrent et le Prophète (paix et bénédiction de Dieu sur lui) s'assit et dit : \"Que celui qui a tué un ennemi et qui peut en fournir la preuve, s'empare de ses dépouilles\". Je me demandai vainement qui pourrait fournir une preuve en ce qui me concernait et m'assis. Le Prophète répéta ce qu'il avait déjà dit une première, puis une seconde fois. A chaque fois, je me levai et je me demandai qui pourrait témoigner en ma faveur et comme ce fut en vain, je m'assis. A la troisième fois, le Prophète (paix et bénédiction de Dieu sur lui) me dit : \"Qu'as-tu donc, ô Abou Qatâda?\". Je lui racontai mon aventure. - \"Il dit vrai, déclara un homme, les dépouilles du mort sont chez moi, donne-lui-en la valeur pour que je les garde\". - \"Non, par Dieu! Il n'en sera pas ainsi, s'écria Abou Bakr, le Prophète n'ira pas délibérément faire tort à un des lions de Dieu qui combattent dans le sentier de Dieu et Son Prophète et te donner les dépouilles conquises par lui!\". - \"Tu as raison\", répondit le Prophète et, s'adressant à l'homme, il lui enjoignit de me remettre les dépouilles. L'homme me les donna et, avec leur prix, j'achetai un jardin chez les Banû Salima. Ce fut le premier bien que j'acquis depuis mon entrée en Islam",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": "1752",
			"text": "Abdourrahmân Ibn 'Awf (que Dieu l'agrée) a dit : Etant dans le rang le jour de Badr, et regardant à ma droite et à ma gauche, je m'aperçus que j'avais à mes côtés deux 'Ansâr, encore tout jeunes. Je souhaitai me trouver entre des voisins plus solides au combat; mais l'un d'eux, en me faisant signe de l'œil, me dit : \"Mon oncle, est-ce que tu connais Abou Jahl?\". - \"Oui, fils de mon frère, lui répondis-je, et que lui veux-tu?\". - \"On m'a dit, reprit-il, qu'il avait injurié l'Envoyé de Dieu; par Celui qui tient mon âme entre Ses mains, si je le vois, mon ombre ne quittera la sienne jusqu'à ce que je le tue ou que lui me tue\". Je m'étonnai fort de ce langage, lorsque mon autre voisin me fit signe de l'œil et me tint les mêmes propos, je ne tardai pas à apercevoir Abou Jahl qui tournoyait dans la mêlée. - \"Eh bien!, dis-je aux jeunes hommes, voilà votre homme, celui que vous cherchez\". Ils volèrent vers lui et le sabrèrent à mort. Puis, ils se rendirent auprès du Prophète et l'informèrent de leur exploit. - \"Lequel de vous l'a tué?\", leur demanda-t-il. - \"C'est moi!\", répondirent-ils tous deux. - \"Avez-vous essuyé vos sabres?\", reprit-il. Ils dirent que non. Alors il regarda leurs sabres et leur dit : \"Vous l'avez tué, tous les deux; mais ses dépouilles appartiennent à Mu`âdh Ibn `Amr Ibn Al-Jamûh\". En effet, les deux hommes étaient Mu`âdh Ibn `Amr Ibn Al-Jamûh et Mu`âdh Ibn `Afrâ'. (le sabre de Mu`âdh Ibn `Amr Ibn Al-Jamûh portait des traces du contenu de l'abdomen, attestant que c'était lui qui avait achevé le meurtre tandis que l'autre n'avait fait que blesser Abou Jahl)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": "1753.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": "1753.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": "1754",
			"text": "D'après Salama Ibn Al-'Akwa` (que Dieu l'agrée) : C'était pendant notre expédition des territoires de Hawâzin avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) que l'incident suivant se produisit : Un homme en selle d'un chameau roux arriva alors que nous déjeunions avec le Prophète. Il fit baraquer la bête, tint l'une de ses brides et le fit attacher quelque part pour aller manger avec les fidèles. Pendant le repas, il ne cessa de regarder ici et là (pour sonder la force de notre armée). Or, nos points faibles furent dans le dos de l'armée; et également dans le fait que certains d'entre nous étaient sans montures. L'homme s'en alla après un instant en courant. Il relâcha son chameau, le fit accroupir pour monter dessus, puis le releva et partit. Ainsi, l'un des fidèles monta-t-il une chamelle de couleur grisâtre et le suivit. - \"Je courus à sa poursuite, raconte Salama, et j'arrivai d'abord à la cuisse du chameau (de cet espion) puis aux brides dont je saisis une corde. Je fis baraquer le chameau et, dès qu'il mit bas les genoux, je dégainai mon sabre et frappai la tête de l'homme qui, sur-le-champ, tomba. Je ramenai à notre camp le chameau de l'espion ainsi que les vivres et armes dessus. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et les autres me reçurent. - \"Qui a tué l'homme?\", demanda le Prophète. - \"C'est Ibn Al-'Akwa` \", répondit-on. Et le Prophète de dire : \"Toutes les dépouilles lui appartiennent\". Le butin obtenu sans hostilités",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": "1755",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": "1756",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": "1757.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": "1757.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": "1757.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": "1757.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": "1758",
			"text": "D'après 'Aïcha (رضي الله عنها), à la mort du Prophète (paix et bénédiction de Dieu sur lui), ses femmes voulaient envoyer `Uthmân Ibn `Affân réclamer à Abou Bakr leur part dans l'héritage laissé par le Prophète (paix et bénédiction de Dieu sur lui). - \"Le Prophète, leur fit observer 'Aïcha, n'a-t-il donc pas dit : On n'hérite pas de nous; ce que nous laissons doit être dépensé en aumône",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": "1759.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": "1759.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": "1759.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": "1760.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Que mes héritiers ne partagent même pas un dinar de ma succession. Ce que je laisserai, après prélèvement de l'entretien de mes femmes (car elles ne devraient pas se remarier jusqu'à leur mort) et de l'indemnité de mon domestique, devra être dépensé en charité\". Manière de partager le butin entre ceux qui sont présents",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": "1760.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": "1761",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": "1762.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": "1762.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": "1763",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) envoya une cavalerie du côté du Nedjd. Elle ramena un homme des Banû Hanîfa, nommé Thumâma Ibn `Uthâl, chef d'Al-Yamâma. On l'attacha à l'un des piliers de la mosquée. Le Prophète (paix et bénédiction de Dieu sur lui) alla le trouver et lui dit : \"Que penses-tu maintenant ô Thumâma?\". - \"Tout ce qui est bien, ô Muhammad, répondit-il, si tu me tues, tu auras fait périr un homme dont le sang sera vengé; si tu me fais grâce, tu auras fait grâce à un homme reconnaissant et si tu veux de l'argent, tu obtiendras ce que tu voudras\". Le Prophète (paix et bénédiction de Dieu sur lui) le laissa et, le lendemain, il revint lui dire : \"Que penses-tu maintenant, ô Thumâma?\". - \"Ce que je t'ai déjà dit\", répondit-il; et il lui répéta ce qu'il lui a dit la veille. Le Prophète (paix et bénédiction de Dieu sur lui) le laissa de nouveau et, le lendemain, il revint et lui répéta : \"Que penses-tu maintenant, ô Thumâma?\". - \"Ce que je t'ai déjà dit\", répondit-il. - \"Qu'on mette Thumâma en liberté!\", s'écria le Prophète (paix et bénédiction de Dieu sur lui). Il (Thumâma) se rendit aussitôt à un enclos de dattiers voisin de la mosquée, se lava et revint à la mosquée où il prononça ces mots : \"J'atteste qu'il n'y a d'autre divinité que Dieu et j'atteste que Muhammad est le serviteur de Dieu et Son Envoyé. Par Dieu, ô Muhammad, jusqu'ici aucun visage d'homme sur terre ne m'était plus odieux que le tien, mais maintenant ton visage est celui de tous que j'aime le mieux. Par Dieu, aucune religion ne m'était plus odieuse que ta religion et maintenant ta religion est celle que j'aime le plus. Par Dieu, aucune ville ne m'était plus odieuse que ta ville et maintenant nulle ville ne me plaît autant que la tienne. Tes cavaliers m'ont pris au moment où je voulais faire la `Umra, que penses-tu que je devrai faire?\". Le Prophète (paix et bénédiction de Dieu sur lui) le félicita et lui enjoignit de faire la `Umra. Quand il arriva à La Mecque, quelqu'un lui dit : \"Tu as changé ta religion?\". - \"J'ai embrassé l'Islam avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), répondit-il; et maintenant, jamais, non jamais, par Dieu, vous ne recevrez un grain de froment d' Al-Yamâma, sans que le Prophète (paix et bénédiction de Dieu sur lui) en ait donné l'autorisation\". Expulsion des juifs du Hedjaz",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": "1764.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": "1765",
			"text": "Abou Hourayra (que Dieu l'agrée) a dit : Un jour que nous étions à la mosquée, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) sortit de chez lui et dit : \"Allons chez des juifs\". Nous nous mîmes en route avec le Prophète et quand nous arrivâmes chez les juifs, le Prophète (paix et bénédiction de Dieu sur lui) les interpella en ces termes : \"Ô troupe de juifs! Embrassez l'Islam et vous trouverez le salut\". - \"Ô Abou Al-Qâsim, tu as rempli ta mission\", répondirent-ils. - \"C'est là ce que je désire (qu'ils admettent que le Prophète a rempli sa mission), reprit l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui); embrassez l'Islam et vous trouverez le salut\". - \"Tu as rempli ta mission, ô Abou Al-Qâsim \", répétèrent les juifs. - \"C'est là ce que je désire\", dit de nouveau l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et il répéta une troisième fois ce qu'il avait dit et ajouta : \"Sachez que la terre n'appartient qu'à Dieu et à Son envoyé et que je veux vous expulser du territoire que vous occupez. Que celui de vous qui possède quelque bien le vende. Sinon sachez bien que la terre n'appartient qu'à Dieu et à Son envoyé",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": "1766.01",
			"text": "Ibn 'Omar (رضي الله عنهما) a dit : Les juifs des Banû An-Nadîr et des Banû Qurayza ayant attaqué le Prophète (paix et bénédiction de Dieu sur lui), celui-ci expulsa les Banû An-Nadîr, mais maintint les Banû Qurayza par mesure de faveur jusqu'au jour où, ceux-ci l'ayant de nouveau attaqué, il mit alors à mort leurs hommes et partagea leurs enfants, leurs femmes et leurs biens entre les musulmans. Toutefois quelques gens des Banû Qurayza se rallièrent au Prophète (paix et bénédiction de Dieu sur lui) qui leur accorda la sécurité et ils se convertirent à l'Islam. Le Prophète expulsa de Médine tous les juifs : ceux de la tribu des Banû Qaynuqâ`, ceux de la tribu des Banû Hâritha et tous les juifs de Médine. Permission de tuer celui qui viole un pacte et de soumettre ceux qui descendent de leurs forteresses à la sentence d'une personne équitable",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": "1766.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": "1767.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": "1767.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4596,
			"arabicnumber": "1768.01",
			"text": "Abou Sa'îd Al-Khoudri (que Dieu l'agrée) a dit : Les Banû Qurayza mirent leur sort à la sentence de Sa`d Ibn Mu`âdh. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) envoya chercher ce dernier. Sa`d arriva, porté sur un âne. Lorsqu'il approcha de la mosquée, l'Envoyé de Dieu dit aux 'Ansâr : \"Levez-vous devant votre maître (ou selon une variante : le meilleur d'entre vous)!\", puis il dit à Sa`d : \"Ces gens se remirent à ta sentence\". - \"Eh bien! Moi, je décide, répondit Sa`d, que les combattants d'entre eux soient mis à mort et que leurs femmes et leurs enfants soient captivés\". - \"Tu as rendu à leur encontre, dit alors le Prophète (paix et bénédiction de Dieu sur lui), la sentence même de Dieu (ou selon une variante : du Roi des cieux)\". Peut-être Ibn Al-Muthannâ a-t-il dit : \"Tu as rendu à leur encontre la sentence même du Roi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4597,
			"arabicnumber": "1768.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4598,
			"arabicnumber": "1769.01",
			"text": "D'après 'Aïcha (رضي الله عنها), Le jour du Fossé, un Qoraychite nommé Ibn Al-`Ariqa blessa Sa`d à la veine médiane du bras. Le Prophète (paix et bénédiction de Dieu sur lui) dressa pour Sa`d une tente dans la mosquée afin de n'avoir pas à aller loin pour le visiter. Quand le Prophète (paix et bénédiction de Dieu sur lui) revint de la bataille, il déposa son arme et commença à se laver; et alors qu'il nettoyait sa tête de poussière, Gabriel lui apparut et lui dit : \"Tu as déposé l'arme, mais par Dieu, nous ne l'avons pas posée. Sors; combats-les (les ennemis de l'Islam)\". - \"Où sont-ils?\", demanda alors le Prophète. Gabriel lui indiqua alors les Banû Qurayza. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) les combattit jusqu'à ce qu'ils se remirent leur sort à la sentence de l'Envoyé de Dieu; qui remit leur sort à la sentence de Sa`d. Celui-ci dit alors : \"Eh bien! Je décide que leurs combattants soient mis à mort et que leurs femmes et enfants soient captivés\". Initiative d'attaquer et accomplissement de la plus importante des obligations",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4599,
			"arabicnumber": "1769.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4600,
			"arabicnumber": "1769.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4601,
			"arabicnumber": "1769.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4602,
			"arabicnumber": "1770",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4603,
			"arabicnumber": "1771.01",
			"text": "Anas Ibn Mâlik (que Dieu l'agrée) a dit : Quand les Muhâjirûn, venus de La Mecque, arrivèrent à Médine, ils ne possédaient rien, tandis que les 'Ansâr avaient des terres et des palmerais. Chaque année, les 'Ansâr partagèrent chaque année avec eux la moitié des fruits de leurs biens, comme salaire de leur travail. La mère de Anas Ibn Mâlik, surnommée 'Umm Sulaym, était également la mère de `Abdoullah Ibn 'Abî Talha, celui-ci et Anas étaient donc des frères utérins. La mère de Anas ayant donné les fruits d'un palmier à l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), celui-ci les donna à son tour à son affranchie, 'Umm 'Ayman, la mère de 'Usâma Ibn Zayd. D'après Ibn Chihâb, Anas Ibn Mâlik m'a raconté que le Prophète (paix et bénédiction de Dieu sur lui), après avoir terminé le combat mené contre les gens de Khaybar, rentra à Médine. Alors les Muhâjirûn rendirent aux Ansâr leur dons et le Prophète (paix et bénédiction de Dieu sur lui) rendit à la mère de Anas les fruits de son palmier qu'elle lui avait donnés. Enfin l'Envoyé de Dieu donna à 'Umm 'Ayman, à la place (des fruits) de ces palmiers, des fruits de son propre clos (de Médine). Permission de manger de la nourriture du butin au cours de la bataille",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4604,
			"arabicnumber": "1771.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4605,
			"arabicnumber": "1772.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4606,
			"arabicnumber": "1772.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4607,
			"arabicnumber": "1773.01",
			"text": "Abou Sufyân (que Dieu l'agrée) a dit : Durant la période de trêve que j'ai (encore polythéiste) conclue avec l'Envoyé de Dieu, je partis en voyage. J'étais alors en Syrie, lorsqu'on apporta une lettre adressée de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) à Héraclius. Dihya Al-Kalbî avait été chargé de la remettre au gouverneur de Bossra, qui à son tour devait la remettre à Héraclius. Héraclius demanda alors : \"Y a-t-il quelqu'un qui soit proche de cet homme présumant être un Prophète?\". On lui répondit que oui. Sur ce, on me manda avec quelques-uns des Qoraychites. Nous entrâmes chez Héraclius et il nous fit asseoir devant lui en disant : \"Lequel d'entre vous est le plus proche de cet homme qui prétend être un Prophète?\". Abou Sufyân répondit : \"C'est moi\". On me fit alors asseoir devant lui et mes compagnons derrière moi. Puis il manda son interprète et lui dit : \"Dis-leur que je vais interroger cet homme au sujet de celui qui prétend être un Prophète, si cet homme ment, ses compagnons doivent relever ses mensonges\". Abou Sufyân dit (tout bas) : \"Par Dieu! Si je ne craignais pas d'être qualifié de menteur, j'aurais forgé des mensonges au sujet du Prophète\". Il (Héraclius) demanda à son interprète : \"Interroge-le : Quel rang occupe sa famille (du Prophète) parmi vous?\". Je répondis : \"Elle jouit d'une grande considération\". Puis il dit : \"L'un de ses ancêtres, était-il un roi?\". - \"Non\", répondis-je. - \"Le traitez-vous de menteur avant qu'il ait tenu de tels propos?\". - \"Non\". - \"Ceux qui le suivent, sont-ils des honorables ou des humbles?\". - \"Ils sont plutôt des humbles\". - \"Leur nombre s'accroît-il ou bien diminue?\". - \"Il s'accroît\". - \"Quelqu'un de ceux qui ont embrassé sa religion, l'a-t-il ensuite abandonnée en la répugnant?\". - \"Non, aucun\". - \"L'avez-vous combattu?\". - \"Oui\". - \"Quel a été le résultat de cette guerre entre vous et lui?\". - \"La guerre entre nous a eu des alternatives : tantôt il l'emporta et tantôt nous l'emportions\". - \"Trahit-il ses engagements?\". - \"Non, mais nous sommes en trêve avec lui et nous ignorons ce qu'il peut y faire\". Le transmetteur ajoute : Par Dieu, je n'ai pas pu insinuer un mot autre de ce que je viens de dire. Il (Héraclius) poursuivit : \"Y a-t-il quelqu'un autre que lui qui a déjà tenu de tels propos?\". - \"Non\". - \"Eh bien! Je t'ai demandé au sujet du rang de sa famille et tu as répondu qu'elle jouit d'une grande considération, ainsi sont les familles de tous les Prophètes qui l'ont devancé. Je t'ai demandé si quelqu'un de ses ancêtres était un roi et tu as présumé que non. Je me suis dit alors : si l'un de ses ancêtres avait régné, il aurait cherché le trône de ses ancêtres. Je t'ai ensuite questionné au sujet de ceux qui le suivent, tu as répondu qu'ils sont les humbles et en réalité, ils sont eux qui suivent toujours les Prophètes. Je t'ai également demandé si vous le traitiez de menteur avant qu'il ne tienne de tels discours, tu as prétendu que non et j'ai constaté que celui qui s'abstient de mentir aux hommes, tient forcément à ne pas mentir sur Dieu. Et lorsque je t'ai demandé si quelqu'un après avoir embrassé sa religion l'abandonna et la répugna, tu as répondu que non, ainsi est la foi quand elle pénètre les cœurs. Je t'ai aussi demandé si le nombre de ses adeptes augmente ou diminue, tu as répondu qu'il augmente, ainsi est la foi qui s'accroît jusqu'à ce qu'elle devienne parfaite. Je t'ai également demandé si vous avez mené la guerre contre lui, tu as répondu que vous l'avez combattu et que la guerre a eu des alternatives entre vous, tel est le cas de tous les Envoyés qui sont mis à l'épreuve mais qui, à la fin triomphent. Je t'ai demandé s'il trahit ses engagements et tu as répondu qu'il ne les trahit point, tel est le cas des Envoyés, ils tiennent à leurs engagements. Enfin, je t'ai demandé si quelqu'un avant lui a tenu de tels discours, tu as répondu que non et je me suis dit : si quelqu'un avant lui avait tenu les mêmes propos, donc il ne fait qu'imiter ses prédécesseurs\". Il (Héraclius) ajouta : \"Que vous ordonne-t-il donc?\". - \"Il nous ordonne de faire la prière (Salâ), de verser l'aumône légale (Az-Zakâ), de tenir les liens de parenté et d'être chastes\". - \"Si ce que tu viens de dire est vrai, il doit être un Prophète. De ma part, je savais qu'un Prophète apparaîtrait, mais je ne savais pas qu'il serait des vôtres. Et si je pouvais me rendre chez lui, j'aurais bien aimé sa rencontre. Enfin, si j'étais auprès de lui, j'aurais lavé ses pieds (par révérence) et il aurait dominé même la place où je mets mes pieds\". Puis il ordonna qu'on lui apporte la lettre de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et il la lut : \"Au nom de Dieu, le Tout Miséricordieux, le Très Miséricordieux. De Muhammad, l'Envoyé de Dieu à Héraclius le chef des Romains. Salut à quiconque suit la bonne voie. Ensuite, je t'appelle à l'islam. Convertis-toi à l'islam, tu trouveras le salut et Dieu te donnera une double récompense, mais si tu te détournes (de l'islam), tu seras chargé des péchés de ceux qui, de ton peuple, te suivront : Ô gens du Livre, venez à une parole commune entre nous et vous : que nous n'adorions que Dieu, sans rien Lui associer et que nous ne prenions point les uns les autres pour seigneurs en dehors de Dieu. Puis s'ils détournent le dos, dites : 'Soyez témoins que nous, nous sommes soumis. Le transmetteur (lui-même Abou Sufyân) ajoute : Lorsque Héraclius finit la lecture de la lettre, des voix s'élevèrent et un grand tumulte se produit dans son entourage et on nous fit sortir. Je dis alors à mes compagnons quand nous fûmes dehors : \"L'affaire d'Ibn Abou Kabcha (désignant ironiquement le Prophète) a pris de l'importance puisque le roi des Banû Al-'Asfar (les Romains) le redoute\". Et je ne cessai d'être convaincu que l'affaire de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) aille l'emporter jusqu'à ce que Dieu me fit embrasser l'Islam. Bataille de Hunayn",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4608,
			"arabicnumber": "1773.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4609,
			"arabicnumber": "1774.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4610,
			"arabicnumber": "1774.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4611,
			"arabicnumber": "1774.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4613,
			"arabicnumber": "1775.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4614,
			"arabicnumber": "1775.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4615,
			"arabicnumber": "1776.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4616,
			"arabicnumber": "1776.02",
			"text": "D'après Al-Barâ' (que Dieu l'agrée), un homme vint lui demander : \"Est-ce que vous avez pris la fuite, au jour de Hunayn, ô Abou `Umâra?\". - \"Non, par Dieu, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) n'a pas pris la fuite, mais il était arrivé que les plus jeunes et les plus pressés d'entre ses compagnons étaient sortis sans cuirasses et sans armes; ou bien ils étaient équipés à la légère. Ils allèrent du côté des archers habiles, gens des Hawâzin et des Banû Nasr, qui tiraient presque toujours juste. Ces gens leur envoyèrent une décharge de flèches qui ne pouvaient guère manquer le but. Alors les musulmans se portèrent au Prophète (paix et bénédiction de Dieu sur lui) qui chevauchait sa mule blanche, alors que Abou Sufyân Ibn Al-Hârith Ibn `Abd Al-Muttalib en tenait la bride. Le Prophète (paix et bénédiction de Dieu sur lui) descendit de sa monture, invoqua l'aide divine, puis il dit : \"C'est moi le Prophète, sans mensonge; c'est moi le fils de `Abd Al-Muttalib \"; puis il mit les musulmans en rangs. Bataille d' At-Tâ'if",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4617,
			"arabicnumber": "1776.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4618,
			"arabicnumber": "1776.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4619,
			"arabicnumber": "1777",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4620,
			"arabicnumber": "1778",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4621,
			"arabicnumber": "1779",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4623,
			"arabicnumber": "1780.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4624,
			"arabicnumber": "1780.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4625,
			"arabicnumber": "1781.01",
			"text": "Abdoullah Ibn Mas'oûd (que Dieu l'agrée) a dit : Quand le Prophète entra à La Mecque, - Ibn Abou `Umar ajouta : le jour de la Conquête -, il y avait autour de la Ka`ba trois cent soixante idoles. Du bout d'une baguette qu'il tenait à la main, il piqua chaque idole en disant : La Vérité (l'islam) est venue et l'Erreur a disparu. Car l'erreur est destinée à disparaître. La Vérité (l'islam) est venue. Et le Faux (la mécréance) ne peut rien commencer ni renouveler. Trêve d'Al-Hudaybiya",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4626,
			"arabicnumber": "1781.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4627,
			"arabicnumber": "1782.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4628,
			"arabicnumber": "1782.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4629,
			"arabicnumber": "1783.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4630,
			"arabicnumber": "1783.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4631,
			"arabicnumber": "1783.03",
			"text": "D'après Al-Barâ' Ibn `Azib (que Dieu l'agrée), lorsque le Prophète (paix et bénédiction de Dieu sur lui) conclut avec les polythéistes la trêve d'Al-Hudaybiya, `Alî Ibn 'Abî Tâlib se mit à consigner par écrit les conditions de l'arrangement; et il écrivit : \"Voici à quoi souscrit Muhammad, l'Envoyé de Dieu\". - \"Nous n'acceptons pas cette rédaction, déclarent les infidèles, car si nous savions que tu es bien l'Envoyé de Dieu, nous ne t'aurions pas combattu\". - \"Efface-le\", dit le Prophète à - \"Par Dieu! répondit ce dernier, je ne l'effacerai jamais\". Le Prophète (paix et bénédiction de Dieu sur lui) effaça alors de sa propre main les mots contestés. Une des conditions inscrites fut que les musulmans entrent à La Mecque pourvu qu'ils la quittent après trois jours et qu'ils ne portent en entrant aucune arme sauf les Julubbân. Comme je demandai à Abou 'Ishâq ce que signifie le mot Julubbân, il me répondit : \"Il s'agit du fourreau et de son contenu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4632,
			"arabicnumber": "1784",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4633,
			"arabicnumber": "1785.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4634,
			"arabicnumber": "1785.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4635,
			"arabicnumber": "1785.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4636,
			"arabicnumber": "1785.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4637,
			"arabicnumber": "1786.01",
			"text": "D'après Anas Ibn Mâlik (que Dieu l'agrée), comme les compagnons du Prophète étaient extrêmement chagrinés du retour d' Al-Hudaybiya et alors que le Prophète y avait fait immoler les bêtes du sacrifice, ces versets furent révélés : En vérité Nous t'avons accordé une victoire éclatante... Jusqu'à ...un énorme succès. Le Prophète dit alors à ses compagnons : \"Il m'a été révélé un verset qui m'est plus cher que ce monde et tout ce qu'il comporte\". Bataille de 'Uhud",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4638,
			"arabicnumber": "1786.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4639,
			"arabicnumber": "1787",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4640,
			"arabicnumber": "1788",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4641,
			"arabicnumber": "1789",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4642,
			"arabicnumber": "1790.01",
			"text": "D'après Sahl Ibn Sa`d (que Dieu l'agrée), comme on l'interrogea sur la blessure dont fut atteint le Prophète (paix et bénédiction de Dieu sur lui), à la bataille de 'Uhud, il répondit : \"L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) fut blessé au visage; il eut une dent incisive brisée, et son casque fracassé sur sa tête. Fâtima, la fille de l'Envoyé de Dieu lavait le sang de sa blessure, tandis que `Alî Ibn 'Abî Tâlib lui versait l'eau se trouvant dans le creux de son bouclier. Lorsque Fâtima vit que l'eau ne fait qu'augmenter le flot de sang, elle prit une natte, la brûla et, lorsque celle-ci fut calcinée, elle l'appliqua sur la blessure et alors le sang s'arrêta de couler",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4643,
			"arabicnumber": "1790.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4644,
			"arabicnumber": "1790.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4645,
			"arabicnumber": "1791",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4646,
			"arabicnumber": "1792.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4647,
			"arabicnumber": "1792.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4648,
			"arabicnumber": "1793",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "D'après Ibn Mas'oûd (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) faisait la prière auprès de la Maison Sacrée, alors que Abou Jahl et ses compagnons étaient assis non loin de lui. Comme on venait d'égorger un chameau la veille, Abou Jahl dit : \"Lequel d'entre vous pourra apporter le placenta de la chamelle des Banû tel et le mettra sur le dos de Muhammad, quand il se prosternera?\". Le plus malheureux d'entre eux se leva et apporta le placenta, puis il attendit que le Prophète (paix et bénédiction de Dieu sur lui) se prosternât et le mit sur son dos entre ses épaules. Ils éclatèrent de rire en se penchant les uns vers les autres. Quant à moi, ajouta le transmetteur, quoique j'aie assisté à cette scène, je n'ai pas pu agir; or si j'avais quelque force, j'aurai ôté ce placenta loin des épaules du Prophète (paix et bénédiction de Dieu sur lui). Le Prophète (paix et bénédiction de Dieu sur lui) demeura alors prosterné, alors qu'un homme alla prévenir Fâtima, encore très jeune, qui ne tarda pas à venir. Elle prit le placenta, le jeta loin de son père et se tournant vers les Qoraychites, elle les invectiva. Ayant terminé sa prière, le Prophète (paix et bénédiction de Dieu sur lui) leva sa voix en appelant les malédictions sur les Qoraychites. Quand il maudissait les impies, le Prophète avait l'habitude de le faire trois fois et quand il invoquait Dieu, il le faisait à trois reprises aussi; et c'était ainsi qu'il le fit ce jour-là : \"Grand Dieu! C'est à Toi de ruiner les Qoraychites\". Quand ils entendirent sa voix, les Qoraychites cessèrent de rire redoutant l'exaucement de son invocation. Le Prophète, quant à lui, poursuivit : \"Grand Dieu! Tire vengeance de Abou Jahl Ibn Hichâm, de `Utba Ibn Rabî`a, de Chayba Ibn Rabî`a, d'Al-Walîd Ibn `Uqba, de 'Umayya Ibn Khalaf, et de `Uqba Ibn 'Abî Mu`ayt\". Le transmetteur ajoute qu'il a mentionné un septième mais qu'il n'a pas retenu son nom et poursuit : \"Par Celui qui, par la Vérité, a envoyé Muhammad (paix et bénédiction de Dieu sur lui) j'ai vu tous ces gens-là morts le jour de la bataille de Badr et on les traîna jusqu'au puits de Badr",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4650,
			"arabicnumber": "1794.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4651,
			"arabicnumber": "1794.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4652,
			"arabicnumber": "1794.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4653,
			"arabicnumber": "1795",
			"text": "D'après 'Aïcha, femme du Prophète, (رضي الله عنها), elle lui demanda un jour : \"Y eut-il jamais pour toi une journée plus pénible que celle de la bataille de 'Uhud?\". - \"Certes, répondit-il, j'ai eu bien à souffrir de tes compatriotes, mais ce qui me fut le plus pénible de leur part, ce fut l'affaire d' Al-`Aqaba, lorsque, à l'exposé de mes demandes, Ibn `Abd Yâlîl Ibn `Abd Kulâl répondit par un refus total. Je me retournai, affligé ne sachant trop où diriger mes pas et ne recouvrai mes esprits qu'arrivé à Qarn Ath-Tha`âlib; et alors, levant la tête, voilà que je vis un nuage qui me couvrait de son ombre et, l'ayant considéré, voilà que dedans j'aperçus Gabriel qui m'appela et me dit : \"Dieu, l'Exalté, a bien entendu les propos de tes compatriotes et les réponses qu'ils t'ont faites; et il t'a envoyé l'Ange des montagnes pour que tu lui donnes, au sujet de ces infidèles, tel ordre qu'il te plaira\". L'Ange des montagnes, m'ayant appelé, me salua et me répéta ce qu'avait dit Gabriel : \"Ô Muhammad! Dieu a bien entendu les propos de tes compatriotes et les réponses qu'ils t'ont faites; et je suis l'Ange des montagnes et ton Seigneur m'a envoyé vers toi pour me dicter ton ordre à leur sujet. Désires-tu que je fasse replier sur eux les deux grandes montagnes qui dominent La Mecque?\". - \"Non, répondis-je, car du dos de ces impies, j'espère que Dieu fera sortir des fidèles qui L'adoreront Seul sans Lui donner d'associés",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4654,
			"arabicnumber": "1796.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4655,
			"arabicnumber": "1796.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4656,
			"arabicnumber": "1797.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4657,
			"arabicnumber": "1797.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4658,
			"arabicnumber": "1797.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4659,
			"arabicnumber": "1798.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4660,
			"arabicnumber": "1798.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4661,
			"arabicnumber": "1799",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4662,
			"arabicnumber": "1800.01",
			"text": "D'après Anas Ibn Mâlik (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit (après la bataille de Badr) : \"Qui de vous peut aller voir ce qui est arrivé à Abou Jahl?\". Ibn Mas'oûd partit alors et le trouva frapper à mort par les deux fils de `Afrâ'. Il le prit par sa barbe et lui dit : \"C'est toi Abou Jahl?\". Celui-ci répondit : \"Y a-t-il un homme plus noble que moi, que vous ayez tué?\". - ou suivant une variante : que les siens aient tué? - D'après le transmetteur, Abou Mijliz a ajouté : Abou Jahl a dit : \"Si seulement un autre qu'un lAboureur m'a tué!\" Meurtre de Ka`b Ibn Al-'Achraf, le tyran des juifs",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4663,
			"arabicnumber": "1800.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4664,
			"arabicnumber": "1801",
			"text": "D'après Jâbir Ibn 'Abdillâh (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Qui me débarrassera de Ka`b Ibn Al-'Achraf qui a mal agi envers Dieu et Son Envoyé?\". Muhammad Ibn Maslama répondit : \"Ô Envoyé de Dieu, veux-tu que je le tue?\". - \"Certes oui\", répliqua le Prophète. - \"Permets-moi alors de médire de toi devant lui\". - \"Dis ce que tu voudras\". Muhammad Ibn Maslama alla trouver Ka`b et lui dit : \"Cet homme (le Prophète) veut nous imposer de l'aumône légale qui dépasse nos moyens\". - \"Il vous demande encore cela?\", dit Ka`b, par Dieu, vous serez encore plus ennuyés de lui que vous l'êtes\". - \"Nous venons de le suivre et nous ne voulons pas le quitter avant de voir jusqu'où il nous mènera. Ainsi, je viens te demander de me prêter\". - \"Que me donneras-tu en gage?\". - \"Que veux-tu que je te donne?\". - \"Vos femmes!\". - \"Comment pourrions-nous te donner nos femmes en gage à toi qui es le plus bel homme des Arabes?\". - \"Eh bien! Vos fils\". - \"Comment pourrions-nous te donner, nos fils en gage? On pourrait leur reprocher qu'ils avaient été donnés en gage pour deux charges de dattes et ce serait une honte pour nous. Nous te donnerons plutôt nos armes en gage\". Muhammad Ibn Mas'oûd prit alors rendez-vous avec Ka`b et lui promit qu'Al-Hârith, Abou `Abs Ibn Jabr et `Ubad Ibn Bichr l'accompagneraient. La nuit les quatre hommes allèrent trouver Ka`b. Sufyân dit : Un autre transmetteur que `Amr rapporte que la femme de Ka`b lui a dit : \"Il me semble entendre un bruit comme celui de la voix d'un meurtrier\". - \"Ne t'en fais pas, lui répondit son mari, c'est Muhammad ibn Maslama, son frère de lait et Abou Nâ'ila. L'homme généreux répond à l'appel au secours fait de nuit, même si c'était au prix de sa vie\". Muhammad dit à ses compagnons : \"Quand il viendra, je m'approcherai de lui et lorsque je tiendrai bien sa tête entre mes mains, frappez-le\". Lorsque Ka`b descendit, en portant son arme, on lui dit : \"Nous sentons une très belle odeur!\" - \"Oui, répondit-il, ma femme est la plus parfumée des femmes arabes\". Muhammad lui dit ensuite : \"Me permets-tu de sentir?\". - \"Oui\", répliqua Ka`b. Après que Muhammad ait senti l'odeur, il lui dit : \"Me permets-tu de la sentir encore une fois?\". Et comme il disait cela, il tint la tête de Ka`b entre ses mains en s'écriant à ses compagnons : \"Il est à vous!\". Et, ils le tuèrent. Bataille de Khaybar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4665,
			"arabicnumber": "1365.07",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4666,
			"arabicnumber": "1365.08",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4667,
			"arabicnumber": "1365.09",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "Salama Ibn Al-Akwa` (que Dieu l'agrée) a dit : Nous partîmes avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) pour Khaybar et nous voyageâmes de nuit. Un des nôtres, s'adressant à `Amir Ibn Al-Akwa`, lui dit : \"Ne vas-tu pas nous faire entendre quelques-uns de tes vers?\". qui était poète, se mit aussitôt à entonner les vers suivant (pour divertir ses compagnons et pousser les chameaux à poursuivre leur démarche) : Seigneur, sans Toi nous n'aurions pas été dirigés dans la bonne voie. Nous n'aurions fait ni l'aumône ni la Salâ (prière). Pardonne-nous nos péchés, nous sommes prêts à sacrifier nos vies dans Ton sentier. Affermis nos pas à la rencontre de l'ennemi. Fais naître en nous la sérénité. Nous qui, quand on nous appelle dans Ta voie, nous accourons, pour Te satisfaire ô Dieu. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) demanda alors quel était le nom de l'improvisateur et comme on lui répondit que c'était il dit : \"Que Dieu lui fasse miséricorde!\". Un des nôtres dit alors : \"Ô Prophète, il sera donc martyr; si seulement vous ne deviez pas dire ces mots maintenant et qu'il aurait destiné à une vie plus longue!\". Le transmetteur ajoute : \"Nous gagnâmes Khaybar que nous assiégeâmes si longtemps que nous souffrîmes de la famine. Puis, Dieu nous rendit maîtres de l'endroit. Le soir du jour où nous entrâmes dans la ville, nous avions allumé de nombreux feux. - \"Pourquoi ces feux et pourquoi les avez-vous allumés?\", demanda le Prophète (paix et bénédiction de Dieu sur lui). - \"Pour faire rôtir de la viande\", répondit-on. - \"Quelle viande?\", demanda le Prophète. - \"De la viande d'ânes domestiques\". - \"Renversez les marmites et cassez-les\", dit l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). - \"Ô Envoyé de Dieu, dit un homme, si nous renversions les marmites seulement et les rincions sans les casser?\". - \"Eh bien, soit\", dit le Prophète. Quand les troupes furent rangées en bataille, avait un sabre court; comme il s'en servait pour frapper un juif, la pointe de la lame du sabre revint en arrière et atteignit le genou de qui mourut de cette blessure. - \"Comme nous revenions de Khaybar, dit Salama, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), me voyant silencieux et chagriné, me demanda ce que j'avais\". - \"Ô toi, pour qui je suis prêt à sacrifier la vie de mon père et celle de ma mère, est-il vrai, comme on le prétend, que perdra le fruit de son acte?\". - \"Et qui a dit cela?\", demanda le Prophète. - Je lui répondis : \"Untel, untel et 'Usayd Ibn Hudayr Al-Ansâri\". - \"Ceux qui ont dit cela, ont menti\", répliqua l'Envoyé de Dieu. - \"Il aura, ajouta-t-il en réunissant deux de ses doigts, une double récompense, car il a regroupé deux qualités : celle de quelqu'un qui a fait un grand effort pour satisfaire Dieu et lui obéir et celle de celui qui combat dans la voie de Dieu, peu d'Arabes en auraient fait autant\". Bataille des Coalisés, nommée également (du Fossé)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4670,
			"arabicnumber": "1803.01",
			"text": "Al-Barâ' (que Dieu l'agrée) a dit : Le jour du Fossé, le Prophète (paix et bénédiction de Dieu sur lui) transporta avec nous des déblais, au point que la poussière couvrit son ventre, en récitant ces vers : par Dieu! n'était Toi, nous ne serions pas dans la bonne voie, nous ne ferions ni l'aumône, ni la Salâ (prière). Fais descendre sur nous la sérénité, Car, notre religion, ceux-là (les infidèles) l'ont refusée, Car les chefs des impies ont refusé notre religion, quand ils cherchent la tentation (al-fitna), certes, nous dirons : Non! Et il appuyait sur le dernier mot, en élevant sa voix",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4671,
			"arabicnumber": "1803.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4672,
			"arabicnumber": "1804",
			"text": "Sahl Ibn Sa`d (que Dieu l'agrée) a dit : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) vint vers nous pendant que nous creusions le Fossé et que nous en transportions la poussière sur nos épaules et s'écria : \"Mon Seigneur, la seule vie, c'est celle de l'au-delà! Pardonne aux 'Ansâr et aux Muhâjirûn",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4673,
			"arabicnumber": "1805.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4674,
			"arabicnumber": "1805.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4675,
			"arabicnumber": "1805.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4676,
			"arabicnumber": "1805.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4677,
			"arabicnumber": "1806",
			"text": "Salama Ibn Al-'Akwa` (que Dieu l'agrée) a dit : Je partis avant qu'on appelât à la prière de fajr (l'aurore), les chamelles laitières de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) étaient au pâturage de \"Dhû Qarad\". Un serviteur de Abdourrahmân Ibn 'Awf me rencontra et me dit : \"On a pris les chamelles laitières de l'Envoyé de Dieu, (paix et bénédiction de Dieu sur lui)!\". - \"Qui les a prises?\", lui demandai-je - \"Des gens de Ghatfân\". Alors, à trois reprises, je me mis à pousser ce cri : \"Au secours!\" au point que je fis entendre les habitants des deux côtés (couvertes de pierres noires) de Médine, puis, je hâtai ma marche pour les rejoindre (les gens de Ghatfân) à Dhû Qarad où ils abreuvaient les animaux. Etant archer, je pris mon arc et je leur décrochai des flèches en m'écriant : \"C'est moi le fils d'Al-'Akwa`. Et c'est le dernier jour de la canaille\". Je réussis à leur reprendre les chamelles, et en plus je leur pris trente manteaux! A ce moment, le Prophète (paix et bénédiction de Dieu sur lui) arriva, accompagné d'une foule de gens et je lui dis : \"Ô Envoyé de Dieu, je les ai empêchés de boire et ils sont assoiffés. Envoie maintenant des hommes à leur poursuite\". - \"Ô Ibn Al-'Akwa`, répondit le Prophète, tu t'es comporté en maître, montre-toi donc pitoyable!\". Puis nous revînmes et l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) me prit en croupe sur sa chamelle jusqu'à notre entrée à Médine. Sortie des femmes en bataille avec les hommes",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4679,
			"arabicnumber": "1808",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4682,
			"arabicnumber": "1810",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4683,
			"arabicnumber": "1811",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4684,
			"arabicnumber": "1812.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4685,
			"arabicnumber": "1812.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4686,
			"arabicnumber": "1812.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4687,
			"arabicnumber": "1812.04",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4688,
			"arabicnumber": "1812.05",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4689,
			"arabicnumber": "1812.06",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4690,
			"arabicnumber": "1812.07",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4691,
			"arabicnumber": "1812.08",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4692,
			"arabicnumber": "1254.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4693,
			"arabicnumber": "1254.03",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4694,
			"arabicnumber": "1813",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4695,
			"arabicnumber": "1814.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4696,
			"arabicnumber": "1814.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4697,
			"arabicnumber": "1815.01",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4698,
			"arabicnumber": "1815.02",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4699,
			"arabicnumber": "1816",
			"text": "Abou Moûsa (que Dieu l'agrée) a dit : \"Nous partîmes en expédition avec le Prophète (paix et bénédiction de Dieu sur lui). Nous étions six et nous n'avions qu'un chameau, que nous montions à tour de rôle. Nous avions les pieds déchirés et, pour ma part, j'eus les pieds si abîmés que mes ongles tombèrent. Nous enveloppions nos pieds alors avec des chiffons, c'est pourquoi cette expédition fut dénommée Dhât Ar-Riqâ` (riqâ` signifie chiffons)\". L'authentique de Mouslim 33 - Commandement Suprématie des Qoraychites sur les gens pour le rang de califat, ce rang ne sera accordé qu'à eux",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4700,
			"arabicnumber": "1817",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 182
			}
		}
	]
}