{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"21": "Actions while Praying"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ وَهْىَ خَالَتُهُ ـ قَالَ فَاضْطَجَعْتُ عَلَى عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ، ثُمَّ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ، فَمَسَحَ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ آيَاتٍ خَوَاتِيمَ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا بِيَدِهِ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كُنَّا نُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي الصَّلاَةِ فَيَرُدُّ عَلَيْنَا، فَلَمَّا رَجَعْنَا مِنْ عِنْدِ النَّجَاشِيِّ سَلَّمْنَا عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْنَا وَقَالَ ‏ \"‏ إِنَّ فِي الصَّلاَةِ شُغْلاً ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى ـ هُوَ ابْنُ يُونُسَ ـ عَنْ إِسْمَاعِيلَ، عَنِ الْحَارِثِ بْنِ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، قَالَ قَالَ لِي زَيْدُ بْنُ أَرْقَمَ إِنْ كُنَّا لَنَتَكَلَّمُ فِي الصَّلاَةِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم، يُكَلِّمُ أَحَدُنَا صَاحِبَهُ بِحَاجَتِهِ حَتَّى نَزَلَتْ ‏{‏حَافِظُوا عَلَى الصَّلَوَاتِ‏}‏ الآيَةَ، فَأُمِرْنَا بِالسُّكُوتِ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ، وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ أَبَا بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ حُبِسَ النَّبِيُّ صلى الله عليه وسلم فَتَؤُمُّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتُمْ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، فَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَصَلَّى، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا حَتَّى قَامَ فِي الصَّفِّ الأَوَّلِ، فَأَخَذَ النَّاسُ بِالتَّصْفِيحِ‏.‏ قَالَ سَهْلٌ هَلْ تَدْرُونَ مَا التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرُوا الْتَفَتَ فَإِذَا النَّبِيُّ صلى الله عليه وسلم فِي الصَّفِّ، فَأَشَارَ إِلَيْهِ مَكَانَكَ‏.‏ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ وَتَقَدَّمَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عِيسَى، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَقُولُ التَّحِيَّةُ فِي الصَّلاَةِ وَنُسَمِّي، وَيُسَلِّمُ بَعْضُنَا عَلَى بَعْضٍ، فَسَمِعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، فَإِنَّكُمْ إِذَا فَعَلْتُمْ ذَلِكَ فَقَدْ سَلَّمْتُمْ عَلَى كُلِّ عَبْدٍ لِلَّهِ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": 1203,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "حَدَّثَنَا يَحْيَى، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيحُ لِلنِّسَاءِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ يُونُسُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ الْمُسْلِمِينَ، بَيْنَا هُمْ فِي الْفَجْرِ يَوْمَ الاِثْنَيْنِ، وَأَبُو بَكْرٍ ـ رضى الله عنه ـ يُصَلِّي بِهِمْ فَفَجَأَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ ـ رضى الله عنها ـ فَنَظَرَ إِلَيْهِمْ، وَهُمْ صُفُوفٌ، فَتَبَسَّمَ يَضْحَكُ، فَنَكَصَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى عَقِبَيْهِ، وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُرِيدُ أَنْ يَخْرُجَ إِلَى الصَّلاَةِ، وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ فَرَحًا بِالنَّبِيِّ صلى الله عليه وسلم حِينَ رَأَوْهُ، فَأَشَارَ بِيَدِهِ أَنْ أَتِمُّوا، ثُمَّ دَخَلَ الْحُجْرَةَ وَأَرْخَى السِّتْرَ، وَتُوُفِّيَ ذَلِكَ الْيَوْمَ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَادَتِ امْرَأَةٌ ابْنَهَا، وَهْوَ فِي صَوْمَعَةٍ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتْ يَا جُرَيْجُ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي‏.‏ قَالَتِ اللَّهُمَّ لاَ يَمُوتُ جُرَيْجٌ حَتَّى يَنْظُرَ فِي وَجْهِ الْمَيَامِيسِ‏.‏ وَكَانَتْ تَأْوِي إِلَى صَوْمَعَتِهِ رَاعِيَةٌ تَرْعَى الْغَنَمَ فَوَلَدَتْ فَقِيلَ لَهَا مِمَّنْ هَذَا الْوَلَدُ قَالَتْ مِنْ جُرَيْجٍ نَزَلَ مِنْ صَوْمَعَتِهِ‏.‏ قَالَ جُرَيْجٌ أَيْنَ هَذِهِ الَّتِي تَزْعُمُ أَنَّ وَلَدَهَا لِي قَالَ يَا بَابُوسُ مَنْ أَبُوكَ قَالَ رَاعِي الْغَنَمِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ حَدَّثَنِي مُعَيْقِيبٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ قَالَ ‏ \"‏ إِنْ كُنْتَ فَاعِلاً فَوَاحِدَةً ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا غَالِبٌ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي شِدَّةِ الْحَرِّ، فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ وَجْهَهُ مِنَ الأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَمُدُّ رِجْلِي فِي قِبْلَةِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُصَلِّي، فَإِذَا سَجَدَ غَمَزَنِي فَرَفَعْتُهَا، فَإِذَا قَامَ مَدَدْتُهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى صَلاَةً قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ عَرَضَ لِي، فَشَدَّ عَلَىَّ لِيَقْطَعَ الصَّلاَةَ عَلَىَّ، فَأَمْكَنَنِي اللَّهُ مِنْهُ، فَذَعَتُّهُ، وَلَقَدْ هَمَمْتُ أَنْ أُوثِقَهُ إِلَى سَارِيَةٍ حَتَّى تُصْبِحُوا فَتَنْظُرُوا إِلَيْهِ فَذَكَرْتُ قَوْلَ سُلَيْمَانَ ـ عَلَيْهِ السَّلاَمُ ـ رَبِّ هَبْ لِي مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِي‏.‏ فَرَدَّهُ اللَّهُ خَاسِيًا ‏\"‏‏.‏ ثُمَّ قَالَ النَّضْرُ بْنُ شُمَيْلٍ فَذَعَتُّهُ بِالذَّالِ أَىْ خَنَقْتُهُ وَفَدَعَّتُّهُ مِنْ قَوْلِ اللَّهِ ‏{‏يَوْمَ يُدَعُّونَ‏}‏ أَىْ يُدْفَعُونَ وَالصَّوَابُ، فَدَعَتُّهُ إِلاَّ أَنَّهُ كَذَا قَالَ بِتَشْدِيدِ الْعَيْنِ وَالتَّاءِ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَزْرَقُ بْنُ قَيْسٍ، قَالَ كُنَّا بِالأَهْوَازِ نُقَاتِلُ الْحَرُورِيَّةَ، فَبَيْنَا أَنَا عَلَى جُرُفِ نَهَرٍ إِذَا رَجُلٌ يُصَلِّي، وَإِذَا لِجَامُ دَابَّتِهِ بِيَدِهِ فَجَعَلَتِ الدَّابَّةُ تُنَازِعُهُ، وَجَعَلَ يَتْبَعُهَا ـ قَالَ شُعْبَةُ ـ هُوَ أَبُو بَرْزَةَ الأَسْلَمِيُّ ـ فَجَعَلَ رَجُلٌ مِنَ الْخَوَارِجِ يَقُولُ اللَّهُمَّ افْعَلْ بِهَذَا الشَّيْخِ‏.‏ فَلَمَّا انْصَرَفَ الشَّيْخُ قَالَ إِنِّي سَمِعْتُ قَوْلَكُمْ، وَإِنِّي غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ غَزَوَاتٍ أَوْ سَبْعَ غَزَوَاتٍ وَثَمَانِيًا، وَشَهِدْتُ تَيْسِيرَهُ، وَإِنِّي أَنْ كُنْتُ أَنْ أُرَاجِعَ مَعَ دَابَّتِي أَحَبُّ إِلَىَّ مِنْ أَنْ أَدَعَهَا تَرْجِعُ إِلَى مَأْلَفِهَا فَيَشُقَّ عَلَىَّ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَ سُورَةً طَوِيلَةً، ثُمَّ رَكَعَ فَأَطَالَ، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ اسْتَفْتَحَ بِسُورَةٍ أُخْرَى، ثُمَّ رَكَعَ حَتَّى قَضَاهَا وَسَجَدَ، ثُمَّ فَعَلَ ذَلِكَ فِي الثَّانِيَةِ، ثُمَّ قَالَ ‏ \"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَصَلُّوا حَتَّى يُفْرَجَ عَنْكُمْ، لَقَدْ رَأَيْتُ فِي مَقَامِي هَذَا كُلَّ شَىْءٍ وُعِدْتُهُ، حَتَّى لَقَدْ رَأَيْتُنِي أُرِيدُ أَنْ آخُذَ قِطْفًا مِنَ الْجَنَّةِ حِينَ رَأَيْتُمُونِي جَعَلْتُ أَتَقَدَّمُ، وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ، وَرَأَيْتُ فِيهَا عَمْرَو بْنَ لُحَىٍّ وَهُوَ الَّذِي سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ، فَتَغَيَّظَ عَلَى أَهْلِ الْمَسْجِدِ وَقَالَ ‏ \"‏ إِنَّ اللَّهَ قِبَلَ أَحَدِكُمْ، فَإِذَا كَانَ فِي صَلاَتِهِ، فَلاَ يَبْزُقَنَّ ـ أَوْ قَالَ ـ لاَ يَتَنَخَّمَنَّ ‏\"‏‏.‏ ثُمَّ نَزَلَ فَحَتَّهَا بِيَدِهِ‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا بَزَقَ أَحَدُكُمْ فَلْيَبْزُقْ عَلَى يَسَارِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَانَ فِي الصَّلاَةِ فَإِنَّهُ يُنَاجِي رَبَّهُ، فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ شِمَالِهِ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّاسُ يُصَلُّونَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهُمْ عَاقِدُو أُزْرِهِمْ مِنَ الصِّغَرِ عَلَى رِقَابِهِمْ، فَقِيلَ لِلنِّسَاءِ ‏ \"‏ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ فِي الصَّلاَةِ فَيَرُدُّ عَلَىَّ، فَلَمَّا رَجَعْنَا سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ وَقَالَ ‏ \"‏ إِنَّ فِي الصَّلاَةِ شُغْلاً ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا كَثِيرُ بْنُ شِنْظِيرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ لَهُ فَانْطَلَقْتُ، ثُمَّ رَجَعْتُ وَقَدْ قَضَيْتُهَا، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ، فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي مَا اللَّهُ أَعْلَمُ بِهِ فَقُلْتُ فِي نَفْسِي لَعَلَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ عَلَىَّ أَنِّي أَبْطَأْتُ عَلَيْهِ، ثُمَّ سَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ، فَوَقَعَ فِي قَلْبِي أَشَدُّ مِنَ الْمَرَّةِ الأُولَى، ثُمَّ سَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَىَّ فَقَالَ ‏ \"‏ إِنَّمَا مَنَعَنِي أَنْ أَرُدَّ عَلَيْكَ أَنِّي كُنْتُ أُصَلِّي ‏\"‏‏.‏ وَكَانَ عَلَى رَاحِلَتِهِ مُتَوَجِّهًا إِلَى غَيْرِ الْقِبْلَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ بِقُبَاءٍ كَانَ بَيْنَهُمْ شَىْءٌ، فَخَرَجَ يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مِنْ أَصْحَابِهِ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ يَا أَبَا بَكْرٍ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ، فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ، وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا، حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيحِ‏.‏ قَالَ سَهْلٌ التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ قَالَ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ، يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَهُ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ بِالتَّصْفِيحِ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ، مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نُهِيَ عَنِ الْخَصْرِ، فِي الصَّلاَةِ‏.‏ وَقَالَ هِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ نُهِيَ أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا عُمَرُ ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا سَلَّمَ قَامَ سَرِيعًا دَخَلَ عَلَى بَعْضِ نِسَائِهِ، ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَجُّبِهِمْ لِسُرْعَتِهِ فَقَالَ ‏ \"‏ ذَكَرْتُ وَأَنَا فِي الصَّلاَةِ تِبْرًا عِنْدَنَا، فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُذِّنَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ التَّأْذِينَ، فَإِذَا سَكَتَ الْمُؤَذِّنُ أَقْبَلَ، فَإِذَا ثُوِّبَ أَدْبَرَ فَإِذَا سَكَتَ أَقْبَلَ، فَلاَ يَزَالُ بِالْمَرْءِ يَقُولُ لَهُ اذْكُرْ مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى لاَ يَدْرِي كَمْ صَلَّى ‏\"‏‏.‏ قَالَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ إِذَا فَعَلَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ‏.‏ وَسَمِعَهُ أَبُو سَلَمَةَ مِنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ النَّاسُ أَكْثَرَ أَبُو هُرَيْرَةَ، فَلَقِيتُ رَجُلاً فَقُلْتُ بِمَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَارِحَةَ فِي الْعَتَمَةِ فَقَالَ لاَ أَدْرِي‏.‏ فَقُلْتُ لَمْ تَشْهَدْهَا قَالَ بَلَى‏.‏ قُلْتُ لَكِنْ أَنَا أَدْرِي، قَرَأَ سُورَةَ كَذَا وَكَذَا‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		}
	]
}