{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنْ زَكَرِيَّاءَ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا ـ رضى الله عنه ـ إِلَى الْيَمَنِ فَقَالَ ‏ \"‏ ادْعُهُمْ إِلَى شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ، فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ قَدِ افْتَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ، تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي أَيُّوبَ، رضى الله عنه أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ‏.‏ قَالَ مَا لَهُ مَا لَهُ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَرَبٌ مَالَهُ، تَعْبُدُ اللَّهَ، وَلاَ تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلاَةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصِلُ الرَّحِمَ ‏\"‏‏.‏ وَقَالَ بَهْزٌ حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ، وَأَبُوهُ، عُثْمَانُ بْنُ عَبْدِ اللَّهِ أَنَّهُمَا سَمِعَا مُوسَى بْنَ طَلْحَةَ، عَنْ أَبِي أَيُّوبَ، بِهَذَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ أَخْشَى أَنْ يَكُونَ، مُحَمَّدٌ غَيْرَ مَحْفُوظٍ إِنَّمَا هُوَ عَمْرٌو‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ يَحْيَى بْنِ سَعِيدِ بْنِ حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ أَعْرَابِيًّا، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ دَخَلْتُ الْجَنَّةَ‏.‏ قَالَ ‏\"‏ تَعْبُدُ اللَّهَ لاَ تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلاَةَ الْمَكْتُوبَةَ، وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومُ رَمَضَانَ ‏\"‏‏.‏ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ أَزِيدُ عَلَى هَذَا‏.‏ فَلَمَّا وَلَّى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا ‏\"‏‏.‏ حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ أَبِي حَيَّانَ، قَالَ أَخْبَرَنِي أَبُو زُرْعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَبُو جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ هَذَا الْحَىَّ مِنْ رَبِيعَةَ قَدْ حَالَتْ بَيْنَنَا وَبَيْنَكَ كُفَّارُ مُضَرَ، وَلَسْنَا نَخْلُصُ إِلَيْكَ إِلاَّ فِي الشَّهْرِ الْحَرَامِ، فَمُرْنَا بِشَىْءٍ نَأْخُذُهُ عَنْكَ، وَنَدْعُو إِلَيْهِ مَنْ وَرَاءَنَا‏.‏ قَالَ ‏\"‏ آمُرُكُمْ بِأَرْبَعٍ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ الإِيمَانِ بِاللَّهِ وَشَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ـ وَعَقَدَ بِيَدِهِ هَكَذَا ـ وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَأَنْ تُؤَدُّوا خُمُسَ مَا غَنِمْتُمْ، وَأَنْهَاكُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُزَفَّتِ ‏\"‏‏.‏ وَقَالَ سُلَيْمَانُ وَأَبُو النُّعْمَانِ عَنْ حَمَّادٍ ‏\"‏ الإِيمَانِ بِاللَّهِ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ قَالَ جَرِيرُ بْنُ عَبْدِ اللَّهِ بَايَعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَأْتِي الإِبِلُ عَلَى صَاحِبِهَا، عَلَى خَيْرِ مَا كَانَتْ، إِذَا هُوَ لَمْ يُعْطِ فِيهَا حَقَّهَا، تَطَؤُهُ بِأَخْفَافِهَا، وَتَأْتِي الْغَنَمُ عَلَى صَاحِبِهَا عَلَى خَيْرِ مَا كَانَتْ، إِذَا لَمْ يُعْطِ فِيهَا حَقَّهَا، تَطَؤُهُ بِأَظْلاَفِهَا، وَتَنْطَحُهُ بِقُرُونِهَا ‏\"‏‏.‏ وَقَالَ ‏\"‏ وَمِنْ حَقِّهَا أَنْ تُحْلَبَ عَلَى الْمَاءِ ‏\"‏‏.‏ قَالَ ‏\"‏ وَلاَ يَأْتِي أَحَدُكُمْ يَوْمَ الْقِيَامَةِ بِشَاةٍ يَحْمِلُهَا عَلَى رَقَبَتِهِ لَهَا يُعَارٌ، فَيَقُولُ يَا مُحَمَّدُ‏.‏ فَأَقُولُ لاَ أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ‏.‏ وَلاَ يَأْتِي بِبَعِيرٍ، يَحْمِلُهُ عَلَى رَقَبَتِهِ لَهُ رُغَاءٌ، فَيَقُولُ يَا مُحَمَّدُ‏.‏ فَأَقُولُ لاَ أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ آتَاهُ اللَّهُ مَالاً، فَلَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ، لَهُ زَبِيبَتَانِ، يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ، ثُمَّ يَأْخُذُ بِلِهْزِمَتَيْهِ ـ يَعْنِي شِدْقَيْهِ ـ ثُمَّ يَقُولُ أَنَا مَالُكَ، أَنَا كَنْزُكَ ‏\"‏ ثُمَّ تَلاَ ‏{‏لاَ يَحْسِبَنَّ الَّذِينَ يَبْخَلُونَ‏}‏ الآيَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ خَالِدِ بْنِ أَسْلَمَ، قَالَ خَرَجْنَا مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ فَقَالَ أَعْرَابِيٌّ أَخْبِرْنِي قَوْلَ اللَّهِ، ‏{‏وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ‏}‏ قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ مَنْ كَنَزَهَا فَلَمْ يُؤَدِّ زَكَاتَهَا فَوَيْلٌ لَهُ، إِنَّمَا كَانَ هَذَا قَبْلَ أَنْ تُنْزَلَ الزَّكَاةُ فَلَمَّا أُنْزِلَتْ جَعَلَهَا اللَّهُ طُهْرًا لِلأَمْوَالِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ يَزِيدَ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ، قَالَ الأَوْزَاعِيُّ أَخْبَرَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، أَنَّ عَمْرَو بْنَ يَحْيَى بْنِ عُمَارَةَ، أَخْبَرَهُ عَنْ أَبِيهِ، يَحْيَى بْنِ عُمَارَةَ بْنِ أَبِي الْحَسَنِ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "حَدَّثَنَا عَلِيٌّ، سَمِعَ هُشَيْمًا، أَخْبَرَنَا حُصَيْنٌ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ مَرَرْتُ بِالرَّبَذَةِ فَإِذَا أَنَا بِأَبِي، ذَرٍّ ـ رضى الله عنه ـ فَقُلْتُ لَهُ مَا أَنْزَلَكَ مَنْزِلَكَ هَذَا قَالَ كُنْتُ بِالشَّأْمِ، فَاخْتَلَفْتُ أَنَا وَمُعَاوِيَةُ فِي الَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ‏.‏ قَالَ مُعَاوِيَةُ نَزَلَتْ فِي أَهْلِ الْكِتَابِ‏.‏ فَقُلْتُ نَزَلَتْ فِينَا وَفِيهِمْ‏.‏ فَكَانَ بَيْنِي وَبَيْنَهُ فِي ذَاكَ، وَكَتَبَ إِلَى عُثْمَانَ ـ رضى الله عنه ـ يَشْكُونِي، فَكَتَبَ إِلَىَّ عُثْمَانُ أَنِ اقْدَمِ الْمَدِينَةَ‏.‏ فَقَدِمْتُهَا فَكَثُرَ عَلَىَّ النَّاسُ حَتَّى كَأَنَّهُمْ لَمْ يَرَوْنِي قَبْلَ ذَلِكَ، فَذَكَرْتُ ذَاكَ لِعُثْمَانَ فَقَالَ لِي إِنْ شِئْتَ تَنَحَّيْتَ فَكُنْتَ قَرِيبًا‏.‏ فَذَاكَ الَّذِي أَنْزَلَنِي هَذَا الْمَنْزِلَ، وَلَوْ أَمَّرُوا عَلَىَّ حَبَشِيًّا لَسَمِعْتُ وَأَطَعْتُ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَرَجُلٌ آتَاهُ اللَّهُ حِكْمَةً فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا النَّضْرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ ـ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ ـ عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَصَدَّقَ بِعَدْلِ تَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ ـ وَلاَ يَقْبَلُ اللَّهُ إِلاَّ الطَّيِّبَ ـ وَإِنَّ اللَّهَ يَتَقَبَّلُهَا بِيَمِينِهِ، ثُمَّ يُرَبِّيهَا لِصَاحِبِهِ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ حَتَّى تَكُونَ مِثْلَ الْجَبَلِ ‏\"‏‏.‏ تَابَعَهُ سُلَيْمَانُ عَنِ ابْنِ دِينَارٍ‏.‏ وَقَالَ وَرْقَاءُ عَنِ ابْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ مُسْلِمُ بْنُ أَبِي مَرْيَمَ وَزَيْدُ بْنُ أَسْلَمَ وَسُهَيْلٌ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مَعْبَدُ بْنُ خَالِدٍ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تَصَدَّقُوا فَإِنَّهُ يَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ، فَلاَ يَجِدُ مَنْ يَقْبَلُهَا يَقُولُ الرَّجُلُ لَوْ جِئْتَ بِهَا بِالأَمْسِ لَقَبِلْتُهَا، فَأَمَّا الْيَوْمَ فَلاَ حَاجَةَ لِي بِهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضَ، حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُ صَدَقَتَهُ، وَحَتَّى يَعْرِضَهُ فَيَقُولَ الَّذِي يَعْرِضُهُ عَلَيْهِ لاَ أَرَبَ لِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَاصِمٍ النَّبِيلُ، أَخْبَرَنَا سَعْدَانُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو مُجَاهِدٍ، حَدَّثَنَا مُحِلُّ بْنُ خَلِيفَةَ الطَّائِيُّ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ ـ رضى الله عنه ـ يَقُولُ كُنْتُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَهُ رَجُلاَنِ أَحَدُهُمَا يَشْكُو الْعَيْلَةَ، وَالآخَرُ يَشْكُو قَطْعَ السَّبِيلِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَمَّا قَطْعُ السَّبِيلِ فَإِنَّهُ لاَ يَأْتِي عَلَيْكَ إِلاَّ قَلِيلٌ حَتَّى تَخْرُجَ الْعِيرُ إِلَى مَكَّةَ بِغَيْرِ خَفِيرٍ، وَأَمَّا الْعَيْلَةُ فَإِنَّ السَّاعَةَ لاَ تَقُومُ حَتَّى يَطُوفَ أَحَدُكُمْ بِصَدَقَتِهِ لاَ يَجِدُ مَنْ يَقْبَلُهَا مِنْهُ، ثُمَّ لَيَقِفَنَّ أَحَدُكُمْ بَيْنَ يَدَىِ اللَّهِ لَيْسَ بَيْنَهُ وَبَيْنَهُ حِجَابٌ وَلاَ تُرْجُمَانٌ يُتَرْجِمُ لَهُ، ثُمَّ لَيَقُولَنَّ لَهُ أَلَمْ أُوتِكَ مَالاً فَلَيَقُولَنَّ بَلَى‏.‏ ثُمَّ لَيَقُولَنَّ أَلَمْ أُرْسِلْ إِلَيْكَ رَسُولاً فَلَيَقُولَنَّ بَلَى‏.‏ فَيَنْظُرُ عَنْ يَمِينِهِ فَلاَ يَرَى إِلاَّ النَّارَ، ثُمَّ يَنْظُرُ عَنْ شِمَالِهِ فَلاَ يَرَى إِلاَّ النَّارَ، فَلْيَتَّقِيَنَّ أَحَدُكُمُ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَإِنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ يَطُوفُ الرَّجُلُ فِيهِ بِالصَّدَقَةِ مِنَ الذَّهَبِ ثُمَّ لاَ يَجِدُ أَحَدًا يَأْخُذُهَا مِنْهُ، وَيُرَى الرَّجُلُ الْوَاحِدُ يَتْبَعُهُ أَرْبَعُونَ امْرَأَةً، يَلُذْنَ بِهِ مِنْ قِلَّةِ الرِّجَالِ وَكَثْرَةِ النِّسَاءِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو النُّعْمَانِ الْحَكَمُ ـ هُوَ ابْنُ عَبْدِ اللَّهِ الْبَصْرِيُّ ـ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ آيَةُ الصَّدَقَةِ كُنَّا نُحَامِلُ، فَجَاءَ رَجُلٌ فَتَصَدَّقَ بِشَىْءٍ كَثِيرٍ فَقَالُوا مُرَائِي‏.‏ وَجَاءَ رَجُلٌ فَتَصَدَّقَ بِصَاعٍ فَقَالُوا إِنَّ اللَّهَ لَغَنِيٌّ عَنْ صَاعِ هَذَا‏.‏ فَنَزَلَتِ ‏{‏الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لاَ يَجِدُونَ إِلاَّ جُهْدَهُمْ‏}‏ الآيَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمَرَنَا بِالصَّدَقَةِ انْطَلَقَ أَحَدُنَا إِلَى السُّوقِ فَتَحَامَلَ فَيُصِيبُ الْمُدَّ، وَإِنَّ لِبَعْضِهِمُ الْيَوْمَ لَمِائَةَ أَلْفٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَتِ امْرَأَةٌ مَعَهَا ابْنَتَانِ لَهَا تَسْأَلُ، فَلَمْ تَجِدْ عِنْدِي شَيْئًا غَيْرَ تَمْرَةٍ فَأَعْطَيْتُهَا إِيَّاهَا، فَقَسَمَتْهَا بَيْنَ ابْنَتَيْهَا وَلَمْ تَأْكُلْ مِنْهَا، ثُمَّ قَامَتْ فَخَرَجَتْ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَيْنَا، فَأَخْبَرْتُهُ فَقَالَ ‏ \"‏ مَنِ ابْتُلِيَ مِنْ هَذِهِ الْبَنَاتِ بِشَىْءٍ كُنَّ لَهُ سِتْرًا مِنَ النَّارِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، حَدَّثَنَا أَبُو زُرْعَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَعْظَمُ أَجْرًا قَالَ ‏ \"‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ، تَخْشَى الْفَقْرَ وَتَأْمُلُ الْغِنَى، وَلاَ تُمْهِلُ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ لِفُلاَنٍ كَذَا، وَلِفُلاَنٍ كَذَا، وَقَدْ كَانَ لِفُلاَنٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ بَعْضَ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم قُلْنَ لِلنَّبِيِّ صلى الله عليه وسلم أَيُّنَا أَسْرَعُ بِكَ لُحُوقًا قَالَ ‏ \"‏ أَطْوَلُكُنَّ يَدًا ‏\"‏‏.‏ فَأَخَذُوا قَصَبَةً يَذْرَعُونَهَا، فَكَانَتْ سَوْدَةُ أَطْوَلَهُنَّ يَدًا، فَعَلِمْنَا بَعْدُ أَنَّمَا كَانَتْ طُولَ يَدِهَا الصَّدَقَةُ، وَكَانَتْ أَسْرَعَنَا لُحُوقًا بِهِ وَكَانَتْ تُحِبُّ الصَّدَقَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ رَجُلٌ لأَتَصَدَّقَنَّ بِصَدَقَةٍ‏.‏ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى سَارِقٍ‏.‏ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ لأَتَصَدَّقَنَّ بِصَدَقَةٍ‏.‏ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدَىْ زَانِيَةٍ، فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ‏.‏ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ، لأَتَصَدَّقَنَّ بِصَدَقَةٍ‏.‏ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدَىْ غَنِيٍّ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى غَنِيٍّ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ، عَلَى سَارِقٍ وَعَلَى زَانِيَةٍ وَعَلَى غَنِيٍّ‏.‏ فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ عَلَى سَارِقٍ فَلَعَلَّهُ أَنْ يَسْتَعِفَّ عَنْ سَرِقَتِهِ، وَأَمَّا الزَّانِيَةُ فَلَعَلَّهَا أَنْ تَسْتَعِفَّ عَنْ زِنَاهَا، وَأَمَّا الْغَنِيُّ فَلَعَلَّهُ يَعْتَبِرُ فَيُنْفِقُ مِمَّا أَعْطَاهُ اللَّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا إِسْرَائِيلُ، حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ، أَنَّ مَعْنَ بْنَ يَزِيدَ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَا وَأَبِي وَجَدِّي وَخَطَبَ عَلَىَّ فَأَنْكَحَنِي وَخَاصَمْتُ إِلَيْهِ ـ وَـ كَانَ أَبِي يَزِيدُ أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ، فَجِئْتُ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا فَقَالَ وَاللَّهِ مَا إِيَّاكَ أَرَدْتُ‏.‏ فَخَاصَمْتُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لَكَ مَا نَوَيْتَ يَا يَزِيدُ، وَلَكَ مَا أَخَذْتَ يَا مَعْنُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ تَعَالَى فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَدْلٌ، وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسَاجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ اجْتَمَعَا عَلَيْهِ وَتَفَرَّقَا عَلَيْهِ، وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّي أَخَافُ اللَّهَ، وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ، وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مَعْبَدُ بْنُ خَالِدٍ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تَصَدَّقُوا، فَسَيَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَيَقُولُ الرَّجُلُ لَوْ جِئْتَ بِهَا بِالأَمْسِ لَقَبِلْتُهَا مِنْكَ، فَأَمَّا الْيَوْمَ فَلاَ حَاجَةَ لِي فِيهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ، وَلِلْخَازِنِ مِثْلُ ذَلِكَ، لاَ يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى، وَابْدَأْ بِمَنْ تَعُولُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم ح‏.‏ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ عَلَى الْمِنْبَرِ، وَذَكَرَ الصَّدَقَةَ وَالتَّعَفُّفَ وَالْمَسْأَلَةَ ‏ \"‏ الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى، فَالْيَدُ الْعُلْيَا هِيَ الْمُنْفِقَةُ، وَالسُّفْلَى هِيَ السَّائِلَةُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُمَرَ بْنِ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ عُقْبَةَ بْنَ الْحَارِثِ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الْعَصْرَ، فَأَسْرَعَ ثُمَّ دَخَلَ الْبَيْتَ، فَلَمْ يَلْبَثْ أَنْ خَرَجَ، فَقُلْتُ أَوْ قِيلَ لَهُ فَقَالَ ‏ \"‏ كُنْتُ خَلَّفْتُ فِي الْبَيْتِ تِبْرًا مِنَ الصَّدَقَةِ، فَكَرِهْتُ أَنْ أُبَيِّتَهُ فَقَسَمْتُهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَدِيٌّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عِيدٍ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلُ وَلاَ بَعْدُ، ثُمَّ مَالَ عَلَى النِّسَاءِ وَمَعَهُ بِلاَلٌ، فَوَعَظَهُنَّ وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي الْقُلْبَ وَالْخُرْصَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، حَدَّثَنَا أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا جَاءَهُ السَّائِلُ، أَوْ طُلِبَتْ إِلَيْهِ حَاجَةٌ قَالَ ‏ \"‏ اشْفَعُوا تُؤْجَرُوا، وَيَقْضِي اللَّهُ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم مَا شَاءَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ ـ رضى الله عنها ـ قَالَتْ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُوكِي فَيُوكَى عَلَيْكِ ‏\"‏‏.‏ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، عَنْ عَبْدَةَ، وَقَالَ، ‏\"‏ لاَ تُحْصِي فَيُحْصِيَ اللَّهُ عَلَيْكِ ‏\"‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، عَنْ حَجَّاجِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَخْبَرَهُ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّهَا جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تُوعِي فَيُوعِيَ اللَّهُ عَلَيْكِ، ارْضَخِي مَا اسْتَطَعْتِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ أَيُّكُمْ يَحْفَظُ حَدِيثَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنِ الْفِتْنَةِ قَالَ قُلْتُ أَنَا أَحْفَظُهُ كَمَا قَالَ‏.‏ قَالَ إِنَّكَ عَلَيْهِ لَجَرِيءٌ فَكَيْفَ قَالَ قُلْتُ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَوَلَدِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصَّدَقَةُ وَالْمَعْرُوفُ‏.‏ قَالَ سُلَيْمَانُ قَدْ كَانَ يَقُولُ ‏ \"‏ الصَّلاَةُ وَالصَّدَقَةُ، وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏‏.‏ قَالَ لَيْسَ هَذِهِ أُرِيدُ، وَلَكِنِّي أُرِيدُ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ‏.‏ قَالَ قُلْتُ لَيْسَ عَلَيْكَ بِهَا يَا أَمِيرَ الْمُؤْمِنِينَ بَأْسٌ، بَيْنَكَ وَبَيْنَهَا باب مُغْلَقٌ‏.‏ قَالَ فَيُكْسَرُ الْبَابُ أَوْ يُفْتَحُ‏.‏ قَالَ قُلْتُ لاَ‏.‏ بَلْ يُكْسَرُ‏.‏ قَالَ فَإِنَّهُ إِذَا كُسِرَ لَمْ يُغْلَقْ أَبَدًا‏.‏ قَالَ قُلْتُ أَجَلْ‏.‏ فَهِبْنَا أَنْ نَسْأَلَهُ مَنِ الْبَابُ فَقُلْنَا لِمَسْرُوقٍ سَلْهُ‏.‏ قَالَ فَسَأَلَهُ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ‏.‏ قَالَ قُلْنَا فَعَلِمَ عُمَرُ مَنْ تَعْنِي قَالَ نَعَمْ، كَمَا أَنَّ دُونَ غَدٍ لَيْلَةً، وَذَلِكَ أَنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالأَغَالِيطِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ حَكِيمِ بْنِ حِزَامٍ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَشْيَاءَ كُنْتُ أَتَحَنَّثُ بِهَا فِي الْجَاهِلِيَّةِ مِنْ صَدَقَةٍ أَوْ عَتَاقَةٍ وَصِلَةِ رَحِمٍ فَهَلْ فِيهَا مِنْ أَجْرٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَسْلَمْتَ عَلَى مَا سَلَفَ مِنْ خَيْرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَصَدَّقَتِ الْمَرْأَةُ مِنْ طَعَامِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا، وَلِزَوْجِهَا بِمَا كَسَبَ، وَلِلْخَازِنِ مِثْلُ ذَلِكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْخَازِنُ الْمُسْلِمُ الأَمِينُ الَّذِي يُنْفِذُ ـ وَرُبَّمَا قَالَ يُعْطِي ـ مَا أُمِرَ بِهِ كَامِلاً مُوَفَّرًا طَيِّبٌ بِهِ نَفْسُهُ، فَيَدْفَعُهُ إِلَى الَّذِي أُمِرَ لَهُ بِهِ، أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مَنْصُورٌ، وَالأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم تَعْنِي إِذَا تَصَدَّقَتِ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا أَطْعَمَتِ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ، لَهَا أَجْرُهَا، وَلَهُ مِثْلُهُ، وَلِلْخَازِنِ مِثْلُ ذَلِكَ، لَهُ بِمَا اكْتَسَبَ، وَلَهَا بِمَا أَنْفَقَتْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ فَلَهَا أَجْرُهَا، وَلِلزَّوْجِ بِمَا اكْتَسَبَ، وَلِلْخَازِنِ مِثْلُ ذَلِكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ أَبِي الْحُبَابِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلاَّ مَلَكَانِ يَنْزِلاَنِ فَيَقُولُ أَحَدُهُمَا اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا، وَيَقُولُ الآخَرُ اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ كَمَثَلِ رَجُلَيْنِ، عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ ‏\"‏‏.‏ وَحَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ حَدَّثَنَا أَبُو الزِّنَادِ أَنَّ عَبْدَ الرَّحْمَنِ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَثَلُ الْبَخِيلِ وَالْمُنْفِقِ كَمَثَلِ رَجُلَيْنِ، عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، مِنْ ثُدِيِّهِمَا إِلَى تَرَاقِيهِمَا، فَأَمَّا الْمُنْفِقُ فَلاَ يُنْفِقُ إِلاَّ سَبَغَتْ ـ أَوْ وَفَرَتْ ـ عَلَى جِلْدِهِ حَتَّى تُخْفِيَ بَنَانَهُ وَتَعْفُوَ أَثَرَهُ، وَأَمَّا الْبَخِيلُ فَلاَ يُرِيدُ أَنْ يُنْفِقَ شَيْئًا إِلاَّ لَزِقَتْ كُلُّ حَلْقَةٍ مَكَانَهَا، فَهُوَ يُوَسِّعُهَا وَلاَ تَتَّسِعُ ‏\"‏‏.‏ تَابَعَهُ الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ فِي الْجُبَّتَيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "وَقَالَ حَنْظَلَةُ عَنْ طَاوُسٍ، ‏\"‏ جُنَّتَانِ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرٌ، عَنِ ابْنِ هُرْمُزٍ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ جُنَّتَانِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ ‏\"‏‏.‏ فَقَالُوا يَا نَبِيَّ اللَّهِ فَمَنْ لَمْ يَجِدْ قَالَ ‏\"‏ يَعْمَلُ بِيَدِهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ ‏\"‏‏.‏ قَالُوا فَإِنْ لَمْ يَجِدْ قَالَ ‏\"‏ يُعِينُ ذَا الْحَاجَةِ الْمَلْهُوفَ ‏\"‏‏.‏ قَالُوا فَإِنْ لَمْ يَجِدْ‏.‏ قَالَ ‏\"‏ فَلْيَعْمَلْ بِالْمَعْرُوفِ، وَلْيُمْسِكْ عَنِ الشَّرِّ فَإِنَّهَا لَهُ صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ بُعِثَ إِلَى نُسَيْبَةَ الأَنْصَارِيَّةِ بِشَاةٍ فَأَرْسَلَتْ إِلَى عَائِشَةَ ـ رضى الله عنها ـ مِنْهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عِنْدَكُمْ شَىْءٌ ‏\"‏‏.‏ فَقُلْتُ لاَ إِلاَّ مَا أَرْسَلَتْ بِهِ نُسَيْبَةُ مِنْ تِلْكَ الشَّاةِ فَقَالَ ‏\"‏ هَاتِ فَقَدْ بَلَغَتْ مَحِلَّهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ مِنَ الإِبِلِ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي عَمْرٌو، سَمِعَ أَبَاهُ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِهَذَا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ الَّتِي أَمَرَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم ‏ \"‏ وَمَنْ بَلَغَتْ صَدَقَتُهُ بِنْتَ مَخَاضٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ، وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ، فَإِنْ لَمْ يَكُنْ عِنْدَهُ بِنْتُ مَخَاضٍ عَلَى وَجْهِهَا، وَعِنْدَهُ ابْنُ لَبُونٍ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَىْءٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "حَدَّثَنَا مُؤَمَّلٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَصَلَّى قَبْلَ الْخُطْبَةِ، فَرَأَى أَنَّهُ لَمْ يُسْمِعِ النِّسَاءَ، فَأَتَاهُنَّ وَمَعَهُ بِلاَلٌ نَاشِرَ ثَوْبِهِ فَوَعَظَهُنَّ، وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي، وَأَشَارَ أَيُّوبُ إِلَى أُذُنِهِ وَإِلَى حَلْقِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَلاَ يُجْمَعُ بَيْنَ مُتَفَرِّقٍ، وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ، خَشْيَةَ الصَّدَقَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ، أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ أَعْرَابِيًّا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْهِجْرَةِ فَقَالَ ‏\"‏ وَيْحَكَ، إِنَّ شَأْنَهَا شَدِيدٌ، فَهَلْ لَكَ مِنْ إِبِلٍ تُؤَدِّي صَدَقَتَهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ فَإِنَّ اللَّهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ فَرِيضَةَ الصَّدَقَةِ الَّتِي أَمَرَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم ‏ \"‏ مَنْ بَلَغَتْ عِنْدَهُ مِنَ الإِبِلِ صَدَقَةُ الْجَذَعَةِ، وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ، فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا، وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ الْحِقَّةُ وَعِنْدَهُ الْجَذَعَةُ، فَإِنَّهَا تُقْبَلُ مِنْهُ الْجَذَعَةُ، وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ، وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ إِلاَّ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ لَبُونٍ، وَيُعْطِي شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَمًا، وَمَنْ بَلَغَتْ صَدَقَتُهُ بِنْتَ لَبُونٍ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ، وَمَنْ بَلَغَتْ صَدَقَتُهُ بِنْتَ لَبُونٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ مَخَاضٍ، فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ مَخَاضٍ وَيُعْطِي مَعَهَا عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ هَذَا الْكِتَابَ لَمَّا وَجَّهَهُ إِلَى الْبَحْرَيْنِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ‏ \"‏ هَذِهِ فَرِيضَةُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمُسْلِمِينَ، وَالَّتِي أَمَرَ اللَّهُ بِهَا رَسُولَهُ، فَمَنْ سُئِلَهَا مِنَ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا، وَمَنْ سُئِلَ فَوْقَهَا فَلاَ يُعْطِ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ الإِبِلِ فَمَا دُونَهَا مِنَ الْغَنَمِ مِنْ كُلِّ خَمْسٍ شَاةٌ، إِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلاَثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَى، فَإِذَا بَلَغَتْ سِتًّا وَثَلاَثِينَ إِلَى خَمْسٍ وَأَرْبَعِينَ فَفِيهَا بِنْتُ لَبُونٍ أُنْثَى، فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْجَمَلِ، فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ إِلَى خَمْسٍ وَسَبْعِينَ فَفِيهَا جَذَعَةٌ، فَإِذَا بَلَغَتْ ـ يَعْنِي ـ سِتًّا وَسَبْعِينَ إِلَى تِسْعِينَ فَفِيهَا بِنْتَا لَبُونٍ، فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْجَمَلِ، فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ، وَفِي كُلِّ خَمْسِينَ حِقَّةٌ، وَمَنْ لَمْ يَكُنْ مَعَهُ إِلاَّ أَرْبَعٌ مِنَ الإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ، إِلاَّ أَنْ يَشَاءَ رَبُّهَا، فَإِذَا بَلَغَتْ خَمْسًا مِنَ الإِبِلِ فَفِيهَا شَاةٌ، وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةٍ شَاةٌ، فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ شَاتَانِ، فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلاَثِمِائَةٍ فَفِيهَا ثَلاَثٌ، فَإِذَا زَادَتْ عَلَى ثَلاَثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ، فَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ، إِلاَّ أَنْ يَشَاءَ رَبُّهَا، وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ، فَإِنْ لَمْ تَكُنْ إِلاَّ تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا شَىْءٌ، إِلاَّ أَنْ يَشَاءَ رَبُّهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ ‏{‏الصَّدَقَةَ‏}‏ الَّتِي أَمَرَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم ‏ \"‏ وَلاَ يُخْرَجُ فِي الصَّدَقَةِ هَرِمَةٌ، وَلاَ ذَاتُ عَوَارٍ، وَلاَ تَيْسٌ، إِلاَّ مَا شَاءَ الْمُصَدِّقُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا بَعَثَ مُعَاذًا ـ رضى الله عنه ـ عَلَى الْيَمَنِ قَالَ ‏ \"‏ إِنَّكَ تَقْدَمُ عَلَى قَوْمٍ أَهْلِ كِتَابٍ، فَلْيَكُنْ أَوَّلَ مَا تَدْعُوهُمْ إِلَيْهِ عِبَادَةُ اللَّهِ، فَإِذَا عَرَفُوا اللَّهَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي يَوْمِهِمْ وَلَيْلَتِهِمْ، فَإِذَا فَعَلُوا، فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهُمْ زَكَاةً ‏{‏تُؤْخَذُ‏}‏ مِنْ أَمْوَالِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ، فَإِذَا أَطَاعُوا بِهَا فَخُذْ مِنْهُمْ، وَتَوَقَّ كَرَائِمَ أَمْوَالِ النَّاسِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الْمَازِنِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ ـ أَوْ وَالَّذِي لاَ إِلَهَ غَيْرُهُ، أَوْ كَمَا حَلَفَ ـ مَا مِنْ رَجُلٍ تَكُونُ لَهُ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ لاَ يُؤَدِّي حَقَّهَا إِلاَّ أُتِيَ بِهَا يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا تَكُونُ وَأَسْمَنَهُ، تَطَؤُهُ بِأَخْفَافِهَا، وَتَنْطَحُهُ بِقُرُونِهَا، كُلَّمَا جَازَتْ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولاَهَا، حَتَّى يُقْضَى بَيْنَ النَّاسِ ‏\"‏‏.‏ رَوَاهُ بُكَيْرٌ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ الأَنْصَارِ بِالْمَدِينَةِ مَالاً مِنْ نَخْلٍ، وَكَانَ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بَيْرُحَاءَ وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ قَالَ أَنَسٌ فَلَمَّا أُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ‏.‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بَيْرُحَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخْ، ذَلِكَ مَالٌ رَابِحٌ، ذَلِكَ مَالٌ رَابِحٌ، وَقَدْ سَمِعْتُ مَا قُلْتَ وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ تَابَعَهُ رَوْحٌ‏.‏ وَقَالَ يَحْيَى بْنُ يَحْيَى وَإِسْمَاعِيلُ عَنْ مَالِكٍ رَايِحٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَضْحًى أَوْ فِطْرٍ إِلَى الْمُصَلَّى ثُمَّ انْصَرَفَ فَوَعَظَ النَّاسَ وَأَمَرَهُمْ بِالصَّدَقَةِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ تَصَدَّقُوا ‏\"‏‏.‏ فَمَرَّ عَلَى النِّسَاءِ فَقَالَ ‏\"‏ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ، فَإِنِّي رَأَيْتُكُنَّ أَكْثَرَ أَهْلِ النَّارِ ‏\"‏‏.‏ فَقُلْنَ وَبِمَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ تُكْثِرْنَ اللَّعْنَ وَتَكْفُرْنَ الْعَشِيرَ، مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَدِينٍ أَذْهَبَ لِلُبِّ الرَّجُلِ الْحَازِمِ مِنْ إِحْدَاكُنَّ يَا مَعْشَرَ النِّسَاءِ ‏\"‏‏.‏ ثُمَّ انْصَرَفَ فَلَمَّا صَارَ إِلَى مَنْزِلِهِ جَاءَتْ زَيْنَبُ امْرَأَةُ ابْنِ مَسْعُودٍ تَسْتَأْذِنُ عَلَيْهِ فَقِيلَ يَا رَسُولَ اللَّهِ هَذِهِ زَيْنَبُ فَقَالَ ‏\"‏ أَىُّ الزَّيَانِبِ ‏\"‏‏.‏ فَقِيلَ امْرَأَةُ ابْنِ مَسْعُودٍ‏.‏ قَالَ ‏\"‏ نَعَمِ ائْذَنُوا لَهَا ‏\"‏‏.‏ فَأُذِنَ لَهَا قَالَتْ يَا نَبِيَّ اللَّهِ إِنَّكَ أَمَرْتَ الْيَوْمَ بِالصَّدَقَةِ، وَكَانَ عِنْدِي حُلِيٌّ لِي، فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ، فَزَعَمَ ابْنُ مَسْعُودٍ أَنَّهُ وَوَلَدَهُ أَحَقُّ مَنْ تَصَدَّقْتُ بِهِ عَلَيْهِمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَدَقَ ابْنُ مَسْعُودٍ، زَوْجُكِ وَوَلَدُكِ أَحَقُّ مَنْ تَصَدَّقْتِ بِهِ عَلَيْهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي فَرَسِهِ وَغُلاَمِهِ صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، حَدَّثَنَا خُثَيْمُ بْنُ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ عَلَى الْمُسْلِمِ صَدَقَةٌ فِي عَبْدِهِ وَلاَ فِي فَرَسِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يُحَدِّثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم جَلَسَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ فَقَالَ ‏\"‏ إِنِّي مِمَّا أَخَافُ عَلَيْكُمْ مِنْ بَعْدِي مَا يُفْتَحُ عَلَيْكُمْ مِنْ زَهْرَةِ الدُّنْيَا وَزِينَتِهَا ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَوَيَأْتِي الْخَيْرُ بِالشَّرِّ فَسَكَتَ النَّبِيُّ صلى الله عليه وسلم فَقِيلَ لَهُ مَا شَأْنُكَ تُكَلِّمُ النَّبِيَّ صلى الله عليه وسلم وَلاَ يُكَلِّمُكَ فَرَأَيْنَا أَنَّهُ يُنْزَلُ عَلَيْهِ‏.‏ قَالَ ـ فَمَسَحَ عَنْهُ الرُّحَضَاءَ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏ وَكَأَنَّهُ حَمِدَهُ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ لاَ يَأْتِي الْخَيْرُ بِالشَّرِّ، وَإِنَّ مِمَّا يُنْبِتُ الرَّبِيعُ يَقْتُلُ أَوْ يُلِمُّ إِلاَّ آكِلَةَ الْخَضْرَاءِ، أَكَلَتْ حَتَّى إِذَا امْتَدَّتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ عَيْنَ الشَّمْسِ، فَثَلَطَتْ وَبَالَتْ وَرَتَعَتْ، وَإِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، فَنِعْمَ صَاحِبُ الْمُسْلِمِ مَا أَعْطَى مِنْهُ الْمِسْكِينَ وَالْيَتِيمَ وَابْنَ السَّبِيلِ ـ أَوْ كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ـ وَإِنَّهُ مَنْ يَأْخُذُهُ بِغَيْرِ حَقِّهِ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَيَكُونُ شَهِيدًا عَلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ زَيْنَبَ، امْرَأَةِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ فَذَكَرْتُهُ لإِبْرَاهِيمَ فَحَدَّثَنِي إِبْرَاهِيمُ عَنْ أَبِي عُبَيْدَةَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بِمِثْلِهِ سَوَاءً، قَالَتْ كُنْتُ فِي الْمَسْجِدِ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ ‏\"‏‏.‏ وَكَانَتْ زَيْنَبُ تُنْفِقُ عَلَى عَبْدِ اللَّهِ وَأَيْتَامٍ فِي حَجْرِهَا، قَالَ فَقَالَتْ لِعَبْدِ اللَّهِ سَلْ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيَجْزِي عَنِّي أَنْ أُنْفِقَ عَلَيْكَ وَعَلَى أَيْتَامِي فِي حَجْرِي مِنَ الصَّدَقَةِ فَقَالَ سَلِي أَنْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ فَانْطَلَقْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ فَوَجَدْتُ امْرَأَةً مِنَ الأَنْصَارِ عَلَى الْبَابِ، حَاجَتُهَا مِثْلُ حَاجَتِي، فَمَرَّ عَلَيْنَا بِلاَلٌ فَقُلْنَا سَلِ النَّبِيَّ صلى الله عليه وسلم أَيَجْزِي عَنِّي أَنْ أُنْفِقَ عَلَى زَوْجِي وَأَيْتَامٍ لِي فِي حَجْرِي وَقُلْنَا لاَ تُخْبِرْ بِنَا‏.‏ فَدَخَلَ فَسَأَلَهُ فَقَالَ ‏\"‏ مَنْ هُمَا ‏\"‏‏.‏ قَالَ زَيْنَبُ قَالَ ‏\"‏ أَىُّ الزَّيَانِبِ ‏\"‏‏.‏ قَالَ امْرَأَةُ عَبْدِ اللَّهِ‏.‏ قَالَ ‏\"‏ نَعَمْ لَهَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، ‏{‏عَنْ أُمِّ سَلَمَةَ،‏}‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلِيَ أَجْرٌ أَنْ أُنْفِقَ عَلَى بَنِي أَبِي سَلَمَةَ إِنَّمَا هُمْ بَنِيَّ‏.‏ فَقَالَ ‏ \"‏ أَنْفِقِي عَلَيْهِمْ، فَلَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالصَّدَقَةِ فَقِيلَ مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلاَّ أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَرَسُولُهُ، وَأَمَّا خَالِدٌ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا، قَدِ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ، وَأَمَّا الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ فَعَمُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَهْىَ عَلَيْهِ صَدَقَةٌ وَمِثْلُهَا مَعَهَا ‏\"‏‏.‏ تَابَعَهُ ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنْ أَبِي الزِّنَادِ هِيَ عَلَيْهِ وَمِثْلُهَا مَعَهَا‏.‏ وَقَالَ ابْنُ جُرَيْجٍ حُدِّثْتُ عَنِ الأَعْرَجِ بِمِثْلِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ نَاسًا مِنَ الأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُمْ، ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ، حَتَّى نَفِدَ مَا عِنْدَهُ فَقَالَ ‏ \"‏ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ، وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ، وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ، وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ، وَمَا أُعْطِيَ أَحَدٌ عَطَاءً خَيْرًا وَأَوْسَعَ مِنَ الصَّبْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ فَيَحْتَطِبَ عَلَى ظَهْرِهِ خَيْرٌ لَهُ مِنْ أَنْ يَأْتِيَ رَجُلاً، فَيَسْأَلَهُ، أَعْطَاهُ أَوْ مَنَعَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ فَيَأْتِيَ بِحُزْمَةِ الْحَطَبِ عَلَى ظَهْرِهِ فَيَبِيعَهَا فَيَكُفَّ اللَّهُ بِهَا وَجْهَهُ، خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ مَنَعُوهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "وَحَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ ‏ \"‏ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏ قَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا، فَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدْعُو حَكِيمًا إِلَى الْعَطَاءِ فَيَأْبَى أَنْ يَقْبَلَهُ مِنْهُ، ثُمَّ إِنَّ عُمَرَ ـ رضى الله عنه ـ دَعَاهُ لِيُعْطِيَهُ فَأَبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا‏.‏ فَقَالَ عُمَرُ إِنِّي أُشْهِدُكُمْ يَا مَعْشَرَ الْمُسْلِمِينَ عَلَى حَكِيمٍ، أَنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ مِنْ هَذَا الْفَىْءِ فَيَأْبَى أَنْ يَأْخُذَهُ‏.‏ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنَ النَّاسِ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى تُوُفِّيَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ عُمَرَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي فَقَالَ ‏ \"‏ خُذْهُ، إِذَا جَاءَكَ مِنْ هَذَا الْمَالِ شَىْءٌ، وَأَنْتَ غَيْرُ مُشْرِفٍ وَلاَ سَائِلٍ، فَخُذْهُ، وَمَا لاَ فَلاَ تُتْبِعْهُ نَفْسَكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ الأُكْلَةُ وَالأُكْلَتَانِ، وَلَكِنِ الْمِسْكِينُ الَّذِي لَيْسَ لَهُ غِنًى وَيَسْتَحْيِي أَوْ لاَ يَسْأَلُ النَّاسَ إِلْحَافًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنِ ابْنِ أَشْوَعَ، عَنِ الشَّعْبِيِّ، حَدَّثَنِي كَاتِبُ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ بْنِ شُعْبَةَ أَنِ اكْتُبْ، إِلَىَّ بِشَىْءٍ سَمِعْتَهُ مِنَ النَّبِيِّ، صلى الله عليه وسلم‏.‏ فَكَتَبَ إِلَيْهِ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ كَرِهَ لَكُمْ ثَلاَثًا قِيلَ وَقَالَ، وَإِضَاعَةَ الْمَالِ، وَكَثْرَةَ السُّؤَالِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَهْطًا وَأَنَا جَالِسٌ فِيهِمْ قَالَ فَتَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهُمْ رَجُلاً لَمْ يُعْطِهِ، وَهُوَ أَعْجَبُهُمْ إِلَىَّ، فَقُمْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَارَرْتُهُ فَقُلْتُ مَا لَكَ عَنْ فُلاَنٍ وَاللَّهِ إِنِّي لأُرَاهُ مُؤْمِنًا‏.‏ قَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏ قَالَ فَسَكَتُّ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَعْلَمُ فِيهِ فَقُلْتُ يَا رَسُولَ اللَّهِ‏.‏ مَا لَكَ عَنْ فُلاَنٍ وَاللَّهِ إِنِّي لأُرَاهُ مُؤْمِنًا‏.‏ قَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏‏.‏ قَالَ فَسَكَتُّ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَعْلَمُ فِيهِ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ عَنْ فُلاَنٍ وَاللَّهِ إِنِّي لأُرَاهُ مُؤْمِنًا‏.‏ قَالَ ‏\"‏ أَوْ مُسْلِمًا ـ يَعْنِي فَقَالَ ـ إِنِّي لأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَىَّ مِنْهُ، خَشْيَةَ أَنْ يُكَبَّ فِي النَّارِ عَلَى وَجْهِهِ ‏\"‏‏.‏ وَعَنْ أَبِيهِ عَنْ صَالِحٍ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ أَنَّهُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ هَذَا فَقَالَ فِي حَدِيثِهِ فَضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ فَجَمَعَ بَيْنَ عُنُقِي وَكَتِفِي ثُمَّ قَالَ ‏\"‏ أَقْبِلْ أَىْ سَعْدُ إِنِّي لأُعْطِي الرَّجُلَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏فَكُبْكِبُوا‏}‏ قُلِبُوا ‏{‏مُكِبًّا‏}‏ أَكَبَّ الرَّجُلُ إِذَا كَانَ فِعْلُهُ غَيْرَ وَاقِعٍ عَلَى أَحَدٍ، فَإِذَا وَقَعَ الْفِعْلُ قُلْتَ كَبَّهُ اللَّهُ لِوَجْهِهِ، وَكَبَبْتُهُ أَنَا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ الْمِسْكِينُ الَّذِي يَطُوفُ عَلَى النَّاسِ تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ، وَلَكِنِ الْمِسْكِينُ الَّذِي لاَ يَجِدُ غِنًى يُغْنِيهِ، وَلاَ يُفْطَنُ بِهِ فَيُتَصَدَّقُ عَلَيْهِ، وَلاَ يَقُومُ فَيَسْأَلُ النَّاسَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ، ثُمَّ يَغْدُوَ ـ أَحْسِبُهُ قَالَ ـ إِلَى الْجَبَلِ فَيَحْتَطِبَ، فَيَبِيعَ فَيَأْكُلَ وَيَتَصَدَّقَ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ صَالِحُ بْنُ كَيْسَانَ أَكْبَرُ مِنَ الزُّهْرِيِّ، وَهُوَ قَدْ أَدْرَكَ ابْنَ عُمَرَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ أَوْ كَانَ عَثَرِيًّا الْعُشْرُ، وَمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا تَفْسِيرُ الأَوَّلِ لأَنَّهُ لَمْ يُوَقِّتْ فِي الأَوَّلِ ـ يَعْنِي حَدِيثَ ابْنِ عُمَرَ ـ وَفِيمَا سَقَتِ السَّمَاءُ الْعُشْرُ وَبَيَّنَ فِي هَذَا وَوَقَّتَ، وَالزِّيَادَةُ مَقْبُولَةٌ، وَالْمُفَسَّرُ يَقْضِي عَلَى الْمُبْهَمِ إِذَا رَوَاهُ أَهْلُ الثَّبَتِ، كَمَا رَوَى الْفَضْلُ بْنُ عَبَّاسٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يُصَلِّ فِي الْكَعْبَةِ‏.‏ وَقَالَ بِلاَلٌ قَدْ صَلَّى‏.‏ فَأُخِذَ بِقَوْلِ بِلاَلٍ وَتُرِكَ قَوْلُ الْفَضْلِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ فِيمَا أَقَلُّ مِنْ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ، وَلاَ فِي أَقَلَّ مِنْ خَمْسَةٍ مِنَ الإِبِلِ الذَّوْدِ صَدَقَةٌ، وَلاَ فِي أَقَلَّ مِنْ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا تَفْسِيرُ الأَوَّلِ إِذَا قَالَ ‏\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏‏.‏ وَيُؤْخَذُ أَبَدًا فِي الْعِلْمِ بِمَا زَادَ أَهْلُ الثَّبَتِ أَوْ بَيَّنُوا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ الْحَسَنِ الأَسَدِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُؤْتَى بِالتَّمْرِ عِنْدَ صِرَامِ النَّخْلِ فَيَجِيءُ هَذَا بِتَمْرِهِ وَهَذَا مِنْ تَمْرِهِ حَتَّى يَصِيرَ عِنْدَهُ كَوْمًا مِنْ تَمْرٍ، فَجَعَلَ الْحَسَنُ وَالْحُسَيْنُ ـ رضى الله عنهما ـ يَلْعَبَانِ بِذَلِكَ التَّمْرِ، فَأَخَذَ أَحَدُهُمَا تَمْرَةً، فَجَعَلَهَا فِي فِيهِ، فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْرَجَهَا مِنْ فِيهِ فَقَالَ ‏ \"‏ أَمَا عَلِمْتَ أَنَّ آلَ مُحَمَّدٍ صلى الله عليه وسلم لاَ يَأْكُلُونَ الصَّدَقَةَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرَةِ حَتَّى يَبْدُوَ صَلاَحُهَا‏.‏ وَكَانَ إِذَا سُئِلَ عَنْ صَلاَحِهَا قَالَ حَتَّى تَذْهَبَ عَاهَتُهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ‏.‏ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلاَحُهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ، قَالَ حَتَّى تَحْمَارَّ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يُحَدِّثُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ تَصَدَّقَ بِفَرَسٍ فِي سَبِيلِ اللَّهِ فَوَجَدَهُ يُبَاعُ، فَأَرَادَ أَنْ يَشْتَرِيَهُ، ثُمَّ أَتَى النَّبِيَّ صلى الله عليه وسلم فَاسْتَأْمَرَهُ فَقَالَ ‏ \"‏ لاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏ فَبِذَلِكَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ لاَ يَتْرُكُ أَنْ يَبْتَاعَ شَيْئًا تَصَدَّقَ بِهِ إِلاَّ جَعَلَهُ صَدَقَةً‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُمَرَ ـ رضى الله عنه ـ يَقُولُ حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ، فَأَضَاعَهُ الَّذِي كَانَ عِنْدَهُ، فَأَرَدْتُ أَنْ أَشْتَرِيَهُ، وَظَنَنْتُ أَنَّهُ يَبِيعُهُ بِرُخْصٍ، فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تَشْتَرِ وَلاَ تَعُدْ فِي صَدَقَتِكَ، وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ، فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَخَذَ الْحَسَنُ بْنُ عَلِيٍّ ـ رضى الله عنهما ـ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ، فَجَعَلَهَا فِي فِيهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ كِخٍ كِخٍ ـ لِيَطْرَحَهَا ثُمَّ قَالَ ـ أَمَا شَعَرْتَ أَنَّا لاَ نَأْكُلُ الصَّدَقَةَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبِّاسٍ ـ رضى الله عنهما ـ قَالَ وَجَدَ النَّبِيُّ صلى الله عليه وسلم شَاةً مَيِّتَةً أُعْطِيَتْهَا مَوْلاَةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلاَّ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ لِلْعِتْقِ، وَأَرَادَ مَوَالِيهَا أَنْ يَشْتَرِطُوا وَلاَءَهَا، فَذَكَرَتْ عَائِشَةُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَتْ وَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِلَحْمٍ فَقُلْتُ هَذَا مَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ ـ رضى الله عنها ـ قَالَتْ دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَقَالَ ‏\"‏ هَلْ عِنْدَكُمْ شَىْءٌ ‏\"‏‏.‏ فَقَالَتْ لاَ‏.‏ إِلاَّ شَىْءٌ بَعَثَتْ بِهِ إِلَيْنَا نُسَيْبَةُ مِنَ الشَّاةِ الَّتِي بَعَثْتَ بِهَا مِنَ الصَّدَقَةِ‏.‏ فَقَالَ ‏\"‏ إِنَّهَا قَدْ بَلَغَتْ مَحِلَّهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِلَحْمٍ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ ‏ \"‏ هُوَ عَلَيْهَا صَدَقَةٌ، وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏‏.‏ وَقَالَ أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُعَاذِ بْنِ جَبَلٍ حِينَ بَعَثَهُ إِلَى الْيَمَنِ ‏ \"‏ إِنَّكَ سَتَأْتِي قَوْمًا أَهْلَ كِتَابٍ، فَإِذَا جِئْتَهُمْ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَإِنْ هُمْ أَطَاعُوا لَكَ بِذَلِكَ، فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، فَإِنْ هُمْ أَطَاعُوا لَكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ صَدَقَةً تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ عَلَى فُقَرَائِهِمْ، فَإِنْ هُمْ أَطَاعُوا لَكَ بِذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ، وَاتَّقِ دَعْوَةَ الْمَظْلُومِ، فَإِنَّهُ لَيْسَ بَيْنَهُ وَبَيْنَ اللَّهِ حِجَابٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ فُلاَنٍ ‏\"‏‏.‏ فَأَتَاهُ أَبِي بِصَدَقَتِهِ، فَقَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ أَنَّ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ بِأَنْ يُسْلِفَهُ أَلْفَ دِينَارٍ، فَدَفَعَهَا إِلَيْهِ، فَخَرَجَ فِي الْبَحْرِ، فَلَمْ يَجِدْ مَرْكَبًا، فَأَخَذَ خَشَبَةً فَنَقَرَهَا فَأَدْخَلَ فِيهَا أَلْفَ دِينَارٍ، فَرَمَى بِهَا فِي الْبَحْرِ، فَخَرَجَ الرَّجُلُ الَّذِي كَانَ أَسْلَفَهُ، فَإِذَا بِالْخَشَبَةِ فَأَخَذَهَا لأَهْلِهِ حَطَبًا ـ فَذَكَرَ الْحَدِيثَ ـ فَلَمَّا نَشَرَهَا وَجَدَ الْمَالَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعَجْمَاءُ جُبَارٌ، وَالْبِئْرُ جُبَارٌ، وَالْمَعْدِنُ جُبَارٌ، وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ قَالَ اسْتَعْمَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً مِنَ الأَسْدِ عَلَى صَدَقَاتِ بَنِي سُلَيْمٍ يُدْعَى ابْنَ اللُّتْبِيَّةِ، فَلَمَّا جَاءَ حَاسَبَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ نَاسًا، مِنْ عُرَيْنَةَ اجْتَوَوُا الْمَدِينَةَ، فَرَخَّصَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَقَتَلُوا الرَّاعِيَ وَاسْتَاقُوا الذَّوْدَ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُتِيَ بِهِمْ، فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَرَ أَعْيُنَهُمْ، وَتَرَكَهُمْ بِالْحَرَّةِ يَعَضُّونَ الْحِجَارَةَ‏.‏ تَابَعَهُ أَبُو قِلاَبَةَ وَحُمَيْدٌ وَثَابِتٌ عَنْ أَنَسٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو الأَوْزَاعِيُّ، حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ غَدَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ لِيُحَنِّكَهُ، فَوَافَيْتُهُ فِي يَدِهِ الْمِيسَمُ يَسِمُ إِبِلَ الصَّدَقَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْعَبْدِ وَالْحُرِّ، وَالذَّكَرِ وَالأُنْثَى، وَالصَّغِيرِ وَالْكَبِيرِ مِنَ الْمُسْلِمِينَ، وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ، ذَكَرٍ أَوْ أُنْثَى، مِنَ الْمُسْلِمِينَ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُطْعِمُ الصَّدَقَةَ صَاعًا مِنْ شَعِيرٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ الْعَامِرِيِّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يَقُولُ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ أَقِطٍ، أَوْ صَاعًا مِنْ زَبِيبٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِزَكَاةِ الْفِطْرِ، صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ‏.‏ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ فَجَعَلَ النَّاسُ عِدْلَهُ مُدَّيْنِ مِنْ حِنْطَةٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ يَزِيدَ الْعَدَنِيَّ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ حَدَّثَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ كُنَّا نُعْطِيهَا فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم صَاعًا مِنْ طَعَامٍ، أَوْ صَاعًا مِنْ تَمْرٍ، أَوْ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ زَبِيبٍ، فَلَمَّا جَاءَ مُعَاوِيَةُ وَجَاءَتِ السَّمْرَاءُ قَالَ أُرَى مُدًّا مِنْ هَذَا يَعْدِلُ مُدَّيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِزَكَاةِ الْفِطْرِ قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا أَبُو عُمَرَ، عَنْ زَيْدٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ كُنَّا نُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ‏.‏ وَقَالَ أَبُو سَعِيدٍ وَكَانَ طَعَامَنَا الشَّعِيرُ وَالزَّبِيبُ وَالأَقِطُ وَالتَّمْرُ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ فَرَضَ النَّبِيُّ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ ـ أَوْ قَالَ رَمَضَانَ ـ عَلَى الذَّكَرِ وَالأُنْثَى، وَالْحُرِّ وَالْمَمْلُوكِ، صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ، فَعَدَلَ النَّاسُ بِهِ نِصْفَ صَاعٍ مِنْ بُرٍّ‏.‏ فَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُعْطِي التَّمْرَ، فَأَعْوَزَ أَهْلُ الْمَدِينَةِ مِنَ التَّمْرِ فَأَعْطَى شَعِيرًا، فَكَانَ ابْنُ عُمَرَ يُعْطِي عَنِ الصَّغِيرِ وَالْكَبِيرِ، حَتَّى إِنْ كَانَ يُعْطِي عَنْ بَنِيَّ، وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُعْطِيهَا الَّذِينَ يَقْبَلُونَهَا، وَكَانُوا يُعْطُونَ قَبْلَ الْفِطْرِ بِيَوْمٍ أَوْ يَوْمَيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنه ـ قَالَ فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ، أَوْ صَاعًا مِنْ تَمْرٍ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْمَمْلُوكِ‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 112
			}
		}
	]
}