{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"27": "Pilgrims Prevented from Completing the Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ حِينَ خَرَجَ إِلَى مَكَّةَ مُعْتَمِرًا فِي الْفِتْنَةِ قَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْتُ كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَهَلَّ بِعُمْرَةٍ، مِنْ أَجْلِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَاهُ أَنَّهُمَا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ لَيَالِيَ نَزَلَ الْجَيْشُ بِابْنِ الزُّبَيْرِ فَقَالاَ لاَ يَضُرُّكَ أَنْ لاَ تَحُجَّ الْعَامَ، وَإِنَّا نَخَافُ أَنْ يُحَالَ بَيْنَكَ وَبَيْنَ الْبَيْتِ‏.‏ فَقَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ النَّبِيُّ صلى الله عليه وسلم هَدْيَهُ، وَحَلَقَ رَأْسَهُ، وَأُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْعُمْرَةَ، إِنْ شَاءَ اللَّهُ أَنْطَلِقُ، فَإِنْ خُلِّيَ بَيْنِي وَبَيْنَ الْبَيْتِ طُفْتُ، وَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَعَهُ‏.‏ فَأَهَلَّ بِالْعُمْرَةِ مِنْ ذِي الْحُلَيْفَةِ، ثُمَّ سَارَ سَاعَةً، ثُمَّ قَالَ ‏ \"‏ إِنَّمَا شَأْنُهُمَا وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَتِي ‏\"‏‏.‏ فَلَمْ يَحِلَّ مِنْهُمَا حَتَّى حَلَّ يَوْمَ النَّحْرِ، وَأَهْدَى، وَكَانَ يَقُولُ لاَ يَحِلُّ حَتَّى يَطُوفَ طَوَافًا وَاحِدًا يَوْمَ يَدْخُلُ مَكَّةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ بَعْضَ بَنِي عَبْدِ اللَّهِ، قَالَ لَهُ لَوْ أَقَمْتَ‏.‏ بِهَذَا‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، قَالَ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ أُحْصِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَلَقَ رَأْسَهُ وَجَامَعَ نِسَاءَهُ، وَنَحَرَ هَدْيَهُ، حَتَّى اعْتَمَرَ عَامًا قَابِلاً‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ أَلَيْسَ حَسْبُكُمْ سُنَّةَ رَسُولِ اللَّهِ صلى الله عليه وسلم، إِنْ حُبِسَ أَحَدُكُمْ عَنِ الْحَجِّ طَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلَّ مِنْ كُلِّ شَىْءٍ، حَتَّى يَحُجَّ عَامًا قَابِلاً، فَيُهْدِي أَوْ يَصُومُ، إِنْ لَمْ يَجِدْ هَدْيًا‏.‏ وَعَنْ عَبْدِ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ، نَحْوَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنِ الْمِسْوَرِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَحَرَ قَبْلَ أَنْ يَحْلِقَ، وَأَمَرَ أَصْحَابَهُ بِذَلِكَ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا أَبُو بَدْرٍ، شُجَاعُ بْنُ الْوَلِيدِ عَنْ عُمَرَ بْنِ مُحَمَّدٍ الْعُمَرِيِّ، قَالَ وَحَدَّثَ نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، وَسَالِمًا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ فَقَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مُعْتَمِرِينَ، فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بُدْنَهُ، وَحَلَقَ رَأْسَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ حِينَ خَرَجَ إِلَى مَكَّةَ مُعْتَمِرًا فِي الْفِتْنَةِ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَهَلَّ بِعُمْرَةٍ، مِنْ أَجْلِ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ، ثُمَّ إِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ نَظَرَ فِي أَمْرِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ‏.‏ فَالْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ، ثُمَّ طَافَ لَهُمَا طَوَافًا وَاحِدًا، وَرَأَى أَنَّ ذَلِكَ مُجْزِيًا عَنْهُ، وَأَهْدَى‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لَعَلَّكَ آذَاكَ هَوَامُّكَ ‏\"‏‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْلِقْ رَأْسَكَ وَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، أَوِ انْسُكْ بِشَاةٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفٌ، قَالَ حَدَّثَنِي مُجَاهِدٌ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، أَنَّ كَعْبَ بْنَ عُجْرَةَ، حَدَّثَهُ قَالَ وَقَفَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ، وَرَأْسِي يَتَهَافَتُ قَمْلاً فَقَالَ ‏\"‏ يُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاحْلِقْ رَأْسَكَ ـ أَوْ قَالَ ـ احْلِقْ ‏\"‏‏.‏ قَالَ فِيَّ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ‏}‏ إِلَى آخِرِهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ تَصَدَّقْ بِفَرَقٍ بَيْنَ سِتَّةٍ، أَوِ انْسُكْ بِمَا تَيَسَّرَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبِهَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ، قَالَ جَلَسْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ فَسَأَلْتُهُ عَنِ الْفِدْيَةِ، فَقَالَ نَزَلَتْ فِيَّ خَاصَّةً، وَهْىَ لَكُمْ عَامَّةً، حُمِلْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ مَا كُنْتُ أُرَى الْوَجَعَ بَلَغَ بِكَ مَا أَرَى أَوْ مَا كُنْتُ أُرَى الْجَهْدَ بَلَغَ بِكَ مَا أَرَى، تَجِدُ شَاةً ‏\"‏‏.‏ فَقُلْتُ لاَ‏.‏ فَقَالَ ‏\"‏ فَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، لِكُلِّ مِسْكِينٍ نِصْفَ صَاعٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شِبْلٌ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَآهُ وَأَنَّهُ يَسْقُطُ عَلَى وَجْهِهِ فَقَالَ ‏ \"‏ أَيُؤْذِيكَ هَوَامُّكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَهُ أَنْ يَحْلِقَ وَهُوَ بِالْحُدَيْبِيَةِ، وَلَمْ يَتَبَيَّنْ لَهُمْ أَنَّهُمْ يَحِلُّونَ بِهَا، وَهُمْ عَلَى طَمَعٍ أَنْ يَدْخُلُوا مَكَّةَ، فَأَنْزَلَ اللَّهُ الْفِدْيَةَ، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُطْعِمَ فَرَقًا بَيْنَ سِتَّةٍ، أَوْ يُهْدِيَ شَاةً، أَوْ يَصُومَ ثَلاَثَةَ أَيَّامٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "وَعَنْ مُحَمَّدِ بْنِ يُوسُفَ، حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَآهُ، وَقَمْلُهُ يَسْقُطُ عَلَى وَجْهِهِ‏.‏ مِثْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ حَجَّ هَذَا الْبَيْتَ، فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ، رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ حَجَّ هَذَا الْبَيْتَ، فَلَمْ يَرْفُثْ، وَلَمْ يَفْسُقْ، رَجَعَ كَيَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		}
	]
}