{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"47": "Partnership"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا قِبَلَ السَّاحِلِ، فَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَهُمْ ثَلاَثُمِائَةٍ وَأَنَا فِيهِمْ، فَخَرَجْنَا حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ فَنِيَ الزَّادُ، فَأَمَرَ أَبُو عُبَيْدَةَ بِأَزْوَادِ ذَلِكَ الْجَيْشِ فَجُمِعَ ذَلِكَ كُلُّهُ فَكَانَ مِزْوَدَىْ تَمْرٍ، فَكَانَ يُقَوِّتُنَا كُلَّ يَوْمٍ قَلِيلاً قَلِيلاً، حَتَّى فَنِيَ فَلَمْ يَكُنْ يُصِيبُنَا إِلاَّ تَمْرَةٌ تَمْرَةٌ‏.‏ فَقُلْتُ وَمَا تُغْنِي تَمْرَةٌ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَنِيَتْ‏.‏ قَالَ ثُمَّ انْتَهَيْنَا إِلَى الْبَحْرِ فَإِذَا حُوتٌ مِثْلُ الظَّرِبِ، فَأَكَلَ مِنْهُ ذَلِكَ الْجَيْشُ ثَمَانِيَ عَشْرَةَ لَيْلَةً، ثُمَّ أَمَرَ أَبُو عُبَيْدَةَ بِضِلَعَيْنِ مِنْ أَضْلاَعِهِ فَنُصِبَا، ثُمَّ أَمَرَ بِرَاحِلَةٍ فَرُحِلَتْ ثُمَّ مَرَّتْ تَحْتَهُمَا فَلَمْ تُصِبْهُمَا‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "حَدَّثَنَا بِشْرُ بْنُ مَرْحُومٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ ـ رضى الله عنه ـ قَالَ خَفَّتْ أَزْوَادُ الْقَوْمِ وَأَمْلَقُوا، فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فِي نَحْرِ إِبِلِهِمْ فَأَذِنَ لَهُمْ، فَلَقِيَهُمْ عُمَرُ فَأَخْبَرُوهُ فَقَالَ مَا بَقَاؤُكُمْ بَعْدَ إِبِلِكُمْ، فَدَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا بَقَاؤُهُمْ بَعْدَ إِبِلِهِمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَادِ فِي النَّاسِ فَيَأْتُونَ بِفَضْلِ أَزْوَادِهِمْ ‏\"‏‏.‏ فَبُسِطَ لِذَلِكَ نِطَعٌ، وَجَعَلُوهُ عَلَى النِّطَعِ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَعَا وَبَرَّكَ عَلَيْهِ ثُمَّ دَعَاهُمْ بِأَوْعِيَتِهِمْ فَاحْتَثَى النَّاسُ حَتَّى فَرَغُوا، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا أَبُو النَّجَاشِيِّ، قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ فَنَنْحَرُ جَزُورًا، فَتُقْسَمُ عَشْرَ قِسَمٍ، فَنَأْكُلُ لَحْمًا نَضِيجًا قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الأَشْعَرِيِّينَ إِذَا أَرْمَلُوا فِي الْغَزْوِ، أَوْ قَلَّ طَعَامُ عِيَالِهِمْ بِالْمَدِينَةِ جَمَعُوا مَا كَانَ عِنْدَهُمْ فِي ثَوْبٍ وَاحِدٍ، ثُمَّ اقْتَسَمُوهُ بَيْنَهُمْ فِي إِنَاءٍ وَاحِدٍ بِالسَّوِيَّةِ، فَهُمْ مِنِّي وَأَنَا مِنْهُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ فَرِيضَةَ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ الْحَكَمِ الأَنْصَارِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ جَدِّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ فَأَصَابَ النَّاسَ جُوعٌ فَأَصَابُوا إِبِلاً وَغَنَمًا‏.‏ قَالَ وَكَانَ النَّبِيُّ صلى الله عليه وسلم فِي أُخْرَيَاتِ الْقَوْمِ فَعَجِلُوا وَذَبَحُوا وَنَصَبُوا الْقُدُورَ، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْقُدُورِ فَأُكْفِئَتْ، ثُمَّ قَسَمَ فَعَدَلَ عَشْرَةً مِنَ الْغَنَمِ بِبَعِيرٍ فَنَدَّ مِنْهَا بَعِيرٌ، فَطَلَبُوهُ فَأَعْيَاهُمْ، وَكَانَ فِي الْقَوْمِ خَيْلٌ يَسِيرَةٌ فَأَهْوَى رَجُلٌ مِنْهُمْ بِسَهْمٍ فَحَبَسَهُ اللَّهُ ثُمَّ قَالَ ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ فَقَالَ جَدِّي إِنَّا نَرْجُو ـ أَوْ نَخَافُ ـ الْعَدُوَّ غَدًا، وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ‏.‏ قَالَ ‏\"‏ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ، فَكُلُوهُ، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَقْرُنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ جَمِيعًا، حَتَّى يَسْتَأْذِنَ أَصْحَابَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ، قَالَ كُنَّا بِالْمَدِينَةِ فَأَصَابَتْنَا سَنَةٌ، فَكَانَ ابْنُ الزُّبَيْرِ يَرْزُقُنَا التَّمْرَ، وَكَانَ ابْنُ عُمَرَ يَمُرُّ بِنَا فَيَقُولُ لاَ تَقْرُنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الإِقْرَانِ، إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ مِنْكُمْ أَخَاهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَعْتَقَ شِقْصًا لَهُ مِنْ عَبْدٍ ـ أَوْ شِرْكًا أَوْ قَالَ نَصِيبًا ـ وَكَانَ لَهُ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَدْلِ، فَهْوَ عَتِيقٌ، وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏‏.‏ قَالَ لاَ أَدْرِي قَوْلُهُ عَتَقَ مِنْهُ مَا عَتَقَ‏.‏ قَوْلٌ مِنْ نَافِعٍ أَوْ فِي الْحَدِيثِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شَقِيصًا مِنْ مَمْلُوكِهِ فَعَلَيْهِ خَلاَصُهُ فِي مَالِهِ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ الْمَمْلُوكُ، قِيمَةَ عَدْلٍ ثُمَّ اسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ سَمِعْتُ عَامِرًا، يَقُولُ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْقَائِمِ عَلَى حُدُودِ اللَّهِ وَالْوَاقِعِ فِيهَا كَمَثَلِ قَوْمٍ اسْتَهَمُوا عَلَى سَفِينَةٍ، فَأَصَابَ بَعْضُهُمْ أَعْلاَهَا وَبَعْضُهُمْ أَسْفَلَهَا، فَكَانَ الَّذِينَ فِي أَسْفَلِهَا إِذَا اسْتَقَوْا مِنَ الْمَاءِ مَرُّوا عَلَى مَنْ فَوْقَهُمْ فَقَالُوا لَوْ أَنَّا خَرَقْنَا فِي نَصِيبِنَا خَرْقًا، وَلَمْ نُؤْذِ مَنْ فَوْقَنَا‏.‏ فَإِنْ يَتْرُكُوهُمْ وَمَا أَرَادُوا هَلَكُوا جَمِيعًا، وَإِنْ أَخَذُوا عَلَى أَيْدِيهِمْ نَجَوْا وَنَجَوْا جَمِيعًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْعَامِرِيُّ الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ عَنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ‏}‏ إِلَى ‏{‏وَرُبَاعَ‏}‏‏.‏ فَقَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا تُشَارِكُهُ فِي مَالِهِ، فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا، فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا، فَيُعْطِيهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ، فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ، وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى قَوْلِهِ ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ الآيَةُ الأُولَى الَّتِي قَالَ فِيهَا ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ فِي الآيَةِ الأُخْرَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ يَعْنِي هِيَ رَغْبَةُ أَحَدِكُمْ لِيَتِيمَتِهِ الَّتِي تَكُونُ فِي حَجْرِهِ، حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ، فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلاَّ بِالْقِسْطِ مِنْ، أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ إِنَّمَا جَعَلَ النَّبِيُّ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ الْيَهُودَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ ضَحَايَا، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ ضَحِّ بِهِ أَنْتَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ وَجَبَ عَلَيْهِ أَنْ يُعْتِقَ كُلَّهُ، إِنْ كَانَ لَهُ مَالٌ قَدْرَ ثَمَنِهِ يُقَامُ قِيمَةَ عَدْلٍ وَيُعْطَى شُرَكَاؤُهُ حِصَّتَهُمْ وَيُخَلَّى سَبِيلُ الْمُعْتَقِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِقْصًا لَهُ فِي عَبْدٍ، أُعْتِقَ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ، وَإِلاَّ يُسْتَسْعَ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ، فَأَصَبْنَا غَنَمًا وَإِبِلاً، فَعَجِلَ الْقَوْمُ، فَأَغْلَوْا بِهَا الْقُدُورَ، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَأُكْفِئَتْ، ثُمَّ عَدَلَ عَشْرًا مِنَ الْغَنَمِ بِجَزُورٍ، ثُمَّ إِنَّ بَعِيرًا نَدَّ وَلَيْسَ فِي الْقَوْمِ إِلاَّ خَيْلٌ يَسِيرَةٌ فَرَمَاهُ رَجُلٌ فَحَبَسَهُ بِسَهْمٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ قَالَ قَالَ جَدِّي يَا رَسُولَ اللَّهِ إِنَّا نَرْجُو ـ أَوْ نَخَافُ ـ أَنْ نَلْقَى الْعَدُوَّ غَدًا وَلَيْسَ مَعَنَا مُدًى، فَنَذْبَحُ بِالْقَصَبِ فَقَالَ ‏\"‏ اعْجَلْ أَوْ أَرْنِي، مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلُوا، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، أَمَّا السِّنُّ فَعَظْمٌ، وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		}
	]
}