{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"54": "Conditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2712,
			"arabicnumber": 2712,
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2713,
			"arabicnumber": 2713,
			"text": "قَالَ عُرْوَةُ فَأَخْبَرَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُهُنَّ بِهَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ ‏}‏ إِلَى ‏{‏غَفُورٌ رَحِيمٌ‏}‏‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنْهُنَّ قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ بَايَعْتُكِ ‏\"‏‏.‏ كَلاَمًا يُكَلِّمُهَا بِهِ، وَاللَّهِ مَا مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ فِي الْمُبَايَعَةِ، وَمَا بَايَعَهُنَّ إِلاَّ بِقَوْلِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2714,
			"arabicnumber": 2714,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، قَالَ سَمِعْتُ جَرِيرًا ـ رضى الله عنه ـ يَقُولُ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاشْتَرَطَ عَلَىَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2715,
			"arabicnumber": 2715,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2716,
			"arabicnumber": 2716,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2717,
			"arabicnumber": 2717,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةََ،ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، قَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ إِلَى أَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ لَنَا وَلاَؤُكِ‏.‏ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا ‏ \"‏ ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2718,
			"arabicnumber": 2718,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ سَمِعْتُ عَامِرًا، يَقُولُ حَدَّثَنِي جَابِرٌ ـ رضى الله عنه أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قَدْ أَعْيَا، فَمَرَّ النَّبِيُّ صلى الله عليه وسلم فَضَرَبَهُ، فَدَعَا لَهُ، فَسَارَ بِسَيْرٍ لَيْسَ يَسِيرُ مِثْلَهُ ثُمَّ قَالَ ‏\"‏ بِعْنِيهِ بِوَقِيَّةٍ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ ثُمَّ قَالَ ‏\"‏ بِعْنِيهِ بِوَقِيَّةٍ ‏\"‏‏.‏ فَبِعْتُهُ فَاسْتَثْنَيْتُ حُمْلاَنَهُ إِلَى أَهْلِي، فَلَمَّا قَدِمْنَا أَتَيْتُهُ بِالْجَمَلِ، وَنَقَدَنِي ثَمَنَهُ، ثُمَّ انْصَرَفْتُ، فَأَرْسَلَ عَلَى إِثْرِي، قَالَ ‏\"‏ مَا كُنْتُ لآخُذَ جَمَلَكَ، فَخُذْ جَمَلَكَ ذَلِكَ فَهْوَ مَالُكَ ‏\"‏‏.‏ قَالَ شُعْبَةُ عَنْ مُغِيرَةَ عَنْ عَامِرٍ عَنْ جَابِرٍ أَفْقَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ظَهْرَهُ إِلَىَ الْمَدِينَةِ‏.‏ وَقَالَ إِسْحَاقُ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ فَبِعْتُهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ‏.‏ وَقَالَ عَطَاءٌ وَغَيْرُهُ لَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ، وَقَالَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ شَرَطَ ظَهْرَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ زَيْدُ بْنُ أَسْلَمَ عَنْ جَابِرٍ وَلَكَ ظَهْرُهُ حَتَّى تَرْجِعَ‏.‏ وَقَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَفْقَرْنَاكَ ظَهْرَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ الأَعْمَشُ عَنْ سَالِمٍ عَنْ جَابِرٍ تَبَلَّغْ عَلَيْهِ إِلَى أَهْلِكَ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ وَابْنُ إِسْحَاقَ عَنْ وَهْبٍ عَنْ جَابِرٍ اشْتَرَاهُ النَّبِيُّ صلى الله عليه وسلم بِوَقِيَّةٍ‏.‏ وَتَابَعَهُ زَيْدُ بْنُ أَسْلَمَ عَنْ جَابِرٍ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ وَغَيْرِهِ عَنْ جَابِرٍ أَخَذْتُهُ بِأَرْبَعَةِ دَنَانِيرَ‏.‏ وَهَذَا يَكُونُ وَقِيَّةً عَلَى حِسَابِ الدِّينَارِ بِعَشَرَةِ دَرَاهِمَ‏.‏ وَلَمْ يُبَيِّنِ الثَّمَنَ مُغِيرَةُ عَنِ الشَّعْبِيِّ عَنْ جَابِرٍ، وَابْنُ الْمُنْكَدِرِ وَأَبُو الزُّبَيْرِ عَنْ جَابِرٍ‏.‏ وَقَالَ الأَعْمَشُ عَنْ سَالِمٍ عَنْ جَابِرٍ وَقِيَّةُ ذَهَبٍ‏.‏ وَقَالَ أَبُو إِسْحَاقَ عَنْ سَالِمٍ عَنْ جَابِرٍ بِمِائَتَىْ دِرْهَمٍ‏.‏ وَقَالَ دَاوُدُ بْنُ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرٍ اشْتَرَاهُ بِطَرِيقِ تَبُوكَ، أَحْسِبُهُ قَالَ بِأَرْبَعِ أَوَاقٍ‏.‏ وَقَالَ أَبُو نَضْرَةَ عَنْ جَابِرٍ اشْتَرَاهُ بِعِشْرِينَ دِينَارًا‏.‏ وَقَوْلُ الشَّعْبِيِّ بِوَقِيَّةٍ أَكْثَرُ‏.‏ الاِشْتِرَاطُ أَكْثَرُ وَأَصَحُّ عِنْدِي‏.‏ قَالَهُ أَبُو عَبْدِ اللَّهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَتِ الأَنْصَارُ لِلنَّبِيِّ صلى الله عليه وسلم اقْسِمْ بَيْنَنَا وَبَيْنَ إِخْوَانِنَا النَّخِيلَ‏.‏ قَالَ ‏ \"‏ لاَ ‏\"‏‏.‏ فَقَالَ تَكْفُونَا الْمَئُونَةَ وَنُشْرِكُكُمْ فِي الثَّمَرَةِ‏.‏ قَالُوا سَمِعْنَا وَأَطَعْنَا‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ الْيَهُودَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا، وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَحَقُّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ حَنْظَلَةَ الزُّرَقِيَّ، قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ ـ رضى الله عنه ـ يَقُولُ كُنَّا أَكْثَرَ الأَنْصَارِ حَقْلاً، فَكُنَّا نُكْرِي الأَرْضَ، فَرُبَّمَا أَخْرَجَتْ هَذِهِ وَلَمْ تُخْرِجْ ذِهِ، فَنُهِينَا عَنْ ذَلِكَ، وَلَمْ نُنْهَ عَنِ الْوَرِقِ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ، وَلاَ تَنَاجَشُوا، وَلاَ يَزِيدَنَّ عَلَى بَيْعِ أَخِيهِ، وَلاَ يَخْطُبَنَّ عَلَى خِطْبَتِهِ، وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَكْفِئَ إِنَاءَهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، رضى الله عنهم أَنَّهُمَا قَالاَ إِنَّ رَجُلاً مِنَ الأَعْرَابِ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولَ اللَّهِ أَنْشُدُكَ اللَّهَ إِلاَّ قَضَيْتَ لِي بِكِتَابِ اللَّهِ‏.‏ فَقَالَ الْخَصْمُ الآخَرُ وَهْوَ أَفْقَهُ مِنْهُ نَعَمْ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَائْذَنْ لِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا، فَزَنَى بِامْرَأَتِهِ، وَإِنِّي أُخْبِرْتُ أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَوَلِيدَةٍ، فَسَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ، وَتَغْرِيبُ عَامٍ، وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، الْوَلِيدَةُ وَالْغَنَمُ رَدٌّ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، اغْدُ يَا أُنَيْسُ إِلَى امْرَأَةِ هَذَا فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ قَالَ فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ، فَأَمَرَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَتْ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ الْمَكِّيُّ، عَنْ أَبِيهِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَتْ عَلَىَّ بَرِيرَةُ وَهْىَ مُكَاتَبَةٌ، فَقَالَتْ يَا أُمَّ الْمُؤْمِنِينَ اشْتَرِينِي فَإِنَّ أَهْلِي يَبِيعُونِي فَأَعْتِقِينِي قَالَتْ نَعَمْ‏.‏ قَالَتْ إِنَّ أَهْلِي لاَ يَبِيعُونِي حَتَّى يَشْتَرِطُوا وَلاَئِي‏.‏ قَالَتْ لاَ حَاجَةَ لِي فِيكِ‏.‏ فَسَمِعَ ذَلِكَ النَّبِيُّ صلى الله عليه وسلم أَوْ بَلَغَهُ، فَقَالَ ‏\"‏ مَا شَأْنُ بَرِيرَةَ فَقَالَ اشْتَرِيهَا فَأَعْتِقِيهَا وَلْيَشْتَرِطُوا مَا شَاءُوا ‏\"‏‏.‏ قَالَتْ فَاشْتَرَيْتُهَا فَأَعْتَقْتُهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ، وَإِنِ اشْتَرَطُوا مِائَةَ شَرْطٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّلَقِّي، وَأَنْ يَبْتَاعَ الْمُهَاجِرُ لِلأَعْرَابِيِّ، وَأَنْ تَشْتَرِطَ الْمَرْأَةُ طَلاَقَ أُخْتِهَا، وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ، وَنَهَى عَنِ النَّجْشِ، وَعَنِ التَّصْرِيَةِ‏.‏ تَابَعَهُ مُعَاذٌ وَعَبْدُ الصَّمَدِ عَنْ شُعْبَةَ‏.‏ وَقَالَ غُنْدَرٌ وَعَبْدُ الرَّحْمَنِ نُهِيَ‏.‏ وَقَالَ آدَمُ نُهِينَا‏.‏ وَقَالَ النَّضْرُ وَحَجَّاجُ بْنُ مِنْهَالٍ نَهَى‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ وَغَيْرُهُمَا قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ إِنَّا لَعِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُوسَى رَسُولُ اللَّهِ ‏\"‏ فَذَكَرَ الْحَدِيثَ ‏{‏قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا‏}‏ كَانَتِ الأُولَى نِسْيَانًا، وَالْوُسْطَى شَرْطًا، وَالثَّالِثَةُ عَمْدًا ‏{‏قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا‏}‏‏.‏ ‏{‏لَقِيَا غُلاَمًا فَقَتَلَهُ‏}‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ‏.‏ قَرَأَهَا ابْنُ عَبَّاسٍ أَمَامَهُمْ مَلِكٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْنِي بَرِيرَةُ فَقَالَتْ كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ، فَأَعِينِينِي‏.‏ فَقَالَتْ إِنْ أَحَبُّوا أَنْ أَعُدَّهَا لَهُمْ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا، فَقَالَتْ لَهُمْ، فَأَبَوْا عَلَيْهَا، فَجَاءَتْ مِنْ عِنْدِهِمْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ، فَقَالَتْ إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ‏.‏ فَسَمِعَ النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَتْ عَائِشَةُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ خُذِيهَا وَاشْتَرِطِي لَهُمُ الْوَلاَءَ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ فَفَعَلَتْ عَائِشَةُ، ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، قَضَاءُ اللَّهِ أَحَقُّ، وَشَرْطُ اللَّهِ أَوْثَقُ، وَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى أَبُو غَسَّانَ الْكِنَانِيُّ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا فَدَعَ أَهْلُ خَيْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَامَ عُمَرُ خَطِيبًا فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَامَلَ يَهُودَ خَيْبَرَ عَلَى أَمْوَالِهِمْ، وَقَالَ ‏\"‏ نُقِرُّكُمْ مَا أَقَرَّكُمُ اللَّهُ ‏\"‏‏.‏ وَإِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ خَرَجَ إِلَى مَالِهِ هُنَاكَ فَعُدِيَ عَلَيْهِ مِنَ اللَّيْلِ، فَفُدِعَتْ يَدَاهُ وَرِجْلاَهُ، وَلَيْسَ لَنَا هُنَاكَ عَدُوٌّ غَيْرُهُمْ، هُمْ عَدُوُّنَا وَتُهَمَتُنَا، وَقَدْ رَأَيْتُ إِجْلاَءَهُمْ، فَلَمَّا أَجْمَعَ عُمَرُ عَلَى ذَلِكَ أَتَاهُ أَحَدُ بَنِي أَبِي الْحُقَيْقِ، فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ، أَتُخْرِجُنَا وَقَدْ أَقَرَّنَا مُحَمَّدٌ صلى الله عليه وسلم وَعَامَلَنَا عَلَى الأَمْوَالِ، وَشَرَطَ ذَلِكَ لَنَا فَقَالَ عُمَرُ أَظَنَنْتَ أَنِّي نَسِيتُ قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ بِكَ إِذَا أُخْرِجْتَ مِنْ خَيْبَرَ تَعْدُو بِكَ قَلُوصُكَ، لَيْلَةً بَعْدَ لَيْلَةٍ ‏\"‏‏.‏ فَقَالَ كَانَتْ هَذِهِ هُزَيْلَةً مِنْ أَبِي الْقَاسِمِ‏.‏ قَالَ كَذَبْتَ يَا عَدُوَّ اللَّهِ‏.‏ فَأَجْلاَهُمْ عُمَرُ وَأَعْطَاهُمْ قِيمَةَ مَا كَانَ لَهُمْ مِنَ الثَّمَرِ مَالاً وَإِبِلاً وَعُرُوضًا، مِنْ أَقْتَابٍ وَحِبَالٍ وَغَيْرِ ذَلِكَ‏.‏ رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ، أَحْسِبُهُ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، اخْتَصَرَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "وَقَالَ عُقَيْلٌ عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ فَأَخْبَرَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُهُنَّ، وَبَلَغَنَا أَنَّهُ لَمَّا أَنْزَلَ اللَّهُ تَعَالَى أَنْ يَرُدُّوا إِلَى الْمُشْرِكِينَ مَا أَنْفَقُوا عَلَى مَنْ هَاجَرَ مِنْ أَزْوَاجِهِمْ، وَحَكَمَ عَلَى الْمُسْلِمِينَ، أَنْ لاَ يُمَسِّكُوا بِعِصَمِ الْكَوَافِرِ، أَنَّ عُمَرَ طَلَّقَ امْرَأَتَيْنِ قَرِيبَةَ بِنْتَ أَبِي أُمَيَّةَ، وَابْنَةَ جَرْوَلٍ الْخُزَاعِيِّ، فَتَزَوَّجَ قَرِيبَةَ مُعَاوِيَةُ، وَتَزَوَّجَ الأُخْرَى أَبُو جَهْمٍ، فَلَمَّا أَبَى الْكُفَّارُ أَنْ يُقِرُّوا بِأَدَاءِ مَا أَنْفَقَ الْمُسْلِمُونَ عَلَى أَزْوَاجِهِمْ، أَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَإِنْ فَاتَكُمْ شَىْءٌ مِنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ‏}‏ وَالْعَقِبُ مَا يُؤَدِّي الْمُسْلِمُونَ إِلَى مَنْ هَاجَرَتِ امْرَأَتُهُ مِنَ الْكُفَّارِ، فَأَمَرَ أَنْ يُعْطَى مَنْ ذَهَبَ لَهُ زَوْجٌ مِنَ الْمُسْلِمِينَ مَا أَنْفَقَ مِنْ صَدَاقِ نِسَاءِ الْكُفَّارِ اللاَّئِي هَاجَرْنَ، وَمَا نَعْلَمُ أَحَدًا مِنَ الْمُهَاجِرَاتِ ارْتَدَّتْ بَعْدَ إِيمَانِهَا‏.‏ وَبَلَغَنَا أَنَّ أَبَا بَصِيرِ بْنَ أَسِيدٍ الثَّقَفِيَّ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم مُؤْمِنًا مُهَاجِرًا فِي الْمُدَّةِ، فَكَتَبَ الأَخْنَسُ بْنُ شَرِيقٍ إِلَى النَّبِيِّ صلى الله عليه وسلم يَسْأَلُهُ أَبَا بَصِيرٍ، فَذَكَرَ الْحَدِيثَ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ أَنْ يُسْلِفَهُ أَلْفَ دِينَارِ، فَدَفَعَهَا إِلَيْهِ إِلَى أَجَلٍ مُسَمًّى‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ وَعَطَاءٌ إِذَا أَجَّلَهُ فِي الْقَرْضِ جَازَ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَتَتْهَا بَرِيرَةُ تَسْأَلُهَا فِي كِتَابَتِهَا، فَقَالَتْ إِنْ شِئْتِ أَعْطَيْتُ أَهْلَكِ وَيَكُونُ الْوَلاَءُ لِي‏.‏ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَكَّرْتُهُ ذَلِكَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ابْتَاعِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنِ اشْتَرَطَ مِائَةَ شَرْطٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمَا مِائَةً إِلاَّ وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ أَنْبَأَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَصَابَ أَرْضًا بِخَيْبَرَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم يَسْتَأْمِرُهُ فِيهَا، فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ، لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ عِنْدِي مِنْهُ، فَمَا تَأْمُرُ بِهِ قَالَ ‏ \"‏ إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا ‏\"‏‏.‏ قَالَ فَتَصَدَّقَ بِهَا عُمَرُ أَنَّهُ لاَ يُبَاعُ وَلاَ يُوهَبُ وَلاَ يُورَثُ، وَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَفِي الْقُرْبَى، وَفِي الرِّقَابِ، وَفِي سَبِيلِ اللَّهِ، وَابْنِ السَّبِيلِ، وَالضَّيْفِ، لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، وَيُطْعِمَ غَيْرَ مُتَمَوِّلٍ‏.‏ قَالَ فَحَدَّثْتُ بِهِ ابْنَ سِيرِينَ فَقَالَ غَيْرَ مُتَأَثِّلٍ مَالاً‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 24
			}
		}
	]
}