{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3649,
			"arabicnumber": 3649,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيَقُولُونَ فِيكُمْ مَنْ صَاحَبَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ‏.‏ ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ، ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": 3650,
			"text": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، سَمِعْتُ زَهْدَمَ بْنَ مُضَرِّبٍ، سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ أُمَّتِي قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ فَلاَ أَدْرِي أَذَكَرَ بَعْدَ قَرْنِهِ قَرْنَيْنِ أَوْ ثَلاَثًا ‏\"‏ ثُمَّ إِنَّ بَعْدَكُمْ قَوْمًا يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَنْذُرُونَ وَلاَ يَفُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": 3651,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ قَوْمٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانُوا يَضْرِبُونَا عَلَى الشَّهَادَةِ وَالْعَهْدِ وَنَحْنُ صِغَارٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3652,
			"arabicnumber": 3652,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اشْتَرَى أَبُو بَكْرٍ ـ رضى الله عنه ـ مِنْ عَازِبٍ رَحْلاً بِثَلاَثَةَ عَشَرَ دِرْهَمًا فَقَالَ أَبُو بَكْرٍ لِعَازِبٍ مُرِ الْبَرَاءَ فَلْيَحْمِلْ إِلَىَّ رَحْلِي‏.‏ فَقَالَ عَازِبٌ لاَ حَتَّى تُحَدِّثَنَا كَيْفَ صَنَعْتَ أَنْتَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ خَرَجْتُمَا مِنْ مَكَّةَ وَالْمُشْرِكُونَ يَطْلُبُونَكُمْ قَالَ ارْتَحَلْنَا مِنْ مَكَّةَ، فَأَحْيَيْنَا أَوْ سَرَيْنَا لَيْلَتَنَا وَيَوْمَنَا حَتَّى أَظْهَرْنَا وَقَامَ قَائِمُ الظَّهِيرَةِ، فَرَمَيْتُ بِبَصَرِي هَلْ أَرَى مِنْ ظِلٍّ فَآوِيَ إِلَيْهِ، فَإِذَا صَخْرَةٌ أَتَيْتُهَا فَنَظَرْتُ بَقِيَّةَ ظِلٍّ لَهَا فَسَوَّيْتُهُ، ثُمَّ فَرَشْتُ لِلنَّبِيِّ صلى الله عليه وسلم فِيهِ، ثُمَّ قُلْتُ لَهُ اضْطَجِعْ يَا نَبِيَّ اللَّهِ‏.‏ فَاضْطَجَعَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ انْطَلَقْتُ أَنْظُرُ مَا حَوْلِي، هَلْ أَرَى مِنَ الطَّلَبِ أَحَدًا فَإِذَا أَنَا بِرَاعِي غَنَمٍ يَسُوقُ غَنَمَهُ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا الَّذِي أَرَدْنَا، فَسَأَلْتُهُ فَقُلْتُ لَهُ لِمَنْ أَنْتَ يَا غُلاَمُ قَالَ لِرَجُلٍ مِنْ قُرَيْشٍ سَمَّاهُ فَعَرَفْتُهُ‏.‏ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ‏.‏ قُلْتُ فَهَلْ أَنْتَ حَالِبٌ لَبَنًا قَالَ نَعَمْ‏.‏ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْ غَنَمِهِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ ضَرْعَهَا مِنَ الْغُبَارِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ كَفَّيْهِ، فَقَالَ هَكَذَا ضَرَبَ إِحْدَى كَفَّيْهِ بِالأُخْرَى فَحَلَبَ لِي كُثْبَةً مِنْ لَبَنٍ، وَقَدْ جَعَلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِدَاوَةً عَلَى فَمِهَا خِرْقَةٌ، فَصَبَبْتُ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، فَانْطَلَقْتُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَوَافَقْتُهُ قَدِ اسْتَيْقَظَ، فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قُلْتُ قَدْ آنَ الرَّحِيلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ فَارْتَحَلْنَا وَالْقَوْمُ يَطْلُبُونَا، فَلَمْ يُدْرِكْنَا أَحَدٌ مِنْهُمْ غَيْرُ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ عَلَى فَرَسٍ لَهُ‏.‏ فَقُلْتُ هَذَا الطَّلَبُ قَدْ لَحِقَنَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3653,
			"arabicnumber": 3653,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنه ـ قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم وَأَنَا فِي الْغَارِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ تَحْتَ قَدَمَيْهِ لأَبْصَرَنَا‏.‏ فَقَالَ ‏ \"‏ مَا ظَنُّكَ يَا أَبَا بَكْرٍ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3654,
			"arabicnumber": 3654,
			"text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحٌ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ وَقَالَ ‏\"‏ إِنَّ اللَّهَ خَيَّرَ عَبْدًا بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ فَاخْتَارَ ذَلِكَ الْعَبْدُ مَا عِنْدَ اللَّهِ ‏\"‏‏.‏ قَالَ فَبَكَى أَبُو بَكْرٍ، فَعَجِبْنَا لِبُكَائِهِ أَنْ يُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَبْدٍ خُيِّرَ‏.‏ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ الْمُخَيَّرُ وَكَانَ أَبُو بَكْرٍ أَعْلَمَنَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَمَنِّ النَّاسِ عَلَىَّ فِي صُحْبَتِهِ وَمَالِهِ أَبَا بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلاً غَيْرَ رَبِّي لاَتَّخَذْتُ أَبَا بَكْرٍ، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ وَمَوَدَّتُهُ، لاَ يَبْقَيَنَّ فِي الْمَسْجِد ِباب إِلاَّ سُدَّ، إِلاَّ باب أَبِي بَكْرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3655,
			"arabicnumber": 3655,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نُخَيِّرُ بَيْنَ النَّاسِ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم فَنُخَيِّرُ أَبَا بَكْرٍ، ثُمَّ عُمَرَ بْنَ الْخَطَّابِ، ثُمَّ عُثْمَانَ بْنَ عَفَّانَ رضى الله عنهم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3656,
			"arabicnumber": 3656,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَلَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي خَلِيلاً لاَتَّخَذْتُ، أَبَا بَكْرٍ وَلَكِنْ أَخِي وَصَاحِبِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3657,
			"arabicnumber": 3657,
			"text": "حَدَّثَنَا مُعَلَّى، وَمُوسَى، قَالاَ حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، وَقَالَ، ‏ \"‏ لَوْ كُنْتُ مُتَّخِذًا خَلِيلاً لاَتَّخَذْتُهُ خَلِيلاً، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، مِثْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3658,
			"arabicnumber": 3658,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبَ أَهْلُ الْكُوفَةِ إِلَى ابْنِ الزُّبَيْرِ فِي الْجَدِّ‏.‏ فَقَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ ‏\"‏‏.‏ أَنْزَلَهُ أَبًا يَعْنِي أَبَا بَكْرٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3659,
			"arabicnumber": 3659,
			"text": "حَدَّثَنَا الْحُمَيْدِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ‏.‏ قَالَتْ أَرَأَيْتَ إِنْ جِئْتُ وَلَمْ أَجِدْكَ كَأَنَّهَا تَقُولُ الْمَوْتَ‏.‏ قَالَ عَلَيْهِ السَّلاَمُ ‏ \"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3660,
			"arabicnumber": 3660,
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي الطَّيِّبِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُجَالِدٍ، حَدَّثَنَا بَيَانُ بْنُ بِشْرٍ، عَنْ وَبَرَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ عَمَّارًا، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا مَعَهُ إِلاَّ خَمْسَةُ أَعْبُدٍ وَامْرَأَتَانِ وَأَبُو بَكْرٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3661,
			"arabicnumber": 3661,
			"text": "حَدَّثَنِي هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَائِذِ اللَّهِ أَبِي إِدْرِيسَ، عَنْ أَبِي الدَّرْدَاءِ ـ رضى الله عنه ـ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَ أَبُو بَكْرٍ آخِذًا بِطَرَفِ ثَوْبِهِ حَتَّى أَبْدَى عَنْ رُكْبَتِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَّا صَاحِبُكُمْ فَقَدْ غَامَرَ ‏\"‏‏.‏ فَسَلَّمَ، وَقَالَ إِنِّي كَانَ بَيْنِي وَبَيْنَ ابْنِ الْخَطَّابِ شَىْءٌ فَأَسْرَعْتُ إِلَيْهِ ثُمَّ نَدِمْتُ، فَسَأَلْتُهُ أَنْ يَغْفِرَ لِي فَأَبَى عَلَىَّ، فَأَقْبَلْتُ إِلَيْكَ فَقَالَ ‏\"‏ يَغْفِرُ اللَّهُ لَكَ يَا أَبَا بَكْرٍ ‏\"‏‏.‏ ثَلاَثًا، ثُمَّ إِنَّ عُمَرَ نَدِمَ فَأَتَى مَنْزِلَ أَبِي بَكْرٍ فَسَأَلَ أَثَمَّ أَبُو بَكْرٍ فَقَالُوا لاَ‏.‏ فَأَتَى إِلَى النَّبِيِّ صلى الله عليه وسلم، فَسَلَّمَ فَجَعَلَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم يَتَمَعَّرُ حَتَّى أَشْفَقَ أَبُو بَكْرٍ، فَجَثَا عَلَى رُكْبَتَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ، وَاللَّهِ أَنَا كُنْتُ أَظْلَمَ مَرَّتَيْنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ بَعَثَنِي إِلَيْكُمْ فَقُلْتُمْ كَذَبْتَ‏.‏ وَقَالَ أَبُو بَكْرٍ صَدَقَ‏.‏ وَوَاسَانِي بِنَفْسِهِ وَمَالِهِ، فَهَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي ‏\"‏‏.‏ مَرَّتَيْنِ فَمَا أُوذِيَ بَعْدَهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3662,
			"arabicnumber": 3662,
			"text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، قَالَ خَالِدٌ الْحَذَّاءُ حَدَّثَنَا عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ الْعَاصِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ عَلَى جَيْشِ ذَاتِ السَّلاَسِلِ، فَأَتَيْتُهُ فَقُلْتُ أَىُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ ‏\"‏ عَائِشَةُ ‏\"‏‏.‏ فَقُلْتُ مِنَ الرِّجَالِ فَقَالَ ‏\"‏ أَبُوهَا ‏\"‏‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ عُمَرُ بْنُ الْخَطَّابِ ‏\"‏‏.‏ فَعَدَّ رِجَالاً‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3663,
			"arabicnumber": 3663,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ عَدَا عَلَيْهِ الذِّئْبُ، فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهُ الرَّاعِي، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ مَنْ لَهَا يَوْمَ السَّبُعِ، يَوْمَ لَيْسَ لَهَا رَاعٍ غَيْرِي، وَبَيْنَا رَجُلٌ يَسُوقُ بَقَرَةً قَدْ حَمَلَ عَلَيْهَا، فَالْتَفَتَتْ إِلَيْهِ فَكَلَّمَتْهُ فَقَالَتْ إِنِّي لَمْ أُخْلَقْ لِهَذَا، وَلَكِنِّي خُلِقْتُ لِلْحَرْثِ ‏\"‏‏.‏ قَالَ النَّاسُ سُبْحَانَ اللَّهِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُومِنُ بِذَلِكَ وَأَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ رضى الله عنهما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3664,
			"arabicnumber": 3664,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ عَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ، فَنَزَعَ بِهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ ضَعْفَهُ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا ابْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3665,
			"arabicnumber": 3665,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّ أَحَدَ شِقَّىْ ثَوْبِي يَسْتَرْخِي إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَسْتَ تَصْنَعُ ذَلِكَ خُيَلاَءَ ‏\"‏ قَالَ مُوسَى فَقُلْتُ لِسَالِمٍ أَذَكَرَ عَبْدُ اللَّهِ مَنْ جَرَّ إِزَارَهُ قَالَ لَمْ أَسْمَعْهُ ذَكَرَ إِلاَّ ثَوْبَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3666,
			"arabicnumber": 3666,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَىْءٍ مِنَ الأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَابِ ـ يَعْنِي الْجَنَّةَ ـ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ، فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ باب الصَّلاَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ باب الْجِهَادِ، وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ باب الصَّدَقَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ باب الصِّيَامِ، وَبَابِ الرَّيَّانِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ مَا عَلَى هَذَا الَّذِي يُدْعَى مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ، وَقَالَ هَلْ يُدْعَى مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ، وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ يَا أَبَا بَكْرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3668,
			"arabicnumber": 3668,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3670,
			"arabicnumber": 3670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3671,
			"arabicnumber": 3671,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا جَامِعُ بْنُ أَبِي رَاشِدٍ، حَدَّثَنَا أَبُو يَعْلَى، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، قَالَ قُلْتُ لأَبِي أَىُّ النَّاسِ خَيْرٌ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ثُمَّ عُمَرُ‏.‏ وَخَشِيتُ أَنْ يَقُولَ عُثْمَانُ قُلْتُ ثُمَّ أَنْتَ قَالَ مَا أَنَا إِلاَّ رَجُلٌ مِنَ الْمُسْلِمِينَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَأَتَى النَّاسُ أَبَا بَكْرٍ، فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ فَعَاتَبَنِي، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ، فَتَيَمَّمُوا، فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ فَقَالَتْ عَائِشَةُ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَسُبُّوا أَصْحَابِي، فَلَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيفَهُ ‏\"‏‏.‏ تَابَعَهُ جَرِيرٌ وَعَبْدُ اللَّهِ بْنُ دَاوُدَ وَأَبُو مُعَاوِيَةَ وَمُحَاضِرٌ عَنِ الأَعْمَشِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ أَبُو الْحَسَنِ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا سُلَيْمَانُ، عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ أَخْبَرَنِي أَبُو مُوسَى الأَشْعَرِيُّ، أَنَّهُ تَوَضَّأَ فِي بَيْتِهِ ثُمَّ خَرَجَ، فَقُلْتُ لأَلْزَمَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَلأَكُونَنَّ مَعَهُ يَوْمِي هَذَا‏.‏ قَالَ فَجَاءَ الْمَسْجِدَ، فَسَأَلَ عَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا خَرَجَ وَوَجَّهَ هَا هُنَا، فَخَرَجْتُ عَلَى إِثْرِهِ أَسْأَلُ عَنْهُ، حَتَّى دَخَلَ بِئْرَ أَرِيسٍ، فَجَلَسْتُ عِنْدَ الْبَابِ، وَبَابُهَا مِنْ جَرِيدٍ حَتَّى قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم حَاجَتَهُ، فَتَوَضَّأَ فَقُمْتُ إِلَيْهِ، فَإِذَا هُوَ جَالِسٌ عَلَى بِئْرِ أَرِيسٍ، وَتَوَسَّطَ قُفَّهَا، وَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ انْصَرَفْتُ، فَجَلَسْتُ عِنْدَ الْبَابِ، فَقُلْتُ لأَكُونَنَّ بَوَّابَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْيَوْمَ، فَجَاءَ أَبُو بَكْرٍ فَدَفَعَ الْبَابَ‏.‏ فَقُلْتُ مَنْ هَذَا فَقَالَ أَبُو بَكْرٍ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ ثُمَّ ذَهَبْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا أَبُو بَكْرٍ يَسْتَأْذِنُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَأَقْبَلْتُ حَتَّى قُلْتُ لأَبِي بَكْرٍ ادْخُلْ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُبَشِّرُكَ بِالْجَنَّةِ‏.‏ فَدَخَلَ أَبُو بَكْرٍ فَجَلَسَ عَنْ يَمِينِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَهُ فِي الْقُفِّ، وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ، كَمَا صَنَعَ النَّبِيُّ صلى الله عليه وسلم، وَكَشَفَ عَنْ سَاقَيْهِ، ثُمَّ رَجَعْتُ فَجَلَسْتُ وَقَدْ تَرَكْتُ أَخِي يَتَوَضَّأُ وَيَلْحَقُنِي، فَقُلْتُ إِنْ يُرِدِ اللَّهُ بِفُلاَنٍ خَيْرًا ـ يُرِيدُ أَخَاهُ ـ يَأْتِ بِهِ‏.‏ فَإِذَا إِنْسَانٌ يُحَرِّكُ الْبَابَ‏.‏ فَقُلْتُ مَنْ هَذَا فَقَالَ عُمَرُ بْنُ الْخَطَّابِ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ ثُمَّ جِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ، فَقُلْتُ هَذَا عُمَرُ بْنُ الْخَطَّابِ يَسْتَأْذِنُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ ادْخُلْ وَبَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْجَنَّةِ‏.‏ فَدَخَلَ، فَجَلَسَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْقُفِّ عَنْ يَسَارِهِ، وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ، ثُمَّ رَجَعْتُ فَجَلَسْتُ، فَقُلْتُ إِنْ يُرِدِ اللَّهُ بِفُلاَنٍ خَيْرًا يَأْتِ بِهِ‏.‏ فَجَاءَ إِنْسَانٌ يُحَرِّكُ الْبَابَ، فَقُلْتُ مَنْ هَذَا فَقَالَ عُثْمَانُ بْنُ عَفَّانَ‏.‏ فَقُلْتُ عَلَى رِسْلِكَ‏.‏ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ‏.‏ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُهُ ‏\"‏ فَجِئْتُهُ فَقُلْتُ لَهُ ادْخُلْ وَبَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُكَ‏.‏ فَدَخَلَ فَوَجَدَ الْقُفَّ قَدْ مُلِئَ، فَجَلَسَ وُجَاهَهُ مِنَ الشِّقِّ الآخَرِ‏.‏ قَالَ شَرِيكٌ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَأَوَّلْتُهَا قُبُورَهُمْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَعِدَ أُحُدًا وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ فَقَالَ ‏ \"‏ اثْبُتْ أُحُدُ فَإِنَّمَا عَلَيْكَ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا صَخْرٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَمَا أَنَا عَلَى بِئْرٍ أَنْزِعُ مِنْهَا جَاءَنِي أَبُو بَكْرٍ وَعُمَرُ، فَأَخَذَ أَبُو بَكْرٍ الدَّلْوَ، فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ أَخَذَهَا ابْنُ الْخَطَّابِ مِنْ يَدِ أَبِي بَكْرٍ، فَاسْتَحَالَتْ فِي يَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرِيَّهُ، فَنَزَعَ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏ قَالَ وَهْبٌ الْعَطَنُ مَبْرَكُ الإِبِلِ، يَقُولُ حَتَّى رَوِيَتِ الإِبِلُ فَأَنَاخَتْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "حَدَّثَنِي الْوَلِيدُ بْنُ صَالِحٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي الْحُسَيْنِ الْمَكِّيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنِّي لَوَاقِفٌ فِي قَوْمٍ، فَدَعَوُا اللَّهَ لِعُمَرَ بْنِ الْخَطَّابِ وَقَدْ وُضِعَ عَلَى سَرِيرِهِ، إِذَا رَجُلٌ مِنْ خَلْفِي قَدْ وَضَعَ مِرْفَقَهُ عَلَى مَنْكِبِي، يَقُولُ رَحِمَكَ اللَّهُ، إِنْ كُنْتُ لأَرْجُو أَنْ يَجْعَلَكَ اللَّهُ مَعَ صَاحِبَيْكَ، لأَنِّي كَثِيرًا مِمَّا كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ كُنْتُ وَأَبُو بَكْرٍ وَعُمَرُ، وَفَعَلْتُ وَأَبُو بَكْرٍ وَعُمَرُ، وَانْطَلَقْتُ وَأَبُو بَكْرٍ وَعُمَرُ‏.‏ فَإِنْ كُنْتُ لأَرْجُو أَنْ يَجْعَلَكَ اللَّهُ مَعَهُمَا‏.‏ فَالْتَفَتُّ فَإِذَا هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ يَزِيدَ الْكُوفِيُّ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو عَنْ أَشَدِّ، مَا صَنَعَ الْمُشْرِكُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ رَأَيْتُ عُقْبَةَ بْنَ أَبِي مُعَيْطٍ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُصَلِّي، فَوَضَعَ رِدَاءَهُ فِي عُنُقِهِ فَخَنَقَهُ بِهِ خَنْقًا شَدِيدًا، فَجَاءَ أَبُو بَكْرٍ حَتَّى دَفَعَهُ عَنْهُ فَقَالَ أَتَقْتُلُونَ رَجُلاً أَنْ يَقُولَ رَبِّيَ اللَّهُ‏.‏ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُنِي دَخَلْتُ الْجَنَّةَ، فَإِذَا أَنَا بِالرُّمَيْصَاءِ امْرَأَةِ أَبِي طَلْحَةَ وَسَمِعْتُ خَشَفَةً، فَقُلْتُ مَنْ هَذَا فَقَالَ هَذَا بِلاَلٌ‏.‏ وَرَأَيْتُ قَصْرًا بِفِنَائِهِ جَارِيَةٌ، فَقُلْتُ لِمَنْ هَذَا فَقَالَ لِعُمَرَ‏.‏ فَأَرَدْتُ أَنْ أَدْخُلَهُ فَأَنْظُرَ إِلَيْهِ، فَذَكَرْتُ غَيْرَتَكَ ‏\"‏‏.‏ فَقَالَ عُمَرُ بِأُمِّي وَأَبِي يَا رَسُولَ اللَّهِ أَعَلَيْكَ أَغَارُ",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ لِمَنْ هَذَا الْقَصْرُ قَالُوا لِعُمَرَ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ فَبَكَى وَقَالَ أَعَلَيْكَ أَغَارُ يَا رَسُولَ اللَّهِ",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ الصَّلْتِ أَبُو جَعْفَرٍ الْكُوفِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حَمْزَةُ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ شَرِبْتُ ـ يَعْنِي اللَّبَنَ ـ حَتَّى أَنْظُرُ إِلَى الرِّيِّ يَجْرِي فِي ظُفُرِي أَوْ فِي أَظْفَارِي، ثُمَّ نَاوَلْتُ عُمَرَ ‏\"‏‏.‏ فَقَالُوا فَمَا أَوَّلْتَهُ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ سَالِمٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرِيتُ فِي الْمَنَامِ أَنِّي أَنْزِعُ بِدَلْوِ بَكْرَةٍ عَلَى قَلِيبٍ، فَجَاءَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ نَزْعًا ضَعِيفًا، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ جَاءَ عُمَرُ بْنُ الْخَطَّابِ فَاسْتَحَالَتْ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا يَفْرِي فَرِيَّهُ حَتَّى رَوِيَ النَّاسُ وَضَرَبُوا بِعَطَنٍ ‏\"‏‏.‏ قَالَ ابْنُ جُبَيْرٍ الْعَبْقَرِيُّ عِتَاقُ الزَّرَابِيِّ‏.‏ وَقَالَ يَحْيَى الزَّرَابِيُّ الطَّنَافِسُ لَهَا خَمْلٌ رَقِيقٌ ‏{‏مَبْثُوثَةٌ‏}‏ كَثِيرَةٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ، أَنَّ مُحَمَّدَ بْنَ سَعْدٍ، أَخْبَرَهُ أَنَّ أَبَاهُ قَالَ ح حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، وَعِنْدَهُ نِسْوَةٌ مِنْ قُرَيْشٍ يُكَلِّمْنَهُ وَيَسْتَكْثِرْنَهُ، عَالِيَةً أَصْوَاتُهُنَّ عَلَى صَوْتِهِ فَلَمَّا اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ قُمْنَ فَبَادَرْنَ الْحِجَابَ فَأَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَخَلَ عُمَرُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَضْحَكُ، فَقَالَ عُمَرُ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَجِبْتُ مِنْ هَؤُلاَءِ اللاَّتِي كُنَّ عِنْدِي فَلَمَّا سَمِعْنَ صَوْتَكَ ابْتَدَرْنَ الْحِجَابِ ‏\"‏‏.‏ فَقَالَ عُمَرُ فَأَنْتَ أَحَقُّ أَنْ يَهَبْنَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ قَالَ عُمَرُ يَا عَدُوَّاتِ أَنْفُسِهِنَّ، أَتَهَبْنَنِي وَلاَ تَهَبْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْنَ نَعَمْ، أَنْتَ أَفَظُّ وَأَغْلَظُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِيهًا يَا ابْنَ الْخَطَّابِ وَالَّذِي نَفْسِي بِيَدِهِ مَا لَقِيَكَ الشَّيْطَانُ سَالِكًا فَجًّا قَطُّ إِلاَّ سَلَكَ فَجًّا غَيْرَ فَجِّكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ قَالَ عَبْدُ اللَّهِ مَا زِلْنَا أَعِزَّةً مُنْذُ أَسْلَمَ عُمَرُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ وُضِعَ عُمَرُ عَلَى سَرِيرِهِ، فَتَكَنَّفَهُ النَّاسُ يَدْعُونَ وَيُصَلُّونَ قَبْلَ أَنْ يُرْفَعَ، وَأَنَا فِيهِمْ، فَلَمْ يَرُعْنِي إِلاَّ رَجُلٌ آخِذٌ مَنْكِبِي، فَإِذَا عَلِيٌّ فَتَرَحَّمَ عَلَى عُمَرَ، وَقَالَ مَا خَلَّفْتَ أَحَدًا أَحَبَّ إِلَىَّ أَنْ أَلْقَى اللَّهَ بِمِثْلِ عَمَلِهِ مِنْكَ، وَايْمُ اللَّهِ، إِنْ كُنْتُ لأَظُنُّ أَنْ يَجْعَلَكَ اللَّهُ مَعَ صَاحِبَيْكَ، وَحَسِبْتُ أَنِّي كُنْتُ كَثِيرًا أَسْمَعُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ذَهَبْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَدَخَلْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَخَرَجْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، وَقَالَ، لِي خَلِيفَةُ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، وَكَهْمَسُ بْنُ الْمِنْهَالِ، قَالاَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم إِلَى أُحُدٍ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَرَجَفَ بِهِمْ، فَضَرَبَهُ بِرِجْلِهِ، قَالَ ‏ \"‏ اثْبُتْ أُحُدُ فَمَا عَلَيْكَ إِلاَّ نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدَانِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ، هُوَ ابْنُ مُحَمَّدٍ أَنَّ زَيْدَ بْنَ أَسْلَمَ، حَدَّثَهُ عَنْ أَبِيهِ، قَالَ سَأَلَنِي ابْنُ عُمَرَ عَنْ بَعْضِ، شَأْنِهِ ـ يَعْنِي عُمَرَ ـ فَأَخْبَرْتُهُ‏.‏ فَقَالَ، مَا رَأَيْتُ أَحَدًا قَطُّ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ حِينَ قُبِضَ كَانَ أَجَدَّ وَأَجْوَدَ حَتَّى انْتَهَى مِنْ عُمَرَ بْنِ الْخَطَّابِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ السَّاعَةِ، فَقَالَ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَاذَا أَعْدَدْتَ لَهَا ‏\"‏‏.‏ قَالَ لاَ شَىْءَ إِلاَّ أَنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏ فَقَالَ ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَمَا فَرِحْنَا بِشَىْءٍ فَرَحَنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَأَنَا أُحِبُّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ، وَأَرْجُو أَنْ أَكُونَ مَعَهُمْ بِحُبِّي إِيَّاهُمْ، وَإِنْ لَمْ أَعْمَلْ بِمِثْلِ أَعْمَالِهِمْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ كَانَ فِيمَا قَبْلَكُمْ مِنَ الأُمَمِ مُحَدَّثُونَ، فَإِنْ يَكُ فِي أُمَّتِي أَحَدٌ فَإِنَّهُ عُمَرُ ‏\"‏‏.‏ زَادَ زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ عَنْ سَعْدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَقَدْ كَانَ فِيمَنْ كَانَ قَبْلَكُمْ مِنْ بَنِي إِسْرَائِيلَ رِجَالٌ يُكَلَّمُونَ مِنْ غَيْرِ أَنْ يَكُونُوا أَنْبِيَاءَ، فَإِنْ يَكُنْ مِنْ أُمَّتِي مِنْهُمْ أَحَدٌ فَعُمَرُ ‏\"‏‏.‏ قال ابن عباس رضي الله عنهما: \"من نبيِّ ولا محدَّث",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالاَ سَمِعْنَا أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ عَدَا الذِّئْبُ فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهَا حَتَّى اسْتَنْقَذَهَا، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ لَهُ مَنْ لَهَا يَوْمَ السَّبُعِ، لَيْسَ لَهَا رَاعٍ غَيْرِي‏\"‏‏.‏ فَقَالَ النَّاسُ سُبْحَانَ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُومِنُ بِهِ وَأَبُو بَكْرٍ وَعُمَرُ ‏\"‏ وَمَا ثَمَّ أَبُو بَكْرٍ وَعُمَرُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ عُرِضُوا عَلَىَّ وَعَلَيْهِمْ قُمُصٌ، فَمِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَعُرِضَ عَلَىَّ عُمَرُ وَعَلَيْهِ قَمِيصٌ اجْتَرَّهُ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ لَمَّا طُعِنَ عُمَرُ جَعَلَ يَأْلَمُ، فَقَالَ لَهُ ابْنُ عَبَّاسٍ ـ وَكَأَنَّهُ يُجَزِّعُهُ ـ يَا أَمِيرَ الْمُؤْمِنِينَ، وَلَئِنْ كَانَ ذَاكَ لَقَدْ صَحِبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَحْسَنْتَ صُحْبَتَهُ، ثُمَّ فَارَقْتَهُ وَهْوَ عَنْكَ رَاضٍ، ثُمَّ صَحِبْتَ أَبَا بَكْرٍ فَأَحْسَنْتَ صُحْبَتَهُ، ثُمَّ فَارَقْتَهُ وَهْوَ عَنْكَ رَاضٍ، ثُمَّ صَحِبْتَ صَحَبَتَهُمْ فَأَحْسَنْتَ صُحْبَتَهُمْ، وَلَئِنْ فَارَقْتَهُمْ لَتُفَارِقَنَّهُمْ وَهُمْ عَنْكَ رَاضُونَ‏.‏ قَالَ أَمَّا مَا ذَكَرْتَ مِنْ صُحْبَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِضَاهُ، فَإِنَّمَا ذَاكَ مَنٌّ مِنَ اللَّهِ تَعَالَى مَنَّ بِهِ عَلَىَّ، وَأَمَّا مَا ذَكَرْتَ مِنْ صُحْبَةِ أَبِي بَكْرٍ وَرِضَاهُ، فَإِنَّمَا ذَاكَ مَنٌّ مِنَ اللَّهِ جَلَّ ذِكْرُهُ مَنَّ بِهِ عَلَىَّ، وَأَمَّا مَا تَرَى مِنْ جَزَعِي، فَهْوَ مِنْ أَجْلِكَ وَأَجْلِ أَصْحَابِكَ، وَاللَّهِ لَوْ أَنَّ لِي طِلاَعَ الأَرْضِ ذَهَبًا لاَفْتَدَيْتُ بِهِ مِنْ عَذَابِ اللَّهِ عَزَّ وَجَلَّ قَبْلَ أَنْ أَرَاهُ‏.‏ قَالَ حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، دَخَلْتُ عَلَى عُمَرَ بِهَذَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ غِيَاثٍ، حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ، فَجَاءَ رَجُلٌ فَاسْتَفْتَحَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَفَتَحْتُ لَهُ، فَإِذَا أَبُو بَكْرٍ، فَبَشَّرْتُهُ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَحَمِدَ اللَّهَ، ثُمَّ جَاءَ رَجُلٌ فَاسْتَفْتَحَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَفَتَحْتُ لَهُ، فَإِذَا هُوَ عُمَرُ، فَأَخْبَرْتُهُ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَحَمِدَ اللَّهَ، ثُمَّ اسْتَفْتَحَ رَجُلٌ، فَقَالَ لِي ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُهُ ‏\"‏‏.‏ فَإِذَا عُثْمَانُ، فَأَخْبَرْتُهُ بِمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَمِدَ اللَّهَ ثُمَّ قَالَ اللَّهُ الْمُسْتَعَانُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ أَنَّهُ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ هِشَامٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ حَائِطًا وَأَمَرَنِي بِحِفْظِ باب الْحَائِطِ، فَجَاءَ رَجُلٌ يَسْتَأْذِنُ، فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا أَبُو بَكْرٍ، ثُمَّ جَاءَ آخَرُ يَسْتَأْذِنُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا عُمَرُ، ثُمَّ جَاءَ آخَرُ يَسْتَأْذِنُ، فَسَكَتَ هُنَيْهَةً ثُمَّ قَالَ ‏\"‏ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى سَتُصِيبُهُ ‏\"‏‏.‏ فَإِذَا عُثْمَانُ بْنُ عَفَّانَ‏.‏ قَالَ حَمَّادٌ وَحَدَّثَنَا عَاصِمٌ الأَحْوَلُ، وَعَلِيُّ بْنُ الْحَكَمِ، سَمِعَا أَبَا عُثْمَانَ، يُحَدِّثُ عَنْ أَبِي مُوسَى، بِنَحْوِهِ، وَزَادَ فِيهِ عَاصِمٌ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ قَاعِدًا فِي مَكَانٍ فِيهِ مَاءٌ، قَدِ انْكَشَفَتْ عَنْ رُكْبَتَيْهِ أَوْ رُكْبَتِهِ، فَلَمَّا دَخَلَ عُثْمَانُ غَطَّاهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ قَالاَ مَا يَمْنَعُكَ أَنْ تُكَلِّمَ عُثْمَانَ لأَخِيهِ الْوَلِيدِ فَقَدْ أَكْثَرَ النَّاسُ فِيهِ‏.‏ فَقَصَدْتُ لِعُثْمَانَ حَتَّى خَرَجَ إِلَى الصَّلاَةِ، قُلْتُ إِنَّ لِي إِلَيْكَ حَاجَةً، وَهِيَ نَصِيحَةٌ لَكَ‏.‏ قَالَ يَا أَيُّهَا الْمَرْءُ ـ قَالَ مَعْمَرٌ أُرَاهُ قَالَ ـ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَانْصَرَفْتُ، فَرَجَعْتُ إِلَيْهِمْ إِذْ جَاءَ رَسُولُ عُثْمَانَ فَأَتَيْتُهُ، فَقَالَ مَا نَصِيحَتُكَ فَقُلْتُ إِنَّ اللَّهَ سُبْحَانَهُ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ، وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، وَكُنْتَ مِمَّنِ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ، فَهَاجَرْتَ الْهِجْرَتَيْنِ، وَصَحِبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَرَأَيْتَ هَدْيَهُ، وَقَدْ أَكْثَرَ النَّاسُ فِي شَأْنِ الْوَلِيدِ‏.‏ قَالَ أَدْرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ لاَ وَلَكِنْ خَلَصَ إِلَىَّ مِنْ عِلْمِهِ مَا يَخْلُصُ إِلَى الْعَذْرَاءِ فِي سِتْرِهَا‏.‏ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ، فَكُنْتُ مِمَّنِ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنْتُ بِمَا بُعِثَ بِهِ، وَهَاجَرْتُ الْهِجْرَتَيْنِ كَمَا قُلْتَ، وَصَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَبَايَعْتُهُ، فَوَاللَّهِ مَا عَصَيْتُهُ وَلاَ غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ أَبُو بَكْرٍ مِثْلُهُ، ثُمَّ عُمَرُ مِثْلُهُ، ثُمَّ اسْتُخْلِفْتُ، أَفَلَيْسَ لِي مِنَ الْحَقِّ مِثْلُ الَّذِي لَهُمْ قُلْتُ بَلَى‏.‏ قَالَ فَمَا هَذِهِ الأَحَادِيثُ الَّتِي تَبْلُغُنِي عَنْكُمْ أَمَّا مَا ذَكَرْتَ مِنْ شَأْنِ الْوَلِيدِ، فَسَنَأْخُذُ فِيهِ بِالْحَقِّ إِنْ شَاءَ اللَّهُ، ثُمَّ دَعَا عَلِيًّا فَأَمَرَهُ أَنْ يَجْلِدَهُ فَجَلَدَهُ ثَمَانِينَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيغٍ، حَدَّثَنَا شَاذَانُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم لاَ نَعْدِلُ بِأَبِي بَكْرٍ أَحَدًا ثُمَّ عُمَرَ ثُمَّ عُثْمَانَ، ثُمَّ نَتْرُكُ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم لاَ نُفَاضِلُ بَيْنَهُمْ‏.‏ تَابَعَهُ عَبْدُ اللَّهِ عَنْ عَبْدِ الْعَزِيزِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عُثْمَانُ ـ هُوَ ابْنُ مَوْهَبٍ ـ قَالَ جَاءَ رَجُلٌ مَنْ أَهْلِ مِصْرَ حَجَّ الْبَيْتَ فَرَأَى قَوْمًا جُلُوسًا، فَقَالَ مَنْ هَؤُلاَءِ الْقَوْمُ قَالَ هَؤُلاَءِ قُرَيْشٌ‏.‏ قَالَ فَمَنِ الشَّيْخُ فِيهِمْ قَالُوا عَبْدُ اللَّهِ بْنُ عُمَرَ‏.‏ قَالَ يَا ابْنَ عُمَرَ إِنِّي سَائِلُكَ عَنْ شَىْءٍ فَحَدِّثْنِي هَلْ تَعْلَمُ أَنَّ عُثْمَانَ فَرَّ يَوْمَ أُحُدٍ قَالَ نَعَمْ‏.‏ قَالَ تَعْلَمُ أَنَّهُ تَغَيَّبَ عَنْ بَدْرٍ وَلَمْ يَشْهَدْ قَالَ نَعَمْ‏.‏ قَالَ تَعْلَمُ أَنَّهُ تَغَيَّبَ عَنْ بَيْعَةِ الرُّضْوَانِ فَلَمْ يَشْهَدْهَا قَالَ نَعَمْ‏.‏ قَالَ اللَّهُ أَكْبَرُ‏.‏ قَالَ ابْنُ عُمَرَ تَعَالَ أُبَيِّنْ لَكَ أَمَّا فِرَارُهُ يَوْمَ أُحُدٍ فَأَشْهَدُ أَنَّ اللَّهَ عَفَا عَنْهُ وَغَفَرَ لَهُ، وَأَمَّا تَغَيُّبُهُ عَنْ بَدْرٍ، فَإِنَّهُ كَانَتْ تَحْتَهُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ مَرِيضَةً، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لَكَ أَجْرَ رَجُلٍ مِمَّنْ شَهِدَ بَدْرًا وَسَهْمَهُ ‏\"‏‏.‏ وَأَمَّا تَغَيُّبُهُ عَنْ بَيْعَةِ الرُّضْوَانِ فَلَوْ كَانَ أَحَدٌ أَعَزَّ بِبَطْنِ مَكَّةَ مِنْ عُثْمَانَ لَبَعَثَهُ مَكَانَهُ فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عُثْمَانَ وَكَانَتْ بَيْعَةُ الرُّضْوَانِ بَعْدَ مَا ذَهَبَ عُثْمَانُ إِلَى مَكَّةَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ الْيُمْنَى ‏\"‏ هَذِهِ يَدُ عُثْمَانَ ‏\"‏‏.‏ فَضَرَبَ بِهَا عَلَى يَدِهِ، فَقَالَ ‏\"‏ هَذِهِ لِعُثْمَانَ ‏\"‏‏.‏ فَقَالَ لَهُ ابْنُ عُمَرَ اذْهَبْ بِهَا الآنَ مَعَكَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُمْ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم أُحُدًا، وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ، فَرَجَفَ وَقَالَ ‏ \"‏ اسْكُنْ أُحُدُ ـ أَظُنُّهُ ضَرَبَهُ بِرِجْلِهِ ـ فَلَيْسَ عَلَيْكَ إِلاَّ نَبِيٌّ وَصِدِّيقٌ وَشَهِيدَانِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَبْلَ أَنْ يُصَابَ بِأَيَّامٍ بِالْمَدِينَةِ وَقَفَ عَلَى حُذَيْفَةَ بْنِ الْيَمَانِ وَعُثْمَانَ بْنِ حُنَيْفٍ، قَالَ كَيْفَ فَعَلْتُمَا أَتَخَافَانِ أَنْ تَكُونَا قَدْ حَمَّلْتُمَا الأَرْضَ مَا لاَ تُطِيقُ قَالاَ حَمَّلْنَاهَا أَمْرًا هِيَ لَهُ مُطِيقَةٌ، مَا فِيهَا كَبِيرُ فَضْلٍ‏.‏ قَالَ انْظُرَا أَنْ تَكُونَا حَمَّلْتُمَا الأَرْضَ مَا لاَ تُطِيقُ، قَالَ قَالاَ لاَ‏.‏ فَقَالَ عُمَرُ لَئِنْ سَلَّمَنِي اللَّهُ لأَدَعَنَّ أَرَامِلَ أَهْلِ الْعِرَاقِ لاَ يَحْتَجْنَ إِلَى رَجُلٍ بَعْدِي أَبَدًا‏.‏ قَالَ فَمَا أَتَتْ عَلَيْهِ إِلاَّ رَابِعَةٌ حَتَّى أُصِيبَ‏.‏ قَالَ إِنِّي لَقَائِمٌ مَا بَيْنِي وَبَيْنَهُ إِلاَّ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ غَدَاةَ أُصِيبَ، وَكَانَ إِذَا مَرَّ بَيْنَ الصَّفَّيْنِ قَالَ اسْتَوُوا‏.‏ حَتَّى إِذَا لَمْ يَرَ فِيهِنَّ خَلَلاً تَقَدَّمَ فَكَبَّرَ، وَرُبَّمَا قَرَأَ سُورَةَ يُوسُفَ، أَوِ النَّحْلَ، أَوْ نَحْوَ ذَلِكَ، فِي الرَّكْعَةِ الأُولَى حَتَّى يَجْتَمِعَ النَّاسُ، فَمَا هُوَ إِلاَّ أَنْ كَبَّرَ فَسَمِعْتُهُ يَقُولُ قَتَلَنِي ـ أَوْ أَكَلَنِي ـ الْكَلْبُ‏.‏ حِينَ طَعَنَهُ، فَطَارَ الْعِلْجُ بِسِكِّينٍ ذَاتِ طَرَفَيْنِ لاَ يَمُرُّ عَلَى أَحَدٍ يَمِينًا وَلاَ شِمَالاً إِلاَّ طَعَنَهُ حَتَّى طَعَنَ ثَلاَثَةَ عَشَرَ رَجُلاً، مَاتَ مِنْهُمْ سَبْعَةٌ، فَلَمَّا رَأَى ذَلِكَ رَجُلٌ مِنَ الْمُسْلِمِينَ، طَرَحَ عَلَيْهِ بُرْنُسًا، فَلَمَّا ظَنَّ الْعِلْجُ أَنَّهُ مَأْخُوذٌ نَحَرَ نَفْسَهُ، وَتَنَاوَلَ عُمَرُ يَدَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فَقَدَّمَهُ، فَمَنْ يَلِي عُمَرَ فَقَدْ رَأَى الَّذِي أَرَى، وَأَمَّا نَوَاحِي الْمَسْجِدِ فَإِنَّهُمْ لاَ يَدْرُونَ غَيْرَ أَنَّهُمْ قَدْ فَقَدُوا صَوْتَ عُمَرَ وَهُمْ يَقُولُونَ سُبْحَانَ اللَّهِ سُبْحَانَ اللَّهِ‏.‏ فَصَلَّى بِهِمْ عَبْدُ الرَّحْمَنِ صَلاَةً خَفِيفَةً، فَلَمَّا انْصَرَفُوا‏.‏ قَالَ يَا ابْنَ عَبَّاسٍ، انْظُرْ مَنْ قَتَلَنِي‏.‏ فَجَالَ سَاعَةً، ثُمَّ جَاءَ، فَقَالَ غُلاَمُ الْمُغِيرَةِ‏.‏ قَالَ الصَّنَعُ قَالَ نَعَمْ‏.‏ قَالَ قَاتَلَهُ اللَّهُ لَقَدْ أَمَرْتُ بِهِ مَعْرُوفًا، الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَجْعَلْ مَنِيَّتِي بِيَدِ رَجُلٍ يَدَّعِي الإِسْلاَمَ، قَدْ كُنْتَ أَنْتَ وَأَبُوكَ تُحِبَّانِ أَنْ تَكْثُرَ الْعُلُوجُ بِالْمَدِينَةِ وَكَانَ ‏{‏الْعَبَّاسُ‏}‏ أَكْثَرَهُمْ رَقِيقًا‏.‏ فَقَالَ إِنْ شِئْتَ فَعَلْتُ‏.‏ أَىْ إِنْ شِئْتَ قَتَلْنَا‏.‏ قَالَ كَذَبْتَ، بَعْدَ مَا تَكَلَّمُوا بِلِسَانِكُمْ، وَصَلَّوْا قِبْلَتَكُمْ وَحَجُّوا حَجَّكُمْ فَاحْتُمِلَ إِلَى بَيْتِهِ فَانْطَلَقْنَا مَعَهُ، وَكَأَنَّ النَّاسَ لَمْ تُصِبْهُمْ مُصِيبَةٌ قَبْلَ يَوْمَئِذٍ، فَقَائِلٌ يَقُولُ لاَ بَأْسَ‏.‏ وَقَائِلٌ يَقُولُ أَخَافُ عَلَيْهِ، فَأُتِيَ بِنَبِيذٍ فَشَرِبَهُ فَخَرَجَ مِنْ جَوْفِهِ، ثُمَّ أُتِيَ بِلَبَنٍ فَشَرِبَهُ فَخَرَجَ مِنْ جُرْحِهِ، فَعَلِمُوا أَنَّهُ مَيِّتٌ، فَدَخَلْنَا عَلَيْهِ، وَجَاءَ النَّاسُ يُثْنُونَ عَلَيْهِ، وَجَاءَ رَجُلٌ شَابٌّ، فَقَالَ أَبْشِرْ يَا أَمِيرَ الْمُؤْمِنِينَ بِبُشْرَى اللَّهِ لَكَ مِنْ صُحْبَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدَمٍ فِي الإِسْلاَمِ مَا قَدْ عَلِمْتَ، ثُمَّ وَلِيتَ فَعَدَلْتَ، ثُمَّ شَهَادَةٌ‏.‏ قَالَ وَدِدْتُ أَنَّ ذَلِكَ كَفَافٌ لاَ عَلَىَّ وَلاَ لِي‏.‏ فَلَمَّا أَدْبَرَ، إِذَا إِزَارُهُ يَمَسُّ الأَرْضَ‏.‏ قَالَ رُدُّوا عَلَىَّ الْغُلاَمَ قَالَ ابْنَ أَخِي ارْفَعْ ثَوْبَكَ، فَإِنَّهُ أَبْقَى لِثَوْبِكَ وَأَتْقَى لِرَبِّكَ، يَا عَبْدَ اللَّهِ بْنَ عُمَرَ انْظُرْ مَا عَلَىَّ مِنَ الدَّيْنِ‏.‏ فَحَسَبُوهُ فَوَجَدُوهُ سِتَّةً وَثَمَانِينَ أَلْفًا أَوْ نَحْوَهُ، قَالَ إِنْ وَفَى لَهُ مَالُ آلِ عُمَرَ، فَأَدِّهِ مِنْ أَمْوَالِهِمْ، وَإِلاَّ فَسَلْ فِي بَنِي عَدِيِّ بْنِ كَعْبٍ، فَإِنْ لَمْ تَفِ أَمْوَالُهُمْ فَسَلْ فِي قُرَيْشٍ، وَلاَ تَعْدُهُمْ إِلَى غَيْرِهِمْ، فَأَدِّ عَنِّي هَذَا الْمَالَ، انْطَلِقْ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فَقُلْ يَقْرَأُ عَلَيْكِ عُمَرُ السَّلاَمَ‏.‏ وَلاَ تَقُلْ أَمِيرُ الْمُؤْمِنِينَ‏.‏ فَإِنِّي لَسْتُ الْيَوْمَ لِلْمُؤْمِنِينَ أَمِيرًا، وَقُلْ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ أَنْ يُدْفَنَ مَعَ صَاحِبَيْهِ‏.‏ فَسَلَّمَ وَاسْتَأْذَنَ، ثُمَّ دَخَلَ عَلَيْهَا، فَوَجَدَهَا قَاعِدَةً تَبْكِي فَقَالَ يَقْرَأُ عَلَيْكِ عُمَرُ بْنُ الْخَطَّابِ السَّلاَمَ وَيَسْتَأْذِنُ أَنْ يُدْفَنَ مَعَ صَاحِبَيْهِ‏.‏ فَقَالَتْ كُنْتُ أُرِيدُهُ لِنَفْسِي، وَلأُوثِرَنَّ بِهِ الْيَوْمَ عَلَى نَفْسِي‏.‏ فَلَمَّا أَقْبَلَ قِيلَ هَذَا عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ جَاءَ‏.‏ قَالَ ارْفَعُونِي، فَأَسْنَدَهُ رَجُلٌ إِلَيْهِ، فَقَالَ مَا لَدَيْكَ قَالَ الَّذِي تُحِبُّ يَا أَمِيرَ الْمُؤْمِنِينَ أَذِنَتْ‏.‏ قَالَ الْحَمْدُ لِلَّهِ، مَا كَانَ مِنْ شَىْءٍ أَهَمُّ إِلَىَّ مِنْ ذَلِكَ، فَإِذَا أَنَا قَضَيْتُ فَاحْمِلُونِي ثُمَّ سَلِّمْ فَقُلْ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ، فَإِنْ أَذِنَتْ لِي فَأَدْخِلُونِي، وَإِنْ رَدَّتْنِي رُدُّونِي إِلَى مَقَابِرِ الْمُسْلِمِينَ‏.‏ وَجَاءَتْ أُمُّ الْمُؤْمِنِينَ حَفْصَةُ وَالنِّسَاءُ تَسِيرُ مَعَهَا، فَلَمَّا رَأَيْنَاهَا قُمْنَا، فَوَلَجَتْ عَلَيْهِ فَبَكَتْ عِنْدَهُ سَاعَةً، وَاسْتَأْذَنَ الرِّجَالُ، فَوَلَجَتْ دَاخِلاً لَهُمْ، فَسَمِعْنَا بُكَاءَهَا مِنَ الدَّاخِلِ‏.‏ فَقَالُوا أَوْصِ يَا أَمِيرَ الْمُؤْمِنِينَ اسْتَخْلِفْ‏.‏ قَالَ مَا أَجِدُ أَحَقَّ بِهَذَا الأَمْرِ مِنْ هَؤُلاَءِ النَّفَرِ أَوِ الرَّهْطِ الَّذِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ عَنْهُمْ رَاضٍ‏.‏ فَسَمَّى عَلِيًّا وَعُثْمَانَ وَالزُّبَيْرَ وَطَلْحَةَ وَسَعْدًا وَعَبْدَ الرَّحْمَنِ وَقَالَ يَشْهَدُكُمْ عَبْدُ اللَّهِ بْنُ عُمَرَ وَلَيْسَ لَهُ مِنَ الأَمْرِ شَىْءٌ ـ كَهَيْئَةِ التَّعْزِيَةِ لَهُ ـ فَإِنْ أَصَابَتِ الإِمْرَةُ سَعْدًا فَهْوَ ذَاكَ، وَإِلاَّ فَلْيَسْتَعِنْ بِهِ أَيُّكُمْ مَا أُمِّرَ، فَإِنِّي لَمْ أَعْزِلْهُ عَنْ عَجْزٍ وَلاَ خِيَانَةٍ وَقَالَ أُوصِي الْخَلِيفَةَ مِنْ بَعْدِي بِالْمُهَاجِرِينَ الأَوَّلِينَ أَنْ يَعْرِفَ لَهُمْ حَقَّهُمْ، وَيَحْفَظَ لَهُمْ حُرْمَتَهُمْ، وَأُوصِيهِ بِالأَنْصَارِ خَيْرًا، الَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ مِنْ قَبْلِهِمْ، أَنْ يُقْبَلَ مِنْ مُحْسِنِهِمْ، وَأَنْ يُعْفَى عَنْ مُسِيئِهِمْ، وَأُوصِيهِ بِأَهْلِ الأَمْصَارِ خَيْرًا فَإِنَّهُمْ رِدْءُ الإِسْلاَمِ، وَجُبَاةُ الْمَالِ، وَغَيْظُ الْعَدُوِّ، وَأَنْ لاَ يُؤْخَذَ مِنْهُمْ إِلاَّ فَضْلُهُمْ عَنْ رِضَاهُمْ، وَأُوصِيهِ بِالأَعْرَابِ خَيْرًا، فَإِنَّهُمْ أَصْلُ الْعَرَبِ وَمَادَّةُ الإِسْلاَمِ أَنْ يُؤْخَذَ مِنْ حَوَاشِي أَمْوَالِهِمْ وَتُرَدَّ عَلَى فُقَرَائِهِمْ، وَأُوصِيهِ بِذِمَّةِ اللَّهِ وَذِمَّةِ رَسُولِهِ صلى الله عليه وسلم أَنْ يُوفَى لَهُمْ بِعَهْدِهِمْ، وَأَنْ يُقَاتَلَ مِنْ وَرَائِهِمْ، وَلاَ يُكَلَّفُوا إِلاَّ طَاقَتَهُمْ‏.‏ فَلَمَّا قُبِضَ خَرَجْنَا بِهِ فَانْطَلَقْنَا نَمْشِي فَسَلَّمَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ‏.‏ قَالَتْ أَدْخِلُوهُ‏.‏ فَأُدْخِلَ، فَوُضِعَ هُنَالِكَ مَعَ صَاحِبَيْهِ، فَلَمَّا فُرِغَ مِنْ دَفْنِهِ اجْتَمَعَ هَؤُلاَءِ الرَّهْطُ، فَقَالَ عَبْدُ الرَّحْمَنِ اجْعَلُوا أَمْرَكُمْ إِلَى ثَلاَثَةٍ مِنْكُمْ‏.‏ فَقَالَ الزُّبَيْرُ قَدْ جَعَلْتُ أَمْرِي إِلَى عَلِيٍّ‏.‏ فَقَالَ طَلْحَةُ قَدْ جَعَلْتُ أَمْرِي إِلَى عُثْمَانَ‏.‏ وَقَالَ سَعْدٌ قَدْ جَعَلْتُ أَمْرِي إِلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ‏.‏ فَقَالَ عَبْدُ الرَّحْمَنِ أَيُّكُمَا تَبَرَّأَ مِنْ هَذَا الأَمْرِ فَنَجْعَلُهُ إِلَيْهِ، وَاللَّهُ عَلَيْهِ وَالإِسْلاَمُ لَيَنْظُرَنَّ أَفْضَلَهُمْ فِي نَفْسِهِ‏.‏ فَأُسْكِتَ الشَّيْخَانِ، فَقَالَ عَبْدُ الرَّحْمَنِ أَفَتَجْعَلُونَهُ إِلَىَّ، وَاللَّهُ عَلَىَّ أَنْ لاَ آلُوَ عَنْ أَفْضَلِكُمْ قَالاَ نَعَمْ، فَأَخَذَ بِيَدِ أَحَدِهِمَا فَقَالَ لَكَ قَرَابَةٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَالْقَدَمُ فِي الإِسْلاَمِ مَا قَدْ عَلِمْتَ، فَاللَّهُ عَلَيْكَ لَئِنْ أَمَّرْتُكَ لَتَعْدِلَنَّ، وَلَئِنْ أَمَّرْتُ عُثْمَانَ لَتَسْمَعَنَّ وَلَتُطِيعَنَّ‏.‏ ثُمَّ خَلاَ بِالآخَرِ فَقَالَ لَهُ مِثْلَ ذَلِكَ، فَلَمَّا أَخَذَ الْمِيثَاقَ قَالَ ارْفَعْ يَدَكَ يَا عُثْمَانُ‏.‏ فَبَايَعَهُ، فَبَايَعَ لَهُ عَلِيٌّ، وَوَلَجَ أَهْلُ الدَّارِ فَبَايَعُوهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لأُعْطِيَنَّ الرَّايَةَ غَدًا رَجُلاً يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ ‏\"‏ قَالَ فَبَاتَ النَّاسُ يَدُوكُونَ لَيْلَتَهُمْ أَيُّهُمْ يُعْطَاهَا فَلَمَّا أَصْبَحَ النَّاسُ، غَدَوْا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كُلُّهُمْ يَرْجُو أَنْ يُعْطَاهَا فَقَالَ ‏\"‏ أَيْنَ عَلِيُّ بْنُ أَبِي طَالِبٍ ‏\"‏‏.‏ فَقَالُوا يَشْتَكِي عَيْنَيْهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَأَرْسِلُوا إِلَيْهِ فَأْتُونِي بِهِ ‏\"‏‏.‏ فَلَمَّا جَاءَ بَصَقَ فِي عَيْنَيْهِ، وَدَعَا لَهُ، فَبَرَأَ حَتَّى كَأَنْ لَمْ يَكُنْ بِهِ وَجَعٌ، فَأَعْطَاهُ الرَّايَةَ‏.‏ فَقَالَ عَلِيٌّ يَا رَسُولَ اللَّهِ أُقَاتِلُهُمْ حَتَّى يَكُونُوا مِثْلَنَا فَقَالَ ‏\"‏ انْفُذْ عَلَى رِسْلِكَ حَتَّى تَنْزِلَ بِسَاحَتِهِمْ، ثُمَّ ادْعُهُمْ إِلَى الإِسْلاَمِ، وَأَخْبِرْهُمْ بِمَا يَجِبُ عَلَيْهِمْ مِنْ حَقِّ اللَّهِ فِيهِ، فَوَاللَّهِ لأَنْ يَهْدِيَ اللَّهُ بِكَ رَجُلاً وَاحِدًا خَيْرٌ لَكَ مِنْ أَنْ يَكُونَ لَكَ حُمْرُ النَّعَمِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ كَانَ عَلِيٌّ قَدْ تَخَلَّفَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي خَيْبَرَ وَكَانَ بِهِ رَمَدٌ فَقَالَ أَنَا أَتَخَلَّفُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ عَلِيٌّ فَلَحِقَ بِالنَّبِيِّ صلى الله عليه وسلم، فَلَمَّا كَانَ مَسَاءُ اللَّيْلَةِ الَّتِي فَتَحَهَا اللَّهُ فِي صَبَاحِهَا، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأُعْطِيَنَّ الرَّايَةَ ـ أَوْ لَيَأْخُذَنَّ الرَّايَةَ ـ غَدًا رَجُلاً يُحِبُّهُ اللَّهُ وَرَسُولُهُ ـ أَوْ قَالَ يُحِبُّ اللَّهَ وَرَسُولَهُ ـ يَفْتَحُ اللَّهُ عَلَيْهِ ‏\"‏‏.‏ فَإِذَا نَحْنُ بِعَلِيٍّ وَمَا نَرْجُوهُ، فَقَالُوا هَذَا عَلِيٌّ‏.‏ فَأَعْطَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَفَتَحَ اللَّهُ عَلَيْهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، جَاءَ إِلَى سَهْلِ بْنِ سَعْدٍ فَقَالَ هَذَا فُلاَنٌ ـ لأَمِيرِ الْمَدِينَةِ ـ يَدْعُو عَلِيًّا عِنْدَ الْمِنْبَرِ‏.‏ قَالَ فَيَقُولُ مَاذَا قَالَ يَقُولُ لَهُ أَبُو تُرَابٍ‏.‏ فَضَحِكَ قَالَ وَاللَّهِ مَا سَمَّاهُ إِلاَّ النَّبِيُّ صلى الله عليه وسلم، وَمَا كَانَ لَهُ اسْمٌ أَحَبَّ إِلَيْهِ مِنْهُ‏.‏ فَاسْتَطْعَمْتُ الْحَدِيثَ سَهْلاً، وَقُلْتُ يَا أَبَا عَبَّاسٍ كَيْفَ قَالَ دَخَلَ عَلِيٌّ عَلَى فَاطِمَةَ ثُمَّ خَرَجَ فَاضْطَجَعَ فِي الْمَسْجِدِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيْنَ ابْنُ عَمِّكِ ‏\"‏‏.‏ قَالَتْ فِي الْمَسْجِدِ‏.‏ فَخَرَجَ إِلَيْهِ فَوَجَدَ رِدَاءَهُ قَدْ سَقَطَ عَنْ ظَهْرِهِ، وَخَلَصَ التُّرَابُ إِلَى ظَهْرِهِ، فَجَعَلَ يَمْسَحُ التُّرَابَ عَنْ ظَهْرِهِ فَيَقُولُ ‏\"‏ اجْلِسْ يَا أَبَا تُرَابٍ ‏\"‏‏.‏ مَرَّتَيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ أَبِي حَصِينٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عُمَرَ، فَسَأَلَهُ عَنْ عُثْمَانَ،، فَذَكَرَ عَنْ مَحَاسِنِ، عَمَلِهِ، قَالَ لَعَلَّ ذَاكَ يَسُوؤُكَ‏.‏ قَالَ نَعَمْ‏.‏ قَالَ فَأَرْغَمَ اللَّهُ بِأَنْفِكَ‏.‏ ثُمَّ سَأَلَهُ عَنْ عَلِيٍّ، فَذَكَرَ مَحَاسِنَ عَمَلِهِ قَالَ هُوَ ذَاكَ، بَيْتُهُ أَوْسَطُ بُيُوتِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ثُمَّ قَالَ لَعَلَّ ذَاكَ يَسُوؤُكَ‏.‏ قَالَ أَجَلْ‏.‏ قَالَ فَأَرْغَمَ اللَّهُ بِأَنْفِكَ، انْطَلِقْ فَاجْهَدْ عَلَىَّ جَهْدَكَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، سَمِعْتُ ابْنَ أَبِي لَيْلَى، قَالَ حَدَّثَنَا عَلِيٌّ، أَنَّ فَاطِمَةَ، عَلَيْهَا السَّلاَمُ شَكَتْ مَا تَلْقَى مِنْ أَثَرِ الرَّحَا، فَأَتَى النَّبِيَّ صلى الله عليه وسلم سَبْىٌ، فَانْطَلَقَتْ فَلَمْ تَجِدْهُ، فَوَجَدَتْ عَائِشَةَ، فَأَخْبَرَتْهَا، فَلَمَّا جَاءَ النَّبِيُّ صلى الله عليه وسلم أَخْبَرَتْهُ عَائِشَةُ بِمَجِيءِ فَاطِمَةَ، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَيْنَا، وَقَدْ أَخَذْنَا مَضَاجِعَنَا، فَذَهَبْتُ لأَقُومَ فَقَالَ ‏\"‏ عَلَى مَكَانِكُمَا ‏\"‏‏.‏ فَقَعَدَ بَيْنَنَا حَتَّى وَجَدْتُ بَرْدَ قَدَمَيْهِ عَلَى صَدْرِي وَقَالَ ‏\"‏ أَلاَ أُعَلِّمُكُمَا خَيْرًا مِمَّا سَأَلْتُمَانِي إِذَا أَخَذْتُمَا مَضَاجِعَكُمَا تُكَبِّرَا أَرْبَعًا وَثَلاَثِينَ، وَتُسَبِّحَا ثَلاَثًا وَثَلاَثِينَ، وَتَحْمَدَا ثَلاَثَةً وَثَلاَثِينَ، فَهْوَ خَيْرٌ لَكُمَا مِنْ خَادِمٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، قَالَ سَمِعْتُ إِبْرَاهِيمَ بْنَ سَعْدٍ، عَنْ أَبِيهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم لِعَلِيٍّ ‏ \"‏ أَمَا تَرْضَى أَنْ تَكُونَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ اقْضُوا كَمَا كُنْتُمْ تَقْضُونَ، فَإِنِّي أَكْرَهُ الاِخْتِلاَفَ حَتَّى يَكُونَ لِلنَّاسِ جَمَاعَةٌ، أَوْ أَمُوتَ كَمَا مَاتَ أَصْحَابِي‏.‏ فَكَانَ ابْنُ سِيرِينَ يَرَى أَنَّ عَامَّةَ مَا يُرْوَى عَلَى عَلِيٍّ الْكَذِبُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3708,
			"arabicnumber": 3708,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ دِينَارٍ أَبُو عَبْدِ اللَّهِ الْجُهَنِيُّ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّاسَ، كَانُوا يَقُولُونَ أَكْثَرَ أَبُو هُرَيْرَةَ‏.‏ وَإِنِّي كُنْتُ أَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشِبَعِ بَطْنِي، حَتَّى لاَ آكُلُ الْخَمِيرَ، وَلاَ أَلْبَسُ الْحَبِيرَ، وَلاَ يَخْدُمُنِي فُلاَنٌ وَلاَ فُلاَنَةُ، وَكُنْتُ أُلْصِقُ بَطْنِي بِالْحَصْبَاءِ مِنَ الْجُوعِ، وَإِنْ كُنْتُ لأَسْتَقْرِئُ الرَّجُلَ الآيَةَ هِيَ مَعِي كَىْ يَنْقَلِبَ بِي فَيُطْعِمَنِي، وَكَانَ أَخْيَرَ النَّاسِ لِلْمِسْكِينِ جَعْفَرُ بْنُ أَبِي طَالِبٍ، كَانَ يَنْقَلِبُ بِنَا فَيُطْعِمُنَا مَا كَانَ فِي بَيْتِهِ، حَتَّى إِنْ كَانَ لَيُخْرِجُ إِلَيْنَا الْعُكَّةَ الَّتِي لَيْسَ فِيهَا شَىْءٌ، فَنَشُقُّهَا فَنَلْعَقُ مَا فِيهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3709,
			"arabicnumber": 3709,
			"text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ إِذَا سَلَّمَ عَلَى ابْنِ جَعْفَرٍ قَالَ السَّلاَمُ عَلَيْكَ يَا ابْنَ ذِي الْجَنَاحَيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3710,
			"arabicnumber": 3710,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنِي أَبِي عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ إِذَا قَحَطُوا اسْتَسْقَى بِالْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، فَقَالَ اللَّهُمَّ إِنَّا كُنَّا نَتَوَسَّلُ إِلَيْكَ بِنَبِيِّنَا صلى الله عليه وسلم فَتَسْقِينَا، وَإِنَّا نَتَوَسَّلُ إِلَيْكَ بِعَمِّ نَبِيِّنَا فَاسْقِنَا‏.‏ قَالَ فَيُسْقَوْنَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3713,
			"arabicnumber": 3713,
			"text": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدٍ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنِ ابْنِ عُمَرَ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنهم ـ قَالَ ارْقُبُوا مُحَمَّدًا صلى الله عليه وسلم فِي أَهْلِ بَيْتِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3714,
			"arabicnumber": 3714,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فَاطِمَةُ بَضْعَةٌ مِنِّي، فَمَنْ أَغْضَبَهَا أَغْضَبَنِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3716,
			"arabicnumber": 3716,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3717,
			"arabicnumber": 3717,
			"text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ أَخْبَرَنِي مَرْوَانُ بْنُ الْحَكَمِ، قَالَ أَصَابَ عُثْمَانَ بْنَ عَفَّانَ رُعَافٌ شَدِيدٌ سَنَةَ الرُّعَافِ، حَتَّى حَبَسَهُ عَنِ الْحَجِّ وَأَوْصَى، فَدَخَلَ عَلَيْهِ رَجُلٌ مِنْ قُرَيْشٍ قَالَ اسْتَخْلِفْ‏.‏ قَالَ وَقَالُوهُ قَالَ نَعَمْ‏.‏ قَالَ وَمَنْ فَسَكَتَ، فَدَخَلَ عَلَيْهِ رَجُلٌ آخَرُ ـ أَحْسِبُهُ الْحَارِثَ ـ فَقَالَ اسْتَخْلِفْ‏.‏ فَقَالَ عُثْمَانُ وَقَالُوا فَقَالَ نَعَمْ‏.‏ قَالَ وَمَنْ هُوَ فَسَكَتَ قَالَ فَلَعَلَّهُمْ قَالُوا الزُّبَيْرَ قَالَ نَعَمْ‏.‏ قَالَ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ لَخَيْرُهُمْ مَا عَلِمْتُ، وَإِنْ كَانَ لأَحَبَّهُمْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3718,
			"arabicnumber": 3718,
			"text": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، أَخْبَرَنِي أَبِي، سَمِعْتُ مَرْوَانَ، كُنْتُ عِنْدَ عُثْمَانَ، أَتَاهُ رَجُلٌ فَقَالَ اسْتَخْلِفْ‏.‏ قَالَ وَقِيلَ ذَاكَ قَالَ نَعَمْ، الزُّبَيْرُ‏.‏ قَالَ أَمَا وَاللَّهِ إِنَّكُمْ لَتَعْلَمُونَ أَنَّهُ خَيْرُكُمْ‏.‏ ثَلاَثًا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ ـ هُوَ ابْنُ أَبِي سَلَمَةَ ـ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَإِنَّ حَوَارِيَّ الزُّبَيْرُ بْنُ الْعَوَّامِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3720,
			"arabicnumber": 3720,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا ‏{‏عَبْدُ اللَّهِ‏}‏ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ كُنْتُ يَوْمَ الأَحْزَابِ جُعِلْتُ أَنَا وَعُمَرُ بْنُ أَبِي سَلَمَةَ، فِي النِّسَاءِ، فَنَظَرْتُ فَإِذَا أَنَا بِالزُّبَيْرِ، عَلَى فَرَسِهِ، يَخْتَلِفُ إِلَى بَنِي قُرَيْظَةَ مَرَّتَيْنِ أَوْ ثَلاَثًا، فَلَمَّا رَجَعْتُ قُلْتُ يَا أَبَتِ، رَأَيْتُكَ تَخْتَلِفُ‏.‏ قَالَ أَوَهَلْ رَأَيْتَنِي يَا بُنَىَّ قُلْتُ نَعَمْ‏.‏ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ يَأْتِ بَنِي قُرَيْظَةَ فَيَأْتِينِي بِخَبَرِهِمْ ‏\"‏‏.‏ فَانْطَلَقْتُ، فَلَمَّا رَجَعْتُ جَمَعَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَوَيْهِ فَقَالَ ‏\"‏ فِدَاكَ أَبِي وَأُمِّي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3721,
			"arabicnumber": 3721,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ أَصْحَابَ النَّبِيِّ، صلى الله عليه وسلم قَالُوا لِلزُّبَيْرِ يَوْمَ الْيَرْمُوكِ أَلاَ تَشُدُّ فَنَشُدَّ مَعَكَ فَحَمَلَ عَلَيْهِمْ، فَضَرَبُوهُ ضَرْبَتَيْنِ عَلَى عَاتِقِهِ، بَيْنَهُمَا ضَرْبَةٌ ضُرِبَهَا يَوْمَ بَدْرٍ‏.‏ قَالَ عُرْوَةُ فَكُنْتُ أُدْخِلُ أَصَابِعِي فِي تِلْكَ الضَّرَبَاتِ أَلْعَبُ وَأَنَا صَغِيرٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3722,
			"arabicnumber": 3722,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، عَنْ أَبِي عُثْمَانَ، قَالَ لَمْ يَبْقَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَعْضِ تِلْكَ الأَيَّامِ الَّتِي قَاتَلَ فِيهِنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم غَيْرُ طَلْحَةَ وَسَعْدٍ‏.‏ عَنْ حَدِيثِهِمَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3724,
			"arabicnumber": 3724,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ،، قَالَ رَأَيْتُ يَدَ طَلْحَةَ الَّتِي وَقَى بِهَا النَّبِيَّ صلى الله عليه وسلم قَدْ شَلَّتْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3725,
			"arabicnumber": 3725,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ سَمِعْتُ سَعْدًا، يَقُولُ جَمَعَ لِي النَّبِيُّ صلى الله عليه وسلم أَبَوَيْهِ يَوْمَ أُحُدٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3726,
			"arabicnumber": 3726,
			"text": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ لَقَدْ رَأَيْتُنِي وَأَنَا ثُلُثُ الإِسْلاَمِ،‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3727,
			"arabicnumber": 3727,
			"text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، حَدَّثَنَا هَاشِمُ بْنُ هَاشِمِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ مَا أَسْلَمَ أَحَدٌ إِلاَّ فِي الْيَوْمِ الَّذِي أَسْلَمْتُ فِيهِ، وَلَقَدْ مَكَثْتُ سَبْعَةَ أَيَّامٍ وَإِنِّي لَثُلُثُ الإِسْلاَمِ‏.‏ تَابَعَهُ أَبُو أُسَامَةَ حَدَّثَنَا هَاشِمٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3728,
			"arabicnumber": 3728,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ سَعْدًا ـ رضى الله عنه ـ يَقُولُ إِنِّي لأَوَّلُ الْعَرَبِ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَكُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَمَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الشَّجَرِ، حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ كَمَا يَضَعُ الْبَعِيرُ أَوِ الشَّاةُ، مَا لَهُ خِلْطٌ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، لَقَدْ خِبْتُ إِذًا وَضَلَّ عَمَلِي‏.‏ وَكَانُوا وَشَوْا بِهِ إِلَى عُمَرَ، قَالُوا لاَ يُحْسِنُ يُصَلِّي‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3729,
			"arabicnumber": 3729,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، قَالَ إِنَّ عَلِيًّا خَطَبَ بِنْتَ أَبِي جَهْلٍ، فَسَمِعَتْ بِذَلِكَ، فَاطِمَةُ، فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَزْعُمُ قَوْمُكَ أَنَّكَ لاَ تَغْضَبُ لِبَنَاتِكَ، هَذَا عَلِيٌّ نَاكِحٌ بِنْتَ أَبِي جَهْلٍ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمِعْتُهُ حِينَ تَشَهَّدَ يَقُولُ ‏\"‏ أَمَّا بَعْدُ أَنْكَحْتُ أَبَا الْعَاصِ بْنَ الرَّبِيعِ، فَحَدَّثَنِي وَصَدَقَنِي، وَإِنَّ فَاطِمَةَ بَضْعَةٌ مِنِّي، وَإِنِّي أَكْرَهُ أَنْ يَسُوءَهَا، وَاللَّهِ لاَ تَجْتَمِعُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِنْتُ عَدُوِّ اللَّهِ عِنْدَ رَجُلٍ وَاحِدٍ ‏\"‏‏.‏ فَتَرَكَ عَلِيٌّ الْخِطْبَةَ‏.‏ وَزَادَ مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ عَنِ ابْنِ شِهَابٍ عَنْ عَلِيٍّ عَنْ مِسْوَرٍ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ قَالَ ‏\"‏ حَدَّثَنِي فَصَدَقَنِي، وَوَعَدَنِي فَوَفَى لِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3730,
			"arabicnumber": 3730,
			"text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم بَعْثًا، وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ بَعْضُ النَّاسِ فِي إِمَارَتِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنْ تَطْعُنُوا فِي إِمَارَتِهِ فَقَدْ كُنْتُمْ تَطْعُنُونَ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللَّهِ، إِنْ كَانَ لَخَلِيقًا لِلإِمَارَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3731,
			"arabicnumber": 3731,
			"text": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَىَّ قَائِفٌ وَالنَّبِيُّ صلى الله عليه وسلم شَاهِدٌ، وَأُسَامَةُ بْنُ زَيْدٍ وَزَيْدُ بْنُ حَارِثَةَ مُضْطَجِعَانِ، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ‏.‏ قَالَ فَسُرَّ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم وَأَعْجَبَهُ، فَأَخْبَرَ بِهِ عَائِشَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3732,
			"arabicnumber": 3732,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ قُرَيْشًا، أَهَمَّهُمْ شَأْنُ الْمَخْزُومِيَّةِ، فَقَالُوا مَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ بْنُ زَيْدٍ، حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3733,
			"arabicnumber": 3733,
			"text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ ذَهَبْتُ أَسْأَلُ الزُّهْرِيَّ عَنْ حَدِيثِ الْمَخْزُومِيَّةِ، فَصَاحَ بِي، قُلْتُ لِسُفْيَانَ فَلَمْ تَحْتَمِلْهُ عَنْ أَحَدٍ قَالَ وَجَدْتُهُ فِي كِتَابٍ كَانَ كَتَبَهُ أَيُّوبُ بْنُ مُوسَى عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ امْرَأَةً مِنْ بَنِي مَخْزُومٍ سَرَقَتْ، فَقَالُ��ا مَنْ يُكَلِّمُ فِيهَا النَّبِيَّ صلى الله عليه وسلم فَلَمْ يَجْتَرِئْ أَحَدٌ أَنْ يُكَلِّمَهُ، فَكَلَّمَهُ أُسَامَةُ بْنُ زَيْدٍ، فَقَالَ ‏ \"‏ إِنَّ بَنِي إِسْرَائِيلَ كَانَ إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ الضَّعِيفُ قَطَعُوهُ، لَوْ كَانَتْ فَاطِمَةُ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3734,
			"arabicnumber": 3734,
			"text": "حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَبَّادٍ، يَحْيَى بْنُ عَبَّادٍ حَدَّثَنَا الْمَاجِشُونُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ نَظَرَ ابْنُ عُمَرَ يَوْمًا وَهْوَ فِي الْمَسْجِدِ إِلَى رَجُلٍ يَسْحَبُ ثِيَابَهُ فِي نَاحِيَةٍ مِنَ الْمَسْجِدِ فَقَالَ انْظُرْ مَنْ هَذَا لَيْتَ هَذَا عِنْدِي‏.‏ قَالَ لَهُ إِنْسَانٌ أَمَا تَعْرِفُ هَذَا يَا أَبَا عَبْدِ الرَّحْمَنِ هَذَا مُحَمَّدُ بْنُ أُسَامَةَ، قَالَ فَطَأْطَأَ ابْنُ عُمَرَ رَأْسَهُ، وَنَقَرَ بِيَدَيْهِ فِي الأَرْضِ، ثُمَّ قَالَ لَوْ رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَحَبَّهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3735,
			"arabicnumber": 3735,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ حَدَّثَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَأْخُذُهُ وَالْحَسَنَ فَيَقُولُ ‏ \"‏ اللَّهُمَّ أَحِبَّهُمَا فَإِنِّي أُحِبُّهُمَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3736,
			"arabicnumber": 3736,
			"text": "وَقَالَ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي مَوْلًى، لأُسَامَةَ بْنِ زَيْدٍ‏.‏ أَنَّ الْحَجَّاجَ بْنَ أَيْمَنَ ابْنِ أُمِّ أَيْمَنَ،، وَكَانَ، أَيْمَنُ ابْنُ أُمِّ أَيْمَنَ أَخَا أُسَامَةَ لأُمِّهِ، وَهْوَ رَجُلٌ مِنَ الأَنْصَارِ، فَرَآهُ ابْنُ عُمَرَ لَمْ يُتِمَّ رُكُوعَهُ وَلاَ سُجُودَهُ فَقَالَ أَعِدْ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3737,
			"arabicnumber": 3737,
			"text": "قَالَ أَبُو عَبْدِ اللَّهِ وَحَدَّثَنِي سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي حَرْمَلَةُ، مَوْلَى أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ بَيْنَمَا هُوَ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ إِذْ دَخَلَ الْحَجَّاجُ بْنُ أَيْمَنَ فَلَمْ يُتِمَّ رُكُوعَهُ وَلاَ سُجُودَهُ، فَقَالَ أَعِدْ‏.‏ فَلَمَّا وَلَّى قَالَ لِي ابْنُ عُمَرَ مَنْ هَذَا قُلْتُ الْحَجَّاجُ بْنُ أَيْمَنَ ابْنِ أُمِّ أَيْمَنَ‏.‏ فَقَالَ ابْنُ عُمَرَ لَوْ رَأَى هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم لأَحَبَّهُ، فَذَكَرَ حُبَّهُ وَمَا وَلَدَتْهُ أُمُّ أَيْمَنَ‏.‏ قَالَ وَحَدَّثَنِي بَعْضُ أَصْحَابِي عَنْ سُلَيْمَانَ وَكَانَتْ حَاضِنَةَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3739,
			"arabicnumber": 3739,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3740,
			"arabicnumber": 3740,
			"text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنْ أُخْتِهِ، حَفْصَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏ \"‏ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنِ الْمُغِيرَةِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ،، قَالَ قَدِمْتُ الشَّأْمَ فَصَلَّيْتُ رَكْعَتَيْنِ، ثُمَّ قُلْتُ اللَّهُمَّ يَسِّرْ لِي جَلِيسًا صَالِحًا، فَأَتَيْتُ قَوْمًا فَجَلَسْتُ إِلَيْهِمْ، فَإِذَا شَيْخٌ قَدْ جَاءَ حَتَّى جَلَسَ إِلَى جَنْبِي، قُلْتُ مَنْ هَذَا قَالُوا أَبُو الدَّرْدَاءِ‏.‏ فَقُلْتُ إِنِّي دَعَوْتُ اللَّهَ أَنْ يُيَسِّرَ لِي جَلِيسًا صَالِحًا فَيَسَّرَكَ لِي، قَالَ مِمَّنْ أَنْتَ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ‏.‏ قَالَ أَوَلَيْسَ عِنْدَكُمُ ابْنُ أُمِّ عَبْدٍ صَاحِبُ النَّعْلَيْنِ وَالْوِسَادِ وَالْمِطْهَرَةِ وَفِيكُمُ الَّذِي أَجَارَهُ اللَّهُ مِنَ الشَّيْطَانِ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم أَوَلَيْسَ فِيكُمْ صَاحِبُ سِرِّ النَّبِيِّ صلى الله عليه وسلم الَّذِي لاَ يَعْلَمُ أَحَدٌ غَيْرُهُ ثُمَّ قَالَ كَيْفَ يَقْرَأُ عَبْدُ اللَّهِ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى‏}‏، فَقَرَأْتُ عَلَيْهِ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى * وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ وَاللَّهِ لَقَدْ أَقْرَأَنِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ فِيهِ إِلَى فِيَّ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3743,
			"arabicnumber": 3743,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، قَالَ ذَهَبَ عَلْقَمَةُ إِلَى الشَّأْمِ، فَلَمَّا دَخَلَ الْمَسْجِدَ قَالَ اللَّهُمَّ يَسِّرْ لِي جَلِيسًا صَالِحًا‏.‏ فَجَلَسَ إِلَى أَبِي الدَّرْدَاءِ فَقَالَ أَبُو الدَّرْدَاءِ مِمَّنْ أَنْتَ قَالَ مِنْ أَهْلِ الْكُوفَةِ‏.‏ قَالَ أَلَيْسَ فِيكُمْ ـ أَوْ مِنْكُمْ ـ صَاحِبُ السِّرِّ الَّذِي لاَ يَعْلَمُهُ غَيْرُهُ يَعْنِي حُذَيْفَةَ‏.‏ قَالَ قُلْتُ بَلَى‏.‏ قَالَ أَلَيْسَ فِيكُمُ ـ أَوْ مِنْكُمُ ـ الَّذِي أَجَارَهُ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم يَعْنِي مِنَ الشَّيْطَانِ، يَعْنِي عَمَّارًا‏.‏ قُلْتُ بَلَى‏.‏ قَالَ أَلَيْسَ فِيكُمْ ـ أَوْ مِنْكُمْ ـ صَاحِبُ السِّوَاكِ أَوِ السِّرَارِ قَالَ بَلَى‏.‏ قَالَ كَيْفَ كَانَ عَبْدُ اللَّهِ يَقْرَأُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى‏}‏ قُلْتُ ‏{‏وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ مَا زَالَ بِي هَؤُلاَءِ حَتَّى كَادُوا يَسْتَنْزِلُونِي عَنْ شَىْءٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ لِكُلِّ أُمَّةٍ أَمِينًا، وَإِنَّ أَمِينَنَا أَيَّتُهَا الأُمَّةُ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": 3745,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَهْلِ نَجْرَانَ ‏ \"‏ لأَبْعَثَنَّ ـ يَعْنِي عَلَيْكُمْ ـ يَعْنِي أَمِينًا ـ حَقَّ أَمِينٍ ‏\"‏‏.‏ فَأَشْرَفَ أَصْحَابُهُ، فَبَعَثَ أَبَا عُبَيْدَةَ رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": 3746,
			"text": "حَدَّثَنَا صَدَقَةُ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا أَبُو مُوسَى، عَنِ الْحَسَنِ، سَمِعَ أَبَا بَكْرَةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَالْحَسَنُ إِلَى جَنْبِهِ، يَنْظُرُ إِلَى النَّاسِ مَرَّةً وَإِلَيْهِ مَرَّةً، وَيَقُولُ ‏ \"‏ ابْنِي هَذَا سَيِّدٌ، وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": 3747,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَأْخُذُهُ وَالْحَسَنَ وَيَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أُحِبُّهُمَا فَأَحِبَّهُمَا ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": 3748,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُحَمَّدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أُتِيَ عُبَيْدُ اللَّهِ بْنُ زِيَادٍ بِرَأْسِ الْحُسَيْنِ ـ عَلَيْهِ السَّلاَمُ ـ فَجُعِلَ فِي طَسْتٍ، فَجَعَلَ يَنْكُتُ، وَقَالَ فِي حُسْنِهِ شَيْئًا‏.‏ فَقَالَ أَنَسٌ كَانَ أَشْبَهَهُمْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم، وَكَانَ مَخْضُوبًا بِالْوَسْمَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": 3749,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَالْحَسَنُ عَلَى عَاتِقِهِ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": 3750,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ رَأَيْتُ أَبَا بَكْرٍ ـ رضى الله عنه ـ وَحَمَلَ الْحَسَنَ وَهْوَ يَقُولُ بِأَبِي شَبِيهٌ بِالنَّبِيِّ، لَيْسَ شَبِيهٌ بِعَلِيٍّ‏.‏ وَعَلِيٌّ يَضْحَكُ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": 3751,
			"text": "حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، وَصَدَقَةُ، قَالاَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ أَبُو بَكْرٍ ارْقُبُوا مُحَمَّدًا صلى الله عليه وسلم فِي أَهْلِ بَيْتِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": 3752,
			"text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ،‏.‏ وَقَالَ عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسٌ، قَالَ لَمْ يَكُنْ أَحَدٌ أَشْبَهَ بِالنَّبِيِّ صلى الله عليه وسلم مِنَ الْحَسَنِ بْنِ عَلِيٍّ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": 3753,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، سَمِعْتُ ابْنَ أَبِي نُعْمٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَسَأَلَهُ، عَنِ الْمُحْرِمِ،، قَالَ شُعْبَةُ أَحْسِبُهُ يَقْتُلُ الذُّبَابَ فَقَالَ أَهْلُ الْعِرَاقِ يَسْأَلُونَ عَنِ الذُّبَابِ وَقَدْ قَتَلُوا ابْنَ ابْنَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ هُمَا رَيْحَانَتَاىَ مِنَ الدُّنْيَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": 3754,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، أَخْبَرَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ عُمَرُ يَقُولُ أَبُو بَكْرٍ سَيِّدُنَا، وَأَعْتَقَ سَيِّدَنَا‏.‏ يَعْنِي بِلاَلاً‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ عُبَيْدٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، أَنَّ بِلاَلاً، قَالَ لأَبِي بَكْرٍ إِنْ كُنْتَ إِنَّمَا اشْتَرَيْتَنِي لِنَفْسِكَ فَأَمْسِكْنِي، وَإِنْ كُنْتَ إِنَّمَا اشْتَرَيْتَنِي لِلَّهِ فَدَعْنِي وَعَمَلَ اللَّهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،، قَالَ ضَمَّنِي النَّبِيُّ صلى الله عليه وسلم إِلَى صَدْرِهِ وَقَالَ ‏ \"‏ اللَّهُمَّ عَلِّمْهُ الْحِكْمَةَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": 3757,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ وَاقِدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم نَعَى زَيْدًا وَجَعْفَرًا وَابْنَ رَوَاحَةَ لِلنَّاسِ قَبْلَ أَنْ يَأْتِيَهُمْ خَبَرُهُمْ، فَقَالَ ‏ \"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَ جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَ ابْنُ رَوَاحَةَ فَأُصِيبَ ـ وَعَيْنَاهُ تَذْرِفَانِ ـ حَتَّى أَخَذَ سَيْفٌ مِنْ سُيُوفِ اللَّهِ حَتَّى فَتَحَ اللَّهُ عَلَيْهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": 3758,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، قَالَ ذُكِرَ عَبْدُ اللَّهِ عِنْدَ عَبْدِ اللَّهِ بْنِ عَمْرٍو، فَقَالَ ذَاكَ رَجُلٌ لاَ أَزَالُ أُحِبُّهُ بَعْدَ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اسْتَقْرِئُوا الْقُرْآنَ مِنْ أَرْبَعَةٍ مِنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، فَبَدَأَ بِهِ، وَسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ، وَأُبَىِّ بْنِ كَعْبٍ، وَمُعَاذِ بْنِ جَبَلٍ ‏\"‏‏.‏ قَالَ لاَ أَدْرِي بَدَأَ بِأُبَىٍّ أَوْ بِمُعَاذٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": 3760,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": 3761,
			"text": "حَدَّثَنَا مُوسَى، عَنْ أَبِي عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، دَخَلْتُ الشَّأْمَ فَصَلَّيْتُ رَكْعَتَيْنِ، فَقُلْتُ اللَّهُمَّ يَسِّرْ لِي جَلِيسًا‏.‏ فَرَأَيْتُ شَيْخًا مُقْبِلاً، فَلَمَّا دَنَا قُلْتُ أَرْجُو أَنْ يَكُونَ اسْتَجَابَ‏.‏ قَالَ مِنْ أَيْنَ أَنْتَ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ‏.‏ قَالَ أَفَلَمْ يَكُنْ فِيكُمْ صَاحِبُ النَّعْلَيْنِ وَالْوِسَادِ وَالْمِطْهَرَةِ أَوَلَمْ يَكُنْ فِيكُمُ الَّذِي أُجِيرَ مِنَ الشَّيْطَانِ أَوَلَمْ يَكُنْ فِيكُمْ صَاحِبُ السِّرِّ الَّذِي لاَ يَعْلَمُهُ غَيْرُهُ كَيْفَ قَرَأَ ابْنُ أُمِّ عَبْدٍ ‏{‏وَاللَّيْلِ‏}‏ فَقَرَأْتُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى * وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَقْرَأَنِيهَا النَّبِيُّ صلى الله عليه وسلم فَاهُ إِلَى فِيَّ، فَمَا زَالَ هَؤُلاَءِ حَتَّى كَادُوا يَرُدُّونِي‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": 3762,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ،، قَالَ سَأَلْنَا حُذَيْفَةَ عَنْ رَجُلٍ، قَرِيبِ السَّمْتِ وَالْهَدْىِ مِنَ النَّبِيِّ صلى الله عليه وسلم حَتَّى نَأْخُذَ عَنْهُ فَقَالَ مَا أَعْرِفُ أَحَدًا أَقْرَبَ سَمْتًا وَهَدْيًا وَدَلاًّ بِالنَّبِيِّ صلى الله عليه وسلم مِنِ ابْنِ أُمِّ عَبْدٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": 3763,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي الأَسْوَدُ بْنُ يَزِيدَ، قَالَ سَمِعْتُ أَبَا مُوسَى الأَشْعَرِيَّ ـ رضى الله عنه ـ يَقُولُ قَدِمْتُ أَنَا وَأَخِي مِنَ الْيَمَنِ، فَمَكُثْنَا حِينًا مَا نُرَى إِلاَّ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ رَجُلٌ مِنْ أَهْلِ بَيْتِ النَّبِيِّ صلى الله عليه وسلم، لِمَا نَرَى مِنْ دُخُولِهِ وَدُخُولِ أُمِّهِ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": 3764,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ، حَدَّثَنَا الْمُعَافَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ أَوْتَرَ مُعَاوِيَةُ بَعْدَ الْعِشَاءِ بِرَكْعَةٍ وَعِنْدَهُ مَوْلًى لاِبْنِ عَبَّاسٍ، فَأَتَى ابْنَ عَبَّاسٍ فَقَالَ دَعْهُ، فَإِنَّهُ صَحِبَ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": 3765,
			"text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، قِيلَ لاِبْنِ عَبَّاسٍ هَلْ لَكَ فِي أَمِيرِ الْمُؤْمِنِينَ مُعَاوِيَةَ، فَإِنَّهُ مَا أَوْتَرَ إِلاَّ بِوَاحِدَةٍ‏.‏ قَالَ إِنَّهُ فَقِيهٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": 3766,
			"text": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، عَنْ مُعَاوِيَةَ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ لَتُصَلُّونَ صَلاَةً لَقَدْ صَحِبْنَا النَّبِيَّ صلى الله عليه وسلم فَمَا رَأَيْنَاهُ يُصَلِّيهَا، وَلَقَدْ نَهَى عَنْهُمَا، يَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": 3767,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فَاطِمَةُ بَضْعَةٌ مِنِّي، فَمَنْ أَغْضَبَهَا أَغْضَبَنِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": 3768,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَبُو سَلَمَةَ إِنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا ‏ \"‏ يَا عَائِشَ، هَذَا جِبْرِيلُ يُقْرِئُكِ السَّلاَمَ ‏\"‏‏.‏ فَقُلْتُ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، تَرَى مَا لاَ أَرَى‏.‏ تُرِيدُ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": 3769,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، قَالَ وَحَدَّثَنَا عَمْرٌو، أَخْبَرَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ، وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3770,
			"arabicnumber": 3770,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى الطَّعَامِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": 3771,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّ عَائِشَةَ، اشْتَكَتْ، فَجَاءَ ابْنُ عَبَّاسٍ فَقَالَ يَا أُمَّ الْمُؤْمِنِينَ، تَقْدَمِينَ عَلَى فَرَطِ صِدْقٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَى أَبِي بَكْرٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": 3772,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، سَمِعْتُ أَبَا وَائِلٍ، قَالَ لَمَّا بَعَثَ عَلِيٌّ عَمَّارًا وَالْحَسَنَ إِلَى الْكُوفَةِ لِيَسْتَنْفِرَهُمْ خَطَبَ عَمَّارٌ فَقَالَ إِنِّي لأَعْلَمُ أَنَّهَا زَوْجَتُهُ فِي الدُّنْيَا وَالآخِرَةِ، وَلَكِنَّ اللَّهَ ابْتَلاَكُمْ لِتَتَّبِعُوهُ أَوْ إِيَّاهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": 3773,
			"text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلاَدَةً فَهَلَكَتْ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا، فَأَدْرَكَتْهُمُ الصَّلاَةُ، فَصَلَّوْا بِغَيْرِ وُضُوءٍ، فَلَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم شَكَوْا ذَلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ إِلاَّ جَعَلَ اللَّهُ لَكِ مِنْهُ مَخْرَجًا، وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": 3774,
			"text": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا كَانَ فِي مَرَضِهِ، جَعَلَ يَدُورُ فِي نِسَائِهِ وَيَقُولُ ‏ \"‏ أَيْنَ أَنَا غَدًا أَيْنَ أَنَا غَدًا ‏\"‏‏.‏ حِرْصًا عَلَى بَيْتِ عَائِشَةَ، قَالَتْ عَائِشَةُ فَلَمَّا كَانَ يَوْمِي سَكَنَ‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": 3775,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ،، قَالَ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ قَالَتْ عَائِشَةُ فَاجْتَمَعَ صَوَاحِبِي إِلَى أُمِّ سَلَمَةَ، فَقُلْنَ يَا أُمَّ سَلَمَةَ، وَاللَّهِ إِنَّ النَّاسَ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ، وَإِنَّا نُرِيدُ الْخَيْرَ كَمَا تُرِيدُهُ عَائِشَةُ، فَمُرِي رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَأْمُرَ النَّاسَ أَنْ يُهْدُوا إِلَيْهِ حَيْثُ مَا كَانَ أَوْ حَيْثُ مَا دَارَ، قَالَتْ فَذَكَرَتْ ذَلِكَ أُمُّ سَلَمَةَ لِلنَّبِيِّ صلى الله عليه وسلم قَالَتْ فَأَعْرَضَ عَنِّي، فَلَمَّا عَادَ إِلَىَّ ذَكَرْتُ لَهُ ذَاكَ فَأَعْرَضَ عَنِّي، فَلَمَّا كَانَ فِي الثَّالِثَةِ ذَكَرْتُ لَهُ فَقَالَ ‏ \"‏ يَا أُمَّ سَلَمَةَ لاَ تُؤْذِينِي فِي عَائِشَةَ، فَإِنَّهُ وَاللَّهِ مَا نَزَلَ عَلَىَّ الْوَحْىُ وَأَنَا فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ غَيْرِهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 120
			}
		}
	]
}