{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6304,
			"arabicnumber": 6304,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ يَدْعُو بِهَا، وَأُرِيدُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لأُمَّتِي فِي الآخِرَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6305,
			"arabicnumber": 6305,
			"text": "وَقَالَ لِي خَلِيفَةُ قَالَ مُعْتَمِرٌ سَمِعْتُ أَبِي، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ نَبِيٍّ سَأَلَ سُؤْلاً ـ أَوْ قَالَ لِكُلِّ نَبِيٍّ دَعْوَةٌ قَدْ دَعَا بِهَا ـ فَاسْتُجِيبَ، فَجَعَلْتُ دَعْوَتِي شَفَاعَةً لأُمَّتِي يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6306,
			"arabicnumber": 6306,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، قَالَ حَدَّثَنِي شَدَّادُ بْنُ أَوْسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ سَيِّدُ الاِسْتِغْفَارِ أَنْ تَقُولَ اللَّهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَىَّ وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ ‏\"‏‏.‏ قَالَ ‏\"‏ وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهْوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهْوَ مِنْ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6307,
			"arabicnumber": 6307,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ قَالَ أَبُو هُرَيْرَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَاللَّهِ إِنِّي لأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6308,
			"arabicnumber": 6308,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، حَدَّثَنَا عَبْدُ اللَّهِ، حَدِيثَيْنِ أَحَدُهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم وَالآخَرُ عَنْ نَفْسِهِ، قَالَ ‏\"‏ إِنَّ الْمُؤْمِنَ يَرَى ذُنُوبَهُ كَأَنَّهُ قَاعِدٌ تَحْتَ جَبَلٍ يَخَافُ أَنْ يَقَعَ عَلَيْهِ، وَإِنَّ الْفَاجِرَ يَرَى ذُنُوبَهُ كَذُبَابٍ مَرَّ عَلَى أَنْفِهِ ‏\"‏‏.‏ فَقَالَ بِهِ هَكَذَا قَالَ أَبُو شِهَابٍ بِيَدِهِ فَوْقَ أَنْفِهِ‏.‏ ثُمَّ قَالَ ‏\"‏ لَلَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ رَجُلٍ نَزَلَ مَنْزِلاً، وَبِهِ مَهْلَكَةٌ، وَمَعَهُ رَاحِلَتُهُ عَلَيْهَا طَعَامُهُ وَشَرَابُهُ، فَوَضَعَ رَأْسَهُ فَنَامَ نَوْمَةً، فَاسْتَيْقَظَ وَقَدْ ذَهَبَتْ رَاحِلَتُهُ، حَتَّى اشْتَدَّ عَلَيْهِ الْحَرُّ وَالْعَطَشُ أَوْ مَا شَاءَ اللَّهُ، قَالَ أَرْجِعُ إِلَى مَكَانِي‏.‏ فَرَجَعَ فَنَامَ نَوْمَةً، ثُمَّ رَفَعَ رَأْسَهُ، فَإِذَا رَاحِلَتُهُ عِنْدَهُ ‏\"‏‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَجَرِيرٌ عَنِ الأَعْمَشِ‏.‏ وَقَالَ أَبُو أُسَامَةَ حَدَّثَنَا الأَعْمَشُ حَدَّثَنَا عُمَارَةُ سَمِعْتُ الْحَارِثَ‏.‏ وَقَالَ شُعْبَةُ وَأَبُو مُسْلِمٍ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنِ الْحَارِثِ بْنِ سُوَيْدٍ‏.‏ وَقَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا الأَعْمَشُ عَنْ عُمَارَةَ عَنِ الأَسْوَدِ عَنْ عَبْدِ اللَّهِ وَعَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنِ الْحَارِثِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6309,
			"arabicnumber": 6309,
			"text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا هُدْبَةُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ سَقَطَ عَلَى بَعِيرِهِ، وَقَدْ أَضَلَّهُ فِي أَرْضِ فَلاَةٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6310,
			"arabicnumber": 6310,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً، فَإِذَا طَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ، حَتَّى يَجِيءَ الْمُؤَذِّنُ فَيُؤْذِنَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6311,
			"arabicnumber": 6311,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ مَنْصُورًا، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، قَالَ حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وَضُوءَكَ لِلصَّلاَةِ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الأَيْمَنِ، وَقُلِ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ فَإِنْ مُتَّ مُتَّ عَلَى الْفِطْرَةِ، فَاجْعَلْهُنَّ آخِرَ مَا تَقُولُ ‏\"‏‏.‏ فَقُلْتُ أَسْتَذْكِرُهُنَّ وَبِرَسُولِكَ الَّذِي أَرْسَلْتَ‏.‏ قَالَ ‏\"‏ لاَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6312,
			"arabicnumber": 6312,
			"text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ ‏\"‏ بِاسْمِكَ أَمُوتُ وَأَحْيَا ‏\"‏‏.‏ وَإِذَا قَامَ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏ تُنْشِرُهَا: تُخْرِجُهَا",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6313,
			"arabicnumber": 6313,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، وَمُحَمَّدُ بْنُ عَرْعَرَةَ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ بْنَ عَازِبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ رَجُلاً‏.‏ وَحَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا أَبُو إِسْحَاقَ الْهَمْدَانِيُّ عَنِ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَوْصَى رَجُلاً فَقَالَ ‏ \"‏ إِذَا أَرَدْتَ مَضْجَعَكَ فَقُلِ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ فَإِنْ مُتَّ مُتَّ عَلَى الْفِطْرَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6314,
			"arabicnumber": 6314,
			"text": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ ـ رضى الله عنه قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ وَضَعَ يَدَهُ تَحْتَ خَدِّهِ ثُمَّ يَقُولُ ‏\"‏ اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا ‏\"‏‏.‏ وَإِذَا اسْتَيْقَظَ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6315,
			"arabicnumber": 6315,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْعَلاَءُ بْنُ الْمُسَيَّبِ، قَالَ حَدَّثَنِي أَبِي، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ نَامَ عَلَى شِقِّهِ الأَيْمَنِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَالَهُنَّ ثُمَّ مَاتَ تَحْتَ لَيْلَتِهِ مَاتَ عَلَى الْفِطْرَةِ ‏\"‏‏.‏ ‏{‏اسْتَرْهَبُوهُمْ‏}‏ مِنَ الرَّهْبَةِ، مَلَكُوتٌ مُلْكٌ مَثَلُ رَهَبُوتٌ خَيْرٌ مِنْ رَحَمُوتٍ، تَقُولُ تَرْهَبُ خَيْرٌ مِنْ أَنْ تَرْحَمَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6316,
			"arabicnumber": 6316,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ عِنْدَ مَيْمُونَةَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَأَتَى حَاجَتَهُ، غَسَلَ وَجْهَهُ وَيَدَيْهِ، ثُمَّ نَامَ، ثُمَّ قَامَ فَأَتَى الْقِرْبَةَ فَأَطْلَقَ شِنَاقَهَا، ثُمَّ تَوَضَّأَ وُضُوءًا بَيْنَ وُضُوءَيْنِ لَمْ يُكْثِرْ، وَقَدْ أَبْلَغَ، فَصَلَّى، فَقُمْتُ فَتَمَطَّيْتُ كَرَاهِيَةَ أَنْ يَرَى أَنِّي كُنْتُ أَتَّقِيهِ، فَتَوَضَّأْتُ، فَقَامَ يُصَلِّي، فَقُمْتُ عَنْ يَسَارِهِ، فَأَخَذَ بِأُذُنِي فَأَدَارَنِي عَنْ يَمِينِهِ، فَتَتَامَّتْ صَلاَتُهُ ثَلاَثَ عَشْرَةَ رَكْعَةً ثُمَّ اضْطَجَعَ فَنَامَ حَتَّى نَفَخَ ـ وَكَانَ إِذَا نَامَ نَفَخَ ـ فَآذَنَهُ بِلاَلٌ بِالصَّلاَةِ، فَصَلَّى وَلَمْ يَتَوَضَّأْ، وَكَانَ يَقُولُ فِي دُعَائِهِ ‏ \"‏ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي بَصَرِي نُورًا، وَفِي سَمْعِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ يَسَارِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَاجْعَلْ لِي نُورًا ‏\"‏‏.‏ قَالَ كُرَيْبٌ وَسَبْعٌ فِي التَّابُوتِ‏.‏ فَلَقِيتُ رَجُلاً مِنْ وَلَدِ الْعَبَّاسِ فَحَدَّثَنِي بِهِنَّ، فَذَكَرَ عَصَبِي وَلَحْمِي وَدَمِي وَشَعَرِي وَبَشَرِي، وَذَكَرَ خَصْلَتَيْنِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6317,
			"arabicnumber": 6317,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ سُلَيْمَانَ بْنَ أَبِي مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ قَالَ ‏ \"‏ اللَّهُمَّ لَكَ الْحَمْدُ، أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ، أَنْتَ الْحَقُّ وَوَعْدُكَ حَقٌّ، وَقَوْلُكَ حَقٌّ، وَلِقَاؤُكَ حَقٌّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ وَعَلَيْكَ تَوَكَّلْتُ وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ ـ أَوْ ـ لاَ إِلَهَ غَيْرُكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6318,
			"arabicnumber": 6318,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، أَنَّ فَاطِمَةَ ـ عَلَيْهِمَا السَّلاَمُ ـ شَكَتْ مَا تَلْقَى فِي يَدِهَا مِنَ الرَّحَى، فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم تَسْأَلُهُ خَادِمًا، فَلَمْ تَجِدْهُ، فَذَكَرَتْ ذَلِكَ لِعَائِشَةَ، فَلَمَّا جَاءَ أَخْبَرَتْهُ‏.‏ قَالَ فَجَاءَنَا وَقَدْ أَخَذْنَا مَضَاجِعَنَا، فَذَهَبْتُ أَقُومُ فَقَالَ ‏\"‏ مَكَانَكِ ‏\"‏‏.‏ فَجَلَسَ بَيْنَنَا حَتَّى وَجَدْتُ بَرْدَ قَدَمَيْهِ عَلَى صَدْرِي فَقَالَ ‏\"‏ أَلاَ أَدُلُّكُمَا عَلَى مَا هُوَ خَيْرٌ لَكُمَا مِنْ خَادِمٍ، إِذَا أَوَيْتُمَا إِلَى فِرَاشِكُمَا، أَوْ أَخَذْتُمَا مَضَاجِعَكُمَا، فَكَبِّرَا ثَلاَثًا وَثَلاَثِينَ، وَسَبِّحَا ثَلاَثًا وَثَلاَثِينَ، وَاحْمَدَا ثَلاَثًا وَثَلاَثِينَ، فَهَذَا خَيْرٌ لَكُمَا مِنْ خَادِمٍ ‏\"‏‏.‏ وَعَنْ شُعْبَةَ عَنْ خَالِدٍ عَنِ ابْنِ سِيرِينَ قَالَ التَّسْبِيحُ أَرْبَعٌ وَثَلاَثُونَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6319,
			"arabicnumber": 6319,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَخَذَ مَضْجَعَهُ نَفَثَ فِي يَدَيْهِ، وَقَرَأَ بِالْمُعَوِّذَاتِ، وَمَسَحَ بِهِمَا جَسَدَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6320,
			"arabicnumber": 6320,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ، فَإِنَّهُ لاَ يَدْرِي مَا خَلَفَهُ عَلَيْهِ، ثُمَّ يَقُولُ بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ ‏\"‏‏.‏ تَابَعَهُ أَبُو ضَمْرَةَ وَإِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ عَنْ عُبَيْدِ اللَّهِ‏.‏ وَقَالَ يَحْيَى وَبِشْرٌ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ مَالِكٌ وَابْنُ عَجْلاَنَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6321,
			"arabicnumber": 6321,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَتَنَزَّلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ، مَنْ يَسْأَلُنِي فَأُعْطِيَهُ، وَمَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ?\"‏‏‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6322,
			"arabicnumber": 6322,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ الْخَلاَءَ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6323,
			"arabicnumber": 6323,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ، عَنْ شَدَّادِ بْنِ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ سَيِّدُ الاِسْتِغْفَارِ اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ‏.‏ إِذَا قَالَ حِينَ يُمْسِي فَمَاتَ دَخَلَ الْجَنَّةَ ـ أَوْ كَانَ مِنْ أَهْلِ الْجَنَّةِ ـ وَإِذَا قَالَ حِينَ يُصْبِحُ فَمَاتَ مِنْ يَوْمِهِ ‏\"‏‏.‏ مِثْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6324,
			"arabicnumber": 6324,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ قَالَ ‏\"‏ بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا ‏\"‏‏.‏ وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6325,
			"arabicnumber": 6325,
			"text": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ قَالَ ‏\"‏ اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا ‏\"‏‏.‏ فَإِذَا اسْتَيْقَظَ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6326,
			"arabicnumber": 6326,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي‏.‏ قَالَ ‏ \"‏ قُلِ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏‏.‏ وَقَالَ عَمْرٌو عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، إِنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو، قَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لِلنَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6327,
			"arabicnumber": 6327,
			"text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ أُنْزِلَتْ فِي الدُّعَاءِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6328,
			"arabicnumber": 6328,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كُنَّا نَقُولُ فِي الصَّلاَةِ السَّلاَمُ عَلَى اللَّهِ، السَّلاَمُ عَلَى فُلاَنٍ‏.‏ فَقَالَ لَنَا النَّبِيُّ صلى الله عليه وسلم ذَاتَ يَوْمٍ ‏ \"‏ إِنَّ اللَّهَ هُوَ السَّلاَمُ، فَإِذَا قَعَدَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَقُلِ التَّحِيَّاتُ لِلَّهِ إِلَى قَوْلِهِ الصَّالِحِينَ‏.‏ فَإِذَا قَالَهَا أَصَابَ كُلَّ عَبْدٍ لِلَّهِ فِي السَّمَاءِ وَالأَرْضِ صَالِحٍ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏ ثُمَّ يَتَخَيَّرُ مِنَ الثَّنَاءِ مَا شَاءَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6329,
			"arabicnumber": 6329,
			"text": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا وَرْقَاءُ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ،‏.‏ قَالُوا يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالدَّرَجَاتِ وَالنَّعِيمِ الْمُقِيمِ‏.‏ قَالَ ‏\"‏ كَيْفَ ذَاكَ ‏\"‏‏.‏ قَالَ صَلَّوْا كَمَا صَلَّيْنَا، وَجَاهَدُوا كَمَا جَاهَدْنَا، وَأَنْفَقُوا مِنْ فُضُولِ أَمْوَالِهِمْ، وَلَيْسَتْ لَنَا أَمْوَالٌ‏.‏ قَالَ ‏\"‏ أَفَلاَ أُخْبِرُكُمْ بِأَمْرٍ تُدْرِكُونَ مَنْ كَانَ قَبْلَكُمْ، وَتَسْبِقُونَ مَنْ جَاءَ بَعْدَكُمْ، وَلاَ يَأْتِي أَحَدٌ بِمِثْلِ مَا جِئْتُمْ، إِلاَّ مَنْ جَاءَ بِمِثْلِهِ، تُسَبِّحُونَ فِي دُبُرِ كُلِّ صَلاَةٍ عَشْرًا، وَتَحْمَدُونَ عَشْرًا، وَتُكَبِّرُونَ عَشْرًا ‏\"‏‏.‏ تَابَعَهُ عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ سُمَىٍّ وَرَوَاهُ ابْنُ عَجْلاَنَ عَنْ سُمَىٍّ وَرَجَاءِ بْنِ حَيْوَةَ‏.‏ وَرَوَاهُ جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي الدَّرْدَاءِ‏.‏ وَرَوَاهُ سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6330,
			"arabicnumber": 6330,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ وَرَّادٍ، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كَتَبَ الْمُغِيرَةُ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلاَةٍ إِذَا سَلَّمَ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏‏.‏ وَقَالَ شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ الْمُسَيَّبَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6331,
			"arabicnumber": 6331,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، مَوْلَى سَلَمَةَ حَدَّثَنَا سَلَمَةُ بْنُ الأَكْوَعِ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى خَيْبَرَ، قَالَ رَجُلٌ مِنَ الْقَوْمِ أَيَا عَامِرُ لَوْ أَسْمَعْتَنَا مِنْ هُنَيْهَاتِكَ‏.‏ فَنَزَلَ يَحْدُو بِهِمْ يُذَكِّرُ‏.‏ تَاللَّهِ لَوْلاَ اللَّهُ مَا اهْتَدَيْنَا‏.‏ وَذَكَرَ شِعْرًا غَيْرَ هَذَا، وَلَكِنِّي لَمْ أَحْفَظْهُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ هَذَا السَّائِقُ ‏\"‏‏.‏ قَالُوا عَامِرُ بْنُ الأَكْوَعِ‏.‏ قَالَ ‏\"‏ يَرْحَمُهُ اللَّهُ ‏\"‏‏.‏ وَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا رَسُولَ اللَّهِ لَوْلاَ مَتَّعْتَنَا بِهِ، فَلَمَّا صَافَّ الْقَوْمَ قَاتَلُوهُمْ، فَأُصِيبَ عَامِرٌ بِقَائِمَةِ سَيْفِ نَفْسِهِ فَمَاتَ، فَلَمَّا أَمْسَوْا أَوْقَدُوا نَارًا كَثِيرَةً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا هَذِهِ النَّارُ عَلَى أَىِّ شَىْءٍ تُوقِدُونَ ‏\"‏‏.‏ قَالُوا عَلَى حُمُرٍ إِنْسِيَّةٍ‏.‏ فَقَالَ ‏\"‏ أَهْرِيقُوا مَا فِيهَا، وَكَسِّرُوهَا ‏\"‏‏.‏ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَلاَ نُهَرِيقُ مَا فِيهَا وَنَغْسِلُهَا قَالَ ‏\"‏ أَوْ ذَاكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6332,
			"arabicnumber": 6332,
			"text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، سَمِعْتُ ابْنَ أَبِي أَوْفَى ـ رضى الله عنهما كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَتَاهُ رَجُلٌ بِصَدَقَةٍ قَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ فُلاَنٍ ‏\"‏‏.‏ فَأَتَاهُ أَبِي فَقَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6333,
			"arabicnumber": 6333,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ جَرِيرًا، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ وَهْوَ نُصُبٌ كَانُوا يَعْبُدُونَهُ يُسَمَّى الْكَعْبَةَ الْيَمَانِيَةَ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَصَكَّ فِي صَدْرِي فَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ قَالَ فَخَرَجْتُ فِي خَمْسِينَ مِنْ أَحْمَسَ مِنْ قَوْمِي ـ وَرُبَّمَا قَالَ سُفْيَانُ فَانْطَلَقْتُ فِي عُصْبَةٍ مِنْ قَوْمِي ـ فَأَتَيْتُهَا فَأَحْرَقْتُهَا، ثُمَّ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ، وَاللَّهِ مَا أَتَيْتُكَ حَتَّى تَرَكْتُهَا مِثْلَ الْجَمَلِ الأَجْرَبِ‏.‏ فَدَعَا لأَحْمَسَ وَخَيْلِهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6334,
			"arabicnumber": 6334,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، قَالَ قَالَتْ أُمُّ سُلَيْمٍ لِلنَّبِيِّ صلى الله عليه وسلم أَنَسٌ خَادِمُكَ‏.‏ قَالَ ‏ \"‏ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6335,
			"arabicnumber": 6335,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يَقْرَأُ فِي الْمَسْجِدِ فَقَالَ ‏ \"‏ رَحِمَهُ اللَّهُ، لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً أَسْقَطْتُهَا فِي سُورَةِ كَذَا وَكَذَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6336,
			"arabicnumber": 6336,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي سُلَيْمَانُ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم قَسْمًا فَقَالَ رَجُلٌ إِنَّ هَذِهِ لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهُ اللَّهِ‏.‏ فَأَخْبَرْتُ النَّبِيَّ صلى الله عليه وسلم فَغَضِبَ حَتَّى رَأَيْتُ الْغَضَبَ فِي وَجْهِهِ وَقَالَ ‏ \"‏ يَرْحَمُ اللَّهُ مُوسَى، لَقَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6337,
			"arabicnumber": 6337,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ أَبُو حَبِيبٍ، حَدَّثَنَا هَارُونُ الْمُقْرِئُ، حَدَّثَنَا الزُّبَيْرُ بْنُ الْخِرِّيتِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدِّثِ النَّاسَ، كُلَّ جُمُعَةٍ مَرَّةً، فَإِنْ أَبَيْتَ فَمَرَّتَيْنِ، فَإِنَّ أَكْثَرْتَ فَثَلاَثَ مِرَارٍ وَلاَ تُمِلَّ النَّاسَ هَذَا الْقُرْآنَ، وَلاَ أُلْفِيَنَّكَ تَأْتِي الْقَوْمَ وَهُمْ فِي حَدِيثٍ مِنْ حَدِيثِهِمْ فَتَقُصُّ عَلَيْهِمْ، فَتَقْطَعُ عَلَيْهِمْ حَدِيثَهُمْ فَتُمِلُّهُمْ، وَلَكِنْ أَنْصِتْ، فَإِذَا أَمَرُوكَ فَحَدِّثْهُمْ وَهُمْ يَشْتَهُونَهُ، فَانْظُرِ السَّجْعَ مِنَ الدُّعَاءِ فَاجْتَنِبْهُ، فَإِنِّي عَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَصْحَابَهُ لاَ يَفْعَلُونَ إِلاَّ ذَلِكَ‏.‏ يَعْنِي لاَ يَفْعَلُونَ إِلاَّ ذَلِكَ الاِجْتِنَابَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6338,
			"arabicnumber": 6338,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمِ الْمَسْأَلَةَ، وَلاَ يَقُولَنَّ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي‏.‏ فَإِنَّهُ لاَ مُسْتَكْرِهَ لَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6339,
			"arabicnumber": 6339,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَقُولَنَّ أَحَدُكُمُ اللَّهُمَّ اغْفِرْ لِي، اللَّهُمَّ ارْحَمْنِي، إِنْ شِئْتَ‏.‏ لِيَعْزِمِ الْمَسْأَلَةَ، فَإِنَّهُ لاَ مُكْرِهَ لَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6340,
			"arabicnumber": 6340,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يُسْتَجَابُ لأَحَدِكُمْ مَا لَمْ يَعْجَلْ يَقُولُ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6341,
			"arabicnumber": 6341,
			"text": "قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ الأُوَيْسِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَشَرِيكٍ، سَمِعَا أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم رَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6342,
			"arabicnumber": 6342,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَسْقِيَنَا‏.‏ فَتَغَيَّمَتِ السَّمَاءُ وَمُطِرْنَا، حَتَّى مَا كَادَ الرَّجُلُ يَصِلُ إِلَى مَنْزِلِهِ، فَلَمْ تَزَلْ تُمْطَرُ إِلَى الْجُمُعَةِ الْمُقْبِلَةِ، فَقَامَ ذَلِكَ الرَّجُلُ أَوْ غَيْرُهُ فَقَالَ ادْعُ اللَّهَ أَنْ يَصْرِفَهُ عَنَّا، فَقَدْ غَرِقْنَا‏.‏ فَقَالَ ‏ \"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَجَعَلَ السَّحَابُ يَتَقَطَّعُ حَوْلَ الْمَدِينَةِ، وَلاَ يُمْطِرُ أَهْلَ الْمَدِينَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6343,
			"arabicnumber": 6343,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى هَذَا الْمُصَلَّى يَسْتَسْقِي، فَدَعَا وَاسْتَسْقَى ثُمَّ اسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ رِدَاءَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6344,
			"arabicnumber": 6344,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا حَرَمِيٌّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَتْ أُمِّي يَا رَسُولَ اللَّهِ خَادِمُكَ أَنَسٌ ادْعُ اللَّهَ لَهُ‏.‏ قَالَ ‏ \"‏ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6345,
			"arabicnumber": 6345,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو عِنْدَ الْكَرْبِ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَالأَرْضِ، رَبُّ الْعَرْشِ الْعَظِيمِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6346,
			"arabicnumber": 6346,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ عِنْدَ الْكَرْبِ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ، وَرَبُّ الْعَرْشِ الْكَرِيمِ ‏\"‏‏.‏ وَقَالَ وَهْبٌ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ مِثْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6347,
			"arabicnumber": 6347,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي سُمَىٌّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَعَوَّذُ مِنْ جَهْدِ الْبَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ‏.‏ قَالَ سُفْيَانُ الْحَدِيثُ ثَلاَثٌ زِدْتُ أَنَا وَاحِدَةً، لاَ أَدْرِي أَيَّتُهُنَّ هِيَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6348,
			"arabicnumber": 6348,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَعُرْوَةُ بْنُ الزُّبَيْرِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهْوَ صَحِيحٌ ‏\"‏ لَنْ يُقْبَضَ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُخَيَّرُ ‏\"‏‏.‏ فَلَمَّا نَزَلَ بِهِ وَرَأْسُهُ عَلَى فَخِذِي، غُشِيَ عَلَيْهِ سَاعَةً، ثُمَّ أَفَاقَ فَأَشْخَصَ بَصَرَهُ إِلَى السَّقْفِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏ قُلْتُ إِذًا لاَ يَخْتَارُنَا، وَعَلِمْتُ أَنَّهُ الْحَدِيثُ الَّذِي كَانَ يُحَدِّثُنَا، وَهْوَ صَحِيحٌ‏.‏ قَالَتْ فَكَانَتْ تِلْكَ آخِرَ كَلِمَةٍ تَكَلَّمَ بِهَا ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6349,
			"arabicnumber": 6349,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ أَتَيْتُ خَبَّابًا وَقَدِ اكْتَوَى سَبْعًا قَالَ لَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6350,
			"arabicnumber": 6350,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، قَالَ أَتَيْتُ خَبَّابًا وَقَدِ اكْتَوَى سَبْعًا فِي بَطْنِهِ فَسَمِعْتُهُ يَقُولُ لَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6351,
			"arabicnumber": 6351,
			"text": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَتَمَنَّيَنَّ أَحَدٌ مِنْكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ، فَإِنْ كَانَ لاَ بُدَّ مُتَمَنِّيًا لِلْمَوْتِ فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6352,
			"arabicnumber": 6352,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنِ الْجَعْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ‏.‏ فَمَسَحَ رَأْسِي، وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ، ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ، فَنَظَرْتُ إِلَى خَاتَمِهِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6353,
			"arabicnumber": 6353,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ أَبِي عَقِيلٍ، أَنَّهُ كَانَ يَخْرُجُ بِهِ جَدُّهُ عَبْدُ اللَّهِ بْنُ هِشَامٍ مِنَ السُّوقِ أَوْ إِلَى السُّوقِ فَيَشْتَرِي الطَّعَامَ، فَيَلْقَاهُ ابْنُ الزُّبَيْرِ وَابْنُ عُمَرَ فَيَقُولاَنِ أَشْرِكْنَا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ دَعَا لَكَ بِالْبَرَكَةِ‏.‏ فَرُبَّمَا أَصَابَ الرَّاحِلَةَ كَمَا هِيَ، فَيَبْعَثُ بِهَا إِلَى الْمَنْزِلِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6354,
			"arabicnumber": 6354,
			"text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، وَهُوَ الَّذِي مَجَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي وَجْهِهِ وَهْوَ غُلاَمٌ مِنْ بِئْرِهِمْ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6355,
			"arabicnumber": 6355,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُؤْتَى بِالصِّبْيَانِ فَيَدْعُو لَهُمْ، فَأُتِيَ بِصَبِيٍّ فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَأَتْبَعَهُ إِيَّاهُ، وَلَمْ يَغْسِلْهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6356,
			"arabicnumber": 6356,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهُ بْنُ ثَعْلَبَةَ بْنِ صُعَيْرٍ ـ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ مَسَحَ عَنْهُ ـ أَنَّهُ رَأَى سَعْدَ بْنَ أَبِي وَقَّاصٍ يُوتِرُ بِرَكْعَةٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6357,
			"arabicnumber": 6357,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الْحَكَمُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، قَالَ لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ فَقَالَ أَلاَ أُهْدِي لَكَ هَدِيَّةً، إِنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ عَلَيْنَا فَقُلْنَا يَا رَسُولَ اللَّهِ قَدْ عَلِمْنَا كَيْفَ نُسَلِّمُ عَلَيْكَ، فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏ \"‏ فَقُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6358,
			"arabicnumber": 6358,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ هَذَا السَّلاَمُ عَلَيْكَ، فَكَيْفَ نُصَلِّي قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6359,
			"arabicnumber": 6359,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ ابْنِ أَبِي أَوْفَى، قَالَ كَانَ إِذَا أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم بِصَدَقَتِهِ قَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَيْهِ‏\"‏ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ ‏\"‏ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى‏\"‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6360,
			"arabicnumber": 6360,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، قَالَ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6361,
			"arabicnumber": 6361,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6362,
			"arabicnumber": 6362,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى أَحْفَوْهُ الْمَسْأَلَةَ فَغَضِبَ فَصَعِدَ الْمِنْبَرَ فَقَالَ ‏\"‏ لاَ تَسْأَلُونِي الْيَوْمَ عَنْ شَىْءٍ إِلاَّ بَيَّنْتُهُ لَكُمْ ‏\"‏‏.‏ فَجَعَلْتُ أَنْظُرُ يَمِينًا وَشِمَالاً، فَإِذَا كُلُّ رَجُلٍ لاَفٌّ رَأْسَهُ فِي ثَوْبِهِ يَبْكِي، فَإِذَا رَجُلٌ كَانَ إِذَا لاَحَى الرِّجَالَ يُدْعَى لِغَيْرِ أَبِيهِ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ أَبِي قَالَ ‏\"‏ حُذَافَةُ ‏\"‏، ثُمَّ أَنْشَأَ عُمَرُ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً، نَعُوذُ بِاللَّهِ مِنَ الْفِتَنِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا رَأَيْتُ فِي الْخَيْرِ وَالشَّرِّ كَالْيَوْمِ قَطُّ، إِنَّهُ صُوِّرَتْ لِي الْجَنَّةُ وَالنَّارُ حَتَّى رَأَيْتُهُمَا وَرَاءَ الْحَائِطِ ‏\"‏‏.‏ وَكَانَ قَتَادَةُ يَذْكُرُ عِنْدَ الْحَدِيثِ هَذِهِ الآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6363,
			"arabicnumber": 6363,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ لَنَا غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ فَلَمْ أَزَلْ أَخْدُمُهُ حَتَّى أَقْبَلْنَا مِنْ خَيْبَرَ، وَأَقْبَلَ بِصَفِيَّةَ بِنْتِ حُيَىٍّ قَدْ حَازَهَا، فَكُنْتُ أَرَاهُ يُحَوِّي وَرَاءَهُ بِعَبَاءَةٍ أَوْ كِسَاءٍ ثُمَّ يُرْدِفُهَا وَرَاءَهُ حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ صَنَعَ حَيْسًا فِي نِطَعٍ، ثُمَّ أَرْسَلَنِي فَدَعَوْتُ رِجَالاً فَأَكَلُوا، وَكَانَ ذَلِكَ بِنَاءَهُ بِهَا، ثُمَّ أَقْبَلَ حَتَّى بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جُبَيْلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6364,
			"arabicnumber": 6364,
			"text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ سَمِعْتُ أُمَّ خَالِدٍ بِنْتَ خَالِدٍ ـ قَالَ وَلَمْ أَسْمَعْ أَحَدًا سَمِعَ مِنَ النَّبِيِّ، صلى الله عليه وسلم غَيْرَهَا ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6365,
			"arabicnumber": 6365,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ مُصْعَبٍ، كَانَ سَعْدٌ يَأْمُرُ بِخَمْسٍ وَيَذْكُرُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَأْمُرُ بِهِنَّ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا يَعْنِي فِتْنَةَ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6366,
			"arabicnumber": 6366,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَتْ عَلَىَّ عَجُوزَانِ مِنْ عُجُزِ يَهُودِ الْمَدِينَةِ فَقَالَتَا لِي إِنَّ أَهْلَ الْقُبُورِ يُعَذَّبُونَ فِي قُبُورِهِمْ، فَكَذَّبْتُهُمَا، وَلَمْ أُنْعِمْ أَنْ أُصَدِّقَهُمَا، فَخَرَجَتَا وَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنَّ عَجُوزَيْنِ وَذَكَرْتُ لَهُ، فَقَالَ ‏ \"‏ صَدَقَتَا، إِنَّهُمْ يُعَذَّبُونَ عَذَابًا تَسْمَعُهُ الْبَهَائِمُ كُلُّهَا ‏\"‏‏.‏ فَمَا رَأَيْتُهُ بَعْدُ فِي صَلاَةٍ إِلاَّ تَعَوَّذَ مِنْ عَذَابِ الْقَبْرِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6367,
			"arabicnumber": 6367,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْهَرَمِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6368,
			"arabicnumber": 6368,
			"text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6369,
			"arabicnumber": 6369,
			"text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، قَالَ سَمِعْتُ أَنَسًا، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6370,
			"arabicnumber": 6370,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ـ رضى الله عنه ـ كَانَ يَأْمُرُ بِهَؤُلاَءِ الْخَمْسِ، وَيُحَدِّثُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6371,
			"arabicnumber": 6371,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَعَوَّذُ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْهَرَمِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6372,
			"arabicnumber": 6372,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ، كَمَا حَبَّبْتَ إِلَيْنَا مَكَّةَ أَوْ أَشَدَّ، وَانْقُلْ حُمَّاهَا إِلَى الْجُحْفَةِ، اللَّهُمَّ بَارِكْ لَنَا فِي مُدِّنَا وَصَاعِنَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6373,
			"arabicnumber": 6373,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أَبَاهُ، قَالَ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ مِنْ شَكْوَى، أَشْفَيْتُ مِنْهَا عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ بَلَغَ بِي مَا تَرَى مِنَ الْوَجَعِ، وَأَنَا ذُو مَالٍ، وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَبِشَطْرِهِ قَالَ ‏\"‏ الثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ، خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ، إِلاَّ أُجِرْتَ، حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتُ أَأُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ دَرَجَةً وَرِفْعَةً وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ ‏\"‏‏.‏ قَالَ سَعْدٌ رَثَى لَهُ النَّبِيُّ صلى الله عليه وسلم مِنْ أَنْ تُوُفِّيَ بِمَكَّةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6374,
			"arabicnumber": 6374,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْحُسَيْنُ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ مُصْعَبٍ، عَنْ أَبِيهِ، قَالَ تَعَوَّذُوا بِكَلِمَاتٍ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَعَوَّذُ بِهِنَّ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَعَذَابِ الْقَبْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6375,
			"arabicnumber": 6375,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَغْرَمِ وَالْمَأْثَمِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَفِتْنَةِ النَّارِ وَعَذَابِ الْقَبْرِ، وَشَرِّ فِتْنَةِ الْغِنَى، وَشَرِّ فِتْنَةِ الْفَقْرِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6376,
			"arabicnumber": 6376,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ خَالَتِهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَعَوَّذُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَمِنْ عَذَابِ النَّارِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6377,
			"arabicnumber": 6377,
			"text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَفِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَشَرِّ فِتْنَةِ الْغِنَى، وَشَرِّ فِتْنَةِ الْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6379,
			"arabicnumber": 6379,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6381,
			"arabicnumber": 6381,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6382,
			"arabicnumber": 6382,
			"text": "حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ أَبُو مُصْعَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا الاِسْتِخَارَةَ فِي الأُمُورِ كُلِّهَا كَالسُّورَةِ مِنَ الْقُرْآنِ ‏ \"‏ إِذَا هَمَّ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ، ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاقْدُرْهُ لِي، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ رَضِّنِي بِهِ‏.‏ وَيُسَمِّي حَاجَتَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6383,
			"arabicnumber": 6383,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم بِمَاءٍ فَتَوَضَّأَ، ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ ‏\"‏‏.‏ وَرَأَيْتُ بَيَاضَ إِبْطَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6384,
			"arabicnumber": 6384,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَكُنَّا إِذَا عَلَوْنَا كَبَّرْنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ، فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا، وَلَكِنْ تَدْعُونَ سَمِيعًا بَصِيرًا ‏\"‏‏.‏ ثُمَّ أَتَى عَلَىَّ وَأَنَا أَقُولُ فِي نَفْسِي لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ‏.‏ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ فَإِنَّهَا‏.‏ كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ هِيَ كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6385,
			"arabicnumber": 6385,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ، عَابِدُونَ لِرَبِّنَا، حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6386,
			"arabicnumber": 6386,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَى النَّبِيُّ صلى الله عليه وسلم عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ ‏\"‏ مَهْيَمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مَهْ ‏\"‏‏.‏ قَالَ تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ فَقَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6387,
			"arabicnumber": 6387,
			"text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ هَلَكَ أَبِي وَتَرَكَ سَبْعَ ـ أَوْ تِسْعَ ـ بَنَاتٍ، فَتَزَوَّجْتُ امْرَأَةً فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ يَا جَابِرُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبًا‏.‏ قَالَ ‏\"‏ هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ، أَوْ تُضَاحِكُهَا وَتُضَاحِكُكَ ‏\"‏‏.‏ قُلْتُ هَلَكَ أَبِي فَتَرَكَ سَبْعَ ـ أَوْ تِسْعَ ـ بَنَاتٍ، فَكَرِهْتُ أَنْ أَجِيئَهُنَّ بِمِثْلِهِنَّ، فَتَزَوَّجْتُ امْرَأَةً تَقُومُ عَلَيْهِنَّ‏.‏ قَالَ ‏\"‏ فَبَارَكَ اللَّهُ عَلَيْكَ ‏\"‏‏.‏ لَمْ يَقُلِ ابْنُ عُيَيْنَةَ وَمُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرٍو ‏\"‏ بَارَكَ اللَّهُ عَلَيْكَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6388,
			"arabicnumber": 6388,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا، فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ، لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6389,
			"arabicnumber": 6389,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ كَانَ أَكْثَرُ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6390,
			"arabicnumber": 6390,
			"text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا هَؤُلاَءِ الْكَلِمَاتِ كَمَا تُعَلَّمُ الْكِتَابَةُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ نُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَعَذَابِ الْقَبْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6391,
			"arabicnumber": 6391,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُنْذِرٍ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طُبَّ حَتَّى إِنَّهُ لَيُخَيَّلُ إِلَيْهِ قَدْ صَنَعَ الشَّىْءَ وَمَا صَنَعَهُ، وَإِنَّهُ دَعَا رَبَّهُ ثُمَّ قَالَ ‏\"‏ أَشَعَرْتِ أَنَّ اللَّهَ قَدْ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ فَمَا ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ جَاءَنِي رَجُلاَنِ فَجَلَسَ أَحَدُهُمَا عِنْدَ رَأْسِي، وَالآخَرُ عِنْدَ رِجْلَىَّ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ‏.‏ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ‏.‏ قَالَ فِيمَا ذَا قَالَ فِي مُشْطٍ وَمُشَاطَةٍ وَجُفِّ طَلْعَةٍ‏.‏ قَالَ فَأَيْنَ هُوَ قَالَ فِي ذَرْوَانَ، وَذَرْوَانُ بِئْرٌ فِي بَنِي زُرَيْقٍ ‏\"‏‏.‏ قَالَتْ فَأَتَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ رَجَعَ إِلَى عَائِشَةَ فَقَالَ ‏\"‏ وَاللَّهِ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ، وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏‏.‏ قَالَتْ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهَا عَنِ الْبِئْرِ، فَقُلْتُ يَا رَسُولَ اللَّهِ فَهَلاَّ أَخْرَجْتَهُ قَالَ ‏\"‏ أَمَّا أَنَا فَقَدْ شَفَانِي اللَّهُ، وَكَرِهْتُ أَنْ أُثِيرَ عَلَى النَّاسِ شَرًّا ‏\"‏‏.‏ زَادَ عِيسَى بْنُ يُونُسَ وَاللَّيْثُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سُحِرَ النَّبِيُّ صلى الله عليه وسلم فَدَعَا وَدَعَا وَسَاقَ الْحَدِيثَ",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6392,
			"arabicnumber": 6392,
			"text": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي خَالِدٍ، قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ قَالَ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الأَحْزَابِ فَقَالَ ‏ \"‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اهْزِمْهُمْ وَزَلْزِلْهُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6393,
			"arabicnumber": 6393,
			"text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ فِي الرَّكْعَةِ الآخِرَةِ مِنْ صَلاَةِ الْعِشَاءِ قَنَتَ ‏\"‏ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6394,
			"arabicnumber": 6394,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَاصِمٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً يُقَالُ لَهُمُ الْقُرَّاءُ فَأُصِيبُوا، فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَجَدَ عَلَى شَىْءٍ مَا وَجَدَ عَلَيْهِمْ، فَقَنَتَ شَهْرًا فِي صَلاَةِ الْفَجْرِ وَيَقُولُ ‏ \"‏ إِنَّ عُصَيَّةَ عَصَوُا اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6395,
			"arabicnumber": 6395,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ الْيَهُودُ يُسَلِّمُونَ عَلَى النَّبِيِّ صلى الله عليه وسلم يَقُولُونَ السَّامُ عَلَيْكَ‏.‏ فَفَطِنَتْ عَائِشَةُ إِلَى قَوْلِهِمْ فَقَالَتْ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْلاً يَا عَائِشَةُ، إِنَّ اللَّهَ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏‏.‏ فَقَالَتْ يَا نَبِيَّ اللَّهِ أَوَلَمْ تَسْمَعْ مَا يَقُولُونَ قَالَ ‏\"‏ أَوَلَمْ تَسْمَعِي أَنِّي أَرُدُّ ذَلِكَ عَلَيْهِمْ فَأَقُولُ وَعَلَيْكُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6396,
			"arabicnumber": 6396,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، حَدَّثَنَا عَبِيدَةُ، حَدَّثَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ، فَقَالَ ‏ \"‏ مَلأَ اللَّهُ قُبُورَهُمْ وَبُيُوتَهُمْ نَارًا، كَمَا شَغَلُونَا عَنْ صَلاَةِ الْوُسْطَى حَتَّى غَابَتِ الشَّمْسُ ‏\"‏‏.‏ وَهْىَ صَلاَةُ الْعَصْرِ‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6397,
			"arabicnumber": 6397,
			"text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَدِمَ الطُّفَيْلُ بْنُ عَمْرٍو عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ دَوْسًا قَدْ عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهَا‏.‏ فَظَنَّ النَّاسُ أَنَّهُ يَدْعُو عَلَيْهِمْ، فَقَالَ ‏ \"‏ اللَّهُمَّ اهْدِ دَوْسًا وَأْتِ بِهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6398,
			"arabicnumber": 6398,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْمَلِكَ بْنُ صَبَّاحٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ ابْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَدْعُو بِهَذَا الدُّعَاءِ ‏ \"‏ رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي خَطَايَاىَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏‏.‏ وَقَالَ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَحَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏ بِنَحْوِهِ.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6399,
			"arabicnumber": 6399,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا إِسْرَائِيلُ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، وَأَبِي، بُرْدَةَ ـ أَحْسِبُهُ ـ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَدْعُو ‏ \"‏ اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي وَخَطَاىَ وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6400,
			"arabicnumber": 6400,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ فِي الْجُمُعَةِ سَاعَةٌ لاَ يُوَافِقُهَا مُسْلِمٌ وَهْوَ قَائِمٌ يُصَلِّي يَسْأَلُ خَيْرًا إِلاَّ أَعْطَاهُ ‏\"‏‏.‏ وَقَالَ بِيَدِهِ قُلْنَا يُقَلِّلُهَا يُزَهِّدُهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6401,
			"arabicnumber": 6401,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ الْيَهُودَ، أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ قَالَ ‏\"‏ وَعَلَيْكُمْ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ السَّامُ عَلَيْكُمْ، وَلَعَنَكُمُ اللَّهُ وَغَضِبَ عَلَيْكُمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَهْلاً يَا عَائِشَةُ، عَلَيْكِ بِالرِّفْقِ، وَإِيَّاكِ وَالْعُنْفَ أَوِ الْفُحْشَ ‏\"‏‏.‏ قَالَتْ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ أَوَلَمْ تَسْمَعِي مَا قُلْتُ رَدَدْتُ عَلَيْهِمْ، فَيُسْتَجَابُ لِي فِيهِمْ، وَلاَ يُسْتَجَابُ لَهُمْ فِيَّ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6402,
			"arabicnumber": 6402,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَاهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَمَّنَ الْقَارِئُ فَأَمِّنُوا، فَإِنَّ الْمَلاَئِكَةَ تُؤَمِّنُ، فَمَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6403,
			"arabicnumber": 6403,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ‏.‏ فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ، حَتَّى يُمْسِيَ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6404,
			"arabicnumber": 6404,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ مَنْ قَالَ عَشْرًا كَانَ كَمَنْ أَعْتَقَ رَقَبَةً مِنْ وَلَدِ إِسْمَاعِيلَ‏.‏ قَالَ عُمَرُ بْنُ أَبِي زَائِدَةَ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنِ الشَّعْبِيِّ عَنْ رَبِيعِ بْنِ خُثَيْمٍ مِثْلَهُ‏.‏ فَقُلْتُ لِلرَّبِيعِ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنْ عَمْرِو بْنِ مَيْمُونٍ‏.‏ فَأَتَيْتُ عَمْرَو بْنَ مَيْمُونٍ فَقُلْتُ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنِ ابْنِ أَبِي لَيْلَى‏.‏ فَأَتَيْتُ ابْنَ أَبِي لَيْلَى فَقُلْتُ مِمَّنْ سَمِعْتَهُ فَقَالَ مِنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ يُحَدِّثُهُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي أَيُّوبَ قَوْلَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ مُوسَى حَدَّثَنَا وُهَيْبٌ، عَنْ دَاوُدَ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ إِسْمَاعِيلُ عَنِ الشَّعْبِيِّ عَنِ الرَّبِيعِ قَوْلَهُ‏.‏ وَقَالَ آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ سَمِعْتُ هِلاَلَ بْنَ يَسَافٍ عَنِ الرَّبِيعِ بْنِ خُثَيْمٍ وَعَمْرِو بْنِ مَيْمُونٍ عَنِ ابْنِ مَسْعُودٍ قَوْلَهُ‏.‏ وَقَالَ الأَعْمَشُ وَحُصَيْنٌ عَنْ هِلاَلٍ عَنِ الرَّبِيعِ عَنْ عَبْدِ اللَّهِ قَوْلَهُ‏.‏ وَرَوَاهُ أَبُو مُحَمَّدٍ الْحَضْرَمِيُّ عَنْ أَبِي أَيُّوبَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏ كَانَ كَمَنْ أَعْتَقَ رَقَبَةً مِنْ وَلَدِ إِسْمَاعِيلِ قَالَ أَبُو عَبْد اللَّهِ وَالصَّحِيحُ قَوْلُ عَبْدِ الْمَلِكِ بْنِ عَمْرٍو.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6405,
			"arabicnumber": 6405,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ‏.‏ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ، وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6406,
			"arabicnumber": 6406,
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ، سُبْحَانَ اللَّهِ الْعَظِيمِ، سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6407,
			"arabicnumber": 6407,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِي لاَ يَذْكُرُ مَثَلُ الْحَىِّ وَالْمَيِّتِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِلَّهِ مَلاَئِكَةً يَطُوفُونَ فِي الطُّرُقِ، يَلْتَمِسُونَ أَهْلَ الذِّكْرِ، فَإِذَا وَجَدُوا قَوْمًا يَذْكُرُونَ اللَّهَ تَنَادَوْا هَلُمُّوا إِلَى حَاجَتِكُمْ‏.‏ قَالَ فَيَحُفُّونَهُمْ بِأَجْنِحَتِهِمْ إِلَى السَّمَاءِ الدُّنْيَا‏.‏ قَالَ فَيَسْأَلُهُمْ رَبُّهُمْ وَهْوَ أَعْلَمُ مِنْهُمْ مَا يَقُولُ عِبَادِي قَالُوا يَقُولُونَ يُسَبِّحُونَكَ، وَيُكَبِّرُونَكَ، وَيَحْمَدُونَكَ وَيُمَجِّدُونَكَ‏.‏ قَالَ فَيَقُولُ هَلْ رَأَوْنِي قَالَ فَيَقُولُونَ لاَ وَاللَّهِ مَا رَأَوْكَ‏.‏ قَالَ فَيَقُولُ وَكَيْفَ لَوْ رَأَوْنِي قَالَ يَقُولُونَ لَوْ رَأَوْكَ كَانُوا أَشَدَّ لَكَ عِبَادَةً، وَأَشَدَّ لَكَ تَمْجِيدًا، وَأَكْثَرَ لَكَ تَسْبِيحًا‏.‏ قَالَ يَقُولُ فَمَا يَسْأَلُونِي قَالَ يَسْأَلُونَكَ الْجَنَّةَ‏.‏ قَالَ يَقُولُ وَهَلْ رَأَوْهَا قَالَ يَقُولُونَ لاَ وَاللَّهِ يَا رَبِّ مَا رَأَوْهَا‏.‏ قَالَ يَقُولُ فَكَيْفَ لَوْ أَنَّهُمْ رَأَوْهَا قَالَ يَقُولُونَ لَوْ أَنَّهُمْ رَأَوْهَا كَانُوا أَشَدَّ عَلَيْهَا حِرْصًا، وَأَشَدَّ لَهَا طَلَبًا، وَأَعْظَمَ فِيهَا رَغْبَةً‏.‏ قَالَ فَمِمَّ يَتَعَوَّذُونَ قَالَ يَقُولُونَ مِنَ النَّارِ‏.‏ قَالَ يَقُولُ وَهَلْ رَأَوْهَا قَالَ يَقُولُونَ لاَ وَاللَّهِ مَا رَأَوْهَا‏.‏ قَالَ يَقُولُ فَكَيْفَ لَوْ رَأَوْهَا قَالَ يَقُولُونَ لَوْ رَأَوْهَا كَانُوا أَشَدَّ مِنْهَا فِرَارًا، وَأَشَدَّ لَهَا مَخَافَةً‏.‏ قَالَ فَيَقُولُ فَأُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لَهُمْ‏.‏ قَالَ يَقُولُ مَلَكٌ مِنَ الْمَلاَئِكَةِ فِيهِمْ فُلاَنٌ لَيْسَ مِنْهُمْ إِنَّمَا جَاءَ لِحَاجَةٍ‏.‏ قَالَ هُمُ الْجُلَسَاءُ لاَ يَشْقَى بِهِمْ جَلِيسُهُمْ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنِ الأَعْمَشِ وَلَمْ يَرْفَعْهُ‏.‏ وَرَوَاهُ سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6409,
			"arabicnumber": 6409,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ أَخَذَ النَّبِيُّ صلى الله عليه وسلم فِي عَقَبَةٍ ـ أَوْ قَالَ فِي ثَنِيَّةٍ، قَالَ ـ فَلَمَّا عَلاَ عَلَيْهَا رَجُلٌ نَادَى فَرَفَعَ صَوْتَهُ لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ‏.‏ قَالَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى بَغْلَتِهِ قَالَ ‏\"‏ فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ يَا أَبَا مُوسَى ـ أَوْ يَا عَبْدَ اللَّهِ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كَنْزِ الْجَنَّةِ ‏\"‏‏.‏ قُلْتُ بَلَى‏.‏ قَالَ ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6410,
			"arabicnumber": 6410,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ أَبِي الزِّنَادِ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً قَالَ ‏ \"‏ لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا، مِائَةٌ إِلاَّ وَاحِدًا، لاَ يَحْفَظُهَا أَحَدٌ إِلاَّ دَخَلَ الْجَنَّةَ، وَهْوَ وَتْرٌ يُحِبُّ الْوَتْرَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6411,
			"arabicnumber": 6411,
			"text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ كُنَّا نَنْتَظِرُ عَبْدَ اللَّهِ إِذْ جَاءَ يَزِيدُ بْنُ مُعَاوِيَةَ فَقُلْنَا أَلاَ تَجْلِسُ قَالَ لاَ وَلَكِنْ أَدْخُلُ فَأُخْرِجُ إِلَيْكُمْ صَاحِبَكُمْ، وَإِلاَّ جِئْتُ أَنَا‏.‏ فَجَلَسْتُ فَخَرَجَ عَبْدُ اللَّهِ وَهْوَ آخِذٌ بِيَدِهِ فَقَامَ عَلَيْنَا فَقَالَ أَمَا إِنِّي أَخْبَرُ بِمَكَانِكُمْ، وَلَكِنَّهُ يَمْنَعُنِي مِنَ الْخُرُوجِ إِلَيْكُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ، كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا‏.‏",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 106
			}
		}
	]
}