{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": 6723,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ فَعَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَأَتَانِي وَقَدْ أُغْمِيَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَبَّ عَلَىَّ وَضُوءَهُ فَأَفَقْتُ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي، كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمَوَارِيثِ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": 6724,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": 6726,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": 6727,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": 6728,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ،، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي مِنْ حَدِيثِهِ ذَلِكَ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَيْهِ فَسَأَلْتُهُ فَقَالَ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ فَأَتَاهُ حَاجِبُهُ يَرْفَأُ فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ، ثُمَّ قَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ قَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ فَقَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ قَدْ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْفَىْءِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، فَقَالَ عَزَّ وَجَلَّ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏ فَكَانَتْ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ، وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهُ وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ النَّبِيُّ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ مِنْ هَذَا الْمَالِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ فَتَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا فَعَمِلَ بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ وَلِيِّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا مَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ، وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَانِي هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، فَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا فَادْفَعَاهَا إِلَىَّ، فَأَنَا أَكْفِيكُمَاهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": 6729,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَقْتَسِمُ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": 6730,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ أَزْوَاجَ، النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ إِلَى أَبِي بَكْرٍ يَسْأَلْنَهُ مِيرَاثَهُنَّ‏.‏ فَقَالَتْ عَائِشَةُ أَلَيْسَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": 6731,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنَا أَوْلَى، بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ، وَلَمْ يَتْرُكْ وَفَاءً، فَعَلَيْنَا قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": 6732,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": 6733,
			"text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ مَرِضْتُ بِمَكَّةَ مَرَضًا، فَأَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً كَثِيرًا، وَلَيْسَ يَرِثُنِي إِلاَّ ابْنَتِي، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَبِيرٌ إِنَّكَ إِنْ تَرَكْتَ وَلَدَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً إِلاَّ أُجِرْتَ عَلَيْهَا، حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ عَنْ هِجْرَتِي فَقَالَ ‏\"‏ لَنْ تُخَلَّفَ بَعْدِي فَتَعْمَلَ عَمَلاً تُرِيدُ بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ بِهِ رِفْعَةً وَدَرَجَةً، وَلَعَلَّ أَنْ تُخَلَّفَ بَعْدِي حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَسَعْدُ بْنُ خَوْلَةَ رَجُلٌ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": 6734,
			"text": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، شَيْبَانُ عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ أَتَانَا مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ مُعَلِّمًا وَأَمِيرًا، فَسَأَلْنَاهُ عَنْ رَجُلٍ، تُوُفِّيَ وَتَرَكَ ابْنَتَهُ وَأُخْتَهُ، فَأَعْطَى الاِبْنَةَ النِّصْفَ وَالأُخْتَ النِّصْفَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": 6735,
			"text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": 6736,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو قَيْسٍ، سَمِعْتُ هُزَيْلَ بْنَ شُرَحْبِيلَ، قَالَ سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَابْنَةِ ابْنٍ وَأُخْتٍ، فَقَالَ لِلاِبْنَةِ النِّصْفُ وَلِلأُخْتِ النِّصْفُ، وَأْتِ ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي‏.‏ فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بِقَوْلِ أَبِي مُوسَى، فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ،، أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ ابْنٍ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ، وَمَا بَقِيَ فَلِلأُخْتِ ‏\"‏‏.‏ فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ، فَقَالَ لاَ تَسْأَلُونِي مَا دَامَ هَذَا الْحَبْرُ فِيكُمْ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": 6737,
			"text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": 6738,
			"text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ، وَلَكِنْ خُلَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ خَيْرٌ ‏\"‏‏.‏ فَإِنَّهُ أَنْزَلَهُ أَبًا‏.‏ أَوْ قَالَ قَضَاهُ أَبًا‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": 6739,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": 6740,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لَحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا، وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": 6741,
			"text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ قَضَى فِينَا مُعَاذُ بْنُ جَبَلٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم النِّصْفُ لِلاِبْنَةِ وَالنِّصْفُ لِلأُخْتِ‏.‏ ثُمَّ قَالَ سُلَيْمَانُ قَضَى فِينَا‏.‏ وَلَمْ يَذْكُرْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": 6742,
			"text": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، قَالَ قَالَ عَبْدُ اللَّهِ لأَقْضِيَنَّ فِيهَا بِقَضَاءِ النَّبِيِّ صلى الله عليه وسلم لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ الاِبْنِ السُّدُسُ، وَمَا بَقِيَ فَلِلأُخْتِ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": 6743,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ، فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ، ثُمَّ نَضَحَ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا لِي أَخَوَاتٌ‏.‏ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": 6744,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ آخِرُ آيَةٍ نَزَلَتْ خَاتِمَةُ سُورَةِ النِّسَاءِ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": 6745,
			"text": "حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَتَرَكَ مَالاً فَمَالُهُ لِمَوَالِي الْعَصَبَةِ، وَمَنْ تَرَكَ كَلاًّ أَوْ ضَيَاعًا، فَأَنَا وَلِيُّهُ فَلأُدْعَى لَهُ ‏\"‏‏.‏ لكل: العيال",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": 6746,
			"text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحٍ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": 6747,
			"text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ إِدْرِيسُ، حَدَّثَنَا طَلْحَةُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَرِثُ الأَنْصَارِيُّ الْمُهَاجِرِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ فَلَمَّا نَزَلَتْ ‏{‏جَعَلْنَا مَوَالِيَ‏}‏ قَالَ نَسَخَتْهَا ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": 6748,
			"text": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم وَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": 6749,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": 6750,
			"text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْوَلَدُ لِصَاحِبِ الْفِرَاشِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": 6751,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُهْدِيَ لَهَا شَاةٌ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏ قَالَ الْحَكَمُ وَكَانَ زَوْجُهَا حُرًّا، وَقَوْلُ الْحَكَمِ مُرْسَلٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": 6752,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": 6753,
			"text": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّ أَهْلَ الإِسْلاَمِ لا يُسَيِّبُونَ، وَإِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُسَيِّبُونَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": 6754,
			"text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ اشْتَرَتْ بَرِيرَةَ، لِتُعْتِقَهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي اشْتَرَيْتُ بَرِيرَةَ لأُعْتِقَهَا، وَإِنَّ أَهْلَهَا يَشْتَرِطُونَ وَلاَءَهَا‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَعْطَى الثَّمَنَ ‏\"‏‏.‏ قَالَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا‏.‏ قَالَ وَخُيِّرَتْ فَاخْتَارَتْ نَفْسَهَا وَقَالَتْ لَوْ أُعْطِيتُ كَذَا وَكَذَا مَا كُنْتُ مَعَهُ‏.‏ قَالَ الأَسْوَدُ وَكَانَ زَوْجُهَا حُرًّا‏.‏ قَوْلُ الأَسْوَدِ مُنْقَطِعٌ، وَقَوْلُ ابْنِ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏ أَصَحُّ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": 6755,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه مَا عِنْدَنَا كِتَابٌ نَقْرَؤُهُ إِلاَّ كِتَابُ اللَّهِ، غَيْرَ هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ فَأَخْرَجَهَا فَإِذَا فِيهَا أَشْيَاءُ مِنَ الْجِرَاحَاتِ وَأَسْنَانِ الإِبِلِ‏.‏ قَالَ وَفِيهَا الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": 6756,
			"text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": 6757,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ فَذَكَرَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": 6758,
			"text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏‏.‏ قَالَتْ فَأَعْتَقْتُهَا ـ قَالَتْ ـ فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَقَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا بِتُّ عِنْدَهُ‏.‏ فَاخْتَارَتْ نَفْسَهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": 6759,
			"text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ بَرِيرَةَ فَقَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّهُمْ يَشْتَرِطُونَ الْوَلاَءَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اشْتَرِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": 6760,
			"text": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْوَلاَءُ لِمَنْ أَعْطَى الْوَرِقَ، وَوَلِيَ النِّعْمَةَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": 6761,
			"text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ، وَقَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": 6762,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": 6763,
			"text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ، وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": 6764,
			"text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلاَ الْكَافِرُ الْمُسْلِمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": 6765,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِي يَا رَسُولَ اللَّهِ، وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ ‏ \"‏ هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ قَالَتْ فَلَمْ يَرَ سَوْدَةَ قَطُّ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": 6767,
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": 6768,
			"text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": 6769,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا، جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ فَقَضَى بِهِ لِلْكُبْرَى، فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ ـ عَلَيْهِمَا السَّلاَمُ ـ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ‏.‏ هُوَ ابْنُهَا‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ، وَمَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": 6770,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ ‏ \"‏ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": 6771,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَهْوَ مَسْرُورٌ فَقَالَ ‏ \"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ فَرَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ، قَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 47
			}
		}
	]
}