{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6982,
			"arabicnumber": 6982,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْوَحْىِ الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلاَّ جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، فَكَانَ يَأْتِي حِرَاءً فَيَتَحَنَّثُ فِيهِ ـ وَهْوَ التَّعَبُّدُ ـ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ، وَيَتَزَوَّدُ لِذَلِكَ ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَتُزَوِّدُهُ لِمِثْلِهَا، حَتَّى فَجِئَهُ الْحَقُّ وَهْوَ فِي غَارِ حِرَاءٍ فَجَاءَهُ الْمَلَكُ فِيهِ فَقَالَ اقْرَأْ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجَهْدَ ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَغَطَّنِي الثَّالِثَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ‏\"‏‏.‏ حَتَّى بَلَغَ ‏{‏مَا لَمْ يَعْلَمْ‏}‏ فَرَجَعَ بِهَا تَرْجُفُ بَوَادِرُهُ حَتَّى دَخَلَ عَلَى خَدِيجَةَ فَقَالَ ‏\"‏ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ فَقَالَ ‏\"‏ يَا خَدِيجَةُ مَا لِي ‏\"‏‏.‏ وَأَخْبَرَهَا الْخَبَرَ وَقَالَ ‏\"‏ قَدْ خَشِيتُ عَلَى نَفْسِي ‏\"‏‏.‏ فَقَالَتْ لَهُ كَلاَّ أَبْشِرْ، فَوَاللَّهِ لاَ يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ ثُمَّ انْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى بْنِ قُصَىٍّ ـ وَهْوَ ابْنُ عَمِّ خَدِيجَةَ أَخُو أَبِيهَا، وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعَرَبِيَّ فَيَكْتُبُ بِالْعَرَبِيَّةِ مِنَ الإِنْجِيلِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ ـ فَقَالَتْ لَهُ خَدِيجَةُ أَىِ ابْنَ عَمِّ اسْمَعْ مِنِ ابْنِ أَخِيكَ‏.‏ فَقَالَ وَرَقَةُ ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ النَّبِيُّ صلى الله عليه وسلم مَا رَأَى فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أُنْزِلَ عَلَى مُوسَى، يَا لَيْتَنِي فِيهَا جَذَعًا أَكُونُ حَيًّا، حِينَ يُخْرِجُكَ قَوْمُكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَمُخْرِجِيَّ هُمْ ‏\"‏‏.‏ فَقَالَ وَرَقَةُ نَعَمْ، لَمْ يَأْتِ رَجُلٌ قَطُّ بِمَا جِئْتَ بِهِ إِلاَّ عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الْوَحْىُ فَتْرَةً حَتَّى حَزِنَ النَّبِيُّ صلى الله عليه وسلم فِيمَا بَلَغَنَا حُزْنًا غَدَا مِنْهُ مِرَارًا كَىْ يَتَرَدَّى مِنْ رُءُوسِ شَوَاهِقِ الْجِبَالِ، فَكُلَّمَا أَوْفَى بِذِرْوَةِ جَبَلٍ لِكَىْ يُلْقِيَ مِنْهُ نَفْسَهُ، تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ إِنَّكَ رَسُولُ اللَّهِ حَقًّا‏.‏ فَيَسْكُنُ لِذَلِكَ جَأْشُهُ وَتَقِرُّ نَفْسُهُ فَيَرْجِعُ، فَإِذَا طَالَتْ عَلَيْهِ فَتْرَةُ الْوَحْىِ غَدَا لِمِثْلِ ذَلِكَ، فَإِذَا أَوْفَى بِذِرْوَةِ جَبَلٍ تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ لَهُ مِثْلَ ذَلِكَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏فَالِقُ الإِصْبَاحِ‏}‏ ضَوْءُ الشَّمْسِ بِالنَّهَارِ، وَضَوْءُ الْقَمَرِ بِاللَّيْلِ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6983,
			"arabicnumber": 6983,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا الْحَسَنَةُ مِنَ الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6984,
			"arabicnumber": 6984,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ سَمِعْتُ أَبَا قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6985,
			"arabicnumber": 6985,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يُحِبُّهَا فَإِنَّمَا هِيَ مِنَ اللَّهِ، فَلْيَحْمَدِ اللَّهَ عَلَيْهَا، وَلْيُحَدِّثْ بِهَا، وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ، فَإِنَّمَا هِيَ مِنَ الشَّيْطَانِ، فَلْيَسْتَعِذْ مِنْ شَرِّهَا، وَلاَ يَذْكُرْهَا لأَحَدٍ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6986,
			"arabicnumber": 6986,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ ـ وَأَثْنَى عَلَيْهِ خَيْرًا لَقِيتُهُ بِالْيَمَامَةِ ـ عَنْ أَبِيهِ، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ فَلْيَتَعَوَّذْ مِنْهُ وَلْيَبْصُقْ عَنْ شِمَالِهِ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏ وَعَنْ أَبِيهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6987,
			"arabicnumber": 6987,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6988,
			"arabicnumber": 6988,
			"text": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏ رَوَاهُ ثَابِتٌ وَحُمَيْدٌ وَإِسْحَاقُ بْنُ عَبْدِ اللَّهِ وَشُعَيْبٌ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6989,
			"arabicnumber": 6989,
			"text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6990,
			"arabicnumber": 6990,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلاَّ الْمُبَشِّرَاتُ ‏\"‏‏.‏ قَالُوا وَمَا الْمُبَشِّرَاتُ قَالَ ‏\"‏ الرُّؤْيَا الصَّالِحَةُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6991,
			"arabicnumber": 6991,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنه ـ أَنَّ أُنَاسًا، أُرُوا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الأَوَاخِرِ، وَأَنَّ أُنَاسًا أُرُوا أَنَّهَا فِي الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْتَمِسُوهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6992,
			"arabicnumber": 6992,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ، ثُمَّ أَتَانِي الدَّاعِي لأَجَبْتُهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6993,
			"arabicnumber": 6993,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ، وَلاَ يَتَمَثَّلُ الشَّيْطَانُ بِي ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ ابْنُ سِيرِينَ إِذَا رَآهُ فِي صُورَتِهِ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6994,
			"arabicnumber": 6994,
			"text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَخَيَّلُ بِي، وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6995,
			"arabicnumber": 6995,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ عَنْ شِمَالِهِ ثَلاَثًا، وَلْيَتَعَوَّذْ مِنَ الشَّيْطَانِ، فَإِنَّهَا لاَ تَضُرُّهُ، وَإِنَّ الشَّيْطَانَ لاَ يَتَرَاءَى بِي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6996,
			"arabicnumber": 6996,
			"text": "حَدَّثَنَا خَالِدُ بْنُ خَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، قَالَ أَبُو سَلَمَةَ قَالَ أَبُو قَتَادَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ وَابْنُ أَخِي الزُّهْرِيِّ",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6997,
			"arabicnumber": 6997,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ، فَإِنَّ الشَّيْطَانَ لاَ يَتَكَوَّنُنِي‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6998,
			"arabicnumber": 6998,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أُعْطِيتُ مَفَاتِيحَ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَمَا أَنَا نَائِمٌ الْبَارِحَةَ إِذْ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ حَتَّى وُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمْ تَنْتَقِلُونَهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6999,
			"arabicnumber": 6999,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا تَقْطُرُ مَاءً، مُتَّكِئًا عَلَى رَجُلَيْنِ ـ أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ ـ يَطُوفُ بِالْبَيْتِ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7000,
			"arabicnumber": 7000,
			"text": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، كَانَ يُحَدِّثُ أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أُرِيتُ اللَّيْلَةَ فِي الْمَنَامِ، وَسَاقَ الْحَدِيثَ‏.‏ وَتَابَعَهُ سُلَيْمَانُ بْنُ كَثِيرٍ وَابْنُ أَخِي الزُّهْرِيِّ وَسُفْيَانُ بْنُ حُسَيْنٍ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ أَوْ أَبَا هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ شُعَيْبٌ وَإِسْحَاقُ بْنُ يَحْيَى عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ مَعْمَرٌ لاَ يُسْنِدُهُ حَتَّى كَانَ بَعْدُ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7002,
			"arabicnumber": 7002,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7003,
			"arabicnumber": 7003,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَنَّ أُمَّ الْعَلاَءِ ـ امْرَأَةً مِنَ الأَنْصَارِ بَايَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ أَخْبَرَتْهُ أَنَّهُمُ اقْتَسَمُوا الْمُهَاجِرِينَ قُرْعَةً‏.‏ قَالَتْ فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ، وَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا، فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ، فَلَمَّا تُوُفِّيَ غُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ ‏\"‏‏.‏ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ فَمَنْ يُكْرِمُهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا هُوَ فَوَاللَّهِ لَقَدْ جَاءَهُ الْيَقِينُ، وَاللَّهِ إِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَوَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَاذَا يُفْعَلُ بِي ‏\"‏‏.‏ فَقَالَتْ وَاللَّهِ لاَ أُزَكِّي بَعْدَهُ أَحَدًا أَبَدًا‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7004,
			"arabicnumber": 7004,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِهَذَا وَقَالَ ‏\"‏ مَا أَدْرِي مَا يُفْعَلُ بِهِ ‏\"‏‏.‏ قَالَتْ وَأَحْزَنَنِي فَنِمْتُ، فَرَأَيْتُ لِعُثْمَانَ عَيْنًا تَجْرِي، فَأَخْبَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ذَلِكَ عَمَلُهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7005,
			"arabicnumber": 7005,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا قَتَادَةَ الأَنْصَارِيّ َ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَفُرْسَانِهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ أَحَدُكُمُ الْحُلُمَ يَكْرَهُهُ فَلْيَبْصُقْ عَنْ يَسَارِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنْهُ، فَلَنْ يَضُرَّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7006,
			"arabicnumber": 7006,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ مِنْ أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي ‏\"‏‏.‏ يَعْنِي عُمَرَ‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7007,
			"arabicnumber": 7007,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ مِنْ أَطْرَافِي، فَأَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ فَقَالَ مَنْ حَوْلَهُ فَمَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7008,
			"arabicnumber": 7008,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَىَّ، وَعَلَيْهِمْ قُمُصٌ، مِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَمَرَّ عَلَىَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ ‏\"‏‏.‏ قَالُوا مَا أَوَّلْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7009,
			"arabicnumber": 7009,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ عُرِضُوا عَلَىَّ، وَعَلَيْهِمْ قُمُصٌ، فَمِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَعُرِضَ عَلَىَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجْتَرُّهُ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7010,
			"arabicnumber": 7010,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ قَالَ قَيْسُ بْنُ عُبَادٍ كُنْتُ فِي حَلْقَةٍ فِيهَا سَعْدُ بْنُ مَالِكٍ وَابْنُ عُمَرَ فَمَرَّ عَبْدُ اللَّهِ بْنُ سَلاَمٍ فَقَالُوا هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ‏.‏ فَقُلْتُ لَهُ إِنَّهُمْ قَالُوا كَذَا وَكَذَا‏.‏ قَالَ سُبْحَانَ اللَّهِ مَا كَانَ يَنْبَغِي لَهُمْ أَنْ يَقُولُوا مَا لَيْسَ لَهُمْ بِهِ عِلْمٌ، إِنَّمَا رَأَيْتُ كَأَنَّمَا عَمُودٌ وُضِعَ فِي رَوْضَةٍ خَضْرَاءَ، فَنُصِبَ فِيهَا وَفِي رَأْسِهَا عُرْوَةٌ وَفِي أَسْفَلِهَا مِنْصَفٌ ـ وَالْمِنْصَفُ الْوَصِيفُ ـ فَقِيلَ ارْقَهْ‏.‏ فَرَقِيتُ حَتَّى أَخَذْتُ بِالْعُرْوَةِ‏.‏ فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَمُوتُ عَبْدُ اللَّهِ وَهْوَ آخِذٌ بِالْعُرْوَةِ الْوُثْقَى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7011,
			"arabicnumber": 7011,
			"text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ، إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةِ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ‏.‏ فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7012,
			"arabicnumber": 7012,
			"text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُرِيتُكِ قَبْلَ أَنْ أَتَزَوَّجَكِ مَرَّتَيْنِ، رَأَيْتُ الْمَلَكَ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ لَهُ اكْشِفْ‏.‏ فَكَشَفَ فَإِذَا هِيَ أَنْتِ، فَقُلْتُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ‏.‏ ثُمَّ أُرِيتُكِ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ اكْشِفْ‏.‏ فَكَشَفَ فَإِذَا هِيَ أَنْتِ فَقُلْتُ إِنْ يَكُ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7013,
			"arabicnumber": 7013,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ، فَوُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ مُحَمَّدٌ وَبَلَغَنِي أَنَّ جَوَامِعَ الْكَلِمِ أَنَّ اللَّهَ يَجْمَعُ الأُمُورَ الْكَثِيرَةَ الَّتِي كَانَتْ تُكْتَبُ فِي الْكُتُبِ قَبْلَهُ فِي الأَمْرِ الْوَاحِدِ وَالأَمْرَيْنِ‏.‏ أَوْ نَحْوَ ذَلِكَ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7014,
			"arabicnumber": 7014,
			"text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَزْهَرُ، عَنِ ابْنِ عَوْنٍ، ح وَحَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، حَدَّثَنَا قَيْسُ بْنُ عُبَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ رَأَيْتُ كَأَنِّي فِي رَوْضَةٍ، وَسَطَ الرَّوْضَةِ عَمُودٌ فِي أَعْلَى الْعَمُودِ عُرْوَةٌ، فَقِيلَ لِي ارْقَهْ‏.‏ قُلْتُ لاَ أَسْتَطِيعُ‏.‏ فَأَتَانِي وَصِيفٌ فَرَفَعَ ثِيَابِي فَرَقِيتُ، فَاسْتَمْسَكْتُ بِالْعُرْوَةِ، فَانْتَبَهْتُ وَأَنَا مُسْتَمْسِكٌ بِهَا، فَقَصَصْتُهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ تِلْكَ الرَّوْضَةُ رَوْضَةُ الإِسْلاَمِ، وَذَلِكَ الْعَمُودُ عَمُودُ الإِسْلاَمِ، وَتِلْكَ الْعُرْوَةُ عُرْوَةُ الْوُثْقَى، لاَ تَزَالُ مُسْتَمْسِكًا بِالإِسْلاَمِ حَتَّى تَمُوتَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7016,
			"arabicnumber": 7016,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7017,
			"arabicnumber": 7017,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَبَّاحٍ، حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ عَوْفًا، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ تَكْذِبُ رُؤْيَا الْمُؤْمِنِ، وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ‏.‏ ‏\"‏ قَالَ مُحَمَّدٌ وَأَنَا أَقُولُ هَذِهِ قَالَ وَكَانَ يُقَالُ الرُّؤْيَا ثَلاَثٌ حَدِيثُ النَّفْسِ، وَتَخْوِيفُ الشَّيْطَانِ، وَبُشْرَى مِنَ اللَّهِ، فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلاَ يَقُصُّهُ عَلَى أَحَدٍ، وَلْيَقُمْ فَلْيُصَلِّ‏.‏ قَالَ وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ، وَكَانَ يُعْجِبُهُمُ الْقَيْدُ، وَيُقَالُ الْقَيْدُ ثَبَاتٌ فِي الدِّينِ‏.‏ وَرَوَى قَتَادَةُ وَيُونُسُ وَهِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَدْرَجَهُ بَعْضُهُمْ كُلَّهُ فِي الْحَدِيثِ، وَحَدِيثُ عَوْفٍ أَبْيَنُ‏.‏ وَقَالَ يُونُسُ لاَ أَحْسِبُهُ إِلاَّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْقَيْدِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لاَ تَكُونُ الأَغْلاَلُ إِلاَّ فِي الأَعْنَاقِ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7018,
			"arabicnumber": 7018,
			"text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ أُمِّ الْعَلاَء ِ ـ وَهْىَ امْرَأَةٌ مِنْ نِسَائِهِمْ بَايَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ قَالَتْ طَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ فِي السُّكْنَى حِينَ اقْتَرَعَتِ الأَنْصَارُ عَلَى سُكْنَى الْمُهَاجِرِينَ، فَاشْتَكَى فَمَرَّضْنَاهُ حَتَّى تُوُفِّيَ، ثُمَّ جَعَلْنَاهُ فِي أَثْوَابِهِ فَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ قَالَ ‏\"‏ وَمَا يُدْرِيكِ ‏\"‏‏.‏ قُلْتُ لاَ أَدْرِي وَاللَّهِ‏.‏ قَالَ ‏\"‏ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ، إِنِّي لأَرْجُو لَهُ الْخَيْرَ مِنَ اللَّهِ، وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي وَلاَ بِكُمْ ‏\"‏‏.‏ قَالَتْ أُمُّ الْعَلاَءِ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ‏.‏ قَالَتْ وَرَأَيْتُ لِعُثْمَانَ فِي النَّوْمِ عَيْنًا تَجْرِي، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ ذَاكِ عَمَلُهُ يَجْرِي لَهُ ‏\"‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7019,
			"arabicnumber": 7019,
			"text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، حَدَّثَنَا نَافِعٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا عَلَى بِئْرٍ أَنْزِعُ مِنْهَا إِذْ جَاءَ أَبُو بَكْرٍ وَعُمَرُ، فَأَخَذَ أَبُو بَكْرٍ الدَّلْوَ، فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، فَغَفَرَ اللَّهُ لَهُ، ثُمَّ أَخَذَهَا ابْنُ الْخَطَّابِ مِنْ يَدِ أَبِي بَكْرٍ فَاسْتَحَالَتْ فِي يَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرْيَهُ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7020,
			"arabicnumber": 7020,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ رُؤْيَا النَّبِيِّ، صلى الله عليه وسلم فِي أَبِي بَكْرٍ وَعُمَرَ قَالَ ‏ \"‏ رَأَيْتُ النَّاسَ اجْتَمَعُوا فَقَامَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ قَامَ ابْنُ الْخَطَّابِ، فَاسْتَحَالَتْ غَرْبًا فَمَا رَأَيْتُ مِنَ النَّاسِ يَفْرِي فَرْيَهُ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7021,
			"arabicnumber": 7021,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدٌ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ وَعَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ فَنَزَعَ مِنْهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا عُمَرُ بْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ بْنِ الْخَطَّابِ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7022,
			"arabicnumber": 7022,
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنِّي عَلَى حَوْضٍ أَسْقِي النَّاسَ، فَأَتَانِي أَبُو بَكْرٍ فَأَخَذَ الدَّلْوَ مِنْ يَدِي لِيُرِيحَنِي، فَنَزَعَ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، فَأَتَى ابْنُ الْخَطَّابِ فَأَخَذَ مِنْهُ، فَلَمْ يَزَلْ يَنْزِعُ، حَتَّى تَوَلَّى النَّاسُ وَالْحَوْضُ يَتَفَجَّرُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7023,
			"arabicnumber": 7023,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، قُلْتُ لِمَنْ هَذَا الْقَصْرُ قَالُوا لِعُمَرَ بْنِ الْخَطَّابِ‏.‏ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَبَكَى عُمَرُ بْنُ الْخَطَّابِ ثُمَّ قَالَ أَعَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7024,
			"arabicnumber": 7024,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَخَلْتُ الْجَنَّةَ فَإِذَا أَنَا بِقَصْرٍ مِنْ ذَهَبٍ، فَقُلْتُ لِمَنْ هَذَا فَقَالُوا لِرَجُلٍ مِنْ قُرَيْشٍ‏.‏ فَمَا مَنَعَنِي أَنْ أَدْخُلَهُ يَا ابْنَ الْخَطَّابِ إِلاَّ مَا أَعْلَمُ مِنْ غَيْرَتِكَ ‏\"‏‏.‏ قَالَ وَعَلَيْكَ أَغَارُ يَا رَسُولَ اللَّهِ",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": 7025,
			"text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ لِمَنْ هَذَا الْقَصْرُ فَقَالُوا لِعُمَرَ‏.‏ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ فَبَكَى عُمَرُ وَقَالَ عَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": 7026,
			"text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي أَطُوفُ بِالْكَعْبَةِ فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ بَيْنَ رَجُلَيْنٍ يَنْطِفُ رَأْسُهُ مَاءً، فَقُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ‏.‏ فَذَهَبْتُ أَلْتَفِتُ فَإِذَا رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ، قُلْتُ مَنْ هَذَا قَالُوا هَذَا الدَّجَّالُ‏.‏ أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ ‏\"‏‏.‏ وَابْنُ قَطَنٍ رَجُلٌ مِنْ بَنِي الْمُصْطَلِقِ مِنْ خُزَاعَةَ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": 7027,
			"text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَجْرِي، ثُمَّ أَعْطَيْتُ فَضْلَهُ عُمَرَ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": 7029,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": 7031,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": 7032,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": 7033,
			"text": "حَدَّثَنِي سَعِيدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ عُبَيْدَةَ بْنِ نَشِيطٍ، قَالَ قَالَ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ رُؤْيَا، رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي ذَكَرَ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": 7034,
			"text": "فَقَالَ ابْنُ عَبَّاسٍ ذُكِرَ لِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنَّهُ وُضِعَ فِي يَدَىَّ سِوَارَانِ مِنْ ذَهَبٍ، فَفُظِعْتُهُمَا وَكَرِهْتُهُمَا، فَأُذِنَ لِي، فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ ‏\"‏‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَحَدُهُمَا الْعَنْسِيُّ الَّذِي قَتَلَهُ فَيْرُوزٌ بِالْيَمَنِ، وَالآخَرُ مُسَيْلِمَةُ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": 7035,
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ، فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرٌ، فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ، وَرَأَيْتُ فِيهَا بَقَرًا وَاللَّهُ خَيْرٌ، فَإِذَا هُمُ الْمُؤْمِنُونَ يَوْمَ أُحُدٍ، وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ مِنَ الْخَيْرِ وَثَوَابِ الصِّدْقِ الَّذِي أَتَانَا اللَّهُ بِهِ بَعْدَ يَوْمِ بَدْرٍ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": 7037,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": 7038,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي أَخِي عَبْدُ الْحَمِيدِ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ كَأَنَّ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى قَامَتْ بِمَهْيَعَةَ ـ وَهْىَ الْجُحْفَةُ ـ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَيْهَا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": 7039,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ فِي رُؤْيَا النَّبِيِّ صلى الله عليه وسلم فِي الْمَدِينَةِ ‏ \"‏ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى نَزَلَتْ بِمَهْيَعَةَ، فَتَأَوَّلْتُهَا أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ، وَهْىَ الْجُحْفَةُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": 7040,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى قَامَتْ بِمَهْيَعَةَ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ، وَهْىَ الْجُحْفَةُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": 7041,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ فِي رُؤْيَا أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ أُخْرَى، فَعَادَ أَحْسَنَ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ، وَاجْتِمَاعِ الْمُؤْمِنِينَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": 7042,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَحَلَّمَ بِحُلُمٍ لَمْ يَرَهُ، كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ، وَلَنْ يَفْعَلَ، وَمَنِ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ أَوْ يَفِرُّونَ مِنْهُ، صُبَّ فِي أُذُنِهِ الآنُكُ يَوْمَ الْقِيَامَةِ، وَمَنْ صَوَّرَ صُورَةً، عُذِّبِ وَكُلِّفَ أَنْ يَنْفُخَ فِيهَا، وَلَيْسَ بِنَافِخٍ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَصَلَهُ لَنَا أَيُّوبُ‏.‏ وَقَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَوْلَهُ مَنْ كَذَبَ فِي رُؤْيَاهُ‏.‏ وَقَالَ شُعْبَةُ عَنْ أَبِي هَاشِمٍ الرُّمَّانِيِّ سَمِعْتُ عِكْرِمَةَ قَالَ أَبُو هُرَيْرَةَ قَوْلَهُ مَنْ صَوَّرَ، وَمَنْ تَحَلَّمَ، وَمَنِ اسْتَمَعَ‏.‏ حَدَّثَنِي إِسْحَاقُ حَدَّثَنَا خَالِدٌ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ ‏\"‏ مَنِ اسْتَمَعَ، وَمَنْ تَحَلَّمَ، وَمَنْ صَوَّرَ ‏\"‏‏.‏ نَحْوَهُ‏.‏ تَابَعَهُ هِشَامٌ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَوْلَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": 7043,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى ابْنِ عُمَرَ عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ عَيْنَيْهِ مَا لَمْ تَرَ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": 7044,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يَقُولُ لَقَدْ كُنْتُ أَرَى الرُّؤْيَا فَتُمْرِضُنِي حَتَّى سَمِعْتُ أَبَا قَتَادَةَ يَقُولُ وَأَنَا كُنْتُ لأَرَى الرُّؤْيَا تُمْرِضُنِي، حَتَّى سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الرُّؤْيَا الْحَسَنَةُ مِنَ اللَّهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلاَ يُحَدِّثْ بِهِ إِلاَّ مَنْ يُحِبُّ، وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا، وَمِنْ شَرِّ الشَّيْطَانِ وَلْيَتْفِلْ ثَلاَثًا وَلاَ يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7045,
			"arabicnumber": 7045,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يُحِبُّهَا، فَإِنَّهَا مِنَ اللَّهِ، فَلْيَحْمَدِ اللَّهَ عَلَيْهَا، وَلْيُحَدِّثْ بِهَا، وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ، فَإِنَّمَا هِيَ مِنَ الشَّيْطَانِ، فَلْيَسْتَعِذْ مِنْ شَرِّهَا، وَلاَ يَذْكُرْهَا لأَحَدٍ، فَإِنَّهَا لَنْ تَضُرَّهُ ‏\"‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7046,
			"arabicnumber": 7046,
			"text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ كَانَ يُحَدِّثُ أَنَّ رَجُلاً أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي رَأَيْتُ اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ، فَأَرَى النَّاسَ يَتَكَفَّفُونَ مِنْهَا فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ، وَإِذَا سَبَبٌ وَاصِلٌ مِنَ الأَرْضِ إِلَى السَّمَاءِ، فَأَرَاكَ أَخَذْتَ بِهِ فَعَلَوْتَ، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ بِهِ، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ ثُمَّ وُصِلَ‏.‏ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَاللَّهِ لَتَدَعَنِّي فَأَعْبُرَهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْبُرْ ‏\"‏‏.‏ قَالَ أَمَّا الظُّلَّةُ فَالإِسْلاَمُ، وَأَمَّا الَّذِي يَنْطِفُ مِنَ الْعَسَلِ وَالسَّمْنِ فَالْقُرْآنُ حَلاَوَتُهُ تَنْطُفُ، فَالْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ، وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ، ثُمَّ يَأْخُذُ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ثُمَّ يَأْخُذُهُ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ ثُمَّ يُوَصَّلُ لَهُ فَيَعْلُو بِهِ، فَأَخْبِرْنِي يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ أَصَبْتُ أَمْ أَخْطَأْتُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا ‏\"‏‏.‏ قَالَ فَوَاللَّهِ لَتُحَدِّثَنِّي بِالَّذِي أَخْطَأْتُ‏.‏ قَالَ ‏\"‏ لاَ تُقْسِمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "حَدَّثَنِي مُؤَمَّلُ بْنُ هِشَامٍ أَبُو هِشَامٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَوْفٌ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا سَمُرَةُ بْنُ جُنْدَبٍ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِمَّا يُكْثِرُ أَنْ يَقُولَ لأَصْحَابِهِ ‏\"‏ هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا ‏\"‏‏.‏ قَالَ فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ، وَإِنَّهُ قَالَ ذَاتَ غَدَاةٍ ‏\"‏ إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ، وَإِنَّهُمَا ابْتَعَثَانِي، وَإِنَّهُمَا قَالاَ لِي انْطَلِقْ‏.‏ وَإِنِّي انْطَلَقْتُ مَعَهُمَا، وَإِنَّا أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ، وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِصَخْرَةٍ، وَإِذَا هُوَ يَهْوِي بِالصَّخْرَةِ لِرَأْسِهِ، فَيَثْلَغُ رَأْسَهُ فَيَتَهَدْهَدُ الْحَجَرُ هَا هُنَا، فَيَتْبَعُ الْحَجَرَ فَيَأْخُذُهُ، فَلاَ يَرْجِعُ إِلَيْهِ حَتَّى يَصِحَّ رَأْسُهُ كَمَا كَانَ، ثُمَّ يَعُودُ عَلَيْهِ، فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ الْمَرَّةَ الأُولَى‏.‏ قَالَ قُلْتُ لَهُمَا سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقْ ـ قَالَ ـ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ مُسْتَلْقٍ لِقَفَاهُ، وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِكَلُّوبٍ مِنْ حَدِيدٍ، وَإِذَا هُوَ يَأْتِي أَحَدَ شِقَّىْ وَجْهِهِ فَيُشَرْشِرُ شِدْقَهُ إِلَى قَفَاهُ، وَمَنْخِرَهُ إِلَى قَفَاهُ وَعَيْنَهُ إِلَى قَفَاهُ ـ قَالَ وَرُبَّمَا قَالَ أَبُو رَجَاءٍ فَيَشُقُّ ـ قَالَ ثُمَّ يَتَحَوَّلُ إِلَى الْجَانِبِ الآخَرِ، فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ بِالْجَانِبِ الأَوَّلِ، فَمَا يَفْرُغُ مِنْ ذَلِكَ الْجَانِبِ حَتَّى يَصِحَّ ذَلِكَ الْجَانِبُ كَمَا كَانَ، ثُمَّ يَعُودُ عَلَيْهِ فَيَفْعَلُ مِثْلَ مَا فَعَلَ الْمَرَّةَ الأُولَى‏.‏ قَالَ قُلْتُ سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقْ‏.‏ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى مِثْلِ التَّنُّورِ ـ قَالَ فَأَحْسِبُ أَنَّهُ كَانَ يَقُولُ ـ فَإِذَا فِيهِ لَغَطٌ وَأَصْوَاتٌ ـ قَالَ ـ فَاطَّلَعْنَا فِيهِ، فَإِذَا فِيهِ رِجَالٌ وَنِسَاءٌ عُرَاةٌ، وَإِذَا هُمْ يَأْتِيهِمْ لَهَبٌ مِنْ أَسْفَلَ مِنْهُمْ، فَإِذَا أَتَاهُمْ ذَلِكَ اللَّهَبُ ضَوْضَوْا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَؤُلاَءِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى نَهَرٍ ـ حَسِبْتُ أَنَّهُ كَانَ يَقُولُ ـ أَحْمَرَ مِثْلِ الدَّمِ، وَإِذَا فِي النَّهَرِ رَجُلٌ سَابِحٌ يَسْبَحُ، وَإِذَا عَلَى شَطِّ النَّهَرِ رَجُلٌ قَدْ جَمَعَ عِنْدَهُ حِجَارَةً كَثِيرَةً، وَإِذَا ذَلِكَ السَّابِحُ يَسْبَحُ مَا يَسْبَحُ، ثُمَّ يَأْتِي ذَلِكَ الَّذِي قَدْ جَمَعَ عِنْدَهُ الْحِجَارَةَ فَيَفْغَرُ لَهُ فَاهُ فَيُلْقِمُهُ حَجَرًا فَيَنْطَلِقُ يَسْبَحُ، ثُمَّ يَرْجِعُ إِلَيْهِ، كُلَّمَا رَجَعَ إِلَيْهِ فَغَرَ لَهُ فَاهُ فَأَلْقَمَهُ حَجَرًا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَانِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ كَرِيهِ الْمَرْآةِ كَأَكْرَهِ مَا أَنْتَ رَاءٍ رَجُلاً مَرْآةً، وَإِذَا عِنْدَهُ نَارٌ يَحُشُّهَا وَيَسْعَى حَوْلَهَا ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَا قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتَمَّةٍ فِيهَا مِنْ كُلِّ نَوْرِ الرَّبِيعِ، وَإِذَا بَيْنَ ظَهْرَىِ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لاَ أَكَادُ أَرَى رَأْسَهُ طُولاً فِي السَّمَاءِ، وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ ـ قَالَ ـ قُلْتُ لَهُمَا مَا هَذَا مَا هَؤُلاَءِ قَالَ قَالاَ لِي انْطَلِقِ انْطَلِقْ‏.‏ ـ قَالَ ـ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلاَ أَحْسَنَ‏.‏ ـ قَالَ ـ قَالاَ لِي ارْقَ فِيهَا‏.‏ قَالَ فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ، فَأَتَيْنَا باب الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا، فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ، وَشَطْرٌ كَأَقْبَحِ مَا أَنْتَ رَاءٍ ـ قَالَ ـ قَالاَ لَهُمُ اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ‏.‏ قَالَ وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ، فَذَهَبُوا فَوَقَعُوا فِيهِ، ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ، فَصَارُوا فِي أَحْسَنِ صُورَةٍ ـ قَالَ ـ قَالاَ لِي هَذِهِ جَنَّةُ عَدْنٍ، وَهَذَاكَ مَنْزِلُكَ‏.‏ قَالَ فَسَمَا بَصَرِي صُعُدًا، فَإِذَا قَصْرٌ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ ـ قَالَ ـ قَالاَ هَذَاكَ مَنْزِلُكَ‏.‏ قَالَ قُلْتُ لَهُمَا بَارَكَ اللَّهُ فِيكُمَا، ذَرَانِي فَأَدْخُلَهُ‏.‏ قَالاَ أَمَّا الآنَ فَلاَ وَأَنْتَ دَاخِلُهُ‏.‏ قَالَ قُلْتُ لَهُمَا فَإِنِّي قَدْ رَأَيْتُ مُنْذُ اللَّيْلَةِ عَجَبًا، فَمَا هَذَا الَّذِي رَأَيْتُ قَالَ قَالاَ لِي أَمَا إِنَّا سَنُخْبِرُكَ، أَمَّا الرَّجُلُ الأَوَّلُ الَّذِي أَتَيْتَ عَلَيْهِ يُثْلَغُ رَأْسُهُ بِالْحَجَرِ، فَإِنَّهُ الرَّجُلُ يَأْخُذُ الْقُرْآنَ فَيَرْفُضُهُ وَيَنَامُ عَنِ الصَّلاَةِ الْمَكْتُوبَةِ، وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يُشَرْشَرُ شِدْقُهُ إِلَى قَفَاهُ، وَمَنْخِرُهُ إِلَى قَفَاهُ، وَعَيْنُهُ إِلَى قَفَاهُ، فَإِنَّهُ الرَّجُلُ يَغْدُو مِنْ بَيْتِهِ فَيَكْذِبُ الْكَذْبَةَ تَبْلُغُ الآفَاقَ، وَأَمَّا الرِّجَالُ وَالنِّسَاءُ الْعُرَاةُ الَّذِينَ فِي مِثْلِ بِنَاءِ التَّنُّورِ فَإِنَّهُمُ الزُّنَاةُ وَالزَّوَانِي‏.‏ وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يَسْبَحُ فِي النَّهَرِ وَيُلْقَمُ الْحَجَرَ، فَإِنَّهُ آكِلُ الرِّبَا، وَأَمَّا الرَّجُلُ الْكَرِيهُ الْمَرْآةِ الَّذِي عِنْدَ النَّارِ يَحُشُّهَا وَيَسْعَى حَوْلَهَا، فَإِنَّهُ مَالِكٌ خَازِنُ جَهَنَّمَ، وَأَمَّا الرَّجُلُ الطَّوِيلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ صلى الله عليه وسلم وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ ‏\"‏‏.‏ قَالَ فَقَالَ بَعْضُ الْمُسْلِمِينَ يَا رَسُولَ اللَّهِ وَأَوْلاَدُ الْمُشْرِكِينَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَوْلاَدُ الْمُشْرِكِينَ‏.‏ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شَطْرٌ مِنْهُمْ حَسَنًا وَشَطَرٌ مِنْهُمْ قَبِيحًا، فَإِنَّهُمْ قَوْمٌ خَلَطُوا عَمَلاً صَالِحًا وَآخَرَ سَيِّئًا، تَجَاوَزَ اللَّهُ عَنْهُمْ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}