{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غُسِّلَ فِي قَمِيصٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 520
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": 521,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ تَعْنِي بِحِقْوِهِ إِزَارَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 521
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 522
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 523
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 524
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، قَالَ لِعَائِشَةَ وَهُوَ مَرِيضٌ فِي كَمْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ ‏.‏ فَقَالَ أَبُو بَكْرٍ خُذُوا هَذَا الثَّوْبَ - لِثَوْبٍ عَلَيْهِ قَدْ أَصَابَهُ مِشْقٌ أَوْ زَعْفَرَانٌ - فَاغْسِلُوهُ ثُمَّ كَفِّنُونِي فِيهِ مَعَ ثَوْبَيْنِ آخَرَيْنِ ‏.‏ فَقَالَتْ عَائِشَةُ وَمَا هَذَا فَقَالَ أَبُو بَكْرٍ الْحَىُّ أَحْوَجُ إِلَى الْجَدِيدِ مِنَ الْمَيِّتِ وَإِنَّمَا هَذَا لِلْمُهْلَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 525
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ قَالَ الْمَيِّتُ يُقَمَّصُ وَيُؤَزَّرُ وَيُلَفُّ فِي الثَّوْبِ الثَّالِثِ فَإِنْ لَمْ يَكُنْ إِلاَّ ثَوْبٌ وَاحِدٌ كُفِّنَ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 526
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يَمْشُونَ أَمَامَ الْجَنَازَةِ وَالْخُلَفَاءُ هَلُمَّ جَرًّا وَعَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 527
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ رِبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَدِيرِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، رَأَى عُمَرَ بْنَ الْخَطَّابِ يَقْدُمُ النَّاسَ أَمَامَ الْجَنَازَةِ فِي جَنَازَةِ زَيْنَبَ بِنْتِ جَحْشٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 528
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ مَا رَأَيْتُ أَبِي قَطُّ فِي جَنَازَةٍ إِلاَّ أَمَامَهَا - قَالَ - ثُمَّ يَأْتِي الْبَقِيعَ فَيَجْلِسُ حَتَّى يَمُرُّوا عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 529
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ الْمَشْىُ خَلْفَ الْجَنَازَةِ مِنْ خَطَإِ السُّنَّةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 530
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا قَالَتْ لأَهْلِهَا أَجْمِرُوا ثِيَابِي إِذَا مِتُّ ثُمَّ حَنِّطُونِي وَلاَ تَذُرُّوا عَلَى كَفَنِي حِنَاطًا وَلاَ تَتْبَعُونِي بِنَارٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 531
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ نَهَى أَنْ يُتْبَعَ، بَعْدَ مَوْتِهِ بِنَارٍ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَكْرَهُ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 532
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": 533,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ لِلنَّاسِ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 533
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ أَخْبَرَهُ أَنَّ مِسْكِينَةً مَرِضَتْ فَأُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم - بِمَرَضِهَا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُ الْمَسَاكِينَ وَيَسْأَلُ عَنْهُمْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا مَاتَتْ فَآذِنُونِي بِهَا ‏\"‏ ‏.‏ فَخُرِجَ بِجَنَازَتِهَا لَيْلاً فَكَرِهُوا أَنْ يُوقِظُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم أُخْبِرَ بِالَّذِي كَانَ مِنْ شَأْنِهَا فَقَالَ ‏\"‏ أَلَمْ آمُرْكُمْ أَنْ تُؤْذِنُونِي بِهَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَرِهْنَا أَنْ نُخْرِجَكَ لَيْلاً وَنُوقِظَكَ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى صَفَّ بِالنَّاسِ عَلَى قَبْرِهَا وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 534
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ، يُدْرِكُ بَعْضَ التَّكْبِيرِ عَلَى الْجَنَازَةِ وَيَفُوتُهُ بَعْضُهُ فَقَالَ يَقْضِي مَا فَاتَهُ مِنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 535
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ كَيْفَ تُصَلِّي عَلَى الْجَنَازَةِ فَقَالَ أَبُو هُرَيْرَةَ أَنَا لَعَمْرُ اللَّهِ، أُخْبِرُكَ أَتَّبِعُهَا، مِنْ أَهْلِهَا فَإِذَا وُضِعَتْ كَبَّرْتُ وَحَمِدْتُ اللَّهَ وَصَلَّيْتُ عَلَى نَبِيِّهِ ثُمَّ أَقُولُ اللَّهُمَّ إِنَّهُ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ كَانَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ وَأَنْتَ أَعْلَمُ بِهِ اللَّهُمَّ إِنْ كَانَ مُحْسِنًا فَزِدْ فِي إِحْسَانِهِ وَإِنْ كَانَ مُسِيئًا فَتَجَاوَزْ عَنْ سَيِّئَاتِهِ اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 536
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ صَلَّيْتُ وَرَاءَ أَبِي هُرَيْرَةَ عَلَى صَبِيٍّ لَمْ يَعْمَلْ خَطِيئَةً قَطُّ فَسَمِعْتُهُ يَقُولُ اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 537
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَقْرَأُ فِي الصَّلاَةِ عَلَى الْجَنَازَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 538
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي حَرْمَلَةَ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي سُفْيَانَ بْنِ حُوَيْطِبٍ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، تُوُفِّيَتْ - وَطَارِقٌ أَمِيرُ الْمَدِينَةِ - فَأُتِيَ بِجَنَازَتِهَا بَعْدَ صَلاَةِ الصُّبْحِ فَوُضِعَتْ بِالْبَقِيعِ ‏.‏ قَالَ وَكَانَ طَارِقٌ يُغَلِّسُ بِالصُّبْحِ ‏.‏ قَالَ ابْنُ أَبِي حَرْمَلَةَ فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ لأَهْلِهَا إِمَّا أَنْ تُصَلُّوا عَلَى جَنَازَتِكُمُ الآنَ وَإِمَّا أَنْ تَتْرُكُوهَا حَتَّى تَرْتَفِعَ الشَّمْسُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 539
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ يُصَلَّى عَلَى الْجَنَازَةِ بَعْدَ الْعَصْرِ وَبَعْدَ الصُّبْحِ إِذَا صُلِّيَتَا لِوَقْتِهِمَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 540
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَمَرَتْ أَنْ يُمَرَّ عَلَيْهَا بِسَعْدِ بْنِ أَبِي وَقَّاصٍ فِي الْمَسْجِدِ حِينَ مَاتَ لِتَدْعُوَ لَهُ فَأَنْكَرَ ذَلِكَ النَّاسُ عَلَيْهَا فَقَالَتْ عَائِشَةُ مَا أَسْرَعَ النَّاسَ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 541
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ صُلِّيَ عَلَى عُمَرَ بْنِ الْخَطَّابِ فِي الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 542
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، وَعَبْدَ اللَّهِ بْنَ عُمَرَ، وَأَبَا، هُرَيْرَةَ كَانُوا يُصَلُّونَ عَلَى الْجَنَائِزِ بِالْمَدِينَةِ الرِّجَالِ وَالنِّسَاءِ فَيَجْعَلُونَ الرِّجَالَ مِمَّا يَلِي الإِمَامَ وَالنِّسَاءَ مِمَّا يَلِي الْقِبْلَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 543
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا صَلَّى عَلَى الْجَنَائِزِ يُسَلِّمُ حَتَّى يُسْمِعَ مَنْ يَلِيهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 544
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ يُصَلِّي الرَّجُلُ عَلَى الْجَنَازَةِ إِلاَّ وَهُوَ طَاهِرٌ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ لَمْ أَرَ أَحَدًا مِنْ أَهْلِ الْعِلْمِ يَكْرَهُ أَنْ يُصَلَّى عَلَى وَلَدِ الزِّنَا وَأُمِّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 545
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ يَوْمَ الاِثْنَيْنِ وَدُفِنَ يَوْمَ الثُّلاَثَاءِ وَصَلَّى النَّاسُ عَلَيْهِ أَفْذَاذًا لاَ يَؤُمُّهُمْ أَحَدٌ ‏.‏ فَقَالَ نَاسٌ يُدْفَنُ عِنْدَ الْمِنْبَرِ ‏.‏ وَقَالَ آخَرُونَ يُدْفَنُ بِالْبَقِيعِ ‏.‏ فَجَاءَ أَبُو بَكْرٍ الصِّدِّيقُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا دُفِنَ نَبِيٌّ قَطُّ إِلاَّ فِي مَكَانِهِ الَّذِي تُوُفِّيَ فِيهِ ‏\"‏ ‏.‏ فَحُفِرَ لَهُ فِيهِ فَلَمَّا كَانَ عِنْدَ غُسْلِهِ أَرَادُوا نَزْعَ قَمِيصِهِ فَسَمِعُوا صَوْتًا يَقُولُ لاَ تَنْزِعُوا الْقَمِيصَ فَلَمْ يُنْزَعِ الْقَمِيصُ وَغُسِّلَ وَهُوَ عَلَيْهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 546
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ بِالْمَدِينَةِ رَجُلاَنِ أَحَدُهُمَا يَلْحَدُ وَالآخَرُ لاَ يَلْحَدُ فَقَالُوا أَيُّهُمَا جَاءَ أَوَّلُ عَمِلَ عَمَلَهُ ‏.‏ فَجَاءَ الَّذِي يَلْحَدُ فَلَحَدَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 547
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ مَا صَدَّقْتُ بِمَوْتِ النَّبِيِّ صلى الله عليه وسلم حَتَّى سَمِعْتُ وَقْعَ الْكَرَازِينِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 548
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ رَأَيْتُ ثَلاَثَةَ أَقْمَارٍ سَقَطْنَ فِي حُجْرَتِي فَقَصَصْتُ رُؤْيَاىَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ قَالَتْ فَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدُفِنَ فِي بَيْتِهَا قَالَ لَهَا أَبُو بَكْرٍ هَذَا أَحَدُ أَقْمَارِكِ وَهُوَ خَيْرُهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 549
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ غَيْرِ، وَاحِدٍ، مِمَّنْ يَثِقُ بِهِ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ وَسَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ تُوُفِّيَا بِالْعَقِيقِ وَحُمِلاَ إِلَى الْمَدِينَةِ وَدُفِنَا بِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 550
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ مَا أُحِبُّ أَنْ أُدْفَنَ، بِالْبَقِيعِ لأَنْ أُدْفَنَ بِغَيْرِهِ أَحَبُّ إِلَىَّ مِنْ أَنْ أُدْفَنَ بِهِ إِنَّمَا هُوَ أَحَدُ رَجُلَيْنِ إِمَّا ظَالِمٌ فَلاَ أُحِبُّ أَنْ أُدْفَنَ مَعَهُ وَإِمَّا صَالِحٌ فَلاَ أُحِبُّ أَنْ تُنْبَشَ لِي عِظَامُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 551
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُومُ فِي الْجَنَائِزِ ثُمَّ جَلَسَ بَعْدُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 552
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، كَانَ يَتَوَسَّدُ الْقُبُورَ وَيَضْطَجِعُ عَلَيْهَا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نُهِيَ عَنِ الْقُعُودِ عَلَى الْقُبُورِ فِيمَا نُرَى لِلْمَذَاهِبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 553
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ سَمِعَ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ، يَقُولُ كُنَّا نَشْهَدُ الْجَنَائِزَ فَمَا يَجْلِسُ آخِرُ النَّاسِ حَتَّى يُؤْذَنُوا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 554
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرِ بْنِ عَتِيكٍ، عَنْ عَتِيكِ بْنِ الْحَارِثِ، - وَهُوَ جَدُّ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرٍ أَبُو أُمِّهِ - أَنَّهُ أَخْبَرَهُ أَنَّ جَابِرَ بْنَ عَتِيكٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ يَعُودُ عَبْدَ اللَّهِ بْنَ ثَابِتٍ فَوَجَدَهُ قَدْ غُلِبَ عَلَيْهِ فَصَاحَ بِهِ فَلَمْ يُجِبْهُ فَاسْتَرْجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ غُلِبْنَا عَلَيْكَ يَا أَبَا الرَّبِيعِ ‏\"‏ ‏.‏ فَصَاحَ النِّسْوَةُ وَبَكَيْنَ فَجَعَلَ جَابِرٌ يُسَكِّتُهُنَّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُنَّ فَإِذَا وَجَبَ فَلاَ تَبْكِيَنَّ بَاكِيَةٌ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا الْوُجُوبُ قَالَ ‏\"‏ إِذَا مَاتَ ‏\"‏ ‏.‏ فَقَالَتِ ابْنَتُهُ وَاللَّهِ إِنْ كُنْتُ لأَرْجُو أَنْ تَكُونَ شَهِيدًا فَإِنَّكَ كُنْتَ قَدْ قَضَيْتَ جِهَازَكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ قَدْ أَوْقَعَ أَجْرَهُ عَلَى قَدْرِ نِيَّتِهِ وَمَا تَعُدُّونَ الشَّهَادَةَ ‏\"‏ ‏.‏ قَالُوا الْقَتْلُ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشُّهَدَاءُ سَبْعَةٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ الْمَطْعُونُ شَهِيدٌ وَالْغَرِقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَالْحَرِقُ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 555
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، تَقُولُ وَذُكِرَ لَهَا أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏.‏ فَقَالَتْ عَائِشَةُ يَغْفِرُ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَهُودِيَّةٍ يَبْكِي عَلَيْهَا أَهْلُهَا فَقَالَ ‏ \"‏ إِنَّكُمْ لَتَبْكُونَ عَلَيْهَا وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 556
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 557
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ أَبِي النَّضْرِ السَّلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَيَحْتَسِبُهُمْ إِلاَّ كَانُوا جُنَّةً مِنَ النَّارِ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ أَوِ اثْنَانِ قَالَ ‏\"‏ أَوِ اثْنَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 558
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَزَالُ الْمُؤْمِنُ يُصَابُ فِي وَلَدِهِ وَحَامَّتِهِ حَتَّى يَلْقَى اللَّهَ وَلَيْسَتْ لَهُ خَطِيئَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 559
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لِيُعَزِّ الْمُسْلِمِينَ فِي مَصَائِبِهِمُ الْمُصِيبَةُ بِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 560
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَصَابَتْهُ مُصِيبَةٌ فَقَالَ كَمَا أَمَرَ اللَّهُ (إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ) اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَعْقِبْنِي خَيْرًا مِنْهَا إِلَّا فَعَلَ اللَّهُ ذَلِكَ بِهِ قَالَتْ أُمُّ سَلَمَةَ فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ قُلْتُ ذَلِكَ ثُمَّ قُلْتُ وَمَنْ خَيْرٌ مِنْ أَبِي سَلَمَةَ فَأَعْقَبَهَا اللَّهُ رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَزَوَّجَهَا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 561
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ هَلَكَتِ امْرَأَةٌ لِي فَأَتَانِي مُحَمَّدُ بْنُ كَعْبٍ الْقُرَظِيُّ يُعَزِّينِي بِهَا فَقَالَ إِنَّهُ كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ فَقِيهٌ عَالِمٌ عَابِدٌ مُجْتَهِدٌ وَكَانَتْ لَهُ امْرَأَةٌ - وَكَانَ بِهَا مُعْجَبًا وَلَهَا مُحِبًّا - فَمَاتَتْ فَوَجَدَ عَلَيْهَا وَجْدًا شَدِيدًا وَلَقِيَ عَلَيْهَا أَسَفًا حَتَّى خَلاَ فِي بَيْتٍ وَغَلَّقَ عَلَى نَفْسِهِ وَاحْتَجَبَ مِنَ النَّاسِ فَلَمْ يَكُنْ يَدْخُلُ عَلَيْهِ أَحَدٌ وَإِنَّ امْرَأَةً سَمِعَتْ بِهِ فَجَاءَتْهُ فَقَالَتْ إِنَّ لِي إِلَيْهِ حَاجَةً أَسْتَفْتِيهِ فِيهَا لَيْسَ يُجْزِينِي فِيهَا إِلاَّ مُشَافَهَتُهُ فَذَهَبَ النَّاسُ وَلَزِمَتْ بَابَهُ وَقَالَتْ مَا لِي مِنْهُ بُدٌّ ‏.‏ فَقَالَ لَهُ قَائِلٌ إِنَّ هَا هُنَا امْرَأَةً أَرَادَتْ أَنْ تَسْتَفْتِيَكَ وَقَالَتْ إِنْ أَرَدْتُ إِلاَّ مُشَافَهَتَهُ وَقَدْ ذَهَبَ النَّاسُ وَهِيَ لاَ تُفَارِقُ الْبَابَ ‏.‏ فَقَالَ ائْذَنُوا لَهَا ‏.‏ فَدَخَلَتْ عَلَيْهِ فَقَالَتْ إِنِّي جِئْتُكَ أَسْتَفْتِيكَ فِي أَمْرٍ ‏.‏ قَالَ وَمَا هُوَ قَالَتْ إِنِّي اسْتَعَرْتُ مِنْ جَارَةٍ لِي حَلْيًا فَكُنْتُ أَلْبَسُهُ وَأُعِيرُهُ زَمَانًا ثُمَّ إِنَّهُمْ أَرْسَلُوا إِلَىَّ فِيهِ أَفَأُؤَدِّيهِ إِلَيْهِمْ فَقَالَ نَعَمْ وَاللَّهِ ‏.‏ فَقَالَتْ إِنَّهُ قَدْ مَكَثَ عِنْدِي زَمَانًا ‏.‏ فَقَالَ ذَلِكَ أَحَقُّ لِرَدِّكِ إِيَّاهُ إِلَيْهِمْ حِينَ أَعَارُوكِيهِ زَمَانًا ‏.‏ فَقَالَتْ أَىْ يَرْحَمُكَ اللَّهُ أَفَتَأْسَفُ عَلَى مَا أَعَارَكَ اللَّهُ ثُمَّ أَخَذَهُ مِنْكَ وَهُوَ أَحَقُّ بِهِ مِنْكَ فَأَبْصَرَ مَا كَانَ فِيهِ وَنَفَعَهُ اللَّهُ بِقَوْلِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 562
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَهَا تَقُولُ، لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُخْتَفِيَ وَالْمُخْتَفِيَةَ يَعْنِي نَبَّاشَ الْقُبُورِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 563
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ كَسْرُ عَظْمِ الْمُسْلِمِ مَيْتًا كَكَسْرِهِ وَهُوَ حَىٌّ ‏.‏ تَعْنِي فِي الإِثْمِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 564
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَمُوتَ وَهُوَ مُسْتَنِدٌ إِلَى صَدْرِهَا وَأَصْغَتْ إِلَيْهِ يَقُولُ ‏ \"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 565
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ نَبِيٍّ يَمُوتُ حَتَّى يُخَيَّرَ ‏\"‏ ‏.‏ قَالَتْ فَسَمِعْتُهُ يَقُولُ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏ ‏.‏ فَعَرَفْتُ أَنَّهُ ذَاهِبٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 566
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ يُقَالُ لَهُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 567
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ ابْنِ آدَمَ تَأْكُلُهُ الأَرْضُ إِلاَّ عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ وَفِيهِ يُرَكَّبُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 568
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "وَحَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ الْأَنْصَارِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ كَعْبَ بْنَ مَالِكٍ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَيْرٌ يَعْلَقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يَرْجِعَهُ اللَّهُ إِلَى جَسَدِهِ يَوْمَ يَبْعَثُهُ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 569
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى إِذَا أَحَبَّ عَبْدِي لِقَائِي أَحْبَبْتُ لِقَاءَهُ وَإِذَا كَرِهَ لِقَائِي كَرِهْتُ لِقَاءَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 570
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ رَجُلٌ لَمْ يَعْمَلْ حَسَنَةً قَطُّ لأَهْلِهِ إِذَا مَاتَ فَحَرِّقُوهُ ثُمَّ اذْرُوا نِصْفَهُ فِي الْبَرِّ وَنِصْفَهُ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ اللَّهُ عَلَيْهِ لَيُعَذِّبَنَّهُ عَذَابًا لاَ يُعَذِّبُهُ أَحَدًا مِنَ الْعَالَمِينَ ‏.‏ فَلَمَّا مَاتَ الرَّجُلُ فَعَلُوا مَا أَمَرَهُمْ بِهِ فَأَمَرَ اللَّهُ الْبَرَّ فَجَمَعَ مَا فِيهِ وَأَمَرَ الْبَحْرَ فَجَمَعَ مَا فِيهِ ثُمَّ قَالَ لِمَ فَعَلْتَ هَذَا قَالَ مِنْ خَشْيَتِكَ يَا رَبِّ وَأَنْتَ أَعْلَمُ ‏.‏ قَالَ فَغَفَرَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 571
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنِ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ، كَمَا تُنَاتَجُ الإِبِلُ مِنْ بَهِيمَةٍ جَمْعَاءَ هَلْ تُحِسُّ فِيهَا مِنْ جَدْعَاءَ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الَّذِي يَمُوتُ وَهُوَ صَغِيرٌ قَالَ ‏:‏ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 572
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 573
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ كَانَ يُحَدِّثُ ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ ‏:‏ ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ قَالَ ‏:‏ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا إِلَى رَحْمَةِ اللَّهِ، وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 574
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ قَالَ ‏:‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَمَّا مَاتَ عُثْمَانُ بْنُ مَظْعُونٍ وَمُرَّ بِجَنَازَتِهِ ‏:‏ ‏ \"‏ ذَهَبْتَ وَلَمْ تَلَبَّسْ مِنْهَا بِشَىْءٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 575
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا قَالَتْ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ ‏:‏ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَلَبِسَ ثِيَابَهُ ثُمَّ خَرَجَ - قَالَتْ - فَأَمَرْتُ جَارِيَتِي بَرِيرَةَ تَتْبَعُهُ، فَتَبِعَتْهُ حَتَّى جَاءَ الْبَقِيعَ، فَوَقَفَ فِي أَدْنَاهُ مَا شَاءَ اللَّهُ أَنْ يَقِفَ، ثُمَّ انْصَرَفَ فَسَبَقَتْهُ بَرِيرَةُ فَأَخْبَرَتْنِي، فَلَمْ أَذْكُرْ لَهُ شَيْئًا حَتَّى أَصْبَحَ ثُمَّ ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏:‏ ‏ \"‏ إِنِّي بُعِثْتُ إِلَى أَهْلِ الْبَقِيعِ لأُصَلِّيَ عَلَيْهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 576
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ ‏:‏ أَسْرِعُوا بِجَنَائِزِكُمْ، فَإِنَّمَا هُوَ خَيْرٌ تُقَدِّمُونَهُ إِلَيْهِ أَوْ شَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 577
			}
		}
	]
}