{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏ \"‏ لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 578
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الأَنْصَارِيِّ، ثُمَّ الْمَازِنِيِّ عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏ \"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقِيَّ مِنَ الْوَرِقِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 579
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏:‏ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عَامِلِهِ عَلَى دِمَشْقَ فِي الصَّدَقَةِ ‏:‏ إِنَّمَا الصَّدَقَةُ فِي الْحَرْثِ وَالْعَيْنِ وَالْمَاشِيَةِ ‏.‏ قَالَ مَالِكٌ ‏:‏ وَلاَ تَكُونُ الصَّدَقَةُ إِلاَّ فِي ثَلاَثَةِ أَشْيَاءَ ‏:‏ فِي الْحَرْثِ وَالْعَيْنِ وَالْمَاشِيَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 580
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عُقْبَةَ، مَوْلَى الزُّبَيْرِ ‏:‏ أَنَّهُ سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ مُكَاتَبٍ، لَهُ قَاطَعَهُ بِمَالٍ عَظِيمٍ هَلْ عَلَيْهِ فِيهِ زَكَاةٌ فَقَالَ الْقَاسِمُ ‏:‏ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ لَمْ يَكُنْ يَأْخُذُ مِنْ مَالٍ زَكَاةً حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ ‏.‏ قَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ ‏:‏ وَكَانَ أَبُو بَكْرٍ إِذَا أَعْطَى النَّاسَ أَعْطِيَاتِهِمْ يَسْأَلُ الرَّجُلَ هَلْ عِنْدَكَ مِنْ مَالٍ وَجَبَتْ عَلَيْكَ فِيهِ الزَّكَاةُ فَإِذَا قَالَ ‏:‏ نَعَمْ، أَخَذَ مِنْ عَطَائِهِ زَكَاةَ ذَلِكَ الْمَالِ، وَإِنْ قَالَ ‏:‏ لاَ، أَسْلَمَ إِلَيْهِ عَطَاءَهُ وَلَمْ يَأْخُذْ مِنْهُ شَيْئًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 581
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُمَرَ بْنِ حُسَيْنٍ، عَنْ عَائِشَةَ بِنْتِ قُدَامَةَ، عَنْ أَبِيهَا، أَنَّهُ قَالَ ‏:‏ كُنْتُ إِذَا جِئْتُ عُثْمَانَ بْنَ عَفَّانَ أَقْبِضُ عَطَائِي سَأَلَنِي ‏:‏ هَلْ عِنْدَكَ مِنْ مَالٍ وَجَبَتْ عَلَيْكَ فِيهِ الزَّكَاةُ قَالَ فَإِنْ قُلْتُ ‏:‏ نَعَمْ أَخَذَ مِنْ عَطَائِي زَكَاةَ ذَلِكَ الْمَالِ، وَإِنْ قُلْتُ ‏:‏ لاَ، دَفَعَ إِلَىَّ عَطَائِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 582
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ ‏:‏ لاَ تَجِبُ فِي مَالٍ زَكَاةٌ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 583
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ ‏:‏ أَوَّلُ مَنْ أَخَذَ مِنَ الأَعْطِيَةِ الزَّكَاةَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ ‏.‏ قَالَ مَالِكٌ ‏:‏ السُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا عِنْدَنَا أَنَّ الزَّكَاةَ تَجِبُ فِي عِشْرِينَ دِينَارًا عَيْنًا كَمَا تَجِبُ فِي مِائَتَىْ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ ‏:‏ لَيْسَ فِي عِشْرِينَ دِينَارًا نَاقِصَةً بَيِّنَةَ النُّقْصَانِ زَكَاةٌ، فَإِنْ زَادَتْ حَتَّى تَبْلُغَ بِزِيَادَتِهَا عِشْرِينَ دِينَارًا وَازِنَةً فَفِيهَا الزَّكَاةُ، وَلَيْسَ فِيمَا دُونَ عِشْرِينَ دِينَارًا عَيْنًا الزَّكَاةُ، وَلَيْسَ فِي مِائَتَىْ دِرْهَمٍ نَاقِصَةً بَيِّنَةَ النُّقْصَانِ زَكَاةٌ، فَإِنْ زَادَتْ حَتَّى تَبْلُغَ بِزِيَادَتِهَا مِائَتَىْ دِرْهَمٍ وَافِيةً فَفِيهَا الزَّكَاةُ، فَإِنْ كَانَتْ تَجُوزُ بِجَوَازِ الْوَازِنَةِ رَأَيْتُ فِيهَا الزَّكَاةَ دَنَانِيرَ كَانَتْ أَوْ دَرَاهِمَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ عِنْدَهُ سِتُّونَ وَمِائَةُ دِرْهَمٍ وَازِنَةً وَصَرْفُ الدَّرَاهِمِ بِبَلَدِهِ ثَمَانِيَةُ دَرَاهِمَ بِدِينَارٍ ‏:‏ أَنَّهَا لاَ تَجِبُ فِيهَا الزَّكَاةُ، وَإِنَّمَا تَجِبُ الزَّكَاةُ فِي عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ خَمْسَةُ دَنَانِيرَ مِنْ فَائِدَةٍ أَوْ غَيْرِهَا، فَتَجَرَ فِيهَا فَلَمْ يَأْتِ الْحَوْلُ حَتَّى بَلَغَتْ مَا تَجِبُ فِيهِ الزَّكَاةُ ‏:‏ أَنَّهُ يُزَكِّيهَا وَإِنْ لَمْ تَتِمَّ إِلاَّ قَبْلَ أَنْ يَحُولَ عَلَيْهَا الْحَوْلُ بِيَوْمٍ وَاحِدٍ، أَوْ بَعْدَ مَا يَحُولُ عَلَيْهَا الْحَوْلُ بِيَوْمٍ وَاحِدٍ، ثُمَّ لاَ زَكَاةَ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ زُكِّيَتْ ‏.‏ وَقَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ عَشَرَةُ دَنَانِيرَ فَتَجَرَ فِيهَا فَحَالَ عَلَيْهَا الْحَوْلُ وَقَدْ بَلَغَتْ عِشْرِينَ دِينَارًا ‏:‏ أَنَّهُ يُزَكِّيهَا مَكَانَهَا وَلاَ يَنْتَظِرُ بِهَا أَنْ يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ بَلَغَتْ مَا تَجِبُ فِيهِ الزَّكَاةُ لِأَنَّ الْحَوْلَ قَدْ حَالَ عَلَيْهَا وَهِيَ عِنْدَهُ عِشْرُونَ ثُمَّ لَا زَكَاةَ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ زُكِّيَتْ قَالَ مَالِك الْأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي إِجَارَةِ الْعَبِيدِ وَخَرَاجِهِمْ وَكِرَاءِ الْمَسَاكِينِ وَكِتَابَةِ الْمُكَاتَبِ أَنَّهُ لَا تَجِبُ فِي شَيْءٍ مِنْ ذَلِكَ الزَّكَاةُ قَلَّ ذَلِكَ أَوْ كَثُرَ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمِ يَقْبِضُهُ صَاحِبُهُ. وَقَالَ مَالِك فِي الذَّهَبِ وَالْوَرِقِ يَكُونُ بَيْنَ الشُّرَكَاءِ إِنَّ مَنْ بَلَغَتْ حِصَّتُهُ مِنْهُمْ عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَيْ دِرْهَمٍ فَعَلَيْهِ فِيهَا الزَّكَاةُ وَمَنْ نَقَصَتْ حِصَّتُهُ عَمَّا تَجِبُ فِيهِ الزَّكَاةُ فَلَا زَكَاةَ عَلَيْهِ وَإِنْ بَلَغَتْ حِصَصُهُمْ جَمِيعًا مَا تَجِبُ فِيهِ الزَّكَاةُ وَكَانَ بَعْضُهُمْ فِي ذَلِكَ أَفْضَلَ نَصِيبًا مِنْ بَعْضٍ أُخِذَ مِنْ كُلِّ إِنْسَانٍ مِنْهُمْ بِقَدْرِ حِصَّتِهِ إِذَا كَانَ فِي حِصَّةِ كُلِّ إِنْسَانٍ مِنْهُمْ مَا تَجِبُ فِيهِ الزَّكَاةُ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ قَالَ مَالِك وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ قَالَ مَالِك وَإِذَا كَانَتْ لِرَجُلٍ ذَهَبٌ أَوْ وَرِقٌ مُتَفَرِّقَةٌ بِأَيْدِي أُنَاسٍ شَتَّى فَإِنَّهُ يَنْبَغِي لَهُ أَنْ يُحْصِيَهَا جَمِيعًا ثُمَّ يُخْرِجَ مَا وَجَبَ عَلَيْهِ مِنْ زَكَاتِهَا كُلِّهَا قَالَ مَالِك وَمَنْ أَفَادَ ذَهَبًا أَوْ وَرِقًا إِنَّهُ لَا زَكَاةَ عَلَيْهِ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 584
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ غَيْرِ، وَاحِدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ لِبِلاَلِ بْنِ الْحَارِثِ الْمُزَنِيِّ مَعَادِنَ الْقَبَلِيَّةِ - وَهِيَ مِنْ نَاحِيَةِ الْفُرْعِ - فَتِلْكَ الْمَعَادِنُ لاَ يُؤْخَذُ مِنْهَا إِلَى الْيَوْمِ إِلاَّ الزَّكَاةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 585
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 586
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَلِي بَنَاتِ أَخِيهَا يَتَامَى فِي حَجْرِهَا لَهُنَّ الْحَلْىُ فَلاَ تُخْرِجُ مِنْ حُلِيِّهِنَّ الزَّكَاةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 587
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُحَلِّي بَنَاتِهُ وَجَوَارِيَهُ الذَّهَبَ ثُمَّ لاَ يُخْرِجُ مِنْ حُلِيِّهِنَّ الزَّكَاةَ ‏.‏ قَالَ مَالِكٌ مَنْ كَانَ عِنْدَهُ تِبْرٌ أَوْ حَلْىٌ مِنْ ذَهَبٍ أَوْ فِضَّةٍ لاَ يُنْتَفَعُ بِهِ لِلُبْسٍ فَإِنَّ عَلَيْهِ فِيهِ الزَّكَاةَ فِي كُلِّ عَامٍ يُوزَنُ فَيُؤْخَذُ رُبُعُ عُشْرِهِ إِلاَّ أَنْ يَنْقُصَ مِنْ وَزْنِ عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ فَإِنْ نَقَصَ مِنْ ذَلِكَ فَلَيْسَ فِيهِ زَكَاةٌ وَإِنَّمَا تَكُونُ فِيهِ الزَّكَاةُ إِذَا كَانَ إِنَّمَا يُمْسِكُهُ لِغَيْرِ اللُّبْسِ فَأَمَّا التِّبْرُ وَالْحُلِيُّ الْمَكْسُورُ الَّذِي يُرِيدُ أَهْلُهُ إِصْلاَحَهُ وَلُبْسَهُ فَإِنَّمَا هُوَ بِمَنْزِلَةِ الْمَتَاعِ الَّذِي يَكُونُ عِنْدَ أَهْلِهِ فَلَيْسَ عَلَى أَهْلِهِ فِيهِ زَكَاةٌ ‏.‏ قَالَ مَالِكٌ لَيْسَ فِي اللُّؤْلُؤِ وَلاَ فِي الْمِسْكِ وَلاَ الْعَنْبَرِ زَكَاةٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 588
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ اتَّجِرُوا فِي أَمْوَالِ الْيَتَامَى لاَ تَأْكُلُهَا الزَّكَاةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 589
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَتْ عَائِشَةُ تَلِينِي وَأَخًا لِي يَتِيمَيْنِ فِي حَجْرِهَا فَكَانَتْ تُخْرِجُ مِنْ أَمْوَالِنَا الزَّكَاةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 590
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُعْطِي أَمْوَالَ الْيَتَامَى الَّذِينَ فِي حَجْرِهَا مَنْ يَتَّجِرُ لَهُمْ فِيهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 591
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ اشْتَرَى لِبَنِي أَخِيهِ - يَتَامَى فِي حَجْرِهِ - مَالاً فَبِيعَ ذَلِكَ الْمَالُ بَعْدُ بِمَالٍ كَثِيرٍ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِالتِّجَارَةِ فِي أَمْوَالِ الْيَتَامَى لَهُمْ إِذَا كَانَ الْوَلِيُّ مَأْذُونًا فَلاَ أَرَى عَلَيْهِ ضَمَانًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 592
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَقُولُ هَذَا شَهْرُ زَكَاتِكُمْ فَمَنْ كَانَ عَلَيْهِ دَيْنٌ فَلْيُؤَدِّ دَيْنَهُ حَتَّى تَحْصُلَ أَمْوَالُكُمْ فَتُؤَدُّونَ مِنْهُ الزَّكَاةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 593
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ فِي مَالٍ قَبَضَهُ بَعْضُ الْوُلاَةِ ظُلْمًا يَأْمُرُ بِرَدِّهِ إِلَى أَهْلِهِ وَيُؤْخَذُ زَكَاتُهُ لِمَا مَضَى مِنَ السِّنِينَ ثُمَّ عَقَّبَ بَعْدَ ذَلِكَ بِكِتَابٍ أَنْ لاَ يُؤْخَذُ مِنْهُ إِلاَّ زَكَاةٌ وَاحِدَةٌ فَإِنَّهُ كَانَ ضِمَارًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 594
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّهُ سَأَلَ سُلَيْمَانَ بْنَ يَسَارٍ عَنْ رَجُلٍ، لَهُ مَالٌ وَعَلَيْهِ دَيْنٌ مِثْلُهُ أَعَلَيْهِ زَكَاةٌ فَقَالَ لاَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا فِي الدَّيْنِ أَنَّ صَاحِبَهُ لاَ يُزَكِّيهِ حَتَّى يَقْبِضَهُ وَإِنْ أَقَامَ عِنْدَ الَّذِي هُوَ عَلَيْهِ سِنِينَ ذَوَاتِ عَدَدٍ ثُمَّ قَبَضَهُ صَاحِبُهُ لَمْ تَجِبْ عَلَيْهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ فَإِنْ قَبَضَ مِنْهُ شَيْئًا لاَ تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ إِنْ كَانَ لَهُ مَالٌ سِوَى الَّذِي قُبِضَ تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكَّى مَعَ مَا قَبَضَ مِنْ دَيْنِهِ ذَلِكَ ‏.‏ قَالَ وَإِنْ لَمْ يَكُنْ لَهُ نَاضٌّ غَيْرُ الَّذِي اقْتَضَى مِنْ دَيْنِهِ وَكَانَ الَّذِي اقْتَضَى مِنْ دَيْنِهِ لاَ تَجِبُ فِيهِ الزَّكَاةُ فَلاَ زَكَاةَ عَلَيْهِ فِيهِ وَلَكِنْ لِيَحْفَظْ عَدَدَ مَا اقْتَضَى فَإِنِ اقْتَضَى بَعْدَ ذَلِكَ عَدَدَ مَا تَتِمُّ بِهِ الزَّكَاةُ مَعَ مَا قَبَضَ قَبْلَ ذَلِكَ فَعَلَيْهِ فِيهِ الزَّكَاةُ ‏.‏ قَالَ فَإِنْ كَانَ قَدِ اسْتَهْلَكَ مَا اقْتَضَى أَوَّلاً أَوْ لَمْ يَسْتَهْلِكْهُ فَالزَّكَاةُ وَاجِبَةٌ عَلَيْهِ مَعَ مَا اقْتَضَى مِنْ دَيْنِهِ فَإِذَا بَلَغَ مَا اقْتَضَى عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ فَعَلَيْهِ فِيهِ الزَّكَاةُ ثُمَّ مَا اقْتَضَى بَعْدَ ذَلِكَ مِنْ قَلِيلٍ أَوْ كَثِيرٍ فَعَلَيْهِ الزَّكَاةُ بِحَسَبِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالدَّلِيلُ عَلَى الدَّيْنِ يَغِيبُ أَعْوَامًا ثُمَّ يُقْتَضَى فَلاَ يَكُونُ فِيهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ أَنَّ الْعُرُوضَ تَكُونُ عِنْدَ الرَّجُلِ لِلتِّجَارَةِ أَعْوَامًا ثُمَّ يَبِيعُهَا فَلَيْسَ عَلَيْهِ فِي أَثْمَانِهَا إِلاَّ زَكَاةٌ وَاحِدَةٌ وَذَلِكَ أَنَّهُ لَيْسَ عَلَى صَاحِبِ الدَّيْنِ أَوِ الْعُرُوضِ أَنْ يُخْرِجَ زَكَاةَ ذَلِكَ الدَّيْنِ أَوِ الْعُرُوضِ مِنْ مَالٍ سِوَاهُ وَإِنَّمَا يُخْرِجُ زَكَاةَ كُلِّ شَىْءٍ مِنْهُ وَلاَ يُخْرِجُ الزَّكَاةَ مِنْ شَىْءٍ عَنْ شَىْءٍ غَيْرِهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يَكُونُ عَلَيْهِ دَيْنٌ وَعِنْدَهُ مِنَ الْعُرُوضِ مَا فِيهِ وَفَاءٌ لِمَا عَلَيْهِ مِنَ الدَّيْنِ وَيَكُونُ عِنْدَهُ مِنَ النَّاضِّ سِوَى ذَلِكَ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكِّي مَا بِيَدِهِ مِنْ نَاضٍّ تَجِبُ فِيهِ الزَّكَاةُ وَإِنْ لَمْ يَكُنْ عِنْدَهُ مِنَ الْعُرُوضِ وَالنَّقْدِ إِلاَّ وَفَاءُ دَيْنِهِ فَلاَ زَكَاةَ عَلَيْهِ حَتَّى يَكُونَ عِنْدَهُ مِنَ النَّاضِّ فَضْلٌ عَنْ دَيْنِهِ مَا تَجِبُ فِيهِ الزَّكَاةُ فَعَلَيْهِ أَنْ يُزَكِّيَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 595
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ زُرَيْقِ بْنِ حَيَّانَ، - وَكَانَ زُرَيْقٌ عَلَى جَوَازِ مِصْرَ فِي زَمَانِ الْوَلِيدِ وَسُلَيْمَانَ وَعُمَرَ بْنِ عَبْدِ الْعَزِيزِ - فَذَكَرَ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَيْهِ أَنِ انْظُرْ مَنْ مَرَّ بِكَ مِنَ الْمُسْلِمِينَ فَخُذْ مِمَّا ظَهَرَ مِنْ أَمْوَالِهِمْ مِمَّا يُدِيرُونَ مِنَ التِّجَارَاتِ مِنْ كُلِّ أَرْبَعِينَ دِينَارًا دِينَارًا فَمَا نَقَصَ فَبِحِسَابِ ذَلِكَ حَتَّى يَبْلُغَ عِشْرِينَ دِينَارًا فَإِنْ نَقَصَتْ ثُلُثَ دِينَارٍ فَدَعْهَا وَلاَ تَأْخُذْ مِنْهَا شَيْئًا وَمَنْ مَرَّ بِكَ مِنْ أَهْلِ الذِّمَّةِ فَخُذْ مِمَّا يُدِيرُونَ مِنَ التِّجَارَاتِ مِنْ كُلِّ عِشْرِينَ دِينَارًا دِينَارًا فَمَا نَقَصَ فَبِحِسَابِ ذَلِكَ حَتَّى يَبْلُغَ عَشَرَةَ دَنَانِيرَ فَإِنْ نَقَصَتْ ثُلُثَ دِينَارٍ فَدَعْهَا وَلاَ تَأْخُذْ مِنْهَا شَيْئًا وَاكْتُبْ لَهُمْ بِمَا تَأْخُذُ مِنْهُمْ كِتَابًا إِلَى مِثْلِهِ مِنَ الْحَوْلِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَا يُدَارُ مِنَ الْعُرُوضِ لِلتِّجَارَاتِ أَنَّ الرَّجُلَ إِذَا صَدَّقَ مَالَهُ ثُمَّ اشْتَرَى بِهِ عَرْضًا بَزًّا أَوْ رَقِيقًا أَوْ مَا أَشْبَهَ ذَلِكَ ثُمَّ بَاعَهُ قَبْلَ أَنْ يَحُولَ عَلَيْهِ الْحَوْلُ فَإِنَّهُ لاَ يُؤَدِّي مِنْ ذَلِكَ الْمَالِ زَكَاةً حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمَ صَدَّقَهُ وَأَنَّهُ إِنْ لَمْ يَبِعْ ذَلِكَ الْعَرْضَ سِنِينَ لَمْ يَجِبْ عَلَيْهِ فِي شَىْءٍ مِنْ ذَلِكَ الْعَرْضِ زَكَاةٌ وَإِنْ طَالَ زَمَانُهُ فَإِذَا بَاعَهُ فَلَيْسَ فِيهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يَشْتَرِي بِالذَّهَبِ أَوِ الْوَرِقِ حِنْطَةً أَوْ تَمْرًا أَوْ غَيْرَهُمَا لِلتِّجَارَةِ ثُمَّ يُمْسِكُهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ ثُمَّ يَبِيعُهَا أَنَّ عَلَيْهِ فِيهَا الزَّكَاةَ حِينَ يَبِيعُهَا إِذَا بَلَغَ ثَمَنُهَا مَا تَجِبُ فِيهِ الزَّكَاةُ وَلَيْسَ ذَلِكَ مِثْلَ الْحَصَادِ يَحْصُدُهُ الرَّجُلُ مِنْ أَرْضِهِ وَلاَ مِثْلَ الْجِدَادِ ‏.‏ قَالَ مَالِكٌ وَمَا كَانَ مِنْ مَالٍ عِنْدَ رَجُلٍ يُدِيرُهُ لِلتِّجَارَةِ وَلاَ يَنِضُّ لِصَاحِبِهِ مِنْهُ شَىْءٌ تَجِبُ عَلَيْهِ فِيهِ الزَّكَاةُ فَإِنَّهُ يَجْعَلُ لَهُ شَهْرًا مِنَ السَّنَةِ يُقَوِّمُ فِيهِ مَا كَانَ عِنْدَهُ مِنْ عَرْضٍ لِلتِّجَارَةِ وَيُحْصِي فِيهِ مَا كَانَ عِنْدَهُ مِنْ نَقْدٍ أَوْ عَيْنٍ فَإِذَا بَلَغَ ذَلِكَ كُلُّهُ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكِّيهِ ‏.‏ وَقَالَ مَالِكٌ وَمَنْ تَجَرَ مِنَ الْمُسْلِمِينَ وَمَنْ لَمْ يَتْجُرْ سَوَاءٌ لَيْسَ عَلَيْهِمْ إِلاَّ صَدَقَةٌ وَاحِدَةٌ فِي كُلِّ عَامٍ تَجَرُوا فِيهِ أَوْ لَمْ يَتْجُرُوا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 596
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَهُوَ يُسْأَلُ عَنِ الْكَنْزِ، مَا هُوَ فَقَالَ هُوَ الْمَالُ الَّذِي لاَ تُؤَدَّى مِنْهُ الزَّكَاةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 597
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ مَنْ كَانَ عِنْدَهُ مَالٌ لَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يَطْلُبُهُ حَتَّى يُمْكِنَهُ يَقُولُ أَنَا كَنْزُكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 598
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ قَرَأَ كِتَابَ عُمَرَ بْنِ الْخَطَّابِ فِي الصَّدَقَةِ قَالَ فَوَجَدْتُ فِيهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ كِتَابُ الصَّدَقَةِ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ الإِبِلِ فَدُونَهَا الْغَنَمُ فِي كُلِّ خَمْسٍ شَاةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَثَلاَثِينَ ابْنَةُ مَخَاضٍ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَأَرْبَعِينَ بِنْتُ لَبُونٍ وَفِيمَا فَوْقَ ذَلِكَ إِلَى سِتِّينَ حِقَّةٌ طَرُوقَةُ الْفَحْلِ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَسَبْعِينَ جَذَعَةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى تِسْعِينَ ابْنَتَا لَبُونٍ وَفِيمَا فَوْقَ ذَلِكَ إِلَى عِشْرِينَ وَمِائَةٍ حِقَّتَانِ طَرُوقَتَا الْفَحْلِ فَمَا زَادَ عَلَى ذَلِكَ مِنَ الإِبِلِ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ وَفِي سَائِمَةِ الْغَنَمِ إِذَا بَلَغَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةٍ شَاةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى مِائَتَيْنِ شَاتَانِ وَفِيمَا فَوْقَ ذَلِكَ إِلَى ثَلاَثِمِائَةٍ ثَلاَثُ شِيَاهٍ فَمَا زَادَ عَلَى ذَلِكَ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلاَ يُخْرَجُ فِي الصَّدَقَةِ تَيْسٌ وَلاَ هَرِمَةٌ وَلاَ ذَاتُ عَوَارٍ إِلاَّ مَا شَاءَ الْمُصَّدِّقُ وَلاَ يُجْمَعُ بَيْنَ مُفْتَرِقٍ وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَفِي الرِّقَةِ إِذَا بَلَغَتْ خَمْسَ أَوَاقٍ رُبُعُ الْعُشْرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 599
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ طَاوُسٍ الْيَمَانِيِّ، أَنَّ مُعَاذَ بْنَ جَبَلٍ الأَنْصَارِيَّ، أَخَذَ مِنْ ثَلاَثِينَ بَقَرَةً تَبِيعًا وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً وَأُتِيَ بِمَا دُونَ ذَلِكَ فَأَبَى أَنْ يَأْخُذَ مِنْهُ شَيْئًا وَقَالَ لَمْ أَسْمَعْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهِ شَيْئًا حَتَّى أَلْقَاهُ فَأَسْأَلَهُ ‏.‏ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَقْدُمَ مُعَاذُ بْنُ جَبَلٍ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِيمَنْ كَانَتْ لَهُ غَنَمٌ عَلَى رَاعِيَيْنِ مُفْتَرِقَيْنِ أَوْ عَلَى رِعَاءٍ مُفْتَرِقِينَ فِي بُلْدَانٍ شَتَّى أَنَّ ذَلِكَ يُجْمَعُ كُلُّهُ عَلَى صَاحِبِهِ فَيُؤَدِّي مِنْهُ صَدَقَتَهُ وَمِثْلُ ذَلِكَ الرَّجُلُ يَكُونُ لَهُ الذَّهَبُ أَوِ الْوَرِقُ مُتَفَرِّقَةً فِي أَيْدِي نَاسٍ شَتَّى أَنَّهُ يَنْبَغِي لَهُ أَنْ يَجْمَعَهَا فَيُخْرِجَ مِنْهَا مَا وَجَبَ عَلَيْهِ فِي ذَلِكَ مِنْ زَكَاتِهَا ‏.‏ وَقَالَ يَحْيَى قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ الضَّأْنُ وَالْمَعْزُ أَنَّهَا تُجْمَعُ عَلَيْهِ فِي الصَّدَقَةِ فَإِنْ كَانَ فِيهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ صُدِّقَتْ وَقَالَ إِنَّمَا هِيَ غَنَمٌ كُلُّهَا وَفِي كِتَابِ عُمَرَ بْنِ الْخَطَّابِ وَفِي سَائِمَةِ الْغَنَمِ إِذَا بَلَغَتْ أَرْبَعِينَ شَاةً شَاةٌ ‏.‏ قَالَ مَالِكٌ فَإِنْ كَانَتِ الضَّأْنُ هِيَ أَكْثَرَ مِنَ الْمَعْزِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ شَاةٌ وَاحِدَةٌ أَخَذَ الْمُصَدِّقُ تِلْكَ الشَّاةَ الَّتِي وَجَبَتْ عَلَى رَبِّ الْمَالِ مِنَ الضَّأْنِ وَإِنْ كَانَتِ الْمَعْزُ أَكْثَرَ مِنَ الضَّأْنِ أُخِذَ مِنْهَا فَإِنِ اسْتَوَى الضَّأْنُ وَالْمَعْزُ أَخَذَ الشَّاةَ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَكَذَلِكَ الإِبِلُ الْعِرَابُ وَالْبُخْتُ يُجْمَعَانِ عَلَى رَبِّهِمَا فِي الصَّدَقَةِ ‏.‏ وَقَالَ إِنَّمَا هِيَ إِبِلٌ كُلُّهَا فَإِنْ كَانَتِ الْعِرَابُ هِيَ أَكْثَرَ مِنَ الْبُخْتِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ بَعِيرٌ وَاحِدٌ فَلْيَأْخُذْ مِنَ الْعِرَابِ صَدَقَتَهَا فَإِنْ كَانَتِ الْبُخْتُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْبَقَرُ وَالْجَوَامِيسُ تُجْمَعُ فِي الصَّدَقَةِ عَلَى رَبِّهَا ‏.‏ وَقَالَ إِنَّمَا هِيَ بَقَرٌ كُلُّهَا فَإِنْ كَانَتِ الْبَقَرُ هِيَ أَكْثَرَ مِنَ الْجَوَامِيسِ وَلاَ تَجِبُ عَلَى رَبِّهَا إِلاَّ بَقَرَةٌ وَاحِدَةٌ فَلْيَأْخُذْ مِنَ الْبَقَرِ صَدَقَتَهُمَا وَإِنْ كَانَتِ الْجَوَامِيسُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ فَإِذَا وَجَبَتْ فِي ذَلِكَ الصَّدَقَةُ صُدِّقَ الصِّنْفَانِ جَمِيعًا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَفَادَ مَاشِيَةً مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلاَ صَدَقَةَ عَلَيْهِ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا إِلاَّ أَنْ يَكُونَ لَهُ قَبْلَهَا نِصَابُ مَاشِيَةٍ وَالنِّصَابُ مَا تَجِبُ فِيهِ الصَّدَقَةُ إِمَّا خَمْسُ ذَوْدٍ مِنَ الإِبِلِ وَإِمَّا ثَلاَثُونَ بَقَرَةً وَإِمَّا أَرْبَعُونَ شَاةً فَإِذَا كَانَ لِلرَّجُلِ خَمْسُ ذَوْدٍ مِنَ الإِبِلِ أَوْ ثَلاَثُونَ بَقَرَةً أَوْ أَرْبَعُونَ شَاةً ثُمَّ أَفَادَ إِلَيْهَا إِبِلاً أَوْ بَقَرًا أَوْ غَنَمًا بِاشْتِرَاءٍ أَوْ هِبَةٍ أَوْ مِيرَاثٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا وَإِنْ لَمْ يَحُلْ عَلَى الْفَائِدَةِ الْحَوْلُ وَإِنْ كَانَ مَا أَفَادَ مِنَ الْمَاشِيَةِ إِلَى مَاشِيَتِهِ قَدْ صُدِّقَتْ قَبْلَ أَنْ يَشْتَرِيَهَا بِيَوْمٍ وَاحِدٍ أَوْ قَبْلَ أَنْ يَرِثَهَا بِيَوْمٍ وَاحِدٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُ مَاشِيَتَهُ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ الْوَرِقِ يُزَكِّيهَا الرَّجُلُ ثُمَّ يَشْتَرِي بِهَا مِنْ رَجُلٍ آخَرَ عَرْضًا وَقَدْ وَجَبَتْ عَلَيْهِ فِي عَرْضِهِ ذَلِكَ إِذَا بَاعَهُ الصَّدَقَةُ فَيُخْرِجُ الرَّجُلُ الآخَرُ صَدَقَتَهَا هَذَا الْيَوْمَ وَيَكُونُ الآخَرُ قَدْ صَدَّقَهَا مِنَ الْغَدِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ غَنَمٌ لاَ تَجِبُ فِيهَا الصَّدَقَةُ فَاشْتَرَى إِلَيْهَا غَنَمًا كَثِيرَةً تَجِبُ فِي دُونِهَا الصَّدَقَةُ أَوْ وَرِثَهَا أَنَّهُ لاَ تَجِبُ عَلَيْهِ فِي الْغَنَمِ كُلِّهَا الصَّدَقَةُ حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا بِاشْتِرَاءٍ أَوْ مِيرَاثٍ وَذَلِكَ أَنَّ كُلَّ مَا كَانَ عِنْدَ الرَّجُلِ مِنْ مَاشِيَةٍ لاَ تَجِبُ فِيهَا الصَّدَقَةُ مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلَيْسَ يُعَدُّ ذَلِكَ نِصَابَ مَالٍ حَتَّى يَكُونَ فِي كُلِّ صِنْفٍ مِنْهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ فَذَلِكَ النِّصَابُ الَّذِي يُصَدِّقُ مَعَهُ مَا أَفَادَ إِلَيْهِ صَاحِبُهُ مِنْ قَلِيلٍ أَوْ كَثِيرٍ مِنَ الْمَاشِيَةِ ‏.‏ قَالَ مَالِكٌ وَلَوْ كَانَتْ لِرَجُلٍ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ تَجِبُ فِي كُلِّ صِنْفٍ مِنْهَا الصَّدَقَةُ ثُمَّ أَفَادَ إِلَيْهَا بَعِيرًا أَوْ بَقَرَةً أَوْ شَاةً صَدَّقَهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي هَذَا ‏.‏ قَالَ مَالِكٌ فِي الْفَرِيضَةِ تَجِبُ عَلَى الرَّجُلِ فَلاَ تُوجَدُ عِنْدَهُ أَنَّهَا إِنْ كَانَتِ ابْنَةَ مَخَاضٍ فَلَمْ تُوجَدْ أُخِذَ مَكَانَهَا ابْنُ لَبُونٍ ذَكَرٌ وَإِنْ كَانَتْ بِنْتَ لَبُونٍ أَوْ حِقَّةً أَوْ جَذَعَةً وَلَمْ يَكُنْ عِنْدَهُ كَانَ عَلَى رَبِّ الإِبِلِ أَنْ يَبْتَاعَهَا لَهُ حَتَّى يَأْتِيَهُ بِهَا وَلاَ أُحِبُّ أَنْ يُعْطِيَهُ قِيمَتَهَا ‏.‏ وَقَالَ مَالِكٌ فِي الإِبِلِ النَّوَاضِحِ وَالْبَقَرِ السَّوَانِي وَبَقَرِ الْحَرْثِ إِنِّي أَرَى أَنْ يُؤْخَذَ مِنْ ذَلِكَ كُلِّهِ إِذَا وَجَبَتْ فِيهِ الصَّدَقَةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 600
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنِ ابْنٍ لِعَبْدِ اللَّهِ بْنِ سُفْيَانَ الثَّقَفِيِّ، عَنْ جَدِّهِ، سُفْيَانَ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَعَثَهُ مُصَدِّقًا فَكَانَ يَعُدُّ عَلَى النَّاسِ بِالسَّخْلِ فَقَالُوا أَتَعُدُّ عَلَيْنَا بِالسَّخْلِ وَلاَ تَأْخُذُ مِنْهُ شَيْئًا ‏.‏ فَلَمَّا قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ ذَكَرَ لَهُ ذَلِكَ فَقَالَ عُمَرُ نَعَمْ تَعُدُّ عَلَيْهِمْ بِالسَّخْلَةِ يَحْمِلُهَا الرَّاعِي وَلاَ تَأْخُذُهَا وَلاَ تَأْخُذُ الأَكُولَةَ وَلاَ الرُّبَّى وَلاَ الْمَاخِضَ وَلاَ فَحْلَ الْغَنَمِ وَتَأْخُذُ الْجَذَعَةَ وَالثَّنِيَّةَ وَذَلِكَ عَدْلٌ بَيْنَ غِذَاءِ الْغَنَمِ وَخِيَارِهِ ‏.‏ قَالَ مَالِكٌ وَالسَّخْلَةُ الصَّغِيرَةُ حِينَ تُنْتَجُ ‏.‏ وَالرُّبَّى الَّتِي قَدْ وَضَعَتْ فَهِيَ تُرَبِّي وَلَدَهَا ‏.‏ وَالْمَاخِضُ هِيَ الْحَامِلُ ‏.‏ وَالأَكُولَةُ هِيَ شَاةُ اللَّحْمِ الَّتِي تُسَمَّنُ لِتُؤْكَلَ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ تَكُونُ لَهُ الْغَنَمُ لاَ تَجِبُ فِيهَا الصَّدَقَةُ فَتَوَالَدُ قَبْلَ أَنْ يَأْتِيَهَا الْمُصَدِّقُ بِيَوْمٍ وَاحِدٍ فَتَبْلُغُ مَا تَجِبُ فِيهِ الصَّدَقَةُ بِوِلاَدَتِهَا قَالَ مَالِكٌ إِذَا بَلَغَتِ الْغَنَمُ بِأَوْلاَدِهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ فَعَلَيْهِ فِيهَا الصَّدَقَةُ وَذَلِكَ أَنَّ وِلاَدَةَ الْغَنَمِ مِنْهَا وَذَلِكَ مُخَالِفٌ لِمَا أُفِيدَ مِنْهَا بِاشْتِرَاءٍ أَوْ هِبَةٍ أَوْ مِيرَاثٍ وَمِثْلُ ذَلِكَ الْعَرْضُ لاَ يَبْلُغُ ثَمَنُهُ مَا تَجِبُ فِيهِ الصَّدَقَةُ ثُمَّ يَبِيعُهُ صَاحِبُهُ فَيَبْلُغُ بِرِبْحِهِ مَا تَجِبُ فِيهِ الصَّدَقَةُ فَيُصَدِّقُ رِبْحَهُ مَعَ رَأْسِ الْمَالِ وَلَوْ كَانَ رِبْحُهُ فَائِدَةً أَوْ مِيرَاثًا لَمْ تَجِبْ فِيهِ الصَّدَقَةُ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمَ أَفَادَهُ أَوْ وَرِثَهُ ‏.‏ قَالَ مَالِكٌ فَغِذَاءُ الْغَنَمِ مِنْهَا كَمَا رِبْحُ الْمَالِ مِنْهُ غَيْرَ أَنَّ ذَلِكَ يَخْتَلِفُ فِي وَجْهٍ آخَرَ أَنَّهُ إِذَا كَانَ لِلرَّجُلِ مِنَ الذَّهَبِ أَوِ الْوَرِقِ مَا تَجِبُ فِيهِ الزَّكَاةُ ثُمَّ أَفَادَ إِلَيْهِ مَالاً تَرَكَ مَالَهُ الَّذِي أَفَادَ فَلَمْ يُزَكِّهِ مَعَ مَالِهِ الأَوَّلِ حِينَ يُزَكِّيهِ حَتَّى يَحُولَ عَلَى الْفَائِدَةِ الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا وَلَوْ كَانَتْ لِرَجُلٍ غَنَمٌ أَوْ بَقَرٌ أَوْ إِبِلٌ تَجِبُ فِي كُلِّ صِنْفٍ مِنْهَا الصَّدَقَةُ ثُمَّ أَفَادَ إِلَيْهَا بَعِيرًا أَوْ بَقَرَةً أَوْ شَاةً صَدَّقَهَا مَعَ صِنْفِ مَا أَفَادَ مِنْ ذَلِكَ حِينَ يُصَدِّقُهُ إِذَا كَانَ عِنْدَهُ مِنْ ذَلِكَ الصِّنْفِ الَّذِي أَفَادَ نِصَابُ مَاشِيَةٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 601
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مُرَّ عَلَى عُمَرَ بْنِ الْخَطَّابِ بِغَنَمٍ مِنَ الصَّدَقَةِ فَرَأَى فِيهَا شَاةً حَافِلاً ذَاتَ ضَرْعٍ عَظِيمٍ فَقَالَ عُمَرُ مَا هَذِهِ الشَّاةُ فَقَالُوا شَاةٌ مِنَ الصَّدَقَةِ ‏.‏ فَقَالَ عُمَرُ مَا أَعْطَى هَذِهِ أَهْلُهَا وَهُمْ طَائِعُونَ لاَ تَفْتِنُوا النَّاسَ لاَ تَأْخُذُوا حَزَرَاتِ الْمُسْلِمِينَ نَكِّبُوا عَنِ الطَّعَامِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 602
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّهُ قَالَ أَخْبَرَنِي رَجُلاَنِ، مِنْ أَشْجَعَ أَنَّ مُحَمَّدَ بْنَ مَسْلَمَةَ الأَنْصَارِيَّ، كَانَ يَأْتِيهِمْ مُصَدِّقًا فَيَقُولُ لِرَبِّ الْمَالِ أَخْرِجْ إِلَىَّ صَدَقَةَ مَالِكَ ‏.‏ فَلاَ يَقُودُ إِلَيْهِ شَاةً فِيهَا وَفَاءٌ مِنْ حَقِّهِ إِلاَّ قَبِلَهَا ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا - وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا - أَنَّهُ لاَ يُضَيَّقُ عَلَى الْمُسْلِمِينَ فِي زَكَاتِهِمْ وَأَنْ يُقْبَلَ مِنْهُمْ مَا دَفَعُوا مِنْ أَمْوَالِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 603
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": 604,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلاَّ لِخَمْسَةٍ لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ لَهُ جَارٌ مِسْكِينٌ فَتُصُدِّقَ عَلَى الْمِسْكِينِ فَأَهْدَى الْمِسْكِينُ لِلْغَنِيِّ ‏\"‏ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي قَسْمِ الصَّدَقَاتِ أَنَّ ذَلِكَ لاَ يَكُونُ إِلاَّ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الْوَالِي فَأَىُّ الأَصْنَافِ كَانَتْ فِيهِ الْحَاجَةُ وَالْعَدَدُ أُوثِرَ ذَلِكَ الصِّنْفُ بِقَدْرِ مَا يَرَى الْوَالِي وَعَسَى أَنْ يَنْتَقِلَ ذَلِكَ إِلَى الصِّنْفِ الآخَرِ بَعْدَ عَامٍ أَوْ عَامَيْنِ أَوْ أَعْوَامٍ فَيُؤْثَرُ أَهْلُ الْحَاجَةِ وَالْعَدَدِ حَيْثُمَا كَانَ ذَلِكَ وَعَلَى هَذَا أَدْرَكْتُ مَنْ أَرْضَى مِنْ أَهْلِ الْعِلْمِ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِلْعَامِلِ عَلَى الصَّدَقَاتِ فَرِيضَةٌ مُسَمَّاةٌ إِلاَّ عَلَى قَدْرِ مَا يَرَى الإِمَامُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 604
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": 605,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، قَالَ لَوْ مَنَعُونِي عِقَالاً لَجَاهَدْتُهُمْ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 605
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ شَرِبَ عُمَرُ بْنُ الْخَطَّابِ لَبَنًا فَأَعْجَبَهُ فَسَأَلَ الَّذِي سَقَاهُ مِنْ أَيْنَ هَذَا اللَّبَنُ فَأَخْبَرَهُ أَنَّهُ وَرَدَ عَلَى مَاءٍ - قَدْ سَمَّاهُ - فَإِذَا نَعَمٌ مِنْ نَعَمِ الصَّدَقَةِ وَهُمْ يَسْقُونَ فَحَلَبُوا لِي مِنْ أَلْبَانِهَا فَجَعَلْتُهُ فِي سِقَائِي فَهُوَ هَذَا ‏.‏ فَأَدْخَلَ عُمَرُ بْنُ الْخَطَّابِ يَدَهُ فَاسْتَقَاءَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ كُلَّ مَنْ مَنَعَ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ عَزَّ وَجَلَّ فَلَمْ يَسْتَطِعِ الْمُسْلِمُونَ أَخْذَهَا كَانَ حَقًّا عَلَيْهِمْ جِهَادُهُ حَتَّى يَأْخُذُوهَا مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 606
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": 607,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَامِلاً، لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ كَتَبَ إِلَيْهِ يَذْكُرُ أَنَّ رَجُلاً مَنَعَ زَكَاةَ مَالِهِ فَكَتَبَ إِلَيْهِ عُمَرُ أَنْ دَعْهُ وَلاَ تَأْخُذْ مِنْهُ زَكَاةً مَعَ الْمُسْلِمِينَ قَالَ فَبَلَغَ ذَلِكَ الرَّجُلَ فَاشْتَدَّ عَلَيْهِ وَأَدَّى بَعْدَ ذَلِكَ زَكَاةَ مَالِهِ فَكَتَبَ عَامِلُ عُمَرَ إِلَيْهِ يَذْكُرُ لَهُ ذَلِكَ فَكَتَبَ إِلَيْهِ عُمَرُ أَنْ خُذْهَا مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 607
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": 608,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ وَالْبَعْلِ الْعُشْرُ وَفِيمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 608
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ لاَ يُؤْخَذُ فِي صَدَقَةِ النَّخْلِ الْجُعْرُورُ وَلاَ مُصْرَانُ الْفَارَةِ وَلاَ عَذْقُ ابْنِ حُبَيْقٍ ‏.‏ قَالَ وَهُوَ يُعَدُّ عَلَى صَاحِبِ الْمَالِ وَلاَ يُؤْخَذُ مِنْهُ فِي الصَّدَقَةِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا مِثْلُ ذَلِكَ الْغَنَمُ تُعَدُّ عَلَى صَاحِبِهَا بِسِخَالِهَا وَالسَّخْلُ لاَ يُؤْخَذُ مِنْهُ فِي الصَّدَقَةِ وَقَدْ يَكُونُ فِي الأَمْوَالِ ثِمَارٌ لاَ تُؤْخَذُ الصَّدَقَةُ مِنْهَا مِنْ ذَلِكَ الْبُرْدِيُّ وَمَا أَشْبَهَهُ لاَ يُؤْخَذُ مِنْ أَدْنَاهُ كَمَا لاَ يُؤْخَذُ مِنْ خِيَارِهِ ‏.‏ قَالَ وَإِنَّمَا تُؤْخَذُ الصَّدَقَةُ مِنْ أَوْسَاطِ الْمَالِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ يُخْرَصُ مِنَ الثِّمَارِ إِلاَّ النَّخِيلُ وَالأَعْنَابُ فَإِنَّ ذَلِكَ يُخْرَصُ حِينَ يَبْدُو صَلاَحُهُ وَيَحِلُّ بَيْعُهُ وَذَلِكَ أَنَّ ثَمَرَ النَّخِيلِ وَالأَعْنَابِ يُؤْكَلُ رُطَبًا وَعِنَبًا فَيُخْرَصُ عَلَى أَهْلِهِ لِلتَّوْسِعَةِ عَلَى النَّاسِ وَلِئَلاَّ يَكُونَ عَلَى أَحَدٍ فِي ذَلِكَ ضِيقٌ فَيُخْرَصُ ذَلِكَ عَلَيْهِمْ ثُمَّ يُخَلَّى بَيْنَهُمْ وَبَيْنَهُ يَأْكُلُونَهُ كَيْفَ شَاءُوا ثُمَّ يُؤَدُّونَ مِنْهُ الزَّكَاةَ عَلَى مَا خُرِصَ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ فَأَمَّا مَا لاَ يُؤْكَلُ رَطْبًا وَإِنَّمَا يُؤْكَلُ بَعْدَ حَصَادِهِ مِنَ الْحُبُوبِ كُلِّهَا فَإِنَّهُ لاَ يُخْرَصُ وَإِنَّمَا عَلَى أَهْلِهَا فِيهَا إِذَا حَصَدُوهَا وَدَقُّوهَا وَطَيَّبُوهَا وَخَلُصَتْ حَبًّا فَإِنَّمَا عَلَى أَهْلِهَا فِيهَا الأَمَانَةُ يُؤَدُّونَ زَكَاتَهَا إِذَا بَلَغَ ذَلِكَ مَا تَجِبُ فِيهِ الزَّكَاةُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ النَّخْلَ يُخْرَصُ عَلَى أَهْلِهَا وَثَمَرُهَا فِي رُءُوسِهَا إِذَا طَابَ وَحَلَّ بَيْعُهُ وَيُؤْخَذُ مِنْهُ صَدَقَتُهُ تَمْرًا عِنْدَ الْجِدَادِ فَإِنْ أَصَابَتِ الثَّمَرَةَ جَائِحَةٌ بَعْدَ أَنْ تُخْرَصَ عَلَى أَهْلِهَا وَقَبْلَ أَنْ تُجَذَّ فَأَحَاطَتِ الْجَائِحَةُ بِالثَّمَرِ كُلِّهِ فَلَيْسَ عَلَيْهِمْ صَدَقَةٌ فَإِنْ بَقِيَ مِنَ الثَّمَرِ شَىْءٌ يَبْلُغُ خَمْسَةَ أَوْسُقٍ فَصَاعِدًا بِصَاعِ النَّبِيِّ صلى الله عليه وسلم أُخِذَ مِنْهُمْ زَكَاتُهُ وَلَيْسَ عَلَيْهِمْ فِيمَا أَصَابَتِ الْجَائِحَةُ زَكَاةٌ وَكَذَلِكَ الْعَمَلُ فِي الْكَرْمِ أَيْضًا وَإِذَا كَانَ لِرَجُلٍ قِطَعُ أَمْوَالٍ مُتَفَرِّقَةٌ أَوِ اشْتِرَاكٌ فِي أَمْوَالٍ مُتَفَرِّقَةٍ لاَ يَبْلُغُ مَالُ كُلِّ شَرِيكٍ أَوْ قِطَعُهُ مَا تَجِبُ فِيهِ الزَّكَاةُ وَكَانَتْ إِذَا جُمِعَ بَعْضُ ذَلِكَ إِلَى بَعْضٍ يَبْلُغَ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يَجْمَعُهَا وَيُؤَدِّي زَكَاتَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 609
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الزَّيْتُونِ، فَقَالَ فِيهِ الْعُشْرُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يُؤْخَذُ مِنَ الزَّيْتُونِ الْعُشْرُ بَعْدَ أَنْ يُعْصَرَ وَيَبْلُغَ زَيْتُونُهُ خَمْسَةَ أَوْسُقٍ فَمَا لَمْ يَبْلُغْ زَيْتُونُهُ خَمْسَةَ أَوْسُقٍ فَلاَ زَكَاةَ فِيهِ وَالزَّيْتُونُ بِمَنْزِلَةِ النَّخِيلِ مَا كَانَ مِنْهُ سَقَتْهُ السَّمَاءُ وَالْعُيُونُ أَوْ كَانَ بَعْلاً فَفِيهِ الْعُشْرُ وَمَا كَانَ يُسْقَى بِالنَّضْحِ فَفِيهِ نِصْفُ الْعُشْرِ وَلاَ يُخْرَصُ شَىْءٌ مِنَ الزَّيْتُونِ فِي شَجَرِهِ ‏.‏ وَالسُّنَّةُ عِنْدَنَا فِي الْحُبُوبِ الَّتِي يَدَّخِرُهَا النَّاسُ وَيَأْكُلُونَهَا أَنَّهُ يُؤْخَذُ مِمَّا سَقَتْهُ السَّمَاءُ مِنْ ذَلِكَ وَمَا سَقَتْهُ الْعُيُونُ وَمَا كَانَ بَعْلاً الْعُشْرُ وَمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ إِذَا بَلَغَ ذَلِكَ خَمْسَةَ أَوْسُقٍ بِالصَّاعِ الأَوَّلِ صَاعِ النَّبِيِّ صلى الله عليه وسلم وَمَا زَادَ عَلَى خَمْسَةِ أَوْسُقٍ فَفِيهِ الزَّكَاةُ بِحِسَابِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالْحُبُوبُ الَّتِي فِيهَا الزَّكَاةُ الْحِنْطَةُ وَالشَّعِيرُ وَالسُّلْتُ وَالذُّرَةُ وَالدُّخْنُ وَالأُرْزُ وَالْعَدَسُ وَالْجُلْبَانُ وَاللُّوبِيَا وَالْجُلْجُلاَنُ وَمَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ الَّتِي تَصِيرُ طَعَامًا فَالزَّكَاةُ تُؤْخَذُ مِنْهَا بَعْدَ أَنْ تُحْصَدَ وَتَصِيرَ حَبًّا ‏.‏ قَالَ وَالنَّاسُ مُصَدَّقُونَ فِي ذَلِكَ وَيُقْبَلُ مِنْهُمْ فِي ذَلِكَ مَا دَفَعُوا ‏.‏ وَسُئِلَ مَالِكٌ مَتَى يُخْرَجُ مِنَ الزَّيْتُونِ الْعُشْرُ أَوْ نِصْفُهُ أَقَبْلَ النَّفَقَةِ أَمْ بَعْدَهَا فَقَالَ لاَ يُنْظَرُ إِلَى النَّفَقَةِ وَلَكِنْ يُسْأَلُ عَنْهُ أَهْلُهُ كَمَا يُسْأَلُ أَهْلُ الطَّعَامِ عَنِ الطَّعَامِ وَيُصَدَّقُونَ بِمَا قَالُوا فَمَنْ رُفِعَ مِنْ زَيْتُونِهِ خَمْسَةُ أَوْسُقٍ فَصَاعِدًا أُخِذَ مِنْ زَيْتِهِ الْعُشْرُ بَعْدَ أَنْ يُعْصَرَ وَمَنْ لَمْ يُرْفَعْ مِنْ زَيْتُونِهِ خَمْسَةُ أَوْسُقٍ لَمْ تَجِبْ عَلَيْهِ فِي زَيْتِهِ الزَّكَاةُ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ زَرْعَهُ وَقَدْ صَلَحَ وَيَبِسَ فِي أَكْمَامِهِ فَعَلَيْهِ زَكَاتُهُ وَلَيْسَ عَلَى الَّذِي اشْتَرَاهُ زَكَاةٌ وَلاَ يَصْلُحُ بَيْعُ الزَّرْعِ حَتَّى يَيْبَسَ فِي أَكْمَامِهِ وَيَسْتَغْنِيَ عَنِ الْمَاءِ ‏.‏ قَالَ مَالِكٌ فِي قَوْلِ اللَّهِ تَعَالَى ‏{‏وَآتُوا حَقَّهُ يَوْمَ حَصَادِهِ ‏}‏ أَنَّ ذَلِكَ الزَّكَاةُ وَقَدْ سَمِعْتُ مَنْ يَقُولُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ أَصْلَ حَائِطِهِ أَوْ أَرْضَهُ وَفِي ذَلِكَ زَرْعٌ أَوْ ثَمَرٌ لَمْ يَبْدُ صَلاَحُهُ فَزَكَاةُ ذَلِكَ عَلَى الْمُبْتَاعِ وَإِنْ كَانَ قَدْ طَابَ وَحَلَّ بَيْعُهُ فَزَكَاةُ ذَلِكَ عَلَى الْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَهَا عَلَى الْمُبْتَاعِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 610
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فِي فَرَسِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 611
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ أَهْلَ الشَّامِ، قَالُوا لأَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ خُذْ مِنْ خَيْلِنَا وَرَقِيقِنَا صَدَقَةً ‏.‏ فَأَبَى ثُمَّ كَتَبَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَأَبَى عُمَرُ ثُمَّ كَلَّمُوهُ أَيْضًا فَكَتَبَ إِلَى عُمَرَ فَكَتَبَ إِلَيْهِ عُمَرُ إِنْ أَحَبُّوا فَخُذْهَا مِنْهُمْ وَارْدُدْهَا عَلَيْهِمْ وَارْزُقْ رَقِيقَهُمْ ‏.‏ قَالَ مَالِكٌ مَعْنَى قَوْلِهِ رَحِمَهُ اللَّهُ وَارْدُدْهَا عَلَيْهِمْ يَقُولُ عَلَى فُقَرَائِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 612
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": 613,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ قَالَ جَاءَ كِتَابٌ مِنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ إِلَى أَبِي وَهُوَ بِمِنًى أَنْ لاَ يَأْخُذَ مِنَ الْعَسَلِ وَلاَ مِنَ الْخَيْلِ صَدَقَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 613
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": 614,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ صَدَقَةِ الْبَرَاذِينِ، فَقَالَ وَهَلْ فِي الْخَيْلِ مِنْ صَدَقَةٍ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 614
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": 615,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَ الْجِزْيَةَ مِنْ مَجُوسِ الْبَحْرَيْنِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ أَخَذَهَا مِنْ مَجُوسِ فَارِسَ وَأَنَّ عُثْمَانَ بْنَ عَفَّانَ أَخَذَهَا مِنَ الْبَرْبَرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 615
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": 616,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، ذَكَرَ الْمَجُوسَ فَقَالَ مَا أَدْرِي كَيْفَ أَصْنَعُ فِي أَمْرِهِمْ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ سُنُّوا بِهِمْ سُنَّةَ أَهْلِ الْكِتَابِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 616
			}
		},
		{
			"hadithnumber": 617,
			"arabicnumber": 617,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، ضَرَبَ الْجِزْيَةَ عَلَى أَهْلِ الذَّهَبِ أَرْبَعَةَ دَنَانِيرَ وَعَلَى أَهْلِ الْوَرِقِ أَرْبَعِينَ دِرْهَمًا مَعَ ذَلِكَ أَرْزَاقُ الْمُسْلِمِينَ وَضِيَافَةُ ثَلاَثَةِ أَيَّامٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 617
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": 618,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعُمَرَ بْنِ الْخَطَّابِ إِنَّ فِي الظَّهْرِ نَاقَةً عَمْيَاءَ ‏.‏ فَقَالَ عُمَرُ ادْفَعْهَا إِلَى أَهْلِ بَيْتٍ يَنْتَفِعُونَ بِهَا ‏.‏ قَالَ فَقُلْتُ وَهِيَ عَمْيَاءُ فَقَالَ عُمَرُ يَقْطُرُونَهَا بِالإِبِلِ ‏.‏ قَالَ فَقُلْتُ كَيْفَ تَأْكُلُ مِنَ الأَرْضِ قَالَ فَقَالَ عُمَرُ أَمِنْ نَعَمِ الْجِزْيَةِ هِيَ أَمْ مِنْ نَعَمِ الصَّدَقَةِ فَقُلْتُ بَلْ مِنْ نَعَمِ الْجِزْيَةِ ‏.‏ فَقَالَ عُمَرُ أَرَدْتُمْ - وَاللَّهِ - أَكْلَهَا ‏.‏ فَقُلْتُ إِنَّ عَلَيْهَا وَسْمَ الْجِزْيَةِ ‏.‏ فَأَمَرَ بِهَا عُمَرُ فَنُحِرَتْ وَكَانَ عِنْدَهُ صِحَافٌ تِسْعٌ فَلاَ تَكُونُ فَاكِهَةٌ وَلاَ طُرَيْفَةٌ إِلاَّ جَعَلَ مِنْهَا فِي تِلْكَ الصِّحَافِ فَبَعَثَ بِهَا إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَيَكُونُ الَّذِي يَبْعَثُ بِهِ إِلَى حَفْصَةَ ابْنَتِهِ مِنْ آخِرِ ذَلِكَ فَإِنْ كَانَ فِيهِ نُقْصَانٌ كَانَ فِي حَظِّ حَفْصَةَ - قَالَ - فَجَعَلَ فِي تِلْكَ الصِّحَافِ مِنْ لَحْمِ تِلْكَ الْجَزُورِ فَبَعَثَ بِهِ إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَأَمَرَ بِمَا بَقِيَ مِنْ لَحْمِ تِلْكَ الْجَزُورِ فَصُنِعَ فَدَعَا عَلَيْهِ الْمُهَاجِرِينَ وَالأَنْصَارَ ‏.‏ قَالَ مَالِكٌ لاَ أَرَى أَنْ تُؤْخَذَ النَّعَمُ مِنْ أَهْلِ الْجِزْيَةِ إِلاَّ فِي جِزْيَتِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 618
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عُمَّالِهِ أَنْ يَضَعُوا الْجِزْيَةَ عَمَّنْ أَسْلَمَ مِنْ أَهْلِ الْجِزْيَةِ حِينَ يُسْلِمُونَ ‏.‏ قَالَ مَالِكٌ مَضَتِ السُّنَّةُ أَنْ لاَ جِزْيَةَ عَلَى نِسَاءِ أَهْلِ الْكِتَابِ وَلاَ عَلَى صِبْيَانِهِمْ وَأَنَّ الْجِزْيَةَ لاَ تُؤْخَذُ إِلاَّ مِنَ الرِّجَالِ الَّذِينَ قَدْ بَلَغُوا الْحُلُمَ وَلَيْسَ عَلَى أَهْلِ الذِّمَّةِ وَلاَ عَلَى الْمَجُوسِ فِي نَخِيلِهِمْ وَلاَ كُرُومِهِمْ وَلاَ زُرُوعِهِمْ وَلاَ مَوَاشِيهِمْ صَدَقَةٌ لأَنَّ الصَّدَقَةَ إِنَّمَا وُضِعَتْ عَلَى الْمُسْلِمِينَ تَطْهِيرًا لَهُمْ وَرَدًّا عَلَى فُقَرَائِهِمْ وَوُضِعَتِ الْجِزْيَةُ عَلَى أَهْلِ الْكِتَابِ صَغَارًا لَهُمْ فَهُمْ مَا كَانُوا بِبَلَدِهِمُ الَّذِينَ صَالَحُوا عَلَيْهِ لَيْسَ عَلَيْهِمْ شَىْءٌ سِوَى الْجِزْيَةِ فِي شَىْءٍ مِنْ أَمْوَالِهِمْ إِلاَّ أَنْ يَتَّجِرُوا فِي بِلاَدِ الْمُسْلِمِينَ وَيَخْتَلِفُوا فِيهَا فَيُؤْخَذُ مِنْهُمُ الْعُشْرُ فِيمَا يُدِيرُونَ مِنَ التِّجَارَاتِ وَذَلِكَ أَنَّهُمْ إِنَّمَا وُضِعَتْ عَلَيْهِمُ الْجِزْيَةُ وَصَالَحُوا عَلَيْهَا عَلَى أَنْ يُقَرُّوا بِبِلاَدِهِمْ وَيُقَاتَلَ عَنْهُمْ عَدُوُّهُمْ فَمَنْ خَرَجَ مِنْهُمْ مِنْ بِلاَدِهِ إِلَى غَيْرِهَا يَتْجُرُ إِلَيْهَا فَعَلَيْهِ الْعُشْرُ مَنْ تَجَرَ مِنْهُمْ مِنْ أَهْلِ مِصْرَ إِلَى الشَّامِ وَمِنْ أَهْلِ الشَّامِ إِلَى الْعِرَاقِ وَمِنْ أَهْلِ الْعِرَاقِ إِلَى الْمَدِينَةِ أَوِ الْيَمَنِ أَوْ مَا أَشْبَهَ هَذَا مِنَ الْبِلاَدِ فَعَلَيْهِ الْعُشْرُ وَلاَ صَدَقَةَ عَلَى أَهْلِ الْكِتَابِ وَلاَ الْمَجُوسِ فِي شَىْءٍ مِنْ أَمْوَالِهِمْ وَلاَ مِنْ مَوَاشِيهِمْ وَلاَ ثِمَارِهِمْ وَلاَ زُرُوعِهِمْ مَضَتْ بِذَلِكَ السُّنَّةُ وَيُقَرُّونَ عَلَى دِينِهِمْ وَيَكُونُونَ عَلَى مَا كَانُوا عَلَيْهِ وَإِنِ اخْتَلَفُوا فِي الْعَامِ الْوَاحِدِ مِرَارًا فِي بِلاَدِ الْمُسْلِمِينَ فَعَلَيْهِمْ كُلَّمَا اخْتَلَفُوا الْعُشْرُ لأَنَّ ذَلِكَ لَيْسَ مِمَّا صَالَحُوا عَلَيْهِ وَلاَ مِمَّا شُرِطَ لَهُمْ وَهَذَا الَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 619
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": 620,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْخُذُ مِنَ النَّبَطِ مِنَ الْحِنْطَةِ وَالزَّيْتِ نِصْفَ الْعُشْرِ يُرِيدُ بِذَلِكَ أَنْ يَكْثُرَ الْحَمْلُ إِلَى الْمَدِينَةِ وَيَأْخُذُ مِنَ الْقُطْنِيَّةِ الْعُشْرَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 620
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ قَالَ كُنْتُ غُلاَمًا عَامِلاً مَعَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَلَى سُوقِ الْمَدِينَةِ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فَكُنَّا نَأْخُذُ مِنَ النَّبَطِ الْعُشْرَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 621
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": 622,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَلَى أَىِّ وَجْهٍ كَانَ يَأْخُذُ عُمَرُ بْنُ الْخَطَّابِ مِنَ النَّبَطِ الْعُشْرَ فَقَالَ ابْنُ شِهَابٍ كَانَ ذَلِكَ يُؤْخَذُ مِنْهُمْ فِي الْجَاهِلِيَّةِ فَأَلْزَمَهُمْ ذَلِكَ عُمَرُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 622
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": 623,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، وَهُوَ يَقُولُ حَمَلْتُ عَلَى فَرَسٍ عَتِيقٍ فِي سَبِيلِ اللَّهِ - وَكَانَ الرَّجُلُ الَّذِي هُوَ عِنْدَهُ قَدْ أَضَاعَهُ - فَأَرَدْتُ أَنْ أَشْتَرِيَهُ مِنْهُ وَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ فَسَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تَشْتَرِهِ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ وَاحِدٍ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 623
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": 624,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَأَرَادَ أَنْ يَبْتَاعَهُ فَسَأَلَ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تَبْتَعْهُ وَلاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 624
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": 625,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُخْرِجُ زَكَاةَ الْفِطْرِ عَنْ غِلْمَانِهِ الَّذِينَ، بِوَادِي الْقُرَى وَبِخَيْبَرَ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ أَحْسَنَ، مَا سَمِعْتُ فِيمَا، يَجِبُ عَلَى الرَّجُلِ مِنْ زَكَاةِ الْفِطْرِ أَنَّ الرَّجُلَ يُؤَدِّي ذَلِكَ عَنْ كُلِّ مَنْ يَضْمَنُ نَفَقَتَهُ وَلاَ بُدَّ لَهُ مِنْ أَنْ يُنْفِقَ عَلَيْهِ وَالرَّجُلُ يُؤَدِّي عَنْ مُكَاتَبِهِ وَمُدَبَّرِهِ وَرَقِيقِهِ كُلِّهِمْ غَائِبِهِمْ وَشَاهِدِهِمْ مَنْ كَانَ مِنْهُمْ مُسْلِمًا وَمَنْ كَانَ مِنْهُمْ لِتِجَارَةٍ أَوْ لِغَيْرِ تِجَارَةٍ وَمَنْ لَمْ يَكُنْ مِنْهُمْ مُسْلِمًا فَلاَ زَكَاةَ عَلَيْهِ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ الآبِقِ إِنَّ سَيِّدَهُ إِنْ عَلِمَ مَكَانَهُ أَوْ لَمْ يَعْلَمْ وَكَانَتْ غَيْبَتُهُ قَرِيبَةً فَهُوَ يَرْجُو حَيَاتَهُ وَرَجْعَتَهُ فَإِنِّي أَرَى أَنْ يُزَكِّيَ عَنْهُ وَإِنْ كَانَ إِبَاقُهُ قَدْ طَالَ وَيَئِسَ مِنْهُ فَلاَ أَرَى أَنْ يُزَكِّيَ عَنْهُ ‏.‏ قَالَ مَالِكٌ تَجِبُ زَكَاةُ الْفِطْرِ عَلَى أَهْلِ الْبَادِيَةِ كَمَا تَجِبُ عَلَى أَهْلِ الْقُرَى وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 625
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": 626,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 626
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": 627,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ الْعَامِرِيِّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ زَبِيبٍ وَذَلِكَ بِصَاعِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 627
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": 628,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يُخْرِجُ فِي زَكَاةِ الْفِطْرِ إِلاَّ التَّمْرَ إِلاَّ مَرَّةً وَاحِدَةً فَإِنَّهُ أَخْرَجَ شَعِيرًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 628
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": 629,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَبْعَثُ بِزَكَاةِ الْفِطْرِ إِلَى الَّذِي تُجْمَعُ عِنْدَهُ قَبْلَ الْفِطْرِ بِيَوْمَيْنِ أَوْ ثَلاَثَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 629
			}
		}
	]
}