{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"2": "Purity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ وَهُوَ جَدُّ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم هَلْ تَسْتَطِيعُ أَنْ تُرِيَنِي كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ فَقَالَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ نَعَمْ ‏.‏ فَدَعَا بِوَضُوءٍ فَأَفْرَغَ عَلَى يَدِهِ فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ ثُمَّ تَمَضْمَضَ وَاسْتَنْثَرَ ثَلاَثًا ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثًا ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ ثُمَّ مَسَحَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ بَدَأَ بِمُقَدَّمِ رَأْسِهِ ثُمَّ ذَهَبَ بِهِمَا إِلَى قَفَاهُ ثُمَّ رَدَّهُمَا حَتَّى رَجَعَ إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ ثُمَّ غَسَلَ رِجْلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، قَدْ دَخَلَ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ مَاتَ سَعْدُ بْنُ أَبِي وَقَّاصٍ فَدَعَا بِوَضُوءٍ فَقَالَتْ لَهُ عَائِشَةُ يَا عَبْدَ الرَّحْمَنِ أَسْبِغِ الْوُضُوءَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ مُحَمَّدِ بْنِ طَحْلاَءَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، يَتَوَضَّأُ بِالْمَاءِ لِمَا تَحْتَ إِزَارِهِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ فَنَسِيَ فَغَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ أَوْ غَسَلَ ذِرَاعَيْهِ قَبْلَ أَنْ يَغْسِلَ وَجْهَهُ فَقَالَ أَمَّا الَّذِي غَسَلَ وَجْهَهُ قَبْلَ أَنْ يَتَمَضْمَضَ فَلْيُمَضْمِضْ وَلاَ يُعِدْ غَسْلَ وَجْهِهِ وَأَمَّا الَّذِي غَسَلَ ذِرَاعَيْهِ قَبْلَ وَجْهِهِ فَلْيَغْسِلْ وَجْهَهُ ثُمَّ لِيُعِدْ غَسْلَ ذِرَاعَيْهِ حَتَّى يَكُونَ غَسْلُهُمَا بَعْدَ وَجْهِهِ إِذَا كَانَ ذَلِكَ فِي مَكَانِهِ أَوْ بِحَضْرَةِ ذَلِكَ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ نَسِيَ أَنْ يَتَمَضْمَضَ وَيَسْتَنْثِرَ حَتَّى صَلَّى قَالَ لَيْسَ عَلَيْهِ أَنْ يُعِيدَ صَلاَتَهُ وَلْيُمَضْمِضْ وَيَسْتَنْثِرْ مَا يَسْتَقْبِلُ إِنْ كَانَ يُرِيدُ أَنْ يُصَلِّيَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِذَا نَامَ أَحَدُكُمْ مُضْطَجِعًا فَلْيَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ تَفْسِيرَ، هَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاَةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ‏}‏ أَنَّ ذَلِكَ إِذَا قُمْتُمْ مِنَ الْمَضَاجِعِ ‏.‏ يَعْنِي النَّوْمَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لاَ يَتَوَضَّأُ مِنْ رُعَافٍ وَلاَ مِنْ دَمٍ وَلاَ مِنْ قَيْحٍ يَسِيلُ مِنَ الْجَسَدِ وَلاَ يَتَوَضَّأُ إِلاَّ مِنْ حَدَثٍ يَخْرُجُ مِنْ ذَكَرٍ أَوْ دُبُرٍ أَوْ نَوْمٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَنَامُ جَالِسًا ثُمَّ يُصَلِّي وَلاَ يَتَوَضَّأُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، - مِنْ آلِ بَنِي الأَزْرَقِ - عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ، - وَهُوَ مِنْ بَنِي عَبْدِ الدَّارِ - أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنَ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ حُمَيْدَةَ بِنْتِ أَبِي عُبَيْدَةَ بْنِ فَرْوَةَ، عَنْ خَالَتِهَا، كَبْشَةَ بِنْتِ كَعْبِ بْنِ مَالِكٍ - وَكَانَتْ تَحْتَ ابْنِ أَبِي قَتَادَةَ الأَنْصَارِيِّ - أَنَّهَا أَخْبَرَتْهَا أَنَّ أَبَا قَتَادَةَ دَخَلَ عَلَيْهَا فَسَكَبَتْ لَهُ وَضُوءًا فَجَاءَتْ هِرَّةٌ لِتَشْرَبَ مِنْهُ فَأَصْغَى لَهَا الإِنَاءَ حَتَّى شَرِبَتْ قَالَتْ كَبْشَةُ فَرَآنِي أَنْظُرُ إِلَيْهِ فَقَالَ أَتَعْجَبِينَ يَا ابْنَةَ أَخِي قَالَتْ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّهَا لَيْسَتْ بِنَجَسٍ إِنَّمَا هِيَ مِنَ الطَّوَّافِينَ عَلَيْكُمْ أَوِ الطَّوَّافَاتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ فِي رَكْبٍ فِيهِمْ عَمْرُو بْنُ الْعَاصِ حَتَّى وَرَدُوا حَوْضًا فَقَالَ عَمْرُو بْنُ الْعَاصِ لِصَاحِبِ الْحَوْضِ يَا صَاحِبَ الْحَوْضِ هَلْ تَرِدُ حَوْضَكَ السِّبَاعُ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ يَا صَاحِبَ الْحَوْضِ لاَ تُخْبِرْنَا فَإِنَّا نَرِدُ عَلَى السِّبَاعِ وَتَرِدُ عَلَيْنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِنْ كَانَ الرِّجَالُ وَالنِّسَاءُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيَتَوَضَّئُونَ جَمِيعًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُمِّ وَلَدٍ، لإِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنِّي امْرَأَةٌ أُطِيلُ ذَيْلِي وَأَمْشِي فِي الْمَكَانِ الْقَذِرِ قَالَتْ أُمُّ سَلَمَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُطَهِّرُهُ مَا بَعْدَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ رَأَى رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ يَقْلِسُ مِرَارًا وَهُوَ فِي الْمَسْجِدِ فَلاَ يَنْصَرِفُ وَلاَ يَتَوَضَّأُ حَتَّى يُصَلِّيَ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ قَلَسَ طَعَامًا هَلْ عَلَيْهِ وُضُوءٌ فَقَالَ لَيْسَ عَلَيْهِ وُضُوءٌ وَلْيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَنَّطَ ابْنًا لِسَعِيدِ بْنِ زَيْدٍ وَحَمَلَهُ ثُمَّ دَخَلَ الْمَسْجِدَ فَصَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ هَلْ فِي الْقَىْءِ وُضُوءٌ قَالَ لاَ وَلَكِنْ لِيَتَمَضْمَضْ مِنْ ذَلِكَ وَلْيَغْسِلْ فَاهُ وَلَيْسَ عَلَيْهِ وُضُوءٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، خَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ - وَهِيَ مِنْ أَدْنَى خَيْبَرَ - نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى الْعَصْرَ ثُمَّ دَعَا بِالأَزْوَادِ فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ فَأَمَرَ بِهِ فَثُرِّيَ فَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَكَلْنَا ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَمَضْمَضَ وَمَضْمَضْنَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَعَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّهُمَا أَخْبَرَاهُ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ، أَنَّهُ تَعَشَّى مَعَ عُمَرَ بْنِ الْخَطَّابِ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ أَبَانَ بْنِ عُثْمَانَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَكَلَ خُبْزًا وَلَحْمًا ثُمَّ مَضْمَضَ وَغَسَلَ يَدَيْهِ وَمَسَحَ بِهِمَا وَجْهَهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَا لاَ يَتَوَضَّآنِ مِمَّا مَسَّتِ النَّارُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ عَنِ الرَّجُلِ، يَتَوَضَّأُ لِلصَّلاَةِ ثُمَّ يُصِيبُ طَعَامًا قَدْ مَسَّتْهُ النَّارُ أَيَتَوَضَأُ قَالَ رَأَيْتُ أَبِي يَفْعَلُ ذَلِكَ وَلاَ يَتَوَضَّأُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، يَقُولُ رَأَيْتُ أَبَا بَكْرٍ الصِّدِّيقَ أَكَلَ لَحْمًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دُعِيَ لِطَعَامٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَلَحْمٌ فَأَكَلَ مِنْهُ ثُمَّ تَوَضَّأَ وَصَلَّى ثُمَّ أُتِيَ بِفَضْلِ ذَلِكَ الطَّعَامِ فَأَكَلَ مِنْهُ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ الأَنْصَارِيِّ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَدِمَ مِنَ الْعِرَاقِ فَدَخَلَ عَلَيْهِ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَقَرَّبَ لَهُمَا طَعَامًا قَدْ مَسَّتْهُ النَّارُ فَأَكَلُوا مِنْهُ فَقَامَ أَنَسٌ فَتَوَضَّأَ فَقَالَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ مَا هَذَا يَا أَنَسُ أَعِرَاقِيَّةٌ فَقَالَ أَنَسٌ لَيْتَنِي لَمْ أَفْعَلْ ‏.‏ وَقَامَ أَبُو طَلْحَةَ وَأُبَىُّ بْنُ كَعْبٍ فَصَلَّيَا وَلَمْ يَتَوَضَّآ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ الاِسْتِطَابَةِ فَقَالَ ‏ \"‏ أَوَلاَ يَجِدُ أَحَدُكُمْ ثَلاَثَةَ أَحْجَارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الْمَقْبُرَةِ فَقَالَ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ وَدِدْتُ أَنِّي قَدْ رَأَيْتُ إِخْوَانَنَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَلَسْنَا بِإِخْوَانِكَ قَالَ ‏\"‏ بَلْ أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَعْرِفُ مَنْ يَأْتِي بَعْدَكَ مِنْ أُمَّتِكَ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ كَانَ لِرَجُلٍ خَيْلٌ غُرٌّ مُحَجَّلَةٌ فِي خَيْلٍ دُهْمٍ بُهْمٍ أَلاَ يَعْرِفُ خَيْلَهُ ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّهُمْ يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنَ الْوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ فَلاَ يُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ أُنَادِيهِمْ أَلاَ هَلُمَّ أَلاَ هَلُمَّ أَلاَ هَلُمَّ فَيُقَالُ إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ فَأَقُولُ فَسُحْقًا فَسُحْقًا فَسُحْقًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 59,
			"arabicnumber": 59,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، جَلَسَ عَلَى الْمَقَاعِدِ فَجَاءَ الْمُؤَذِّنُ فَآذَنَهُ بِصَلاَةِ الْعَصْرِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ قَالَ وَاللَّهِ لأُحَدِّثَنَّكُمْ حَدِيثًا لَوْلاَ أَنَّهُ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُكُمُوهُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنِ امْرِئٍ يَتَوَضَّأُ فَيُحْسِنُ وُضُوءَهُ ثُمَّ يُصَلِّي الصَّلاَةَ إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلاَةِ الأُخْرَى حَتَّى يُصَلِّيَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ الصُّنَابِحِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُؤْمِنُ فَتَمَضْمَضَ خَرَجَتِ الْخَطَايَا مِنْ فِيهِ وَإِذَا اسْتَنْثَرَ خَرَجَتِ الْخَطَايَا مِنْ أَنْفِهِ فَإِذَا غَسَلَ وَجْهَهُ خَرَجَتِ الْخَطَايَا مِنْ وَجْهِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَشْفَارِ عَيْنَيْهِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتِ الْخَطَايَا مِنْ يَدَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ يَدَيْهِ فَإِذَا مَسَحَ بِرَأْسِهِ خَرَجَتِ الْخَطَايَا مِنْ رَأْسِهِ حَتَّى تَخْرُجَ مِنْ أُذُنَيْهِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتِ الْخَطَايَا مِنْ رِجْلَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ رِجْلَيْهِ - قَالَ - ثُمَّ كَانَ مَشْيُهُ إِلَى الْمَسْجِدِ وَصَلاَتُهُ نَافِلَةً لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ - أَوِ الْمُؤْمِنُ - فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلاَهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 62,
			"arabicnumber": 62,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَانَتْ صَلاَةُ الْعَصْرِ فَالْتَمَسَ النَّاسُ وَضُوءًا فَلَمْ يَجِدُوهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَضُوءٍ فِي إِنَاءٍ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ الإِنَاءِ يَدَهُ ثُمَّ أَمَرَ النَّاسَ يَتَوَضَّئُونَ مِنْهُ - قَالَ أَنَسٌ - فَرَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ تَحْتِ أَصَابِعِهِ فَتَوَضَّأَ النَّاسُ حَتَّى تَوَضَّئُوا مِنْ عِنْدِ آخِرِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمَدَنِيِّ الْمُجْمِرِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ وُضُوءَهُ ثُمَّ خَرَجَ عَامِدًا إِلَى الصَّلاَةِ فَإِنَّهُ فِي صَلاَةٍ مَادَامَ يَعْمِدُ إِلَى الصَّلاَةِ وَإِنَّهُ يُكْتَبُ لَهُ بِإِحْدَى خُطْوَتَيْهِ حَسَنَةٌ وَيُمْحَى عَنْهُ بِالأُخْرَى سَيِّئَةٌ فَإِذَا سَمِعَ أَحَدُكُمُ الإِقَامَةَ فَلاَ يَسْعَ فَإِنَّ أَعْظَمَكُمْ أَجْرًا أَبْعَدُكُمْ دَارًا ‏.‏ قَالُوا لِمَ يَا أَبَا هُرَيْرَةَ قَالَ مِنْ أَجْلِ كَثْرَةِ الْخُطَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُسْأَلُ عَنِ الْوُضُوءِ، مِنَ الْغَائِطِ بِالْمَاءِ فَقَالَ سَعِيدٌ إِنَّمَا ذَلِكَ وُضُوءُ النِّسَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 65,
			"arabicnumber": 65,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 66,
			"arabicnumber": 66,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ اسْتَقِيمُوا وَلَنْ تُحْصُوا وَاعْمَلُوا وَخَيْرُ أَعْمَالِكُمُ الصَّلاَةُ وَلاَ يُحَافِظُ عَلَى الْوُضُوءِ إِلاَّ مُؤْمِنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 67,
			"arabicnumber": 67,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَأْخُذُ الْمَاءَ بِأَصْبُعَيْهِ لأُذُنَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، سُئِلَ عَنِ الْمَسْحِ، عَلَى الْعِمَامَةِ فَقَالَ لاَ حَتَّى يُمْسَحَ الشَّعْرُ بِالْمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 69,
			"arabicnumber": 69,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، عُرْوَةَ بْنَ الزُّبَيْرِ كَانَ يَنْزِعُ الْعِمَامَةَ وَيَمْسَحُ رَأْسَهُ بِالْمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 70,
			"arabicnumber": 70,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ رَأَى صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ امْرَأَةَ عَبْدِ اللَّهِ بْنِ عُمَرَ تَنْزِعُ خِمَارَهَا وَتَمْسَحُ عَلَى رَأْسِهَا بِالْمَاءِ وَنَافِعٌ يَوْمَئِذٍ صَغِيرٌ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الْمَسْحِ عَلَى الْعِمَامَةِ وَالْخِمَارِ فَقَالَ لاَ يَنْبَغِي أَنْ يَمْسَحَ الرَّجُلُ وَلاَ الْمَرْأَةُ عَلَى عِمَامَةٍ وَلاَ خِمَارٍ وَلْيَمْسَحَا عَلَى رُءُوسِهِمَا ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ فَنَسِيَ أَنْ يَمْسَحَ عَلَى رَأْسِهِ حَتَّى جَفَّ وَضُوءُهُ قَالَ أَرَى أَنْ يَمْسَحَ بِرَأْسِهِ وَإِنْ كَانَ قَدْ صَلَّى أَنْ يُعِيدَ الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 71,
			"arabicnumber": 71,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ زِيَادٍ، مِنْ وَلَدِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ لِحَاجَتِهِ فِي غَزْوَةِ تَبُوكَ - قَالَ الْمُغِيرَةُ - فَذَهَبْتُ مَعَهُ بِمَاءٍ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَكَبْتُ عَلَيْهِ الْمَاءَ فَغَسَلَ وَجْهَهُ ثُمَّ ذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّىْ جُبَّتِهِ فَلَمْ يَسْتَطِعْ مِنْ ضِيقِ كُمَّىِ الْجُبَّةِ فَأَخْرَجَهُمَا مِنْ تَحْتِ الْجُبَّةِ فَغَسَلَ يَدَيْهِ وَمَسَحَ بِرَأْسِهِ وَمَسَحَ عَلَى الْخُفَّيْنِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ يَؤُمُّهُمْ وَقَدْ صَلَّى بِهِمْ رَكْعَةً فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّكْعَةَ الَّتِي بَقِيَتْ عَلَيْهِمْ فَفَزِعَ النَّاسُ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَحْسَنْتُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 72,
			"arabicnumber": 72,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَدِمَ الْكُوفَةَ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ وَهُوَ أَمِيرُهَا فَرَآهُ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمْسَحُ عَلَى الْخُفَّيْنِ فَأَنْكَرَ ذَلِكَ عَلَيْهِ فَقَالَ لَهُ سَعْدٌ سَلْ أَبَاكَ إِذَا قَدِمْتَ عَلَيْهِ فَقَدِمَ عَبْدُ اللَّهِ فَنَسِيَ أَنْ يَسْأَلَ عُمَرَ عَنْ ذَلِكَ حَتَّى قَدِمَ سَعْدٌ فَقَالَ أَسَأَلْتَ أَبَاكَ فَقَالَ لاَ ‏.‏ فَسَأَلَهُ عَبْدُ اللَّهِ فَقَالَ عُمَرُ إِذَا أَدْخَلْتَ رِجْلَيْكَ فِي الْخُفَّيْنِ وَهُمَا طَاهِرَتَانِ فَامْسَحْ عَلَيْهِمَا ‏.‏ قَالَ عَبْدُ اللَّهِ وَإِنْ جَاءَ أَحَدُنَا مِنَ الْغَائِطِ فَقَالَ عُمَرُ نَعَمْ وَإِنْ جَاءَ أَحَدُكُمْ مِنَ الْغَائِطِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 73,
			"arabicnumber": 73,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، بَالَ فِي السُّوقِ ثُمَّ تَوَضَّأَ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَمَسَحَ رَأْسَهُ ثُمَّ دُعِيَ لِجَنَازَةٍ لِيُصَلِّيَ عَلَيْهَا حِينَ دَخَلَ الْمَسْجِدَ فَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ صَلَّى عَلَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ رُقَيْشٍ، أَنَّهُ قَالَ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ أَتَى قُبَا فَبَالَ ثُمَّ أُتِيَ بِوَضُوءٍ فَتَوَضَّأَ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَمَسَحَ بِرَأْسِهِ وَمَسَحَ عَلَى الْخُفَّيْنِ ثُمَّ جَاءَ الْمَسْجِدَ فَصَلَّى ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ وُضُوءَ الصَّلاَةِ ثُمَّ لَبِسَ خُفَّيْهِ ثُمَّ بَالَ ثُمَّ نَزَعَهُمَا ثُمَّ رَدَّهُمَا فِي رِجْلَيْهِ أَيَسْتَأْنِفُ الْوُضُوءَ فَقَالَ لِيَنْزِعْ خُفَّيْهِ وَلْيَغْسِلْ رِجْلَيْهِ وَإِنَّمَا يَمْسَحُ عَلَى الْخُفَّيْنِ مَنْ أَدْخَلَ رِجْلَيْهِ فِي الْخُفَّيْنِ وَهُمَا طَاهِرَتَانِ بِطُهْرِ الْوُضُوءِ وَأَمَّا مَنْ أَدْخَلَ رِجْلَيْهِ فِي الْخُفَّيْنِ وَهُمَا غَيْرُ طَاهِرَتَيْنِ بِطُهْرِ الْوُضُوءِ فَلاَ يَمْسَحْ عَلَى الْخُفَّيْنِ ‏.‏ قَالَ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ تَوَضَّأَ وَعَلَيْهِ خُفَّاهُ فَسَهَا عَنِ الْمَسْحِ عَلَى الْخُفَّيْنِ حَتَّى جَفَّ وَضُوءُهُ وَصَلَّى قَالَ لِيَمْسَحْ عَلَى خُفَّيْهِ وَلْيُعِدِ الصَّلاَةَ وَلاَ يُعِيدُ الْوُضُوءَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ غَسَلَ قَدَمَيْهِ ثُمَّ لَبِسَ خُفَّيْهِ ثُمَّ اسْتَأْنَفَ الْوُضُوءَ فَقَالَ لِيَنْزِعْ خُفَّيْهِ ثُمَّ لْيَتَوَضَّأْ وَلْيَغْسِلْ رِجْلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 75,
			"arabicnumber": 75,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّهُ رَأَى أَبَاهُ يَمْسَحُ عَلَى الْخُفَّيْنِ قَالَ وَكَانَ لاَ يَزِيدُ إِذَا مَسَحَ عَلَى الْخُفَّيْنِ عَلَى أَنْ يَمْسَحَ ظُهُورَهُمَا وَلاَ يَمْسَحُ بُطُونَهُمَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 76,
			"arabicnumber": 76,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْمَسْحِ، عَلَى الْخُفَّيْنِ كَيْفَ هُوَ فَأَدْخَلَ ابْنُ شِهَابٍ إِحْدَى يَدَيْهِ تَحْتَ الْخُفِّ وَالأُخْرَى فَوْقَهُ ثُمَّ أَمَرَّهُمَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَقَوْلُ ابْنِ شِهَابٍ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا رَعَفَ انْصَرَفَ فَتَوَضَّأَ ثُمَّ رَجَعَ فَبَنَى وَلَمْ يَتَكَلَّمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 78,
			"arabicnumber": 78,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَرْعُفُ فَيَخْرُجُ فَيَغْسِلُ الدَّمَ عَنْهُ ثُمَّ يَرْجِعُ فَيَبْنِي عَلَى مَا قَدْ صَلَّى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 79,
			"arabicnumber": 79,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ اللَّيْثِيِّ، أَنَّهُ رَأَى سَعِيدَ بْنَ الْمُسَيَّبِ رَعَفَ وَهُوَ يُصَلِّي فَأَتَى حُجْرَةَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِوَضُوءٍ فَتَوَضَّأَ ثُمَّ رَجَعَ فَبَنَى عَلَى مَا قَدْ صَلَّى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الأَسْلَمِيِّ، أَنَّهُ قَالَ رَأَيْتُ سَعِيدَ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 81,
			"arabicnumber": 81,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ رَأَى سَالِمَ بْنَ عَبْدِ اللَّهِ يَخْرُجُ مِنْ أَنْفِهِ الدَّمُ حَتَّى تَخْتَضِبَ أَصَابِعُهُ ثُمَّ يَفْتِلُهُ ثُمَّ يُصَلِّي وَلاَ يَتَوَضَّأُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَهُ أَنَّهُ، دَخَلَ عَلَى عُمَرَ بْنِ الْخَطَّابِ مِنَ اللَّيْلَةِ الَّتِي طُعِنَ فِيهَا فَأَيْقَظَ عُمَرَ لِصَلاَةِ الصُّبْحِ فَقَالَ عُمَرُ نَعَمْ وَلاَ حَظَّ فِي الإِسْلاَمِ لِمَنْ تَرَكَ الصَّلاَةَ ‏.‏ فَصَلَّى عُمَرُ وَجُرْحُهُ يَثْعَبُ دَمًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 83,
			"arabicnumber": 83,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ مَا تَرَوْنَ فِيمَنْ غَلَبَهُ الدَّمُ مِنْ رُعَافٍ فَلَمْ يَنْقَطِعْ عَنْهُ قَالَ مَالِكٌ قَالَ يَحْيَى بْنُ سَعِيدٍ ثُمَّ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَرَى أَنْ يُومِئَ بِرَأْسِهِ إِيمَاءً ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 84,
			"arabicnumber": 84,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ الْمِقْدَادِ بْنِ الأَسْوَدِ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، أَمَرَهُ أَنْ يَسْأَلَ، لَهُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ إِذَا دَنَا مِنْ أَهْلِهِ فَخَرَجَ مِنْهُ الْمَذْىُ مَاذَا عَلَيْهِ قَالَ عَلِيٌّ فَإِنَّ عِنْدِي ابْنَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا أَسْتَحِي أَنْ أَسْأَلَهُ ‏.‏ قَالَ الْمِقْدَادُ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏ \"‏ إِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَنْضَحْ فَرْجَهُ بِالْمَاءِ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 85,
			"arabicnumber": 85,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِنِّي لأَجِدُهُ يَنْحَدِرُ مِنِّي مِثْلَ الْخُرَيْزَةِ فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَغْسِلْ ذَكَرَهُ وَلْيَتَوَضَّأْ وُضُوءَهُ لِلصَّلاَةِ يَعْنِي الْمَذْىَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ جُنْدَبٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَيَّاشٍ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْمَذْىِ، فَقَالَ إِذَا وَجَدْتَهُ فَاغْسِلْ فَرْجَكَ وَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَهُ وَرَجُلٌ، يَسْأَلُهُ فَقَالَ إِنِّي لأَجِدُ الْبَلَلَ وَأَنَا أُصَلِّي، أَفَأَنْصَرِفُ فَقَالَ لَهُ سَعِيدٌ لَوْ سَالَ عَلَى فَخِذِي مَا انْصَرَفْتُ حَتَّى أَقْضِيَ صَلاَتِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 88,
			"arabicnumber": 88,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الصَّلْتِ بْنِ زُيَيْدٍ، أَنَّهُ قَالَ سَأَلْتُ سُلَيْمَانَ بْنَ يَسَارٍ عَنِ الْبَلَلِ، أَجِدُهُ فَقَالَ انْضَحْ مَا تَحْتَ ثَوْبِكَ بِالْمَاءِ وَالْهَ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 89,
			"arabicnumber": 89,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، يَقُولُ دَخَلْتُ عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَتَذَاكَرْنَا مَا يَكُونُ مِنْهُ الْوُضُوءُ فَقَالَ مَرْوَانُ وَمِنْ مَسِّ الذَّكَرِ الْوُضُوءُ ‏.‏ فَقَالَ عُرْوَةُ مَا عَلِمْتُ هَذَا ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ أَخْبَرَتْنِي بُسْرَةُ بِنْتُ صَفْوَانَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 90,
			"arabicnumber": 90,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ قَالَ كُنْتُ أُمْسِكُ الْمُصْحَفَ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ فَاحْتَكَكْتُ فَقَالَ سَعْدٌ لَعَلَّكَ مَسِسْتَ ذَكَرَكَ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ قُمْ فَتَوَضَّأْ فَقُمْتُ فَتَوَضَّأْتُ ثُمَّ رَجَعْتُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَقَدْ وَجَبَ عَلَيْهِ الْوُضُوءُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 92,
			"arabicnumber": 92,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ مَنْ مَسَّ ذَكَرَهُ فَقَدْ وَجَبَ عَلَيْهِ الْوُضُوءُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 93,
			"arabicnumber": 93,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ رَأَيْتُ أَبِي عَبْدَ اللَّهِ بْنَ عُمَرَ يَغْتَسِلُ ثُمَّ يَتَوَضَّأُ فَقُلْتُ لَهُ يَا أَبَتِ أَمَا يَجْزِيكَ الْغُسْلُ مِنَ الْوُضُوءِ قَالَ بَلَى وَلَكِنِّي أَحْيَانًا أَمَسُّ ذَكَرِي فَأَتَوَضَّأُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": 94,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي سَفَرٍ فَرَأَيْتُهُ بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ تَوَضَّأَ ثُمَّ صَلَّى قَالَ فَقُلْتُ لَهُ إِنَّ هَذِهِ لَصَلاَةٌ مَا كُنْتَ تُصَلِّيهَا ‏.‏ قَالَ إِنِّي بَعْدَ أَنْ تَوَضَّأْتُ لِصَلاَةِ الصُّبْحِ مَسِسْتُ فَرْجِي ثُمَّ نَسِيتُ أَنْ أَتَوَضَّأَ فَتَوَضَّأْتُ وَعُدْتُ لِصَلاَتِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": 95,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ قُبْلَةُ الرَّجُلِ امْرَأَتَهُ وَجَسُّهَا بِيَدِهِ مِنَ الْمُلاَمَسَةِ فَمَنْ قَبَّلَ امْرَأَتَهُ أَوْ جَسَّهَا بِيَدِهِ فَعَلَيْهِ الْوُضُوءُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": 96,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ مِنْ قُبْلَةِ الرَّجُلِ امْرَأَتَهُ الْوُضُوءُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": 97,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ مِنْ قُبْلَةِ الرَّجُلِ امْرَأَتَهُ الْوُضُوءُ ‏.‏ قَالَ ‏{‏ ابْنُ ‏}‏ نَافِعٍ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": 98,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ بِغَسْلِ يَدَيْهِ ثُمَّ تَوَضَّأَ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ فَيُخَلِّلُ بِهَا أُصُولَ شَعْرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ غَرَفَاتٍ بِيَدَيْهِ ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": 99,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْتَسِلُ مِنْ إِنَاءٍ - هُوَ الْفَرَقُ - مِنَ الْجَنَابَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": 100,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَأَفْرَغَ عَلَى يَدِهِ الْيُمْنَى فَغَسَلَهَا ثُمَّ غَسَلَ فَرْجَهُ ثُمَّ مَضْمَضَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ وَنَضَحَ فِي عَيْنَيْهِ ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى ثُمَّ الْيُسْرَى ثُمَّ غَسَلَ رَأْسَهُ ثُمَّ اغْتَسَلَ وَأَفَاضَ عَلَيْهِ الْمَاءَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": 101,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، سُئِلَتْ عَنْ غُسْلِ الْمَرْأَةِ، مِنَ الْجَنَابَةِ فَقَالَتْ لِتَحْفِنْ عَلَى رَأْسِهَا ثَلاَثَ حَفَنَاتٍ مِنَ الْمَاءِ وَلْتَضْغَثْ رَأْسَهَا بِيَدَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": 102,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعُثْمَانَ بْنَ عَفَّانَ، وَعَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانُوا يَقُولُونَ إِذَا مَسَّ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": 103,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم مَا يُوجِبُ الْغُسْلَ فَقَالَتْ هَلْ تَدْرِي مَا مَثَلُكَ يَا أَبَا سَلَمَةَ مَثَلُ الْفَرُّوجِ يَسْمَعُ الدِّيَكَةَ تَصْرُخُ فَيَصْرُخُ مَعَهَا إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": 104,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ، أَتَى عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهَا لَقَدْ شَقَّ عَلَىَّ اخْتِلاَفُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي أَمْرٍ إِنِّي لأُعْظِمُ أَنْ أَسْتَقْبِلَكِ بِهِ ‏.‏ فَقَالَتْ مَا هُوَ مَا كُنْتَ سَائِلاً عَنْهُ أُمَّكَ فَسَلْنِي عَنْهُ ‏.‏ فَقَالَ الرَّجُلُ يُصِيبُ أَهْلَهُ ثُمَّ يُكْسِلُ وَلاَ يُنْزِلُ فَقَالَتْ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏ فَقَالَ أَبُو مُوسَى الأَشْعَرِيُّ لاَ أَسْأَلُ عَنْ هَذَا أَحَدًا بَعْدَكِ أَبَدًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": 105,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ مَحْمُودَ بْنَ لَبِيدٍ الأَنْصَارِيَّ، سَأَلَ زَيْدَ بْنَ ثَابِتٍ عَنِ الرَّجُلِ، يُصِيبُ أَهْلَهُ ثُمَّ يُكْسِلُ وَلاَ يُنْزِلُ فَقَالَ زَيْدٌ يَغْتَسِلُ ‏.‏ فَقَالَ لَهُ مَحْمُودٌ إِنَّ أُبَىَّ بْنَ كَعْبٍ كَانَ لاَ يَرَى الْغُسْلَ ‏.‏ فَقَالَ لَهُ زَيْدُ بْنُ ثَابِتٍ إِنَّ أُبَىَّ بْنَ كَعْبٍ نَزَعَ عَنْ ذَلِكَ قَبْلَ أَنْ يَمُوتَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": 106,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا جَاوَزَ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": 107,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُصِيبُهُ جَنَابَةٌ مِنَ اللَّيْلِ فَقَالَ لَهُ رَسُولُ اللَّهِ ‏ \"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": 108,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ إِذَا أَصَابَ أَحَدُكُمُ الْمَرْأَةَ ثُمَّ أَرَادَ أَنْ يَنَامَ قَبْلَ أَنْ يَغْتَسِلَ فَلاَ يَنَمْ حَتَّى يَتَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": 109,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا أَرَادَ أَنْ يَنَامَ، أَوْ يَطْعَمَ وَهُوَ جُنُبٌ غَسَلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَمَسَحَ بِرَأْسِهِ ثُمَّ طَعِمَ أَوْ نَامَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": 110,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَبَّرَ فِي صَلاَةٍ مِنَ الصَّلَوَاتِ ثُمَّ أَشَارَ إِلَيْهِمْ بِيَدِهِ أَنِ امْكُثُوا فَذَهَبَ ثُمَّ رَجَعَ وَعَلَى جِلْدِهِ أَثَرُ الْمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": 111,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ زُيَيْدِ بْنِ الصَّلْتِ، أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ إِلَى الْجُرُفِ فَنَظَرَ فَإِذَا هُوَ قَدِ احْتَلَمَ وَصَلَّى وَلَمْ يَغْتَسِلْ فَقَالَ وَاللَّهِ مَا أَرَانِي إِلاَّ احْتَلَمْتُ وَمَا شَعَرْتُ وَصَلَّيْتُ وَمَا اغْتَسَلْتُ قَالَ فَاغْتَسَلَ وَغَسَلَ مَا رَأَى فِي ثَوْبِهِ وَنَضَحَ مَا لَمْ يَرَ وَأَذَّنَ أَوْ أَقَامَ ثُمَّ صَلَّى بَعْدَ ارْتِفَاعِ الضُّحَى مُتَمَكِّنًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": 112,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، غَدَا إِلَى أَرْضِهِ بِالْجُرُفِ فَوَجَدَ فِي ثَوْبِهِ احْتِلاَمًا فَقَالَ لَقَدِ ابْتُلِيتُ بِالاِحْتِلاَمِ مُنْذُ وُلِّيتُ أَمْرَ النَّاسِ ‏.‏ فَاغْتَسَلَ وَغَسَلَ مَا رَأَى فِي ثَوْبِهِ مِنَ الاِحْتِلاَمِ ثُمَّ صَلَّى بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": 113,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، صَلَّى بِالنَّاسِ الصُّبْحَ ثُمَّ غَدَا إِلَى أَرْضِهِ بِالْجُرُفِ فَوَجَدَ فِي ثَوْبِهِ احْتِلاَمًا فَقَالَ إِنَّا لَمَّا أَصَبْنَا الْوَدَكَ لاَنَتِ الْعُرُوقُ ‏.‏ فَاغْتَسَلَ وَغَسَلَ الاِحْتِلاَمَ مِنْ ثَوْبِهِ وَعَادَ لِصَلاَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": 114,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، أَنَّهُ اعْتَمَرَ مَعَ عُمَرَ بْنِ الْخَطَّابِ فِي رَكْبٍ فِيهِمْ عَمْرُو بْنُ الْعَاصِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ عَرَّسَ بِبَعْضِ الطَّرِيقِ قَرِيبًا مِنْ بَعْضِ الْمِيَاهِ فَاحْتَلَمَ عُمَرُ وَقَدْ كَادَ أَنْ يُصْبِحَ فَلَمْ يَجِدْ مَعَ الرَّكْبِ مَاءً فَرَكِبَ حَتَّى جَاءَ الْمَاءَ فَجَعَلَ يَغْسِلُ مَا رَأَى مِنْ ذَلِكَ الاِحْتِلاَمِ حَتَّى أَسْفَرَ فَقَالَ لَهُ عَمْرُو بْنُ الْعَاصِ أَصْبَحْتَ وَمَعَنَا ثِيَابٌ فَدَعْ ثَوْبَكَ يُغْسَلُ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ وَاعَجَبًا لَكَ يَا عَمْرُو بْنَ الْعَاصِ لَئِنْ كُنْتَ تَجِدُ ثِيَابًا أَفَكُلُّ النَّاسِ يَجِدُ ثِيَابًا وَاللَّهِ لَوْ فَعَلْتُهَا لَكَانَتْ سُنَّةً بَلْ أَغْسِلُ مَا رَأَيْتُ وَأَنْضِحُ مَا لَمْ أَرَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَجَدَ فِي ثَوْبِهِ أَثَرَ احْتِلاَمٍ وَلاَ يَدْرِي مَتَى كَانَ وَلاَ يَذْكُرُ شَيْئًا رَأَى فِي مَنَامِهِ قَالَ لِيَغْتَسِلْ مِنْ أَحْدَثِ نَوْمٍ نَامَهُ فَإِنْ كَانَ صَلَّى بَعْدَ ذَلِكَ النَّوْمِ فَلْيُعِدْ مَا كَانَ صَلَّى بَعْدَ ذَلِكَ النَّوْمِ مِنْ أَجْلِ أَنَّ الرَّجُلَ رُبَّمَا احْتَلَمَ وَلاَ يَرَى شَيْئًا وَيَرَى وَلاَ يَحْتَلِمُ فَإِذَا وَجَدَ فِي ثَوْبِهِ مَاءً فَعَلَيْهِ الْغُسْلُ وَذَلِكَ أَنَّ عُمَرَ أَعَادَ مَا كَانَ صَلَّى لآخِرِ نَوْمٍ نَامَهُ وَلَمْ يُعِدْ مَا كَانَ قَبْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": 115,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم الْمَرْأَةُ تَرَى فِي الْمَنَامِ مِثْلَ مَا يَرَى الرَّجُلُ أَتَغْتَسِلُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ فَلْتَغْتَسِلْ ‏\"‏ ‏.‏ فَقَالَتْ لَهَا عَائِشَةُ أُفٍّ لَكِ وَهَلْ تَرَى ذَلِكَ الْمَرْأَةُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَرِبَتْ يَمِينُكِ وَمِنْ أَيْنَ يَكُونُ الشَّبَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": 116,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ امْرَأَةُ أَبِي طَلْحَةَ الأَنْصَارِيِّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ هَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا هِيَ احْتَلَمَتْ فَقَالَ ‏ \"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ بَأْسَ أَنْ يُغْتَسَلَ بِفَضْلِ الْمَرْأَةِ مَا لَمْ تَكُنْ حَائِضًا أَوْ جُنُبًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": 118,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَعْرَقُ فِي الثَّوْبِ وَهُوَ جُنُبٌ ثُمَّ يُصَلِّي فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": 119,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَغْسِلُ جَوَارِيهِ رِجْلَيْهِ وَيُعْطِينَهُ الْخُمْرَةَ وَهُنَّ حُيَّضٌ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ لَهُ نِسْوَةٌ وَجَوَارِي هَلْ يَطَؤُهُنَّ جَمِيعًا قَبْلَ أَنْ يَغْتَسِلَ فَقَالَ لاَ بَأْسَ بِأَنْ يُصِيبَ الرَّجُلُ جَارِيَتَيْهِ قَبْلَ أَنْ يَغْتَسِلَ فَأَمَّا النِّسَاءُ الْحَرَائِرُ فَيُكْرَهُ أَنْ يُصِيبَ الرَّجُلُ الْمَرْأَةَ الْحُرَّةَ فِي يَوْمِ الأُخْرَى فَأَمَّا أَنَّ يُصِيبَ الْجَارِيَةَ ثُمَّ يُصِيبَ الأُخْرَى وَهُوَ جُنُبٌ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ جُنُبٍ وُضِعَ لَهُ مَاءٌ يَغْتَسِلُ بِهِ فَسَهَا فَأَدْخَلَ أَصْبُعَهُ فِيهِ لِيَعْرِفَ حَرَّ الْمَاءِ مِنْ بَرْدِهِ ‏.‏ قَالَ مَالِكٌ إِنْ لَمْ يَكُنْ أَصَابَ أَصْبُعَهُ أَذًى فَلاَ أَرَى ذَلِكَ يُنَجِّسُ عَلَيْهِ الْمَاءَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": 120,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ - أَوْ بِذَاتِ الْجَيْشِ - انْقَطَعَ عِقْدٌ لِي فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ وَأَقَامَ النَّاسُ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ ‏.‏ قَالَتْ عَائِشَةُ فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ عَائِشَةُ فَعَاتَبَنِي أَبُو بَكْرٍ فَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ ‏.‏ قَالَتْ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": 121,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ أَقْبَلَ هُوَ وَعَبْدُ اللَّهِ بْنُ عُمَرَ مِنَ الْجُرُفِ حَتَّى إِذَا كَانَا بِالْمِرْبَدِ نَزَلَ عَبْدُ اللَّهِ فَتَيَمَّمَ صَعِيدًا طَيِّبًا فَمَسَحَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثُمَّ صَلَّى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَتَيَمَّمُ إِلَى الْمِرْفَقَيْنِ ‏.‏ وَسُئِلَ مَالِكٌ كَيْفَ التَّيَمُّمُ وَأَيْنَ يَبْلُغُ بِهِ فَقَالَ يَضْرِبُ ضَرْبَةً لِلْوَجْهِ وَضَرْبَةً لِلْيَدَيْنِ وَيَمْسَحُهُمَا إِلَى الْمِرْفَقَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": 123,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، أَنَّ رَجُلاً، سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ الرَّجُلِ الْجُنُبِ، يَتَيَمَّمُ ثُمَّ يُدْرِكُ الْمَاءَ فَقَالَ سَعِيدٌ إِذَا أَدْرَكَ الْمَاءَ فَعَلَيْهِ الْغُسْلُ لِمَا يُسْتَقْبَلُ ‏.‏ قَالَ مَالِكٌ فِيمَنِ احْتَلَمَ وَهُوَ فِي سَفَرٍ وَلاَ يَقْدِرُ مِنَ الْمَاءِ إِلاَّ عَلَى قَدْرِ الْوُضُوءِ وَهُوَ لاَ يَعْطَشُ حَتَّى يَأْتِيَ الْمَاءَ قَالَ يَغْسِلُ بِذَلِكَ فَرْجَهُ وَمَا أَصَابَهُ مِنْ ذَلِكَ الأَذَى ثُمَّ يَتَيَمَّمُ صَعِيدًا طَيِّبًا كَمَا أَمَرَهُ اللَّهُ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ جُنُبٍ أَرَادَ أَنْ يَتَيَمَّمَ فَلَمْ يَجِدْ تُرَابًا إِلاَّ تُرَابَ سَبَخَةٍ هَلْ يَتَيَمَّمُ بِالسِّبَاخِ وَهَلْ تُكْرَهُ الصَّلاَةُ فِي السِّبَاخِ قَالَ مَالِكٌ لاَ بَأْسَ بِالصَّلاَةِ فِي السِّبَاخِ وَالتَّيَمُّمِ مِنْهَا لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏فَتَيَمَّمُوا صَعِيدًا طَيِّبًا‏}‏ فَكُلُّ مَا كَانَ صَعِيدًا فَهُوَ يُتَيَمَّمُ بِهِ سِبَاخًا كَانَ أَوْ غَيْرَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ مَا يَحِلُّ لِي مِنِ امْرَأَتِي وَهِيَ حَائِضٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِتَشُدَّ عَلَيْهَا إِزَارَهَا ثُمَّ شَأْنَكَ بِأَعْلاَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": 125,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ مُضْطَجِعَةً مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثَوْبٍ وَاحِدٍ وَأَنَّهَا قَدْ وَثَبَتْ وَثْبَةً شَدِيدَةً فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكِ لَعَلَّكِ نَفِسْتِ ‏\"‏ ‏.‏ يَعْنِي الْحَيْضَةَ ‏.‏ فَقَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ شُدِّي عَلَى نَفْسِكِ إِزَارَكِ ثُمَّ عُودِي إِلَى مَضْجَعِكِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": 126,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَرْسَلَ إِلَى عَائِشَةَ يَسْأَلُهَا هَلْ يُبَاشِرُ الرَّجُلُ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَتْ لِتَشُدَّ إِزَارَهَا عَلَى أَسْفَلِهَا ثُمَّ يُبَاشِرُهَا إِنْ شَاءَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": 127,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنِ الْحَائِضِ، هَلْ يُصِيبُهَا زَوْجُهَا إِذَا رَأَتِ الطُّهْرَ قَبْلَ أَنْ تَغْتَسِلَ فَقَالاَ لاَ حَتَّى تَغْتَسِلَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، مَوْلاَةِ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا قَالَتْ كَانَ النِّسَاءُ يَبْعَثْنَ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ بِالدِّرَجَةِ فِيهَا الْكُرْسُفُ فِيهِ الصُّفْرَةُ مِنْ دَمِ الْحَيْضَةِ يَسْأَلْنَهَا عَنِ الصَّلاَةِ فَتَقُولُ لَهُنَّ لاَ تَعْجَلْنَ حَتَّى تَرَيْنَ الْقَصَّةَ الْبَيْضَاءَ ‏.‏ تُرِيدُ بِذَلِكَ الطُّهْرَ مِنَ الْحَيْضَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": 129,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمَّتِهِ، عَنِ ابْنَةِ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ بَلَغَهَا أَنَّ نِسَاءً، كُنَّ يَدْعُونَ بِالْمَصَابِيحِ مِنْ جَوْفِ اللَّيْلِ يَنْظُرْنَ إِلَى الطُّهْرِ فَكَانَتْ تَعِيبُ ذَلِكَ عَلَيْهِنَّ وَتَقُولُ مَا كَانَ النِّسَاءُ يَصْنَعْنَ هَذَا ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الْحَائِضِ تَطْهُرُ فَلاَ تَجِدُ مَاءً هَلْ تَتَيَمَّمُ قَالَ نَعَمْ لِتَتَيَمَّمْ فَإِنَّ مِثْلَهَا مِثْلُ الْجُنُبِ إِذَا لَمْ يَجِدْ مَاءً تَيَمَّمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": 130,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ فِي الْمَرْأَةِ الْحَامِلِ تَرَى الدَّمَ أَنَّهَا تَدَعُ الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": 131,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْمَرْأَةِ الْحَامِلِ، تَرَى الدَّمَ قَالَ تَكُفُّ عَنِ الصَّلاَةِ، ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": 132,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": 133,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ بْنِ الزُّبَيْرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّهَا قَالَتْ سَأَلَتِ امْرَأَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ أَرَأَيْتَ إِحْدَانَا إِذَا أَصَابَ ثَوْبَهَا الدَّمُ مِنَ الْحَيْضَةِ كَيْفَ تَصْنَعُ فِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَصَابَ ثَوْبَ إِحْدَاكُنَّ الدَّمُ مِنَ الْحَيْضَةِ فَلْتَقْرُصْهُ ثُمَّ لِتَنْضَحْهُ بِالْمَاءِ ثُمَّ لِتُصَلِّي فِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": 134,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ قَالَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَاتْرُكِي الصَّلاَةَ فَإِذَا ذَهَبَ قَدْرُهَا فَاغْسِلِي الدَّمَ عَنْكِ وَصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": 135,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً كَانَتْ تُهَرَاقُ الدِّمَاءَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَفْتَتْ لَهَا أُمُّ سَلَمَةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لِتَنْظُرْ إِلَى عَدَدِ اللَّيَالِي وَالأَيَّامِ الَّتِي كَانَتْ تَحِيضُهُنَّ مِنَ الشَّهْرِ قَبْلَ أَنْ يُصِيبَهَا الَّذِي أَصَابَهَا فَلْتَتْرُكِ الصَّلاَةَ قَدْرَ ذَلِكَ مِنَ الشَّهْرِ فَإِذَا خَلَّفَتْ ذَلِكَ فَلْتَغْتَسِلْ ثُمَّ لِتَسْتَثْفِرْ بِثَوْبٍ ثُمَّ لِتُصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": 136,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا رَأَتْ زَيْنَبَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَكَانَتْ تُسْتَحَاضُ فَكَانَتْ تَغْتَسِلُ وَتُصَلِّي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": 137,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ الْقَعْقَاعَ بْنَ حَكِيمٍ، وَزَيْدَ بْنَ أَسْلَمَ، أَرْسَلاَهُ إِلَى سَعِيدِ بْنِ الْمُسَيَّبِ يَسْأَلُهُ كَيْفَ تَغْتَسِلُ الْمُسْتَحَاضَةُ فَقَالَ تَغْتَسِلُ مِنْ طُهْرٍ إِلَى طُهْرٍ وَتَتَوَضَّأُ لِكُلِّ صَلاَةٍ فَإِنْ غَلَبَهَا الدَّمُ اسْتَثْفَرَتْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": 138,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لَيْسَ عَلَى الْمُسْتَحَاضَةِ إِلاَّ أَنْ تَغْتَسِلَ غُسْلاً وَاحِدًا ثُمَّ تَتَوَضَّأُ بَعْدَ ذَلِكَ لِكُلِّ صَلاَةٍ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمُسْتَحَاضَةَ إِذَا صَلَّتْ أَنَّ لِزَوْجِهَا أَنْ يُصِيبَهَا وَكَذَلِكَ النُّفَسَاءُ إِذَا بَلَغَتْ أَقْصَى مَا يُمْسِكُ النِّسَاءَ الدَّمُ فَإِنْ رَأَتِ الدَّمَ بَعْدَ ذَلِكَ فَإِنَّهُ يُصِيبُهَا زَوْجُهَا وَإِنَّمَا هِيَ بِمَنْزِلَةِ الْمُسْتَحَاضَةِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْمُسْتَحَاضَةِ عَلَى حَدِيثِ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ وَهُوَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": 139,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَبِيٍّ فَبَالَ عَلَى ثَوْبِهِ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَاءٍ فَأَتْبَعَهُ إِيَّاهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": 140,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ لَمْ يَأْكُلِ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَجْلَسَهُ فِي حَجْرِهِ فَبَالَ عَلَى ثَوْبِهِ فَدَعَا رَسُولُ اللَّهِ بِمَاءٍ فَنَضَحَهُ وَلَمْ يَغْسِلْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": 141,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ دَخَلَ أَعْرَابِيٌّ الْمَسْجِدَ فَكَشَفَ عَنْ فَرْجِهِ لِيَبُولَ فَصَاحَ النَّاسُ بِهِ حَتَّى عَلاَ الصَّوْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اتْرُكُوهُ ‏\"‏ ‏.‏ فَتَرَكُوهُ فَبَالَ ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَنُوبٍ مِنْ مَاءٍ فَصُبَّ عَلَى ذَلِكَ الْمَكَانِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَبُولُ قَائِمًا ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ غَسْلِ الْفَرْجِ مِنَ الْبَوْلِ وَالْغَائِطِ هَلْ جَاءَ فِيهِ أَثَرٌ فَقَالَ بَلَغَنِي أَنَّ بَعْضَ مَنْ مَضَى كَانُوا يَتَوَضَّئُونَ مِنَ الْغَائِطِ وَأَنَا أُحِبُّ أَنْ أَغْسِلَ الْفَرْجَ مِنَ الْبَوْلِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": 143,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ السَّبَّاقِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي جُمُعَةٍ مِنَ الْجُمَعِ ‏ \"‏ يَا مَعْشَرَ الْمُسْلِمِينَ إِنَّ هَذَا يَوْمٌ جَعَلَهُ اللَّهُ عِيدًا فَاغْتَسِلُوا وَمَنْ كَانَ عِنْدَهُ طِيبٌ فَلاَ يَضُرُّهُ أَنْ يَمَسَّ مِنْهُ وَعَلَيْكُمْ بِالسِّوَاكِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": 144,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ بِالسِّوَاكِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": 145,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لَوْلاَ أَنْ يَشُقَّ، عَلَى أُمَّتِهِ لأَمَرَهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 145
			}
		}
	]
}