{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1091
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1092
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُمْ بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَكِنْ لاَ تُوَاعِدُوهُنَّ سِرًّا إِلاَّ أَنْ تَقُولُوا قَوْلاً مَعْرُوفًا‏}‏ أَنْ يَقُولَ الرَّجُلُ لِلْمَرْأَةِ وَهِيَ فِي عِدَّتِهَا مِنْ وَفَاةِ زَوْجِهَا إِنَّكِ عَلَىَّ لَكَرِيمَةٌ وَإِنِّي فِيكِ لَرَاغِبٌ وَإِنَّ اللَّهَ لَسَائِقٌ إِلَيْكِ خَيْرًا وَرِزْقًا وَنَحْوَ هَذَا مِنَ الْقَوْلِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1093
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1094
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لاَ تُنْكَحُ الْمَرْأَةُ إِلاَّ بِإِذْنِ وَلِيِّهَا أَوْ ذِي الرَّأْىِ مِنْ أَهْلِهَا أَوِ السُّلْطَانِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1095
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، كَانَا يُنْكِحَانِ بَنَاتِهِمَا الأَبْكَارَ وَلاَ يَسْتَأْمِرَانِهِنَّ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا فِي نِكَاحِ الأَبْكَارِ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِلْبِكْرِ جَوَازٌ فِي مَالِهَا حَتَّى تَدْخُلَ بَيْتَهَا وَيُعْرَفَ مِنْ حَالِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1096
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانُوا يَقُولُونَ فِي الْبِكْرِ يُزَوِّجُهَا أَبُوهَا بِغَيْرِ إِذْنِهَا إِنَّ ذَلِكَ لاَزِمٌ لَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1097
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ قِيَامًا طَوِيلاً فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ تُصْدِقُهَا إِيَّاهُ ‏\"‏ ‏.‏ فَقَالَ مَا عِنْدِي إِلاَّ إِزَارِي هَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ أَعْطَيْتَهَا إِيَّاهُ جَلَسْتَ لاَ إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا ‏\"‏ ‏.‏ فَقَالَ مَا أَجِدُ شَيْئًا ‏.‏ قَالَ ‏\"‏ الْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا ‏.‏ لِسُوَرٍ سَمَّاهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَنْكَحْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1098
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا رَجُلٍ تَزَوَّجَ امْرَأَةً وَبِهَا جُنُونٌ أَوْ جُذَامٌ أَوْ بَرَصٌ فَمَسَّهَا فَلَهَا صَدَاقُهَا كَامِلاً وَذَلِكَ لِزَوْجِهَا غُرْمٌ عَلَى وَلِيِّهَا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يَكُونُ ذَلِكَ غُرْمًا عَلَى وَلِيِّهَا لِزَوْجِهَا إِذَا كَانَ وَلِيُّهَا الَّذِي أَنْكَحَهَا هُوَ أَبُوهَا أَوْ أَخُوهَا أَوْ مَنْ يُرَى أَنَّهُ يَعْلَمُ ذَلِكَ مِنْهَا فَأَمَّا إِذَا كَانَ وَلِيُّهَا الَّذِي أَنْكَحَهَا ابْنَ عَمٍّ أَوْ مَوْلًى أَوْ مِنَ الْعَشِيرَةِ مِمَّنْ يُرَى أَنَّهُ لاَ يَعْلَمُ ذَلِكَ مِنْهَا فَلَيْسَ عَلَيْهِ غُرْمٌ وَتَرُدُّ تِلْكَ الْمَرْأَةُ مَا أَخَذَتْهُ مِنْ صَدَاقِهَا وَيَتْرُكُ لَهَا قَدْرَ مَا تُسْتَحَلُّ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1099
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَةَ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، - وَأُمُّهَا بِنْتُ زَيْدِ بْنِ الْخَطَّابِ - كَانَتْ تَحْتَ ابْنٍ لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَمَاتَ وَلَمْ يَدْخُلْ بِهَا وَلَمْ يُسَمِّ لَهَا صَدَاقًا فَابْتَغَتْ أُمُّهَا صَدَاقَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَيْسَ لَهَا صَدَاقٌ وَلَوْ كَانَ لَهَا صَدَاقٌ لَمْ نُمْسِكْهُ وَلَمْ نَظْلِمْهَا ‏.‏ فَأَبَتْ أُمُّهَا أَنْ تَقْبَلَ ذَلِكَ فَجَعَلُوا بَيْنَهُمْ زَيْدَ بْنَ ثَابِتٍ فَقَضَى أَنْ لاَ صَدَاقَ لَهَا وَلَهَا الْمِيرَاثُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1100
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ فِي خِلاَفَتِهِ إِلَى بَعْضِ عُمَّالِهِ أَنَّ كُلَّ مَا اشْتَرَطَ الْمُنْكِحُ - مَنْ كَانَ أَبًا أَوْ غَيْرَهُ - مِنْ حِبَاءٍ أَوْ كَرَامَةٍ فَهُوَ لِلْمَرْأَةِ إِنِ ابْتَغَتْهُ ‏.‏ قَالَ مَالِكٌ فِي الْمَرْأَةِ يُنْكِحُهَا أَبُوهَا وَيَشْتَرِطُ فِي صَدَاقِهَا الْحِبَاءَ يُحْبَى بِهِ إِنَّ مَا كَانَ مِنْ شَرْطٍ يَقَعُ بِهِ النِّكَاحُ فَهُوَ لاِبْنَتِهِ إِنِ ابْتَغَتْهُ وَإِنْ فَارَقَهَا زَوْجُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا فَلِزَوْجِهَا شَطْرُ الْحِبَاءِ الَّذِي وَقَعَ بِهِ النِّكَاحُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُزَوِّجُ ابْنَهُ صَغِيرًا لاَ مَالَ لَهُ إِنَّ الصَّدَاقَ عَلَى أَبِيهِ إِذَا كَانَ الْغُلاَمُ يَوْمَ تَزَوَّجَ لاَ مَالَ لَهُ وَإِنْ كَانَ لِلْغُلاَمِ مَالٌ فَالصَّدَاقُ فِي مَالِ الْغُلاَمِ إِلاَّ أَنْ يُسَمِّيَ الأَبُ أَنَّ الصَّدَاقَ عَلَيْهِ وَذَلِكَ النِّكَاحُ ثَابِتٌ عَلَى الاِبْنِ إِذَا كَانَ صَغِيرًا وَكَانَ فِي وِلاَيَةِ أَبِيهِ ‏.‏ قَالَ مَالِكٌ فِي طَلاَقِ الرَّجُلِ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا وَهِيَ بِكْرٌ فَيَعْفُوَ أَبُوهَا عَنْ نِصْفِ الصَّدَاقِ إِنَّ ذَلِكَ جَائِزٌ لِزَوْجِهَا مِنْ أَبِيهَا فِيمَا وَضَعَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏إِلاَّ أَنْ يَعْفُونَ‏}‏ فَهُنَّ النِّسَاءُ اللاَّتِي قَدْ دُخِلَ بِهِنَّ ‏{‏أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ‏}‏ فَهُوَ الأَبُ فِي ابْنَتِهِ الْبِكْرِ وَالسَّيِّدُ فِي أَمَتِهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الَّذِي سَمِعْتُ فِي ذَلِكَ وَالَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ فِي الْيَهُودِيَّةِ أَوِ النَّصْرَانِيَّةِ تَحْتَ الْيَهُودِيِّ أَوِ النَّصْرَانِيِّ فَتُسْلِمُ قَبْلَ أَنْ يَدْخُلَ بِهَا أَنَّهُ لاَ صَدَاقَ لَهَا ‏.‏ قَالَ مَالِكٌ لاَ أَرَى أَنْ تُنْكَحَ الْمَرْأَةُ بِأَقَلَّ مِنْ رُبْعِ دِينَارٍ وَذَلِكَ أَدْنَى مَا يَجِبُ فِيهِ الْقَطْعُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَضَى فِي الْمَرْأَةِ إِذَا تَزَوَّجَهَا الرَّجُلُ أَنَّهُ إِذَا أُرْخِيَتِ السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1102
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، كَانَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بِامْرَأَتِهِ فَأُرْخِيَتْ عَلَيْهِمَا السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1103
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بِالْمَرْأَةِ فِي بَيْتِهَا صُدِّقَ الرَّجُلُ عَلَيْهَا وَإِذَا دَخَلَتْ عَلَيْهِ فِي بَيْتِهِ صُدِّقَتْ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ أَرَى ذَلِكَ فِي الْمَسِيسِ إِذَا دَخَلَ عَلَيْهَا فِي بَيْتِهَا فَقَالَتْ قَدْ مَسَّنِي وَقَالَ لَمْ أَمَسَّهَا صُدِّقَ عَلَيْهَا فَإِنْ دَخَلَتْ عَلَيْهِ فِي بَيْتِهِ فَقَالَ لَمْ أَمَسَّهَا وَقَالَتْ قَدْ مَسَّنِي صُدِّقَتْ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1104
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ الْمَخْزُومِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ وَأَصْبَحَتْ عِنْدَهُ قَالَ لَهَا ‏ \"‏ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ وَسَبَّعْتُ عِنْدَهُنَّ وَإِنْ شِئْتِ ثَلَّثْتُ عِنْدَكِ وَدُرْتُ ‏\"‏ ‏.‏ فَقَالَتْ ثَلِّثْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1105
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ كَانَ يَقُولُ لِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلاَثٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1106
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنِ الْمَرْأَةِ، تَشْتَرِطُ عَلَى زَوْجِهَا أَنَّهُ لاَ يَخْرُجُ بِهَا مِنْ بَلَدِهَا فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ يَخْرُجُ بِهَا إِنْ شَاءَ ‏.‏ قَالَ مَالِكٌ فَالأَمْرُ عِنْدَنَا ذَلِكَ أَنَّهُ إِذَا شَرَطَ الرَّجُلُ لِلْمَرْأَةِ وَإِنْ كَانَ ذَلِكَ عِنْدَ عُقْدَةِ النِّكَاحِ أَنْ لاَ أَنْكِحَ عَلَيْكِ وَلاَ أَتَسَرَّرَ إِنَّ ذَلِكَ لَيْسَ بِشَىْءٍ إِلاَّ أَنْ يَكُونَ فِي ذَلِكَ يَمِينٌ بِطَلاَقٍ أَوْ عِتَاقَةٍ فَيَجِبُ ذَلِكَ عَلَيْهِ وَيَلْزَمُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1107
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الْمِسْوَرِ بْنِ رِفَاعَةَ الْقُرَظِيِّ، عَنِ الزُّبَيْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الزَّبِيرِ، أَنَّ رِفَاعَةَ بْنَ سِمْوَالٍ، طَلَّقَ امْرَأَتَهُ تَمِيمَةَ بِنْتَ وَهْبٍ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَلاَثًا فَنَكَحَتْ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ فَاعْتَرَضَ عَنْهَا فَلَمْ يَسْتَطِعْ أَنْ يَمَسَّهَا فَفَارَقَهَا فَأَرَادَ رِفَاعَةُ أَنْ يَنْكِحَهَا - وَهُوَ زَوْجُهَا الأَوَّلُ الَّذِي كَانَ طَلَّقَهَا - فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَنَهَاهُ عَنْ تَزْوِيجِهَا وَقَالَ ‏ \"‏ لاَ تَحِلُّ لَكَ حَتَّى تَذُوقَ الْعُسَيْلَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1108
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا سُئِلَتْ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَتَزَوَّجَهَا بَعْدَهُ رَجُلٌ آخَرُ فَطَلَّقَهَا قَبْلَ أَنْ يَمَسَّهَا هَلْ يَصْلُحُ لِزَوْجِهَا الأَوَّلِ أَنْ يَتَزَوَّجَهَا فَقَالَتْ عَائِشَةُ لاَ حَتَّى يَذُوقَ عُسَيْلَتَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1109
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، سُئِلَ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ الْبَتَّةَ ثُمَّ تَزَوَّجَهَا بَعْدَهُ رَجُلٌ آخَرُ فَمَاتَ عَنْهَا قَبْلَ أَنْ يَمَسَّهَا هَلْ يَحِلُّ لِزَوْجِهَا الأَوَّلِ أَنْ يُرَاجِعَهَا فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ لاَ يَحِلُّ لِزَوْجِهَا الأَوَّلِ أَنْ يُرَاجِعَهَا ‏.‏ قَالَ مَالِكٌ فِي الْمُحَلِّلِ إِنَّهُ لاَ يُقِيمُ عَلَى نِكَاحِهِ ذَلِكَ حَتَّى يَسْتَقْبِلَ نِكَاحًا جَدِيدًا فَإِنْ أَصَابَهَا فِي ذَلِكَ فَلَهَا مَهْرُهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1110
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلاَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1111
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ يُنْهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ عَلَى خَالَتِهَا وَأَنْ يَطَأَ الرَّجُلُ وَلِيدَةً وَفِي بَطْنِهَا جَنِينٌ لِغَيْرِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1112
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سُئِلَ زَيْدُ بْنُ ثَابِتٍ عَنْ رَجُلٍ، تَزَوَّجَ امْرَأَةً ثُمَّ فَارَقَهَا قَبْلَ أَنْ يُصِيبَهَا هَلْ تَحِلُّ لَهُ أُمُّهَا فَقَالَ زَيْدُ بْنُ ثَابِتٍ لاَ الأُمُّ مُبْهَمَةٌ لَيْسَ فِيهَا شَرْطٌ وَإِنَّمَا الشَّرْطُ فِي الرَّبَائِبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1113
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ غَيْرِ، وَاحِدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، اسْتُفْتِيَ وَهُوَ بِالْكُوفَةِ عَنْ نِكَاحِ الأُمِّ، بَعْدَ الاِبْنَةِ إِذَا لَمْ تَكُنْ الاِبْنَةُ مُسَّتْ فَأَرْخَصَ فِي ذَلِكَ ثُمَّ إِنَّ ابْنَ مَسْعُودٍ قَدِمَ الْمَدِينَةَ فَسَأَلَ عَنْ ذَلِكَ فَأُخْبِرَ أَنَّهُ لَيْسَ كَمَا قَالَ وَإِنَّمَا الشَّرْطُ فِي الرَّبَائِبِ فَرَجَعَ ابْنُ مَسْعُودٍ إِلَى الْكُوفَةِ فَلَمْ يَصِلْ إِلَى مَنْزِلِهِ حَتَّى أَتَى الرَّجُلَ الَّذِي أَفْتَاهُ بِذَلِكَ فَأَمَرَهُ أَنْ يُفَارِقَ امْرَأَتَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ تَكُونُ تَحْتَهُ الْمَرْأَةُ ثُمَّ يَنْكِحُ أُمَّهَا فَيُصِيبُهَا إِنَّهَا تَحْرُمُ عَلَيْهِ امْرَأَتُهُ وَيُفَارِقُهُمَا جَمِيعًا وَيَحْرُمَانِ عَلَيْهِ أَبَدًا إِذَا كَانَ قَدْ أَصَابَ الأُمَّ فَإِنْ لَمْ يُصِبِ الأُمَّ لَمْ تَحْرُمْ عَلَيْهِ امْرَأَتُهُ وَفَارَقَ الأُمَّ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ ثُمَّ يَنْكِحُ أُمَّهَا فَيُصِيبُهَا إِنَّهُ لاَ تَحِلُّ لَهُ أُمُّهَا أَبَدًا وَلاَ تَحِلُّ لأَبِيهِ وَلاَ لاِبْنِهِ وَلاَ تَحِلُّ لَهُ ابْنَتُهَا وَتَحْرُمُ عَلَيْهِ امْرَأَتُهُ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الزِّنَا فَإِنَّهُ لاَ يُحَرِّمُ شَيْئًا مِنْ ذَلِكَ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏وَأُمَّهَاتُ نِسَائِكُمْ‏}‏ فَإِنَّمَا حَرَّمَ مَا كَانَ تَزْوِيجًا وَلَمْ يَذْكُرْ تَحْرِيمَ الزِّنَا فَكُلُّ تَزْوِيجٍ كَانَ عَلَى وَجْهِ الْحَلاَلِ يُصِيبُ صَاحِبُهُ امْرَأَتَهُ فَهُوَ بِمَنْزِلَةِ التَّزْوِيجِ الْحَلاَلِ فَهَذَا الَّذِي سَمِعْتُ وَالَّذِي عَلَيْهِ أَمْرُ النَّاسِ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الآخَرُ ابْنَتَهُ لَيْسَ بَيْنَهُمَا صَدَاقٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1115
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ بْنِ جَارِيَةَ الأَنْصَارِيِّ عَنْ خَنْسَاءَ بِنْتِ خِدَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَدَّ نِكَاحَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1116
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أُتِيَ بِنِكَاحٍ لَمْ يَشْهَدْ عَلَيْهِ إِلاَّ رَجُلٌ وَامْرَأَةٌ فَقَالَ هَذَا نِكَاحُ السِّرِّ وَلاَ أُجِيزُهُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهِ لَرَجَمْتُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1117
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ طُلَيْحَةَ الأَسَدِيَّةَ، كَانَتْ تَحْتَ رُشَيْدٍ الثَّقَفِيِّ فَطَلَّقَهَا فَنَكَحَتْ فِي عِدَّتِهَا فَضَرَبَهَا عُمَرُ بْنُ الْخَطَّابِ وَضَرَبَ زَوْجَهَا بِالْمِخْفَقَةِ ضَرَبَاتٍ وَفَرَّقَ بَيْنَهُمَا ثُمَّ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا امْرَأَةٍ نَكَحَتْ فِي عِدَّتِهَا فَإِنْ كَانَ زَوْجُهَا الَّذِي تَزَوَّجَهَا لَمْ يَدْخُلْ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنْ زَوْجِهَا الأَوَّلِ ثُمَّ كَانَ الآخَرُ خَاطِبًا مِنَ الْخُطَّابِ وَإِنْ كَانَ دَخَلَ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنَ الأَوَّلِ ثُمَّ اعْتَدَّتْ مِنَ الآخَرِ ثُمَّ لاَ يَجْتَمِعَانِ أَبَدًا ‏.‏ قَالَ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1118
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعَبْدَ اللَّهِ بْنَ عُمَرُ، سُئِلاَ عَنْ رَجُلٍ، كَانَتْ تَحْتَهُ امْرَأَةٌ حُرَّةٌ فَأَرَادَ أَنْ يَنْكِحَ عَلَيْهَا أَمَةً فَكَرِهَا أَنْ يَجْمَعَ بَيْنَهُمَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1119
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ لاَ تُنْكَحُ الأَمَةُ عَلَى الْحُرَّةِ إِلاَّ أَنْ تَشَاءَ الْحُرَّةُ فَإِنْ طَاعَتِ الْحُرَّةُ فَلَهَا الثُّلُثَانِ مِنَ الْقَسْمِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي لِحُرٍّ أَنْ يَتَزَوَّجَ أَمَةً وَهُوَ يَجِدُ طَوْلاً لِحُرَّةٍ وَلاَ يَتَزَوَّجَ أَمَةً إِذَا لَمْ يَجِدْ طَوْلاً لِحُرَّةٍ إِلاَّ أَنْ يَخْشَى الْعَنَتَ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلاً أَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِمَّا مَلَكَتْ أَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُؤْمِنَاتِ‏}‏ وَقَالَ ‏{‏ذَلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ‏}‏ قَالَ مَالِكٌ وَالْعَنَتُ هُوَ الزِّنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1120
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ كَانَ يَقُولُ فِي الرَّجُلِ يُطَلِّقُ الأَمَةَ ثَلاَثًا ثُمَّ يَشْتَرِيهَا إِنَّهَا لاَ تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1121
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنْ رَجُلٍ، زَوَّجَ عَبْدًا لَهُ جَارِيَةً فَطَلَّقَهَا الْعَبْدُ الْبَتَّةَ ثُمَّ وَهَبَهَا سَيِّدُهَا لَهُ هَلْ تَحِلُّ لَهُ بِمِلْكِ الْيَمِينِ فَقَالاَ لاَ تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1122
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ رَجُلٍ، كَانَتْ تَحْتَهُ أَمَةٌ مَمْلُوكَةٌ فَاشْتَرَاهَا وَقَدْ كَانَ طَلَّقَهَا وَاحِدَةً فَقَالَ تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ مَا لَمْ يَبُتَّ طَلاَقَهَا فَإِنْ بَتَّ طَلاَقَهَا فَلاَ تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَنْكِحُ الأَمَةَ فَتَلِدُ مِنْهُ ثُمَّ يَبْتَاعُهَا إِنَّهَا لاَ تَكُونُ أُمَّ وَلَدٍ لَهُ بِذَلِكَ الْوَلَدِ الَّذِي وَلَدَتْ مِنْهُ وَهِيَ لِغَيْرِهِ حَتَّى تَلِدَ مِنْهُ وَهِيَ فِي مِلْكِهِ بَعْدَ ابْتِيَاعِهِ إِيَّاهَا ‏.‏ قَالَ مَالِكٌ وَإِنِ اشْتَرَاهَا وَهِيَ حَامِلٌ مِنْهُ ثُمَّ وَضَعَتْ عِنْدَهُ كَانَتْ أُمَّ وَلَدِهِ بِذَلِكَ الْحَمْلِ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1123
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سُئِلَ عَنِ الْمَرْأَةِ، وَابْنَتِهَا، مِنْ مِلْكِ الْيَمِينِ تُوطَأُ إِحْدَاهُمَا بَعْدَ الأُخْرَى فَقَالَ عُمَرُ مَا أُحِبُّ أَنْ أَخْبُرَهُمَا جَمِيعًا ‏.‏ وَنَهَى عَنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1124
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، أَنَّ رَجُلاً، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ عَنِ الأُخْتَيْنِ، مِنْ مِلْكِ الْيَمِينِ هَلْ يُجْمَعُ بَيْنَهُمَا فَقَالَ عُثْمَانُ أَحَلَّتْهُمَا آيَةٌ وَحَرَّمَتْهُمَا آيَةٌ فَأَمَّا أَنَا فَلاَ أُحِبُّ أَنْ أَصْنَعَ ذَلِكَ ‏.‏ قَالَ فَخَرَجَ مِنْ عِنْدِهِ فَلَقِيَ رَجُلاً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَوْ كَانَ لِي مِنَ الأَمْرِ شَىْءٌ ثُمَّ وَجَدْتُ أَحَدًا فَعَلَ ذَلِكَ لَجَعَلْتُهُ نَكَالاً ‏.‏ قَالَ ابْنُ شِهَابٍ أُرَاهُ عَلِيَّ بْنَ أَبِي طَالِبٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1125
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الأَمَةِ تَكُونُ عِنْدَ الرَّجُلِ فَيُصِيبُهَا ثُمَّ يُرِيدُ أَنْ يُصِيبَ أُخْتَهَا إِنَّهَا لاَ تَحِلُّ لَهُ حَتَّى يُحَرِّمَ عَلَيْهِ فَرْجَ أُخْتِهَا بِنِكَاحٍ أَوْ عِتَاقَةٍ أَوْ كِتَابَةٍ أَوْ مَا أَشْبَهَ ذَلِكَ يُزَوِّجُهَا عَبْدَهُ أَوْ غَيْرَ عَبْدِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1126
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَهَبَ لاِبْنِهِ جَارِيَةً فَقَالَ لاَ تَمَسَّهَا فَإِنِّي قَدْ كَشَفْتُهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1127
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ قَالَ وَهَبَ سَالِمُ بْنُ عَبْدِ اللَّهِ لاِبْنِهِ جَارِيَةً قَالَ لاَ تَقْرَبْهَا فَإِنِّي قَدْ أَرَدْتُهَا فَلَمْ أَنْشَطْ إِلَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1128
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا نَهْشَلِ بْنَ الأَسْوَدِ، قَالَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ إِنِّي رَأَيْتُ جَارِيَةً لِي مُنْكَشِفًا عَنْهَا وَهِيَ فِي الْقَمَرِ فَجَلَسْتُ مِنْهَا مَجْلِسَ الرَّجُلِ مِنِ امْرَأَتِهِ فَقَالَتْ إِنِّي حَائِضٌ فَقُمْتُ فَلَمْ أَقْرَبْهَا بَعْدُ أَفَأَهَبُهَا لاِبْنِي يَطَؤُهَا فَنَهَاهُ الْقَاسِمُ عَنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1129
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، أَنَّهُ وَهَبَ لِصَاحِبٍ لَهُ جَارِيَةً ثُمَّ سَأَلَهُ عَنْهَا فَقَالَ قَدْ هَمَمْتُ أَنْ أَهَبَهَا لاِبْنِي فَيَفْعَلَ بِهَا كَذَا وَكَذَا ‏.‏ فَقَالَ عَبْدُ الْمَلِكِ لَمَرْوَانُ كَانَ أَوْرَعَ مِنْكَ وَهَبَ لاِبْنِهِ جَارِيَةً ثُمَّ قَالَ لاَ تَقْرَبْهَا فَإِنِّي قَدْ رَأَيْتُ سَاقَهَا مُنْكَشِفَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1130
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ الْمُحْصَنَاتُ مِنَ النِّسَاءِ هُنَّ أُولاَتُ الأَزْوَاجِ وَيَرْجِعُ ذَلِكَ إِلَى أَنَّ اللَّهَ حَرَّمَ الزِّنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1131
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، وَبَلَغَهُ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُمَا كَانَا يَقُولاَنِ إِذَا نَكَحَ الْحُرُّ الأَمَةَ فَمَسَّهَا فَقَدْ أَحْصَنَتْهُ ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَنْ أَدْرَكْتُ كَانَ يَقُولُ ذَلِكَ تُحْصِنُ الأَمَةُ الْحُرَّ إِذَا نَكَحَهَا فَمَسَّهَا فَقَدْ أَحْصَنَتْهُ ‏.‏ قَالَ مَالِكٌ يُحْصِنُ الْعَبْدُ الْحُرَّةَ إِذَا مَسَّهَا بِنِكَاحٍ وَلاَ تُحْصِنُ الْحُرَّةُ الْعَبْدَ إِلاَّ أَنْ يَعْتِقَ وَهُوَ زَوْجُهَا فَيَمَسَّهَا بَعْدَ عِتْقِهِ فَإِنْ فَارَقَهَا قَبْلَ أَنْ يَعْتِقَ فَلَيْسَ بِمُحْصَنٍ حَتَّى يَتَزَوَّجَ بَعْدَ عِتْقِهِ وَيَمَسَّ امْرَأَتَهُ ‏.‏ قَالَ مَالِكٌ وَالأَمَةُ إِذَا كَانَتْ تَحْتَ الْحُرِّ ثُمَّ فَارَقَهَا قَبْلَ أَنْ تَعْتِقَ فَإِنَّهُ لاَ يُحْصِنُهَا نِكَاحُهُ إِيَّاهَا وَهِيَ أَمَةٌ حَتَّى تُنْكَحَ بَعْدَ عِتْقِهَا وَيُصِيبَهَا زَوْجُهَا فَذَلِكَ إِحْصَانُهَا وَالأَمَةُ إِذَا كَانَتْ تَحْتَ الْحُرِّ فَتَعْتِقُ وَهِيَ تَحْتَهُ قَبْلَ أَنْ يُفَارِقَهَا فَإِنَّهُ يُحْصِنُهَا إِذَا عَتَقَتْ وَهِيَ عِنْدَهُ إِذَا هُوَ أَصَابَهَا بَعْدَ أَنْ تَعْتِقَ ‏.‏ وَقَالَ مَالِكٌ وَالْحُرَّةُ النَّصْرَانِيَّةُ وَالْيَهُودِيَّةُ وَالأَمَةُ الْمُسْلِمَةُ يُحْصِنَّ الْحُرَّ الْمُسْلِمَ إِذَا نَكَحَ إِحْدَاهُنَّ فَأَصَابَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ، وَالْحَسَنِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1133
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ خَوْلَةَ بِنْتَ حَكِيمٍ، دَخَلَتْ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَتْ إِنَّ رَبِيعَةَ بْنَ أُمَيَّةَ اسْتَمْتَعَ بِامْرَأَةٍ فَحَمَلَتْ مِنْهُ ‏.‏ فَخَرَجَ عُمَرُ بْنُ الْخَطَّابِ فَزِعًا يَجُرُّ رِدَاءَهُ فَقَالَ هَذِهِ الْمُتْعَةُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهَا لَرَجَمْتُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1134
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، يَقُولُ يَنْكِحُ الْعَبْدُ أَرْبَعَ نِسْوَةٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالْعَبْدُ مُخَالِفٌ لِلْمُحَلِّلِ إِنْ أَذِنَ لَهُ سَيِّدُهُ ثَبَتَ نِكَاحُهُ وَإِنْ لَمْ يَأْذَنْ لَهُ سَيِّدُهُ فُرِّقَ بَيْنَهُمَا وَالْمُحَلِّلُ يُفَرَّقُ بَيْنَهُمَا عَلَى كُلِّ حَالٍ إِذَا أُرِيدَ بِالنِّكَاحِ التَّحْلِيلُ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ إِذَا مَلَكَتْهُ امْرَأَتُهُ أَوِ الزَّوْجُ يَمْلِكُ امْرَأَتَهُ إِنَّ مِلْكَ كُلِّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ يَكُونُ فَسْخًا بِغَيْرِ طَلاَقٍ وَإِنْ تَرَاجَعَا بِنِكَاحٍ بَعْدُ لَمْ تَكُنْ تِلْكَ الْفُرْقَةُ طَلاَقًا ‏.‏ قَالَ مَالِكٌ وَالْعَبْدُ إِذَا أَعْتَقَتْهُ امْرَأَتُهُ إِذَا مَلَكَتْهُ وَهِيَ فِي عِدَّةٍ مِنْهُ لَمْ يَتَرَاجَعَا إِلاَّ بِنِكَاحٍ جَدِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1135
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ بَلَغَهُ أَنَّ نِسَاءً، كُنَّ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُسْلِمْنَ بِأَرْضِهِنَّ وَهُنَّ غَيْرُ مُهَاجِرَاتٍ وَأَزْوَاجُهُنَّ حِينَ أَسْلَمْنَ كُفَّارٌ مِنْهُنَّ بِنْتُ الْوَلِيدِ بْنِ الْمُغِيرَةِ ‏.‏ وَكَانَتْ تَحْتَ صَفْوَانَ بْنِ أُمَيَّةَ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا صَفْوَانُ بْنُ أُمَيَّةَ مِنَ الإِسْلاَمِ فَبَعَثَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ابْنَ عَمِّهِ وَهْبَ بْنَ عُمَيْرٍ بِرِدَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَمَانًا لِصَفْوَانَ بْنِ أُمَيَّةَ وَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الإِسْلاَمِ وَأَنْ يَقْدَمَ عَلَيْهِ فَإِنْ رَضِيَ أَمْرًا قَبِلَهُ وَإِلاَّ سَيَّرَهُ شَهْرَيْنِ فَلَمَّا قَدِمَ صَفْوَانُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِرِدَائِهِ نَادَاهُ عَلَى رُءُوسِ النَّاسِ فَقَالَ يَا مُحَمَّدُ إِنَّ هَذَا وَهْبَ بْنَ عُمَيْرٍ جَاءَنِي بِرِدَائِكَ وَزَعَمَ أَنَّكَ دَعَوْتَنِي إِلَى الْقُدُومِ عَلَيْكَ فَإِنْ رَضِيتُ أَمْرًا قَبِلْتُهُ وَإِلاَّ سَيَّرْتَنِي شَهْرَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْزِلْ أَبَا وَهْبٍ ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ لاَ أَنْزِلُ حَتَّى تُبَيِّنَ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَلْ لَكَ تَسِيرُ أَرْبَعَةَ أَشْهُرٍ ‏\"‏ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم قِبَلَ هَوَازِنَ بِحُنَيْنٍ ‏.‏ فَأَرْسَلَ إِلَى صَفْوَانَ بْنِ أُمَيَّةَ يَسْتَعِيرُهُ أَدَاةً وَسِلاَحًا عِنْدَهُ فَقَالَ صَفْوَانُ أَطَوْعًا أَمْ كَرْهًا فَقَالَ ‏\"‏ بَلْ طَوْعًا ‏\"‏ ‏.‏ فَأَعَارَهُ الأَدَاةَ وَالسِّلاَحَ الَّتِي عِنْدَهُ ثُمَّ خَرَجَ صَفْوَانُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ كَافِرٌ فَشَهِدَ حُنَيْنًا وَالطَّائِفَ وَهُوَ كَافِرٌ وَامْرَأَتُهُ مُسْلِمَةٌ وَلَمْ يُفَرِّقْ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ امْرَأَتِهِ حَتَّى أَسْلَمَ صَفْوَانُ وَاسْتَقَرَّتْ عِنْدَهُ امْرَأَتُهُ بِذَلِكَ النِّكَاحِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ كَانَ بَيْنَ إِسْلاَمِ صَفْوَانَ وَبَيْنَ إِسْلاَمِ امْرَأَتِهِ نَحْوٌ مِنْ شَهْرٍ ‏.‏ قَالَ ابْنُ شِهَابٍ وَلَمْ يَبْلُغْنَا أَنَّ امْرَأَةً هَاجَرَتْ إِلَى اللَّهِ وَرَسُولِهِ وَزَوْجُهَا كَافِرٌ مُقِيمٌ بِدَارِ الْكُفْرِ إِلاَّ فَرَّقَتْ هِجْرَتُهَا بَيْنَهَا وَبَيْنَ زَوْجِهَا إِلاَّ أَنْ يَقْدَمَ زَوْجُهَا مُهَاجِرًا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1137
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أُمَّ حَكِيمٍ بِنْتَ الْحَارِثِ بْنِ هِشَامٍ، وَكَانَتْ، تَحْتَ عِكْرِمَةَ بْنِ أَبِي جَهْلٍ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا عِكْرِمَةُ بْنُ أَبِي جَهْلٍ مِنَ الإِسْلاَمِ حَتَّى قَدِمَ الْيَمَنَ فَارْتَحَلَتْ أُمُّ حَكِيمٍ حَتَّى قَدِمَتْ عَلَيْهِ بِالْيَمَنِ فَدَعَتْهُ إِلَى الإِسْلاَمِ فَأَسْلَمَ وَقَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبَ إِلَيْهِ فَرِحًا وَمَا عَلَيْهِ رِدَاءٌ حَتَّى بَايَعَهُ فَثَبَتَا عَلَى نِكَاحِهِمَا ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَإِذَا أَسْلَمَ الرَّجُلُ قَبْلَ امْرَأَتِهِ وَقَعَتِ الْفُرْقَةُ بَيْنَهُمَا إِذَا عُرِضَ عَلَيْهَا الإِسْلاَمُ فَلَمْ تُسْلِمْ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏وَلاَ تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ‏}‏‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1138
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِهِ أَثَرُ صُفْرَةٍ فَسَأَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَمْ سُقْتَ إِلَيْهَا ‏\"‏ ‏.‏ فَقَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1139
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ لَقَدْ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُولِمُ بِالْوَلِيمَةِ مَا فِيهَا خُبْزٌ وَلاَ لَحْمٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1140
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةٍ فَلْيَأْتِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1141
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1142
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ‏.‏ قَالَ أَنَسٌ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ فَقَرَّبَ إِلَيْهِ خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءُ ‏.‏ قَالَ أَنَسٌ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الْقَصْعَةِ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ ذَلِكَ الْيَوْمِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1143
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَزَوَّجَ أَحَدُكُمُ الْمَرْأَةَ أَوِ اشْتَرَى الْجَارِيَةَ فَلْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى الْبَعِيرَ فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1144
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ رَجُلاً، خَطَبَ إِلَى رَجُلٍ أُخْتَهُ فَذَكَرَ أَنَّهَا قَدْ كَانَتْ أَحْدَثَتْ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَضَرَبَهُ - أَوْ كَادَ يَضْرِبُهُ - ثُمَّ قَالَ مَا لَكَ وَلِلْخَبَرِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1145
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، كَانَا يَقُولاَنِ فِي الرَّجُلِ يَكُونُ عِنْدَهُ أَرْبَعُ نِسْوَةٍ فَيُطَلِّقُ إِحْدَاهُنَّ الْبَتَّةَ أَنَّهُ يَتَزَوَّجُ إِنْ شَاءَ وَلاَ يَنْتَظِرُ أَنْ تَنْقَضِيَ عِدَّتُهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1146
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، أَفْتَيَا الْوَلِيدَ بْنَ عَبْدِ الْمَلِكِ عَامَ قَدِمَ الْمَدِينَةَ بِذَلِكَ غَيْرَ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ قَالَ طَلَّقَهَا فِي مَجَالِسَ شَتَّى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1147
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ ثَلاَثٌ لَيْسَ فِيهِنَّ لَعِبٌ النِّكَاحُ وَالطَّلاَقُ وَالْعِتْقُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1148
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُ تَزَوَّجَ بِنْتَ مُحَمَّدِ بْنِ مَسْلَمَةَ الأَنْصَارِيِّ فَكَانَتْ عِنْدَهُ حَتَّى كَبِرَتْ فَتَزَوَّجَ عَلَيْهَا فَتَاةً شَابَّةً فَآثَرَ الشَّابَّةَ عَلَيْهَا فَنَاشَدَتْهُ الطَّلاَقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ أَمْهَلَهَا حَتَّى إِذَا كَادَتْ تَحِلُّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلاَقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلاَقَ فَقَالَ مَا شِئْتِ إِنَّمَا بَقِيَتْ وَاحِدَةٌ فَإِنْ شِئْتِ اسْتَقْرَرْتِ عَلَى مَا تَرَيْنَ مِنَ الأُثْرَةِ وَإِنْ شِئْتِ فَارَقْتُكِ ‏.‏ قَالَتْ بَلْ أَسْتَقِرُّ عَلَى الأُثْرَةِ ‏.‏ فَأَمْسَكَهَا عَلَى ذَلِكَ وَلَمْ يَرَ رَافِعٌ عَلَيْهِ إِثْمًا حِينَ قَرَّتْ عِنْدَهُ عَلَى الأُثْرَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1149
			}
		}
	]
}