{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"3": "Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ أَرَادَ أَنْ يَتَّخِذَ خَشَبَتَيْنِ يُضْرَبُ بِهِمَا لِيَجْتَمِعَ النَّاسُ لِلصَّلاَةِ فَأُرِيَ عَبْدُ اللَّهِ بْنُ زَيْدٍ الأَنْصَارِيُّ ثُمَّ مِنْ بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ خَشَبَتَيْنِ فِي النَّوْمِ فَقَالَ إِنَّ هَاتَيْنِ لَنَحْوٌ مِمَّا يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ أَلاَ تُؤَذِّنُونَ لِلصَّلاَةِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ اسْتَيْقَظَ فَذَكَرَ لَهُ ذَلِكَ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالأَذَانِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mursal Sahih Isnaad"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": 149,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، عَنْ أَبِيهِ، وَإِسْحَاقَ بْنِ عَبْدِ اللَّهِ، أَنَّهُمَا أَخْبَرَاهُ أَنَّهُمَا، سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا ثُوِّبَ بِالصَّلاَةِ فَلاَ تَأْتُوهَا وَأَنْتُمْ تَسْعَوْنَ وَأْتُوهَا وَعَلَيْكُمُ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُّوا فَإِنَّ أَحَدَكُمْ فِي صَلاَةٍ مَا كَانَ يَعْمِدُ إِلَى الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": 150,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الأَنْصَارِيِّ، ثُمَّ الْمَازِنِيِّ عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ لَهُ ‏ \"‏ إِنِّي أَرَاكَ تُحِبُّ الْغَنَمَ وَالْبَادِيَةَ فَإِذَا كُنْتَ فِي غَنَمِكَ أَوْ بَادِيَتِكَ فَأَذَّنْتَ بِالصَّلاَةِ فَارْفَعْ صَوْتَكَ بِالنِّدَاءِ فَإِنَّهُ لاَ يَسْمَعُ مَدَى صَوْتِ الْمُؤَذِّنِ جِنٌّ وَلاَ إِنْسٌ وَلاَ شَىْءٌ إِلاَّ شَهِدَ لَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو سَعِيدٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": 151,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نُودِيَ لِلصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ النِّدَاءَ فَإِذَا قُضِيَ النِّدَاءُ أَقْبَلَ حَتَّى إِذَا ثُوِّبَ بِالصَّلاَةِ أَدْبَرَ حَتَّى إِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطِرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ يَقُولُ اذْكُرْ كَذَا اذْكُرْ كَذَا لِمَا لَمْ يَكُنْ يَذْكُرُ حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَمْ صَلَّى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّهُ قَالَ سَاعَتَانِ يُفْتَحُ لَهُمَا أَبْوَابُ السَّمَاءِ وَقَلَّ دَاعٍ تُرَدُّ عَلَيْهِ دَعْوَتُهُ حَضْرَةُ النِّدَاءِ لِلصَّلاَةِ وَالصَّفُّ فِي سَبِيلِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": 153,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْمُؤَذِّنَ، جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِ يُؤْذِنُهُ لِصَلاَةِ الصُّبْحِ فَوَجَدَهُ نَائِمًا فَقَالَ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ ‏.‏ فَأَمَرَهُ عُمَرُ أَنْ يَجْعَلَهَا فِي نِدَاءِ الصُّبْحِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": 154,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ مَا أَعْرِفُ شَيْئًا مِمَّا أَدْرَكْتُ عَلَيْهِ النَّاسَ إِلاَّ النِّدَاءَ بِالصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": 155,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، سَمِعَ الإِقَامَةَ، وَهُوَ بِالْبَقِيعِ فَأَسْرَعَ الْمَشْىَ إِلَى الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": 156,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَذَّنَ بِالصَّلاَةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ أَلاَ صَلُّوا فِي الرِّحَالِ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ ذَاتُ مَطَرٍ يَقُولُ ‏ \"‏ أَلاَ صَلُّوا فِي الرِّحَالِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَزِيدُ عَلَى الإِقَامَةِ فِي السَّفَرِ إِلاَّ فِي الصُّبْحِ فَإِنَّهُ كَانَ يُنَادِي فِيهَا وَيُقِيمُ وَكَانَ يَقُولُ إِنَّمَا الأَذَانُ لِلإِمَامِ الَّذِي يَجْتَمِعُ النَّاسُ إِلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": 158,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، قَالَ لَهُ إِذَا كُنْتَ فِي سَفَرٍ فَإِنْ شِئْتَ أَنْ تُؤَذِّنَ وَتُقِيمَ فَعَلْتَ وَإِنْ شِئْتَ فَأَقِمْ وَلاَ تُؤَذِّنْ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ لاَ بَأْسَ أَنْ يُؤَذِّنَ الرَّجُلُ وَهُوَ رَاكِبٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": 159,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ مَنْ صَلَّى بِأَرْضِ فَلاَةٍ صَلَّى عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ فَإِذَا أَذَّنَ وَأَقَامَ الصَّلاَةَ أَوْ أَقَامَ صَلَّى وَرَاءَهُ مِنَ الْمَلاَئِكَةِ أَمْثَالُ الْجِبَالِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": 160,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ بِلاَلاً يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": 161,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ بِلاَلاً يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ ‏\"‏ ‏.‏ قَالَ وَكَانَ ابْنُ أُمِّ مَكْتُومٍ رَجُلاً أَعْمَى لاَ يُنَادِي حَتَّى يُقَالَ لَهُ أَصْبَحْتَ أَصْبَحْتَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": 162,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا افْتَتَحَ الصَّلاَةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ أَيْضًا وَقَالَ ‏ \"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏ ‏.‏ وَكَانَ لاَ يَفْعَلُ ذَلِكَ فِي السُّجُودِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": 163,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُ فِي الصَّلاَةِ كُلَّمَا خَفَضَ وَرَفَعَ فَلَمْ تَزَلْ تِلْكَ صَلاَتَهُ حَتَّى لَقِيَ اللَّهَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": 164,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْفَعُ يَدَيْهِ فِي الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": 165,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يُصَلِّي لَهُمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَإِذَا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لأَشْبَهُكُمْ بِصَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُكَبِّرُ فِي الصَّلاَةِ كُلَّمَا خَفَضَ وَرَفَعَ ‏.‏ وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا افْتَتَحَ الصَّلاَةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَهُمَا دُونَ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": 168,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يُعَلِّمُهُمُ التَّكْبِيرَ فِي الصَّلاَةِ ‏.‏ قَالَ فَكَانَ يَأْمُرُنَا أَنْ نُكَبِّرَ كُلَّمَا خَفَضْنَا وَرَفَعْنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": 169,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ إِذَا أَدْرَكَ الرَّجُلُ الرَّكْعَةَ فَكَبَّرَ تَكْبِيرَةً وَاحِدَةً أَجْزَأَتْ عَنْهُ تِلْكَ التَّكْبِيرَةُ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ إِذَا نَوَى بِتِلْكَ التَّكْبِيرَةِ افْتِتَاحَ الصَّلاَةِ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ دَخَلَ مَعَ الإِمَامِ فَنَسِيَ تَكْبِيرَةَ الاِفْتِتَاحِ وَتَكْبِيرَةَ الرُّكُوعِ حَتَّى صَلَّى رَكْعَةً ثُمَّ ذَكَرَ أَنَّهُ لَمْ يَكُنْ كَبَّرَ تَكْبِيرَةَ الاِفْتِتَاحِ وَلاَ عِنْدَ الرُّكُوعِ وَكَبَّرَ فِي الرَّكْعَةِ الثَّانِيَةِ قَالَ يَبْتَدِئُ صَلاَتَهُ أَحَبُّ إِلَىَّ وَلَوْ سَهَا مَعَ الإِمَامِ عَنْ تَكْبِيرَةِ الاِفْتِتَاحِ وَكَبَّرَ فِي الرُّكُوعِ الأَوَّلِ رَأَيْتُ ذَلِكَ مُجْزِيًا عَنْهُ إِذَا نَوَى بِهَا تَكْبِيرَةَ الاِفْتِتَاحِ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يُصَلِّي لِنَفْسِهِ فَنَسِيَ تَكْبِيرَةَ الاِفْتِتَاحِ إِنَّهُ يَسْتَأْنِفُ صَلاَتَهُ ‏.‏ وَقَالَ مَالِكٌ فِي إِمَامٍ يَنْسَى تَكْبِيرَةَ الاِفْتِتَاحِ حَتَّى يَفْرُغَ مِنْ صَلاَتِهِ قَالَ أَرَى أَنْ يُعِيدَ وَيُعِيدُ مَنْ خَلْفَهُ الصَّلاَةَ وَإِنْ كَانَ مَنْ خَلْفَهُ قَدْ كَبَّرُوا فَإِنَّهُمْ يُعِيدُونَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": 170,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ بِالطُّورِ فِي الْمَغْرِبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": 171,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ أُمَّ الْفَضْلِ بِنْتَ الْحَارِثِ، سَمِعَتْهُ وَهُوَ، يَقْرَأُ ‏{‏وَالْمُرْسَلاَتِ عُرْفًا‏}‏ فَقَالَتْ لَهُ يَا بُنَىَّ لَقَدْ ذَكَّرْتَنِي بِقِرَاءَتِكَ هَذِهِ السُّورَةَ إِنَّهَا لآخِرُ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهَا فِي الْمَغْرِبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": 172,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى سُلَيْمَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ قَيْسِ بْنِ الْحَارِثِ، عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّ، قَالَ قَدِمْتُ الْمَدِينَةَ فِي خِلاَفَةِ أَبِي بَكْرٍ الصِّدِّيقِ فَصَلَّيْتُ وَرَاءَهُ الْمَغْرِبَ فَقَرَأَ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ بِأُمِّ الْقُرْآنِ وَسُورَةٍ سُورَةٍ مِنْ قِصَارِ الْمُفَصَّلِ ثُمَّ قَامَ فِي الثَّالِثَةِ فَدَنَوْتُ مِنْهُ حَتَّى إِنَّ ثِيَابِي لَتَكَادُ أَنْ تَمَسَّ ثِيَابَهُ فَسَمِعْتُهُ قَرَأَ بِأُمِّ الْقُرْآنِ وَبِهَذِهِ الآيَةِ ‏{‏رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ‏}‏‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": 173,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا صَلَّى وَحْدَهُ يَقْرَأُ فِي الأَرْبَعِ جَمِيعًا فِي كُلِّ رَكْعَةٍ بِأُمِّ الْقُرْآنِ وَسُورَةٍ مِنَ الْقُرْآنِ وَكَانَ يَقْرَأُ أَحْيَانًا بِالسُّورَتَيْنِ وَالثَّلاَثِ فِي الرَّكْعَةِ الْوَاحِدَةِ مِنْ صَلاَةِ الْفَرِيضَةِ وَيَقْرَأُ فِي الرَّكْعَتَيْنِ مِنَ الْمَغْرِبِ كَذَلِكَ بِأُمِّ الْقُرْآنِ وَسُورَةٍ سُورَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": 174,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ الأَنْصَارِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّهُ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعِشَاءَ فَقَرَأَ فِيهَا بِالتِّينِ وَالزَّيْتُونِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": 175,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُبْسِ الْقَسِّيِّ وَعَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ قِرَاءَةِ الْقُرْآنِ فِي الرُّكُوعِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": 176,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي حَازِمٍ التَّمَّارِ، عَنِ الْبَيَاضِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَلَى النَّاسِ وَهُمْ يُصَلُّونَ وَقَدْ عَلَتْ أَصْوَاتُهُمْ بِالْقِرَاءَةِ فَقَالَ ‏ \"‏ إِنَّ الْمُصَلِّيَ يُنَاجِي رَبَّهُ فَلْيَنْظُرْ بِمَا يُنَاجِيهِ بِهِ وَلاَ يَجْهَرْ بَعْضُكُمْ عَلَى بَعْضٍ بِالْقُرْآنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": 177,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ قُمْتُ وَرَاءَ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ كَانَ لاَ يَقْرَأُ ‏{‏بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ‏}‏ إِذَا افْتَتَحَ الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": 178,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنَّا نَسْمَعُ قِرَاءَةَ عُمَرَ بْنِ الْخَطَّابِ عِنْدَ دَارِ أَبِي جَهْمٍ بِالْبَلاَطِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": 179,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا فَاتَهُ شَىْءٌ مِنَ الصَّلاَةِ مَعَ الإِمَامِ فِيمَا جَهَرَ فِيهِ الإِمَامُ بِالْقِرَاءَةِ أَنَّهُ إِذَا سَلَّمَ الإِمَامُ - قَامَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَرَأَ لِنَفْسِهِ فِيمَا يَقْضِي وَجَهَرَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": 180,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، أَنَّهُ قَالَ كُنْتُ أُصَلِّي إِلَى جَانِبِ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ فَيَغْمِزُنِي فَأَفْتَحُ عَلَيْهِ وَنَحْنُ نُصَلِّي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": 181,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، صَلَّى الصُّبْحَ فَقَرَأَ فِيهَا سُورَةَ الْبَقَرَةِ فِي الرَّكْعَتَيْنِ كِلْتَيْهِمَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، يَقُولُ صَلَّيْنَا وَرَاءَ عُمَرَ بْنِ الْخَطَّابِ الصُّبْحَ فَقَرَأَ فِيهَا بِسُورَةِ يُوسُفَ وَسُورَةِ الْحَجِّ قِرَاءَةً بَطِيئَةً فَقُلْتُ وَاللَّهِ إِذًا لَقَدْ كَانَ يَقُومُ حِينَ يَطْلُعُ الْفَجْرُ ‏.‏ قَالَ أَجَلْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَرَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّ الْفُرَافِصَةَ بْنَ عُمَيْرٍ الْحَنَفِيَّ، قَالَ مَا أَخَذْتُ سُورَةَ يُوسُفَ إِلاَّ مِنْ قِرَاءَةِ عُثْمَانَ بْنِ عَفَّانَ إِيَّاهَا فِي الصُّبْحِ مِنْ كَثْرَةِ مَا كَانَ يُرَدِّدُهَا لَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": 184,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقْرَأُ فِي الصُّبْحِ فِي السَّفَرِ بِالْعَشْرِ السُّوَرِ الأُوَلِ مِنَ الْمُفَصَّلِ فِي كُلِّ رَكْعَةٍ بِأُمِّ الْقُرْآنِ وَسُورَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": 185,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، أَنَّ أَبَا سَعِيدٍ، مَوْلَى عَامِرِ بْنِ كُرَيْزٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَادَى أُبَىَّ بْنَ كَعْبٍ وَهُوَ يُصَلِّي فَلَمَّا فَرَغَ مِنْ صَلاَتِهِ لَحِقَهُ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَلَى يَدِهِ وَهُوَ يُرِيدُ أَنْ يَخْرُجَ مِنْ بَابِ الْمَسْجِدِ فَقَالَ ‏\"‏ إِنِّي لأَرْجُو أَنْ لاَ تَخْرُجَ مِنَ الْمَسْجِدِ حَتَّى تَعْلَمَ سُورَةً مَا أَنْزَلَ اللَّهُ فِي التَّوْرَاةِ وَلاَ فِي الإِنْجِيلِ وَلاَ فِي الْقُرْآنِ مِثْلَهَا ‏\"‏ ‏.‏ قَالَ أُبَىٌّ فَجَعَلْتُ أُبْطِئُ فِي الْمَشْىِ رَجَاءَ ذَلِكَ ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ السُّورَةَ الَّتِي وَعَدْتَنِي ‏.‏ قَالَ ‏\"‏ كَيْفَ تَقْرَأُ إِذَا افْتَتَحْتَ الصَّلاَةَ ‏\"‏ ‏.‏ قَالَ فَقَرَأْتُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ حَتَّى أَتَيْتُ عَلَى آخِرِهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ هَذِهِ السُّورَةُ وَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": 186,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ مَنْ صَلَّى رَكْعَةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَلَمْ يُصَلِّ إِلاَّ وَرَاءَ الإِمَامِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": 187,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، أَنَّهُ سَمِعَ أَبَا السَّائِبِ، مَوْلَى هِشَامِ بْنِ زُهْرَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ صَلَّى صَلاَةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ خِدَاجٌ هِيَ خِدَاجٌ هِيَ خِدَاجٌ غَيْرُ تَمَامٍ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ يَا أَبَا هُرَيْرَةَ إِنِّي أَحْيَانًا أَكُونُ وَرَاءَ الإِمَامِ قَالَ فَغَمَزَ ذِرَاعِي ثُمَّ قَالَ اقْرَأْ بِهَا فِي نَفْسِكَ يَا فَارِسِيُّ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى قَسَمْتُ الصَّلاَةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ فَنِصْفُهَا لِي وَنِصْفُهَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَءُوا يَقُولُ الْعَبْدُ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى حَمِدَنِي عَبْدِي وَيَقُولُ الْعَبْدُ ‏{‏الرَّحْمَنِ الرَّحِيمِ‏}‏ يَقُولُ اللَّهُ أَثْنَى عَلَىَّ عَبْدِي وَيَقُولُ الْعَبْدُ ‏{‏مَالِكِ يَوْمِ الدِّينِ‏}‏ يَقُولُ اللَّهُ مَجَّدَنِي عَبْدِي يَقُولُ الْعَبْدُ ‏{‏إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ‏}‏ فَهَذِهِ الآيَةُ بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ يَقُولُ الْعَبْدُ ‏{‏اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ ‏}‏ فَهَؤُلاَءِ لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": 188,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقْرَأُ خَلْفَ الإِمَامِ فِيمَا لاَ يَجْهَرُ فِيهِ الإِمَامُ بِالْقِرَاءَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَعَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَقْرَأُ خَلْفَ الإِمَامِ فِيمَا لاَ يَجْهَرُ فِيهِ الإِمَامُ بِالْقِرَاءَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، أَنَّ نَافِعَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ، كَانَ يَقْرَأُ خَلْفَ الإِمَامِ فِيمَا لاَ يَجْهَرُ فِيهِ بِالْقِرَاءَةِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": 191,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا سُئِلَ هَلْ يَقْرَأُ أَحَدٌ خَلْفَ الإِمَامِ قَالَ إِذَا صَلَّى أَحَدُكُمْ خَلْفَ الإِمَامِ فَحَسْبُهُ قِرَاءَةُ الإِمَامِ وَإِذَا صَلَّى وَحْدَهُ فَلْيَقْرَأْ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ لاَ يَقْرَأُ خَلْفَ الإِمَامِ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا أَنْ يَقْرَأَ الرَّجُلُ وَرَاءَ الإِمَامِ فِيمَا لاَ يَجْهَرُ فِيهِ الإِمَامُ بِالْقِرَاءَةِ وَيَتْرُكُ الْقِرَاءَةَ فِيمَا يَجْهَرُ فِيهِ الإِمَامُ بِالْقِرَاءَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": 192,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ أُكَيْمَةَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنْ صَلاَةٍ جَهَرَ فِيهَا بِالْقِرَاءَةِ فَقَالَ ‏\"‏ هَلْ قَرَأَ مَعِي مِنْكُمْ أَحَدٌ آنِفًا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ نَعَمْ أَنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي أَقُولُ مَا لِي أُنَازَعُ الْقُرْآنَ ‏\"‏ ‏.‏ فَانْتَهَى النَّاسُ عَنِ الْقِرَاءَةِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيمَا جَهَرَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْقِرَاءَةِ حِينَ سَمِعُوا ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": 193,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ آمِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": 194,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَالَ الإِمَامُ ‏{‏غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ‏}‏ فَقُولُوا آمِينَ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": 195,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَالَ أَحَدُكُمْ آمِينَ وَقَالَتِ الْمَلاَئِكَةُ فِي السَّمَاءِ آمِينَ فَوَافَقَتْ إِحْدَاهُمَا الأُخْرَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": 196,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَالَ الإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": 197,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْمُعَاوِيِّ، أَنَّهُ قَالَ رَآنِي عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا أَعْبَثُ بِالْحَصْبَاءِ فِي الصَّلاَةِ فَلَمَّا انْصَرَفْتُ نَهَانِي وَقَالَ اصْنَعْ كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ‏.‏ فَقُلْتُ وَكَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ قَالَ كَانَ إِذَا جَلَسَ فِي الصَّلاَةِ وَضَعَ كَفَّهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَقَبَضَ أَصَابِعَهُ كُلَّهَا وَأَشَارَ بِأَصْبُعِهِ الَّتِي تَلِي الإِبْهَامَ وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَقَالَ هَكَذَا كَانَ يَفْعَلُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَصَلَّى، إِلَى جَنْبِهِ رَجُلٌ فَلَمَّا جَلَسَ الرَّجُلُ فِي أَرْبَعٍ تَرَبَّعَ وَثَنَى رِجْلَيْهِ فَلَمَّا انْصَرَفَ عَبْدُ اللَّهِ عَابَ ذَلِكَ عَلَيْهِ فَقَالَ الرَّجُلُ فَإِنَّكَ تَفْعَلُ ذَلِكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَإِنِّي أَشْتَكِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": 199,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، عَنِ الْمُغِيرَةِ بْنِ حَكِيمٍ، أَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ عُمَرَ يَرْجِعُ فِي سَجْدَتَيْنِ فِي الصَّلاَةِ عَلَى صُدُورِ قَدَمَيْهِ فَلَمَّا انْصَرَفَ ذَكَرَ لَهُ ذَلِكَ فَقَالَ إِنَّهَا لَيْسَتْ سُنَّةَ الصَّلاَةِ وَإِنَّمَا أَفْعَلُ هَذَا مِنْ أَجْلِ أَنِّي أَشْتَكِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": 200,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، كَانَ يَرَى عَبْدَ اللَّهِ بْنَ عُمَرَ يَتَرَبَّعُ فِي الصَّلاَةِ إِذَا جَلَسَ قَالَ فَفَعَلْتُهُ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ فَنَهَانِي عَبْدُ اللَّهِ وَقَالَ إِنَّمَا سُنَّةُ الصَّلاَةِ أَنْ تَنْصِبَ رِجْلَكَ الْيُمْنَى وَتَثْنِيَ رِجْلَكَ الْيُسْرَى ‏.‏ فَقُلْتُ لَهُ فَإِنَّكَ تَفْعَلُ ذَلِكَ ‏.‏ فَقَالَ إِنَّ رِجْلَىَّ لاَ تَحْمِلاَنِّي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": 201,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، أَرَاهُمُ الْجُلُوسَ فِي التَّشَهُّدِ فَنَصَبَ رِجْلَهُ الْيُمْنَى وَثَنَى رِجْلَهُ الْيُسْرَى وَجَلَسَ عَلَى وَرِكِهِ الأَيْسَرِ وَلَمْ يَجْلِسْ عَلَى قَدَمِهِ ثُمَّ قَالَ أَرَانِي هَذَا عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَحَدَّثَنِي أَنَّ أَبَاهُ كَانَ يَفْعَلُ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": 202,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، وَهُوَ عَلَى الْمِنْبَرِ يُعَلِّمُ النَّاسَ التَّشَهُّدَ يَقُولُ قُولُوا التَّحِيَّاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": 203,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَتَشَهَّدُ فَيَقُولُ بِاسْمِ اللَّهِ التَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ السَّلاَمُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ شَهِدْتُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ شَهِدْتُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏.‏ يَقُولُ هَذَا فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ وَيَدْعُو إِذَا قَضَى تَشَهُّدَهُ بِمَا بَدَا لَهُ فَإِذَا جَلَسَ فِي آخِرِ صَلاَتِهِ تَشَهَّدَ كَذَلِكَ أَيْضًا إِلاَّ أَنَّهُ يُقَدِّمُ التَّشَهُّدَ ثُمَّ يَدْعُو بِمَا بَدَا لَهُ فَإِذَا قَضَى تَشَهُّدَهُ وَأَرَادَ أَنْ يُسَلِّمَ قَالَ السَّلاَمُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ ‏.‏ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ عَنْ يَمِينِهِ ثُمَّ يَرُدُّ عَلَى الإِمَامِ فَإِنْ سَلَّمَ عَلَيْهِ أَحَدٌ عَنْ يَسَارِهِ رَدَّ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": 204,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ إِذَا تَشَهَّدَتِ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏.‏ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ ‏.‏ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": 205,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ إِذَا تَشَهَّدَتِ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": 206,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ وَنَافِعًا مَوْلَى ابْنِ عُمَرَ عَنْ رَجُلٍ، دَخَلَ مَعَ الإِمَامِ فِي الصَّلاَةِ وَقَدْ سَبَقَهُ الإِمَامُ بِرَكْعَةٍ أَيَتَشَهَّدُ مَعَهُ فِي الرَّكْعَتَيْنِ وَالأَرْبَعِ وَإِنْ كَانَ ذَلِكَ لَهُ وِتْرًا فَقَالاَ لِيَتَشَهَّدْ مَعَهُ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": 207,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ، عَنْ مَلِيحِ بْنِ عَبْدِ اللَّهِ السَّعْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ الَّذِي يَرْفَعُ رَأْسَهُ وَيَخْفِضُهُ قَبْلَ الإِمَامِ فَإِنَّمَا نَاصِيَتُهُ بِيَدِ شَيْطَانٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": 208,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقَصُرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالَ النَّاسُ نَعَمْ ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 209,
			"arabicnumber": 209,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ أَنَّهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْعَصْرِ فَسَلَّمَ فِي رَكْعَتَيْنِ فَقَامَ ذُو الْيَدَيْنِ فَقَالَ أَقَصُرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ ذَلِكَ لَمْ يَكُنْ ‏\"‏ ‏.‏ فَقَالَ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّاسِ فَقَالَ ‏\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَمَّ مَا بَقِيَ مِنَ الصَّلاَةِ ثُمَّ سَجَدَ سَجْدَتَيْنِ بَعْدَ التَّسْلِيمِ وَهُوَ جَالِسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": 210,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ، قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكَعَ رَكْعَتَيْنِ مِنْ إِحْدَى صَلاَتَىِ النَّهَارِ - الظُّهْرِ أَوِ الْعَصْرِ - فَسَلَّمَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ أَقَصُرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا قَصُرَتِ الصَّلاَةُ وَمَا نَسِيتُ ‏\"‏ ‏.‏ فَقَالَ ذُو الشِّمَالَيْنِ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّاسِ فَقَالَ ‏\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ فَأَتَمَّ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا بَقِيَ مِنَ الصَّلاَةِ ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": 211,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، مِثْلَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ كُلُّ سَهْوٍ كَانَ نُقْصَانًا مِنَ الصَّلاَةِ فَإِنَّ سُجُودَهُ قَبْلَ السَّلاَمِ وَكُلُّ سَهْوٍ كَانَ زِيَادَةً فِي الصَّلاَةِ فَإِنَّ سُجُودَهُ بَعْدَ السَّلاَمِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": 212,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلَمْ يَدْرِ كَمْ صَلَّى أَثَلاَثًا أَمْ أَرْبَعًا فَلْيُصَلِّي رَكْعَةً وَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ فَإِنْ كَانَتِ الرَّكْعَةُ الَّتِي صَلَّى خَامِسَةً شَفَعَهَا بِهَاتَيْنِ السَّجْدَتَيْنِ وَإِنْ كَانَتْ رَابِعَةً فَالسَّجْدَتَانِ تَرْغِيمٌ لِلشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَتَوَخَّ الَّذِي يَظُنُّ أَنَّهُ نَسِيَ مِنْ صَلاَتِهِ فَلْيُصَلِّهِ ثُمَّ لِيَسْجُدْ سَجْدَتَىِ السَّهْوِ وَهُوَ جَالِسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": 214,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَفِيفِ بْنِ عَمْرٍو السَّهْمِيِّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ وَكَعْبَ الأَحْبَارِ عَنِ الَّذِي، يَشُكُّ فِي صَلاَتِهِ فَلاَ يَدْرِي كَمْ صَلَّى أَثَلاَثًا أَمْ أَرْبَعًا فَكِلاَهُمَا قَالَ لِيُصَلِّي رَكْعَةً أُخْرَى ثُمَّ لِيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": 215,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا سُئِلَ عَنِ النِّسْيَانِ، فِي الصَّلاَةِ قَالَ لِيَتَوَخَّ أَحَدُكُمُ الَّذِي يَظُنُّ أَنَّهُ نَسِيَ مِنْ صَلاَتِهِ فَلْيُصَلِّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": 216,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ فَلَمَّا قَضَى صَلاَتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": 217,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ فَقَامَ فِي اثْنَتَيْنِ وَلَمْ يَجْلِسْ فِيهِمَا فَلَمَّا قَضَى صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ بَعْدَ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": 218,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ أَهْدَى أَبُو جَهْمِ بْنُ حُذَيْفَةَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَمِيصَةً شَامِيَّةً لَهَا عَلَمٌ فَشَهِدَ فِيهَا الصَّلاَةَ فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ رُدِّي هَذِهِ الْخَمِيصَةَ إِلَى أَبِي جَهْمٍ فَإِنِّي نَظَرْتُ إِلَى عَلَمِهَا فِي الصَّلاَةِ فَكَادَ يَفْتِنُنِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": 219,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَبِسَ خَمِيصَةً شَامِيَّةً لَهَا عَلَمٌ ثُمَّ أَعْطَاهَا أَبَا جَهْمٍ وَأَخَذَ مِنْ أَبِي جَهْمٍ أَنْبِجَانِيَّةً لَهُ فَقَالَ يَا رَسُولَ اللَّهِ وَلِمَ فَقَالَ ‏ \"‏ إِنِّي نَظَرْتُ إِلَى عَلَمِهَا فِي الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": 220,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ أَبَا طَلْحَةَ الأَنْصَارِيَّ، كَانَ يُصَلِّي فِي حَائِطِهِ فَطَارَ دُبْسِيٌّ فَطَفِقَ يَتَرَدَّدُ يَلْتَمِسُ مَخْرَجًا فَأَعْجَبَهُ ذَلِكَ فَجَعَلَ يُتْبِعُهُ بَصَرَهُ سَاعَةً ثُمَّ رَجَعَ إِلَى صَلاَتِهِ فَإِذَا هُوَ لاَ يَدْرِي كَمْ صَلَّى فَقَالَ لَقَدْ أَصَابَتْنِي فِي مَالِي هَذَا فِتْنَةٌ ‏.‏ فَجَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ لَهُ الَّذِي أَصَابَهُ فِي حَائِطِهِ مِنَ الْفِتْنَةِ وَقَالَ يَا رَسُولَ اللَّهِ هُوَ صَدَقَةٌ لِلَّهِ فَضَعْهُ حَيْثُ شِئْتَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": 221,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ كَانَ يُصَلِّي فِي حَائِطٍ لَهُ بِالْقُفِّ - وَادٍ مِنْ أَوْدِيَةِ الْمَدِينَةِ - فِي زَمَانِ الثَّمَرِ وَالنَّخْلُ قَدْ ذُلِّلَتْ فَهِيَ مُطَوَّقَةٌ بِثَمَرِهَا فَنَظَرَ إِلَيْهَا فَأَعْجَبَهُ مَا رَأَى مِنْ ثَمَرِهَا ثُمَّ رَجَعَ إِلَى صَلاَتِهِ فَإِذَا هُوَ لاَ يَدْرِي كَمْ صَلَّى فَقَالَ لَقَدْ أَصَابَتْنِي فِي مَالِي هَذَا فِتْنَةٌ ‏.‏ فَجَاءَ عُثْمَانَ بْنَ عَفَّانَ - وَهُوَ يَوْمَئِذٍ خَلِيفَةٌ - فَذَكَرَ لَهُ ذَلِكَ وَقَالَ هُوَ صَدَقَةٌ فَاجْعَلْهُ فِي سُبُلِ الْخَيْرِ ‏.‏ فَبَاعَهُ عُثْمَانُ بْنُ عَفَّانَ بِخَمْسِينَ أَلْفًا فَسُمِّيَ ذَلِكَ الْمَالُ الْخَمْسِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 221
			}
		}
	]
}