{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ قَالَ مَالِكٌ: وَذلِكَ فِيمَا نُرَى - وَاللهُ أَعْلَمُ - أَنْ يَشْتَرِيَ الرَّجُلُ الْعَبْدَ، أَوِ الْوَلِيدَةَ. أَوْ يَتَكَارَى الدَّابَّةَ. ثُمَّ يَقُولُ لِلَّذِي اشْتَرَى مِنْهُ، أَوْ تَكَارَى مِنْهُ: أُعْطِيكَ دِينَاراً، أَوْ دِرْهَماً، أَوْ أَكْثَرَ مِنْ ذلِكَ، أَوْ أَقَلَّ. عَلَى أَنِّي إِنْ أَخَذْتُ السِّلْعَةَ، أَوْ رَكِبْتُ مَا تَكَارَيْتُ مِنْكَ، فَالَّذِي أَعْطَيْتُكَ هُوَ مِنْ ثَمَنِ السِّلْعَةِ. أَوْ مِنْ كِرَاءِ الدَّابَّةِ، وَإِنْ تَرَكْتُ ابْتِيَاعَ السِّلْعَةِ، أَوْ كِرَاءَ الدَّابَّةِ، فَمَا أَعْطَيْتُكَ لَكَ بَاطِلٌ بِغَيْرِ شَيْءٍ. قَالَ مَالِكٌ: وَالْأَمْرُ عِنْدَنَا، أَنَّهُ لاَ بَأْسَ بِأَنْ يَبْتَاعَ الْعَبْدَ التَّاجِرَ الْفَصِيحَ، بِالْأَعْبُدِ مِنَ الْحَبَشَةِ، أَوْ مِنْ جِنْسٍ مِنَ الْأَجْنَاسِ، لَيْسُوا مِثْلَهُ فِي الْفَصَاحَةِ، وَلاَ فِي التِّجَارَةِ، وَالنَّفَاذِ، وَالْمَعْرِفَةِ. لاَ بَأْسَ بِهذَا، أَنْ يَشْتَرِيَ مِنْهُ الْعَبْدَ بِالْعَبْدَيْنِ، أَوْ بِالْأَعْبُدِ إِلَى أَجَلٍ مَعْلُومٍ. إِذَا اخْتَلَفَ، فَبَانَ اخْتِلاَفُهُ .فَإِنْ أَشْبَهَ بَعْضُ ذلِكَ بَعْضاً، حَتَّى يَتَقَارَبَ، فَلاَ تَأْخُذَنْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ، إِلَى أَجَلٍ. وَإِنِ اخْتَلَفَتْ أَجْنَاسُهُمْ. قَالَ مَالِكٌ: وَلاَ بَأْسَ بِأَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْ ذلِكَ، قَبْلَ أَنْ تَسْتَوْفِيَهُ. إِذَا انْتَقَدْتَ ثَمَنَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ. قَالَ مَالِكٌ: لاَ يَنْبَغِي أَنْ يُسْتَثْنَى جَنِينٌ فِي بَطْنِ أُمِّهِ، إِذَا بِيعَتْ. لِأَنَّ ذلِكَ غَرَرٌ. لاَ يُدْرَى أَذَكَرٌ هُوَ أَمْ (1) أُنْثَى أو حَسَنٌ (2) أَوْ قَبِيحٌ، أَوْ نَاقِصٌ، أَوْ تَامٌّ، أَوْ حَيٌّ أَوْ مَيِّتٌ؟. وَذلِكَ يَضَعُ مِنْ ثَمَنِهَا. قَالَ مَالِكٌ، فِي الرَّجُلِ يَبْتَاعُ الْعَبْدَ، أَوِ الْوَلِيدَةَ، بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ. ثُمَّ يَنْدَمُ الْبَائِعُ. فَيَسْأَلُ الْمُبْتَاعَ أَنْ يُقِيلَهُ بِعَشَرَةِ دَنَانِيرَ، يَدْفَعُهَا إِلَيْهِ نَقْداً. أَوْ إِلَى أَجَلٍ. وَيَمْحُو عَنْهُ الْمِائَةَ دِينَارٍ الَّتِي لَهُ. قَالَ مَالِكٌ: لاَ بَأْسَ بِذلِكَ. وَإِنْ نَدِمَ الْمُبْتَاعُ، فَسَأَلَ الْبَائِعَ أَنْ يُقِيلَهُ فِي الْجَارِيَةِ، أَوِ الْعَبْدِ، وَيَزِيدَهُ عَشَرَةَ دَنَانِيرَ نَقْداً، أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ الْأَجَلِ الَّذِي اشْتَرَى إِلَيْهِ الْعَبْدَ، أَوِ الْوَلِيدَةَ. فَإِنَّ ذلِكَ لاَ يَنْبَغِي. وَإِنَّمَا كَرِهَ ذلِكَ؛ لِأَنَّ الْبَائِعَ كَأَنَّهُ بَاعَ مِنْهُ مِائَةَ دِينَارٍ لَهُ، إِلَى سَنَةٍ قَبْلَ أَنْ تَحِلَّ، بِجَارِيَةٍ، وَبِعَشَرَةِ دَنَانِيرَ نَقْداً. أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ السَّنَةِ. فَدَخَلَ فِي ذلِكَ بَيْعُ الذَّهَبِ بِالذَّهَبِ إِلَى أَجَلٍ. قَالَ مَالِكٌ، فِي الرَّجُلِ يَبِيعُ مِنَ الرَّجُلِ الْجَارِيَةَ بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ، ثُمَّ يَشْتَرِيهَا بِأَكْثَرَ مِنْ ذلِكَ الثَّمَنِ الَّذِي بَاعَهَا بِهِ إِلَى أَبْعَدَ مِنْ ذلِكَ الْأَجَلِ، الَّذِي بَاعَهَا إِلَيْهِ: إِنَّ ذلِكَ لاَ يَصْلُحُ. وَتَفْسِيرُ مَا كَرِهَ مِنْ ذلِكَ، أَنْ يَبِيعَ الرَّجُلُ الْجَارِيَةَ إِلَى أَجَلٍ. ثُمَّ يَبْتَاعُهَا إِلَى أَجَلٍ أَبْعَدَ مِنْهُ. يَبِيعُهَا بِثَلاَثِينَ دِينَاراً إِلَى شَهْرٍ، ثُمَّ يَبْتَاعُهَا بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَصَارَ، إِنْ رَجَعَتْ إِلَيْهِ سِلْعَتُهُ بِعَيْنِهَا، وَأَعْطَاهُ صَاحِبُهُ ثَلاَثِينَ دِينَاراً، إِلَى شَهْرٍ؛ بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَهذَا لاَ يَنْبَغِي",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَهُ الْمُبْتَاعُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1291
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ أَبَانَ بْنَ عُثْمَانَ، وَهِشَامَ بْنَ إِسْمَاعِيلَ، كَانَا يَذْكُرَانِ فِي خُطْبَتِهِمَا عُهْدَةَ الرَّقِيقِ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَى الْعَبْدُ أَوِ الْوَلِيدَةُ وَعُهْدَةَ السَّنَةِ ‏.‏ قَالَ مَالِكٌ مَا أَصَابَ الْعَبْدُ أَوِ الْوَلِيدَةُ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَيَانِ حَتَّى تَنْقَضِيَ الأَيَّامُ الثَّلاَثَةُ فَهُوَ مِنَ الْبَائِعِ وَإِنَّ عُهْدَةَ السَّنَةِ مِنَ الْجُنُونِ وَالْجُذَامِ وَالْبَرَصِ فَإِذَا مَضَتِ السَّنَةُ فَقَدْ بَرِئَ الْبَائِعُ مِنَ الْعُهْدَةِ كُلِّهَا ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ بِالْبَرَاءَةِ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ وَلاَ عُهْدَةَ عَلَيْهِ إِلاَّ أَنْ يَكُونَ عَلِمَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ الْبَرَاءَةُ وَكَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا وَلاَ عُهْدَةَ عِنْدَنَا إِلاَّ فِي الرَّقِيقِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1292
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، بَاعَ غُلاَمًا لَهُ بِثَمَانِمِائَةِ دِرْهَمٍ وَبَاعَهُ بِالْبَرَاءَةِ فَقَالَ الَّذِي ابْتَاعَهُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ بِالْغُلاَمِ دَاءٌ لَمْ تُسَمِّهِ لِي ‏.‏ فَاخْتَصَمَا إِلَى عُثْمَانَ بْنِ عَفَّانَ ‏.‏ فَقَالَ الرَّجُلُ بَاعَنِي عَبْدًا وَبِهِ دَاءٌ لَمْ يُسَمِّهِ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بِعْتُهُ بِالْبَرَاءَةِ ‏.‏ فَقَضَى عُثْمَانُ بْنُ عَفَّانَ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنْ يَحْلِفَ لَهُ لَقَدْ بَاعَهُ الْعَبْدَ وَمَا بِهِ دَاءٌ يَعْلَمُهُ فَأَبَى عَبْدُ اللَّهِ أَنْ يَحْلِفَ وَارْتَجَعَ الْعَبْدَ فَصَحَّ عِنْدَهُ فَبَاعَهُ عَبْدُ اللَّهِ بَعْدَ ذَلِكَ بِأَلْفٍ وَخَمْسِمِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ كُلَّ مَنِ ابْتَاعَ وَلِيدَةً فَحَمَلَتْ أَوْ عَبْدًا فَأَعْتَقَهُ وَكُلَّ أَمْرٍ دَخَلَهُ الْفَوْتُ حَتَّى لاَ يُسْتَطَاعَ رَدُّهُ فَقَامَتِ الْبَيِّنَةُ إِنَّهُ قَدْ كَانَ بِهِ عَيْبٌ عِنْدَ الَّذِي بَاعَهُ أَوْ عُلِمَ ذَلِكَ بِاعْتِرَافٍ مِنَ الْبَائِعِ أَوْ غَيْرِهِ فَإِنَّ الْعَبْدَ أَوِ الْوَلِيدَةَ يُقَوَّمُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُرَدُّ مِنَ الثَّمَنِ قَدْرُ مَا بَيْنَ قِيمَتِهِ صَحِيحًا وَقِيمَتِهِ وَبِهِ ذَلِكَ الْعَيْبُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ ثُمَّ يَظْهَرُ مِنْهُ عَلَى عَيْبٍ يَرُدُّهُ مِنْهُ وَقَدْ حَدَثَ بِهِ عِنْدَ الْمُشْتَرِي عَيْبٌ آخَرُ إِنَّهُ إِذَا كَانَ الْعَيْبُ الَّذِي حَدَثَ بِهِ مُفْسِدًا مِثْلُ الْقَطْعِ أَوِ الْعَوَرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُيُوبِ الْمُفْسِدَةِ فَإِنَّ الَّذِي اشْتَرَى الْعَبْدَ بِخَيْرِ النَّظَرَيْنِ إِنْ أَحَبَّ أَنْ يُوضَعَ عَنْهُ مِنْ ثَمَنِ الْعَبْدِ بِقَدْرِ الْعَيْبِ الَّذِي كَانَ بِالْعَبْدِ يَوْمَ اشْتَرَاهُ وُضِعَ عَنْهُ وَإِنْ أَحَبَّ أَنْ يَغْرَمَ قَدْرَ مَا أَصَابَ الْعَبْدَ مِنَ الْعَيْبِ عِنْدَهُ ثُمَّ يَرُدُّ الْعَبْدَ فَذَلِكَ لَهُ وَإِنْ مَاتَ الْعَبْدُ عِنْدَ الَّذِي اشْتَرَاهُ أُقِيمَ الْعَبْدُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُنْظَرُ كَمْ ثَمَنُهُ فَإِنْ كَانَتْ قِيمَةُ الْعَبْدِ يَوْمَ اشْتَرَاهُ بِغَيْرِ عَيْبٍ مِائَةَ دِينَارٍ وَقِيمَتُهُ يَوْمَ اشْتَرَاهُ وَبِهِ الْعَيْبُ ثَمَانُونَ دِينَارًا وُضِعَ عَنِ الْمُشْتَرِي مَا بَيْنَ الْقِيمَتَيْنِ وَإِنَّمَا تَكُونُ الْقِيمَةُ يَوْمَ اشْتُرِيَ الْعَبْدُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنْ رَدَّ وَلِيدَةً مِنْ عَيْبٍ وَجَدَهُ بِهَا وَكَانَ قَدْ أَصَابَهَا أَنَّهَا إِنْ كَانَتْ بِكْرًا فَعَلَيْهِ مَا نَقَصَ مِنْ ثَمَنِهَا وَإِنْ كَانَتْ ثَيِّبًا فَلَيْسَ عَلَيْهِ فِي إِصَابَتِهِ إِيَّاهَا شَىْءٌ لأَنَّهُ كَانَ ضَامِنًا لَهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً أَوْ حَيَوَانًا بِالْبَرَاءَةِ مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ فِيمَا بَاعَ إِلاَّ أَنْ يَكُونَ عَلِمَ فِي ذَلِكَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ تَبْرِئَتُهُ وَكَانَ مَا بَاعَ مَرْدُودًا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فِي الْجَارِيَةِ تُبَاعُ بِالْجَارِيَتَيْنِ ثُمَّ يُوجَدُ بِإِحْدَى الْجَارِيَتَيْنِ عَيْبٌ تُرَدُّ مِنْهُ قَالَ تُقَامُ الْجَارِيَةُ الَّتِي كَانَتْ قِيمَةَ الْجَارِيَتَيْنِ فَيُنْظَرُ كَمْ ثَمَنُهَا ثُمَّ تُقَامُ الْجَارِيَتَانِ بِغَيْرِ الْعَيْبِ الَّذِي وُجِدَ بِإِحْدَاهُمَا تُقَامَانِ صَحِيحَتَيْنِ سَالِمَتَيْنِ ثُمَّ يُقْسَمُ ثَمَنُ الْجَارِيَةِ الَّتِي بِيعَتْ بِالْجَارِيَتَيْنِ عَلَيْهِمَا بِقَدْرِ ثَمَنِهِمَا حَتَّى يَقَعَ عَلَى كُلِّ وَاحِدَةٍ مِنْهُمَا حِصَّتُهَا مِنْ ذَلِكَ عَلَى الْمُرْتَفِعَةِ بِقَدْرِ ارْتِفَاعِهَا وَعَلَى الأُخْرَى بِقَدْرِهَا ثُمَّ يُنْظَرُ إِلَى الَّتِي بِهَا الْعَيْبُ فَيُرَدُّ بِقَدْرِ الَّذِي وَقَعَ عَلَيْهَا مِنْ تِلْكَ الْحِصَّةِ إِنْ كَانَتْ كَثِيرَةً أَوْ قَلِيلَةً وَإِنَّمَا تَكُونُ قِيمَةُ الْجَارِيَتَيْنِ عَلَيْهِ يَوْمَ قَبْضِهِمَا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ فَيُؤَاجِرُهُ بِالإِجَارَةِ الْعَظِيمَةِ أَوِ الْغَلَّةِ الْقَلِيلَةِ ثُمَّ يَجِدُ بِهِ عَيْبًا يُرَدُّ مِنْهُ إِنَّهُ يَرُدُّهُ بِذَلِكَ الْعَيْبِ وَتَكُونُ لَهُ إِجَارَتُهُ وَغَلَّتُهُ وَهَذَا الأَمْرُ الَّذِي كَانَتْ عَلَيْهِ الْجَمَاعَةُ بِبَلَدِنَا وَذَلِكَ لَوْ أَنَّ رَجُلاً ابْتَاعَ عَبْدًا فَبَنَى لَهُ دَارًا قِيمَةُ بِنَائِهَا ثَمَنُ الْعَبْدِ أَضْعَافًا ثُمَّ وَجَدَ بِهِ عَيْبًا يُرَدُّ مِنْهُ رَدَّهُ وَلاَ يُحْسَبُ لِلْعَبْدِ عَلَيْهِ إِجَارَةٌ فِيمَا عَمِلَ لَهُ فَكَذَلِكَ تَكُونُ لَهُ إِجَارَتُهُ إِذَا آجَرَهُ مِنْ غَيْرِهِ لأَنَّهُ ضَامِنٌ لَهُ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنِ ابْتَاعَ رَقِيقًا فِي صَفْقَةٍ وَاحِدَةٍ فَوَجَدَ فِي ذَلِكَ الرَّقِيقِ عَبْدًا مَسْرُوقًا أَوْ وَجَدَ بِعَبْدٍ مِنْهُمْ عَيْبًا أَنَّهُ يُنْظَرُ فِيمَا وُجِدَ مَسْرُوقًا أَوْ وَجَدَ بِهِ عَيْبًا فَإِنْ كَانَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ أَوْ أَكْثَرَهُ ثَمَنًا أَوْ مِنْ أَجْلِهِ اشْتَرَى وَهُوَ الَّذِي فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ كَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا كُلُّهُ وَإِنْ كَانَ الَّذِي وُجِدَ مَسْرُوقًا أَوْ وُجِدَ بِهِ الْعَيْبُ مِنْ ذَلِكَ الرَّقِيقِ فِي الشَّىْءِ الْيَسِيرِ مِنْهُ لَيْسَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ وَلاَ مِنْ أَجْلِهِ اشْتُرِيَ وَلاَ فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ رُدَّ ذَلِكَ الَّذِي وُجِدَ بِهِ الْعَيْبُ أَوْ وُجِدَ مَسْرُوقًا بِعَيْنِهِ بِقَدْرِ قِيمَتِهِ مِنَ الثَّمَنِ الَّذِي اشْتَرَى بِهِ أُولَئِكَ الرَّقِيقَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1293
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ابْتَاعَ جَارِيَةً مِنِ امْرَأَتِهِ زَيْنَبَ الثَّقَفِيَّةِ وَاشْتَرَطَتْ عَلَيْهِ أَنَّكَ إِنْ بِعْتَهَا فَهِيَ لِي بِالثَّمَنِ الَّذِي تَبِيعُهَا بِهِ فَسَأَلَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ عَنْ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لاَ تَقْرَبْهَا وَفِيهَا شَرْطٌ لأَحَدٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1294
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَطَأُ الرَّجُلُ وَلِيدَةً إِلاَّ وَلِيدَةً إِنْ شَاءَ بَاعَهَا وَإِنْ شَاءَ وَهَبَهَا وَإِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ صَنَعَ بِهَا مَا شَاءَ ‏.‏ قَالَ مَالِكٌ فِيمَنِ اشْتَرَى جَارِيَةً عَلَى شَرْطِ أَنْ لاَ يَبِيعَهَا أَوْ لاَ يَهَبَهَا أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الشُّرُوطِ فَإِنَّهُ لاَ يَنْبَغِي لِلْمُشْتَرِي أَنْ يَطَأَهَا وَذَلِكَ أَنَّهُ لاَ يَجُوزُ لَهُ أَنْ يَبِيعَهَا وَلاَ يَهَبَهَا فَإِذَا كَانَ لاَ يَمْلِكُ ذَلِكَ مِنْهَا فَلَمْ يَمْلِكْهَا مِلْكًا تَامًّا لأَنَّهُ قَدِ اسْتُثْنِيَ عَلَيْهِ فِيهَا مَا مَلَكَهُ بِيَدِ غَيْرِهِ فَإِذَا دَخَلَ هَذَا الشَّرْطُ لَمْ يَصْلُحْ وَكَانَ بَيْعًا مَكْرُوهًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1295
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَامِرٍ، أَهْدَى لِعُثْمَانَ بْنِ عَفَّانَ جَارِيَةً وَلَهَا زَوْجٌ ابْتَاعَهَا بِالْبَصْرَةِ فَقَالَ عُثْمَانُ لاَ أَقْرَبُهَا حَتَّى يُفَارِقَهَا زَوْجُهَا ‏.‏ فَأَرْضَى ابْنُ عَامِرٍ زَوْجَهَا فَفَارَقَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1296
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، ابْتَاعَ وَلِيدَةً فَوَجَدَهَا ذَاتَ زَوْجٍ فَرَدَّهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1297
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1298
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلاَحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1299
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ ‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ وَمَا تُزْهِي فَقَالَ ‏\"‏ حِينَ تَحْمَرُّ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِذَا مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1300
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تَنْجُوَ مِنَ الْعَاهَةِ ‏.‏ قَالَ مَالِكٌ وَبَيْعُ الثِّمَارِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهَا مِنْ بَيْعِ الْغَرَرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1301
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ كَانَ لاَ يَبِيعُ ثِمَارَهُ حَتَّى تَطْلُعَ الثُّرَيَّا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1302
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ لِصَاحِبِ الْعَرِيَّةِ أَنْ يَبِيعَهَا بِخَرْصِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1303
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ أَوْسُقٍ ‏.‏ يَشُكُّ دَاوُدُ قَالَ خَمْسَةِ أَوْسُقٍ أَوْ دُونَ خَمْسَةِ أَوْسُقٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1304
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَهَا تَقُولُ، ابْتَاعَ رَجُلٌ ثَمَرَ حَائِطٍ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَعَالَجَهُ وَقَامَ فِيهِ حَتَّى تَبَيَّنَ لَهُ النُّقْصَانُ فَسَأَلَ رَبَّ الْحَائِطِ أَنْ يَضَعَ لَهُ أَوْ أَنْ يُقِيلَهُ فَحَلَفَ أَنْ لاَ يَفْعَلَ فَذَهَبَتْ أُمُّ الْمُشْتَرِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَأَلَّى أَنْ لاَ يَفْعَلَ خَيْرًا ‏\"‏ ‏.‏ فَسَمِعَ بِذَلِكَ رَبُّ الْحَائِطِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هُوَ لَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1305
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى بِوَضْعِ الْجَائِحَةِ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَالْجَائِحَةُ الَّتِي تُوضَعُ عَنِ الْمُشْتَرِي الثُّلُثُ فَصَاعِدًا وَلاَ يَكُونُ مَا دُونَ ذَلِكَ جَائِحَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1306
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1307
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ جَدَّهُ، مُحَمَّدَ بْنَ عَمْرِو بْنِ حَزْمٍ بَاعَ ثَمَرَ حَائِطٍ لَهُ يُقَالُ لَهُ الأَفْرَاقُ بِأَرْبَعَةِ آلاَفِ دِرْهَمٍ وَاسْتَثْنَى مِنْهُ بِثَمَانِمِائَةِ دِرْهَمٍ تَمْرًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1308
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ كَانَتْ تَبِيعُ ثِمَارَهَا وَتَسْتَثْنِي مِنْهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا بَاعَ ثَمَرَ حَائِطِهِ أَنَّ لَهُ أَنْ يَسْتَثْنِيَ مِنْ ثَمَرِ حَائِطِهِ مَا بَيْنَهُ وَبَيْنَ ثُلُثِ الثَّمَرِ لاَ يُجَاوِزُ ذَلِكَ وَمَا كَانَ دُونَ الثُّلُثِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْ ثَمَرِ حَائِطِهِ ثَمَرَ نَخْلَةٍ أَوْ نَخَلاَتٍ يَخْتَارُهَا وَيُسَمِّي عَدَدَهَا فَلاَ أَرَى بِذَلِكَ بَأْسًا لأَنَّ رَبَّ الْحَائِطِ إِنَّمَا اسْتَثْنَى شَيْئًا مِنْ ثَمَرِ حَائِطِ نَفْسِهِ وَإِنَّمَا ذَلِكَ شَىْءٌ احْتَبَسَهُ مِنْ حَائِطِهِ وَأَمْسَكَهُ لَمْ يَبِعْهُ وَبَاعَ مِنْ حَائِطِهِ مَا سِوَى ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1309
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ التَّمْرُ بِالتَّمْرِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ فَقِيلَ لَهُ إِنَّ عَامِلَكَ عَلَى خَيْبَرَ يَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادْعُوهُ لِي ‏\"‏ ‏.‏ فَدُعِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ لاَ يَبِيعُونَنِي الْجَنِيبَ بِالْجَمْعِ صَاعًا بِصَاعٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1310
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ فَجَاءَهُ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالصَّاعَيْنِ بِالثَّلاَثَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1311
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، أَنَّ زَيْدًا أَبَا عَيَّاشٍ، أَخْبَرَهُ أَنَّهُ، سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ الْبَيْضَاءِ، بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ وَقَالَ سَعْدٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنِ اشْتِرَاءِ التَّمْرِ بِالرُّطَبِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1312
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1313
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ فِي رُءُوسِ النَّخْلِ وَالْمُحَاقَلَةُ كِرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1314
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ وَالْمُحَاقَلَةُ اشْتِرَاءُ الزَّرْعِ بِالْحِنْطَةِ وَاسْتِكْرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَسَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ اسْتِكْرَاءِ الأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَتَفْسِيرُ الْمُزَابَنَةِ أَنَّ كُلَّ شَىْءٍ مِنَ الْجِزَافِ الَّذِي لاَ يُعْلَمُ كَيْلُهُ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ ابْتِيعَ بِشَىْءٍ مُسَمًّى مِنَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ يَكُونُ لَهُ الطَّعَامُ الْمُصَبَّرُ الَّذِي لاَ يُعْلَمُ كَيْلُهُ مِنَ الْحِنْطَةِ أَوِ التَّمْرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأَطْعِمَةِ أَوْ يَكُونُ لِلرَّجُلِ السِّلْعَةُ مِنَ الْحِنْطَةِ أَوِ النَّوَى أَوِ الْقَضْبِ أَوِ الْعُصْفُرِ أَوِ الْكُرْسُفِ أَوِ الْكَتَّانِ أَوِ الْقَزِّ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ السِّلَعِ لاَ يُعْلَمُ كَيْلُ شَىْءٍ مِنْ ذَلِكَ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ فَيَقُولُ الرَّجُلُ لِرَبِّ تِلْكَ السِّلْعَةِ كِلْ سِلْعَتَكَ هَذِهِ أَوْ مُرْ مَنْ يَكِيلُهَا أَوْ زِنْ مِنْ ذَلِكَ مَا يُوزَنُ أَوْ عُدَّ مِنْ ذَلِكَ مَا كَانَ يُعَدُّ فَمَا نَقَصَ عَنْ كَيْلِ كَذَا وَكَذَا صَاعًا - لِتَسْمِيَةٍ يُسَمِّيهَا - أَوْ وَزْنِ كَذَا وَكَذَا رِطْلاً أَوْ عَدَدِ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ لَكَ حَتَّى أُوفِيَكَ تِلْكَ التَّسْمِيَةَ فَمَا زَادَ عَلَى تِلْكَ التَّسْمِيَةِ فَهُوَ لِي أَضْمَنُ مَا نَقَصَ مِنْ ذَلِكَ عَلَى أَنْ يَكُونَ لِي مَا زَادَ ‏.‏ فَلَيْسَ ذَلِكَ بَيْعًا وَلَكِنَّهُ الْمُخَاطَرَةُ وَالْغَرَرُ وَالْقِمَارُ يَدْخُلُ هَذَا لأَنَّهُ لَمْ يَشْتَرِ مِنْهُ شَيْئًا بِشَىْءٍ أَخْرَجَهُ وَلَكِنَّهُ ضَمِنَ لَهُ مَا سُمِّيَ مِنْ ذَلِكَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ عَلَى أَنْ يَكُونَ لَهُ مَا زَادَ عَلَى ذَلِكَ فَإِنْ نَقَصَتْ تِلْكَ السِّلْعَةُ عَنْ تِلْكَ التَّسْمِيَةِ أَخَذَ مِنْ مَالِ صَاحِبِهِ مَا نَقَصَ بِغَيْرِ ثَمَنٍ وَلاَ هِبَةٍ طَيِّبَةٍ بِهَا نَفْسُهُ فَهَذَا يُشْبِهُ الْقِمَارَ وَمَا كَانَ مِثْلَ هَذَا مِنَ الأَشْيَاءِ فَذَلِكَ يَدْخُلُهُ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ لَهُ الثَّوْبُ أَضْمَنُ لَكَ مِنْ ثَوْبِكَ هَذَا كَذَا وَكَذَا ظِهَارَةَ قَلَنْسُوَةٍ قَدْرُ كُلِّ ظِهَارَةٍ كَذَا وَكَذَا - لِشَىْءٍ يُسَمِّيهِ - فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ حَتَّى أُوفِيَكَ وَمَا زَادَ فَلِي ‏.‏ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَضْمَنُ لَكَ مِنْ ثِيَابِكَ هَذِي كَذَا وَكَذَا قَمِيصًا ذَرْعُ كُلِّ قَمِيصٍ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ عَلَى ذَلِكَ فَلِي ‏.‏ أَوْ أَنْ يَقُولُ الرَّجُلُ لِلرَّجُلِ لَهُ الْجُلُودُ مِنْ جُلُودِ الْبَقَرِ أَوِ الإِبِلِ أُقَطِّعُ جُلُودَكَ هَذِهِ نِعَالاً عَلَى إِمَامٍ يُرِيهِ إِيَّاهُ ‏.‏ فَمَا نَقَصَ مِنْ مِائَةِ زَوْجٍ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ فَهُوَ لِي بِمَا ضَمِنْتُ لَكَ ‏.‏ وَمِمَّا يُشْبِهُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ عِنْدَهُ حَبُّ الْبَانِ اعْصُرْ حَبَّكَ هَذَا فَمَا نَقَصَ مِنْ كَذَا وَكَذَا رِطْلاً فَعَلَىَّ أَنْ أُعْطِيَكَهُ وَمَا زَادَ فَهُوَ لِي ‏.‏ فَهَذَا كُلُّهُ وَمَا أَشْبَهَهُ مِنَ الأَشْيَاءِ أَوْ ضَارَعَهُ مِنَ الْمُزَابَنَةِ الَّتِي لاَ تَصْلُحُ وَلاَ تَجُوزُ ‏.‏ وَكَذَلِكَ - أَيْضًا - إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ لَهُ الْخَبَطُ أَوِ النَّوَى أَوِ الْكُرْسُفُ أَوِ الْكَتَّانُ أَوِ الْقَضْبُ أَوِ الْعُصْفُرُ أَبْتَاعُ مِنْكَ هَذَا الْخَبَطَ بِكَذَا وَكَذَا صَاعًا مِنْ خَبَطٍ يُخْبَطُ مِثْلَ خَبَطِهِ أَوْ هَذَا النَّوَى بِكَذَا وَكَذَا صَاعًا مِنْ نَوًى مِثْلِهِ وَفِي الْعُصْفُرِ وَالْكُرْسُفِ وَالْكَتَّانِ وَالْقَضْبِ مِثْلَ ذَلِكَ ‏.‏ فَهَذَا كُلُّهُ يَرْجِعُ إِلَى مَا وَصَفْنَا مِنَ الْمُزَابَنَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1315
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم السَّعْدَيْنِ أَنْ يَبِيعَا آنِيَةً مِنَ الْمَغَانِمِ مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَبَاعَا كُلَّ ثَلاَثَةٍ بِأَرْبَعَةٍ عَيْنًا أَوْ كُلَّ أَرْبَعَةٍ بِثَلاَثَةٍ عَيْنًا فَقَالَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْبَيْتُمَا فَرُدَّا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1316
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1317
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1318
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَجَاءَهُ صَائِغٌ فَقَالَ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَصُوغُ الذَّهَبَ ثُمَّ أَبِيعُ الشَّىْءَ مِنْ ذَلِكَ بِأَكْثَرَ مِنْ وَزْنِهِ فَأَسْتَفْضِلُ مِنْ ذَلِكَ قَدْرَ عَمَلِ يَدِي ‏.‏ فَنَهَاهُ عَبْدُ اللَّهِ عَنْ ذَلِكَ فَجَعَلَ الصَّائِغُ يُرَدِّدُ عَلَيْهِ الْمَسْأَلَةَ وَعَبْدُ اللَّهِ يَنْهَاهُ حَتَّى انْتَهَى إِلَى بَابِ الْمَسْجِدِ أَوْ إِلَى دَابَّةٍ يُرِيدُ أَنْ يَرْكَبَهَا ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا إِلَيْنَا وَعَهْدُنَا إِلَيْكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1319
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَدِّهِ، مَالِكِ بْنِ أَبِي عَامِرٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ وَلاَ الدِّرْهَمَ بِالدِّرْهَمَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1320
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذَا إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَقَالَ لَهُ مُعَاوِيَةُ مَا أَرَى بِمِثْلِ هَذَا بَأْسًا ‏.‏ فَقَالَ أَبُو الدَّرْدَاءِ مَنْ يَعْذِرُنِي مِنْ مُعَاوِيَةَ أَنَا أُخْبِرُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُخْبِرُنِي عَنْ رَأْيِهِ لاَ أُسَاكِنُكَ بِأَرْضٍ أَنْتَ بِهَا ‏.‏ ثُمَّ قَدِمَ أَبُو الدَّرْدَاءِ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَكَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى مُعَاوِيَةَ أَنْ لاَ تَبِيعَ ذَلِكَ إِلاَّ مِثْلاً بِمِثْلٍ وَزْنًا بِوَزْنٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1321
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالذَّهَبِ أَحَدُهُمَا غَائِبٌ وَالآخَرُ نَاجِزٌ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1322
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا شَيْئًا مِنْهَا غَائِبًا بِنَاجِزٍ ‏.‏ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1323
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالصَّاعُ بِالصَّاعِ وَلاَ يُبَاعُ كَالِئٌ بِنَاجِزٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1324
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لاَ رِبًا إِلاَّ فِي ذَهَبٍ أَوْ فِضَّةٍ أَوْ مَا يُكَالُ أَوْ يُوزَنُ بِمَا يُؤْكَلُ أَوْ يُشْرَبُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1325
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَطْعُ الذَّهَبِ وَالْوَرِقِ مِنَ الْفَسَادِ فِي الأَرْضِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَشْتَرِيَ الرَّجُلُ الذَّهَبَ بِالْفِضَّةِ وَالْفِضَّةَ بِالذَّهَبِ جِزَافًا إِذَا كَانَ تِبْرًا أَوْ حَلْيًا قَدْ صِيغَ فَأَمَّا الدَّرَاهِمُ الْمَعْدُودَةُ وَالدَّنَانِيرُ الْمَعْدُودَةُ فَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَشْتَرِيَ ذَلِكَ جِزَافًا حَتَّى يُعْلَمَ وَيُعَدَّ فَإِنِ اشْتُرِيَ ذَلِكَ جِزَافًا فَإِنَّمَا يُرَادُ بِهِ الْغَرَرُ حِينَ يُتْرَكُ عَدُّهُ وَيُشْتَرَى جِزَافًا وَلَيْسَ هَذَا مِنْ بُيُوعِ الْمُسْلِمِينَ فَأَمَّا مَا كَانَ يُوزَنُ مِنَ التِّبْرِ وَالْحَلْىِ فَلاَ بَأْسَ أَنْ يُبَاعَ ذَلِكَ جِزَافًا وَإِنَّمَا ابْتِيَاعُ ذَلِكَ جِزَافًا كَهَيْئَةِ الْحِنْطَةِ وَالتَّمْرِ وَنَحْوِهِمَا مِنَ الأَطْعِمَةِ الَّتِي تُبَاعُ جِزَافًا وَمِثْلُهَا يُكَالُ فَلَيْسَ بِابْتِيَاعِ ذَلِكَ جِزَافًا بَأْسٌ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى مُصْحَفًا أَوْ سَيْفًا أَوْ خَاتَمًا وَفِي شَىْءٍ مِنْ ذَلِكَ ذَهَبٌ أَوْ فِضَّةٌ بِدَنَانِيرَ أَوْ دَرَاهِمَ فَإِنَّ مَا اشْتُرِيَ مِنْ ذَلِكَ وَفِيهِ الذَّهَبُ بِدَنَانِيرَ فَإِنَّهُ يُنْظَرُ إِلَى قِيمَتِهِ فَإِنْ كَانَتْ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الذَّهَبِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلاَ يَكُونُ فِيهِ تَأْخِيرٌ وَمَا اشْتُرِيَ مِنْ ذَلِكَ بِالْوَرِقِ مِمَّا فِيهِ الْوَرِقُ نُظِرَ إِلَى قِيمَتِهِ فَإِنْ كَانَ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الْوَرِقِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلَمْ يَزَلْ ذَلِكَ مِنْ أَمْرِ النَّاسِ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1326
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، أَنَّهُ الْتَمَسَ صَرْفًا بِمِائَةِ دِينَارٍ قَالَ فَدَعَانِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فَتَرَاوَضْنَا حَتَّى اصْطَرَفَ مِنِّي وَأَخَذَ الذَّهَبَ يُقَلِّبُهَا فِي يَدِهِ ثُمَّ قَالَ حَتَّى يَأْتِيَنِي خَازِنِي مِنَ الْغَابَةِ ‏.‏ وَعُمَرُ بْنُ الْخَطَّابِ يَسْمَعُ ‏.‏ فَقَالَ عُمَرُ وَاللَّهِ لاَ تُفَارِقْهُ حَتَّى تَأْخُذَ مِنْهُ - ثُمَّ قَالَ - قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1327
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، أَنَّهُ رَأَى سَعِيدَ بْنَ الْمُسَيَّبِ يُرَاطِلُ الذَّهَبَ بِالذَّهَبِ فَيُفْرِغُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ وَيُفْرِغُ صَاحِبُهُ الَّذِي يُرَاطِلُهُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ الأُخْرَى فَإِذَا اعْتَدَلَ لِسَانُ الْمِيزَانِ أَخَذَ وَأَعْطَى ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ مُرَاطَلَةً أَنَّهُ لاَ بَأْسَ بِذَلِكَ أَنْ يَأْخُذَ أَحَدَ عَشَرَ دِينَارًا بِعَشَرَةِ دَنَانِيرَ يَدًا بِيَدٍ إِذَا كَانَ وَزْنُ الذَّهَبَيْنِ سَوَاءً عَيْنًا بِعَيْنٍ وَإِنْ تَفَاضَلَ الْعَدَدُ وَالدَّرَاهِمُ أَيْضًا فِي ذَلِكَ بِمَنْزِلَةِ الدَّنَانِيرِ ‏.‏ قَالَ مَالِكٌ مَنْ رَاطَلَ ذَهَبًا بِذَهَبٍ أَوْ وَرِقًا بِوَرِقٍ فَكَانَ بَيْنَ الذَّهَبَيْنِ فَضْلُ مِثْقَالٍ فَأَعْطَى صَاحِبَهُ قِيمَتَهُ مِنَ الْوَرِقِ أَوْ مِنْ غَيْرِهَا فَلاَ يَأْخُذُهُ فَإِنَّ ذَلِكَ قَبِيحٌ وَذَرِيعَةٌ إِلَى الرِّبَا لأَنَّهُ إِذَا جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ حَتَّى كَأَنَّهُ اشْتَرَاهُ عَلَى حِدَتِهِ جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ مِرَارًا لأَنْ يُجِيزَ ذَلِكَ الْبَيْعَ بَيْنَهُ وَبَيْنَ صَاحِبِهِ ‏.‏ قَالَ مَالِكٌ وَلَوْ أَنَّهُ بَاعَهُ ذَلِكَ الْمِثْقَالَ مُفْرَدًا لَيْسَ مَعَهُ غَيْرُهُ لَمْ يَأْخُذْهُ بِعُشْرِ الثَّمَنِ الَّذِي أَخَذَهُ بِهِ لأَنْ يُجَوِّزَ لَهُ الْبَيْعَ فَذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ الْحَرَامِ وَالأَمْرُ الْمَنْهِيُّ عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُرَاطِلُ الرَّجُلَ وَيُعْطِيهِ الذَّهَبَ الْعُتُقَ الْجِيَادَ وَيَجْعَلُ مَعَهَا تِبْرًا ذَهَبًا غَيْرَ جَيِّدَةٍ وَيَأْخُذُ مِنْ صَاحِبِهِ ذَهَبًا كُوفِيَّةً مُقَطَّعَةً وَتِلْكَ الْكُوفِيَّةُ مَكْرُوهَةٌ عِنْدَ النَّاسِ فَيَتَبَايَعَانِ ذَلِكَ مِثْلاً بِمِثْلٍ إِنَّ ذَلِكَ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّ صَاحِبَ الذَّهَبِ الْجِيَادِ أَخَذَ فَضْلَ عُيُونِ ذَهَبِهِ فِي التِّبْرِ الَّذِي طَرَحَ مَعَ ذَهَبِهِ وَلَوْلاَ فَضْلُ ذَهَبِهِ عَلَى ذَهَبِ صَاحِبِهِ لَمْ يُرَاطِلْهُ صَاحِبُهُ بِتِبْرِهِ ذَلِكَ إِلَى ذَهَبِهِ الْكُوفِيَّةِ فَامْتَنَعَ وَإِنَّمَا مَثَلُ ذَلِكَ كَمَثَلِ رَجُلٍ أَرَادَ أَنْ يَبْتَاعَ ثَلاَثَةَ أَصْوُعٍ مِنْ تَمْرٍ عَجْوَةٍ بِصَاعَيْنِ وَمُدٍّ مِنْ تَمْرٍ كَبِيسٍ فَقِيلَ لَهُ هَذَا لاَ يَصْلُحُ ‏.‏ فَجَعَلَ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ بَيْعَهُ فَذَلِكَ لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ صَاحِبُ الْعَجْوَةِ لِيُعْطِيَهُ صَاعًا مِنَ الْعَجْوَةِ بِصَاعٍ مِنْ حَشَفٍ وَلَكِنَّهُ إِنَّمَا أَعْطَاهُ ذَلِكَ لِفَضْلِ الْكَبِيسِ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ بِعْنِي ثَلاَثَةَ أَصْوُعٍ مِنَ الْبَيْضَاءِ بِصَاعَيْنِ وَنِصْفٍ مِنْ حِنْطَةٍ شَامِيَّةٍ فَيَقُولُ هَذَا لاَ يَصْلُحُ إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَيَجْعَلُ صَاعَيْنِ مِنْ حِنْطَةٍ شَامِيَّةٍ وَصَاعًا مِنْ شَعِيرٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ الْبَيْعَ فِيمَا بَيْنَهُمَا فَهَذَا لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ لِيُعْطِيَهُ بِصَاعٍ مِنْ شَعِيرٍ صَاعًا مِنْ حِنْطَةٍ بَيْضَاءَ لَوْ كَانَ ذَلِكَ الصَّاعُ مُفْرَدًا وَإِنَّمَا أَعْطَاهُ إِيَّاهُ لِفَضْلِ الشَّامِيَّةِ عَلَى الْبَيْضَاءِ فَهَذَا لاَ يَصْلُحُ وَهُوَ مِثْلُ مَا وَصَفْنَا مِنَ التِّبْرِ ‏.‏ قَالَ مَالِكٌ فَكُلُّ شَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ كُلِّهِ الَّذِي لاَ يَنْبَغِي أَنْ يُبَاعَ إِلاَّ مِثْلاً بِمِثْلٍ فَلاَ يَنْبَغِي أَنْ يُجْعَلَ مَعَ الصِّنْفِ الْجَيِّدِ مِنَ الْمَرْغُوبِ فِيهِ الشَّىْءُ الرَّدِيءُ الْمَسْخُوطُ لِيُجَازَ الْبَيْعُ وَلِيُسْتَحَلَّ بِذَلِكَ مَا نُهِيَ عَنْهُ مِنَ الأَمْرِ الَّذِي لاَ يَصْلُحُ إِذَا جُعِلَ ذَلِكَ مَعَ الصِّنْفِ الْمَرْغُوبِ فِيهِ وَإِنَّمَا يُرِيدُ صَاحِبُ ذَلِكَ أَنْ يُدْرِكَ بِذَلِكَ فَضْلَ جَوْدَةِ مَا يَبِيعُ فَيُعْطِيَ الشَّىْءَ الَّذِي لَوْ أَعْطَاهُ وَحْدَهُ لَمْ يَقْبَلْهُ صَاحِبُهُ وَلَمْ يَهْمُمْ بِذَلِكَ وَإِنَّمَا يَقْبَلُهُ مِنْ أَجْلِ الَّذِي يَأْخُذُ مَعَهُ لِفَضْلِ سِلْعَةِ صَاحِبِهِ عَلَى سِلْعَتِهِ فَلاَ يَنْبَغِي لِشَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ أَنْ يَدْخُلَهُ شَىْءٌ مِنْ هَذِهِ الصِّفَةِ فَإِنْ أَرَادَ صَاحِبُ الطَّعَامِ الرَّدِيءِ أَنْ يَبِيعَهُ بِغَيْرِهِ فَلْيَبِعْهُ عَلَى حِدَتِهِ وَلاَ يَجْعَلْ مَعَ ذَلِكَ شَيْئًا فَلاَ بَأْسَ بِهِ إِذَا كَانَ كَذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1328
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1329
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1330
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1331
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، ‏.‏ أَنَّ حَكِيمَ بْنَ حِزَامٍ، ابْتَاعَ طَعَامًا أَمَرَ بِهِ عُمَرُ بْنُ الْخَطَّابِ لِلنَّاسِ فَبَاعَ حَكِيمٌ الطَّعَامَ قَبْلَ أَنْ يَسْتَوْفِيَهُ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَرَدَّهُ عَلَيْهِ وَقَالَ لاَ تَبِعْ طَعَامًا ابْتَعْتَهُ حَتَّى تَسْتَوْفِيَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1332
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ صُكُوكًا، خَرَجَتْ لِلنَّاسِ فِي زَمَانِ مَرْوَانَ بْنِ الْحَكَمِ مِنْ طَعَامِ الْجَارِ فَتَبَايَعَ النَّاسُ تِلْكَ الصُّكُوكَ بَيْنَهُمْ قَبْلَ أَنْ يَسْتَوْفُوهَا فَدَخَلَ زَيْدُ بْنُ ثَابِتٍ وَرَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَقَالاَ أَتُحِلُّ بَيْعَ الرِّبَا يَا مَرْوَانُ ‏.‏ فَقَالَ أَعُوذُ بِاللَّهِ وَمَا ذَاكَ فَقَالاَ هَذِهِ الصُّكُوكُ تَبَايَعَهَا النَّاسُ ثُمَّ بَاعُوهَا قَبْلَ أَنْ يَسْتَوْفُوهَا فَبَعَثَ مَرْوَانُ الْحَرَسَ يَتْبَعُونَهَا يَنْزِعُونَهَا مِنْ أَيْدِي النَّاسِ وَيَرُدُّونَهَا إِلَى أَهْلِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1333
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَرَادَ أَنْ يَبْتَاعَ طَعَامًا مِنْ رَجُلٍ إِلَى أَجَلٍ فَذَهَبَ بِهِ الرَّجُلُ الَّذِي يُرِيدُ أَنْ يَبِيعَهُ الطَّعَامَ إِلَى السُّوقِ فَجَعَلَ يُرِيهِ الصُّبَرَ وَيَقُولُ لَهُ مِنْ أَيِّهَا تُحِبُّ أَنْ أَبْتَاعَ لَكَ فَقَالَ الْمُبْتَاعُ أَتَبِيعُنِي مَا لَيْسَ عِنْدَكَ فَأَتَيَا عَبْدَ اللَّهِ بْنَ عُمَرَ فَذَكَرَا ذَلِكَ لَهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لِلْمُبْتَاعِ لاَ تَبْتَعْ مِنْهُ مَا لَيْسَ عِنْدَهُ ‏.‏ وَقَالَ لِلْبَائِعِ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1334
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ جَمِيلَ بْنَ عَبْدِ الرَّحْمَنِ الْمُؤَذِّنَ، يَقُولُ لِسَعِيدِ بْنِ الْمُسَيَّبِ إِنِّي رَجُلٌ أَبْتَاعُ مِنَ الأَرْزَاقِ الَّتِي تُعْطَى النَّاسُ بِالْجَارِ مَا شَاءَ اللَّهُ ثُمَّ أُرِيدُ أَنْ أَبِيعَ الطَّعَامَ الْمَضْمُونَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَقَالَ لَهُ سَعِيدٌ أَتُرِيدُ أَنْ تُوَفِّيَهُمْ مِنْ تِلْكَ الأَرْزَاقِ الَّتِي ابْتَعْتَ فَقَالَ نَعَمْ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّهُ مَنِ اشْتَرَى طَعَامًا بُرًّا أَوْ شَعِيرًا أَوْ سُلْتًا أَوْ ذُرَةً أَوْ دُخْنًا أَوْ شَيْئًا مِنَ الْحُبُوبِ الْقِطْنِيَّةِ أَوْ شَيْئًا مِمَّا يُشْبِهُ الْقِطْنِيَّةَ مِمَّا تَجِبُ فِيهِ الزَّكَاةُ أَوْ شَيْئًا مِنَ الأُدْمِ كُلِّهَا الزَّيْتِ وَالسَّمْنِ وَالْعَسَلِ وَالْخَلِّ وَالْجُبْنِ وَالشَّبْرَقِ وَاللَّبَنِ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأُدْمِ فَإِنَّ الْمُبْتَاعَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ حَتَّى يَقْبِضَهُ وَيَسْتَوْفِيَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1335
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، يَنْهَيَانِ أَنْ يَبِيعَ الرَّجُلُ، حِنْطَةً بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِيَ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1336
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، ‏.‏ أَنَّهُ سَأَلَ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنِ الرَّجُلِ، يَبِيعُ الطَّعَامَ مِنَ الرَّجُلِ بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِي بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، بِمِثْلِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نَهَى سَعِيدُ بْنُ الْمُسَيَّبِ وَسُلَيْمَانُ بْنُ يَسَارٍ وَأَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ وَابْنُ شِهَابٍ عَنْ أَنْ لاَ يَبِيعَ الرَّجُلُ حِنْطَةً بِذَهَبٍ ثُمَّ يَشْتَرِيَ الرَّجُلُ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ مِنْ بَيْعِهِ الَّذِي اشْتَرَى مِنْهُ الْحِنْطَةَ فَأَمَّا أَنْ يَشْتَرِيَ بِالذَّهَبِ الَّتِي بَاعَ بِهَا الْحِنْطَةَ إِلَى أَجَلٍ تَمْرًا مِنْ غَيْرِ بَائِعِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ وَيُحِيلَ الَّذِي اشْتَرَى مِنْهُ التَّمْرَ عَلَى غَرِيمِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ بِالذَّهَبِ الَّتِي لَهُ عَلَيْهِ فِي ثَمَنِ التَّمْرِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ وَقَدْ سَأَلْتُ عَنْ ذَلِكَ غَيْرَ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ فَلَمْ يَرَوْا بِهِ بَأْسًا ‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1337
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ لاَ بَأْسَ بِأَنْ يُسَلِّفَ الرَّجُلُ الرَّجُلَ فِي الطَّعَامِ الْمَوْصُوفِ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى مَا لَمْ يَكُنْ فِي زَرْعٍ لَمْ يَبْدُ صَلاَحُهُ أَوْ تَمْرٍ لَمْ يَبْدُ صَلاَحُهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنْ سَلَّفَ فِي طَعَامٍ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَحَلَّ الأَجَلُ فَلَمْ يَجِدِ الْمُبْتَاعُ عِنْدَ الْبَائِعِ وَفَاءً مِمَّا ابْتَاعَ مِنْهُ فَأَقَالَهُ فَإِنَّهُ لاَ يَنْبَغِي لَهُ أَنْ يَأْخُذَ مِنْهُ إِلاَّ وَرِقَهُ أَوْ ذَهَبَهُ أَوِ الثَّمَنَ الَّذِي دَفَعَ إِلَيْهِ بِعَيْنِهِ وَإِنَّهُ لاَ يَشْتَرِي مِنْهُ بِذَلِكَ الثَّمَنِ شَيْئًا حَتَّى يَقْبِضَهُ مِنْهُ وَذَلِكَ أَنَّهُ إِذَا أَخَذَ غَيْرَ الثَّمَنِ الَّذِي دَفَعَ إِلَيْهِ أَوْ صَرَفَهُ فِي سِلْعَةٍ غَيْرِ الطَّعَامِ الَّذِي ابْتَاعَ مِنْهُ فَهُوَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فَإِنْ نَدِمَ الْمُشْتَرِي فَقَالَ لِلْبَائِعِ أَقِلْنِي وَأُنْظِرُكَ بِالثَّمَنِ الَّذِي دَفَعْتُ إِلَيْكَ ‏.‏ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَأَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَذَلِكَ أَنَّهُ لَمَّا حَلَّ الطَّعَامُ لِلْمُشْتَرِي عَلَى الْبَائِعِ أَخَّرَ عَنْهُ حَقَّهُ عَلَى أَنْ يُقِيلَهُ فَكَانَ ذَلِكَ بَيْعَ الطَّعَامِ إِلَى أَجَلٍ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّ الْمُشْتَرِيَ حِينَ حَلَّ الأَجَلُ وَكَرِهَ الطَّعَامَ أَخَذَ بِهِ دِينَارًا إِلَى أَجَلٍ وَلَيْسَ ذَلِكَ بِالإِقَالَةِ وَإِنَّمَا الإِقَالَةُ مَا لَمْ يَزْدَدْ فِيهِ الْبَائِعُ وَلاَ الْمُشْتَرِي فَإِذَا وَقَعَتْ فِيهِ الزِّيَادَةُ بِنَسِيئَةٍ إِلَى أَجَلٍ أَوْ بِشَىْءٍ يَزْدَادُهُ أَحَدُهُمَا عَلَى صَاحِبِهِ أَوْ بِشَىْءٍ يَنْتَفِعُ بِهِ أَحَدُهُمَا فَإِنَّ ذَلِكَ لَيْسَ بِالإِقَالَةِ وَإِنَّمَا تَصِيرُ الإِقَالَةُ إِذَا فَعَلاَ ذَلِكَ بَيْعًا وَإِنَّمَا أُرْخِصَ فِي الإِقَالَةِ وَالشِّرْكِ وَالتَّوْلِيَةِ مَا لَمْ يَدْخُلْ شَيْئًا مِنْ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ فَإِنْ دَخَلَ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ صَارَ بَيْعًا يُحِلُّهُ مَا يُحِلُّ الْبَيْعَ وَيُحَرِّمُهُ مَا يُحَرِّمُ الْبَيْعَ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ فِي حِنْطَةٍ شَامِيَّةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ مَحْمُولَةً بَعْدَ مَحِلِّ الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ مَنْ سَلَّفَ فِي صِنْفٍ مِنَ الأَصْنَافِ فَلاَ بَأْسَ أَنْ يَأْخُذَ خَيْرًا مِمَّا سَلَّفَ فِيهِ أَوْ أَدْنَى بَعْدَ مَحِلِّ الأَجَلِ وَتَفْسِيرُ ذَلِكَ أَنْ يُسَلِّفَ الرَّجُلُ فِي حِنْطَةٍ مَحْمُولَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ شَعِيرًا أَوْ شَامِيَّةً وَإِنْ سَلَّفَ فِي تَمْرٍ عَجْوَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ صَيْحَانِيًّا أَوْ جَمْعًا وَإِنْ سَلَّفَ فِي زَبِيبٍ أَحْمَرَ فَلاَ بَأْسَ أَنْ يَأْخُذَ أَسْوَدَ إِذَا كَانَ ذَلِكَ كُلُّهُ بَعْدَ مَحِلِّ الأَجَلِ إِذَا كَانَتْ مَكِيلَةُ ذَلِكَ سَوَاءً بِمِثْلِ كَيْلِ مَا سَلَّفَ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1339
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، قَالَ فَنِيَ عَلَفُ حِمَارِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1340
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ فَنِيَ عَلَفُ دَابَّتِهِ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ طَعَامًا فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1341
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ مُعَيْقِيبٍ الدَّوْسِيِّ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنْ لاَ تُبَاعَ الْحِنْطَةُ بِالْحِنْطَةِ وَلاَ التَّمْرُ بِالتَّمْرِ وَلاَ الْحِنْطَةُ بِالتَّمْرِ وَلاَ التَّمْرُ بِالزَّبِيبِ وَلاَ الْحِنْطَةُ بِالزَّبِيبِ وَلاَ شَىْءٌ مِنَ الطَّعَامِ كُلِّهِ إِلاَّ يَدًا بِيَدٍ فَإِنْ دَخَلَ شَيْئًا مِنْ ذَلِكَ الأَجَلُ لَمْ يَصْلُحْ وَكَانَ حَرَامًا وَلاَ شَىْءَ مِنَ الأُدْمِ كُلِّهَا إِلاَّ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَلاَ يُبَاعُ شَىْءٌ مِنَ الطَّعَامِ وَالأُدْمِ إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ اثْنَانِ بِوَاحِدٍ فَلاَ يُبَاعُ مُدُّ حِنْطَةٍ بِمُدَّىْ حِنْطَةٍ وَلاَ مُدُّ تَمْرٍ بِمُدَّىْ تَمْرٍ وَلاَ مُدُّ زَبِيبٍ بِمُدَّىْ زَبِيبٍ وَلاَ مَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ وَالأُدْمِ كُلِّهَا إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ وَإِنْ كَانَ يَدًا بِيَدٍ إِنَّمَا ذَلِكَ بِمَنْزِلَةِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ لاَ يَحِلُّ فِي شَىْءٍ مِنْ ذَلِكَ الْفَضْلُ وَلاَ يَحِلُّ إِلاَّ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَإِذَا اخْتَلَفَ مَا يُكَالُ أَوْ يُوزَنُ مِمَّا يُؤْكَلُ أَوْ يُشْرَبُ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُؤْخَذَ مِنْهُ اثْنَانِ بِوَاحِدٍ يَدًا بِيَدٍ وَلاَ بَأْسَ أَنْ يُؤْخَذَ صَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ حِنْطَةٍ وَصَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ زَبِيبٍ وَصَاعٌ مِنْ حِنْطَةٍ بِصَاعَيْنِ مِنْ سَمْنٍ فَإِذَا كَانَ الصِّنْفَانِ مِنْ هَذَا مُخْتَلِفَيْنِ فَلاَ بَأْسَ بِاثْنَيْنِ مِنْهُ بِوَاحِدٍ أَوْ أَكْثَرَ مِنْ ذَلِكَ يَدًا بِيَدٍ فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَلاَ يَحِلُّ ‏.‏ قَالَ مَالِكٌ وَلاَ تَحِلُّ صُبْرَةُ الْحِنْطَةِ بِصُبْرَةِ الْحِنْطَةِ وَلاَ بَأْسَ بِصُبْرَةِ الْحِنْطَةِ بِصُبْرَةِ التَّمْرِ يَدًا بِيَدٍ وَذَلِكَ أَنَّهُ لاَ بَأْسَ أَنْ يُشْتَرَى الْحِنْطَةُ بِالتَّمْرِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَا اخْتَلَفَ مِنَ الطَّعَامِ وَالأُدْمِ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُشْتَرَى بَعْضُهُ بِبَعْضٍ جِزَافًا يَدًا بِيَدٍ فَإِنْ دَخَلَهُ الأَجَلُ فَلاَ خَيْرَ فِيهِ وَإِنَّمَا اشْتِرَاءُ ذَلِكَ جِزَافًا كَاشْتِرَاءِ بَعْضِ ذَلِكَ بِالذَّهَبِ وَالْوَرِقِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّكَ تَشْتَرِي الْحِنْطَةَ بِالْوَرِقِ جِزَافًا وَالتَّمْرَ بِالذَّهَبِ جِزَافًا فَهَذَا حَلاَلٌ لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَمَنْ صَبَّرَ صُبْرَةَ طَعَامٍ وَقَدْ عَلِمَ كَيْلَهَا ثُمَّ بَاعَهَا جِزَافًا وَكَتَمَ الْمُشْتَرِي كَيْلَهَا فَإِنَّ ذَلِكَ لاَ يَصْلُحُ فَإِنْ أَحَبَّ الْمُشْتَرِي أَنْ يَرُدَّ ذَلِكَ الطَّعَامَ عَلَى الْبَائِعِ رَدَّهُ بِمَا كَتَمَهُ كَيْلَهُ وَغَرَّهُ وَكَذَلِكَ كُلُّ مَا عَلِمَ الْبَائِعُ كَيْلَهُ وَعَدَدَهُ مِنَ الطَّعَامِ وَغَيْرِهِ ثُمَّ بَاعَهُ جِزَافًا وَلَمْ يَعْلَمِ الْمُشْتَرِي ذَلِكَ فَإِنَّ الْمُشْتَرِيَ إِنْ أَحَبَّ أَنْ يَرُدَّ ذَلِكَ عَلَى الْبَائِعِ رَدَّهُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَلاَ خَيْرَ فِي الْخُبْزِ قُرْصٍ بِقُرْصَيْنِ وَلاَ عَظِيمٍ بِصَغِيرٍ إِذَا كَانَ بَعْضُ ذَلِكَ أَكْبَرَ مِنْ بَعْضٍ فَأَمَّا إِذَا كَانَ يَتَحَرَّى أَنْ يَكُونَ مِثْلاً بِمِثْلٍ فَلاَ بَأْسَ بِهِ وَإِنْ لَمْ يُوزَنْ ‏.‏ قَالَ مَالِكٌ لاَ يَصْلُحُ مُدُّ زُبْدٍ وَمُدُّ لَبَنٍ بِمُدَّىْ زُبْدٍ وَهُوَ مِثْلُ الَّذِي وَصَفْنَا مِنَ التَّمْرِ الَّذِي يُبَاعُ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ بِثَلاَثَةِ أَصْوُعٍ مِنْ عَجْوَةٍ حِينَ قَالَ لِصَاحِبِهِ إِنَّ صَاعَيْنِ مِنْ كَبِيسٍ بِثَلاَثَةِ أَصْوُعٍ مِنَ الْعَجْوَةِ لاَ يَصْلُحُ ‏.‏ فَفَعَلَ ذَلِكَ لِيُجِيزَ بَيْعَهُ وَإِنَّمَا جَعَلَ صَاحِبُ اللَّبَنِ اللَّبَنَ مَعَ زُبْدِهِ لِيَأْخُذَ فَضْلَ زُبْدِهِ عَلَى زُبْدِ صَاحِبِهِ حِينَ أَدْخَلَ مَعَهُ اللَّبَنَ ‏.‏ قَالَ مَالِكٌ وَالدَّقِيقُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ لاَ بَأْسَ بِهِ وَذَلِكَ لأَنَّهُ أَخْلَصَ الدَّقِيقَ فَبَاعَهُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ وَلَوْ جَعَلَ نِصْفَ الْمُدِّ مِنْ دَقِيقٍ وَنِصْفَهُ مِنْ حِنْطَةٍ فَبَاعَ ذَلِكَ بِمُدٍّ مِنْ حِنْطَةٍ كَانَ ذَلِكَ مِثْلَ الَّذِي وَصَفْنَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا أَرَادَ أَنْ يَأْخُذَ فَضْلَ حِنْطَتِهِ الْجَيِّدَةِ حَتَّى جَعَلَ مَعَهَا الدَّقِيقَ فَهَذَا لاَ يَصْلُحُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1342
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبْتَاعُ الطَّعَامَ يَكُونُ مِنَ الصُّكُوكِ بِالْجَارِ فَرُبَّمَا ابْتَعْتُ مِنْهُ بِدِينَارٍ وَنِصْفِ دِرْهَمٍ فَأُعْطَى بِالنِّصْفِ طَعَامًا ‏.‏ فَقَالَ سَعِيدٌ لاَ وَلَكِنْ أَعْطِ أَنْتَ دِرْهَمًا وَخُذْ بَقِيَّتَهُ طَعَامًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1343
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مُحَمَّدَ بْنَ سِيرِينَ، كَانَ يَقُولُ لاَ تَبِيعُوا الْحَبَّ فِي سُنْبُلِهِ حَتَّى يَبْيَضَّ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى طَعَامًا بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَلَمَّا حَلَّ الأَجَلُ قَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِصَاحِبِهِ لَيْسَ عِنْدِي طَعَامٌ فَبِعْنِي الطَّعَامَ الَّذِي لَكَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَيَقُولُ صَاحِبُ الطَّعَامِ هَذَا لاَ يَصْلُحُ لأَنَّهُ قَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَى ‏.‏ فَيَقُولُ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ فَبِعْنِي طَعَامًا إِلَى أَجَلٍ حَتَّى أَقْضِيَكَهُ ‏.‏ فَهَذَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا يُعْطِيهِ طَعَامًا ثُمَّ يَرُدُّهُ إِلَيْهِ ‏.‏ فَيَصِيرُ الذَّهَبُ الَّذِي أَعْطَاهُ ثَمَنَ الَّذِي كَانَ لَهُ عَلَيْهِ وَيَصِيرُ الطَّعَامُ الَّذِي أَعْطَاهُ مُحَلَّلاً فِيمَا بَيْنَهُمَا وَيَكُونُ ذَلِكَ إِذَا فَعَلاَهُ بَيْعَ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ لَهُ عَلَى رَجُلٍ طَعَامٌ ابْتَاعَهُ مِنْهُ وَلِغَرِيمِهِ عَلَى رَجُلٍ طَعَامٌ مِثْلُ ذَلِكَ الطَّعَامِ فَقَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ أُحِيلُكَ عَلَى غَرِيمٍ لِي عَلَيْهِ مِثْلُ الطَّعَامِ الَّذِي لَكَ عَلَىَّ بِطَعَامِكَ الَّذِي لَكَ عَلَىَّ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ الَّذِي عَلَيْهِ الطَّعَامُ إِنَّمَا هُوَ طَعَامٌ ابْتَاعَهُ فَأَرَادَ أَنْ يُحِيلَ غَرِيمَهُ بِطَعَامٍ ابْتَاعَهُ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَذَلِكَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى فَإِنْ كَانَ الطَّعَامُ سَلَفًا حَالاًّ فَلاَ بَأْسَ أَنْ يُحِيلَ بِهِ غَرِيمَهُ لأَنَّ ذَلِكَ لَيْسَ بِبَيْعٍ وَلاَ يَحِلُّ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ غَيْرَ أَنَّ أَهْلَ الْعِلْمِ قَدِ اجْتَمَعُوا عَلَى أَنَّهُ لاَ بَأْسَ بِالشِّرْكِ وَالتَّوْلِيَةِ وَالإِقَالَةِ فِي الطَّعَامِ وَغَيْرِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ أَهْلَ الْعِلْمِ أَنْزَلُوهُ عَلَى وَجْهِ الْمَعْرُوفِ وَلَمْ يُنْزِلُوهُ عَلَى وَجْهِ الْبَيْعِ وَذَلِكَ مِثْلُ الرَّجُلِ يُسَلِّفُ الدَّرَاهِمَ النُّقَّصَ فَيُقْضَى دَرَاهِمَ وَازِنَةً فِيهَا فَضْلٌ فَيَحِلُّ لَهُ ذَلِكَ وَيَجُوزُ وَلَوِ اشْتَرَى مِنْهُ دَرَاهِمَ نُقَّصًا بِوَازِنَةٍ لَمْ يَحِلَّ ذَلِكَ وَلَوِ اشْتَرَطَ عَلَيْهِ حِينَ أَسْلَفَهُ وَازِنَةً وَإِنَّمَا أَعْطَاهُ نُقَّصًا لَمْ يَحِلَّ لَهُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُشْبِهُ ذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَأَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ وَإِنَّمَا فُرِقَ بَيْنَ ذَلِكَ أَنَّ بَيْعَ الْمُزَابَنَةِ بَيْعٌ عَلَى وَجْهِ الْمُكَايَسَةِ وَالتِّجَارَةِ وَأَنَّ بَيْعَ الْعَرَايَا عَلَى وَجْهِ الْمَعْرُوفِ لاَ مُكَايَسَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي أَنْ يَشْتَرِيَ رَجُلٌ طَعَامًا بِرُبُعٍ أَوْ ثُلُثٍ أَوْ كِسْرٍ مِنْ دِرْهَمٍ عَلَى أَنْ يُعْطَى بِذَلِكَ طَعَامًا إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الرَّجُلُ طَعَامًا بِكِسْرٍ مِنْ دِرْهَمٍ إِلَى أَجَلٍ ثُمَّ يُعْطَى دِرْهَمًا وَيَأْخُذُ بِمَا بَقِيَ لَهُ مِنْ دِرْهَمِهِ سِلْعَةً مِنَ السِّلَعِ لأَنَّهُ أَعْطَى الْكِسْرَ الَّذِي عَلَيْهِ فِضَّةً وَأَخَذَ بِبَقِيَّةِ دِرْهَمِهِ سِلْعَةً فَهَذَا لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَضَعَ الرَّجُلُ عِنْدَ الرَّجُلِ دِرْهَمًا ثُمَّ يَأْخُذُ مِنْهُ بِرُبُعٍ أَوْ بِثُلُثٍ أَوْ بِكِسْرٍ مَعْلُومٍ سِلْعَةً مَعْلُومَةً فَإِذَا لَمْ يَكُنْ فِي ذَلِكَ سِعْرٌ مَعْلُومٌ وَقَالَ الرَّجُلُ آخُذُ مِنْكَ بِسِعْرِ كُلِّ يَوْمٍ فَهَذَا لاَ يَحِلُّ لأَنَّهُ غَرَرٌ يَقِلُّ مَرَّةً وَيَكْثُرُ مَرَّةً وَلَمْ يَفْتَرِقَا عَلَى بَيْعٍ مَعْلُومٍ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ طَعَامًا جِزَافًا وَلَمْ يَسْتَثْنِ مِنْهُ شَيْئًا ثُمَّ بَدَا لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا فَإِنَّهُ لاَ يَصْلُحُ لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَذَلِكَ الثُّلُثُ فَمَا دُونَهُ فَإِنْ زَادَ عَلَى الثُّلُثِ صَارَ ذَلِكَ إِلَى الْمُزَابَنَةِ وَإِلَى مَا يُكْرَهُ فَلاَ يَنْبَغِي لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَلاَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ إِلاَّ الثُّلُثَ فَمَا دُونَهُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ حُكْرَةَ فِي سُوقِنَا لاَ يَعْمِدُ رِجَالٌ بِأَيْدِيهِمْ فُضُولٌ مِنْ أَذْهَابٍ إِلَى رِزْقٍ مِنْ رِزْقِ اللَّهِ نَزَلَ بِسَاحَتِنَا فَيَحْتَكِرُونَهُ عَلَيْنَا وَلَكِنْ أَيُّمَا جَالِبٍ جَلَبَ عَلَى عَمُودِ كَبِدِهِ فِي الشِّتَاءِ وَالصَّيْفِ فَذَلِكَ ضَيْفُ عُمَرَ فَلْيَبِعْ كَيْفَ شَاءَ اللَّهُ وَلْيُمْسِكْ كَيْفَ شَاءَ اللَّهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1345
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يُونُسَ بْنِ يُوسُفَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، مَرَّ بِحَاطِبِ بْنِ أَبِي بَلْتَعَةَ وَهُوَ يَبِيعُ زَبِيبًا لَهُ بِالسُّوقِ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ إِمَّا أَنْ تَزِيدَ فِي السِّعْرِ وَإِمَّا أَنْ تُرْفَعَ مِنْ سُوقِنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1346
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَنْهَى عَنِ الْحُكْرَةِ، ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1347
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ حَسَنِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، بَاعَ جَمَلاً لَهُ يُدْعَى عُصَيْفِيرًا بِعِشْرِينَ بَعِيرًا إِلَى أَجَلٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1348
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اشْتَرَى رَاحِلَةً بِأَرْبَعَةِ أَبْعِرَةٍ مَضْمُونَةٍ عَلَيْهِ يُوفِيهَا صَاحِبَهَا بِالرَّبَذَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1349
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ بَيْعٍ الْحَيَوَانِ، اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ يَدًا بِيَدٍ وَلاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الْجَمَلُ بِالْجَمَلِ يَدًا بِيَدٍ وَالدَّرَاهِمُ إِلَى أَجَلٍ ‏.‏ قَالَ وَلاَ خَيْرَ فِي الْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الدَّرَاهِمُ نَقْدًا وَالْجَمَلُ إِلَى أَجَلٍ وَإِنْ أَخَّرْتَ الْجَمَلَ وَالدَّرَاهِمَ لاَ خَيْرَ فِي ذَلِكَ أَيْضًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الْبَعِيرَ النَّجِيبَ بِالْبَعِيرَيْنِ أَوْ بِالأَبْعِرَةِ مِنَ الْحَمُولَةِ مِنْ مَاشِيَةِ الإِبِلِ وَإِنْ كَانَتْ مِنْ نَعَمٍ وَاحِدَةٍ فَلاَ بَأْسَ أَنْ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ إِذَا اخْتَلَفَتْ فَبَانَ اخْتِلاَفُهَا وَإِنْ أَشْبَهَ بَعْضُهَا بَعْضًا وَاخْتَلَفَتْ أَجْنَاسُهَا أَوْ لَمْ تَخْتَلِفْ فَلاَ يُؤْخَذُ مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يُؤْخَذَ الْبَعِيرُ بِالْبَعِيرَيْنِ لَيْسَ بَيْنَهُمَا تَفَاضُلٌ فِي نَجَابَةٍ وَلاَ رِحْلَةٍ فَإِذَا كَانَ هَذَا عَلَى مَا وَصَفْتُ لَكَ فَلاَ يُشْتَرَى مِنْهُ اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي شَىْءٍ مِنَ الْحَيَوَانِ إِلَى أَجَلٍ مُسَمًّى فَوَصَفَهُ وَحَلاَّهُ وَنَقَدَ ثَمَنَهُ فَذَلِكَ جَائِزٌ وَهُوَ لاَزِمٌ لِلْبَائِعِ وَالْمُبْتَاعِ عَلَى مَا وَصَفَا وَحَلَّيَا وَلَمْ يَزَلْ ذَلِكَ مِنْ عَمَلِ النَّاسِ الْجَائِزِ بَيْنَهُمْ وَالَّذِي لَمْ يَزَلْ عَلَيْهِ أَهْلُ الْعِلْمِ بِبَلَدِنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1350
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ الْجَزُورَ إِلَى أَنْ تُنْتَجَ النَّاقَةُ ‏.‏ ثُمَّ تُنْتَجَ الَّتِي فِي بَطْنِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1351
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ لاَ رِبًا فِي الْحَيَوَانِ وَإِنَّمَا نُهِيَ مِنَ الْحَيَوَانِ عَنْ ثَلاَثَةٍ عَنِ الْمَضَامِينِ وَالْمَلاَقِيحِ وَحَبَلِ الْحَبَلَةِ ‏.‏ وَالْمَضَامِينُ بَيْعُ مَا فِي بُطُونِ إِنَاثِ الإِبِلِ وَالْمَلاَقِيحُ بَيْعُ مَا فِي ظُهُورِ الْجِمَالِ ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يَشْتَرِيَ أَحَدٌ شَيْئًا مِنَ الْحَيَوَانِ بِعَيْنِهِ إِذَا كَانَ غَائِبًا عَنْهُ وَإِنْ كَانَ قَدْ رَآهُ وَرَضِيَهُ عَلَى أَنْ يَنْقُدَ ثَمَنَهُ لاَ قَرِيبًا وَلاَ بَعِيدًا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّ الْبَائِعَ يَنْتَفِعُ بِالثَّمَنِ وَلاَ يُدْرَى هَلْ تُوجَدُ تِلْكَ السِّلْعَةُ عَلَى مَا رَآهَا الْمُبْتَاعُ أَمْ لاَ فَلِذَلِكَ كُرِهَ ذَلِكَ وَلاَ بَأْسَ بِهِ إِذَا كَانَ مَضْمُونًا مَوْصُوفًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1352
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1353
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مِنْ مَيْسِرِ أَهْلِ الْجَاهِلِيَّةِ بَيْعُ الْحَيَوَانِ بِاللَّحْمِ بِالشَّاةِ وَالشَّاتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1354
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ نُهِيَ عَنْ بَيْعِ الْحَيَوَانِ، بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ فَقُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ أَرَأَيْتَ رَجُلاً اشْتَرَى شَارِفًا بِعَشَرَةِ شِيَاهٍ فَقَالَ سَعِيدٌ إِنْ كَانَ اشْتَرَاهَا لِيَنْحَرَهَا فَلاَ خَيْرَ فِي ذَلِكَ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكُلُّ مَنْ أَدْرَكْتُ مِنَ النَّاسِ يَنْهَوْنَ عَنْ بَيْعِ الْحَيَوَانِ بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكَانَ ذَلِكَ يُكْتَبُ فِي عُهُودِ الْعُمَّالِ فِي زَمَانِ أَبَانَ بْنِ عُثْمَانَ وَهِشَامِ بْنِ إِسْمَاعِيلَ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1355
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏ يَعْنِي بِمَهْرِ الْبَغِيِّ مَا تُعْطَاهُ الْمَرْأَةُ عَلَى الزِّنَا وَحُلْوَانُ الْكَاهِنِ رَشْوَتُهُ وَمَا يُعْطَى عَلَى أَنْ يَتَكَهَّنَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1356
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعٍ وَسَلَفٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ آخُذُ سِلْعَتَكَ بِكَذَا وَكَذَا عَلَى أَنْ تُسْلِفَنِي كَذَا وَكَذَا ‏.‏ فَإِنْ عَقَدَا بَيْعَهُمَا عَلَى هَذَا فَهُوَ غَيْرُ جَائِزٍ فَإِنْ تَرَكَ الَّذِي اشْتَرَطَ السَّلَفَ مَا اشْتَرَطَ مِنْهُ كَانَ ذَلِكَ الْبَيْعُ جَائِزًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يُشْتَرَى الثَّوْبُ مِنَ الْكَتَّانِ أَوِ الشَّطَوِيِّ أَوِ الْقَصَبِيِّ بِالأَثْوَابِ مِنَ الإِتْرِيبِيِّ أَوِ الْقَسِّيِّ أَوِ الزِّيقَةِ أَوِ الثَّوْبِ الْهَرَوِيِّ أَوِ الْمَرْوِيِّ بِالْمَلاَحِفِ الْيَمَانِيَّةِ وَالشَّقَائِقِ وَمَا أَشْبَهَ ذَلِكَ الْوَاحِدُ بِالاِثْنَيْنِ أَوِ الثَّلاَثَةِ يَدًا بِيَدٍ أَوْ إِلَى أَجَلٍ وَإِنْ كَانَ مِنْ صِنْفٍ وَاحِدٍ فَإِنْ دَخَلَ ذَلِكَ نَسِيئَةٌ فَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَصْلُحُ حَتَّى يَخْتَلِفَ فَيَبِينَ اخْتِلاَفُهُ فَإِذَا أَشْبَهَ بَعْضُ ذَلِكَ بَعْضًا وَإِنِ اخْتَلَفَتْ أَسْمَاؤُهُ فَلاَ يَأْخُذْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ وَذَلِكَ أَنْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْهَرَوِيِّ بِالثَّوْبِ مِنَ الْمَرْوِيِّ أَوِ الْقُوهِيِّ إِلَى أَجَلٍ أَوْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْفُرْقُبِيِّ بِالثَّوْبِ مِنَ الشَّطَوِيِّ فَإِذَا كَانَتْ هَذِهِ الأَجْنَاسُ عَلَى هَذِهِ الصِّفَةِ فَلاَ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1357
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَرَجُلٌ، يَسْأَلُهُ عَنْ رَجُلٍ، سَلَّفَ فِي سَبَائِبَ فَأَرَادَ بَيْعَهَا قَبْلَ أَنْ يَقْبِضَهَا فَقَالَ ابْنُ عَبَّاسٍ تِلْكَ الْوَرِقُ بِالْوَرِقِ ‏.‏ وَكَرِهَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ أَنَّهُ أَرَادَ أَنْ يَبِيعَهَا مِنْ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي ابْتَاعَهَا بِهِ وَلَوْ أَنَّهُ بَاعَهَا مِنْ غَيْرِ الَّذِي اشْتَرَاهَا مِنْهُ لَمْ يَكُنْ بِذَلِكَ بَأْسٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ سَلَّفَ فِي رَقِيقٍ أَوْ مَاشِيَةٍ أَوْ عُرُوضٍ فَإِذَا كَانَ كُلُّ شَىْءٍ مِنْ ذَلِكَ مَوْصُوفًا فَسَلَّفَ فِيهِ إِلَى أَجَلٍ فَحَلَّ الأَجَلُ فَإِنَّ الْمُشْتَرِيَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ مِنَ الَّذِي اشْتَرَاهُ مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي سَلَّفَهُ فِيهِ قَبْلَ أَنْ يَقْبِضَ مَا سَلَّفَهُ فِيهِ وَذَلِكَ أَنَّهُ إِذَا فَعَلَهُ فَهُوَ الرِّبَا صَارَ الْمُشْتَرِي إِنْ أَعْطَى الَّذِي بَاعَهُ دَنَانِيرَ أَوْ دَرَاهِمَ فَانْتَفَعَ بِهَا فَلَمَّا حَلَّتْ عَلَيْهِ السِّلْعَةُ وَلَمْ يَقْبِضْهَا الْمُشْتَرِي بَاعَهَا مِنْ صَاحِبِهَا بِأَكْثَرَ مِمَّا سَلَّفَهُ فِيهَا فَصَارَ أَنْ رَدَّ إِلَيْهِ مَا سَلَّفَهُ وَزَادَهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ ذَهَبًا أَوْ وَرِقًا فِي حَيَوَانٍ أَوْ عُرُوضٍ إِذَا كَانَ مَوْصُوفًا إِلَى أَجَلٍ مُسَمًّى ثُمَّ حَلَّ الأَجَلُ فَإِنَّهُ لاَ بَأْسَ أَنْ يَبِيعَ الْمُشْتَرِي تِلْكَ السِّلْعَةَ مِنَ الْبَائِعِ قَبْلَ أَنْ يَحِلَّ الأَجَلُ أَوْ بَعْدَ مَا يَحِلُّ بِعَرْضٍ مِنَ الْعُرُوضِ يُعَجِّلُهُ وَلاَ يُؤَخِّرُهُ بَالِغًا مَا بَلَغَ ذَلِكَ الْعَرْضُ إِلاَّ الطَّعَامَ فَإِنَّهُ لاَ يَحِلُّ أَنْ يَبِيعَهُ حَتَّى يَقْبِضَهُ وَلِلْمُشْتَرِي أَنْ يَبِيعَ تِلْكَ السِّلْعَةَ مِنْ غَيْرِ صَاحِبِهِ الَّذِي ابْتَاعَهَا مِنْهُ بِذَهَبٍ أَوْ وَرِقٍ أَوْ عَرْضٍ مِنَ الْعُرُوضِ يَقْبِضُ ذَلِكَ وَلاَ يُؤَخِّرُهُ لأَنَّهُ إِذَا أَخَّرَ ذَلِكَ قَبُحَ وَدَخَلَهُ مَا يُكْرَهُ مِنَ الْكَالِئِ بِالْكَالِئِ وَالْكَالِئُ بِالْكَالِئِ أَنْ يَبِيعَ الرَّجُلُ دَيْنًا لَهُ عَلَى رَجُلٍ بِدَيْنٍ عَلَى رَجُلٍ آخَرَ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي سِلْعَةٍ إِلَى أَجَلٍ وَتِلْكَ السِّلْعَةُ مِمَّا لاَ يُؤْكَلُ وَلاَ يُشْرَبُ فَإِنَّ الْمُشْتَرِيَ يَبِيعُهَا مِمَّنْ شَاءَ بِنَقْدٍ أَوْ عَرْضٍ قَبْلَ أَنْ يَسْتَوْفِيَهَا مِنْ غَيْرِ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ وَلاَ يَنْبَغِي لَهُ أَنْ يَبِيعَهَا مِنَ الَّذِي ابْتَاعَهَا مِنْهُ إِلاَّ بِعَرْضٍ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانَتِ السِّلْعَةُ لَمْ تَحِلَّ فَلاَ بَأْسَ بِأَنْ يَبِيعَهَا مِنْ صَاحِبِهَا بِعَرْضٍ مُخَالِفٍ لَهَا بَيِّنٍ خِلاَفُهُ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ سَلَّفَ دَنَانِيرَ أَوْ دَرَاهِمَ فِي أَرْبَعَةِ أَثْوَابٍ مَوْصُوفَةٍ إِلَى أَجَلٍ فَلَمَّا حَلَّ الأَجَلُ تَقَاضَى صَاحِبَهَا فَلَمْ يَجِدْهَا عِنْدَهُ وَوَجَدَ عِنْدَهُ ثِيَابًا دُونَهَا مِنْ صِنْفِهَا فَقَالَ لَهُ الَّذِي عَلَيْهِ الأَثْوَابُ أُعْطِيكَ بِهَا ثَمَانِيَةَ أَثْوَابٍ مِنْ ثِيَابِي هَذِهِ ‏.‏ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا أَخَذَ تِلْكَ الأَثْوَابَ الَّتِي يُعْطِيهِ قَبْلَ أَنْ يَفْتَرِقَا فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَإِنَّهُ لاَ يَصْلُحُ وَإِنْ كَانَ ذَلِكَ قَبْلَ مَحِلِّ الأَجَلِ فَإِنَّهُ لاَ يَصْلُحُ أَيْضًا إِلاَّ أَنْ يَبِيعَهُ ثِيَابًا لَيْسَتْ مِنْ صِنْفِ الثِّيَابِ الَّتِي سَلَّفَهُ فِيهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1358
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1359
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، قَالَ لِرَجُلٍ ابْتَعْ لِي هَذَا الْبَعِيرَ بِنَقْدٍ حَتَّى أَبْتَاعَهُ مِنْكَ إِلَى أَجَلٍ فَسُئِلَ عَنْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَكَرِهَهُ وَنَهَى عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1360
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، سُئِلَ عَنْ رَجُلٍ، اشْتَرَى سِلْعَةً بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ ابْتَاعَ سِلْعَةً مِنْ رَجُلٍ بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ قَدْ وَجَبَتْ لِلْمُشْتَرِي بِأَحَدِ الثَّمَنَيْنِ إِنَّهُ لاَ يَنْبَغِي ذَلِكَ لأَنَّهُ إِنْ أَخَّرَ الْعَشَرَةَ كَانَتْ خَمْسَةَ عَشَرَ إِلَى أَجَلٍ وَإِنْ نَقَدَ الْعَشَرَةَ كَانَ إِنَّمَا اشْتَرَى بِهَا الْخَمْسَةَ عَشَرَ الَّتِي إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى مِنْ رَجُلٍ سِلْعَةً بِدِينَارٍ نَقْدًا أَوْ بِشَاةٍ مَوْصُوفَةٍ إِلَى أَجَلٍ قَدْ وَجَبَ عَلَيْهِ بِأَحَدِ الثَّمَنَيْنِ إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَنْبَغِي لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهَذَا مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ قَالَ لِرَجُلٍ أَشْتَرِي مِنْكَ هَذِهِ الْعَجْوَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الصَّيْحَانِيَّ عَشَرَةَ أَصْوُعٍ أَوِ الْحِنْطَةَ الْمَحْمُولَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الشَّامِيَّةَ عَشَرَةَ أَصْوُعٍ بِدِينَارٍ قَدْ وَجَبَتْ لِي إِحْدَاهُمَا إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَحِلُّ وَذَلِكَ أَنَّهُ قَدْ أَوْجَبَ لَهُ عَشَرَةَ أَصْوُعٍ صَيْحَانِيًّا فَهُوَ يَدَعُهَا وَيَأْخُذُ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْعَجْوَةِ أَوْ تَجِبُ عَلَيْهِ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْحِنْطَةِ الْمَحْمُولَةِ فَيَدَعُهَا وَيَأْخُذُ عَشَرَةَ أَصْوُعٍ مِنَ الشَّامِيَّةِ فَهَذَا أَيْضًا مَكْرُوهٌ لاَ يَحِلُّ وَهُوَ أَيْضًا يُشْبِهُ مَا نُهِيَ عَنْهُ مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهُوَ أَيْضًا مِمَّا نُهِيَ عَنْهُ أَنْ يُبَاعَ مِنْ صِنْفٍ وَاحِدٍ مِنَ الطَّعَامِ اثْنَانِ بِوَاحِدٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1361
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْغَرَرِ ‏.‏ قَالَ مَالِكٌ وَمِنَ الْغَرَرِ وَالْمُخَاطَرَةِ أَنْ يَعْمِدَ الرَّجُلُ قَدْ ضَلَّتْ دَابَّتُهُ أَوْ أَبَقَ غُلاَمُهُ وَثَمَنُ الشَّىْءِ مِنْ ذَلِكَ خَمْسُونَ دِينَارًا فَيَقُولُ رَجُلٌ أَنَا آخُذُهُ مِنْكَ بِعِشْرِينَ دِينَارًا ‏.‏ فَإِنْ وَجَدَهُ الْمُبْتَاعُ ذَهَبَ مِنَ الْبَائِعِ ثَلاَثُونَ دِينَارًا وَإِنْ لَمْ يَجِدْهُ ذَهَبَ الْبَائِعُ مِنَ الْمُبْتَاعِ بِعِشْرِينَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ عَيْبٌ آخَرُ إِنَّ تِلْكَ الضَّالَّةَ إِنْ وُجِدَتْ لَمْ يُدْرَ أَزَادَتْ أَمْ نَقَصَتْ أَمْ مَا حَدَثَ بِهَا مِنَ الْعُيُوبِ فَهَذَا أَعْظَمُ الْمُخَاطَرَةِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مِنَ الْمُخَاطَرَةِ وَالْغَرَرِ اشْتِرَاءَ مَا فِي بُطُونِ الإِنَاثِ مِنَ النِّسَاءِ وَالدَّوَابِّ لأَنَّهُ لاَ يُدْرَى أَيَخْرُجُ أَمْ لاَ يَخْرُجُ فَإِنْ خَرَجَ لَمْ يُدْرَ أَيَكُونُ حَسَنًا أَمْ قَبِيحًا أَمْ تَامًّا أَمْ نَاقِصًا أَمْ ذَكَرًا أَمْ أُنْثَى وَذَلِكَ كُلُّهُ يَتَفَاضَلُ إِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا وَإِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي بَيْعُ الإِنَاثِ وَاسْتِثْنَاءُ مَا فِي بُطُونِهَا وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ ثَمَنُ شَاتِي الْغَزِيرَةِ ثَلاَثَةُ دَنَانِيرَ فَهِيَ لَكَ بِدِينَارَيْنِ وَلِي مَا فِي بَطْنِهَا ‏.‏ فَهَذَا مَكْرُوهٌ لأَنَّهُ غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ يَحِلُّ بَيْعُ الزَّيْتُونِ بِالزَّيْتِ وَلاَ الْجُلْجُلاَنِ بِدُهْنِ الْجُلْجُلاَنِ وَلاَ الزُّبْدِ بِالسَّمْنِ لأَنَّ الْمُزَابَنَةَ تَدْخُلُهُ وَلأَنَّ الَّذِي يَشْتَرِي الْحَبَّ وَمَا أَشْبَهَهُ بِشَىْءٍ مُسَمًّى مِمَّا يَخْرُجُ مِنْهُ لاَ يَدْرِي أَيَخْرُجُ مِنْهُ أَقَلُّ مِنْ ذَلِكَ أَوْ أَكْثَرُ فَهَذَا غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا اشْتِرَاءُ حَبِّ الْبَانِ بِالسَّلِيخَةِ فَذَلِكَ غَرَرٌ لأَنَّ الَّذِي يَخْرُجُ مِنْ حَبِّ الْبَانِ هُوَ السَّلِيخَةُ وَلاَ بَأْسَ بِحَبِّ الْبَانِ بِالْبَانِ الْمُطَيَّبِ لأَنَّ الْبَانَ الْمُطَيَّبَ قَدْ طُيِّبَ وَنُشَّ وَتَحَوَّلَ عَنْ حَالِ السَّلِيخَةِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ بَاعَ سِلْعَةً مِنْ رَجُلٍ عَلَى أَنَّهُ لاَ نُقْصَانَ عَلَى الْمُبْتَاعِ إِنَّ ذَلِكَ بَيْعٌ غَيْرُ جَائِزٍ وَهُوَ مِنَ الْمُخَاطَرَةِ وَتَفْسِيرُ ذَلِكَ أَنَّهُ كَأَنَّهُ اسْتَأْجَرَهُ بِرِبْحٍ إِنْ كَانَ فِي تِلْكَ السِّلْعَةِ وَإِنْ بَاعَ بِرَأْسِ الْمَالِ أَوْ بِنُقْصَانٍ فَلاَ شَىْءَ لَهُ وَذَهَبَ عَنَاؤُهُ بَاطِلاً فَهَذَا لاَ يَصْلُحُ وَلِلْمُبْتَاعِ فِي هَذَا أُجْرَةٌ بِمِقْدَارِ مَا عَالَجَ مِنْ ذَلِكَ وَمَا كَانَ فِي تِلْكَ السِّلْعَةِ مِنْ نُقْصَانٍ أَوْ رِبْحٍ فَهُوَ لِلْبَائِعِ وَعَلَيْهِ وَإِنَّمَا يَكُونُ ذَلِكَ إِذَا فَاتَتِ السِّلْعَةُ وَبِيعَتْ ‏.‏ فَإِنْ لَمْ تَفُتْ فُسِخَ الْبَيْعُ بَيْنَهُمَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَبِيعَ رَجُلٌ مِنْ رَجُلٍ سِلْعَةً يَبُتُّ بَيْعَهَا ثُمَّ يَنْدَمُ الْمُشْتَرِي فَيَقُولُ لِلْبَائِعِ ضَعْ عَنِّي فَيَأْبَى الْبَائِعُ وَيَقُولُ بِعْ فَلاَ نُقْصَانَ عَلَيْكَ ‏.‏ فَهَذَا لاَ بَأْسَ بِهِ لأَنَّهُ لَيْسَ مِنَ الْمُخَاطَرَةِ وَإِنَّمَا هُوَ شَىْءٌ وَضَعَهُ لَهُ وَلَيْسَ عَلَى ذَلِكَ عَقَدَا بَيْعَهُمَا وَذَلِكَ الَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1362
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، وَعَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1363
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1364
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَيُّمَا بَيِّعَيْنِ تَبَايَعَا فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1365
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدٍ أَبِي صَالِحٍ، مَوْلَى السَّفَّاحِ أَنَّهُ قَالَ بِعْتُ بَزًّا لِي مِنْ أَهْلِ دَارِ نَخْلَةَ إِلَى أَجَلٍ ثُمَّ أَرَدْتُ الْخُرُوجَ إِلَى الْكُوفَةِ فَعَرَضُوا عَلَىَّ أَنْ أَضَعَ عَنْهُمْ بَعْضَ الثَّمَنِ وَيَنْقُدُونِي فَسَأَلْتُ عَنْ ذَلِكَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ لاَ آمُرُكَ أَنْ تَأْكُلَ هَذَا وَلاَ تُوكِلَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1366
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُثْمَانَ بْنِ حَفْصِ بْنِ خَلْدَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سُئِلَ عَنِ الرَّجُلِ، يَكُونُ لَهُ الدَّيْنُ عَلَى الرَّجُلِ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ صَاحِبُ الْحَقِّ وَيُعَجِّلُهُ الآخَرُ فَكَرِهَ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَنَهَى عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1367
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ كَانَ الرِّبَا فِي الْجَاهِلِيَّةِ أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الْحَقُّ إِلَى أَجَلٍ فَإِذَا حَلَّ الأَجَلُ قَالَ أَتَقْضِي أَمْ تُرْبِي فَإِنْ قَضَى أَخَذَ وَإِلاَّ زَادَهُ فِي حَقِّهِ وَأَخَّرَ عَنْهُ فِي الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمَكْرُوهُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الدَّيْنُ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ الطَّالِبُ وَيُعَجِّلُهُ الْمَطْلُوبُ وَذَلِكَ عِنْدَنَا بِمَنْزِلَةِ الَّذِي يُؤَخِّرُ دَيْنَهُ بَعْدَ مَحِلِّهِ عَنْ غَرِيمِهِ وَيَزِيدُهُ الْغَرِيمُ فِي حَقِّهِ قَالَ فَهَذَا الرِّبَا بِعَيْنِهِ لاَ شَكَّ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ مِائَةُ دِينَارٍ إِلَى أَجَلٍ فَإِذَا حَلَّتْ قَالَ لَهُ الَّذِي عَلَيْهِ الدَّيْنُ بِعْنِي سِلْعَةً يَكُونُ ثَمَنُهَا مِائَةَ دِينَارٍ نَقْدًا بِمِائَةٍ وَخَمْسِينَ إِلَى أَجَلٍ هَذَا بَيْعٌ لاَ يَصْلُحُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّهُ إِنَّمَا يُعْطِيهِ ثَمَنَ مَا بَاعَهُ بِعَيْنِهِ وَيُؤَخِّرُ عَنْهُ الْمِائَةَ الأُولَى إِلَى الأَجَلِ الَّذِي ذَكَرَ لَهُ آخِرَ مَرَّةٍ وَيَزْدَادُ عَلَيْهِ خَمْسِينَ دِينَارًا فِي تَأْخِيرِهِ عَنْهُ فَهَذَا مَكْرُوهٌ وَلاَ يَصْلُحُ وَهُوَ أَيْضًا يُشْبِهُ حَدِيثَ زَيْدِ بْنِ أَسْلَمَ فِي بَيْعِ أَهْلِ الْجَاهِلِيَّةِ إِنَّهُمْ كَانُوا إِذَا حَلَّتْ دُيُونُهُمْ قَالُوا لِلَّذِي عَلَيْهِ الدَّيْنُ إِمَّا أَنْ تَقْضِيَ وَإِمَّا أَنْ تُرْبِيَ ‏.‏ فَإِنْ قَضَى أَخَذُوا وَإِلاَّ زَادُوهُمْ فِي حُقُوقِهِمْ وَزَادُوهُمْ فِي الأَجَلِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1368
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1369
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، أَنَّهُ سَمِعَ رَجُلاً، يَسْأَلُ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبِيعُ بِالدَّيْنِ ‏.‏ فَقَالَ سَعِيدٌ لاَ تَبِعْ إِلاَّ مَا آوَيْتَ إِلَى رَحْلِكَ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي السِّلْعَةَ مِنَ الرَّجُلِ عَلَى أَنْ يُوَفِّيَهُ تِلْكَ السِّلْعَةَ إِلَى أَجَلٍ مُسَمًّى إِمَّا لِسُوقٍ يَرْجُو نَفَاقَهَا فِيهِ وَإِمَّا لِحَاجَةٍ فِي ذَلِكَ الزَّمَانِ الَّذِي اشْتَرَطَ عَلَيْهِ ثُمَّ يُخْلِفُهُ الْبَائِعُ عَنْ ذَلِكَ الأَجَلِ فَيُرِيدُ الْمُشْتَرِي رَدَّ تِلْكَ السِّلْعَةِ عَلَى الْبَائِعِ إِنَّ ذَلِكَ لَيْسَ لِلْمُشْتَرِي وَإِنَّ الْبَيْعَ لاَزِمٌ لَهُ وَإِنَّ الْبَائِعَ لَوْ جَاءَ بِتِلْكَ السِّلْعَةِ قَبْلَ مَحِلِّ الأَجَلِ لَمْ يُكْرَهِ الْمُشْتَرِي عَلَى أَخْذِهَا ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي الطَّعَامَ فَيَكْتَالُهُ ثُمَّ يَأْتِيهِ مَنْ يَشْتَرِيهِ مِنْهُ فَيُخْبِرُ الَّذِي يَأْتِيهِ أَنَّهُ قَدِ اكْتَالَهُ لِنَفْسِهِ وَاسْتَوْفَاهُ فَيُرِيدُ الْمُبْتَاعُ أَنْ يُصَدِّقَهُ وَيَأْخُذَهُ بِكَيْلِهِ إِنَّ مَا بِيعَ عَلَى هَذِهِ الصِّفَةِ بِنَقْدٍ فَلاَ بَأْسَ بِهِ وَمَا بِيعَ عَلَى هَذِهِ الصِّفَةِ إِلَى أَجَلٍ فَإِنَّهُ مَكْرُوهٌ حَتَّى يَكْتَالَهُ الْمُشْتَرِي الآخَرُ لِنَفْسِهِ وَإِنَّمَا كُرِهَ الَّذِي إِلَى أَجَلٍ لأَنَّهُ ذَرِيعَةٌ إِلَى الرِّبَا وَتَخَوُّفٌ أَنْ يُدَارَ ذَلِكَ عَلَى هَذَا الْوَجْهِ بِغَيْرِ كَيْلٍ وَلاَ وَزْنٍ فَإِنْ كَانَ إِلَى أَجَلٍ فَهُوَ مَكْرُوهٌ وَلاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يُشْتَرَى دَيْنٌ عَلَى رَجُلٍ غَائِبٍ وَلاَ حَاضِرٍ إِلاَّ بِإِقْرَارٍ مِنَ الَّذِي عَلَيْهِ الدَّيْنُ وَلاَ عَلَى مَيِّتٍ وَإِنْ عَلِمَ الَّذِي تَرَكَ الْمَيِّتُ وَذَلِكَ أَنَّ اشْتِرَاءَ ذَلِكَ غَرَرٌ لاَ يُدْرَى أَيَتِمُّ أَمْ لاَ يَتِمُّ ‏.‏ قَالَ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّهُ إِذَا اشْتَرَى دَيْنًا عَلَى غَائِبٍ أَوْ مَيِّتٍ أَنَّهُ لاَ يُدْرَى مَا يَلْحَقُ الْمَيِّتَ مِنَ الدَّيْنِ الَّذِي لَمْ يُعْلَمْ بِهِ فَإِنْ لَحِقَ الْمَيِّتَ دَيْنٌ ذَهَبَ الثَّمَنُ الَّذِي أَعْطَى الْمُبْتَاعُ بَاطِلاً ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ أَيْضًا عَيْبٌ آخَرُ أَنَّهُ اشْتَرَى شَيْئًا لَيْسَ بِمَضْمُونٍ لَهُ وَإِنْ لَمْ يَتِمَّ ذَهَبَ ثَمَنُهُ بَاطِلاً فَهَذَا غَرَرٌ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا فُرِقَ بَيْنَ أَنْ لاَ يَبِيعَ الرَّجُلُ إِلاَّ مَا عِنْدَهُ وَأَنْ يُسَلِّفَ الرَّجُلُ فِي شَىْءٍ لَيْسَ عِنْدَهُ أَصْلُهُ أَنَّ صَاحِبَ الْعِينَةِ إِنَّمَا يَحْمِلُ ذَهَبَهُ الَّتِي يُرِيدُ أَنْ يَبْتَاعَ بِهَا فَيَقُولُ هَذِهِ عَشَرَةُ دَنَانِيرَ فَمَا تُرِيدُ أَنْ أَشْتَرِيَ لَكَ بِهَا فَكَأَنَّهُ يَبِيعُ عَشَرَةَ دَنَانِيرَ نَقْدًا بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَلِهَذَا كُرِهَ هَذَا وَإِنَّمَا تِلْكَ الدُّخْلَةُ وَالدُّلْسَةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَيُّمَا رَجُلٍ بَاعَ مَتَاعًا فَأَفْلَسَ الَّذِي ابْتَاعَهُ مِنْهُ وَلَمْ يَقْبِضِ الَّذِي بَاعَهُ مِنْ ثَمَنِهِ شَيْئًا فَوَجَدَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ وَإِنْ مَاتَ الَّذِي ابْتَاعَهُ فَصَاحِبُ الْمَتَاعِ فِيهِ أُسْوَةُ الْغُرَمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1371
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ الرَّجُلُ مَالَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1372
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ اسْتَسْلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَكْرًا فَجَاءَتْهُ إِبِلٌ مِنَ الصَّدَقَةِ قَالَ أَبُو رَافِعٍ فَأَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ فَقُلْتُ لَمْ أَجِدْ فِي الإِبِلِ إِلاَّ جَمَلاً خِيَارًا رَبَاعِيًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَعْطِهِ إِيَّاهُ فَإِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1373
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ اسْتَسْلَفَ عَبْدُ اللَّهِ بْنُ عُمَرَ مِنْ رَجُلٍ دَرَاهِمَ ثُمَّ قَضَاهُ دَرَاهِمَ خَيْرًا مِنْهَا فَقَالَ الرَّجُلُ يَا أَبَا عَبْدِ الرَّحْمَنِ هَذِهِ خَيْرٌ مِنْ دَرَاهِمِي الَّتِي أَسْلَفْتُكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ عَلِمْتُ وَلَكِنْ نَفْسِي بِذَلِكَ طَيِّبَةٌ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَنْ يُقْبِضَ مَنْ أُسْلِفَ شَيْئًا مِنَ الذَّهَبِ أَوِ الْوَرِقِ أَوِ الطَّعَامِ أَوِ الْحَيَوَانِ مِمَّنْ أَسْلَفَهُ ذَلِكَ أَفْضَلَ مِمَّا أَسْلَفَهُ إِذَا لَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ مِنْهُمَا أَوْ عَادَةٍ فَإِنْ كَانَ ذَلِكَ عَلَى شَرْطٍ أَوْ وَأْىٍ أَوْ عَادَةٍ فَذَلِكَ مَكْرُوهٌ وَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى جَمَلاً رَبَاعِيًا خِيَارًا مَكَانَ بَكْرٍ اسْتَسْلَفَهُ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ اسْتَسْلَفَ دَرَاهِمَ فَقَضَى خَيْرًا مِنْهَا فَإِنْ كَانَ ذَلِكَ عَلَى طِيبِ نَفْسٍ مِنَ الْمُسْتَسْلِفِ وَلَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ وَلاَ وَأْىٍ وَلاَ عَادَةٍ كَانَ ذَلِكَ حَلاَلاً لاَ بَأْسَ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1374
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ فِي رَجُلٍ أَسْلَفَ رَجُلاً طَعَامًا عَلَى أَنْ يُعْطِيَهُ إِيَّاهُ فِي بَلَدٍ آخَرَ فَكَرِهَ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ وَقَالَ فَأَيْنَ الْحَمْلُ يَعْنِي حُمْلاَنَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1375
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَتَى عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَسْلَفْتُ رَجُلاً سَلَفًا وَاشْتَرَطْتُ عَلَيْهِ أَفْضَلَ مِمَّا أَسْلَفْتُهُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ عَبْدُ اللَّهِ السَّلَفُ عَلَى ثَلاَثَةِ وُجُوهٍ سَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ اللَّهِ فَلَكَ وَجْهُ اللَّهِ وَسَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ صَاحِبِكَ فَلَكَ وَجْهُ صَاحِبِكَ وَسَلَفٌ تُسْلِفُهُ لِتَأْخُذَ خَبِيثًا بِطَيِّبٍ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ أَرَى أَنْ تَشُقَّ الصَّحِيفَةَ فَإِنْ أَعْطَاكَ مِثْلَ الَّذِي أَسْلَفْتَهُ قَبِلْتَهُ وَإِنْ أَعْطَاكَ دُونَ الَّذِي أَسْلَفْتَهُ فَأَخَذْتَهُ أُجِرْتَ وَإِنْ أَعْطَاكَ أَفْضَلَ مِمَّا أَسْلَفْتَهُ طَيِّبَةً بِهِ نَفْسُهُ فَذَلِكَ شُكْرٌ شَكَرَهُ لَكَ وَلَكَ أَجْرُ مَا أَنْظَرْتَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1376
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ إِلاَّ قَضَاءَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1377
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ أَفْضَلَ مِنْهُ وَإِنْ كَانَتْ قَبْضَةً مِنْ عَلَفٍ فَهُوَ رِبًا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنِ اسْتَسْلَفَ شَيْئًا مِنَ الْحَيَوَانِ بِصِفَةٍ وَتَحْلِيَةٍ مَعْلُومَةٍ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ وَعَلَيْهِ أَنْ يَرُدَّ مِثْلَهُ إِلاَّ مَا كَانَ مِنَ الْوَلاَئِدِ فَإِنَّهُ يُخَافُ فِي ذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ مَا لاَ يَحِلُّ فَلاَ يَصْلُحُ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يَسْتَسْلِفَ الرَّجُلُ الْجَارِيَةَ فَيُصِيبُهَا مَا بَدَا لَهُ ثُمَّ يَرُدُّهَا إِلَى صَاحِبِهَا بِعَيْنِهَا فَذَلِكَ لاَ يَصْلُحُ وَلاَ يَحِلُّ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَلاَ يُرَخِّصُونَ فِيهِ لأَحَدٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1378
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1379
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَلَقَّوُا الرُّكْبَانَ لِلْبَيْعِ وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ تَنَاجَشُوا وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ وَلاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ فَمَنِ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا إِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1380
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "قَالَ مَالِكٌ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1381
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، ذَكَرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ قَالَ فَكَانَ الرَّجُلُ إِذَا بَايَعَ يَقُولُ لاَ خِلاَبَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1382
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِذَا جِئْتَ أَرْضًا يُوفُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَطِلِ الْمُقَامَ بِهَا وَإِذَا جِئْتَ أَرْضًا يُنَقِّصُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَقْلِلِ الْمُقَامَ بِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1383
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، يَقُولُ أَحَبَّ اللَّهُ عَبْدًا سَمْحًا إِنْ بَاعَ سَمْحًا إِنِ ابْتَاعَ سَمْحًا إِنْ قَضَى سَمْحًا إِنِ اقْتَضَى ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الإِبِلَ أَوِ الْغَنَمَ أَوِ الْبَزَّ أَوِ الرَّقِيقَ أَوْ شَيْئًا مِنَ الْعُرُوضِ جِزَافًا إِنَّهُ لاَ يَكُونُ الْجِزَافُ فِي شَىْءٍ مِمَّا يُعَدُّ عَدًّا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُعْطِي الرَّجُلَ السِّلْعَةَ يَبِيعُهَا لَهُ وَقَدْ قَوَّمَهَا صَاحِبُهَا قِيمَةً فَقَالَ إِنْ بِعْتَهَا بِهَذَا الثَّمَنِ الَّذِي أَمَرْتُكَ بِهِ فَلَكَ دِينَارٌ - أَوْ شَىْءٌ يُسَمِّيهِ لَهُ يَتَرَاضَيَانِ عَلَيْهِ - وَإِنْ لَمْ تَبِعْهَا فَلَيْسَ لَكَ شَىْءٌ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا سَمَّى ثَمَنًا يَبِيعُهَا بِهِ وَسَمَّى أَجْرًا مَعْلُومًا إِذَا بَاعَ أَخَذَهُ وَإِنْ لَمْ يَبِعْ فَلاَ شَىْءَ لَهُ ‏.‏ قَالَ مَالِكٌ وَمِثْلُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ إِنْ قَدَرْتَ عَلَى غُلاَمِي الآبِقِ أَوْ جِئْتَ بِجَمَلِي الشَّارِدِ فَلَكَ كَذَا ‏.‏ فَهَذَا مِنْ بَابِ الْجُعْلِ وَلَيْسَ مِنْ بَابِ الإِجَارَةِ وَلَوْ كَانَ مِنْ بَابِ الإِجَارَةِ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يُعْطَى السِّلْعَةَ فَيُقَالُ لَهُ بِعْهَا وَلَكَ كَذَا وَكَذَا فِي كُلِّ دِينَارٍ ‏.‏ لِشَىْءٍ يُسَمِّيهِ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ لأَنَّهُ كُلَّمَا نَقَصَ دِينَارٌ مِنْ ثَمَنِ السِّلْعَةِ نَقَصَ مِنْ حَقِّهِ الَّذِي سَمَّى لَهُ فَهَذَا غَرَرٌ لاَ يَدْرِي كَمْ جَعَلَ لَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1384
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَهُ عَنِ الرَّجُلِ، يَتَكَارَى الدَّابَّةَ ثُمَّ يُكْرِيهَا بِأَكْثَرَ مِمَّا تَكَارَاهَا بِهِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1385
			}
		}
	]
}