{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1464
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَعَنْ غَيْرِ، وَاحِدٍ، عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ الْبَصْرِيِّ، وَعَنْ مُحَمَّدِ بْنِ سِيرِينَ، أَنَّ رَجُلاً، فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْتَقَ عَبِيدًا لَهُ سِتَّةً عِنْدَ مَوْتِهِ فَأَسْهَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمْ فَأَعْتَقَ ثُلُثَ تِلْكَ الْعَبِيدِ ‏.‏ قَالَ مَالِكٌ وَبَلَغَنِي أَنَّهُ لَمْ يَكُنْ لِذَلِكَ الرَّجُلِ مَالٌ غَيْرُهُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1465
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ رَجُلاً، فِي إِمَارَةِ أَبَانَ بْنِ عُثْمَانَ أَعْتَقَ رَقِيقًا لَهُ كُلَّهُمْ جَمِيعًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَأَمَرَ أَبَانُ بْنُ عُثْمَانَ بِتِلْكَ الرَّقِيقِ فَقُسِمَتْ أَثْلاَثًا ثُمَّ أَسْهَمَ عَلَى أَيِّهِمْ يَخْرُجُ سَهْمُ الْمَيِّتِ فَيَعْتِقُونَ فَوَقَعَ السَّهْمُ عَلَى أَحَدِ الأَثْلاَثِ فَعَتَقَ الثُّلُثُ الَّذِي وَقَعَ عَلَيْهِ السَّهْمُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1466
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَمِعَهُ يَقُولُ مَضَتِ السُّنَّةُ أَنَّ الْعَبْدَ إِذَا عَتَقَ تَبِعَهُ مَالُهُ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُبَيِّنُ ذَلِكَ أَنَّ الْعَبْدَ إِذَا عَتَقَ تَبِعَهُ مَالُهُ أَنَّ الْمُكَاتَبَ إِذَا كُوتِبَ تَبِعَهُ مَالُهُ وَإِنْ لَمْ يَشْتَرِطْهُ وَذَلِكَ أَنَّ عَقْدَ الْكِتَابَةِ هُوَ عَقْدُ الْوَلاَءِ إِذَا تَمَّ ذَلِكَ وَلَيْسَ مَالُ الْعَبْدِ وَالْمُكَاتَبِ بِمَنْزِلَةِ مَا كَانَ لَهُمَا مِنْ وَلَدٍ إِنَّمَا أَوْلاَدُهُمَا بِمَنْزِلَةِ رِقَابِهِمَا لَيْسُوا بِمَنْزِلَةِ أَمْوَالِهِمَا لأَنَّ السُّنَّةَ الَّتِي لاَ اخْتِلاَفَ فِيهَا أَنَّ الْعَبْدَ إِذَا عَتَقَ تَبِعَهُ مَالُهُ وَلَمْ يَتْبَعْهُ وَلَدُهُ وَأَنَّ الْمُكَاتَبَ إِذَا كُوتِبَ تَبِعَهُ مَالُهُ وَلَمْ يَتْبَعْهُ وَلَدُهُ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُبَيِّنُ ذَلِكَ أَيْضًا أَنَّ الْعَبْدَ وَالْمُكَاتَبَ إِذَا أَفْلَسَا أُخِذَتْ أَمْوَالُهُمَا وَأُمَّهَاتُ أَوْلاَدِهِمَا وَلَمْ تُؤْخَذْ أَوْلاَدُهُمَا لأَنَّهُمْ لَيْسُوا بِأَمْوَالٍ لَهُمَا ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُبَيِّنُ ذَلِكَ أَيْضًا أَنَّ الْعَبْدَ إِذَا بِيعَ وَاشْتَرَطَ الَّذِي ابْتَاعَهُ مَالَهُ لَمْ يَدْخُلْ وَلَدُهُ فِي مَالِهِ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُبَيِّنُ ذَلِكَ أَيْضًا أَنَّ الْعَبْدَ إِذَا جَرَحَ أُخِذَ هُوَ وَمَالُهُ وَلَمْ يُؤْخَذْ وَلَدُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1467
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ أَيُّمَا وَلِيدَةٍ وَلَدَتْ مِنْ سَيِّدِهَا فَإِنَّهُ لاَ يَبِيعُهَا وَلاَ يَهَبُهَا وَلاَ يُوَرِّثُهَا وَهُوَ يَسْتَمْتِعُ بِهَا فَإِذَا مَاتَ فَهِيَ حُرَّةٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1468
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَتَتْهُ وَلِيدَةٌ قَدْ ضَرَبَهَا سَيِّدُهَا بِنَارٍ أَوْ أَصَابَهَا بِهَا فَأَعْتَقَهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ تَجُوزُ عَتَاقَةُ رَجُلٍ وَعَلَيْهِ دَيْنٌ يُحِيطُ بِمَالِهِ وَأَنَّهُ لاَ تَجُوزُ عَتَاقَةُ الْغُلاَمِ حَتَّى يَحْتَلِمَ أَوْ يَبْلُغَ مَبْلَغَ الْمُحْتَلِمِ وَأَنَّهُ لاَ تَجُوزُ عَتَاقَةُ الْمُوَلَّى عَلَيْهِ فِي مَالِهِ وَإِنْ بَلَغَ الْحُلُمَ حَتَّى يَلِيَ مَالَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1469
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ هِلاَلِ بْنِ أُسَامَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ، أَنَّهُ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ جَارِيَةً لِي كَانَتْ تَرْعَى غَنَمًا لِي فَجِئْتُهَا وَقَدْ فُقِدَتْ شَاةٌ مِنَ الْغَنَمِ فَسَأَلْتُهَا عَنْهَا فَقَالَتْ أَكَلَهَا الذِّئْبُ فَأَسِفْتُ عَلَيْهَا وَكُنْتُ مِنْ بَنِي آدَمَ فَلَطَمْتُ وَجْهَهَا وَعَلَىَّ رَقَبَةٌ أَفَأُعْتِقُهَا فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيْنَ اللَّهُ ‏\"‏ ‏.‏ فَقَالَتْ فِي السَّمَاءِ ‏.‏ فَقَالَ ‏\"‏ مَنْ أَنَا ‏\"‏ ‏.‏ فَقَالَتْ أَنْتَ رَسُولُ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْتِقْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1470
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِجَارِيَةٍ لَهُ سَوْدَاءَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَىَّ رَقَبَةً مُؤْمِنَةً فَإِنْ كُنْتَ تَرَاهَا مُؤْمِنَةً أُعْتِقُهَا ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَشْهَدِينَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتَشْهَدِينَ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتُوقِنِينَ بِالْبَعْثِ بَعْدَ الْمَوْتِ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْتِقْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1471
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ عَنِ الْمَقْبُرِيِّ، أَنَّهُ قَالَ سُئِلَ أَبُو هُرَيْرَةَ عَنِ الرَّجُلِ، تَكُونُ عَلَيْهِ رَقَبَةٌ هَلْ يُعْتِقُ فِيهَا ابْنَ زِنًا فَقَالَ أَبُو هُرَيْرَةَ نَعَمْ ذَلِكَ يُجْزِئُ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1472
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ الأَنْصَارِيِّ، وَكَانَ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سُئِلَ عَنِ الرَّجُلِ تَكُونُ عَلَيْهِ رَقَبَةٌ هَلْ يَجُوزُ لَهُ أَنْ يُعْتِقَ وَلَدَ زِنًا قَالَ نَعَمْ ذَلِكَ يُجْزِئُ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1473
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، سُئِلَ عَنِ الرَّقَبَةِ الْوَاجِبَةِ، هَلْ تُشْتَرَى بِشَرْطٍ فَقَالَ لاَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ فِي الرِّقَابِ الْوَاجِبَةِ أَنَّهُ لاَ يَشْتَرِيهَا الَّذِي يُعْتِقُهَا فِيمَا وَجَبَ عَلَيْهِ بِشَرْطٍ عَلَى أَنْ يُعْتِقَهَا لأَنَّهُ إِذَا فَعَلَ ذَلِكَ فَلَيْسَتْ بِرَقَبَةٍ تَامَّةٍ لأَنَّهُ يَضَعُ مِنْ ثَمَنِهَا لِلَّذِي يَشْتَرِطُ مِنْ عِتْقِهَا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَشْتَرِيَ الرَّقَبَةَ فِي التَّطَوُّعِ وَيَشْتَرِطَ أَنْ يُعْتِقَهَا ‏.‏ قَالَ مَالِكٌ إِنَّ أَحْسَنَ مَا سُمِعَ فِي الرِّقَابِ الْوَاجِبَةِ أَنَّهُ لاَ يَجُوزُ أَنْ يُعْتَقَ فِيهَا نَصْرَانِيٌّ وَلاَ يَهُودِيٌّ وَلاَ يُعْتَقُ فِيهَا مُكَاتَبٌ وَلاَ مُدَبَّرٌ وَلاَ أُمُّ وَلَدٍ وَلاَ مُعْتَقٌ إِلَى سِنِينَ وَلاَ أَعْمَى وَلاَ بَأْسَ أَنْ يُعْتَقَ النَّصْرَانِيُّ وَالْيَهُودِيُّ وَالْمَجُوسِيُّ تَطَوُّعًا لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً‏}‏ فَالْمَنُّ الْعَتَاقَةُ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرِّقَابُ الْوَاجِبَةُ الَّتِي ذَكَرَ اللَّهُ فِي الْكِتَابِ فَإِنَّهُ لاَ يُعْتَقُ فِيهَا إِلاَّ رَقَبَةٌ مُؤْمِنَةٌ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ فِي إِطْعَامِ الْمَسَاكِينِ فِي الْكَفَّارَاتِ لاَ يَنْبَغِي أَنْ يُطْعَمَ فِيهَا إِلاَّ الْمُسْلِمُونَ وَلاَ يُطْعَمُ فِيهَا أَحَدٌ عَلَى غَيْرِ دِينِ الإِسْلاَمِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1474
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الأَنْصَارِيِّ، أَنَّ أُمَّهُ، أَرَادَتْ أَنْ تُوصِيَ ثُمَّ أَخَّرَتْ ذَلِكَ إِلَى أَنْ تُصْبِحَ فَهَلَكَتْ وَقَدْ كَانَتْ هَمَّتْ بِأَنْ تُعْتِقَ فَقَالَ عَبْدُ الرَّحْمَنِ فَقُلْتُ لِلْقَاسِمِ بْنِ مُحَمَّدٍ أَيَنْفَعُهَا أَنْ أُعْتِقَ عَنْهَا فَقَالَ الْقَاسِمُ إِنَّ سَعْدَ بْنَ عُبَادَةَ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمِّي هَلَكَتْ فَهَلْ يَنْفَعُهَا أَنْ أُعْتِقَ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1475
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ تُوُفِّيَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ فِي نَوْمٍ نَامَهُ فَأَعْتَقَتْ عَنْهُ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم رِقَابًا كَثِيرَةً ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1476
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الرِّقَابِ أَيُّهَا أَفْضَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَغْلاَهَا ثَمَنًا وَأَنْفَسُهَا عِنْدَ أَهْلِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1477
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ أَعْتَقَ وَلَدَ زِنًا وَأُمَّهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1478
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ جَاءَتْ بَرِيرَةُ فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوْقِيَّةٌ فَأَعِينِينِي ‏.‏ فَقَالَتْ عَائِشَةُ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَنْكِ عَدَدْتُهَا وَيَكُونَ لِي وَلاَؤُكِ فَعَلْتُ ‏.‏ فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا فَقَالَتْ لَهُمْ ذَلِكَ فَأَبَوْا عَلَيْهَا فَجَاءَتْ مِنْ عِنْدِ أَهْلِهَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ فَقَالَتْ لِعَائِشَةَ إِنِّي قَدْ عَرَضْتُ عَلَيْهِمْ ذَلِكَ فَأَبَوْا عَلَىَّ إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ ‏.‏ فَسَمِعَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَهَا فَأَخْبَرَتْهُ عَائِشَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خُذِيهَا وَاشْتَرِطِي لَهُمُ الْوَلاَءَ فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ فَفَعَلَتْ عَائِشَةُ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَمَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ قَضَاءُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1479
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ يَمْنَعَنَّكِ ذَلِكَ فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1480
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ بَرِيرَةَ، جَاءَتْ تَسْتَعِينُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ فَقَالَتْ عَائِشَةُ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَصُبَّ لَهُمْ ثَمَنَكِ صَبَّةً وَاحِدَةً وَأُعْتِقَكِ فَعَلْتُ ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَقَالُوا لاَ إِلاَّ أَنْ يَكُونَ لَنَا وَلاَؤُكِ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ فَزَعَمَتْ عَمْرَةُ أَنَّ عَائِشَةَ ذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1481
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1482
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، ‏.‏ أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِ، اشْتَرَى عَبْدًا فَأَعْتَقَهُ وَلِذَلِكَ الْعَبْدِ بَنُونَ مِنِ امْرَأَةٍ حُرَّةٍ فَلَمَّا أَعْتَقَهُ الزُّبَيْرُ قَالَ هُمْ مَوَالِيَّ ‏.‏ وَقَالَ مَوَالِي أُمِّهِمْ بَلْ هُمْ مَوَالِينَا ‏.‏ فَاخْتَصَمُوا إِلَى عُثْمَانَ بْنِ عَفَّانَ فَقَضَى عُثْمَانُ لِلزُّبَيْرِ بِوَلاَئِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1483
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنْ عَبْدٍ لَهُ، وَلَدٌ مِنِ امْرَأَةٍ حُرَّةٍ لِمَنْ وَلاَؤُهُمْ فَقَالَ سَعِيدٌ إِنْ مَاتَ أَبُوهُمْ وَهُوَ عَبْدٌ لَمْ يُعْتَقْ فَوَلاَؤُهُمْ لِمَوَالِي أُمِّهِمْ ‏.‏ قَالَ مَالِكٌ وَمَثَلُ ذَلِكَ وَلَدُ الْمُلاَعَنَةِ مِنَ الْمَوَالِي يُنْسَبُ إِلَى مَوَالِي أُمِّهِ فَيَكُونُونَ هُمْ مَوَالِيَهُ إِنْ مَاتَ وَرِثُوهُ وَإِنْ جَرَّ جَرِيرَةً عَقَلُوا عَنْهُ فَإِنِ اعْتَرَفَ بِهِ أَبُوهُ أُلْحِقَ بِهِ وَصَارَ وَلاَؤُهُ إِلَى مَوَالِي أَبِيهِ وَكَانَ مِيرَاثُهُ لَهُمْ وَعَقْلُهُ عَلَيْهِمْ وَيُجْلَدُ أَبُوهُ الْحَدَّ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْمَرْأَةُ الْمُلاَعِنَةُ مِنَ الْعَرَبِ إِذَا اعْتَرَفَ زَوْجُهَا الَّذِي لاَعَنَهَا بِوَلَدِهَا صَارَ بِمِثْلِ هَذِهِ الْمَنْزِلَةِ إِلاَّ أَنَّ بَقِيَّةَ مِيرَاثِهِ بَعْدَ مِيرَاثِ أُمِّهِ وَإِخْوَتِهِ لأُمِّهِ لِعَامَّةِ الْمُسْلِمِينَ مَا لَمْ يُلْحَقْ بِأَبِيهِ وَإِنَّمَا وَرَّثَ وَلَدُ الْمُلاَعَنَةِ الْمُوَالاَةَ مَوَالِيَ أُمِّهِ قَبْلَ أَنْ يَعْتَرِفَ بِهِ أَبُوهُ لأَنَّهُ لَمْ يَكُنْ لَهُ نَسَبٌ وَلاَ عَصَبَةٌ فَلَمَّا ثَبَتَ نَسَبُهُ صَارَ إِلَى عَصَبَتِهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي وَلَدِ الْعَبْدِ مِنِ امْرَأَةٍ حُرَّةٍ وَأَبُو الْعَبْدِ حُرٌّ أَنَّ الْجَدَّ أَبَا الْعَبْدِ يَجُرُّ وَلاَءَ وَلَدِ ابْنِهِ الأَحْرَارِ مِنِ امْرَأَةٍ حُرَّةٍ يَرِثُهُمْ مَا دَامَ أَبُوهُمْ عَبْدًا فَإِنْ عَتَقَ أَبُوهُمْ رَجَعَ الْوَلاَءُ إِلَى مَوَالِيهِ وَإِنْ مَاتَ وَهُوَ عَبْدٌ كَانَ الْمِيرَاثُ وَالْوَلاَءُ لِلْجَدِّ وَإِنِ الْعَبْدُ كَانَ لَهُ ابْنَانِ حُرَّانِ فَمَاتَ أَحَدُهُمَا وَأَبُوهُ عَبْدٌ جَرَّ الْجَدُّ أَبُو الأَبِ الْوَلاَءَ وَالْمِيرَاثَ ‏.‏ قَالَ مَالِكٌ فِي الأَمَةِ تُعْتَقُ وَهِيَ حَامِلٌ وَزَوْجُهَا مَمْلُوكٌ ثُمَّ يَعْتِقُ زَوْجُهَا قَبْلَ أَنْ تَضَعَ حَمْلَهَا أَوْ بَعْدَ مَا تَضَعُ إِنَّ وَلاَءَ مَا كَانَ فِي بَطْنِهَا لِلَّذِي أَعْتَقَ أُمَّهُ لأَنَّ ذَلِكَ الْوَلَدَ قَدْ كَانَ أَصَابَهُ الرِّقُّ قَبْلَ أَنْ تُعْتَقَ أُمُّهُ وَلَيْسَ هُوَ بِمَنْزِلَةِ الَّذِي تَحْمِلُ بِهِ أُمُّهُ بَعْدَ الْعَتَاقَةِ لأَنَّ الَّذِي تَحْمِلُ بِهِ أُمُّهُ بَعْدَ الْعَتَاقَةِ إِذَا أُعْتِقَ أَبُوهُ جَرَّ وَلاَءَهُ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ يَسْتَأْذِنُ سَيِّدَهُ أَنْ يُعْتِقَ عَبْدًا لَهُ فَيَأْذَنَ لَهُ سَيِّدُهُ إِنَّ وَلاَءَ الْعَبْدِ الْمُعْتَقِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّ الْعَاصِيَ بْنَ هِشَامٍ هَلَكَ وَتَرَكَ بَنِينَ لَهُ ثَلاَثَةً اثْنَانِ لأُمٍّ وَرَجُلٌ لِعَلَّةٍ فَهَلَكَ أَحَدُ اللَّذَيْنِ لأُمٍّ وَتَرَكَ مَالاً وَمَوَالِيَ فَوَرِثَهُ أَخُوهُ لأَبِيهِ وَأُمِّهِ مَالَهُ وَوَلاَءَهُ مَوَالِيهِ ثُمَّ هَلَكَ الَّذِي وَرِثَ الْمَالَ وَوَلاَءَ الْمَوَالِي وَتَرَكَ ابْنَهُ وَأَخَاهُ لأَبِيهِ فَقَالَ ابْنُهُ قَدْ أَحْرَزْتُ مَا كَانَ أَبِي أَحْرَزَ مِنَ الْمَالِ وَوَلاَءِ الْمَوَالِي وَقَالَ أَخُوهُ لَيْسَ كَذَلِكَ إِنَّمَا أَحْرَزْتَ الْمَالَ وَأَمَّا وَلاَءُ الْمَوَالِي فَلاَ أَرَأَيْتَ لَوْ هَلَكَ أَخِي الْيَوْمَ أَلَسْتُ أَرِثُهُ أَنَا فَاخْتَصَمَا إِلَى عُثْمَانَ بْنِ عَفَّانَ فَقَضَى لأَخِيهِ بِوَلاَءِ الْمَوَالِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1485
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّهُ أَخْبَرَهُ أَبُوهُ، أَنَّهُ كَانَ جَالِسًا عِنْدَ أَبَانَ بْنِ عُثْمَانَ فَاخْتَصَمَ إِلَيْهِ نَفَرٌ مِنْ جُهَيْنَةَ وَنَفَرٌ مِنْ بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ وَكَانَتِ امْرَأَةٌ مِنْ جُهَيْنَةَ عِنْدَ رَجُلٍ مِنْ بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ يُقَالُ لَهُ إِبْرَاهِيمُ بْنُ كُلَيْبٍ فَمَاتَتِ الْمَرْأَةُ وَتَرَكَتْ مَالاً وَمَوَالِيَ فَوَرِثَهَا ابْنُهَا وَزَوْجُهَا ثُمَّ مَاتَ ابْنُهَا فَقَالَ وَرَثَتُهُ لَنَا وَلاَءُ الْمَوَالِي قَدْ كَانَ ابْنُهَا أَحْرَزَهُ فَقَالَ الْجُهَنِيُّونَ لَيْسَ كَذَلِكَ إِنَّمَا هُمْ مَوَالِي صَاحِبَتِنَا فَإِذَا مَاتَ وَلَدُهَا فَلَنَا وَلاَؤُهُمْ وَنَحْنُ نَرِثُهُمْ فَقَضَى أَبَانُ بْنُ عُثْمَانَ لِلْجُهَنِيِّينَ بِوَلاَءِ الْمَوَالِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1486
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ فِي رَجُلٍ هَلَكَ وَتَرَكَ بَنِينَ لَهُ ثَلاَثَةً وَتَرَكَ مَوَالِيَ أَعْتَقَهُمْ هُوَ عَتَاقَةً ثُمَّ إِنَّ الرَّجُلَيْنِ مِنْ بَنِيهِ هَلَكَا وَتَرَكَا أَوْلاَدًا ‏.‏ فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ يَرِثُ الْمَوَالِيَ الْبَاقِي مِنَ الثَّلاَثَةِ فَإِذَا هَلَكَ هُوَ فَوَلَدُهُ وَوَلَدُ إِخْوَتِهِ فِي وَلاَءِ الْمَوَالِي شَرَعٌ سَوَاءٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1487
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ السَّائِبَةِ، قَالَ يُوَالِي مَنْ شَاءَ فَإِنْ مَاتَ وَلَمْ يُوَالِ أَحَدًا فَمِيرَاثُهُ لِلْمُسْلِمِينَ وَعَقْلُهُ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ إِنَّ أَحْسَنَ مَا سُمِعَ فِي السَّائِبَةِ أَنَّهُ لاَ يُوَالِي أَحَدًا وَأَنَّ مِيرَاثَهُ لِلْمُسْلِمِينَ وَعَقْلَهُ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ فِي الْيَهُودِيِّ وَالنَّصْرَانِيِّ يُسْلِمُ عَبْدُ أَحَدِهِمَا فَيُعْتِقُهُ قَبْلَ أَنْ يُبَاعَ عَلَيْهِ إِنَّ وَلاَءَ الْعَبْدِ الْمُعْتَقِ لِلْمُسْلِمِينَ وَإِنْ أَسْلَمَ الْيَهُودِيُّ أَوِ النَّصْرَانِيُّ بَعْدَ ذَلِكَ لَمْ يَرْجِعْ إِلَيْهِ الْوَلاَءُ أَبَدًا ‏.‏ قَالَ وَلَكِنْ إِذَا أَعْتَقَ الْيَهُودِيُّ أَوِ النَّصْرَانِيُّ عَبْدًا عَلَى دِينِهِمَا ثُمَّ أَسْلَمَ الْمُعْتَقُ قَبْلَ أَنْ يُسْلِمَ الْيَهُودِيُّ أَوِ النَّصْرَانِيُّ الَّذِي أَعْتَقَهُ ثُمَّ أَسْلَمَ الَّذِي أَعْتَقَهُ رَجَعَ إِلَيْهِ الْوَلاَءُ لأَنَّهُ قَدْ كَانَ ثَبَتَ لَهُ الْوَلاَءُ يَوْمَ أَعْتَقَهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانَ لِلْيَهُودِيِّ أَوِ النَّصْرَانِيِّ وَلَدٌ مُسْلِمٌ وَرِثَ مَوَالِيَ أَبِيهِ الْيَهُودِيِّ أَوِ النَّصْرَانِيِّ إِذَا أَسْلَمَ الْمَوْلَى الْمُعْتَقُ قَبْلَ أَنْ يُسْلِمَ الَّذِي أَعْتَقَهُ وَإِنْ كَانَ الْمُعْتَقُ حِينَ أُعْتِقَ مُسْلِمًا لَمْ يَكُنْ لِوَلَدِ النَّصْرَانِيِّ أَوِ الْيَهُودِيِّ الْمُسْلِمَيْنِ مِنْ وَلاَءِ الْعَبْدِ الْمُسْلِمِ شَىْءٌ لأَنَّهُ لَيْسَ لِلْيَهُودِيِّ وَلاَ لِلنَّصْرَانِيِّ وَلاَءٌ فَوَلاَءُ الْعَبْدِ الْمُسْلِمِ لِجَمَاعَةِ الْمُسْلِمِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1488
			}
		}
	]
}