{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ جَاءَتِ الْيَهُودُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرُوا لَهُ أَنَّ رَجُلاً مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ ‏\"‏ ‏.‏ فَقَالُوا نَفْضَحُهُمْ وَيُجْلَدُونَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ ‏.‏ فَأَتَوْا بِالتَّوْرَاةِ فَنَشَرُوهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ ثُمَّ قَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ارْفَعْ يَدَكَ فَرَفَعَ يَدَهُ فَإِذَا فِيهَا آيَةُ الرَّجْمِ فَقَالُوا صَدَقَ يَا مُحَمَّدُ فِيهَا آيَةُ الرَّجْمِ ‏.‏ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَرَأَيْتُ الرَّجُلَ يَحْنِي عَلَى الْمَرْأَةِ يَقِيهَا الْحِجَارَةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1500
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ جَاءَ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالَ لَهُ إِنَّ الأَخِرَ زَنَا ‏.‏ فَقَالَ لَهُ أَبُو بَكْرٍ هَلْ ذَكَرْتَ هَذَا لأَحَدٍ غَيْرِي فَقَالَ لاَ ‏.‏ فَقَالَ أَبُو بَكْرٍ فَتُبْ إِلَى اللَّهِ وَاسْتَتِرْ بِسِتْرِ اللَّهِ فَإِنَّ اللَّهَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ ‏.‏ فَلَمْ تُقْرِرْهُ نَفْسُهُ حَتَّى أَتَى عُمَرَ بْنَ الْخَطَّابِ فَقَالَ لَهُ مِثْلَ مَا قَالَ لأَبِي بَكْرٍ فَقَالَ لَهُ عُمَرُ مِثْلَ مَا قَالَ لَهُ أَبُو بَكْرٍ فَلَمْ تُقْرِرْهُ نَفْسُهُ حَتَّى جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ إِنَّ الأَخِرَ زَنَا فَقَالَ سَعِيدٌ فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ كُلُّ ذَلِكَ يُعْرِضُ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا أَكْثَرَ عَلَيْهِ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَهْلِهِ فَقَالَ ‏\"‏ أَيَشْتَكِي أَمْ بِهِ جِنَّةٌ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَاللَّهِ إِنَّهُ لَصَحِيحٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَبِكْرٌ أَمْ ثَيِّبٌ ‏\"‏ ‏.‏ فَقَالُوا بَلْ ثَيِّبٌ يَا رَسُولَ اللَّهِ ‏.‏ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1501
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ مِنْ أَسْلَمَ يُقَالُ لَهُ هَزَّالٌ ‏ \"‏ يَا هَزَّالُ لَوْ سَتَرْتَهُ بِرِدَائِكَ لَكَانَ خَيْرًا لَكَ ‏\"‏ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ فِي مَجْلِسٍ فِيهِ يَزِيدُ بْنُ نُعَيْمِ بْنِ هَزَّالٍ الأَسْلَمِيِّ فَقَالَ يَزِيدُ هَزَّالٌ جَدِّي وَهَذَا الْحَدِيثُ حَقٌّ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1502
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ أَخْبَرَهُ ‏.‏ أَنَّ رَجُلاً اعْتَرَفَ عَلَى نَفْسِهِ بِالزِّنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَ ‏.‏ قَالَ ابْنُ شِهَابٍ فَمِنْ أَجْلِ ذَلِكَ يُؤْخَذُ الرَّجُلُ بِاعْتِرَافِهِ عَلَى نَفْسِهِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1503
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَعْقُوبَ بْنِ زَيْدِ بْنِ طَلْحَةَ، عَنْ أَبِيهِ، زَيْدِ بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، أَنَّهُ أَخْبَرَهُ أَنَّ امْرَأَةً جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَتْهُ أَنَّهَا زَنَتْ وَهِيَ حَامِلٌ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبِي حَتَّى تَضَعِي ‏\"‏ ‏.‏ فَلَمَّا وَضَعَتْ جَاءَتْهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبِي حَتَّى تُرْضِعِيهِ ‏\"‏ ‏.‏ فَلَمَّا أَرْضَعَتْهُ جَاءَتْهُ فَقَالَ ‏\"‏ اذْهَبِي فَاسْتَوْدِعِيهِ ‏\"‏ ‏.‏ قَالَ فَاسْتَوْدَعَتْهُ ثُمَّ جَاءَتْ فَأَمَرَ بِهَا فَرُجِمَتْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1504
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا يَا رَسُولَ اللَّهِ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَقَالَ الآخَرُ وَهُوَ أَفْقَهُهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَائْذَنْ لِي أَنْ أَتَكَلَّمَ ‏.‏ قَالَ ‏\"‏ تَكَلَّمْ ‏\"‏ ‏.‏ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَا بِامْرَأَتِهِ فَأَخْبَرَنِي أَنَّ عَلَى ابْنِي الرَّجْمَ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَأَخْبَرُونِي أَنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ‏\"‏ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ ‏\"‏ ‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا وَأَمَرَ أُنَيْسًا الأَسْلَمِيَّ أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ فَإِنِ اعْتَرَفَتْ رَجَمَهَا فَاعْتَرَفَتْ فَرَجَمَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1505
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرَأَيْتَ لَوْ أَنِّي وَجَدْتُ مَعَ امْرَأَتِي رَجُلاً أَأُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1506
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ الرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا أُحْصِنَ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الاِعْتِرَافُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1507
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَتَاهُ رَجُلٌ وَهُوَ بِالشَّامِ فَذَكَرَ لَهُ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَبَعَثَ عُمَرُ بْنُ الْخَطَّابِ أَبَا وَاقِدٍ اللَّيْثِيَّ إِلَى امْرَأَتِهِ يَسْأَلُهَا عَنْ ذَلِكَ فَأَتَاهَا وَعِنْدَهَا نِسْوَةٌ حَوْلَهَا فَذَكَرَ لَهَا الَّذِي قَالَ زَوْجُهَا لِعُمَرَ بْنِ الْخَطَّابِ وَأَخْبَرَهَا أَنَّهَا لاَ تُؤْخَذُ بِقَوْلِهِ وَجَعَلَ يُلَقِّنُهَا أَشْبَاهَ ذَلِكَ لِتَنْزِعَ فَأَبَتْ أَنْ تَنْزِعَ وَتَمَّتْ عَلَى الاِعْتِرَافِ فَأَمَرَ بِهَا عُمَرُ فَرُجِمَتْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1508
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَهُ يَقُولُ لَمَّا صَدَرَ عُمَرُ بْنُ الْخَطَّابِ مِنْ مِنًى أَنَاخَ بِالأَبْطَحِ ثُمَّ كَوَّمَ كَوْمَةً بَطْحَاءَ ثُمَّ طَرَحَ عَلَيْهَا رِدَاءَهُ وَاسْتَلْقَى ثُمَّ مَدَّ يَدَيْهِ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ كَبِرَتْ سِنِّي وَضَعُفَتْ قُوَّتِي وَانْتَشَرَتْ رَعِيَّتِي ‏.‏ فَاقْبِضْنِي إِلَيْكَ غَيْرَ مُضَيِّعٍ وَلاَ مُفَرِّطٍ ‏.‏ ثُمَّ قَدِمَ الْمَدِينَةَ فَخَطَبَ النَّاسَ فَقَالَ أَيُّهَا النَّاسُ قَدْ سُنَّتْ لَكُمُ السُّنَنُ وَفُرِضَتْ لَكُمُ الْفَرَائِضُ وَتُرِكْتُمْ عَلَى الْوَاضِحَةِ إِلاَّ أَنْ تَضِلُّوا بِالنَّاسِ يَمِينًا وَشِمَالاً وَضَرَبَ بِإِحْدَى يَدَيْهِ عَلَى الأُخْرَى ثُمَّ قَالَ إِيَّاكُمْ أَنْ تَهْلِكُوا عَنْ آيَةِ الرَّجْمِ أَنْ يَقُولَ قَائِلٌ لاَ نَجِدُ حَدَّيْنِ فِي كِتَابِ اللَّهِ فَقَدْ رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَجَمْنَا وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ أَنْ يَقُولَ النَّاسُ زَادَ عُمَرُ بْنُ الْخَطَّابِ فِي كِتَابِ اللَّهِ تَعَالَى ‏.‏ لَكَتَبْتُهَا الشَّيْخُ وَالشَّيْخَةُ فَارْجُمُوهُمَا الْبَتَّةَ ‏.‏ فَإِنَّا قَدْ قَرَأْنَاهَا ‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَمَا انْسَلَخَ ذُو الْحِجَّةِ حَتَّى قُتِلَ عُمَرُ رَحِمَهُ اللَّهُ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ قَوْلُهُ الشَّيْخُ وَالشَّيْخَةُ يَعْنِي الثَّيِّبَ وَالثَّيِّبَةَ فَارْجُمُوهُمَا الْبَتَّةَ ‏.‏ حَدَّثَنِي مَالِكٌ أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الَّذِي يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَقَالَ ابْنُ شِهَابٍ عَلَيْهِ الرَّجْمُ أَحْصَنَ أَوْ لَمْ يُحْصِنْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1509
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أُتِيَ بِامْرَأَةٍ قَدْ وَلَدَتْ فِي سِتَّةِ أَشْهُرٍ فَأَمَرَ بِهَا أَنْ تُرْجَمَ فَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ لَيْسَ ذَلِكَ عَلَيْهَا إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏وَحَمْلُهُ وَفِصَالُهُ ثَلاَثُونَ شَهْرًا‏}‏ وَقَالَ ‏{‏وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلاَدَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ أَرَادَ أَنْ يُتِمَّ الرَّضَاعَةَ‏}‏ فَالْحَمْلُ يَكُونُ سِتَّةَ أَشْهُرٍ فَلاَ رَجْمَ عَلَيْهَا ‏.‏ فَبَعَثَ عُثْمَانُ بْنُ عَفَّانَ فِي أَثَرِهَا فَوَجَدَهَا قَدْ رُجِمَتْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1510
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، اعْتَرَفَ عَلَى نَفْسِهِ بِالزِّنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَعَا لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَوْطٍ فَأُتِيَ بِسَوْطٍ مَكْسُورٍ فَقَالَ ‏\"‏ فَوْقَ هَذَا ‏\"‏ ‏.‏ فَأُتِيَ بِسَوْطٍ جَدِيدٍ لَمْ تُقْطَعْ ثَمَرَتُهُ فَقَالَ ‏\"‏ دُونَ هَذَا ‏\"‏ ‏.‏ فَأُتِيَ بِسَوْطٍ قَدْ رُكِبَ بِهِ وَلاَنَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجُلِدَ ثُمَّ قَالَ ‏\"‏ أَيُّهَا النَّاسُ قَدْ آنَ لَكُمْ أَنْ تَنْتَهُوا عَنْ حُدُودِ اللَّهِ مَنْ أَصَابَ مِنْ هَذِهِ الْقَاذُورَاتِ شَيْئًا فَلْيَسْتَتِرْ بِسِتْرِ اللَّهِ فَإِنَّهُ مَنْ يُبْدِي لَنَا صَفْحَتَهُ نُقِمْ عَلَيْهِ كِتَابَ اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1511
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ، أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ أُتِيَ بِرَجُلٍ قَدْ وَقَعَ عَلَى جَارِيَةٍ بِكْرٍ فَأَحْبَلَهَا ثُمَّ اعْتَرَفَ عَلَى نَفْسِهِ بِالزِّنَا وَلَمْ يَكُنْ أَحْصَنَ فَأَمَرَ بِهِ أَبُو بَكْرٍ فَجُلِدَ الْحَدَّ ثُمَّ نُفِيَ إِلَى فَدَكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1512
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصِنْ فَقَالَ ‏ \"‏ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ بِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ لاَ أَدْرِي أَبَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1513
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدًا، كَانَ يَقُومُ عَلَى رَقِيقِ الْخُمُسِ وَأَنَّهُ اسْتَكْرَهَ جَارِيَةً مِنْ ذَلِكَ الرَّقِيقِ فَوَقَعَ بِهَا فَجَلَدَهُ عُمَرُ بْنُ الْخَطَّابِ وَنَفَاهُ وَلَمْ يَجْلِدِ الْوَلِيدَةَ لأَنَّهُ اسْتَكْرَهَهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1514
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيَّ قَالَ أَمَرَنِي عُمَرُ بْنُ الْخَطَّابِ فِي فِتْيَةٍ مِنْ قُرَيْشٍ فَجَلَدْنَا وَلاَئِدَ مِنْ وَلاَئِدِ الإِمَارَةِ خَمْسِينَ خَمْسِينَ فِي الزِّنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1515
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ قَالَ جَلَدَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ عَبْدًا فِي فِرْيَةٍ ثَمَانِينَ ‏.‏ قَالَ أَبُو الزِّنَادِ فَسَأَلْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ عَنْ ذَلِكَ فَقَالَ أَدْرَكْتُ عُمَرَ بْنَ الْخَطَّابِ وَعُثْمَانَ بْنَ عَفَّانَ وَالْخُلَفَاءَ هَلُمَّ جَرًّا فَمَا رَأَيْتُ أَحَدًا جَلَدَ عَبْدًا فِي فِرْيَةٍ أَكْثَرَ مِنْ أَرْبَعِينَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1516
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ زُرَيْقِ بْنِ حَكِيمٍ الأَيْلِيِّ، أَنَّ رَجُلاً، يُقَالُ لَهُ مِصْبَاحٌ اسْتَعَانَ ابْنًا لَهُ فَكَأَنَّهُ اسْتَبْطَأَهُ فَلَمَّا جَاءَهُ قَالَ لَهُ يَا زَانٍ ‏.‏ قَالَ زُرَيْقٌ فَاسْتَعْدَانِي عَلَيْهِ فَلَمَّا أَرَدْتُ أَنْ أَجْلِدَهُ قَالَ ابْنُهُ وَاللَّهِ لَئِنْ جَلَدْتَهُ لأَبُوأَنَّ عَلَى نَفْسِي بِالزِّنَا ‏.‏ فَلَمَّا قَالَ ذَلِكَ أَشْكَلَ عَلَىَّ أَمْرُهُ فَكَتَبْتُ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ - وَهُوَ الْوَالِي يَوْمَئِذٍ - أَذْكُرُ لَهُ ذَلِكَ فَكَتَبَ إِلَىَّ عُمَرُ أَنْ أَجِزْ عَفْوَهُ ‏.‏ قَالَ زُرَيْقٌ وَكَتَبْتُ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ أَيْضًا أَرَأَيْتَ رَجُلاً افْتُرِيَ عَلَيْهِ أَوْ عَلَى أَبَوَيْهِ وَقَدْ هَلَكَا أَوْ أَحَدُهُمَا ‏.‏ قَالَ فَكَتَبَ إِلَىَّ عُمَرُ إِنْ عَفَا فَأَجِزْ عَفْوَهُ فِي نَفْسِهِ وَإِنِ افْتُرِيَ عَلَى أَبَوَيْهِ وَقَدْ هَلَكَا أَوْ أَحَدُهُمَا فَخُذْ لَهُ بِكِتَابِ اللَّهِ إِلاَّ أَنْ يُرِيدَ سِتْرًا ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ وَذَلِكَ أَنْ يَكُونَ الرَّجُلُ الْمُفْتَرَى عَلَيْهِ يَخَافُ إِنْ كُشِفَ ذَلِكَ مِنْهُ أَنْ تَقُومَ عَلَيْهِ بَيِّنَةٌ فَإِذَا كَانَ عَلَى مَا وَصَفْتُ فَعَفَا جَازَ عَفْوُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1517
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ فِي رَجُلٍ قَذَفَ قَوْمًا جَمَاعَةً أَنَّهُ لَيْسَ عَلَيْهِ إِلاَّ حَدٌّ وَاحِدٌ ‏.‏ قَالَ مَالِكٌ وَإِنْ تَفَرَّقُوا فَلَيْسَ عَلَيْهِ إِلاَّ حَدٌّ وَاحِدٌ ‏.‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ بْنِ النُّعْمَانِ الأَنْصَارِيِّ ثُمَّ مِنْ بَنِي النَّجَّارِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ رَجُلَيْنِ، اسْتَبَّا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فَقَالَ أَحَدُهُمَا لِلآخَرِ وَاللَّهِ مَا أَبِي بِزَانٍ وَلاَ أُمِّي بِزَانِيَةٍ ‏.‏ فَاسْتَشَارَ فِي ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ قَائِلٌ مَدَحَ أَبَاهُ وَأُمَّهُ وَقَالَ آخَرُونَ قَدْ كَانَ لأَبِيهِ وَأُمِّهِ مَدْحٌ غَيْرُ هَذَا نَرَى أَنْ تَجْلِدَهُ الْحَدَّ ‏.‏ فَجَلَدَهُ عُمَرُ الْحَدَّ ثَمَانِينَ ‏.‏ قَالَ مَالِكٌ لاَ حَدَّ عِنْدَنَا إِلاَّ فِي نَفْىٍ أَوْ قَذْفٍ أَوْ تَعْرِيضٍ يُرَى أَنَّ قَائِلَهُ إِنَّمَا أَرَادَ بِذَلِكَ نَفْيًا أَوْ قَذْفًا فَعَلَى مَنْ قَالَ ذَلِكَ الْحَدُّ تَامًّا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ إِذَا نَفَى رَجُلٌ رَجُلاً مِنْ أَبِيهِ فَإِنَّ عَلَيْهِ الْحَدَّ وَإِنْ كَانَتْ أُمُّ الَّذِي نُفِيَ مَمْلُوكَةً فَإِنَّ عَلَيْهِ الْحَدَّ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1518
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لِرَجُلٍ خَرَجَ بِجَارِيَةٍ لاِمْرَأَتِهِ مَعَهُ فِي سَفَرٍ فَأَصَابَهَا فَغَارَتِ امْرَأَتُهُ ‏.‏ فَذَكَرَتْ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ وَهَبَتْهَا لِي ‏.‏ فَقَالَ عُمَرُ لَتَأْتِينِي بِالْبَيِّنَةِ أَوْ لأَرْمِيَنَّكَ بِالْحِجَارَةِ ‏.‏ قَالَ فَاعْتَرَفَتِ امْرَأَتُهُ أَنَّهَا وَهَبَتْهَا لَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1520
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1521
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ قَطْعَ فِي ثَمَرٍ مُعَلَّقٍ وَلاَ فِي حَرِيسَةِ جَبَلٍ ‏\"‏ فَإِذَا آوَاهُ الْمُرَاحُ أَوِ الْجَرِينُ فَالْقَطْعُ فِيمَا يَبْلُغُ ثَمَنَ الْمِجَنِّ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1522
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ سَارِقًا، سَرَقَ فِي زَمَانِ عُثْمَانَ أُتْرُجَّةً فَأَمَرَ بِهَا عُثْمَانُ بْنُ عَفَّانَ أَنْ تُقَوَّمَ فَقُوِّمَتْ بِثَلاَثَةِ دَرَاهِمَ مِنْ صَرْفِ اثْنَىْ عَشَرَ دِرْهَمًا بِدِينَارٍ فَقَطَعَ عُثْمَانُ يَدَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1523
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا طَالَ عَلَىَّ وَمَا نَسِيتُ ‏ \"‏ الْقَطْعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1524
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا قَالَتْ خَرَجَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم إِلَى مَكَّةَ وَمَعَهَا مَوْلاَتَانِ لَهَا وَمَعَهَا غُلاَمٌ لِبَنِي عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ فَبَعَثَتْ مَعَ الْمَوْلاَتَيْنِ بِبُرْدٍ مُرَجَّلٍ قَدْ خِيطَ عَلَيْهِ خِرْقَةٌ خَضْرَاءُ قَالَتْ فَأَخَذَ الْغُلاَمُ الْبُرْدَ فَفَتَقَ عَنْهُ فَاسْتَخْرَجَهُ وَجَعَلَ مَكَانَهُ لِبْدًا أَوْ فَرْوَةً وَخَاطَ عَلَيْهِ فَلَمَّا قَدِمَتِ الْمَوْلاَتَانِ الْمَدِينَةَ دَفَعَتَا ذَلِكَ إِلَى أَهْلِهِ فَلَمَّا فَتَقُوا عَنْهُ وَجَدُوا فِيهِ اللِّبْدَ وَلَمْ يَجِدُوا الْبُرْدَ فَكَلَّمُوا الْمَرْأَتَيْنِ فَكَلَّمَتَا عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَوْ كَتَبَتَا إِلَيْهَا وَاتَّهَمَتَا الْعَبْدَ فَسُئِلَ الْعَبْدُ عَنْ ذَلِكَ فَاعْتَرَفَ فَأَمَرَتْ بِهِ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم فَقُطِعَتْ يَدُهُ وَقَالَتْ عَائِشَةُ الْقَطْعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1525
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدًا، لِعَبْدِ اللَّهِ بْنِ عُمَرَ سَرَقَ وَهُوَ آبِقٌ فَأَرْسَلَ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى سَعِيدِ بْنِ الْعَاصِ - وَهُوَ أَمِيرُ الْمَدِينَةِ - لِيَقْطَعَ يَدَهُ فَأَبَى سَعِيدٌ أَنْ يَقْطَعَ يَدَهُ وَقَالَ لاَ تُقْطَعُ يَدُ الآبِقِ السَّارِقِ إِذَا سَرَقَ ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ فِي أَىِّ كِتَابِ اللَّهِ وَجَدْتَ هَذَا ثُمَّ أَمَرَ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقُطِعَتْ يَدُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1526
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زُرَيْقِ بْنِ حَكِيمٍ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، أَخَذَ عَبْدًا آبِقًا قَدْ سَرَقَ قَالَ فَأَشْكَلَ عَلَىَّ أَمْرُهُ - قَالَ - فَكَتَبْتُ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ أَسْأَلُهُ عَنْ ذَلِكَ وَهُوَ الْوَالِي يَوْمَئِذٍ - قَالَ - فَأَخْبَرْتُهُ أَنَّنِي كُنْتُ أَسْمَعُ أَنَّ الْعَبْدَ الآبِقَ إِذَا سَرَقَ وَهُوَ آبِقٌ لَمْ تُقْطَعْ يَدُهُ - قَالَ - فَكَتَبَ إِلَىَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ نَقِيضَ كِتَابِي يَقُولُ كَتَبْتَ إِلَىَّ أَنَّكَ كُنْتَ تَسْمَعُ أَنَّ الْعَبْدَ الآبِقَ إِذَا سَرَقَ لَمْ تُقْطَعْ يَدُهُ وَأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا جَزَاءً بِمَا كَسَبَا نَكَالاً مِنَ اللَّهِ وَاللَّهُ عَزِيزٌ حَكِيمٌ‏}‏ ‏.‏ فَإِنْ بَلَغَتْ سَرِقَتُهُ رُبُعَ دِينَارٍ فَصَاعِدًا فَاقْطَعْ يَدَهُ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، كَانُوا يَقُولُونَ إِذَا سَرَقَ الْعَبْدُ الآبِقُ مَا يَجِبُ فِيهِ الْقَطْعُ قُطِعَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ الْعَبْدَ الآبِقَ إِذَا سَرَقَ مَا يَجِبُ فِيهِ الْقَطْعُ قُطِعَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1527
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ، قِيلَ لَهُ إِنَّهُ مَنْ لَمْ يُهَاجِرْ هَلَكَ ‏.‏ فَقَدِمَ صَفْوَانُ بْنُ أُمَيَّةَ الْمَدِينَةَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ فَأَخَذَ رِدَاءَهُ فَأَخَذَ صَفْوَانُ السَّارِقَ فَجَاءَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَسَرَقْتَ رِدَاءَ هَذَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُقْطَعَ يَدُهُ فَقَالَ لَهُ صَفْوَانُ إِنِّي لَمْ أُرِدْ هَذَا يَا رَسُولَ اللَّهِ هُوَ عَلَيْهِ صَدَقَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلاَّ قَبْلَ أَنْ تَأْتِيَنِي بِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1529
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِ، لَقِيَ رَجُلاً قَدْ أَخَذَ سَارِقًا وَهُوَ يُرِيدُ أَنْ يَذْهَبَ بِهِ إِلَى السُّلْطَانِ فَشَفَعَ لَهُ الزُّبَيْرُ لِيُرْسِلَهُ فَقَالَ لاَ حَتَّى أَبْلُغَ بِهِ السُّلْطَانَ ‏.‏ فَقَالَ الزُّبَيْرُ إِذَا بَلَغْتَ بِهِ السُّلْطَانَ فَلَعَنَ اللَّهُ الشَّافِعَ وَالْمُشَفِّعَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1530
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، مِنْ أَهْلِ الْيَمَنِ أَقْطَعَ الْيَدِ وَالرِّجْلِ قَدِمَ فَنَزَلَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ فَشَكَا إِلَيْهِ أَنَّ عَامِلَ الْيَمَنِ قَدْ ظَلَمَهُ فَكَانَ يُصَلِّي مِنَ اللَّيْلِ فَيَقُولُ أَبُو بَكْرٍ وَأَبِيكَ مَا لَيْلُكَ بِلَيْلِ سَارِقٍ ‏.‏ ثُمَّ إِنَّهُمْ فَقَدُوا عِقْدًا لأَسْمَاءَ بِنْتِ عُمَيْسٍ امْرَأَةِ أَبِي بَكْرٍ الصِّدِّيقِ فَجَعَلَ الرَّجُلُ يَطُوفُ مَعَهُمْ وَيَقُولُ اللَّهُمَّ عَلَيْكَ بِمَنْ بَيَّتَ أَهْلَ هَذَا الْبَيْتِ الصَّالِحِ ‏.‏ فَوَجَدُوا الْحُلِيَّ عِنْدَ صَائِغٍ زَعَمَ أَنَّ الأَقْطَعَ جَاءَهُ بِهِ فَاعْتَرَفَ بِهِ الأَقْطَعُ أَوْ شُهِدَ عَلَيْهِ بِهِ فَأَمَرَ بِهِ أَبُو بَكْرٍ الصِّدِّيقُ فَقُطِعَتْ يَدُهُ الْيُسْرَى وَقَالَ أَبُو بَكْرٍ وَاللَّهِ لَدُعَاؤُهُ عَلَى نَفْسِهِ أَشَدُّ عِنْدِي عَلَيْهِ مِنْ سَرِقَتِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الَّذِي يَسْرِقُ مِرَارًا ثُمَّ يُسْتَعْدَى عَلَيْهِ إِنَّهُ لَيْسَ عَلَيْهِ إِلاَّ أَنْ تُقْطَعَ يَدُهُ لِجَمِيعِ مَنْ سَرَقَ مِنْهُ إِذَا لَمْ يَكُنْ أُقِيمَ عَلَيْهِ الْحَدُّ فَإِنْ كَانَ قَدْ أُقِيمَ عَلَيْهِ الْحَدُّ قَبْلَ ذَلِكَ ثُمَّ سَرَقَ مَا يَجِبُ فِيهِ الْقَطْعُ قُطِعَ أَيْضًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1531
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ أَبَا الزِّنَادِ، أَخْبَرَهُ أَنَّ عَامِلاً لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ أَخَذَ نَاسًا فِي حِرَابَةٍ وَلَمْ يَقْتُلُوا أَحَدًا فَأَرَادَ أَنْ يَقْطَعَ أَيْدِيَهُمْ أَوْ يَقْتُلَ فَكَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي ذَلِكَ فَكَتَبَ إِلَيْهِ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَوْ أَخَذْتَ بِأَيْسَرِ ذَلِكَ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا فِي الَّذِي يَسْرِقُ أَمْتِعَةَ النَّاسِ الَّتِي تَكُونُ مَوْضُوعَةً بِالأَسْوَاقِ مُحْرَزَةً قَدْ أَحْرَزَهَا أَهْلُهَا فِي أَوْعِيَتِهِمْ وَضَمُّوا بَعْضَهَا إِلَى بَعْضٍ إِنَّهُ مَنْ سَرَقَ مِنْ ذَلِكَ شَيْئًا مِنْ حِرْزِهِ فَبَلَغَ قِيمَتُهُ مَا يَجِبُ فِيهِ الْقَطْعُ فَإِنَّ عَلَيْهِ الْقَطْعَ كَانَ صَاحِبُ الْمَتَاعِ عِنْدَ مَتَاعِهِ أَوْ لَمْ يَكُنْ لَيْلاً ذَلِكَ أَوْ نَهَارًا ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَسْرِقُ مَا يَجِبُ عَلَيْهِ فِيهِ الْقَطْعُ ثُمَّ يُوجَدُ مَعَهُ مَا سَرَقَ فَيُرَدُّ إِلَى صَاحِبِهِ إِنَّهُ تُقْطَعُ يَدُهُ ‏.‏ قَالَ مَالِكٌ فَإِنْ قَالَ قَائِلٌ كَيْفَ تُقْطَعُ يَدُهُ وَقَدْ أُخِذَ الْمَتَاعُ مِنْهُ وَدُفِعَ إِلَى صَاحِبِهِ فَإِنَّمَا هُوَ بِمَنْزِلَةِ الشَّارِبِ يُوجَدُ مِنْهُ رِيحُ الشَّرَابِ الْمُسْكِرِ وَلَيْسَ بِهِ سُكْرٌ فَيُجْلَدُ الْحَدَّ ‏.‏ قَالَ وَإِنَّمَا يُجْلَدُ الْحَدَّ فِي الْمُسْكِرِ إِذَا شَرِبَهُ وَإِنْ لَمْ يُسْكِرْهُ وَذَلِكَ أَنَّهُ إِنَّمَا شَرِبَهُ لِيُسْكِرَهُ فَكَذَلِكَ تُقْطَعُ يَدُ السَّارِقِ فِي السَّرِقَةِ الَّتِي أُخِذَتْ مِنْهُ وَلَوْ لَمْ يَنْتَفِعْ بِهَا وَرَجَعَتْ إِلَى صَاحِبِهَا وَإِنَّمَا سَرَقَهَا حِينَ سَرَقَهَا لِيَذْهَبَ بِهَا ‏.‏ قَالَ مَالِكٌ فِي الْقَوْمِ يَأْتُونَ إِلَى الْبَيْتِ فَيَسْرِقُونَ مِنْهُ جَمِيعًا فَيَخْرُجُونَ بِالْعِدْلِ يَحْمِلُونَهُ جَمِيعًا أَوِ الصُّنْدُوقِ أَوِ الْخَشَبَةِ أَوْ بِالْمِكْتَلِ أَوْ مَا أَشْبَهَ ذَلِكَ مِمَّا يَحْمِلُهُ الْقَوْمُ جَمِيعًا إِنَّهُمْ إِذَا أَخْرَجُوا ذَلِكَ مِنْ حِرْزِهِ وَهُمْ يَحْمِلُونَهُ جَمِيعًا فَبَلَغَ ثَمَنُ مَا خَرَجُوا بِهِ مِنْ ذَلِكَ مَا يَجِبُ فِيهِ الْقَطْعُ - وَذَلِكَ ثَلاَثَةُ دَرَاهِمَ فَصَاعِدًا - فَعَلَيْهِمُ الْقَطْعُ جَمِيعًا ‏.‏ قَالَ وَإِنْ خَرَجَ كُلُّ وَاحِدٍ مِنْهُمْ بِمَتَاعٍ عَلَى حِدَتِهِ فَمَنْ خَرَجَ مِنْهُمْ بِمَا تَبْلُغُ قِيمَتُهُ ثَلاَثَةَ دَرَاهِمَ فَصَاعِدًا فَعَلَيْهِ الْقَطْعُ وَمَنْ لَمْ يَخْرُجْ مِنْهُمْ بِمَا تَبْلُغُ قِيمَتُهُ ثَلاَثَةَ دَرَاهِمَ فَلاَ قَطْعَ عَلَيْهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ إِذَا كَانَتْ دَارُ رَجُلٍ مُغْلَقَةً عَلَيْهِ لَيْسَ مَعَهُ فِيهَا غَيْرُهُ فَإِنَّهُ لاَ يَجِبُ عَلَى مَنْ سَرَقَ مِنْهَا شَيْئًا الْقَطْعُ حَتَّى يَخْرُجَ بِهِ مِنَ الدَّارِ كُلِّهَا وَذَلِكَ أَنَّ الدَّارَ كُلَّهَا هِيَ حِرْزُهُ فَإِنْ كَانَ مَعَهُ فِي الدَّارِ سَاكِنٌ غَيْرُهُ وَكَانَ كُلُّ إِنْسَانٍ مِنْهُمْ يُغْلِقُ عَلَيْهِ بَابَهُ وَكَانَتْ حِرْزًا لَهُمْ جَمِيعًا فَمَنْ سَرَقَ مِنْ بُيُوتِ تِلْكَ الدَّارِ شَيْئًا يَجِبُ فِيهِ الْقَطْعُ فَخَرَجَ بِهِ إِلَى الدَّارِ فَقَدْ أَخْرَجَهُ مِنْ حِرْزِهِ إِلَى غَيْرِ حِرْزِهِ وَوَجَبَ عَلَيْهِ فِيهِ الْقَطْعُ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا فِي الْعَبْدِ يَسْرِقُ مِنْ مَتَاعِ سَيِّدِهِ أَنَّهُ إِنْ كَانَ لَيْسَ مِنْ خَدَمِهِ وَلاَ مِمَّنْ يَأْمَنُ عَلَى بَيْتِهِ ثُمَّ دَخَلَ سِرًّا فَسَرَقَ مِنْ مَتَاعِ سَيِّدِهِ مَا يَجِبُ فِيهِ الْقَطْعُ فَلاَ قَطْعَ عَلَيْهِ وَكَذَلِكَ الأَمَةُ إِذَا سَرَقَتْ مِنْ مَتَاعِ سَيِّدِهَا لاَ قَطْعَ عَلَيْهَا ‏.‏ وَقَالَ فِي الْعَبْدِ لاَ يَكُونُ مِنْ خَدَمِهِ وَلاَ مِمَّنْ يَأْمَنُ عَلَى بَيْتِهِ فَدَخَلَ سِرًّا فَسَرَقَ مِنْ مَتَاعِ امْرَأَةِ سَيِّدِهِ مَا يَجِبُ فِيهِ الْقَطْعُ إِنَّهُ تُقْطَعُ يَدُهُ ‏.‏ قَالَ وَكَذَلِكَ أَمَةُ الْمَرْأَةِ إِذَا كَانَتْ لَيْسَتْ بِخَادِمٍ لَهَا وَلاَ لِزَوْجِهَا وَلاَ مِمَّنْ تَأْمَنُ عَلَى بَيْتِهَا فَدَخَلَتْ سِرًّا فَسَرَقَتْ مِنْ مَتَاعِ سَيِّدَتِهَا مَا يَجِبُ فِيهِ الْقَطْعُ فَلاَ قَطْعَ عَلَيْهَا ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ أَمَةُ الْمَرْأَةِ الَّتِي لاَ تَكُونُ مِنْ خَدَمِهَا وَلاَ مِمَّنْ تَأْمَنُ عَلَى بَيْتِهَا فَدَخَلَتْ سِرًّا فَسَرَقَتْ مِنْ مَتَاعِ زَوْجِ سَيِّدَتِهَا مَا يَجِبُ فِيهِ الْقَطْعُ أَنَّهَا تُقْطَعُ يَدُهَا ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الرَّجُلُ يَسْرِقُ مِنْ مَتَاعِ امْرَأَتِهِ أَوِ الْمَرْأَةُ تَسْرِقُ مِنْ مَتَاعِ زَوْجِهَا مَا يَجِبُ فِيهِ الْقَطْعُ إِنْ كَانَ الَّذِي سَرَقَ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ مَتَاعِ صَاحِبِهِ فِي بَيْتٍ سِوَى الْبَيْتِ الَّذِي يُغْلِقَانِ عَلَيْهِمَا وَكَانَ فِي حِرْزٍ سِوَى الْبَيْتِ الَّذِي هُمَا فِيهِ فَإِنَّ مَنْ سَرَقَ مِنْهُمَا مِنْ مَتَاعِ صَاحِبِهِ مَا يَجِبُ فِيهِ الْقَطْعُ فَعَلَيْهِ الْقَطْعُ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الصَّبِيِّ الصَّغِيرِ وَالأَعْجَمِيِّ الَّذِي لاَ يُفْصِحُ أَنَّهُمَا إِذَا سُرِقَا مِنْ حِرْزِهِمَا أَوْ غَلْقِهِمَا فَعَلَى مَنْ سَرَقَهُمَا الْقَطْعُ وَإِنْ خَرَجَا مِنْ حِرْزِهِمَا وَغَلْقِهِمَا فَلَيْسَ عَلَى مَنْ سَرَقَهُمَا قَطْعٌ ‏.‏ قَالَ وَإِنَّمَا هُمَا بِمَنْزِلَةِ حَرِيسَةِ الْجَبَلِ وَالثَّمَرِ الْمُعَلَّقِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا فِي الَّذِي يَنْبِشُ الْقُبُورَ أَنَّهُ إِذَا بَلَغَ مَا أَخْرَجَ مِنَ الْقَبْرِ مَا يَجِبُ فِيهِ الْقَطْعُ فَعَلَيْهِ فِيهِ الْقَطْعُ ‏.‏ وَقَالَ مَالِكٌ وَذَلِكَ أَنَّ الْقَبْرَ حِرْزٌ لِمَا فِيهِ كَمَا أَنَّ الْبُيُوتَ حِرْزٌ لِمَا فِيهَا ‏.‏ قَالَ وَلاَ يَجِبُ عَلَيْهِ الْقَطْعُ حَتَّى يَخْرُجَ بِهِ مِنَ الْقَبْرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّ عَبْدًا، سَرَقَ وَدِيًّا مِنْ حَائِطِ رَجُلٍ فَغَرَسَهُ فِي حَائِطِ سَيِّدِهِ فَخَرَجَ صَاحِبُ الْوَدِيِّ يَلْتَمِسُ وَدِيَّهُ فَوَجَدَهُ فَاسْتَعْدَى عَلَى الْعَبْدِ مَرْوَانَ بْنَ الْحَكَمِ فَسَجَنَ مَرْوَانُ الْعَبْدَ وَأَرَادَ قَطْعَ يَدِهِ فَانْطَلَقَ سَيِّدُ الْعَبْدِ إِلَى رَافِعِ بْنِ خَدِيجٍ فَسَأَلَهُ عَنْ ذَلِكَ فَأَخْبَرَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ قَطْعَ فِي ثَمَرٍ وَلاَ كَثَرٍ ‏\"‏ ‏.‏ وَالْكَثَرُ الْجُمَّارُ ‏.‏ فَقَالَ الرَّجُلُ فَإِنَّ مَرْوَانَ بْنَ الْحَكَمِ أَخَذَ غُلاَمًا لِي وَهُوَ يُرِيدُ قَطْعَهُ وَأَنَا أُحِبُّ أَنْ تَمْشِيَ مَعِيَ إِلَيْهِ فَتُخْبِرَهُ بِالَّذِي سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَمَشَى مَعَهُ رَافِعٌ إِلَى مَرْوَانَ بْنِ الْحَكَمِ فَقَالَ أَخَذْتَ غُلاَمًا لِهَذَا فَقَالَ نَعَمْ ‏.‏ فَقَالَ فَمَا أَنْتَ صَانِعٌ بِهِ قَالَ أَرَدْتُ قَطْعَ يَدِهِ ‏.‏ فَقَالَ لَهُ رَافِعٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ قَطْعَ فِي ثَمَرٍ وَلاَ كَثَرٍ ‏\"‏ ‏.‏ فَأَمَرَ مَرْوَانُ بِالْعَبْدِ فَأُرْسِلَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1533
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْحَضْرَمِيِّ، جَاءَ بِغُلاَمٍ لَهُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ اقْطَعْ يَدَ غُلاَمِي هَذَا فَإِنَّهُ سَرَقَ ‏.‏ فَقَالَ لَهُ عُمَرُ مَاذَا سَرَقَ فَقَالَ سَرَقَ مِرْآةً لاِمْرَأَتِي ثَمَنُهَا سِتُّونَ دِرْهَمًا ‏.‏ فَقَالَ عُمَرُ أَرْسِلْهُ فَلَيْسَ عَلَيْهِ قَطْعٌ خَادِمُكُمْ سَرَقَ مَتَاعَكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1534
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، أُتِيَ بِإِنْسَانٍ قَدِ اخْتَلَسَ مَتَاعًا فَأَرَادَ قَطْعَ يَدِهِ فَأَرْسَلَ إِلَى زَيْدِ بْنِ ثَابِتٍ يَسْأَلُهُ عَنْ ذَلِكَ فَقَالَ زَيْدُ بْنُ ثَابِتٍ لَيْسَ فِي الْخُلْسَةِ قَطْعٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1535
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ أَخَذَ نَبَطِيًّا قَدْ سَرَقَ خَوَاتِمَ مِنْ حَدِيدٍ فَحَبَسَهُ لِيَقْطَعَ يَدَهُ فَأَرْسَلَتْ إِلَيْهِ عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ مَوْلاَةً لَهَا يُقَالُ لَهَا أُمَيَّةُ قَالَ أَبُو بَكْرٍ فَجَاءَتْنِي وَأَنَا بَيْنَ ظَهْرَانَىِ النَّاسِ فَقَالَتْ تَقُولُ لَكَ خَالَتُكَ عَمْرَةُ يَا ابْنَ أُخْتِي أَخَذْتَ نَبَطِيًّا فِي شَىْءٍ يَسِيرٍ ذُكِرَ لِي فَأَرَدْتَ قَطْعَ يَدِهِ قُلْتُ نَعَمْ ‏.‏ قَالَتْ فَإِنَّ عَمْرَةَ تَقُولُ لَكَ لاَ قَطْعَ إِلاَّ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏.‏ قَالَ أَبُو بَكْرٍ فَأَرْسَلْتُ النَّبَطِيَّ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي اعْتِرَافِ الْعَبِيدِ أَنَّهُ مَنِ اعْتَرَفَ مِنْهُمْ عَلَى نَفْسِهِ بِشَىْءٍ يَقَعُ الْحَدُّ وَالْعُقُوبَةُ فِيهِ فِي جَسَدِهِ ‏.‏ فَإِنَّ اعْتِرَافَهُ جَائِزٌ عَلَيْهِ وَلاَ يُتَّهَمُ أَنْ يُوقِعَ عَلَى نَفْسِهِ هَذَا ‏.‏ قَالَ مَالِكٌ وَأَمَّا مَنِ اعْتَرَفَ مِنْهُمْ بِأَمْرٍ يَكُونُ غُرْمًا عَلَى سَيِّدِهِ فَإِنَّ اعْتِرَافَهُ غَيْرُ جَائِزٍ عَلَى سَيِّدِهِ ‏.‏ قَالَ مَالِكٌ لَيْسَ عَلَى الأَجِيرِ وَلاَ عَلَى الرَّجُلِ يَكُونَانِ مَعَ الْقَوْمِ يَخْدُمَانِهِمْ إِنْ سَرَقَاهُمْ قَطْعٌ لأَنَّ حَالَهُمَا لَيْسَتْ بِحَالِ السَّارِقِ وَإِنَّمَا حَالُهُمَا حَالُ الْخَائِنِ وَلَيْسَ عَلَى الْخَائِنِ قَطْعٌ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَسْتَعِيرُ الْعَارِيَةَ فَيَجْحَدُهَا إِنَّهُ لَيْسَ عَلَيْهِ قَطْعٌ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ رَجُلٍ كَانَ لَهُ عَلَى رَجُلٍ دَيْنٌ فَجَحَدَهُ ذَلِكَ فَلَيْسَ عَلَيْهِ فِيمَا جَحَدَهُ قَطْعٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي السَّارِقِ يُوجَدُ فِي الْبَيْتِ قَدْ جَمَعَ الْمَتَاعَ وَلَمْ يَخْرُجْ بِهِ إِنَّهُ لَيْسَ عَلَيْهِ قَطْعٌ وَإِنَّمَا مَثَلُ ذَلِكَ كَمَثَلِ رَجُلٍ وَضَعَ بَيْنَ يَدَيْهِ خَمْرًا لِيَشْرَبَهَا فَلَمْ يَفْعَلْ فَلَيْسَ عَلَيْهِ حَدٌّ وَمِثْلُ ذَلِكَ رَجُلٌ جَلَسَ مِنِ امْرَأَةٍ مَجْلِسًا وَهُوَ يُرِيدُ أَنْ يُصِيبَهَا حَرَامًا فَلَمْ يَفْعَلْ وَلَمْ يَبْلُغْ ذَلِكَ مِنْهَا فَلَيْسَ عَلَيْهِ أَيْضًا فِي ذَلِكَ حَدٌّ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لَيْسَ فِي الْخُلْسَةِ قَطْعٌ بَلَغَ ثَمَنُهَا مَا يُقْطَعُ فِيهِ أَوْ لَمْ يَبْلُغْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}