{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، أَنَّ فِي الْكِتَابِ الَّذِي، كَتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ أَنَّ فِي النَّفْسِ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةٌ مِنَ الإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ أُصْبُعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1552
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَوَّمَ الدِّيَةَ عَلَى أَهْلِ الْقُرَى فَجَعَلَهَا عَلَى أَهْلِ الذَّهَبِ أَلْفَ دِينَارٍ وَعَلَى أَهْلِ الْوَرِقِ اثْنَىْ عَشَرَ أَلْفَ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فَأَهْلُ الذَّهَبِ أَهْلُ الشَّامِ وَأَهْلُ مِصْرَ وَأَهْلُ الْوَرِقِ أَهْلُ الْعِرَاقِ ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَنَّ الدِّيَةَ تُقْطَعُ فِي ثَلاَثِ سِنِينَ أَوْ أَرْبَعِ سِنِينَ ‏.‏ قَالَ مَالِكٌ وَالثَّلاَثُ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ يُقْبَلُ مِنْ أَهْلِ الْقُرَى فِي الدِّيَةِ الإِبِلُ وَلاَ مِنْ أَهْلِ الْعَمُودِ الذَّهَبُ وَلاَ الْوَرِقُ وَلاَ مِنْ أَهْلِ الذَّهَبِ الْوَرِقُ وَلاَ مِنْ أَهْلِ الْوَرِقِ الذَّهَبُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1553
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّ ابْنَ شِهَابٍ، كَانَ يَقُولُ فِي دِيَةِ الْعَمْدِ إِذَا قُبِلَتْ خَمْسٌ وَعِشْرُونَ بِنْتَ مَخَاضٍ وَخَمْسٌ وَعِشْرُونَ بِنْتَ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسُ وَعِشْرُونَ جَذَعَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1554
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَتَبَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّهُ أُتِيَ بِمَجْنُونٍ قَتَلَ رَجُلاً ‏.‏ فَكَتَبَ إِلَيْهِ مُعَاوِيَةُ أَنِ اعْقِلْهُ وَلاَ تُقِدْ مِنْهُ فَإِنَّهُ لَيْسَ عَلَى مَجْنُونٍ قَوَدٌ ‏.‏ قَالَ مَالِكٌ فِي الْكَبِيرِ وَالصَّغِيرِ إِذَا قَتَلاَ رَجُلاً جَمِيعًا عَمْدًا أَنَّ عَلَى الْكَبِيرِ أَنْ يُقْتَلَ وَعَلَى الصَّغِيرِ نِصْفُ الدِّيَةِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْحُرُّ وَالْعَبْدُ يَقْتُلاَنِ الْعَبْدَ فَيُقْتَلُ الْعَبْدُ وَيَكُونُ عَلَى الْحُرِّ نِصْفُ قِيمَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1555
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، وَسُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَجُلاً، مِنْ بَنِي سَعْدِ بْنِ لَيْثٍ أَجْرَى فَرَسًا فَوَطِئَ عَلَى إِصْبَعِ رَجُلٍ مِنْ جُهَيْنَةَ فَنُزِيَ مِنْهَا فَمَاتَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لِلَّذِي ادُّعِيَ عَلَيْهِمْ أَتَحْلِفُونَ بِاللَّهِ خَمْسِينَ يَمِينًا مَا مَاتَ مِنْهَا فَأَبَوْا وَتَحَرَّجُوا وَقَالَ لِلآخَرِينَ أَتَحْلِفُونَ أَنْتُمْ فَأَبَوْا فَقَضَى عُمَرُ بْنُ الْخَطَّابِ بِشَطْرِ الدِّيَةِ عَلَى السَّعْدِيِّينَ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ الْعَمَلُ عَلَى هَذَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1556
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ ابْنَ شِهَابٍ، وَسُلَيْمَانَ بْنَ يَسَارٍ، وَرَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، كَانُوا يَقُولُونَ دِيَةُ الْخَطَإِ عِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ ابْنَ لَبُونٍ ذَكَرًا وَعِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ قَوَدَ بَيْنَ الصِّبْيَانِ وَإِنَّ عَمْدَهُمْ خَطَأٌ مَا لَمْ تَجِبْ عَلَيْهِمُ الْحُدُودُ وَيَبْلُغُوا الْحُلُمَ وَإِنَّ قَتْلَ الصَّبِيِّ لاَ يَكُونُ إِلاَّ خَطَأً وَذَلِكَ لَوْ أَنَّ صَبِيًّا وَكَبِيرًا قَتَلاَ رَجُلاً حُرًّا خَطَأً كَانَ عَلَى عَاقِلَةِ كُلِّ وَاحِدٍ مِنْهُمَا نِصْفُ الدِّيَةِ ‏.‏ قَالَ مَالِكٌ وَمَنْ قَتَلَ خَطَأً فَإِنَّمَا عَقْلُهُ مَالٌ لاَ قَوَدَ فِيهِ وَإِنَّمَا هُوَ كَغَيْرِهِ مِنْ مَالِهِ يُقْضَى بِهِ دَيْنُهُ وَيُجَوَّزُ فِيهِ وَصِيَّتُهُ فَإِنْ كَانَ لَهُ مَالٌ تَكُونُ الدِّيَةُ قَدْرَ ثُلُثِهِ ثُمَّ عُفِيَ عَنْ دِيَتِهِ فَذَلِكَ جَائِزٌ لَهُ وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُ دِيَتِهِ جَازَ لَهُ مِنْ ذَلِكَ الثُّلُثُ إِذَا عُفِيَ عَنْهُ وَأَوْصَى بِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1557
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ تُعَاقِلُ الْمَرْأَةُ الرَّجُلَ إِلَى ثُلُثِ الدِّيَةِ إِصْبَعُهَا كَإِصْبَعِهِ وَسِنُّهَا كَسِنِّهِ وَمُوضِحَتُهَا كَمُوضِحَتِهِ وَمُنَقِّلَتُهَا كَمُنَقَّلَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1558
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، وَبَلَغَهُ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُمَا كَانَا يَقُولاَنِ مِثْلَ قَوْلِ سَعِيدِ بْنِ الْمُسَيَّبِ فِي الْمَرْأَةِ أَنَّهَا تُعَاقِلُ الرَّجُلَ إِلَى ثُلُثِ دِيَةِ الرَّجُلِ فَإِذَا بَلَغَتْ ثُلُثَ دِيَةِ الرَّجُلِ كَانَتْ إِلَى النِّصْفِ مِنْ دِيَةِ الرَّجُلِ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّهَا تُعَاقِلُهُ فِي الْمُوضِحَةِ وَالْمُنَقَّلَةِ وَمَا دُونَ الْمَأْمُومَةِ وَالْجَائِفَةِ وَأَشْبَاهِهِمَا مِمَّا يَكُونُ فِيهِ ثُلُثُ الدِّيَةِ فَصَاعِدًا فَإِذَا بَلَغَتْ ذَلِكَ كَانَ عَقْلُهَا فِي ذَلِكَ النِّصْفَ مِنْ عَقْلِ الرَّجُلِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1559
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ مَضَتِ السُّنَّةُ أَنَّ الرَّجُلَ، إِذَا أَصَابَ امْرَأَتَهُ بِجُرْحٍ أَنَّ عَلَيْهِ عَقْلَ ذَلِكَ الْجُرْحِ وَلاَ يُقَادُ مِنْهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا ذَلِكَ فِي الْخَطَإِ أَنْ يَضْرِبَ الرَّجُلُ امْرَأَتَهُ فَيُصِيبَهَا مِنْ ضَرْبِهِ مَا لَمْ يَتَعَمَّدْ كَمَا يَضْرِبُهَا بِسَوْطٍ فَيَفْقَأُ عَيْنَهَا وَنَحْوَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الْمَرْأَةِ يَكُونُ لَهَا زَوْجٌ وَوَلَدٌ مِنْ غَيْرِ عَصَبَتِهَا وَلاَ قَوْمِهَا فَلَيْسَ عَلَى زَوْجِهَا إِذَا كَانَ مِنْ قَبِيلَةٍ أُخْرَى مِنْ عَقْلِ جِنَايَتِهَا شَىْءٌ وَلاَ عَلَى وَلَدِهَا إِذَا كَانُوا مِنْ غَيْرِ قَوْمِهَا وَلاَ عَلَى إِخْوَتِهَا مِنْ أُمِّهَا إِذَا كَانُوا مِنْ غَيْرِ عَصَبَتِهَا وَلاَ قَوْمِهَا فَهَؤُلاَءِ أَحَقُّ بِمِيرَاثِهَا وَالْعَصَبَةُ عَلَيْهِمُ الْعَقْلُ مُنْذُ زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْيَوْمِ وَكَذَلِكَ مَوَالِي الْمَرْأَةِ مِيرَاثُهُمْ لِوَلَدِ الْمَرْأَةِ وَإِنْ كَانُوا مِنْ غَيْرِ قَبِيلَتِهَا وَعَقْلُ جِنَايَةِ الْمَوَالِي عَلَى قَبِيلَتِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1560
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَتَيْنِ، مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1561
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْجَنِينَ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ كَيْفَ أَغْرَمُ مَا لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ نَطَقَ وَلاَ اسْتَهَلّ وَمِثْلُ ذَلِكَ بَطَلْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1562
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ كَانَ يَقُولُ الْغُرَّةُ تُقَوَّمُ خَمْسِينَ دِينَارًا أَوْ سِتَّمِائَةِ دِرْهَمٍ وَدِيَةُ الْمَرْأَةِ الْحُرَّةِ الْمُسْلِمَةِ خَمْسُمِائَةِ دِينَارٍ أَوْ سِتَّةُ آلاَفِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فَدِيَةُ جَنِينِ الْحُرَّةِ عُشْرُ دِيَتِهَا وَالْعُشْرُ خَمْسُونَ دِينَارًا أَوْ سِتُّمِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ وَلَمْ أَسْمَعْ أَحَدًا يُخَالِفُ فِي أَنَّ الْجَنِينَ لاَ تَكُونُ فِيهِ الْغُرَّةُ حَتَّى يُزَايِلَ بَطْنَ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1563
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ فِي الشَّفَتَيْنِ الدِّيَةُ كَامِلَةً فَإِذَا قُطِعَتِ السُّفْلَى فَفِيهَا ثُلُثَا الدِّيَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1564
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ الأَعْوَرِ، يَفْقَأُ عَيْنَ الصَّحِيحِ فَقَالَ ابْنُ شِهَابٍ إِنْ أَحَبَّ الصَّحِيحُ أَنْ يَسْتَقِيدَ، مِنْهُ فَلَهُ الْقَوَدُ وَإِنْ أَحَبَّ فَلَهُ الدِّيَةُ أَلْفُ دِينَارٍ أَوِ اثْنَا عَشَرَ أَلْفَ دِرْهَمٍ ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ أَنَّ فِي كُلِّ زَوْجٍ مِنَ الإِنْسَانِ الدِّيَةَ كَامِلَةً وَأَنَّ فِي اللِّسَانِ الدِّيَةَ كَامِلَةً وَأَنَّ فِي الأُذُنَيْنِ إِذَا ذَهَبَ سَمْعُهُمَا الدِّيَةَ كَامِلَةً اصْطُلِمَتَا أَوْ لَمْ تُصْطَلَمَا وَفِي ذَكَرِ الرَّجُلِ الدِّيَةُ كَامِلَةً وَفِي الأُنْثَيَيْنِ الدِّيَةُ كَامِلَةً ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ أَنَّ فِي ثَدْيَىِ الْمَرْأَةِ الدِّيَةَ كَامِلَةً ‏.‏ قَالَ مَالِكٌ وَأَخَفُّ ذَلِكَ عِنْدِي الْحَاجِبَانِ وَثَدْيَا الرَّجُلِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا أُصِيبَ مِنْ أَطْرَافِهِ أَكْثَرُ مِنْ دِيَتِهِ فَذَلِكَ لَهُ إِذَا أُصِيبَتْ يَدَاهُ وَرِجْلاَهُ وَعَيْنَاهُ فَلَهُ ثَلاَثُ دِيَاتٍ ‏.‏ قَالَ مَالِكٌ فِي عَيْنِ الأَعْوَرِ الصَّحِيحَةِ إِذَا فُقِئَتْ خَطَأً إِنَّ فِيهَا الدِّيَةَ كَامِلَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1565
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، كَانَ يَقُولُ فِي الْعَيْنِ الْقَائِمَةِ إِذَا طَفِئَتْ مِائَةُ دِينَارٍ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ شَتَرِ الْعَيْنِ وَحِجَاجِ الْعَيْنِ فَقَالَ لَيْسَ فِي ذَلِكَ إِلاَّ الاِجْتِهَادُ إِلاَّ أَنْ يَنْقُصَ بَصَرُ الْعَيْنِ فَيَكُونُ لَهُ بِقَدْرِ مَا نَقَصَ مِنْ بَصَرِ الْعَيْنِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَيْنِ الْقَائِمَةِ الْعَوْرَاءِ إِذَا طَفِئَتْ وَفِي الْيَدِ الشَّلاَّءِ إِذَا قُطِعَتْ إِنَّهُ لَيْسَ فِي ذَلِكَ إِلاَّ الاِجْتِهَادُ وَلَيْسَ فِي ذَلِكَ عَقْلٌ مُسَمًّى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1566
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سُلَيْمَانَ بْنَ يَسَارٍ، يَذْكُرُ أَنَّ الْمُوضِحَةَ، فِي الْوَجْهِ مِثْلُ الْمُوضِحَةِ فِي الرَّأْسِ إِلاَّ أَنْ تَعِيبَ الْوَجْهَ فَيُزَادُ فِي عَقْلِهَا مَا بَيْنَهَا وَبَيْنَ عَقْلِ نِصْفِ الْمُوضِحَةِ فِي الرَّأْسِ فَيَكُونُ فِيهَا خَمْسَةٌ وَسَبْعُونَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ فِي الْمُنَقَّلَةِ خَمْسَ عَشْرَةَ فَرِيضَةً ‏.‏ قَالَ وَالْمُنَقَّلَةُ الَّتِي يَطِيرُ فِرَاشُهَا مِنَ الْعَظْمِ وَلاَ تَخْرِقُ إِلَى الدِّمَاغِ وَهِيَ تَكُونُ فِي الرَّأْسِ وَفِي الْوَجْهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الْمَأْمُومَةَ وَالْجَائِفَةَ لَيْسَ فِيهِمَا قَوَدٌ ‏.‏ وَقَدْ قَالَ ابْنُ شِهَابٍ لَيْسَ فِي الْمَأْمُومَةِ قَوَدٌ ‏.‏ قَالَ مَالِكٌ وَالْمَأْمُومَةُ مَا خَرَقَ الْعَظْمَ إِلَى الدِّمَاغِ وَلاَ تَكُونُ الْمَأْمُومَةُ إِلاَّ فِي الرَّأْسِ وَمَا يَصِلُ إِلَى الدِّمَاغِ إِذَا خَرَقَ الْعَظْمَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لَيْسَ فِيمَا دُونَ الْمُوضِحَةِ مِنَ الشِّجَاجِ عَقْلٌ حَتَّى تَبْلُغَ الْمُوضِحَةَ وَإِنَّمَا الْعَقْلُ فِي الْمُوضِحَةِ فَمَا فَوْقَهَا وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْتَهَى إِلَى الْمُوضِحَةِ فِي كِتَابِهِ لِعَمْرِو بْنِ حَزْمٍ فَجَعَلَ فِيهَا خَمْسًا مِنَ الإِبِلِ وَلَمْ تَقْضِ الأَئِمَّةُ فِي الْقَدِيمِ وَلاَ فِي الْحَدِيثِ فِيمَا دُونَ الْمُوضِحَةِ بِعَقْلٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1567
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كُلُّ نَافِذَةٍ فِي عُضْوٍ مِنَ الأَعْضَاءِ فَفِيهَا ثُلُثُ عَقْلِ ذَلِكَ الْعُضْوِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1568
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "حَدَّثَنِي مَالِكٌ، كَانَ ابْنُ شِهَابٍ لاَ يَرَى ذَلِكَ وَأَنَا لاَ، أَرَى فِي نَافِذَةٍ فِي عُضْوٍ مِنَ الأَعْضَاءِ فِي الْجَسَدِ أَمْرًا مُجْتَمَعًا عَلَيْهِ وَلَكِنِّي أَرَى فِيهَا الاِجْتِهَادَ يَجْتَهِدُ الإِمَامُ فِي ذَلِكَ وَلَيْسَ فِي ذَلِكَ أَمْرٌ مُجْتَمَعٌ عَلَيْهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمَأْمُومَةَ وَالْمُنَقَّلَةَ وَالْمُوضِحَةَ لاَ تَكُونُ إِلاَّ فِي الْوَجْهِ وَالرَّأْسِ فَمَا كَانَ فِي الْجَسَدِ مِنْ ذَلِكَ فَلَيْسَ فِيهِ إِلاَّ الاِجْتِهَادُ ‏.‏ قَالَ مَالِكٌ فَلاَ أَرَى اللَّحْىَ الأَسْفَلَ وَالأَنْفَ مِنَ الرَّأْسِ فِي جِرَاحِهِمَا لأَنَّهُمَا عَظْمَانِ مُنْفَرِدَانِ وَالرَّأْسُ بَعْدَهُمَا عَظْمٌ وَاحِدٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1569
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، أَقَادَ مِنَ الْمُنَقَّلَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1570
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ كَمْ فِي إِصْبَعِ الْمَرْأَةِ فَقَالَ عَشْرٌ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي إِصْبَعَيْنِ قَالَ عِشْرُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي ثَلاَثٍ فَقَالَ ثَلاَثُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي أَرْبَعٍ قَالَ عِشْرُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ حِينَ عَظُمَ جُرْحُهَا وَاشْتَدَّتْ مُصِيبَتُهَا نَقَصَ عَقْلُهَا فَقَالَ سَعِيدٌ أَعِرَاقِيٌّ أَنْتَ فَقُلْتُ بَلْ عَالِمٌ مُتَثَبِّتٌ أَوْ جَاهِلٌ مُتَعَلِّمٌ ‏.‏ فَقَالَ سَعِيدٌ هِيَ السُّنَّةُ يَا ابْنَ أَخِي ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي أَصَابِعِ الْكَفِّ إِذَا قُطِعَتْ فَقَدْ تَمَّ عَقْلُهَا وَذَلِكَ أَنَّ خَمْسَ الأَصَابِعِ إِذَا قُطِعَتْ كَانَ عَقْلُهَا عَقْلَ الْكَفِّ خَمْسِينَ مِنَ الإِبِلِ فِي كُلِّ إِصْبَعٍ عَشَرَةٌ مِنَ الإِبِلِ ‏.‏ قَالَ مَالِكٌ وَحِسَابُ الأَصَابِعِ ثَلاَثَةٌ وَثَلاَثُونَ دِينَارٍ وَثُلُثُ دِينَارٍ فِي كُلِّ أَنْمُلَةٍ وَهِيَ مِنَ الإِبِلِ ثَلاَثُ فَرَائِضَ وَثُلُثُ فَرِيضَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1571
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ مُسْلِمِ بْنِ جُنْدُبٍ، عَنْ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَضَى فِي الضِّرْسِ بِجَمَلٍ وَفِي التَّرْقُوَةِ بِجَمَلٍ وَفِي الضِّلَعِ بِجَمَلٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1572
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَضَى عُمَرُ بْنُ الْخَطَّابِ فِي الأَضْرَاسِ بِبَعِيرٍ بَعِيرٍ وَقَضَى مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ فِي الأَضْرَاسِ بِخَمْسَةِ أَبْعِرَةٍ خَمْسَةِ أَبْعِرَةٍ ‏.‏ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَالدِّيَةُ تَنْقُصُ فِي قَضَاءِ عُمَرَ بْنِ الْخَطَّابِ وَتَزِيدُ فِي قَضَاءِ مُعَاوِيَةَ فَلَوْ كُنْتُ أَنَا لَجَعَلْتُ فِي الأَضْرَاسِ بَعِيرَيْنِ بَعِيرَيْنِ فَتِلْكَ الدِّيَةُ سَوَاءٌ وَكُلُّ مُجْتَهِدٍ مَأْجُورٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1573
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ إِذَا أُصِيبَتِ السِّنُّ فَاسْوَدَّتْ فَفِيهَا عَقْلُهَا تَامًّا فَإِنْ طُرِحَتْ بَعْدَ أَنْ تَسْوَدَّ فَفِيهَا عَقْلُهَا أَيْضًا تَامًّا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1574
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي غَطَفَانَ بْنِ طَرِيفٍ الْمُرِّيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ بَعَثَهُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ يَسْأَلُهُ مَاذَا فِي الضِّرْسِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فِيهِ خَمْسٌ مِنَ الإِبِلِ ‏.‏ قَالَ فَرَدَّنِي مَرْوَانُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ أَتَجْعَلُ مُقَدَّمَ الْفَمِ مِثْلَ الأَضْرَاسِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ لَوْ لَمْ تَعْتَبِرْ ذَلِكَ إِلاَّ بِالأَصَابِعِ عَقْلُهَا سَوَاءٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1575
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُسَوِّي بَيْنَ الأَسْنَانِ فِي الْعَقْلِ وَلاَ يُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مُقَدَّمَ الْفَمِ وَالأَضْرَاسِ وَالأَنْيَابِ عَقْلُهَا سَوَاءٌ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي السِّنِّ خَمْسٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏ وَالضِّرْسُ سِنٌّ مِنَ الأَسْنَانِ لاَ يَفْضُلُ بَعْضُهَا عَلَى بَعْضٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1576
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانَا يَقُولاَنِ فِي مُوضِحَةِ الْعَبْدِ نِصْفُ عُشْرِ ثَمَنِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1577
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَانَ يَقْضِي فِي الْعَبْدِ يُصَابُ بِالْجِرَاحِ أَنَّ عَلَى مَنْ جَرَحَهُ قَدْرَ مَا نَقَصَ مِنْ ثَمَنِ الْعَبْدِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ فِي مُوضِحَةِ الْعَبْدِ نِصْفَ عُشْرِ ثَمَنِهِ وَفِي مُنَقَّلَتِهِ الْعُشْرُ وَنِصْفُ الْعُشْرِ مِنْ ثَمَنِهِ وَفِي مَأْمُومَتِهِ وَجَائِفَتِهِ فِي كُلِّ وَاحِدَةٍ مِنْهُمَا ثُلُثُ ثَمَنِهِ وَفِيمَا سِوَى هَذِهِ الْخِصَالِ الأَرْبَعِ مِمَّا يُصَابُ بِهِ الْعَبْدُ مَا نَقَصَ مِنْ ثَمَنِهِ يُنْظَرُ فِي ذَلِكَ بَعْدَ مَا يَصِحُّ الْعَبْدُ وَيَبْرَأُ كَمْ بَيْنَ قِيمَةِ الْعَبْدِ بَعْدَ أَنْ أَصَابَهُ الْجُرْحُ وَقِيمَتِهِ صَحِيحًا قَبْلَ أَنْ يُصِيبَهُ هَذَا ثُمَّ يَغْرَمُ الَّذِي أَصَابَهُ مَا بَيْنَ الْقِيمَتَيْنِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ إِذَا كُسِرَتْ يَدُهُ أَوْ رِجْلُهُ ثُمَّ صَحَّ كَسْرُهُ فَلَيْسَ عَلَى مَنْ أَصَابَهُ شَىْءٌ فَإِنْ أَصَابَ كَسْرَهُ ذَلِكَ نَقْصٌ أَوْ عَثَلٌ كَانَ عَلَى مَنْ أَصَابَهُ قَدْرُ مَا نَقَصَ مِنْ ثَمَنِ الْعَبْدِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْقِصَاصِ بَيْنَ الْمَمَالِيكِ كَهَيْئَةِ قِصَاصِ الأَحْرَارِ نَفْسُ الأَمَةِ بِنَفْسِ الْعَبْدِ وَجُرْحُهَا بِجُرْحِهِ فَإِذَا قَتَلَ الْعَبْدُ عَبْدًا عَمْدًا خُيِّرَ سَيِّدُ الْعَبْدِ الْمَقْتُولِ فَإِنْ شَاءَ قَتَلَ وَإِنْ شَاءَ أَخَذَ الْعَقْلَ فَإِنْ أَخَذَ الْعَقْلَ أَخَذَ قِيمَةَ عَبْدِهِ وَإِنْ شَاءَ رَبُّ الْعَبْدِ الْقَاتِلِ أَنْ يُعْطِيَ ثَمَنَ الْعَبْدِ الْمَقْتُولِ فَعَلَ وَإِنْ شَاءَ أَسْلَمَ عَبْدَهُ فَإِذَا أَسْلَمَهُ فَلَيْسَ عَلَيْهِ غَيْرُ ذَلِكَ وَلَيْسَ لِرَبِّ الْعَبْدِ الْمَقْتُولِ إِذَا أَخَذَ الْعَبْدَ الْقَاتِلَ وَرَضِيَ بِهِ أَنْ يَقْتُلَهُ وَذَلِكَ فِي الْقِصَاصِ كُلِّهِ بَيْنَ الْعَبِيدِ فِي قَطْعِ الْيَدِ وَالرِّجْلِ وَأَشْبَاهِ ذَلِكَ بِمَنْزِلَتِهِ فِي الْقَتْلِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ الْمُسْلِمِ يَجْرَحُ الْيَهُودِيَّ أَوِ النَّصْرَانِيَّ إِنَّ سَيِّدَ الْعَبْدِ إِنْ شَاءَ أَنْ يَعْقِلَ عَنْهُ مَا قَدْ أَصَابَ فَعَلَ أَوْ أَسْلَمَهُ فَيُبَاعُ فَيُعْطِي الْيَهُودِيَّ أَوِ النَّصْرَانِيَّ مِنْ ثَمَنِ الْعَبْدِ دِيَةَ جُرْحِهِ أَوْ ثَمَنَهُ كُلَّهُ إِنْ أَحَاطَ بِثَمَنِهِ وَلاَ يُعْطِي الْيَهُودِيَّ وَلاَ النَّصْرَانِيَّ عَبْدًا مُسْلِمًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1578
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى أَنَّ دِيَةَ الْيَهُودِيِّ، أَوِ النَّصْرَانِيِّ - إِذَا قُتِلَ أَحَدُهُمَا - مِثْلُ نِصْفِ دِيَةِ الْحُرِّ الْمُسْلِمِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ إِلاَّ أَنْ يَقْتُلَهُ مُسْلِمٌ قَتْلَ غِيْلَةٍ فَيُقْتَلُ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1579
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، كَانَ يَقُولُ دِيَةُ الْمَجُوسِيِّ ثَمَانِي مِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَجِرَاحُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ وَالْمَجُوسِيِّ فِي دِيَاتِهِمْ عَلَى حِسَابِ جِرَاحِ الْمُسْلِمِينَ فِي دِيَاتِهِمُ الْمُوضِحَةُ نِصْفُ عُشْرِ دِيَتِهِ وَالْمَأْمُومَةُ ثُلُثُ دِيَتِهِ وَالْجَائِفَةُ ثُلُثُ دِيَتِهِ فَعَلَى حِسَابِ ذَلِكَ جِرَاحَاتُهُمْ كُلُّهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1580
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ لَيْسَ عَلَى الْعَاقِلَةِ عَقْلٌ فِي قَتْلِ الْعَمْدِ إِنَّمَا عَلَيْهِمْ عَقْلُ قَتْلِ الْخَطَإِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1581
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ مَضَتِ السُّنَّةُ أَنَّ الْعَاقِلَةَ لاَ تَحْمِلُ شَيْئًا مِنْ دِيَةِ الْعَمْدِ إِلاَّ أَنْ يَشَاءُوا ذَلِكَ ‏.‏ وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، مِثْلَ ذَلِكَ ‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1582
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "قَالَ مَالِكٌ إِنَّ ابْنَ شِهَابٍ قَالَ مَضَتِ السُّنَّةُ فِي قَتْلِ الْعَمْدِ حِينَ يَعْفُو أَوْلِيَاءُ الْمَقْتُولِ أَنَّ الدِّيَةَ تَكُونُ عَلَى الْقَاتِلِ فِي مَالِهِ خَاصَّةً إِلاَّ أَنْ تُعِينَهُ الْعَاقِلَةُ عَنْ طِيبِ نَفْسٍ مِنْهَا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ الدِّيَةَ لاَ تَجِبُ عَلَى الْعَاقِلَةِ حَتَّى تَبْلُغَ الثُّلُثَ فَصَاعِدًا فَمَا بَلَغَ الثُّلُثَ فَهُوَ عَلَى الْعَاقِلَةِ وَمَا كَانَ دُونَ الثُّلُثِ فَهُوَ فِي مَالِ الْجَارِحِ خَاصَّةً ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا فِيمَنْ قُبِلَتْ مِنْهُ الدِّيَةُ فِي قَتْلِ الْعَمْدِ أَوْ فِي شَىْءٍ مِنَ الْجِرَاحِ الَّتِي فِيهَا الْقِصَاصُ أَنَّ عَقْلَ ذَلِكَ لاَ يَكُونُ عَلَى الْعَاقِلَةِ إِلاَّ أَنْ يَشَاءُوا وَإِنَّمَا عَقْلُ ذَلِكَ فِي مَالِ الْقَاتِلِ أَوِ الْجَارِحِ خَاصَّةً إِنْ وُجِدَ لَهُ مَالٌ فَإِنْ لَمْ يُوجَدْ لَهُ مَالٌ كَانَ دَيْنًا عَلَيْهِ وَلَيْسَ عَلَى الْعَاقِلَةِ مِنْهُ شَىْءٌ إِلاَّ أَنْ يَشَاءُوا ‏.‏ قَالَ مَالِكٌ وَلاَ تَعْقِلُ الْعَاقِلَةُ أَحَدًا أَصَابَ نَفْسَهُ عَمْدًا أَوْ خَطَأً بِشَىْءٍ وَعَلَى ذَلِكَ رَأْىُ أَهْلِ الْفِقْهِ عِنْدَنَا وَلَمْ أَسْمَعْ أَنَّ أَحَدًا ضَمَّنَ الْعَاقِلَةَ مِنْ دِيَةِ الْعَمْدِ شَيْئًا وَمِمَّا يُعْرَفُ بِهِ ذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ‏}‏ فَتَفْسِيرُ ذَلِكَ - فِيمَا نُرَى وَاللَّهُ أَعْلَمُ - أَنَّهُ مَنْ أُعْطِيَ مِنْ أَخِيهِ شَىْءٌ مِنَ الْعَقْلِ فَلْيَتْبَعْهُ بِالْمَعْرُوفِ وَلْيُؤَدِّ إِلَيْهِ بِإِحْسَانٍ ‏.‏ قَالَ مَالِكٌ فِي الصَّبِيِّ الَّذِي لاَ مَالَ لَهُ وَالْمَرْأَةِ الَّتِي لاَ مَالَ لَهَا إِذَا جَنَى أَحَدُهُمَا جِنَايَةً دُونَ الثُّلُثِ إِنَّهُ ضَامِنٌ عَلَى الصَّبِيِّ وَالْمَرْأَةِ فِي مَالِهِمَا خَاصَّةً إِنْ كَانَ لَهُمَا مَالٌ أُخِذَ مِنْهُ وَإِلاَّ فَجِنَايَةُ كُلِّ وَاحِدٍ مِنْهُمَا دَيْنٌ عَلَيْهِ لَيْسَ عَلَى الْعَاقِلَةِ مِنْهُ شَىْءٌ وَلاَ يُؤْخَذُ أَبُو الصَّبِيِّ بِعَقْلِ جِنَايَةِ الصَّبِيِّ وَلَيْسَ ذَلِكَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّ الْعَبْدَ إِذَا قُتِلَ كَانَتْ فِيهِ الْقِيمَةُ يَوْمَ يُقْتَلُ وَلاَ تَحْمِلُ عَاقِلَةُ قَاتِلِهِ مِنْ قِيمَةِ الْعَبْدِ شَيْئًا قَلَّ أَوْ كَثُرَ وَإِنَّمَا ذَلِكَ عَلَى الَّذِي أَصَابَهُ فِي مَالِهِ خَاصَّةً بَالِغًا مَا بَلَغَ وَإِنْ كَانَتْ قِيمَةُ الْعَبْدِ الدِّيَةَ أَوْ أَكْثَرَ فَذَلِكَ عَلَيْهِ فِي مَالِهِ وَذَلِكَ لأَنَّ الْعَبْدَ سِلْعَةٌ مِنَ السِّلَعِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1584
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، نَشَدَ النَّاسَ بِمِنًى مَنْ كَانَ عِنْدَهُ عِلْمٌ مِنَ الدِّيَةِ أَنْ يُخْبِرَنِي ‏.‏ فَقَامَ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلاَبِيُّ فَقَالَ كَتَبَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أُوَرِّثَ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا ‏.‏ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ ادْخُلِ الْخِبَاءَ حَتَّى آتِيَكَ فَلَمَّا نَزَلَ عُمَرُ بْنُ الْخَطَّابِ أَخْبَرَهُ الضَّحَّاكُ فَقَضَى بِذَلِكَ عُمَرُ بْنُ الْخَطَّابِ ‏.‏ قَالَ ابْنُ شِهَابٍ وَكَانَ قَتْلُ أَشْيَمَ خَطَأً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1585
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ رَجُلاً، مِنْ بَنِي مُدْلِجٍ - يُقَالُ لَهُ قَتَادَةُ - حَذَفَ ابْنَهُ بِالسَّيْفِ فَأَصَابَ سَاقَهُ فَنُزِيَ فِي جُرْحِهِ فَمَاتَ فَقَدِمَ سُرَاقَةُ بْنُ جُعْشُمٍ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ عُمَرُ اعْدُدْ عَلَى مَاءِ قُدَيْدٍ عِشْرِينَ وَمِائَةَ بَعِيرٍ حَتَّى أَقْدَمَ عَلَيْكَ فَلَمَّا قَدِمَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَخَذَ مِنْ تِلْكَ الإِبِلِ ثَلاَثِينَ حِقَّةً وَثَلاَثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً ثُمَّ قَالَ أَيْنَ أَخُو الْمَقْتُولِ قَالَ هَا أَنَا ذَا ‏.‏ قَالَ خُذْهَا فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ لِقَاتِلٍ شَىْءٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1586
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ أَتُغَلَّظُ الدِّيَةُ فِي الشَّهْرِ الْحَرَامِ فَقَالاَ لاَ وَلَكِنْ يُزَادُ فِيهَا لِلْحُرْمَةِ ‏.‏ فَقِيلَ لِسَعِيدٍ هَلْ يُزَادُ فِي الْجِرَاحِ كَمَا يُزَادُ فِي النَّفْسِ فَقَالَ نَعَمْ ‏.‏ قَالَ مَالِكٌ أُرَاهُمَا أَرَادَا مِثْلَ الَّذِي صَنَعَ عُمَرُ بْنُ الْخَطَّابِ فِي عَقْلِ الْمُدْلِجِيِّ حِينَ أَصَابَ ابْنَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1587
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ - يُقَالُ لَهُ أُحَيْحَةُ بْنُ الْجُلاَحِ - كَانَ لَهُ عَمٌّ صَغِيرٌ هُوَ أَصْغَرُ مِنْ أُحَيْحَةَ وَكَانَ عِنْدَ أَخْوَالِهِ فَأَخَذَهُ أُحَيْحَةُ فَقَتَلَهُ فَقَالَ أَخْوَالُهُ كُنَّا أَهْلَ ثُمِّهِ وَرُمِّهِ حَتَّى إِذَا اسْتَوَى عَلَى عُمَمِهِ غَلَبَنَا حَقُّ امْرِئٍ فِي عَمِّهِ ‏.‏ قَالَ عُرْوَةُ فَلِذَلِكَ لاَ يَرِثُ قَاتِلٌ مَنْ قَتَلَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ قَاتِلَ الْعَمْدِ لاَ يَرِثُ مِنْ دِيَةِ مَنْ قَتَلَ شَيْئًا وَلاَ مِنْ مَالِهِ وَلاَ يَحْجُبُ أَحَدًا وَقَعَ لَهُ مِيرَاثٌ وَأَنَّ الَّذِي يَقْتُلُ خَطَأً لاَ يَرِثُ مِنَ الدِّيَةِ شَيْئًا وَقَدِ اخْتُلِفَ فِي أَنْ يَرِثَ مِنْ مَالِهِ لأَنَّهُ لاَ يُتَّهَمُ عَلَى أَنَّهُ قَتَلَهُ لِيَرِثَهُ وَلِيَأْخُذَ مَالَهُ فَأَحَبُّ إِلَىَّ أَنْ يَرِثَ مِنْ مَالِهِ وَلاَ يَرِثُ مِنْ دِيَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1588
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ جَرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1589
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَتَلَ نَفَرًا خَمْسَةً أَوْ سَبْعَةً بِرَجُلٍ وَاحِدٍ قَتَلُوهُ قَتْلَ غِيلَةٍ وَقَالَ عُمَرُ لَوْ تَمَالأَ عَلَيْهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ جَمِيعًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1590
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ، أَنَّهُ بَلَغَهُ أَنَّ حَفْصَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَتَلَتْ جَارِيَةً لَهَا سَحَرَتْهَا وَقَدْ كَانَتْ دَبَّرَتْهَا فَأَمَرَتْ بِهَا فَقُتِلَتْ ‏.‏ قَالَ مَالِكٌ السَّاحِرُ الَّذِي يَعْمَلُ السِّحْرَ وَلَمْ يَعْمَلْ ذَلِكَ لَهُ غَيْرُهُ هُوَ مَثَلُ الَّذِي قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏{‏وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الآخِرَةِ مِنْ خَلاَقٍ‏}‏ فَأَرَى أَنْ يُقْتَلَ ذَلِكَ إِذَا عَمِلَ ذَلِكَ هُوَ نَفْسُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1591
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عُمَرَ بْنِ حُسَيْنٍ، مَوْلَى عَائِشَةَ بِنْتِ قُدَامَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، أَقَادَ وَلِيَّ رَجُلٍ مِنْ رَجُلٍ قَتَلَهُ بِعَصًا فَقَتَلَهُ وَلِيُّهُ بِعَصًا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمُجْتَمَعُ عَلَيْهِ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا ضَرَبَ الرَّجُلَ بِعَصًا أَوْ رَمَاهُ بِحَجَرٍ أَوْ ضَرَبَهُ عَمْدًا فَمَاتَ مِنْ ذَلِكَ فَإِنَّ ذَلِكَ هُوَ الْعَمْدُ وَفِيهِ الْقِصَاصُ ‏.‏ قَالَ مَالِكٌ فَقَتْلُ الْعَمْدِ عِنْدَنَا أَنْ يَعْمِدَ الرَّجُلُ إِلَى الرَّجُلِ فَيَضْرِبَهُ حَتَّى تَفِيظَ نَفْسُهُ وَمِنَ الْعَمْدِ أَيْضًا أَنْ يَضْرِبَ الرَّجُلُ الرَّجُلَ فِي النَّائِرَةِ تَكُونُ بَيْنَهُمَا ثُمَّ يَنْصَرِفُ عَنْهُ وَهُوَ حَىٌّ فَيُنْزَى فِي ضَرْبِهِ فَيَمُوتُ فَتَكُونُ فِي ذَلِكَ الْقَسَامَةُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ يُقْتَلُ فِي الْعَمْدِ الرِّجَالُ الأَحْرَارُ بِالرَّجُلِ الْحُرِّ الْوَاحِدِ وَالنِّسَاءُ بِالْمَرْأَةِ كَذَلِكَ وَالْعَبِيدُ بِالْعَبْدِ كَذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1592
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَتَبَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ يَذْكُرُ أَنَّهُ أُتِيَ بِسَكْرَانَ قَدْ قَتَلَ رَجُلاً فَكَتَبَ إِلَيْهِ مُعَاوِيَةُ أَنِ اقْتُلْهُ بِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِي تَأْوِيلِ هَذِهِ الآيَةِ قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ ‏}‏ فَهَؤُلاَءِ الذُّكُورُ ‏{‏وَالأُنْثَى بِالأُنْثَى‏}‏ أَنَّ الْقِصَاصَ يَكُونُ بَيْنَ الإِنَاثِ كَمَا يَكُونُ بَيْنَ الذُّكُورِ وَالْمَرْأَةُ الْحُرَّةُ تُقْتَلُ بِالْمَرْأَةِ الْحُرَّةِ كَمَا يُقْتَلُ الْحُرُّ بِالْحُرِّ وَالأَمَةُ تُقْتَلُ بِالأَمَةِ كَمَا يُقْتَلُ الْعَبْدُ بِالْعَبْدِ وَالْقِصَاصُ يَكُونُ بَيْنَ النِّسَاءِ كَمَا يَكُونُ بَيْنَ الرِّجَالِ وَالْقِصَاصُ أَيْضًا يَكُونُ بَيْنَ الرِّجَالِ وَالنِّسَاءِ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالأَنْفَ بِالأَنْفِ وَالأُذُنَ بِالأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ ‏}‏ فَذَكَرَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَّ النَّفْسَ بِالنَّفْسِ فَنَفْسُ الْمَرْأَةِ الْحُرَّةِ بِنَفْسِ الرَّجُلِ الْحُرِّ وَجُرْحُهَا بِجُرْحِهِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُمْسِكُ الرَّجُلَ لِلرَّجُلِ فَيَضْرِبُهُ فَيَمُوتُ مَكَانَهُ أَنَّهُ إِنْ أَمْسَكَهُ وَهُوَ يَرَى أَنَّهُ يُرِيدُ قَتْلَهُ قُتِلاَ بِهِ جَمِيعًا وَإِنْ أَمْسَكَهُ وَهُوَ يَرَى أَنَّهُ إِنَّمَا يُرِيدُ الضَّرْبَ مِمَّا يَضْرِبُ بِهِ النَّاسُ لاَ يَرَى أَنَّهُ عَمَدَ لِقَتْلِهِ فَإِنَّهُ يُقْتَلُ الْقَاتِلُ وَيُعَاقَبُ الْمُمْسِكُ أَشَدَّ الْعُقُوبَةِ وَيُسْجَنُ سَنَةً لأَنَّهُ أَمْسَكَهُ وَلاَ يَكُونُ عَلَيْهِ الْقَتْلُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَقْتُلُ الرَّجُلَ عَمْدًا أَوْ يَفْقَأُ عَيْنَهُ عَمْدًا فَيُقْتَلُ الْقَاتِلُ أَوْ تُفْقَأُ عَيْنُ الْفَاقِئِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1593
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَقَادَ مِنْ كَسْرِ الْفَخِذِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1594
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ سَائِبَةً، أَعْتَقَهُ بَعْضُ الْحُجَّاجِ فَقَتَلَ ابْنَ رَجُلٍ مِنْ بَنِي عَائِذٍ فَجَاءَ الْعَائِذِيُّ أَبُو الْمَقْتُولِ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَطْلُبُ دِيَةَ ابْنِهِ فَقَالَ عُمَرُ لاَ دِيَةَ لَهُ ‏.‏ فَقَالَ الْعَائِذِيُّ أَرَأَيْتَ لَوْ قَتَلَهُ ابْنِي فَقَالَ عُمَرُ إِذًا تُخْرِجُونَ دِيَتَهُ فَقَالَ هُوَ إِذًا كَالأَرْقَمِ إِنْ يُتْرَكْ يَلْقَمْ وَإِنْ يُقْتَلْ يَنْقَمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1595
			}
		}
	]
}