{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"47": "Good Character"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ مُعَاذَ بْنَ جَبَلٍ، قَالَ آخِرُ مَا أَوْصَانِي بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ وَضَعْتُ رِجْلِي فِي الْغَرْزِ أَنْ قَالَ ‏ \"‏ أَحْسِنْ خُلُقَكَ لِلنَّاسِ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1633
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَمْرَيْنِ قَطُّ إِلاَّ أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمُ لِلَّهِ بِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1634
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنْ حُسْنِ إِسْلاَمِ الْمَرْءِ تَرْكُهُ مَا لاَ يَعْنِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1635
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتِ اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ عَائِشَةُ وَأَنَا مَعَهُ فِي الْبَيْتِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِئْسَ ابْنُ الْعَشِيرَةِ ‏\"‏ ‏.‏ ثُمَّ أَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ عَائِشَةُ فَلَمْ أَنْشَبْ أَنْ سَمِعْتُ ضَحِكَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَهُ فَلَمَّا خَرَجَ الرَّجُلُ قُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ فِيهِ مَا قُلْتَ ثُمَّ لَمْ تَنْشَبْ أَنْ ضَحِكْتَ مَعَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ شَرِّ النَّاسِ مَنِ اتَّقَاهُ النَّاسُ لِشَرِّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1636
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ كَعْبِ الأَحْبَارِ، أَنَّهُ قَالَ إِذَا أَحْبَبْتُمْ أَنْ تَعْلَمُوا مَا لِلْعَبْدِ عِنْدَ رَبِّهِ فَانْظُرُوا مَاذَا يَتْبَعُهُ مِنْ حُسْنِ الثَّنَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1637
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ الْمَرْءَ، لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الْقَائِمِ بِاللَّيْلِ الظَّامِي بِالْهَوَاجِرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1638
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ أَلاَ أُخْبِرُكُمْ بِخَيْرٍ، مِنْ كَثِيرٍ مِنَ الصَّلاَةِ وَالصَّدَقَةِ قَالُوا بَلَى ‏.‏ قَالَ إِصْلاَحُ ذَاتِ الْبَيْنِ وَإِيَّاكُمْ وَالْبِغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1639
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ قَدْ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بُعِثْتُ لأُتَمِّمَ حُسْنَ الأَخْلاَقِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1640
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَلَمَةَ بْنِ صَفْوَانَ بْنِ سَلَمَةَ الزُّرَقِيِّ، عَنْ زَيْدِ بْنِ طَلْحَةَ بْنِ رُكَانَةَ، يَرْفَعُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ دِينٍ خُلُقٌ وَخُلُقُ الإِسْلاَمِ الْحَيَاءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1641
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى رَجُلٍ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1642
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ رَجُلاً، أَتَى إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي كَلِمَاتٍ أَعِيشُ بِهِنَّ وَلاَ تُكْثِرْ عَلَىَّ فَأَنْسَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَغْضَبْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1643
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1644
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلاَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1645
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَبَاغَضُوا وَلاَ تَحَاسَدُوا وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1646
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلاَ تَجَسَّسُوا وَلاَ تَحَسَّسُوا وَلاَ تَنَافَسُوا وَلاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1647
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَطَاءِ بْنِ أَبِي مُسْلِمٍ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَصَافَحُوا يَذْهَبِ الْغِلُّ وَتَهَادَوْا تَحَابُّوا وَتَذْهَبِ الشَّحْنَاءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1648
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُسْلِمٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ رَجُلاً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1649
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ تُعْرَضُ أَعْمَالُ النَّاسِ كُلَّ جُمُعَةٍ مَرَّتَيْنِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُؤْمِنٍ إِلاَّ عَبْدًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ اتْرُكُوا هَذَيْنِ حَتَّى يَفِيئَا ‏.‏ أَوِ ارْكُوا هَذَيْنِ حَتَّى يَفِيئَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1650
			}
		}
	]
}