{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"48": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي أَنْمَارٍ ‏.‏ قَالَ جَابِرٌ فَبَيْنَا أَنَا نَازِلٌ تَحْتَ شَجَرَةٍ إِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ هَلُمَّ إِلَى الظِّلِّ ‏.‏ قَالَ فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُمْتُ إِلَى غِرَارَةٍ لَنَا فَالْتَمَسْتُ فِيهَا شَيْئًا فَوَجَدْتُ فِيهَا جِرْوَ قِثَّاءٍ فَكَسَرْتُهُ ثُمَّ قَرَّبْتُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ قَالَ فَقُلْتُ خَرَجْنَا بِهِ يَا رَسُولَ اللَّهِ مِنَ الْمَدِينَةِ ‏.‏ قَالَ جَابِرٌ وَعِنْدَنَا صَاحِبٌ لَنَا نُجَهِّزُهُ يَذْهَبُ يَرْعَى ظَهْرَنَا - قَالَ - فَجَهَّزْتُهُ ثُمَّ أَدْبَرَ يَذْهَبُ فِي الظَّهْرِ وَعَلَيْهِ بُرْدَانِ لَهُ قَدْ خَلَقَا - قَالَ - فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِ فَقَالَ ‏\"‏ أَمَا لَهُ ثَوْبَانِ غَيْرُ هَذَيْنِ ‏\"‏ ‏.‏ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ لَهُ ثَوْبَانِ فِي الْعَيْبَةِ كَسَوْتُهُ إِيَّاهُمَا ‏.‏ قَالَ ‏\"‏ فَادْعُهُ فَمُرْهُ فَلْيَلْبَسْهُمَا ‏\"‏ ‏.‏ قَالَ فَدَعَوْتُهُ فَلَبِسَهُمَا ثُمَّ وَلَّى يَذْهَبُ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَهُ ضَرَبَ اللَّهُ عُنُقَهُ أَلَيْسَ هَذَا خَيْرًا لَهُ ‏\"‏ ‏.‏ قَالَ فَسَمِعَهُ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَقُتِلَ الرَّجُلُ فِي سَبِيلِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1651
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِنِّي لأُحِبُّ أَنْ أَنْظُرَ، إِلَى الْقَارِئِ أَبْيَضَ الثِّيَابِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1652
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ، عَنِ ابْنِ سِيرِينَ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ إِذَا أَوْسَعَ اللَّهُ عَلَيْكُمْ فَأَوْسِعُوا عَلَى أَنْفُسِكُمْ جَمَعَ رَجُلٌ عَلَيْهِ ثِيَابَهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1653
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَلْبَسُ الثَّوْبَ الْمَصْبُوغَ بِالْمِشْقِ وَالْمَصْبُوغَ بِالزَّعْفَرَانِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1654
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا، يَقُولُ وَأَنَا أَكْرَهُ، أَنْ يَلْبَسَ الْغِلْمَانُ، شَيْئًا مِنَ الذَّهَبِ لأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ تَخَتُّمِ الذَّهَبِ فَأَنَا أَكْرَهُهُ لِلرِّجَالِ الْكَبِيرِ مِنْهُمْ وَالصَّغِيرِ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ فِي الْمَلاَحِفِ الْمُعَصْفَرَةِ فِي الْبُيُوتِ لِلرِّجَالِ وَفِي الأَفْنِيَةِ قَالَ لاَ أَعْلَمُ مِنْ ذَلِكَ شَيْئًا حَرَامًا وَغَيْرُ ذَلِكَ مِنَ اللِّبَاسِ أَحَبُّ إِلَىَّ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1655
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَسَتْ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ مِطْرَفَ خَزٍّ كَانَتْ عَائِشَةُ تَلْبَسُهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1656
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا قَالَتْ دَخَلَتْ حَفْصَةُ بِنْتُ عَبْدِ الرَّحْمَنِ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَعَلَى حَفْصَةَ خِمَارٌ رَقِيقٌ فَشَقَّتْهُ عَائِشَةُ وَكَسَتْهَا خِمَارًا كَثِيفًا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1657
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مَائِلاَتٌ مُمِيلاَتٌ لاَ يَدْخُلْنَ الْجَنَّةَ وَلاَ يَجِدْنَ رِيحَهَا وَرِيحُهَا يُوجَدُ مِنْ مَسِيرَةِ خَمْسِمِائَةِ سَنَةٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1658
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ مِنَ اللَّيْلِ فَنَظَرَ فِي أُفُقِ السَّمَاءِ فَقَالَ ‏ \"‏ مَاذَا فُتِحَ اللَّيْلَةَ مِنَ الْخَزَائِنِ وَمَاذَا وَقَعَ مِنَ الْفِتَنِ كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٌ يَوْمَ الْقِيَامَةِ أَيْقِظُوا صَوَاحِبَ الْحُجَرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1659
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الَّذِي يَجُرُّ ثَوْبَهُ خُيَلاَءَ لاَ يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1660
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ تَبَارَكَ وَتَعَالَى يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1661
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ بْنِ أَسْلَمَ، كُلُّهُمْ يُخْبِرُهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ ثَوْبَهُ خُيَلاَءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1662
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ عَنِ الإِزَارِ، فَقَالَ أَنَا أُخْبِرُكَ بِعِلْمٍ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لاَ جُنَاحَ عَلَيْهِ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1663
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، نَافِعٍ مَوْلَى ابْنِ عُمَرَ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا أَخْبَرَتْهُ عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ حِينَ ذُكِرَ الإِزَارُ فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ تُرْخِيهِ شِبْرًا ‏\"‏ ‏.‏ قَالَتْ أُمُّ سَلَمَةَ إِذًا يَنْكَشِفُ عَنْهَا ‏.‏ قَالَ ‏\"‏ فَذِرَاعًا لاَ تَزِيدُ عَلَيْهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1664
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمْشِيَنَّ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُنْعَلْهُمَا جَمِيعًا أَوْ لِيُحْفِهِمَا جَمِيعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1665
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1666
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ كَعْبِ الأَحْبَارِ، أَنَّ رَجُلاً، نَزَعَ نَعْلَيْهِ فَقَالَ لِمَ خَلَعْتَ نَعْلَيْكَ لَعَلَّكَ تَأَوَّلْتَ هَذِهِ الآيَةَ ‏{‏فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِي الْمُقَدَّسِ طُوًى‏}‏ قَالَ ثُمَّ قَالَ كَعْبٌ لِلرَّجُلِ أَتَدْرِي مَا كَانَتْ نَعْلاَ مُوسَى قَالَ مَالِكٌ لاَ أَدْرِي مَا أَجَابَهُ الرَّجُلُ فَقَالَ كَعْبٌ كَانَتَا مِنْ جِلْدِ حِمَارٍ مَيِّتٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1667
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ عَنِ الْمُلاَمَسَةِ وَعَنِ الْمُنَابَذَةِ وَعَنْ أَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ وَعَنْ أَنْ يَشْتَمِلَ الرَّجُلُ بِالثَّوْبِ الْوَاحِدِ عَلَى أَحَدِ شِقَّيْهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1668
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ اشْتَرَيْتَ هَذِهِ الْحُلَّةَ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَكَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏ ‏.‏ فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1669
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمَدِينَةِ وَقَدْ رَقَعَ بَيْنَ كَتِفَيْهِ بِرُقَعٍ ثَلاَثٍ لَبَّدَ بَعْضَهَا فَوْقَ بَعْضٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1670
			}
		}
	]
}