{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ اغْتَسَلَ أَبِي سَهْلُ بْنُ حُنَيْفٍ بِالْخَرَّارِ فَنَزَعَ جُبَّةً كَانَتْ عَلَيْهِ وَعَامِرُ بْنُ رَبِيعَةَ يَنْظُرُ قَالَ وَكَانَ سَهْلٌ رَجُلاً أَبْيَضَ حَسَنَ الْجِلْدِ - قَالَ - فَقَالَ لَهُ عَامِرُ بْنُ رَبِيعَةَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ عَذْرَاءَ ‏.‏ قَالَ فَوُعِكَ سَهْلٌ مَكَانَهُ وَاشْتَدَّ وَعْكُهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُخْبِرَ أَنَّ سَهْلاً وُعِكَ وَأَنَّهُ غَيْرُ رَائِحٍ مَعَكَ يَا رَسُولَ اللَّهِ فَأَتَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ سَهْلٌ بِالَّذِي كَانَ مِنْ شَأْنِ عَامِرٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ إِنَّ الْعَيْنَ حَقٌّ تَوَضَّأْ لَهُ ‏\"‏ ‏.‏ فَتَوَضَّأَ لَهُ عَامِرٌ فَرَاحَ سَهْلٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ بِهِ بَأْسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ رَأَى عَامِرُ بْنُ رَبِيعَةَ سَهْلَ بْنَ حُنَيْفٍ يَغْتَسِلُ فَقَالَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ مُخْبَأَةٍ ‏.‏ فَلُبِطَ سَهْلٌ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلِ بْنِ حُنَيْفٍ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ ‏.‏ فَقَالَ ‏\"‏ هَلْ تَتَّهِمُونَ لَهُ أَحَدًا ‏\"‏ قَالُوا نَتَّهِمُ عَامِرَ بْنَ رَبِيعَةَ ‏.‏ قَالَ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَامِرًا فَتَغَيَّظَ عَلَيْهِ وَقَالَ ‏\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ اغْتَسِلْ لَهُ ‏\"‏ ‏.‏ فَغَسَلَ عَامِرٌ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ عَلَيْهِ فَرَاحَ سَهْلٌ مَعَ النَّاسِ لَيْسَ بِهِ بَأْسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّهُ قَالَ دُخِلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِابْنَىْ جَعْفَرِ بْنِ أَبِي طَالِبٍ فَقَالَ لِحَاضِنَتِهِمَا ‏\"‏ مَا لِي أَرَاهُمَا ضَارِعَيْنِ ‏\"‏ ‏.‏ فَقَالَتْ حَاضِنَتُهُمَا يَا رَسُولَ اللَّهِ إِنَّهُ تَسْرَعُ إِلَيْهِمَا الْعَيْنُ وَلَمْ يَمْنَعْنَا أَنْ نَسْتَرْقِيَ لَهُمَا إِلاَّ أَنَّا لاَ نَدْرِي مَا يُوَافِقُكَ مِنْ ذَلِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَرْقُوا لَهُمَا فَإِنَّهُ لَوْ سَبَقَ شَىْءٌ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ بَيْتَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَفِي الْبَيْتِ صَبِيٌّ يَبْكِي فَذَكَرُوا لَهُ أَنَّ بِهِ الْعَيْنَ - قَالَ عُرْوَةُ - فَقَالَ رَسُولُ اللَّهِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا مَرِضَ الْعَبْدُ بَعَثَ اللَّهُ تَعَالَى إِلَيْهِ مَلَكَيْنِ فَقَالَ انْظُرَا مَاذَا يَقُولُ لِعُوَّادِهِ ‏.‏ فَإِنْ هُوَ - إِذَا جَاءُوهُ - حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ رَفَعَا ذَلِكَ إِلَى اللَّهِ عَزَّ وَجَلَّ - وَهُوَ أَعْلَمُ - فَيَقُولُ لِعَبْدِي عَلَىَّ إِنْ تَوَفَّيْتُهُ أَنْ أُدْخِلَهُ الْجَنَّةَ وَإِنْ أَنَا شَفَيْتُهُ أَنْ أُبْدِلَ لَهُ لَحْمًا خَيْرًا مِنْ لَحْمِهِ وَدَمًا خَيْرًا مِنْ دَمِهِ وَأَنْ أُكَفِّرَ عَنْهُ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ قَالَ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُصِيبُ الْمُؤْمِنَ مِنْ مُصِيبَةٍ حَتَّى الشَّوْكَةُ إِلاَّ قُصَّ بِهَا أَوْ كُفِّرَ بِهَا مِنْ خَطَايَاهُ ‏\"‏ ‏.‏ لاَ يَدْرِي يَزِيدُ أَيَّهُمَا قَالَ عُرْوَةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، جَاءَهُ الْمَوْتُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ هَنِيئًا لَهُ مَاتَ وَلَمْ يُبْتَلَ بِمَرَضٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَيْحَكَ وَمَا يُدْرِيكَ لَوْ أَنَّ اللَّهَ ابْتَلاَهُ بِمَرَضٍ يُكَفِّرُ بِهِ مِنْ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ السَّلَمِيَّ، أَخْبَرَهُ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَخْبَرَهُ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ عُثْمَانُ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ امْسَحْهُ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهَا أَهْلِي وَغَيْرَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفِثُ ‏.‏ قَالَتْ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَنَا أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَلَيْهِ بِيَمِينِهِ رَجَاءَ بَرَكَتِهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، دَخَلَ عَلَى عَائِشَةَ وَهِيَ تَشْتَكِي وَيَهُودِيَّةٌ تَرْقِيهَا فَقَالَ أَبُو بَكْرٍ ارْقِيهَا بِكِتَابِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَصَابَهُ جُرْحٌ فَاحْتَقَنَ الْجُرْحُ الدَّمَ وَأَنَّ الرَّجُلَ دَعَا رَجُلَيْنِ مِنْ بَنِي أَنْمَارٍ فَنَظَرَا إِلَيْهِ فَزَعَمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُمَا ‏\"‏ أَيُّكُمَا أَطَبُّ ‏\"‏ ‏.‏ فَقَالاَ أَوَ فِي الطِّبِّ خَيْرٌ يَا رَسُولَ اللَّهِ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنْزَلَ الدَّوَاءَ الَّذِي أَنْزَلَ الأَدْوَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ بَلَغَنِي أَنَّ سَعْدَ بْنَ زُرَارَةَ، اكْتَوَى فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الذُّبَحَةِ فَمَاتَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اكْتَوَى مِنَ اللَّقْوَةِ وَرُقِيَ مِنَ الْعَقْرَبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ، كَانَتْ إِذَا أُتِيَتْ بِالْمَرْأَةِ وَقَدْ حُمَّتْ تَدْعُو لَهَا أَخَذَتِ الْمَاءَ فَصَبَّتْهُ بَيْنَهَا وَبَيْنَ جَيْبِهَا وَقَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُنَا أَنْ نُبْرِدَهَا بِالْمَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا عَادَ الرَّجُلُ الْمَرِيضَ خَاضَ الرَّحْمَةَ حَتَّى إِذَا قَعَدَ عِنْدَهُ قَرَّتْ فِيهِ ‏\"‏ ‏.‏ أَوْ نَحْوَ هَذَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنِ ابْنِ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى وَلاَ هَامَ وَلاَ صَفَرَ وَلاَ يَحُلَّ الْمُمْرِضُ عَلَى الْمُصِحِّ وَلْيَحْلُلِ الْمُصِحُّ حَيْثُ شَاءَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَمَا ذَاكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ أَذًى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}