{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"51": "Hair"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1730
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ قُصَّةً مِنْ شَعَرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ ‏ \"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1731
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَمِعَهُ يَقُولُ سَدَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاصِيَتَهُ مَا شَاءَ اللَّهُ ثُمَّ فَرَقَ بَعْدَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ لَيْسَ عَلَى الرَّجُلِ يَنْظُرُ إِلَى شَعَرِ امْرَأَةِ ابْنِهِ أَوْ شَعَرِ أُمِّ امْرَأَتِهِ بَأْسٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1732
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَكْرَهُ الإِخْصَاءَ وَيَقُولُ فِيهِ تَمَامُ الْخَلْقِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1733
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّهُ بَلَغَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنَا وَكَافِلُ الْيَتِيمِ لَهُ أَوْ لِغَيْرِهِ فِي الْجَنَّةِ كَهَاتَيْنِ إِذَا اتَّقَى ‏\"‏ ‏.‏ وَأَشَارَ بِإِصْبُعَيْهِ الْوُسْطَى وَالَّتِي تَلِي الإِبْهَامَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1734
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا قَتَادَةَ الأَنْصَارِيَّ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ لِي جُمَّةً أَفَأُرَجِّلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ وَأَكْرِمْهَا ‏\"‏ فَكَانَ أَبُو قَتَادَةَ رُبَّمَا دَهَنَهَا فِي الْيَوْمِ مَرَّتَيْنِ لِمَا قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَكْرِمْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1735
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ ثَائِرَ الرَّأْسِ وَاللِّحْيَةِ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ أَنِ اخْرُجْ كَأَنَّهُ يَعْنِي إِصْلاَحَ شَعَرِ رَأْسِهِ وَلِحْيَتِهِ فَفَعَلَ الرَّجُلُ ثُمَّ رَجَعَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلَيْسَ هَذَا خَيْرًا مِنْ أَنْ يَأْتِيَ أَحَدُكُمْ ثَائِرَ الرَّأْسِ كَأَنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1736
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ، قَالَ وَكَانَ جَلِيسًا لَهُمْ وَكَانَ أَبْيَضَ اللِّحْيَةِ وَالرَّأْسِ - قَالَ - فَغَدَا عَلَيْهِمْ ذَاتَ يَوْمٍ وَقَدْ حَمَّرَهُمَا - قَالَ - فَقَالَ لَهُ الْقَوْمُ هَذَا أَحْسَنُ فَقَالَ إِنَّ أُمِّي عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَرْسَلَتْ إِلَىَّ الْبَارِحَةَ جَارِيَتَهَا نُخَيْلَةَ فَأَقْسَمَتْ عَلَىَّ لأَصْبُغَنَّ وَأَخْبَرَتْنِي أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ كَانَ يَصْبُغُ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِي صَبْغِ الشَّعَرِ بِالسَّوَادِ لَمْ أَسْمَعْ فِي ذَلِكَ شَيْئًا مَعْلُومًا وَغَيْرُ ذَلِكَ مِنَ الصِّبْغِ أَحَبُّ إِلَىَّ ‏.‏ قَالَ وَتَرْكُ الصَّبْغِ كُلِّهِ وَاسِعٌ إِنْ شَاءَ اللَّهُ لَيْسَ عَلَى النَّاسِ فِيهِ ضِيقٌ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ فِي هَذَا الْحَدِيثِ بَيَانُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَصْبُغْ وَلَوْ صَبَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَرْسَلَتْ بِذَلِكَ عَائِشَةُ إِلَى عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1737
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ بَلَغَنِي أَنَّ خَالِدَ بْنَ الْوَلِيدِ، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنِّي أُرَوَّعُ فِي مَنَامِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1738
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أُسْرِيَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَى عِفْرِيتًا مِنَ الْجِنِّ يَطْلُبُهُ بِشُعْلَةٍ مِنْ نَارٍ كُلَّمَا الْتَفَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَآهُ فَقَالَ لَهُ جِبْرِيلُ أَفَلاَ أُعَلِّمُكَ كَلِمَاتٍ تَقُولُهُنَّ إِذَا قُلْتَهُنَّ طَفِئَتْ شُعْلَتُهُ وَخَرَّ لِفِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَلَى ‏\"‏ فَقَالَ جِبْرِيلُ فَقُلْ أَعُوذُ بِوَجْهِ اللَّهِ الْكَرِيمِ وَبِكَلِمَاتِ اللَّهِ التَّامَّاتِ اللاَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ مِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ وَشَرِّ مَا يَعْرُجُ فِيهَا وَشَرِّ مَا ذَرَأَ فِي الأَرْضِ وَشَرِّ مَا يَخْرُجُ مِنْهَا وَمِنْ فِتَنِ اللَّيْلِ وَالنَّهَارِ وَمِنْ طَوَارِقِ اللَّيْلِ وَالنَّهَارِ إِلاَّ طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1739
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ قَالَ مَا نِمْتُ هَذِهِ اللَّيْلَةَ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مِنْ أَىِّ شَىْءٍ ‏\"‏ ‏.‏ فَقَالَ لَدَغَتْنِي عَقْرَبٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّكَ لَوْ قُلْتَ حِينَ أَمْسَيْتَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ‏.‏ لَمْ تَضُرَّكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1740
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، أَنَّ كَعْبَ الأَحْبَارِ، قَالَ لَوْلاَ كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا ‏.‏ فَقِيلَ لَهُ وَمَا هُنَّ فَقَالَ أَعُوذُ بِوَجْهِ اللَّهِ الْعَظِيمِ الَّذِي لَيْسَ شَىْءٌ أَعْظَمَ مِنْهُ وَبِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ وَبِأَسْمَاءِ اللَّهِ الْحُسْنَى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ مِنْ شَرِّ مَا خَلَقَ وَبَرَأَ وَذَرَأَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1741
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ لِجَلاَلِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لاَ ظِلَّ إِلاَّ ظِلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1742
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَوْ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَادِلٌ وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1743
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَحَبَّ اللَّهُ الْعَبْدَ قَالَ لِجِبْرِيلَ قَدْ أَحْبَبْتُ فُلاَنًا فَأَحِبَّهُ ‏.‏ فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ قَدْ أَحَبَّ فُلاَنًا فَأَحِبُّوهُ ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الأَرْضِ ‏.‏ وَإِذَا أَبْغَضَ اللَّهُ الْعَبْدَ ‏\"‏ ‏.‏ قَالَ مَالِكٌ لاَ أَحْسِبُهُ إِلاَّ أَنَّهُ قَالَ فِي الْبُغْضِ مِثْلَ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1744
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، أَنَّهُ قَالَ دَخَلْتُ مَسْجِدَ دِمَشْقَ فَإِذَا فَتًى شَابٌّ بَرَّاقُ الثَّنَايَا وَإِذَا النَّاسُ مَعَهُ إِذَا اخْتَلَفُوا فِي شَىْءٍ أَسْنَدُوا إِلَيْهِ وَصَدَرُوا عَنْ قَوْلِهِ فَسَأَلْتُ عَنْهُ فَقِيلَ هَذَا مُعَاذُ بْنُ جَبَلٍ ‏.‏ فَلَمَّا كَانَ الْغَدُ هَجَّرْتُ فَوَجَدْتُهُ قَدْ سَبَقَنِي بِالتَّهْجِيرِ وَوَجَدْتُهُ يُصَلِّي - قَالَ - فَانْتَظَرْتُهُ حَتَّى قَضَى صَلاَتَهُ ثُمَّ جِئْتُهُ مِنْ قِبَلِ وَجْهِهِ فَسَلَّمْتُ عَلَيْهِ ثُمَّ قُلْتُ وَاللَّهِ إِنِّي لأُحِبُّكَ لِلَّهِ ‏.‏ فَقَالَ آللَّهِ فَقُلْتُ آللَّهِ ‏.‏ فَقَالَ آللَّهِ فَقُلْتُ آللَّهِ ‏.‏ فَقَالَ آللَّهِ فَقُلْتُ آللَّهِ ‏.‏ قَالَ فَأَخَذَ بِحُبْوَةِ رِدَائِي فَجَبَذَنِي إِلَيْهِ وَقَالَ أَبْشِرْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى وَجَبَتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَالْمُتَجَالِسِينَ فِيَّ وَالْمُتَزَاوِرِينَ فِيَّ وَالْمُتَبَاذِلِينَ فِيَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1745
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ كَانَ يَقُولُ الْقَصْدُ وَالْتُّؤَدَةُ وَحُسْنُ السَّمْتِ جُزْءٌ مِنْ خَمْسَةٍ وَعِشْرِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1746
			}
		}
	]
}