{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ صَفْوَانَ بْنَ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَسْتَأْذِنُ عَلَى أُمِّي فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ الرَّجُلُ إِنِّي مَعَهَا فِي الْبَيْتِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَأْذِنْ عَلَيْهَا ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي خَادِمُهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَأْذِنْ عَلَيْهَا أَتُحِبُّ أَنْ تَرَاهَا عُرْيَانَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاسْتَأْذِنْ عَلَيْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1763
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1764
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ غَيْرِ، وَاحِدٍ، مِنْ عُلَمَائِهِمْ أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ، جَاءَ يَسْتَأْذِنُ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَاسْتَأْذَنَ ثَلاَثًا ثُمَّ رَجَعَ فَأَرْسَلَ عُمَرُ بْنُ الْخَطَّابِ فِي أَثَرِهِ فَقَالَ مَا لَكَ لَمْ تَدْخُلْ فَقَالَ أَبُو مُوسَى سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ وَمَنْ يَعْلَمُ هَذَا لَئِنْ لَمْ تَأْتِنِي بِمَنْ يَعْلَمُ ذَلِكَ لأَفْعَلَنَّ بِكَ كَذَا وَكَذَا ‏.‏ فَخَرَجَ أَبُو مُوسَى حَتَّى جَاءَ مَجْلِسًا فِي الْمَسْجِدِ يُقَالُ لَهُ مَجْلِسُ الأَنْصَارِ فَقَالَ إِنِّي أَخْبَرْتُ عُمَرَ بْنَ الْخَطَّابِ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏ فَقَالَ لَئِنْ لَمْ تَأْتِنِي بِمَنْ يَعْلَمُ هَذَا لأَفْعَلَنَّ بِكَ كَذَا وَكَذَا ‏.‏ فَإِنْ كَانَ سَمِعَ ذَلِكَ أَحَدٌ مِنْكُمْ فَلْيَقُمْ مَعِي ‏.‏ فَقَالُوا لأَبِي سَعِيدٍ الْخُدْرِيِّ قُمْ مَعَهُ ‏.‏ وَكَانَ أَبُو سَعِيدٍ أَصْغَرَهُمْ فَقَامَ مَعَهُ فَأَخْبَرَ بِذَلِكَ عُمَرَ بْنَ الْخَطَّابِ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لأَبِي مُوسَى أَمَا إِنِّي لَمْ أَتَّهِمْكَ وَلَكِنْ خَشِيتُ أَنْ يَتَقَوَّلَ النَّاسُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1765
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَقُلْ إِنَّكَ مَضْنُوكٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ لاَ أَدْرِي أَبَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1766
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا عَطَسَ فَقِيلَ لَهُ يَرْحَمُكَ اللَّهُ ‏.‏ قَالَ يَرْحَمُنَا اللَّهُ وَإِيَّاكُمْ وَيَغْفِرُ لَنَا وَلَكُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1767
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ رَافِعَ بْنَ إِسْحَاقَ، مَوْلَى الشِّفَاءِ أَخْبَرَهُ قَالَ دَخَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ أَبِي طَلْحَةَ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ نَعُودُهُ فَقَالَ لَنَا أَبُو سَعِيدٍ أَخْبَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ تَصَاوِيرُ ‏\"‏ ‏.‏ شَكَّ إِسْحَاقُ لاَ يَدْرِي أَيَّتَهُمَا قَالَ أَبُو سَعِيدٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1768
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّهُ دَخَلَ عَلَى أَبِي طَلْحَةَ الأَنْصَارِيِّ يَعُودُهُ قَالَ فَوَجَدَ عِنْدَهُ سَهْلَ بْنَ حُنَيْفٍ فَدَعَا أَبُو طَلْحَةَ إِنْسَانًا فَنَزَعَ نَمَطًا مِنْ تَحْتِهِ فَقَالَ لَهُ سَهْلُ بْنُ حُنَيْفٍ لِمَ تَنْزِعُهُ قَالَ لأَنَّ فِيهِ تَصَاوِيرَ وَقَدْ قَالَ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَا قَدْ عَلِمْتَ ‏.‏ فَقَالَ سَهْلٌ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِلاَّ مَا كَانَ رَقْمًا فِي ثَوْبٍ ‏\"‏ ‏.‏ قَالَ بَلَى وَلَكِنَّهُ أَطْيَبُ لِنَفْسِي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1769
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ فَعَرَفَتْ فِي وَجْهِهِ الْكَرَاهِيَةَ وَقَالَتْ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَمَاذَا أَذْنَبْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَمَا بَالُ هَذِهِ النُّمْرُقَةِ ‏\"‏ ‏.‏ قَالَتِ اشْتَرَيْتُهَا لَكَ تَقْعُدُ عَلَيْهَا وَتَوَسَّدُهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1770
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ بِنْتِ الْحَارِثِ فَإِذَا ضِبَابٌ فِيهَا بَيْضٌ وَمَعَهُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَخَالِدُ بْنُ الْوَلِيدِ فَقَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ فَقَالَتْ أَهْدَتْهُ لِي أُخْتِي هُزَيْلَةُ بِنْتُ الْحَارِثِ ‏.‏ فَقَالَ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ وَخَالِدِ بْنِ الْوَلِيدِ ‏\"‏ كُلاَ ‏\"‏ ‏.‏ فَقَالاَ أَوَلاَ تَأْكُلُ أَنْتَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ إِنِّي تَحْضُرُنِي مِنَ اللَّهِ حَاضِرَةٌ ‏\"‏ ‏.‏ قَالَتْ مَيْمُونَةُ أَنَسْقِيكَ يَا رَسُولَ اللَّهِ مِنْ لَبَنٍ عِنْدَنَا فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا شَرِبَ قَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ فَقَالَتْ أَهْدَتْهُ لِي أُخْتِي هُزَيْلَةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتِكِ جَارِيَتَكِ الَّتِي كُنْتِ اسْتَأْمَرْتِينِي فِي عِتْقِهَا أَعْطِيهَا أُخْتَكِ وَصِلِي بِهَا رَحِمَكِ تَرْعَى عَلَيْهَا فَإِنَّهُ خَيْرٌ لَكِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1771
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ بْنِ الْمُغِيرَةِ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ ‏.‏ فَقَالَ بَعْضُ النِّسْوَةِ اللاَّتِي فِي بَيْتِ مَيْمُونَةَ أَخْبِرُوا رَسُولَ اللَّهِ صلى الله عليه وسلم بِمَا يُرِيدُ أَنْ يَأْكُلَ مِنْهُ ‏.‏ فَقِيلَ هُوَ ضَبٌّ يَا رَسُولَ اللَّهِ ‏.‏ فَرَفَعَ يَدَهُ فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ فَقَالَ ‏ \"‏ لاَ وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1772
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، نَادَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا تَرَى فِي الضَّبِّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَسْتُ بِآكِلِهِ وَلاَ بِمُحَرِّمِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1773
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ، وَهُوَ رَجُلٌ مِنْ أَزْدِ شَنُوءَةَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُحَدِّثُ نَاسًا مَعَهُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِي وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1774
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1775
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1776
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَهْلِ الْخَيْلِ وَالإِبِلِ وَالْفَدَّادِينَ أَهْلِ الْوَبَرِ وَالسَّكِينَةُ فِي أَهْلِ الْغَنَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1777
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُوشِكُ أَنْ يَكُونَ خَيْرُ مَالِ الْمُسْلِمِ غَنَمًا يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1778
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحْتَلِبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ فَيُنْتَقَلَ طَعَامُهُ وَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ فَلاَ يَحْتَلِبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1779
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ نَبِيِّ إِلاَّ قَدْ رَعَى غَنَمًا ‏\"‏ ‏.‏ قِيلَ وَأَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَأَنَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1780
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يُقَرَّبُ إِلَيْهِ عَشَاؤُهُ فَيَسْمَعُ قِرَاءَةَ الإِمَامِ وَهُوَ فِي بَيْتِهِ فَلاَ يَعْجَلُ عَنْ طَعَامِهِ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1781
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْفَأْرَةِ تَقَعُ فِي السَّمْنِ فَقَالَ ‏ \"‏ انْزِعُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1782
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ كَانَ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالْمَسْكَنِ ‏\"‏ ‏.‏ يَعْنِي الشُّؤْمَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1783
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1784
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ دَارٌ سَكَنَّاهَا وَالْعَدَدُ كَثِيرٌ وَالْمَالُ وَافِرٌ فَقَلَّ الْعَدَدُ وَذَهَبَ الْمَالُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعُوهَا ذَمِيمَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1785
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ قَالَ لِلَقْحَةٍ تُحْلَبُ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ مُرَّةُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ حَرْبٌ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ يَعِيشُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْلُبْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1786
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لِرَجُلٍ مَا اسْمُكَ فَقَالَ جَمْرَةُ ‏.‏ فَقَالَ ابْنُ مَنْ فَقَالَ ابْنُ شِهَابٍ ‏.‏ قَالَ مِمَّنْ قَالَ مِنَ الْحُرَقَةِ ‏.‏ قَالَ أَيْنَ مَسْكَنُكَ قَالَ بِحَرَّةِ النَّارِ ‏.‏ قَالَ بِأَيِّهَا قَالَ بِذَاتِ لَظًى ‏.‏ قَالَ عُمَرُ أَدْرِكْ أَهْلَكَ فَقَدِ احْتَرَقُوا ‏.‏ قَالَ فَكَانَ كَمَا قَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1787
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1788
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ كَانَ دَوَاءٌ يَبْلُغُ الدَّاءَ فَإِنَّ الْحِجَامَةَ تَبْلُغُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1789
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ مُحَيِّصَةَ الأَنْصَارِيِّ، أَحَدِ بَنِي حَارِثَةَ أَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي إِجَارَةِ الْحَجَّامِ فَنَهَاهُ عَنْهَا فَلَمْ يَزَلْ يَسْأَلُهُ وَيَسْتَأْذِنُهُ حَتَّى قَالَ ‏ \"‏ اعْلِفْهُ نُضَّاحَكَ ‏\"‏ ‏.‏ يَعْنِي رَقِيقَكَ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1790
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُشِيرُ إِلَى الْمَشْرِقِ وَيَقُولُ ‏ \"‏ هَا إِنَّ الْفِتْنَةَ هَا هُنَا إِنَّ الْفِتْنَةَ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1791
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَرَادَ الْخُرُوجَ إِلَى الْعِرَاقِ فَقَالَ لَهُ كَعْبُ الأَحْبَارِ لاَ تَخْرُجْ إِلَيْهَا يَا أَمِيرَ الْمُؤْمِنِينَ فَإِنَّ بِهَا تِسْعَةَ أَعْشَارِ السِّحْرِ وَبِهَا فَسَقَةُ الْجِنِّ وَبِهَا الدَّاءُ الْعُضَالُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1792
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ أَبِي لُبَابَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْحَيَّاتِ الَّتِي فِي الْبُيُوتِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1793
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ سَائِبَةَ، مَوْلاَةٍ لِعَائِشَةَ ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي فِي الْبُيُوتِ إِلاَّ ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا يَخْطِفَانِ الْبَصَرَ وَيَطْرَحَانِ مَا فِي بُطُونِ النِّسَاءِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1794
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ صَيْفِيٍّ، مَوْلَى ابْنِ أَفْلَحَ عَنْ أَبِي السَّائِبِ، مَوْلَى هِشَامِ بْنِ زُهْرَةَ أَنَّهُ قَالَ دَخَلْتُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَوَجَدْتُهُ يُصَلِّي فَجَلَسْتُ أَنْتَظِرُهُ حَتَّى قَضَى صَلاَتَهُ فَسَمِعْتُ تَحْرِيكًا تَحْتَ سَرِيرٍ فِي بَيْتِهِ فَإِذَا حَيَّةٌ فَقُمْتُ لأَقْتُلَهَا فَأَشَارَ أَبُو سَعِيدٍ أَنِ اجْلِسْ فَلَمَّا انْصَرَفَ أَشَارَ إِلَى بَيْتٍ فِي الدَّارِ فَقَالَ أَتَرَى هَذَا الْبَيْتَ فَقُلْتُ نَعَمْ ‏.‏ قَالَ إِنَّهُ قَدْ كَانَ فِيهِ فَتًى حَدِيثُ عَهْدٍ بِعُرْسٍ فَخَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْخَنْدَقِ فَبَيْنَا هُوَ بِهِ إِذْ أَتَاهُ الْفَتَى يَسْتَأْذِنُهُ فَقَالَ يَا رَسُولَ اللَّهِ ائْذَنْ لِي أُحْدِثُ بِأَهْلِي عَهْدًا فَأَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ خُذْ عَلَيْكَ سِلاَحَكَ فَإِنِّي أَخْشَى عَلَيْكَ بَنِي قُرَيْظَةَ ‏\"‏ فَانْطَلَقَ الْفَتَى إِلَى أَهْلِهِ فَوَجَدَ امْرَأَتَهُ قَائِمَةً بَيْنَ الْبَابَيْنِ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ لِيَطْعُنَهَا وَأَدْرَكَتْهُ غَيْرَةٌ فَقَالَتْ لاَ تَعْجَلْ حَتَّى تَدْخُلَ وَتَنْظُرَ مَا فِي بَيْتِكَ ‏.‏ فَدَخَلَ فَإِذَا هُوَ بِحَيَّةٍ مُنْطَوِيَةٍ عَلَى فِرَاشِهِ فَرَكَزَ فِيهَا رُمْحَهُ ثُمَّ خَرَجَ بِهَا فَنَصَبَهُ فِي الدَّارِ فَاضْطَرَبَتِ الْحَيَّةُ فِي رَأْسِ الرُّمْحِ وَخَرَّ الْفَتَى مَيِّتًا فَمَا يُدْرَى أَيُّهُمَا كَانَ أَسْرَعَ مَوْتًا الْفَتَى أَمِ الْحَيَّةُ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ بِالْمَدِينَةِ جِنًّا قَدْ أَسْلَمُوا فَإِذَا رَأَيْتُمْ مِنْهُمْ شَيْئًا فَآذِنُوهُ ثَلاَثَةَ أَيَّامٍ فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1795
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا وَضَعَ رِجْلَهُ فِي الْغَرْزِ وَهُوَ يُرِيدُ السَّفَرَ يَقُولُ ‏ \"‏ بِاسْمِ اللَّهِ ‏.‏ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الأَهْلِ اللَّهُمَّ ازْوِ لَنَا الأَرْضَ وَهَوِّنْ عَلَيْنَا السَّفَرَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَمِنْ كَآبَةِ الْمُنْقَلَبِ وَمِنْ سُوءِ الْمَنْظَرِ فِي الْمَالِ وَالأَهْلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1796
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ نَزَلَ مَنْزِلاً فَلْيَقُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ‏.‏ فَإِنَّهُ لَنْ يَضُرَّهُ شَىْءٌ حَتَّى يَرْتَحِلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1797
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الرَّاكِبُ شَيْطَانٌ وَالرَّاكِبَانِ شَيْطَانَانِ وَالثَّلاَثَةُ رَكْبٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1798
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الشَّيْطَانُ يَهُمُّ بِالْوَاحِدِ وَالاِثْنَيْنِ فَإِذَا كَانُوا ثَلاَثَةً لَمْ يَهُمَّ بِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1799
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخَرِ تُسَافِرُ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ إِلاَّ مَعَ ذِي مَحْرَمٍ مِنْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1800
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى سُلَيْمَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ خَالِدِ بْنِ مَعْدَانَ، يَرْفَعُهُ ‏ \"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى رَفِيقٌ يُحِبُّ الرِّفْقَ وَيَرْضَى بِهِ وَيُعِينُ عَلَيْهِ مَا لاَ يُعِينُ عَلَى الْعُنْفِ فَإِذَا رَكِبْتُمْ هَذِهِ الدَّوَابَّ الْعُجْمَ فَأَنْزِلُوهَا مَنَازِلَهَا فَإِنْ كَانَتِ الأَرْضُ جَدْبَةً فَانْجُوا عَلَيْهَا بِنِقْيِهَا وَعَلَيْكُمْ بِسَيْرِ اللَّيْلِ فَإِنَّ الأَرْضَ تُطْوَى بِاللَّيْلِ مَا لاَ تُطْوَى بِالنَّهَارِ وَإِيَّاكُمْ وَالتَّعْرِيسَ عَلَى الطَّرِيقِ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْحَيَّاتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1801
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1802
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ بِالْمَعْرُوفِ وَلاَ يُكَلَّفُ مِنَ الْعَمَلِ إِلاَّ مَا يُطِيقُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1803
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَذْهَبُ إِلَى الْعَوَالِي كُلَّ يَوْمِ سَبْتٍ فَإِذَا وَجَدَ عَبْدًا فِي عَمَلٍ لاَ يُطِيقُهُ وَضَعَ عَنْهُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1804
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "وَحَدَّثَنِي مَالِكٌ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، وَهُوَ يَخْطُبُ وَهُوَ يَقُولُ لاَ تُكَلِّفُوا الأَمَةَ غَيْرَ ذَاتِ الصَّنْعَةِ الْكَسْبَ فَإِنَّكُمْ مَتَى كَلَّفْتُمُوهَا ذَلِكَ كَسَبَتْ بِفَرْجِهَا وَلاَ تُكَلِّفُوا الصَّغِيرَ الْكَسْبَ فَإِنَّهُ إِذَا لَمْ يَجِدْ سَرَقَ وَعِفُّوا إِذْ أَعَفَّكُمُ اللَّهُ وَعَلَيْكُمْ مِنَ الْمَطَاعِمِ بِمَا طَابَ مِنْهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1805
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعَبْدُ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1806
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أَمَةً، كَانَتْ لِعَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَآهَا عُمَرُ بْنُ الْخَطَّابِ وَقَدْ تَهَيَّأَتْ بِهَيْئَةِ الْحَرَائِرِ فَدَخَلَ عَلَى ابْنَتِهِ حَفْصَةَ فَقَالَ أَلَمْ أَرَ جَارِيَةَ أَخِيكِ تَجُوسُ النَّاسَ وَقَدْ تَهَيَّأَتْ بِهَيْئَةِ الْحَرَائِرِ وَأَنْكَرَ ذَلِكَ عُمَرُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1807
			}
		}
	]
}