{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "அனஸ் பின் மா-க் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெள்ளிக்கிழமை அன்று (சொற்பொழிவு மேடைமீது) நின்று உரையாற்றிக்கொண்டிருந்தபோது, ‘தாருள் களா’ எனும் இல்லத்தின் திசையி-ருந்த வாசல் வழியாக ஒரு மனிதர் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலுக் குள் வந்தார்.9 அவர் நின்றுகொண்டே அல்லாஹ் வின் தூதர் (ஸல்) அவர்களை நோக்கி, “அல்லாஹ்வின் தூதரே! (கால்நடைச்) செல்வங்கள் அழிந்துவிட்டன; சாலை களில் போக்குவரத்து நின்றுவிட்டது. எனவே, அல்லாஹ்விடம் பிரார்த்தியுங்கள். அவன் நமக்கு மழை பொழியச்செய்வான்” என்று கூறினார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் கைகளை உயர்த்தி, “இறைவா! எங்களுக்கு மழை பொழியச்செய்வாயாக! இறைவா! எங்க ளுக்கு மழை பொழியச்செய்வாயாக! இறைவா! எங்களுக்கு மழை பொழியச் செய்வாயாக!” என்று பிரார்த்தித்தார்கள். அல்லாஹ்வின் மீதாணையாக! வானத்தில் மேகக்கூட்டத்தையோ தனி மேகத் தையோ நாங்கள் பார்க்கவில்லை. எங்களுக்கும் ‘சல்உ’ மலைக்கும் இடையே (மழைமேகத்தைப் பார்க்க முடியாதவாறு) எந்த வீடும் கட்டடமும் இருக்கவில்லை. (வெட்டவெளியே இருந்தது) அப்போது அம்மலைக்குப் பின்னா-ருந்து கேடயம் போன்று (வட்ட வடிவில்) ஒரு மேகம் தோன்றியது. அது நடுவானில் மையம் கொண்டு (அடிவானில்) பரவியது. பிறகு மழை பொழிந்தது. அல்லாஹ்வின் மீதாணையாக! ஆறு (ஏழு) நாட்கள் சூரியனையே நாங்கள் பார்க்கவில்லை. (அடுத்த) ஜுமுஆவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நின்று உரையாற்றிக்கொண்டிருந்தபோது அதே வாசல் வழியாக ஒரு மனிதர் (பள்ளிவாசலுக்குள்) வந்து நின்றவாறே நபி (ஸல்) அவர்களை நோக்கி, “அல்லாஹ் வின் தூதரே! (பெருமழையால் கால்நடைச்) செல்வங்கள் அழிந்துவிட்டன; பாதைகள் துண்டிக்கப்பட்டுவிட்டன. எனவே, எங்களைவிட்டு மழையை நிறுத்தும்படி அல்லாஹ்விடம் பிரார்த்தனை புரியுங்கள்!” என்றார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் கைகளை உயர்த்தினார்கள். பிறகு “இறைவா! எங்கள் சுற்றுப்புறங் களுக்கு (இம்மழையைத் திருப்பிவிடு வாயாக!) எங்களுக்குப் பாதகமாக இதை நீ ஆக்கிவிடாதே! இறைவா! குன்றுகள், மேடுகள், ஓடைகள், மேய்ச்சல் நிலங்கள் ஆகியவற்றின்மீது (இம்மழையைப் பொழியச்செய்வாயாக!)” என்று பிரார்த்தித் தார்கள். உடனே மழை (மதீனாவில்) நின்றது. நாங்கள் வெயி-ல் நடந்து சென்றோம். ஷரீக் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் அனஸ் பின் மா-க் (ரலி) அவர்களிடம், “இ(ரண்டாவதாக வ)ந்த மனிதர் முத-ல் வந்த மனிதர்தானா?” என்று கேட்டேன். அதற்கு அவர்கள், “எனக்குத் தெரியவில்லை” என்று பதிலளித்தார்கள். அத்தியாயம் : 15",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		}
	]
}