{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களது காலத்தில் சூரிய கிரகணம் ஏற்பட் டது. அப்போது அவர்கள் (ஜமாஅத்தாக கிரகணத் தொழுகை) தொழுவித்தார்கள். அத்தொழுகையில் ‘அல்பகரா’ (2ஆவது) அத்தியாயம் போன்ற (பெரிய அத்தி யாயத்)தை ஓதும் அளவுக்கு நீண்ட நேரம் நிலையில் நின்றார்கள். பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இந்த நிலை முந்திய நிலையைவிடக் குறைவானதாக இருந்தது. பிறகு நீண்ட நேரம் ருகூ செய்தார்கள் அந்த ருகூஉ முந்திய ருகூஉவைவிடக் குறைவானதாக இருந்தது. பின்னர் சஜ்தா செய்தார்கள். பிறகு (சஜ்தாவி-ருந்து) எழுந்து (இரண்டாவது ரக்அத்தில்) நீண்ட நேரம் நிலையில் நின்றார்கள். இந்த நிலை முந்திய நிலையைவிடக் குறைவானதாக இருந்தது. பிறகு நீண்ட நேரம் ருகூஉ செய்தார்கள். இந்த ருகூஉ முந்திய ருகூஉவைவிடக் குறைவானதாகவே இருந்தது. பிறகு (ருகூஉவி-ருந்து) நிமிர்ந்து வெகு நேரம் நிலையில் நின்றார்கள். இது முந்திய நிலையைவிடக் குறைவானதாகவே இருந்தது. பின்னர் நீண்ட நேரம் ருகூஉ செய்தார்கள். இது முந்திய ருகூஉவைவிடக் குறைவானதாக இருந்தது. பிறகு சஜ்தா செய்தார்கள். (கிரகணம் விலகி) வெளிச்சம் வந்துவிட்டிருந்த நிலையில் தொழுது முடித்தார்கள். அப்போது நபி (ஸல்) அவர்கள் (உரையாற்றுகையில்), “சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்று களாகும். எவரது இறப்புக்காகவும் பிறப்புக் காகவும் கிரகணங்கள் ஏற்படுவதில்லை. எனவே, இ(த்தகைய கிரகணத்)தை நீங்கள் கண்டால் அல்லாஹ்வை நினைவுகூருங் கள்” என்று கூறினார்கள். அப்போது மக்கள், “அல்லாஹ்வின் தூதரே! நீங்கள் (தொழுதுகொண்டிருக்கை யில் இதோ) இந்த இடத்தில் எதையோ பிடிக்க முயன்றதைக் கண்டோம். பிறகு (அந்த முயற்சியி-ருந்து) பின்வாங்கிய தையும் கண்டோமே! (அது ஏன்?)” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “நான் (தொழுதுகொண்டிருக்கையில்) சொர்க்கத்தைக் கண்டேன். (அதி-ருந்து பழக்)குலையொன்றை எடுக்க முயன்றேன். அது கிடைத்திருந்தால் இந்த உலகம் உள்ள வரை நீங்கள் அதை உண்டிருப்பீர்கள். மேலும், (நான் தொழுதுகொண்டிருக் கையில்) நரகம் எனக்குக் காட்டப்பட்டது. இன்றைய தினத்தைப் போன்று மிக பயங்கரமான காட்சி எதையும் ஒருபோதும் நான் கண்டதேயில்லை. நரகவாசிகளில் அதிகமாகப் பெண்களையே கண்டேன்” என்று கூறினார்கள். மக்கள், “ஏன் (அது), அல்லாஹ்வின் தூதரே?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “பெண்களின் நிராகரிப்பே காரணம்” என்றார்கள். அப்போது “அல்லாஹ்வையா பெண்கள் நிராகரிக்கிறார்கள்?” என்று வினவப்பட்டது. அதற்கு “கணவன்மார்களை நிராகரி(த்து நிந்தி)க்கிறார்கள். (கணவர் செய்த) உதவிகளுக்கு நன்றிகாட்ட மறுக்கிறார்கள். காலமெல்லாம் ஒருத்திக்கு நீ உதவி செய்து, பிறகு உன்னிடம் ஏதேனும் (குறை) ஒன்றை அவள் கண்டால், ‘உன்னிடமிருந்து எந்த நன்மையையும் ஒருபோதும் நான் கண்டதேயில்லை’ என்று சொல்-விடுவாள்” எனப் பதிலளித்தார்கள். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		}
	]
}