{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "ஃபாத்திமா பின்த் அல்முன்திர் (ரஹ்) அவர்கள் கூறியதாவது: அஸ்மா பின்த் அபீபக்ர் (ரலி) அவர்கள் கூறினார்கள்: ஒரு சூரிய கிரகணத்தின் போது நான் நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்களி டம் சென்றேன். அப்போது மக்கள் நின்று (கிரகணத் தொழுகை) தொழுதுகொண்டி ருந்தனர். அப்போது (அவர்களுடன்) ஆயிஷா (ரலி) அவர்களும் நின்று தொழுதுகொண்டிருந்தார்கள். நான் (ஆயிஷா (ரலி) அவர்களிடம்), “மக்க ளுக்கு என்னவாயிற்று?” என்று கேட் டேன். அதற்கு ஆயிஷா (ரலி) அவர்கள் தமது கையால் வானை நோக்கி சைகை செய்து, ‘சுப்ஹானல்லாஹ்’ (அல்லாஹ் தூயவன்) என்று கூறினார்கள். நான், “ஏதேனும் அடையாளமா?” என்று கேட்டேன். அதற்கு அவர்கள், ‘ஆம்’ என்பது போன்று சைகை செய்தார் கள். உடனே நானும் (தொழுகையில் நீண்ட நேரம்) நின்றேன். எனக்கு கிறக் கமே வந்துவிட்டது. (கிறக்கம் நீங்க) நான் என் தலையில் தண்ணீரை ஊற்றலானேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுது முடித்ததும் அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டுக் கூறினார்கள்: நான் இதோ இந்த இடத்தில் (தொழுதவாறு) நின்றுகொண்டிருக்கையில் சொர்க்கம் மற்றும் நரகம் உள்பட இதுவரை நான் பார்த்திராத அனைத்தையும் பார்த்தேன். நீங்கள் (உங்கள் அடக்கக் குழிகளில்) மகாக் குழப்பவாதியான தஜ்ஜா-ன் ‘குழப்பத்தைப் போன்ற’ அல்லது ‘அதற்கு நிகரான’ குழப்பத்துக்கு உள்ளாக்கப்படுவீர்கள் என எனக்கு ‘வஹீ’ (இறைச்செய்தி) அறிவிக்கப்பட்டது. - (‘குழப்பத்தைப் போன்ற’ அல்லது ‘அதற்கு நிகரான’ என்பதில் எதை அஸ்மா (ரலி) அவர்கள் அறிவித்தார்கள் என்று எனக்குத் தெரியவில்லை என இதன் அறிவிப்பாளரான ஃபாத்திமா பின்த் அல்முன்திர் ஐயப்படுகிறார்.)- (நீங்கள் அடக்கக் குழிகளில் இருக்கும் போது) உங்களில் ஒருவரிடம் (என்னைக் காட்டி) “இம்மனிதரைப் பற்றி நீ என்ன அறிந்துள்ளாய்?” என்று வினவப்படும். அதற்கு ‘இறைநம்பிக்கையாளரோ’ அல்லது ‘(இறைத்தூதின் மீது) உறுதி கொண்டிருந்தவரோ’ -(இந்த இரண்டில் அஸ்மா (ரலி) அவர்கள் எதைச் சொன் னார்கள் என அறிவிப்பாளர் ஃபாத்திமா பின்த் அல்முன்திர் ஐயம் தெரிவிக்கிறார்.)- “இவர் அல்லாஹ்வின் தூதர் முஹம்மத் (ஸல்) அவர்கள் ஆவார்கள். அன்னார் எங்களிடம் சான்றுகளையும் நல்வழியை யும் கொண்டு வந்தார்கள். நாங்கள் (அவர்களின்) அழைப்பை ஏற்றோம்; (அவர்களை) நம்பினோம்; பின்பற்றினோம்” என்று பதிலளிப்பார். அப்போது அவரிடம், “நலமுடன் உறங்குவீராக! நீர் (உலகில் வாழ்ந்தபோதும் அவரை) நம்பிக்கைகொண்டிருந்தீர் என்பதை நாங்கள் அறிந்திருந்தோம்” என்று கூறப்படும். ‘நயவஞ்சகனோ’ அல்லது ‘(என்னைப் பற்றி) சந்தேகத்துடன் இருந்தவனோ’ -(இவ்விரண்டில் அஸ்மா (ரலி) அவர்கள் எதைச் சொன்னார்கள் என்று எனக்குத் தெரியவில்லை.)- (அந்த வினாவிற்கு) “(அவரை) எனக்குத் தெரியாது; மக்கள் ஒன்றைச் சொல்லக் கேட்டேன். நானும் அதையே சொன்னேன்” என்று பதிலளிப்பான். அத்தியாயம் : 16",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		}
	]
}