{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் தஹஜ்ஜுத் தொழுவதற்காக இரவில் எழுந்ததும் பின்வருமாறு பிரார்த்திப்பார்கள்: அல்லாஹும்ம! ல(க்)கல் ஹம்து. அன்த்த கய்யிமுஸ் ஸமாவாத்தி, வல் அர்ளி, வமன் ஃபீ ஹின்ன. வல(க்)கல் ஹம்து. ல(க்)க முல்க்குஸ் ஸமாவாத்தி, வல்அர்ளி, வமன் ஃபீஹின்ன. வல(க்)கல் ஹம்து. அன்த்த நூருஸ் ஸமாவாத்தி வல்அர்ளி, வ மன் ஃபீஹின்ன. வல(க்)கல் ஹம்து. அன்த்த மலிக்குஸ் ஸமாவாத்தி வல்அர்ள். வல(க்)கல் ஹம்து. அன்த்தல் ஹக்கு. வ வஅது(க்)கல் ஹக்கு. வ லிகாஉக்க ஹக்குன். வ கவ்லு(க்)க ஹக்குன். வல்ஜன்னத்து ஹக்குன். வந்நாரு ஹக்குன். வந்நபிய்யூன ஹக்குன். வ முஹம்மதுன் (ஸல்) ஹக்குன். வஸ்ஸா அத்து ஹக்குன். அல்லாஹும்ம! ல(க்)க அஸ்லம்த்து, வ பி(க்)க ஆமன்த்து, வ அலை(க்)க தவக் கல்த்து, வ இலை(க்)க அனப்த்து, வ பி(க்)க காஸம்த்து, வ இலை(க்)க ஹாகம்த்து. ஃபக்ஃபிர்லீ மா கத்தம்த்து, வ மா அக்கர்த்து, வ மா அஸ்ரர்த்து, வமா அஃலன்த்து. அன்த்தல் முகத்திமு, வ அன்த்தல் முஅக்கிரு. லா இலாஹ இல்லா அன்த்த; அல்லது லா இலாஹ ஃகைருக்க. (பொருள்: இறைவா! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தையும் நிர்வகிப்பவன் நீயே! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தின் ஆட்சி யும் உனக்கே! உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி, அவற்றில் உள்ளவை ஆகிய அனைத்தின் ஒளி நீயே! உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமிக்கு அரசன் நீயே! உனக்கே புகழ் அனைத்தும். நீ உண்மை. உன் வாக்குறுதி உண்மை. உனது சந்திப்பு உண்மை. உனது கூற்று உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. நபிமார்கள் உண்மை. முஹம்மத் (ஸல்) அவர்கள் உண்மை. மறுமை உண்மை. இறைவா! உனக்கே கட்டுப்பட்டேன். உன்மீதே நம்பிக்கை கொண்டுள்ளேன். உன்னையே சார்ந்துள்ளேன். உன்னிடமே திரும்புகிறேன். உன்னிடமே வழக்காடு வேன். உன்னிடமே நீதி கேட்பேன். எனவே, நான் முந்திச் செய்த, பிந்திச் செய்கின்ற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்கள் அனைத்தையும் மன்னிப்பாயாக! நீயே முற்படுத்துபவன். நீயே பிற்படுத்துபவன். உன்னைத் தவிர வேறு இறைவன் இல்லை.) இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், அபூஉமய்யா அப்துல் கரீம் (ரஹ்) அவர்களின் அறிவிப்பில் ‘வ லா ஹவ்ல வலா குவ்வத்த இல்லா பில்லாஹ்’ (அல்லாஹ்வின் உதவியின்றி பாவத்திலிருந்து விலகவோ நன்மை புரியும் ஆற்றலோ இல்லை) என்று கூறுவார்கள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		}
	]
}