{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்கு குர்ஆன் அத்தியாயங் களைக் கற்றுக்கொடுப்பதைப் போன்று, எல்லாக் காரியங்களிலும் நல்லதைத் தேர்ந்தெடுப்பதற்கான முறையையும் கற்றுக்கொடுப்பவர்களாய் இருந்தார்கள். நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களில் ஒருவர் ஒரு காரியத்தை(ச் செய்ய) நாடினால், கடமையான தொழுகை அல்லாத (கூடுதலான தொழுகையாக) இரண்டு ரக்அத்களைத் தொழட்டும். பின்னர் (பின்வருமாறு) பிரார்த்திக்கட்டும்: அல்லாஹும்ம! இன்னீ அஸ்தகீரு(க்)க பி இல்மி(க்)க. வ அஸ்தக்திரு(க்)க பி குத்ரத்தி(க்)க. வ அஸ்அலு(க்)க மின் ஃபள்லி(க்)கல் அழீம். ஃப இன்ன(க்)க தக்திரு, வலா அக்திரு, வ தஅலமு வலா அஉலமு. வ அன்(த்)த அல்லாமல் ஃகுயூப். அல்லாஹும்ம! இன் குன்(த்)த தஅலமு அன்ன ஹாதல் அம்ர கைருன் லீ ‘ஃபீ தீனீ, வ மஆஷீ, வ ஆக்கிப(த்)தி அம்ரீ’ / ‘ஃபீ ஆஜிலி அம்ரீ வ ஆஜிலிஹி / ஃபக்துர்ஹு லீ, வ யஸ்ஸிர்ஹு லீ, ஸும்ம பாரிக் லீ ஃபீஹீ. வ இன் குன்(த்)த தஅலமு அன்ன ஹாதல் அம்ர ஷர்ருன் லீ ‘ஃபீ தீனீ, வ மஆஷீ, வ ஆக்கிப(த்)தி அம்ரீ’ / ‘ஃபீ ஆஜிலி அம்ரீ வ ஆஜிலிஹி / ஃபஸ்ரிஃப்ஹு அன்னீ. வஸ்ரிஃப்னீ அன்ஹு. வக்துர்ஹு லியல்கைர ஹைஸு கான, ஸும்ம அர்ளினீ. (பொருள்: இறைவா! நீ அறிந்துள்ளபடி (எது எனக்கு) நன்மை(யோ அ)தனை உன்னிடம் நான் வேண்டுகிறேன். உனது ஆற்றலால் எனக்கு ஆற்றல் உண்டாக வேண்டுமென உன்னிடம் கோருகிறேன். உனது மகத்தான தயவை உன்னிடம் கோருகிறேன். ஏனெனில், நீயே ஆற்றல் மிக்கவன்; எனக்கோ எந்த ஆற்றலும் கிடையாது. நீயே நன்கறிந்தவன்; எனக்கோ எந்த அறிவும் கிடையாது. நீயே மறைவான வற்றை நன்கறிந்தவன். இறைவா! (நான் செய்யப்போகும்) இந்தக் காரியம் எனக்கு ‘என் மார்க்கத்திலும் என் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ / அல்லது ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’ / நன்மையானதாக இருக்கும் என நீ அறிந்தால், அதைச் செய்வதற்கு எனக்கு ஆற்றல் வழங்குவாயாக! அதை எனக்கு எளிதாக்குவாயாக! பிறகு அதில் எனக்கு வளத்தை வழங்குவாயாக! (நான் செய்யப்போகும்) இந்தக் காரியம் எனக்கு ‘என் மார்க்கத்திலும் என் வாழ்க்கையிலும் என் காரியத்தின் முடிவிலும்’ -அல்லது ‘என் இம்மை வாழ்விலும் மறுமை வாழ்விலும்’- கேடாக அமையும் என நீ அறிந்தால், இக்காரியத்தை என்னை விட்டுத் திருப்பிவிடுவாயாக! என்னையும் இக்காரியத்தைவிட்டுத் திருப்பிவிடுவாயாக! நன்மை எங்கிருந்தாலும் அதை அடைவதற்குரிய செயல் திறனை எனக்கு வழங்குவாயாக! பிறகு அதைத் திருப்தி கொண்டவனாக என்னை ஆக்குவாயாக!) பிறகு அவர் தமது தேவை இன்னதெனக் குறிப்பிடட்டும். அத்தியாயம் : 19",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 45
			}
		}
	]
}