{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "சஹ்ல் பின் சஅத் (ரலி) அவர்கள் கூறியதாவது: அம்ர் பின் அவ்ஃப் குலத்தாரி டையே ஏதோ பிரச்சினை ஏற்பட்டு இருப்பதாக நபி (ஸல்) அவர்களுக்குச் செய்தி கிடைத்தது. எனவே, அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் தம் தோழர்கள் சிலருடன் அங்கு சென்று அக்குலத்தாரிடையே சமாதானம் செய்வதில் ஈடுபட்டிருந்தபோது அவர்கள் (திரும்பி) வருவதில் தாமதம் ஏற்பட் டது. தொழுகையின் நேரம் நெருங்கி விட்டது. அப்போது பிலால் (ரலி) அவர்கள், அபூபக்ர் (ரலி) அவர்களிடம் வந்து, “அபூபக்ர் அவர்களே! நபி (ஸல்) அவர்கள் (தமது பணியின் நிமித்தமாக நேரத்தோடு வந்து சேர்வதிலிருந்து) தடுக்கப்பட்டிருக்கிறார்கள். தொழுகை யின் நேரமும் நெருங்கிவிட்டது. எனவே, தாங்கள் மக்களுக்குத் தொழு விக்கிறீர்களா?” எனக் கேட்டார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “நீர் விரும்பினால் செய்கிறேன்” என்றவுடன் பிலால் (ரலி) அவர்கள் இகாமத் கூற, அபூபக்ர் (ரலி) அவர்கள் முன்னின்று மக்களுக்குத் தொழுவிக்க தக்பீர் (தஹ்ரீமா) கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் வரிசைகளினூடே வந்து (முதல்) வரிசை யில் நின்றார்கள். (இதைக் கண்ட) மக்கள் கைதட்டலானார்கள். தொழும்போது திரும்பும் வழக்கமில்லாத அபூபக்ர் (ரலி) அவர்கள், மக்கள் கைத்தட்டலை அதிகரித்தபோது திரும்பி (முதல் வரிசையில்) நபி (ஸல்) அவர்கள் நிற்பதைக் கண்டார்கள். அப்போது நபி (ஸல்) அவர்கள் அபூபக்ரைப் பார்த்துத் தொழுகையைத் தொடரும்படி சைகை செய்தார்கள். எனினும், அபூபக்ர் (ரலி) அவர்கள் தம் கைகளை உயர்த்தி இறைவனைப் புகழ்ந்து, திரும்பாமல் பின்வாக்கில் நகர்ந்து (முதல்) வரிசை யில் நின்றார்கள். அப்போது நபி (ஸல்) அவர்கள் முன்சென்று மக்களுக்குத் தொழுவித் தார்கள். தொழுகையை முடித்ததும் மக்களை முன்னோக்கி, “மக்களே! தொழுகையில் (இதைப் போன்று) ஏதாவது நிகழ்ந்துவிட்டால் நீங்கள் ஏன் கைதட்டுகிறீர்கள்? கைதட்டுதல் பெண் களுக்குரிய செயலாகும். எனவே, யாருக்கேனும் தமது தொழுகையில் ஏதேனும் நிகழ்ந்துவிட்டால் ‘சுப்ஹானல் லாஹ்’ எனக் கூறட்டும். ஏனெனில், யார் சுப்ஹானல்லாஹ்வைக் கேட்கிறாரோ அவர் இந்தப் பக்கம் தமது கவனத்தைச் செலுத்தாமல் இருக்கமாட்டார்” எனக் கூறினார்கள். பிறகு (அபூபக்ர் (ரலி) அவர்களிடம்) “அபூபக்ரே! நான் உம்மை நோக்கிச் சைகை செய்தபோது நீங்கள் ஏன் தொடர்ந்து மக்களுக்குத் தொழுவிக்க வில்லை?” எனக் கேட்டார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ் வின் தூதர் முன்னிலையில் தொழுவிப் பது அபூகுஹாஃபாவின் மகனுக்குத் தகுதியாகாது” எனக் கூறினார்கள். அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		}
	]
}