{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (யூதச் சிறுவன்) இப்னு ஸய்யாதை நோக்கி நபி (ஸல்) அவர்கள் ஒரு குழுவுடன் சென்றபோது, அவர்களுடன் உமர் (ரலி) அவர்களும் இருந்தார்கள். பருவ வயதை நெருங்கிவிட்டிருந்த இப்னு ஸய்யாத் ‘பனூ மஃகாலா’ குலத் தாரின் மேட்டுப் பகுதியில் சிறுவர்களு டன் விளையாடிக்கொண்டிருந்தான். நபி (ஸல்) அவர்கள் (அவனைக்) கையால் தட்டுகின்ற வரை, (நபி (ஸல்) அவர்கள் தன்னிடம் வந்திருப்பதை) அவன் உணரவில்லை. பிறகு நபி (ஸல்) அவர்கள் அவனி டம், “நான்தான் இறைத்தூதர் என நீ உறுதிகூறுகின்றாயா?” எனக் கேட்டார் கள். இப்னு ஸய்யாத் நபி (ஸல்) அவர் களை நோட்டமிட்டுவிட்டு, “நீர் எழுதப் படிக்கத் தெரியாதவர்களின் நபி என நான் உறுதிகூறுகின்றேன்” என்று சொன்னான். பிறகு இப்னு ஸய்யாத் நபி (ஸல்) அவர்களிடம், “நான் அல்லாஹ்வின் தூதர் என நீர் உறுதிகூறுகின்றீரா?” எனக் கேட்டான். நபி (ஸல்) அவர்கள் (எதுவும் கேட்காமல்) அவனை விட்டுவிட்டு, “நான் அல்லாஹ்வையும் அவனு டைய தூதர்களையும் நம்பியுள்ளேன்” எனக் கூறினார்கள். பிறகு “(உன் நிலை பற்றி) நீ என்ன நினைக்கிறாய்?” எனக் கேட்டார்கள். அதற்கு இப்னு ஸய்யாத், “எனக்கு மெய்யான செய்திகளும் (சில சமயம்) பொய்யான செய்திகளும் உதிக்கின்றன” என்றான். நபி (ஸல்) அவர்கள், “உனக்கு இப்பிரச்சினையில் குழப்பம் ஏற்பட்டுள்ளது” என்று கூறிவிட்டு, “நான் (உனக்காக) ஒன்றை மனதில் மறைத்துவைத்துள்ளேன் (அது யாது)?” எனக் கேட்டார்கள். (அப்போது நபியவர்கள் ‘அத்துகான்’ எனும் (44ஆவது) அத்தியாயத்தின் 10ஆவது வசனத்தை மனதிற்குள் நினைத்துக்கொண்டார்கள்.) அதற்கு இப்னு ஸய்யாத், “அது (‘அத்துகான்’ என்பதை) ‘துக்’ என (அரைகுறையாக)ச் சொன்னான். உடனே நபி (ஸல்) அவர்கள், “தூர விலகிப் போ! நீ உனது எல்லையைத் தாண்டிவிட முடியாது” என்றார்கள்.29 அப்போது உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! என்னை விடுங்கள்! இவனது கழுத்தை வெட்டிவிடு கிறேன்” என்றார்கள். நபி (ஸல்) அவர்கள், “இவன் அவனாக (தஜ்ஜாலாக) இருந்தால் இவனைக் கொல்லும் பொறுப்பு உமக்குக் கொடுக்கப்பட வில்லை; இவன் அவனாக இல்லை யெனில் இவனைக் கொல்வதில் உமக்கு எந்தப் பலனும் இல்லை” எனக் கூறினார்கள். பின்னர் (மற்றொரு சந்தர்ப்பத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் உபை பின் கஅப் (ரலி) அவர்களும் இப்னு ஸய்யாத் இருக்கும் பேரீச்சம் தோட்டத்திற்குச் சென்றனர். இப்னு ஸய்யாத் தம்மைப் பார்த்துவிடும் முன் ஒளிந்திருந்து அவனிடமிருந்து எதை யேனும் செவியேற்க வேண்டும் என நபியவர்கள் திட்டமிட்டார்கள். அங்கு இப்னு ஸய்யாத் ஒரு பூம்பட்டுப் போர்வையைப் போர்த்திக்கொண்டு எதையோ முணுமுணுத்தபடி படுத்திருப்பதை நபி (ஸல்) அவர்கள் கண்டார்கள். அப்போது இப்னு ஸய்யாதின் தாய், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஈச்ச மரங்களிடையே ஒளிந்து ஒளிந்து வருவதைப் பார்த்துவிட்டார். உடனே இப்னு ஸய்யாதிடம், “ஸாஃபியே! -இது அவனுடைய பெயர்- “இதோ, முஹம்மத் (வந்து விட்டார்)” என்று கூறியதும், இப்னு ஸய்யாத் குதித்தெழுந்தான். அப்போது நபி (ஸல்) அவர்கள், “அந்தப் பெண், அவனை(ப் பேச)விட்டி ருந்தால் அவன் (தனது நிலையை) வெளிப்படுத்தியிருப்பான்” எனக் கூறினார்கள். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் ஓர் அறிவிப்பில், (‘அவனை விட்டுவிட்டார் கள்’ என்பதைக் குறிக்க ‘ரஃபள’ எனும் சொல்லுக்குப் பதிலாக) ‘ரஃபஸ’ எனும் சொல் இடம்பெற்றுள்ளது. (‘முணுமுணுப்பு’ என்பதைக் குறிக்க சில அறிவிப்புகளில்) ‘ரம்ரமா’ என்றும், ‘ஸம்ஸமா’ என்றும், வேறுசில அறிவிப்புகளில் ‘ரம்ஸா’ என்றும் இடம்பெற்றுள்ளது. அத்தியாயம் : 23",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}