{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "அஹ்னஃப் பின் கைஸ் (ரஹ்) அவர்கள் கூறியதாவது: நான் குரைஷிப் பிரமுகர்கள் இருந்த இடத்திற்குச் சென்று அமர்ந்தேன். அப்போது பரட்டை முடியுள்ள சொர சொரப்பான ஆடையணிந்த முரட்டுத் தோற்றமுள்ள ஒரு மனிதர் அவர்களிடம் வந்து முகமன் (சலாம்) கூறிவிட்டு, “(ஸகாத் கொடுக்காமல்) பொருளைச் சேமிப்பவர் களுக்காக, நரக நெருப்பில் சூடேற்றப்பட்ட ஒரு கல் உண்டு. அக்கல் அவர்களின் மார்புக் காம்பில் வைக்கப்படும். உடனே அக்கல் தோளின் மேற்பகுதி எலும்பின் வழியாக வெளியேறும். பிறகு அது தோளின் மேற்பகுதி எலும்பில் வைக்கப் படும். உடனே அது மார்புக் காம்பின் வழியாக வெளியேறி உருண்டோடும்” என்று கூறினார். பிறகு திரும்பிச் சென்ற அவர் ஒரு தூணுக்கருகில் போய் உட்கார்ந்தார். நான் அவரைப் பின்தொடர்ந்து சென்று அவருக்கருகில் அமர்ந்தேன். அவர் யார் என்று எனக்கு (அப்போது) தெரியவில்லை. பிறகு நான் அவரிடம் “தாங்கள் கூறியதை மக்கள் வெறுப்பதாகவே நான் கண்டேன்” என்று சொன்னேன். அதற்கு அவர் “அவர்கள் விவரமற்றவர்கள்” எனக் கூறினார். “என் தோழர் என்னிடம் சொன்னார்...” என அந்தப் பெரியவர் மேலும் தொடர்ந்து, கூறும்போதே நான் (குறுக்கிட்டு) “உங்கள் தோழர் யார்?” எனக் கேட்டேன். “நபி (ஸல்) அவர்கள்தான்” எனக் கூறிவிட்டு, “நபி (ஸல்) அவர்கள், ‘அபூதர்ரே! உஹுத் மலையை நீர் பார்த்திருக்கிறீரா?’ எனக் கேட்டார்கள். தமது வேலை ஏதோ ஒன்றுக்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை அங்கு அனுப்பப் போகிறார்கள் என எண்ணி, பகல் முடிய இன்னும் எவ்வளவு நேரம் உள்ளது என அறிந்துகொள்வதற்காக சூரியனைப் பார்த்துவிட்டு, ‘ஆம்’ என்றேன். ‘உஹுத் மலையளவுக்குத் தங்கம் என்னிடம் இருந்து அதில் மூன்று தீனார் களைத் தவிர மற்ற அனைத்தையும் செலவிடாமலிருப்பதை நான் விரும்ப வில்லை’ என்று நபி (ஸல்) அவர்கள் சொன்னார்கள். இவர்களோ இதை அறியாதவர்களாய் இருக்கிறார்கள். இவர்கள் உலக ஆதாயங் களையே சேகரிக்கிறார்கள். அல்லாஹ் வின் மீதாணையாக! நான் அல்லாஹ்வைச் சந்திக்கும்வரை இவ்வுலகப் பொருட்களை இவர்களிடம் நான் கேட்கமாட்டேன்; மார்க்க விஷயங்களைப் பற்றியும் இவர்களிடம் தீர்ப்பு கேட்கமாட்டேன்” என்று அந்தப் பெரியவர் (அபூதர் (ரலி) அவர்கள்) கூறினார்கள். அத்தியாயம் : 24",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}