{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "அபூஷிஹாப் மூசா பின் நாஃபிஉ (ரஹ்) அவர்கள் கூறியதாவது: நான் ஹஜ்ஜுடன் உம்ராவையும் (தமத்துஉ) செய்ய நாடி மக்காவிற்குச் சென்றேன். துல்ஹஜ் பிறை எட்டுக்கு மூன்று நாட்களுக்கு முன்னால் (அதாவது துல்ஹஜ் ஐந்தில்) மக்காவில் நுழைந்தோம். அப்போது மக்காவாசிகளில் சிலர் என்னிடம், “இப்போது உமது ஹஜ் (தமத்துஉ செய்வதால்) மக்காவாசிகளின் ஹஜ்ஜாக ஆகிவிடும் (குறைந்த நன்மைகளே கிடைக்கும்”) என்றனர்.19 நான் அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்களிடம் சென்று இதைப் பற்றி விளக்கம் கேட்டேன். அதாஉ (ரஹ்) அவர்கள் (பின்வருமாறு) கூறினார்கள்: ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறினார்கள்: நபி (ஸல்) அவர்கள் தம்முடன் குர்பானி ஒட்டகங்களை ஓட்டிவந்த நாளில் நானும் அவர்களுடன் ஹஜ் செய்தேன். அப்போது மக்கள் அனை வரும் ஹஜ்ஜுக்காக மட்டுமே தனியாக இஹ்ராம் கட்டியிருந்தனர். நபி (ஸல்) அவர்கள் தோழர்களிடம், “நீங்கள் தவாஃபையும், ஸஃபா, மர்வாவிற்கு மத்தி யில் ஓடுவதையும் நிறைவேற்றிவிட்டு, முடியைக் குறைத்து இஹ்ராமிலிருந்து விடுபட்டு (மக்காவில்) தங்கிக்கொள்ளுங் கள். பிறை எட்டு அன்று ஹஜ்ýக்காக இஹ்ராம் கட்டி, இதற்கு முன்னால் செய்ததை தமத்துஉ (உம்ரா) ஆக ஆக்கிக்கொள்ளுங்கள்” என்றார்கள். அதற்குத் தோழர்கள், “நாங்கள் ஹஜ்ஜின் பெயரில் இஹ்ராம் கட்டிக் கொண்டு வந்தோம். அதை எவ்வாறு தமத்துஉ (உம்ரா) ஆக ஆக்கிக் கொள்வது?’ என்று கேட்டனர். அதற்கு நபி (ஸல்) அவர்கள், “உங்களுக்கு நான் கட்டளையிட்டதை நீங்கள் செய்யுங்கள். நான் என்னுடன் குர்பானிப் பிராணியைக் கொண்டு வந்திராவிடில், உங்களுக்கு நான் கட்டளையிட்டதைப் போன்று நிச்சயமாக நானும் செய்திருப்பேன்; குர்பானிப் பிராணியைக் கொண்டுவந்ததால், அது அதற்குரிய இடத்தை (மினாவை) அடையும்வரை (அங்கு அதை குர்பானி கொடுக்கும்வரை) இஹ்ராமைக் களைவது எனக்குக் கூடாது” என்றார்கள். உடனே தோழர்கள் நபி (ஸல்) அவர்களின் கட்டளைப்படி செயலாற்றினார்கள். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: இதன் அறிவிப்பாளரான அபூஷிஹாப் (ரஹ்) அவர்கள் இதைத் தவிர வேறு (மர்ஃபூஆன) ஹதீஸ்கள் அறிவிக்கவில்லை. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		}
	]
}