{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "முஹம்மத் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: நான், உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்களிடம் (தவாஃபுல் குதூம் செய்தபின் இஹ்ராமிலிருந்து விடுபடுவது குறித்துக்) கேட்டேன். அதற்கு உர்வா (ரஹ்) அவர்கள், “நபி (ஸல்) அவர்கள் ஹஜ் செய்துள்ளார்கள். ஆயிஷா (ரலி) அவர்கள் அது பற்றி என்னிடம் கூறியதாவது: நபி (ஸல்) அவர்கள் (மக்காவுக்கு) வந்தததும் முதல் வேலையாக அங்கத் தூய்மை (உளூ) செய்தார்கள்; பிறகு கஅபாவை ‘தவாஃப்’ செய்தார்கள்; பிறகு உம்ராவுக்காக(த் தனியாகத் தவாஃப்) செய்யவில்லை. பின்னர் அபூபக்ர் (ரலி) அவர்கள் ஹஜ் செய்தார்கள். அன்னாரும் முதல் வேலையாக கஅபாவை தவாஃப் தான் செய்தார்கள். பிறகு உம்ராவுக்கென்று (தவாஃப் ஏதும்) செய்யவில்லை. உமர் (ரலி) அவர்களும் அவ்வாறேதான் செய்தார்கள். (அடுத்து உர்வா (ரஹ்) அவர்கள் கூறுகிறார்கள்:) பிறகு உஸ்மான் (ரலி) அவர்கள் ஹஜ் செய்தார்கள். அவர்களும் முதல் வேலையாக கஅபாவை தவாஃப் செய்ததை நான் பார்த்தேன். அவர்கள் உம்ராவுக்காக (தவாஃப் ஏதும்) செய்ய வில்லை. பிறகு முஆவியா (ரலி), அப்துல்லாஹ் பின் உமர் (ரலி) ஆகி யோரும் ஹஜ் செய்துள்ளனர். என் தந்தை ஸுபைர் பின் அல்அவ்வாம் (ரலி) உடன் நான் ஹஜ் செய்திருக்கிறேன். அவர்களும் முதன்முதலாக கஅபாவை தவாஃப் செய்தார்கள். பிறகு உம்ராவுக்காக அவர்கள் (தனியாக தவாஃப் ஏதும்) செய்யவில்லை. முஹாஜிர்களும் அன்சாரிகளும் இவ் வாறே செய்வதை நான் பார்த்திருக்கிறேன். பிறகு உம்ராவுக்காக அவர்கள் (தவாஃப்) செய்யவில்லை. நான் கடைசியாக இப்னு உமர் (ரலி) அவர்கள் இவ்வாறு செய்த தைப் பார்த்தேன். அவர்கள் அந்த ஹஜ்ஜை முறித்து உம்ராவாக ஆக்கவில்லை. இதோ அவர்களிடம் இப்னு உமர் (ரலி) அவர்கள் இருக்கத்தானே செய்கிறார்கள். அவர்களிடம் அவர்கள் கேட்கமாட்டார்களா? ஆக, முன்சென்றவர்களில் யாரும் (மக்காவில்) பாதம் பதித்ததும் முதல் வேலையாக கஅபாவை தவாஃப் செய்யாமல் இருந்ததில்லை. பிறகு (அந்த தவாஃபோடு) அவர்கள் இஹ்ராமிலிருந்து விடுபடவில்லை. என் தாயாரும் (அஸ்மா) என் சிறிய தாயாரும் (ஆயிஷா) மக்கா வந்ததும் தவாஃப் செய்வதற்குமுன் வேறு எதையும் செய்வதில்லை; இஹ்ராமிலிருந்து விடுபடுவதுமில்லை. அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}