{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் (என் சிறிய தாயார்) ஆயிஷா (ரலி) அவர்களிடம், “நிச்சயமாக ‘ஸஃபா’வும் ‘மர்வா’வும் அல்லாஹ்வின் அடையாளச் சின்னங்களில் உள்ளவை ஆகும். எனவே, யார் அந்த (கஅபா) ஆலயத்தில் ஹஜ்ஜோ உம்ராவோ செய்கிறாரோ, அவர்மீது அவ்விரண்டையும் சுற்றிவருவது குற்ற மன்று” (2:158) எனும் இறைவசனப்படி, அல்லாஹ்வின் மீதாணையாக! ஒருவர் ஸஃபா-மர்வாவுக்கிடையே சுற்றிவரா விட்டாலும் குற்றமில்லை என்பது பற்றி நீங்கள் என்ன கருதுகிறீர்கள்? எனக் கேட்டேன். அதற்கு ஆயிஷா (ரலி) அவர்கள், “என் சகோதரி (அஸ்மாவின்) மகனே! நீர் சொன்னது தவறு. அந்த வசனத்தில் அவ்விரண்டையும் சுற்றி வராமலிருப்பது குற்றமன்று என்றிருந்தால்தான் நீர் கூறும் கருத்து வரும். (‘சுற்றிவருவது குற்றமன்று’ என்றே இவ்வசனம் கூறுகின்றது.) ஆனால், இவ்வசனம் அன்சாரிகள் தொடர்பாக அருளப்பெற்றதாகும். அவர்கள் இஸ்லாத்தை ஏற்றுக்கொள்ளும் முன் தாம் வழிபட்டுவந்த ‘முஷல்லல்’ எனும் குன்றில் உள்ள ‘மனாத்’ எனும் சிலைக்காக இஹ்ராம் கட்டும் வழக்கம் உள்ளவர்களாக இருந்தனர். எனவே, இப்போது (இஸ் லாத்தை ஏற்றபின்) அந்த ஸஃபா-மர்வா வைச் சுற்றி வருவது பாவமாகும் எனக் கருதினார்கள். எனவே, அவர்கள் இஸ்லாத்தை ஏற்றதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் இது பற்றி, ‘அல்லாஹ்வின் தூதரே! நாங்கள் ஸஃபா - மர்வாவைச் சுற்றி வருவதைப் பாவமாகக் கருதுகின்றோம்’ எனக் கேட்டார்கள். அப்போதுதான் அல்லாஹ், “நிச்சயமாக, ஸஃபாவும் மர்வாவும் அல்லாஹ்வின் அடையாளச் சின்னங்களில் உள்ளவை ஆகும்” (2:158) எனும் வசனத்தை அருளினான். மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவ்விரண்டுக்கு மிடையே சுற்றி வருவதை நடைமுறைப்படுத்திக் காட்டியுள்ளார்கள். எனவே, அவ்விரண்டிற்குமிடையே சுற்றி வருவதைக் கைவிடுவதற்கு யாருக்கும் அனுமதியில்லை” எனக் கூறினார்கள். ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறு கிறார்கள்: பிறகு நான் அபூபக்ர் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்களிடம் இது பற்றித் தெரிவித்தேன். அதற்கு அவர்கள் கூறினார்கள்: நான் கேள்விப்படாத விளக்கமாகும் இது. மக்களில் ‘மனாத்’ எனும் சிலைக்காக இஹ்ராம் கட்டுவார்கள் என்று ஆயிஷா (ரலி) அவர்கள் குறிப்பிட்டவர்களைத் தவிர மற்றவர்கள் ஸஃபா-மர்வாவுக் கிடையே ஓடிக்கொண்டிருந்தார்கள். குர்ஆனில் கஅபாவைச் சுற்றி (தவாஃப்) வர வேண்டும் என்று கூறிய அல்லாஹ், ஸஃபா-மர்வா பற்றிக் குறிப்பிடாததால் “அல்லாஹ்வின் தூதரே! நாங்கள் ஸஃபா- மர்வாவுக்கிடையே சுற்றிக்கொண்டிருந் தோம். அல்லாஹ்வோ ஸஃபாவைப் பற்றிக் கூறாமல் கஅபாவை தவாஃப் செய்வது பற்றிக் கூறுகிறானே? ஸஃபா-மர்வாவுக் கிடையே நாங்கள் ஓடுவது எங்கள் மீது குற்றமாகுமா” என்று நபித்தோழர்கள் கேட்டனர். அப்போது “ஸஃபாவும் மர்வாவும் அல்லாஹ்வின் அடையாளச் சின்னங் களில் உள்ளவையாகும்” (2:158) எனும் வசனத்தை அல்லாஹ் அருளினான் என்று பல அறிஞர்கள் கூறியதை நான் கேட்டுள்ளேன். நான், இந்த வசனம் இரண்டு சாரார் தொடர்பாகவும் அருளப்பெற்றது எனக் கேள்விப்பட்டிருக்கிறேன். ஒரு சாரார், அறியாமைக் காலத்தில் ஸஃபா-மர்வாவைச் சுற்றிவந்ததைப் பாவமாகக் கருதியவர்கள். மற்றொரு சாரார், ஏற்கெனவே அவ்வாறு சுற்றி வந்துகொண்டிருந்துவிட்டு, இஸ்லாத்தில் நுழைந்த பின்பும் ஸஃபா-மர்வா இடையே சுற்றுவதைப் பாவமாகக் கருதியவர்கள். அல்லாஹ் கஅபாவை தவாஃப் செய்வது பற்றிக் குறிப்பிட்டுவிட்டு, ஸஃபாவைக் குறிப்பிடாமல் இருந்ததே இதற்குக் காரணம். இறையில்லம் கஅபாவை தவாஃப் செய்வது பற்றி (22:29ஆவது வசனத்தில்) கூறிய பிறகே, (இடைவெளி விட்டு) ஸஃபா-மர்வா பற்றி (2:158ஆவது வசனத்தில்) அல்லாஹ் குறிப்பிட்டான். அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		}
	]
}