{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"4": "Ablutions (Wudu')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "உபைத் பின் ஜுரைஜ் (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடம், “அபூஅப்திர் ரஹ்மான் அவர்களே! நீங்கள் நான்கு காரியங் களைச் செய்வதை நான் பார்க்கிறேன். உங்கள் நண்பர்க(ளான நபித்தோழர்க)ளில் வேறெவரும் அவற்றைச் செய்வதை நான் பார்க்கவில்லை” என்றேன். அதற்கு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், “இப்னு ஜுரைஜ்! அவை யாவை?” என்று கேட்டார்கள். நான் சொன்னேன்: (கஅபாவைச் சுற்றிவரும்போது அதன் மூலைகளில்) ருக்னுல் யமானீ மற்றும் ஹஜருல் அஸ்வத் ஆகிய இரு மூலைகளை மட்டுமே நீங்கள் தொடுவதைக் கண்டேன். (மற்ற மூலைகளை நீங்கள் தொடுவதில்லை.) மேலும், முடி அகற்றப்பட்ட தோல் காலணிகளையே நீங்கள் அணிவதை நான் பார்க்கிறேன். நீங்கள் உங்கள் ஆடைக்கு மஞ்சள் நிறச் சாயமிடுவதையே நான் பார்க்கிறேன். மேலும், நீங்கள் மக்காவில் இருக்கும்போது மக்கள் (துல்ஹஜ்) பிறை கண்டவுடன் ‘இஹ்ராம்’ கட்டினாலும், நீங்கள் ‘இஹ்ராம்’ கட்டாமல் துல்ஹஜ் எட்டாம் நாள் (யவ்முத் தர்வியா)வரை இருப்பதைக் கண்டேன் (இவைதான் அந்த நான்கு விஷயங்கள்)”. அதற்கு அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் (பின்வருமாறு) பதிலளித்தார்கள்: கஅபாவின் மூலைகளைப் பொறுத்தவரை, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ருக்னுல் யமானீ, ஹஜருல் அஸ்வத் ஆகிய இரு மூலைகளைத் தவிர வேறெதையும் தொடுவதை நான் கண்டதில்லை (ஆகவே, நானும் அப்படிச் செய்கிறேன்). முடி அகற்றப்பட்ட காலணிகளைப் பொறுத்த வரை, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முடியில்லாத காலணிகளை அணிவதையும் அதனுடன் (காலைக் கழுவி) அங்கத் தூய்மை செய்வதையும் நான் பார்த்திருக்கிறேன். ஆகவே, நானும் அதை அணிவதை விரும்புகிறேன். மஞ்சள் நிறத்தைப் பொறுத்தவரை, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது ஆடைக்கு) அதன் மூலம் சாய மிடுவதை நான் பார்த்திருக்கிறேன். எனவே, அதைக் கொண்டு சாயமிடுவதை நான் விரும்புகிறேன். ‘இஹ்ராம்’ கட்டுவதைப் பொறுத்த வரையில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகனம் பயணத்திற்குத் தயாராகி நிற்கும் (துல்ஹஜ் எட்டாம் நாள்)வரை இஹ்ராம் கட்டுவதை நான் பார்த்ததில்லை (எனவேதான், நானும் எட்டாம் நாள் ‘இஹ்ராம்’ கட்டுகிறேன்). அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 32
			}
		}
	]
}