{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நாங்கள் நபி (ஸல்) அவர்களுடன் ஹஜ்ஜை மட்டுமே நிறைவேற்றும் எண்ணத்தோடு புறப்பட்டோம். நபி (ஸல்) அவர்கள் (மக்காவுக்கு) வந்ததும் இறை யில்லம் கஅபாவையும் ஸஃபா-மர்வா வையும் தவாஃப் செய்தார்கள்; ஆனால், இஹ்ராமிலிருந்து விடுபடவில்லை. அவர்கள் குர்பானி பிராணியைக் கொண்டு வந்திருந்தார்கள். நபி (ஸல்) அவர்களுடன் இருந்த அவர்களுடைய துணைவியர், அவர் களுடைய தோழர்கள் அனைவரும் தவாஃப் செய்தார்கள். பிறகு அவர்களில் குர்பானி பிராணி கொண்டுவராதவர்கள் இஹ்ராமிலிருந்து விடுபட்டுவிட்டனர். அப்போது எனக்கு மாதவிடாய் ஏற்பட்டு விட்டது. நாங்கள் ஹஜ்ஜின் எல்லா கிரியைகளையும் செய்தோம். நபி (ஸல்) அவர்கள் ‘அல்முஹஸ்ஸப்’ எனுமிடத்தில் தங்கியிருந்த - (மினாவிலி ருந்து) திரும்ப வேண்டிய- இரவில் நான், “அல்லாஹ்வின் தூதரே! என்னைத் தவிர, உங்களுடைய மற்ற எல்லாத் தோழர்களும் ஹஜ்ஜையும் உம்ராவையும் முடித்துவிட்டு (ஊர்) திரும்புகின்றனர்” என்றேன். அதற்கு அவர்கள், “நாம் மக்காவுக்கு வந்கு சேர்ந்த இரவில் நீ தவாஃப் செய்யவில்லையா?” என்று கேட்டார்கள். நான் “இல்லை” என்றேன். நபி (ஸல்) அவர்கள் “நீ உன் சகோதரருடன் ‘தன்யீம்’ என்ற இடத்திற்குப் போய், உம்ராவுக்காக இஹ்ராம் கட்டிக்கொள்! மேலும், இன்ன இன்ன இடத்திற்கு வந்துவிடு” எனக் கூறினார்கள். நான் (என் சகோதரர்) அப்துர் ரஹ்மானுடன் ‘தன்யீம்’ சென்று உம்ராவுக்காக இஹ்ராம் கட்டினேன். அப்போது, ஸஃபிய்யா பின்த் ஹுயை (ரலி) அவர்களுக்கு மாதவிடாய் ஏற்பட்டுவிட்டது. நபி (ஸல்) அவர்கள், “உன் கழுத்து அறுந்துபோக! உனக்குத் தொண்டை வலி வர! (காரியத்தைக் கெடுத்துவிட்டாயே!) நீ எங்களை (மக்காவிலிருந்து செல்ல விடாமல்) தடுத்துவிட்டாய். நஹ்ருடைய (துல்ஹஜ் பத்தாம்) நாளில் தவாஃப் செய்துவிட்டாயல்லவா?” எனக் கேட்டார் கள். அதற்கு அவர்கள் “ஆம்” என்றதும், “அப்படியாயின் பரவாயில்லை; புறப்படு!” என்றார்கள். பிறகு நபி (ஸல்) அவர்கள் மக்காவாசி களுடன் மேலே ஏறும்போது அவர்களை நான் சந்தித்தேன்; அப்போது நான் கீழே இறங்கிக்கொண்டிருந்தேன். அல்லது, நான் மேலே ஏறிக்கொண்டிருந்தேன்; அவர்கள் கீழே இறங்கிக்கொண்டிருந்தார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. எல்லாத் தொடர்களிலும் (மக்காவுக்கு வந்து சேர்ந்த இரவில் நீ தவாஃப் செய்யவில்லையா என்று கேட்டதற்கு, ஆயிஷா (ரலி) அவர்கள் ‘இல்லை’ என்று பதிலளித்ததைக் குறிக்க) ‘லா’ எனும் சொல்லே இடம்பெறுகிறது. (வேறுசில அறிவிப்புகளில் ‘பலா’ எனும் சொல் காணப்படுகிறது.) அத்தியாயம் : 25",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 238
			}
		}
	]
}