{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"28": "Penalty of Hunting while on Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "சயீத் பின் அபீசயீத் அல்மக்புரீ (ரஹ்) அவர்கள் கூறியதாவது : (யஸீதின் ஆட்சியில் மதீனாவின் ஆளுநராயிருந்த) அம்ர் பின் சயீத், (அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களுக்கு எதிராக), மக்காவுக்குப் படைகளை அனுப்பிக்கொண்டிருந்தார். அப்போது அவரிடம் அபூஷுரைஹ் அல்அதவீ (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: “தலைவரே! மக்கா வெற்றிக்கு மறுநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறிய ஒரு செய்தியை உமக்கு நான் கூறுகிறேன். என் காதுகள் அதைச் செவியுற்றன; என் உள்ளம் அதை நினைவில் வைத்துள்ளது. அவர்கள் அதைக் கூறியபோது என் கண்கள் அவர்களைப் பார்த்திருக் கின்றன. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டுப் பின்வருமாறு கூறினார்கள்: அல்லாஹ்தான் மக்கா நகருக்குப் புனிதத்தை வழங்கினான். அதற்குப் புனிதம் வழங்கியவர்கள் மனிதர்கள் அல்லர். அல்லாஹ்வையும் மறுமை நாளையும் நம்புகின்ற எவருக்கும் இங்கே (சண்டையிட்டு) இரத்தத்தைச் சிந்து வதற்கோ இங்குள்ள மரத்தை வெட்டு வதற்கோ அனுமதி இல்லை; அல்லாஹ் வின் தூதர் (இங்கு மக்கா வெற்றி நாளில் ஒரு பகல் மட்டும்) போர் செய்ததனால் இதைப் பொது அனுமதி என்று யாரேனும் கருதினால், “அல்லாஹ், தன் தூதருக்குத் தான் அனுமதி வழங்கினான்; உங்களுக்கு அனுமதி வழங்கவில்லை” என்று கூறி விடுங்கள். எனக்குக்கூட பகலில் சிறிது நேரம் மட்டுமே அனுமதி அளிக்கப் பட்டது. இன்று அதன் புனிதத் தன்மை நேற்றைய அதன் புனிதத் தன்மைக்கு மீண்டு வந்துவிட்டது. (இங்கு) வந்திருப்போர் வராதவருக்குச் சொல்லிவிடுங்கள். அப்போது அபூஷுரைஹ் (ரலி) அவர்களிடம், “இதற்கு அம்ர் பின் சயீத் என்ன பதில் கூறினார்?” என்று கேட்கப்பட்டது. அதற்கு அவர்கள், “அபூஷுரைஹே! உம்மைவிட இதைப் பற்றி நான் நன்கு அறிவேன். குற்றவாளிக்கும், கொலை செய்துவிட்டு ஓடிவந்தவனுக்கும், திருடிவிட்டு ஓடிவந்தவனுக்கும் ‘ஹரம்’ புனித எல்லை நிச்சயம் பாதுகாப்புத் தராது” என்று அம்ர் கூறினார் எனப் பதிலளித்தார்கள். (இங்கு மூலத்தில் ‘திருட்டு’ என்பதைக் குறிக்க ‘குர்பத்’ எனும் சொல் ஆளப்பட்டுள்ளது.) ‘குர்பத்’ என்பதற்கு பொதுவான குற்றம் என்ற பொருளும் உண்டு. அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		}
	]
}