{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: (இறைத்தூதர்) இப்ராஹீம் (அலை) அவர்கள் (தம் துணைவியார்) யிசாரா’வுடன் புலம்பெயர்ந்து (இராக்கிலிருந்து) வெளியேறினார்கள். மன்னன் ஒருவன், அல்லது கொடுங்கோலன் ஒருவன் ஆட்சிபுரிந்த ஓர் ஊருக்குள் (எகிப்துக்குள்) யிசாரா’ உடன் இப்ராஹீம் (அலை) அவர்கள் நுழைந்தார்கள். ‘‘பெண்களிலேயே மிக அழகான ஒரு பெண்ணுடன் இப்ராஹீம் வந்திருக்கிறார்” என்று (மன்னனிடம்) கூறப்பட்டது. இப்ராஹீம் (அலை) அவர்களை அழைத்துவரச் செய்து, ‘‘இப்ராஹீமே! உம்முடன் இருக்கும் இந்தப் பெண் யார்?” என மன்னன் கேட்டான். இப்ராஹீம் (அலை) அவர்கள், யிஎன் சகோதரி’ என்று சொன்னார்கள். பிறகு சாராவிடம் திரும்பிய இப்ராஹீம் (அலை) அவர்கள், ‘‘நீ என் கூற்றைப் பொய்யாக்கிவிடாதே! நீ என் சகோதரி என்று நான் அவர்களிடம் கூறியிருக்கிறேன். அல்லாஹ்வின் மீதாணையாக! உன்னையும் என்னையும் தவிர இந்தப் பூமியில் இறைநம்பிக்கையாளர் யாரும் இல்லை” என்று சொன்னார்கள். பிறகு யிசாரா’வை மன்னனிடம் அனுப்பினார்கள். அவன், அவரை நோக்கி எழுந்தான். சாரா எழுந்து அங்கத் தூய்மை (உளூ) செய்து தொழுதுவிட்டு, ‘‘இறைவா! நான் உன்னையும் உன் தூதரையும் நம்பிக்கை கொண்டிருந்தால், எனது கற்பைக் கணவனைத் தவிர மற்றவர் களிடமிருந்து காப்பாற்றியிருந்தால், இந்த இறைமறுப்பாளரை என்மீது சாட்டிவிடாதே!” என்று பிரார்த்தித்தார். உடனே அவன் வலிப்பு வந்து, கீழே விழுந்து கால்களால் உதைத்துக்கொண்டான். மன்னனின் நிலை யைக் கண்ட சாரா, ‘‘இறைவா! இவன் செத்துவிட்டால் நான்தான் இவனைக் கொன்றேன் என்று சொல்லப்படுமே!” என்றவுடன், மன்னன் பழைய நிலைக்கு மீண்டு மறுபடியும் சாராவை நெருங் கினான். உடனே சாரா (அலை) அவர்கள் எழுந்து அங்கத் தூய்மை செய்து தொழுது விட்டு, ‘‘இறைவா! நான் உன்னையும் உன் தூதரையும் நம்பிக்கை கொண்டிருந்தால், எனது கற்பைக் கணவனைத் தவிர மற்றவர்களிடமிருந்து காப்பாற்றியிருந்தால் இந்த இறை மறுப்பாளனை என்மீது சாட்டிவிடாதே!” என்று பிரார்த்தித்தார்கள். உடனே அவன் வலிப்பு வந்து கீழே விழுந்து கால்களால் உதைத்துக்கொண்டான். மன்னனின் நிலையைக் கண்ட சாரா, ‘‘இறைவா! இவன் செத்துவிட்டால் நான்தான் இவனைக் கொன்றேன் என்று சொல்லப்படுமே!” என்று பிரார்த்தித் தார்கள். இவ்வாறு மன்னன் இரண்டு அல்லது மூன்று முறை வீழ்ந்து எழுந்து, ‘‘அல்லாஹ்வின் மீதாணையாக! என்னிடம் ஒரு ஷைத்தானைத்தான் அனுப்பியிருக் கிறீர்கள். எனவே, இவரை இப்ராஹீமிடம் அழைத்துச் செல்லுங்கள். இவருக்கு (பணிப் பெண்ணான) ஆஜரைக் கொடுங்கள்” என்று (அவையோரிடம்) சொன்னான். சாரா இப்ராஹீம் (அலை) அவர்களிடம் திரும்பி வந்து, அல்லாஹ் இந்த இறை மறுப்பாளனை வீழ்த்தி, (நமக்குப்) பணிபுரிய ஓர் அடிமைப் பெண்ணையும் தந்துவிட்டான் என்பது உங்களுக்குத் தெரியுமா?” என்று கேட்டார்கள்.80 இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் :",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		}
	]
}