{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: நபித்தோழர்களில் சிலர் ஒரு பயணம் மேற்கொண்டார்கள். அவர்கள் பயணம் செய்து (வழியில்) ஓர் அரபுக் குலத்தார் (தங்கியிருந்த இடத்துக்கு) அருகில் தங்கினார்கள். நபித்தோழர்கள் அக்குலத் தாரிடம் விருந்து கேட்டபோது அவர்களுக்கு விருந்தளிக்க அவர்கள் மறுத்து விட்டனர். அச்சயமம் அக்குலத்தாரின் தலைவனை தேள் கொட்டிவிட்டது. அவனுக்காக அவர்கள் எல்லா முயற்சி களையும் செய்துபார்த்தனர்; எந்த முயற்சியும் பலன் அளிக்கவில்லை. அப்போது அவர்களில் சிலர், ‘‘இதோ! இங்கே நமக்கு அருகில் தங்கியிருக்கும் கூட்டத்தாரிடம் நீங்கள் சென்றால், அவர்களிடம் (இதற்கு மருந்து) ஏதேனும் இருக்கலாம்” என்று கூறினர். அவ்வாறே அவர்களும் நபித்தோழர் களிடம் வந்து, ‘‘கூட்டத்தாரே! எங்கள் தலைவரைத் தேள் கொட்டிவிட்டது; அவருக்காக அனைத்து முயற்சிகளையும் செய்தோம்; (எதுவுமே) அவருக்குப் பயன் அளிக்கவில்லை. உங்களில் எவரிடமாவது (மருந்து) ஏதேனும் இருக்கிறதா?” என்று கேட்டனர். அப்போது, நபித்தோழர்களில் ஒருவர், ‘‘ஆம்! அல்லாஹ்வின் மீதாணையாக! நான் ஓதிப்பார்க்கிறேன்; என்றாலும், அல்லாஹ்வின் மீதாணையாக! நாங்கள் உங்களிடம் விருந்து கேட்டு நீங்கள் விருந்து தராததால் எங்களுக்கென்று ஒரு கூலியை நீங்கள் தராமல் ஓதிப்பார்க்க முடியாது” என்றார். அவர்கள் (முப்பது ஆடுகள் கொண்ட) ஓர் ஆட்டு மந்தை அளிப்பதாகப் பேசி ஒப்பந்தம் செய்தனர். நபித்தோழர் ஒருவர், தேள் கொட்டப்பட்டவர்மீது ‘அல்ஹம்து லில்லாஹி ரப்பில் ஆலமீன்...’ என்று ஓதி (இலேசாக) உமிழ்ந்தார். உடனே பாதிக்கப்பட்டவர். கட்டுகளிலிருந்து அவிழ்த்து விடப்பட்டவரைப் போன்று நடக்க ஆரம்பித்தார். வேதனையின் அறிகுறியே அவரிடம் தென்படவில்லை. பிறகு, அவர்கள் பேசிய கூலியை முழுமையாகக் கொடுத்தார்கள். ‘‘இதைப் பங்கு வையுங்கள்” என்று ஒருவர் கேட்டபோது, ‘‘நபி (ஸல்) அவர்களிடம் சென்று நடந்ததைக் கூறி, அவர்கள் என்ன கட்டளையிடுகிறார்கள் என்பதைத் தெரிந்துகொள்ளாமல் அவ்வாறு செய்யக் கூடாது” என்று ஓதிப்பார்த்தவர் கூறினார். நபி (ஸல்) அவர்களிடம் நபித்தோழர்கள் வந்து நடந்ததைக் கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் ‘‘அது (அல்ஹம்து அத்தியாயம்) ஓதிப்பார்க்கத் தக்கது என்று உமக்கு எப்படித் தெரியும்?” என்று கேட்டுவிட்டு, ‘‘நீங்கள் செய்தது சரிதான்; அந்த ஆடுகளை உங்களுக்கிடையே பங்கிட்டுக்கொள்ளுங்கள்! உங்களுடன் எனக்கும் ஒரு பங்கை ஒதுக்குங்கள்” என்று கூறிவிட்டுச் சிரித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		}
	]
}