{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"39": "Kafalah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: எனக்கு விவரம் தெரிந்த நாள் முதலாகவே என் பெற்றோர் (அபூபக்ர், உம்மு ரூமான்) (இஸ்லாம்) மார்க்கத்தைக் கடைப்பிடிப்பவர்களாகவே இருந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பகலின் இரு ஓரங்களான காலையிலும் மாலையிலும் எங்களிடம் வராமல் ஒரு நாளும் கழிந்தது இல்லை. (மக்காவில்) முஸ்லிம்கள் (இணைவைப்பாளர்களால்) சோதனைக்கு உள்ளாக்கப்பட்டபோது, அபூபக்ர் (ரலி) அவர்கள் புலம்பெயர்ந்து அபிசீனியாவை நோக்கிச் சென்றார்கள். யிபர்குல் ஃகிமாத்’ எனும் இடத்தை அவர்கள் அடைந்தபோது இப்னு தஃகினா என்பவர் அவர்களைச் சந்தித்தார். அவர் ‘அல்காரா’ எனும் குலத்தின் தலைவராவார். அவர் அவர்களிடம், ‘‘அபூபக்ரே! எங்கே செல்கிறீர்?” என்று கேட்டார். அபூபக்ர் (ரலி) அவர்கள், ‘‘என் சமுதாயத்தார் என்னை வெளியேற்றி விட்டனர்; எனவே, பூமியில் பயணம் (செய்து வேறுபகுதிக்குச்) சென்று என் இறைவனை வழிபடப்போகிறேன்” என்று கூறினார்கள். அதற்கு இப்னு தஃகினா, ‘‘உம்மைப் போன்றவர் வெளியேறவும் கூடாது; வெளியேற்றப்படவும் கூடாது! ஏனெனில், நீர் ஏழைகளுக்காக உழைக்கிறீர்; உறவைப் பேணுகிறீர்; (சிரமப்படு வோரின்) பாரத்தைச் சுமக்கிறீர்; விருந்தினர் களை உபசரிக்கிறீர்; சத்திய சோதனைகளில் ஆட்பட்டோருக்கு உதவுகிறீர். எனவே, நான் உமக்கு அடைக்கலம் தருகிறேன். ஆகவே, திரும்பிச் சென்று உமது ஊரிலேயே உம்முடைய இறையை வழிபடுவீராக!” எனக் கூறினார். இப்னு தஃகினா, தம்முடன் அபூபக்ர் (ரலி) அவர்களை அழைத்துக்கொண்டு குறைஷி இறைமறுப்பாளர்களின் பிரமுகர் களைச் சந்தித்தார். அவர்களிடம், ‘‘அபூபக் ரைப் போன்றவர்கள் வெளியேறவும் கூடாது; வெளியேற்றப்படவும் கூடாது. ஏழைகளுக்காக உழைக்கின்ற, உறவைப் பேணுகின்ற, விருந்தினரை உபசரிக்கின்ற, (சிரமப்படுவோரின்) பாரத்தைச் சுமக்கின்ற, சத்திய சோதனைகளில் ஆட்பட்டோருக்கு உதவுகின்ற ஒரு மனிதரையா நீங்கள் வெளியேற்றுகிறீர்கள்?” என்று கேட்டார். ஆகவே, குறைஷியர் இப்னு தஃகினா அளித்த அடைக்கலத்தை ஏற்று அபூபக்ர் (ரலி) அவர்களுக்குப் பாதுகாப்பு அளித்த னர். ஆனால், இப்னு தஃகினாவிடம், ‘‘தமது வீட்டில் தம் இறைவனைத் தொழுது வருமாறும், விரும்பியதை ஓதுமாறும், அதனால் எங்களுக்குத் தொந்தரவு இல்லாமல் பார்த்துக்கொள்ளுமாறும், அதை பகிரங்கமாகச் செய்யாதிருக்கும்படியும் அபூபக்ருக்கு நீர் கூறுவீராக! ஏனெனில், எங்களுடைய மனைவி மக்களை அவர் குழப்பிவிடுவார் என நாங்கள் அஞ்சுகிறோம்” என்றனர். இதை இப்னு தஃகினா, அபூபக்ர் (ரலி) அவர்களிடம் தெரிவித்தார். பிறகு அபூபக்ர் (ரலி) அவர்கள் தமது வீட்டுக்குள்ளேயே தம் இறையை வழிபடலானார்கள்; தமது தொழுகை, ஓதுதல் ஆகியவற்றை வீட்டுக்கு வெளியே பகிரங்கப் படுத்தவில்லை. பிறகு அபூபக்ர் (ரலி) அவர்களுக்கு ஏதோ தோன்ற, தமது வீட்டு முற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி, வெளிப் படையாக அந்த இடத்தில் தொழுது கொண்டும் குர்ஆனை ஓதிக்கொண்டும் இருக்கலானார்கள். இணைவைப்பாளர் களின் மனைவி மக்கள் திரண்டு வந்து ஆச்சரியத்துடன் அபூபக்ரைக் கவனிக்க லாயினர். அபூபக்ர் (ரலி) அவர்கள் குர்ஆன் ஓதும்போது (மனம் உருகி வெளிப்படும்) தமது கண்ணீரைக் கட்டுப்படுத்த முடியாமல் அதிகம் அழுபவ ராக இருந்தார்கள். இணைவைப்போரான குறைஷிப் பிரமுகர்களுக்கு இது கலக்கத்தை ஏற்படுத்தியது. உடனே இப்னு தஃகினாவை அழைத்து வரச் செய்தார்கள். அவர்களிடம் அவர் வந்தார். அவரிடம், ‘‘அபூபக்ர் அவர்கள், தமது வீட்டில்தான் தம் இறையை வழிபடவேண்டும் என்ற அடிப்படை யிலேயே நாங்கள் அவருக்குப் பாதுகாப்ப ளித்திருந்தோம். அவர் அதை மீறித் தமது வீட்டின் முற்றத்தில் தொழுமிடத்தை உருவாக்கி, பகிரங்கமாக தொழவும் ஓதவும் தொடங்கிவிட்டார். அவர் எங்கள் மனைவி மக்களைக் குழப்பிவிடுவார் என நாங்கள் அஞ்சுகிறோம். எனவே, அவர் தம் இறைவனைத் தமது வீட்டில் மட்டும் வழிபடுவதாக இருந்தால் செய்யட்டும்; அதை அவர் மறுத்து, பகிரங்கமாகத்தான் செய்வேன் என்று அவர் கூறினால், நீர் கொடுத்த அடைக்கலத்தைத் திரும்பத் தருமாறு அவரிடம் கோரும்! ஏனெனில், உம்மிடம் செய்த ஒப்பந்தத்தை முறிக்கவும் நாங்கள் விரும்பவில்லை; அதே சமயம் அபூபக்ர் பகிரங்கமாகச் செயல்படுவதை நாங்கள் ஏற்றுக்கொள்ளவும் (தயாராக) இல்லை” என்று குறைஷியர் கூறினர். உடனே இப்னு தஃகினா, அபூபக்ர் (ரலி) அவர்களிடம் வந்து, ‘‘எந்த அடிப்படையில் உம்மிடம் நான் ஒப்பந்தம் செய்தேன் என்பதை நீர் அறிவீர். எனவே, நீர் அதன்படி மட்டுமே நடக்க வேண்டும். இல்லையென்றால் எனது அடைக்கலத்தை என்னிடமே திருப்பித் தந்துவிட வேண்டும். ஒரு மனிதரிடம் இப்னு தஃகினா செய்த உடன்படிக்கை முறிக்கப்பட்டது என்று (பிற்காலத்தில்) அரபியர் கேள்விப்படுவதை நான் விரும்பமாட்டேன்” எனக் கூறினார். அதற்கு அபூபக்ர் (ரலி) அவர்கள் ‘‘உமது அடைக்கலத்தை உம்மிடமே நான் திரும்பத் தந்துவிடுகிறேன். அல்லாஹ்வின் அடைக்கலத்தில் நான் திருப்புதியுறுகிறேன்” என்று கூறினார்கள். அப்போது அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் மக்காவில் இருந்தார்கள். ‘‘நீங்கள் புலம்பெயர்ந்து செல்லும் நாடு எனக்குக் காட்டப்பட்டது. அது இரு கருங்கல் மலைகளுக்கிடையே பேரீச்ச மரங்கள் நிறைந்த உவர் நிலமாகும். அந்த இருமலைகள்தான் (மதீனாவின்) இரு கருங்கல் பூமிகளாகும்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். இவ்வாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியபோது மதீனாவை நோக்கிப் புலம்பெயர்ந்து சென்றவர்கள் சென்றார்கள். அபிசீனியாவுக்குப் புலம் பெயர்ந்தவர்களில் சிலர் மதீனாவுக்குத் திரும்பி வந்தனர். அபூபக்ர் (ரலி) அவர்கள் புலம்பெயரத் தயாரானபோது, அவர்களிடம், ‘‘சற்றுப் பொறுப்பீராக! எனக்கு அனுமதி அளிக்கப்படுவதை நான் எதிர்பார்க்கிறேன்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அபூபக்ர் (ரலி) அவர்கள், ‘‘என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும்! நீங்கள் அனுமதியைத்தான் எதிர்பார்க்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘ஆம்!” என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சேர்ந்து செல்வதற்காகவே அபூபக்ர் (ரலி) அவர்கள் தமது பயணத்தை நிறுத்திவைத்தார்கள். தம்மிடமிருந்த இரண்டு ஊர்தி ஒட்டகங்களுக்கும் கருவேல மரத்திலிருந்த இலைகளை நான்கு மாதங்கள் தீனியாகப் போட்டு (வளர்த்து)வந்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 39",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		}
	]
}