{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"4": "Ablutions (Wudu')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 240,
			"arabicnumber": 240,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: (ஒரு நாள்) நபி (ஸல்) அவர்கள் இறையில்லம் (கஅபா) அருகில் தொழுது கொண்டிருந்தார்கள். அப்போது அபூ ஜஹ்லும் அவனுடைய சகாக்களும் (அங்கே) அமர்ந்திருந்தனர். அவர்களில் சிலர் சிலரிடம், “இறைச்சிக்காக அறுக்கப் பட்ட இன்ன குடும்பத்தாரின் ஒட்டகக் கருவைச் சுற்றியுள்ள சவ்வைக் கொண்டு வந்து முஹம்மத் சிரவணக்கம் (சஜ்தா) செய்யும்போது அவரது முதுகின் மீது வைப்பவர் யார்?” என்று கேட்டனர். அக்கூட்டத்திலேயே படுபாதகனாயிருந்த ஒருவன் புறப்பட்டுச் சென்று, அதைக் கொண்டு வந்து, நபி (ஸல்) அவர்கள் சிரவணக்கம் (சஜ்தா) செய்யும் நேரம் பார்த்து அவர்களின் இரு தோள்களுக்கிடையில் முதுகின் மீது போட்டான். இதையெல்லாம் நான் பார்த்துக்கொண்டுதான் இருந்தேன். என்னால் எதுவும் செய்ய முடியவில்லை. அப்போது எனக்கு (மட்டும்) உதவக் கூடியவர்கள் இருந்திருந்தால் (அதை நான் தடுத்திருப்பேன்.) இந்நிகழ்ச்சியைப் பார்த்துக்கொண்டி ருந்த (அபூஜஹ்லும் சகாக்களும்) ஒருவர்மீது ஒருவர் விழுந்து சிரிக்கத் தொடங்கினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தலையை உயர்த்தாமல் சஜ்தாவிலேயே இருந்தார்கள். (நபி (ஸல்) அவர்களின் புதல்வி, சிறுமி) ஃபாத்திமா (ரலி) அவர்கள் வந்து, அவர்களின் முதுகி-ருந்து அவற்றைத் தூக்கி வீசும் வரையில் (அப்படியே இருந்தார்கள்). பிறகு தமது தலையை உயர்த்தி, “இறைவா! குறைஷியரை நீ கவனித்துக் கொள்” என்று மூன்று முறை பிராத்தித் தார்கள். தங்களுக்கெதிராக நபி (ஸல்) அவர்கள் பிராத்தனை புரிந்தது குறைஷி யருக்கு மனவேதனை அளித்தது. (காரணம்,) அந்த (மக்கா) நகரில் செய்யப் படும் பிராத்தனை ஏற்கப்படும் என்று அவர்களும் நம்பிக்கை வைத்திருந்தனர். பிறகு நபி (ஸல்) அவர்கள் (அங்கிருந் தோரின்) பெயர்களைக் குறிப்பிட்டு, “இறைவா! அபூஜஹ்லை நீ கவனித்துக் கொள்வாயாக! உத்பா பின் ரபீஆ, ஷைபா பின் ரபீஆ, வலீத் பின் உத்பா, உமய்யா பின் கலஃப், உக்பா பின் அபீமுஐத் ஆகியோரைக் கவனித்துக்கொள்வாயாக!” என்று (அறுவரின் பெயர் குறிப்பிட்டு) பிரார்த்தனை செய்தார்கள். அறிவிப்பாளர்களில் ஒருவர் குறிப்பிடுகிறார்: ஏழாவது நபரின் பெயரையும் நபி (ஸல்) அவர்கள் குறிப்பிட்டார்கள். ஆனால், அதை நாங்கள் மறந்துவிட்டோம். தொடர்ந்து அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறினார்கள்: என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குறிப்பிட்ட நபர்கள் (பத்ர் போரில்) கொல்லப்பட்டு ‘கலீபு பத்ர்’ எனும் அந்தப் பாழும் கிணற்றில் கிடந்ததை நான் பார்த்தேன். அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 106
			}
		}
	]
}