{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"45": "Lost Things Picked up by Someone (Luqatah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ் தன் தூதர் (ஸல்) அவர்களுக்கு மக்கா நகர வெற்றியை அளித்த போது அவர்கள் மக்கள் மத்தியில் நின்று அல்லாஹ்வைப் போற்றிப் புகழ்ந்துவிட்டு, ‘‘அல்லாஹ் மக்காவை (துவம்சம் செய் வதை)விட்டு யானை(ப் படை)யைத் தடுத் தான். அதன்மீது (தற்போது) தன் தூதருக்கும் (எனக்கும்) இறைநம்பிக்கை யாளர்களுக்கும் அதிகாரம் வழங்கியுள் ளான். இந்த மக்கா நகரில் எனக்கு முன்பு எவருக்கும் போரிடுவதற்கு அனுமதியளிக்கப்பட்டதில்லை. எனக்கும்கூட (இதில் போரிடுவதற்கு) பகலின் ஒரு சிறிது நேரத்தில் மட்டுமே அனுமதி வழங்கப்பட்டது. எனக்குப் பின்பும் அது எவருக்கும் அனுமதிக்கப்படவில்லை. இந்நகரின் வேட்டைப் பிராணிகள் விரட்டப்படக் கூடாது. இதன் முட்கள் பிடுங்கப்படக் கூடாது. இதில் கீழே விழுந்து கிடக்கும் பொருளை (எடுத்து வைத்துக்கொள்வது) அதை அறிவிப்புச் செய்பவருக்குத் தவிர வேறெவருக்கும் அனுமதிக்கப்படாது. எவருடைய உறவினர் கொல்லப்பட்டாரோ அவர் இரண்டு விஷயங்களில் சிறந்ததைத் தேர்ந்தெடுத்துக் கொள்ளலாம். ஒன்று, அவர் இழப்பீடு பெற்றுக்கொள்ளலாம்; அல்லது அதற்காகப் பழிவாங்கிக்கொள்ளலாம்” என்று கூறி னார்கள். அப்பாஸ் (ரலி) அவர்கள், ‘‘இத்கிர் புல்லைத் தவிரவா? ஏனெனில், அதை நாங்கள் எங்கள் அடக்கத் தலங்களுக்கும் வீடுகளுக்கும் பயன்படுத்துகிறோம்” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், யிஇத்கிர் புல்லைத் தவிர’ என்று கூறினார்கள். அப்போது யமன்வாசிகளில் ஒருவரான அபூஷாஹ் (ரலி) என்பவர் எழுந்து, ‘‘அல்லாஹ்வின் தூதரே! (இதை) எனக்கு எழுதிக்கொடுங்கள்” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அபூஷாஹுக்கு எழுதிக்கொடுங்கள்” என்று உத்தரவிட்டார்கள். (அறிவிப்பாளர்களில் ஒருவரான வலீத் பின் முஸ்லிம் (ரஹ்) அவர்கள் கூறுகிறார்:) நான் அவ்ஸாயீ (ரஹ்) அவர்களிடம், ‘‘ ‘அல்லாஹ்வின் தூதரே! எனக்கு எழுதிக்கொடுங்கள்’ என்னும் அபூஷாஹ் (ரலி) அவர்களுடைய சொல் எதைக் குறிக்கிறது?” என்று கேட்டேன். அதற்கு அவர்கள், ‘‘அல்லாஹ்வின் தூதரிடமிருந்து அவர் கேட்ட இந்த உரையைத்தான் (எழுதிக்கொடுக்கச் சொன்னார்)” என்று பதிலளித்தார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		}
	]
}