{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"47": "Partnership"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம், ‘‘அநாதை(ப் பெண்)களிடம் நேர்மையாக நடக்க இயலாது என்று நீங்கள் அஞ்சினால், உங்களுக்கு விருப்பமான பெண்களை இரண்டிரண்டாக, மும்மூன்றாக, நான்கு நான்காக மணந்துகொள்ளுங்கள்” (4:3) எனும் இறைவசனம் குறித்துக் கேட்டேன். அதற்கு அவர்கள் பின்வருமாறு விளக்கமளித்தார்கள்: என் சகோதரி (அஸ்மாவின்) மகனே! இந்த (வசனத்தில் கூறப்பட்டுள்ள) பெண், தன் காப்பாளரின் (வலீயின்) மடியில் (பொறுப்பில்) வளர்கின்ற அநாதைப் பெண் ஆவாள். அவருடைய செல்வத்தில் அவளும் பங்காளியாக இருப்பாள். இந்நிலையில் அவளுடைய செல்வத்தாலும் அழகாலும் கவரப்பட்டு, அவளுடைய காப்பாளர் அவளது மணக்கொடை விஷயத்தில் நீதியுடன் நடக்காமல், மற்றவர்கள் அவளுக்குக் கொடுப்பதைப் போன்ற மஹ்ரை அவளுக்குக் கொடுக் காமல் அவளை மணமுடித்துக்கொள்ள விரும்புவார். இவ்விதம் காப்பாளர்கள் தம் பொறுப்பி லிருக்கும் அநாதைப் பெண்களை அவர்களுக்கு நீதி செலுத்தாமல், அவர்களைப் போன்ற பெண்களுக்குக் கொடுக்கப்படும் மஹ்ரில் மிக உயர்ந்த மஹ்ர் எதுவோ அதை அவர்களுக்குக் கொடுக்காமல் அவர்களை மணமுடித்துக்கொள்ள அவர்களுக்கு (இந்த இறைவசனத்தின் வாயிலாக) தடை விதிக்கப்பட்டது. அந்தப் பெண்களைத் தவிரவுள்ள மற்றப் பெண்களில் அவர்களுக்கு விருப்பமான பெண்களை மணமுடித்துக்கொள்ளும்படி அவர்களுக்குக் கட்டளையிடப்பட்டது. இந்த இறைவசனம் அருளப்பட்ட பின்பும் மக்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தீர்ப்புக் கேட்டு வரலாயினர். ஆகவே அல்லாஹ், ‘‘(நபியே!) பெண்கள் தொடர்பாக அவர்கள் உம்மிடம் தீர்ப்பு கோருகின்றனர். நீர் கூறுவீராக: அவர்கள் குறித்து அல்லாஹ் உங்களுக்குத் தீர்ப்பு வழங்குகின்றான். மேலும், அநாதைப் பெண்களுக்கு நிர்ணயிக்கப்பட்டதை அவர்களுக்கு நீங்கள் வழங்காமலேயே அவர்களை நீங்கள் மணந்துகொள்ள விரும்புவது பற்றியும், பலவீனமான சிறுவர்கள் பற்றியும் (இவ்)வேதத்தில் உங்களுக்கு ஓதிக் காட்டப்படுகின்ற வசனமும் (உங்களுக்குத் தீர்ப்பு வழங்குகின்றது)” (4:127) எனும் வசனத்தை அருளினான். யிஇவ்வேதத்தில் (ஏற்கெனவே) உங்களுக்கு ஓதிக்காட்டப்படுகின்ற வசனம்’ என்று அல்லாஹ் குறிப்பிட்டிருப்பது, ‘‘அநாதை(ப் பெண்)களுடன் நீதியுடன் நடக்க இயலாது என்று நீங்கள் அஞ்சி னால்...” எனும் (4:3) வசனத்தையே குறிக்கிறது. ‘அவர்களை நீங்கள் மணந்துகொள்ள விரும்புவது’ (4:127) எனும் பிந்திய வசனத்தின் தொடர், உங்களில் ஒரு காப்பாளர் தமது பராமரிப்பில் இருக்கும் அநாதைப் பெண் ஒருத்தியை, அவள் செல்வமும் அழகும் குறைந்தவளாக இருக்கும்போது விரும்பாமலிருப்பதைக் குறிக்கும். (செல்வத்தில் குறைந்தவர்களாக இருக்கும்போது) அந்த (அநாதை)ப் பெண்களை மணமுடித்துக்கொள்ள அவர்கள் விரும்பாமலிருந்த காரணத்தால், அவர்கள் எந்த அநாதைப் பெண்களின் செல்வத்திற்கும் அழகுக்கும் ஆசைப்பட்டார்களோ அந்தப் பெண்களையும் ‘நீதியான முறையில் தவிர மணமுடித்துக் கொள்ளலாகாது’ என்று அவர்களுக்குத் தடை விதிக்கப்பட்டது.8 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 47",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		}
	]
}