{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"51": "Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர் களின் துணைவியரான நாங்கள் இரு குழுக்களாக இருந்தோம். ஒரு குழுவில் நானும் ஹஃப்ஸா, ஸஃபிய்யா, சவ்தா (ரலி) ஆகியோரும் இருந்தோம். மற்றொரு குழுவில் உம்மு சலமா (ரலி) அவர்களும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் மற்ற துணைவியரும் இருந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை எவ்வளவு (ஆழமாக) நேசித்துவந்தார்கள் என்பதை முஸ்லிம்கள் அறிந்திருந்தார்கள். ஆகவே, அவர்களில் ஒருவரிடம் அன்பளிப்புப் பொருள் இருந்து, அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அன்பளிப்புச் செய்ய அவர் விரும்பினால், அதைத் தள்ளிப்போட்டுவிடுவார். என் வீட்டில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தங்கும் நாள்) வரும்போது, என் வீட்டிற்கு அன்பளிப்பைக் கொடுத்தனுப்புவார். ஆகவே, (இது தொடர்பாக) உம்மு சலமா (ரலி) குழுவினர் (தங்களிடையே கலந்து) பேசி, உம்மு சலமாவிடம் பின் வருமாறு கூறினர்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு யார் எந்த அன்பளிப்பை வழங்க விரும்பினாலும், அவர்கள் தம் துணைவியர் இல்லங்களில் எங்கு இருந்தாலும் அங்கே அன்பளிப்பை வழங்க வேண்டும் என மக்களிடம் பேசி அறிவிக்க வேண்டும் என்று அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் பேசுங் கள். அவ்வாறே, உம்மு சலமா (ரலி) அவர்களும் நபி (ஸல்) அவர்களிடம் தம் குழுவினர் கூறியதை எடுத்துச் சொன்னார் கள். அவருக்கு நபி (ஸல்) அவர்கள் எந்தப் பதிலும் கூறவில்லை. பிறகு, உம்மு சலமா (ரலி) அவர்களின் குழுவினர் உம்மு சலமா அவர்களிடம், (யிநமது கோரிக்கையை நபி (ஸல்) அவர்கள் ஏற்றுக்கொண்டார்களா?› என்று) கேட்டனர். உம்மு சலமா (ரலி) அவர்கள், ‘‘எனக்கு நபி (ஸல்) அவர்கள் எந்தப் பதிலும் கூறவில்லை” என்று சொன்னார்கள். அதற்கு அவருடைய குழுவினர், ‘‘மீண்டும் நபி (ஸல்) அவர்களிடம் (இது பற்றிப்) பேசுங்கள்” என்றனர். உம்மு சலமா (ரலி) அவர்களும் அடுத்து தமது முறை வந்தபோது நபி (ஸல்) அவர்களிடம் அது குறித்துப் பேசினார்கள். அப்போதும் அவர்களுக்கு நபி (ஸல்) அவர்கள் பதில் எதுவும் கூறவில்லை. உம்மு சலமா (ரலி) அவர்களின் குழுவினர், (நபி (ஸல்) அவர்கள் என்ன பதில் சொன்னார்கள் என்று) உம்மு சலமாவிடம் கேட்டனர். ‘‘நபி (ஸல்) அவர்கள் எனக்குப் பதில் எதுவும் கூறவில்லை” என்று உம்மு சலமா (ரலி) அவர்கள் கூறினார்கள். அதற்கு அவருடைய குழுவினர், ‘‘நபியவர்கள் உமக்குப் பதில் தரும்வரை நீங்கள் அவர்களிடம் (இது குறித்துப்) பேசிக்கொண்டேயிருங்கள்” என்று கூறினார்கள். மீண்டும் உம்மு சலமா (அவர்களின் முறை வந்தபோது) அவர்களிடம் நபி (ஸல்) அவர்கள் வந்தார்கள். உம்மு சலமா (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம், ‘‘மீண்டும் (இது குறித்துப்) பேசினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘ஆயிஷாவின் விஷயத்தில் எனக்கு மனவேதனை அளிக்காதே! ஏனெனில், ஆயிஷாவைத் தவிர வேறு யாருடைய (போர்வைத்) துணிக்குள் நான் இருக்கும்போதும் எனக்கு வேத அறிவிப்பு (வஹீ) வருவதில்லை” என்று கூறினார்கள். உம்மு சலமா (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! உங்களுக்குத் துன்பம் தந்ததற்காக அல்லாஹ்விடம் நான் பாவமன்னிப்புக் கோருகிறேன்” என்று கூறினார்கள். பிறகு அந்தத் துணைவியர் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களின் புதல்வியார் ஃபாத்திமா (ரலி) அவர்களை அழைத்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுப்பிவைத்தார்கள். ஃபாத்திமா (தம் தந்தையிடம்), ‘‘நீங்கள் அபூபக்ர் (ரலி) அவர்களின் புதல்வி (ஆயிஷா) இடம் நடந்துகொள்வதைப் போன்றே (தங்களிட மும்) நீதியோடு நடந்துகொள்ள வேண்டும் என்று உங்கள் துணைவியர் அல்லாஹ்வின் பெயரால் வேண்டுகின்றனர்” என்று சொன்னார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘என் அன்பு மகளே! நான் நேசிப்பதை நீயும் நேசிப்பாய் அல்லவா?” என்று கேட்டார்கள். அதற்கு அவர்கள், ‘‘ஆம் (தாங்கள் நேசிப்பதை நானும் நேசிக்கிறேன்)” என்று கூறிவிட்டுத் திரும்பிச் சென்று நபியவர்களின் துணைவியரிடம் தகவல் தெரிவித்தார்கள். அதற்கு அவர்கள், ‘‘நபி (ஸல்) அவர்களிடம் மறுபடியும் போ(ய்ச் சொல்)” என்று கூறினார்கள். மீண்டும் (இது தொடர்பாக நபி (ஸல்) அவர்களிடம்) செல்ல ஃபாத்திமா (ரலி) அவர்கள் மறுத்துவிட்டார்கள். ஆகவே, நபியவர்களின் துணைவியர், (தம் சார்பாக) ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்களை அனுப்பிவைத்தார்கள். அவர் நபி (ஸல்) அவர்களிடம் வந்து, (சற்று) கடுமையாகப் பேசி, ‘‘உங்கள் துணைவியர், அபூகுஹாஃபாவின் மகனுடைய (அபூபக்ருடைய) மகளின் (ஆயிஷாவின்) விஷயத்தில் (நடந்துகொள்வதைப் போன்றே பிற மனைவிமார்களிடமும்) நீதியுடன் நடந்துகொள்ளும்படி அல்லாஹ் வின் பெயரால் உங்களிடம் கேட்கின்றனர்” என்று கூறினார். (ஆயிஷா (ரலி) அவர்கள் கூறு கிறார்கள்:) அப்போது அவரது குரல் உயர்ந்தது. நான் (அங்குதான்) அமர்ந்திருந்தேன். என்னையும் (ஒரு பிடி) பிடித்தார்; என்னை ஏசினார். நான் ஏதும் (பதிலுக்குப்) பேசு கிறேனா என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், என்னையே பார்த்துக் கொண்டிருந்தார்கள். அப்போது நான் ஸைனபுக்குப் பதில் சொல்லி, இறுதியில் அவரை வாயடைக்கச் செய்துவிட்டேன். நபி (ஸல்) அவர்கள் என்னைப் பார்த்து, ‘‘இவள் அபூபக்ருடைய மகள்” என்று கூறினார்கள். புகாரீ (ஆகிய நான்) கூறுகிறேன்: ஃபாத்திமா (ரலி) அவர்கள் தொடர்பான தகவல் மற்றோர் அறிவிப்பாளர்தொடரிலும் வந்துள்ளது. மற்றோர் அறிவிப்பில், ‘‘நான் நபி (ஸல்) அவர்களிடம் இருந்தபோது, ஃபாத்திமா (ரலி) அவர்கள் அனுமதி கேட்டு உள்ளே வந்தார்” என்று ஆயிஷா (ரலி) அவர்கள் கூறியுள்ளார்கள். அத்தியாயம் : 50",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		}
	]
}