{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"53": "Peacemaking"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "ஹசன் அல்பஸ்ரீ (ரஹ்) அவர்கள் கூறியதாவது: அலீ (ரலி) அவர்களின் மகனான ஹசன் (ரலி) அவர்கள்,8 மலைகள் போன்ற (பிரமாண்டமான) படைகளுடன் முஆவியா (ரலி) அவர்களை எதிர்கொண்டார்கள். (அவற்றைக் கண்ட முஆவியா (ரலி) அவர்களின் ஆலோசகர்) அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள், ‘‘நான் பெரும் படைகளைக் காண்கிறேன். அவை தமக்கொத்த படையை வீழ்த்தாமல் திரும்பாது” என்று (போர் புரிவதைத் தூண்டும் வகையில்) கூறினார்கள். அவருக்கு முஆவியா (ரலி) அவர்கள் லிஅல்லாஹ்வின் மீதாணையாக! (அம்ர், முஆவியா ஆகிய) அவ்விருவரில் முஆவியாவே, சிறந்தவராக இருந்தார்லி ‘‘அம்ரே! இவர்கள் அவர்களையும் அவர்கள் இவர்களையும் கொன்றுவிடுவார் களாயின் மக்களின் நிர்வாகத்திற்குப் பொறுப்பேற்க என்னிடம் வேறு யார் இருப்பார்கள்? (என் குடி)மக்களின் பெண்களைப் பாதுகாக்க என்னிடம் (வேறு) யார் இருப்பார்கள்? அவர்களின் சொத்துகளைப் பாதுகாக்க என்னிடம் (வேறு) யார்தான் இருப்பார்கள்?” என்று கேட்டார்கள். எனவே, ஹசன் (ரலி) அவர்களிடம் குறைஷியரில் பனூ அப்தி ஷம்ஸ் கிளையைச் சேர்ந்த அப்துர் ரஹ்மான் பின் சமுரா (ரலி) அவர்களையும், அப்துல்லாஹ் பின் ஆமிர் பின் குரைஸ் (ரலி) அவர்களையும் அனுப்பி, ‘‘நீங்கள் இருவரும் இந்த மனிதரிடம் (ஹசனிடம்) சென்று விவரத்தை எடுத்துரைத்துப் பேசி, அவரிடம் (சமாதான ஒப்பந்தம் செய்து கொள்ளும்படி) கோருங்கள்” என்று கூறினார்கள். அவ்விருவரும் (அவ்வாறே) ஹசன் (ரலி) அவர்களிடம் சென்று, அவர்களின் அறைக்குள் நுழைந்து பேசினார்கள்; ஹசன் (ரலி) அவர்களிடம் (முஆவியா (ரலி) அவர்களின் தூதை எடுத்துச்) சொல்லி (அமைதி ஒப்பந்தம் செய்துகொள்ள முன்வரும்படி) கோரினார்கள். அதற்கு அவ்விருவரிடமும் ஹசன் (ரலி) அவர்கள், ‘‘நாங்கள் அப்துல் முத்தலிபின் மக்கள்; இந்தச் செல்வத்தை (எங்கள் தலைமையின் காரணத்தால்) பெற்றிருக்கிறோம். (அதை எங்கள் குடிமக்கள், படைவீரர்கள் மற்றும் ஆதரவாளர் களிடையே செலவு செய்துவருகிறோம்.) இந்தச் சமுதாயமோ தன் இரத்தத்தைச் சிந்துவதில் தீவிரமாகிவிட்டது (பொருளின்றி அதைத் தடுக்க முடியாது)” என்று கூறினார்கள். இதற்கு அவ்விருவரும், ‘‘முஆவியா (ரலி) அவர்கள் உங்களுக்கு இவ்வளவு (மானியம்) தருவதாகக் கூறுகிறார்கள்; (சமாதான ஒப்பந்தம் செய்துகொள்ளும்படி) உங்களிடம் கோருகிறார்கள்” என்று கூறினர். அதற்கு ஹசன் (ரலி) அவர்கள், ‘‘இந்த விஷயத்தில் எனக்குப் பொறுப்பு யார்?” என்று கேட்க, அவ்விருவரும் ‘‘இதில் உங்களுக்கு நாங்கள் பொறுப்பு” என்று கூறினர். ஹசன் (ரலி) அவர்கள் கேட்ட ஒவ்வொரு கேள்விக்கும் அவர்கள், ‘‘நாங்கள் உங்களிடம் இதற்குப் பொறுப் பேற்கிறோம்” என்றே அவ்விருவரும் கூறினார்கள். இறுதியாக, ஹசன் (ரலி) அவர்கள், முஆவியா (ரலி) அவர்களுடன் சமாதான ஒப்பந்தம் செய்துகொண் டார்கள். அபூபக்ரா (ரலி) அவர்கள் பின்வருமாறு சொல்ல நான் கேட்டேன்: மேலும், (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொற்பொழிவு மேடைமீதிருக்க, அவர்களின் ஒரு பக்கத் தில் ஹசன் பின் அலீ (ரலி) அவர்கள் அமர்ந்திருக்க, நபி (ஸல்) அவர்கள் ஒருமுறை மக்களை நோக்கியும், மற்றொரு முறை ஹசன் (ரலி) அவர்களை நோக்கியும் (உரை நிகழ்த்திய வண்ணம்), ‘‘இந்த என் (புதல்வியின்) புதல்வர் தலைவர் ஆவார். முஸ்லிம்களின் இரு பெரும் கூட்டத்தாரிடையே இவர் மூலமாக அல்லாஹ் சமாதானம் செய்துவைக்கவிருக் கிறான்” என்று கூறிக்கொண்டிருந்ததை நான் பார்த்தேன். அபூஅப்தில்லாஹ் (புகாரீ ஆகிய நான்) கூறுகிறேன்: அபூபக்ரா (ரலி) அவர்களிடம் ஹசன் அல்பஸ்ரீ (ரஹ்) அவர்கள் (நேரடியாகக்) கேட்ட செய்தி இந்த ஹதீஸின் மூலம்தான் நமக்கு உறுதியானது என அலீ பின் அப்தில்லாஹ் அல்மதீனீ (ரஹ்) அவர்கள் என்னிடம் கூறினார்கள். அத்தியாயம் : 53",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		}
	]
}