{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2711,
			"arabicnumber": 2711,
			"text": "மர்வான் பின் அல்ஹகம் அவர்களும் மிஸ்வர் பின் மக்ரமா (ரலி) அவர்களும் நபித்தோழர்களிடமிருந்து அறிவித்ததாவது: சுஹைல் பின் அம்ர் அவர்கள்2 அந்த (ஹுதைபியா உடன்படிக்கையின்) நாளில் ஒப்பந்தப் பத்திரம் எழுதியபோது அவர் நபி (ஸல்) அவர்களுக்கு விதித்த நிபந்தனைகளில், ‘‘எங்களிலிருந்து (மக்காவாசிகளிலிருந்து) ஒருவர் உம்மிடம் வந்தால்லிஅவர் உமது மார்க்கத்திலிருப்ப வராயினும் சரி லி அவரைத் திருப்பியனுப்பி விட வேண்டும்; எங்களுக்கும் அவருக்கு மிடையே நீர் ஒரு தடையாக இராமல் எங்களிடம் (முழுமையாக) அவரை ஒப்படைத்துவிட வேண்டும்” என்பதும் ஒன்றாக இருந்தது. இதை முஸ்லிம்கள் வெறுத்தார்கள்; இதைக் கண்டு கோபமடைந்தார்கள். ஆனால், இந்த நிபந்தனையை ஏற்றாலன்றி (சமாதான ஒப்பந்தத்தை எழுத) முடியாது என்று சுஹைல் (தீர்மானமாக) மறுத்து விட்டார். நபி (ஸல்) அவர்கள் அதன் படியே ஒப்பந்தத்தை அவரிடம் எழுதி வாங்கினார்கள். ஆகவே, அன்றே அபூஜந்தல் (ரலி) அவர்களை அவருடைய தந்தை சுஹைல் பின் அம்ரிடம் திருப்பி யனுப்பிவிட்டார்கள். அந்த (ஒப்பந்தத்தின்) காலகட்டத்தில் தம்மிடம் (அபயம் தேடி) வந்த ஆண்கள் எவரையும் திருப்பி யனுப்பாமல் நபி (ஸல்) அவர்கள் இருந்ததில்லை; அவர் முஸ்லிமாக இருந்தாலும் சரி. (அவரையும் மக்காவிற்குத் திருப்பியனுப்பிவிடுவார்கள்.) முஸ்லிம் பெண்கள் சிலர் புலம்பெயர்ந்து (மதீனா) வந்தார்கள். அன்று (இணைவைப்பாளர்களின் தலைவன்) உக்பா பின் அபீமுஐத்தின் மகள் உம்மு குல்ஸூம் (ரலி) அவர்களும் நபி (ஸல்) அவர்களிடம் (அபயம் தேடி) வந்த பெண்களில் ஒருவராவார். அப்போது அவர்கள் இளம் பெண்ணாக இருந்தார்கள். ஆகவே, அவரது வீட்டார் நபி (ஸல்) அவர்களிடம் அவரைத் தங்களிடம் திருப்பி யனுப்பக் கோரினார்கள். ஆனால், நபி (ஸல்) அவர்கள் அப்பெண்ணை அவர்களிடம் திருப்பியனுப்பவில்லை. அவர்கள் விஷயத்தில் அல்லாஹ், ‘‘இறைநம்பிக்கை கொண்ட பெண்கள் புலம்பெயர்ந்து உங்களிடம் வந்தால் (அவர்கள் இறைநம்பிக்கையாளர்களா என்பதைச்) சோதித்துப்பாருங்கள். அவர் களது இறைநம்பிக்கையை(க் குறித்து) அல்லாஹ்வே நன்கறிந்தவன் ஆவான். அவர்கள் இறைநம்பிக்கையுடையவர்கள் தான் என்று நீங்கள் கருதினால் அவர் களை இறைமறுப்பாளர்களிடம் திருப்பி யனுப்பாதீர்கள். அப்பெண்கள் அவர்களுக்கு (இறைமறுப்பாளர்களான அந்த ஆண்களுக்கு) அனுமதிக்கப்பட்டவர்கள் அல்லர்; அந்த ஆண்களும் அப்பெண் களுக்கு அனுமதிக்கப்பட்டவர்களல்லர்” (60:10) எனும் வசனத்தை அருளியிருந்ததே (அவர்களைத் திருப்பியனுப்பாததற்குக்) காரணமாகும். அத்தியாயம் : 54",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}