{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"55": "Wills and Testaments (Wasaayaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: ‘‘நீங்கள் விரும்புகின்ற (செல்வத்) திலிருந்து தானம் செய்யாத வரை நீங்கள் ஒருபோதும் (நிறைவான) பலனை அடைந்துகொள்ளமாட்டீர்கள்” (3:92) எனும் இறைவசனம் அருளப்பட்டபோது அபூதல்ஹா (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, ‘‘அல்லாஹ்வின் தூதரே! அல்லாஹ் தன் வேதத்தில், ‘நீங்கள் விரும்புகின்ற (செல்வத்)திலிருந்து தானம் செய்யாத வரை நீங்கள் ஒருபோதும் (நிறைவான) பலனை அடைந்துகொள்ளமாட்டீர்கள்’ என்று கூறுகின்றான். என் செல்வங்களிலேயே எனக்கு மிகவும் விருப்பமானது யிபைருஹா’ (எனும் தோட்டம்)தான். லிஅந்தத் தோட்டத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சென்று நிழலில் ஓய்வெடுத்து அதன் தண்ணீரை அருந்துவது வழக்கம்லி ஆகவே, அதை நான் அல்லாஹ்வுக்காக வும் அவனுடைய தூதருக்காகவும் (அறக்கொடையாகத்) தந்துவிடுகிறேன். (மறுமையில்) அதன் நன்மையையும் (மறுமை வாழ்வுக்கான) என் சேமிப்பாக அது இருப்பதையும் நான் விரும்புகிறேன். ஆகவே, அல்லாஹ்வின் தூதரே! தங்களுக்கு அல்லாஹ் காட்டியுள்ள இனத் தில் அதைத் தாங்கள் பயன்படுத்திக் கொள்ளுங்கள்” என்று கூறினார். இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘மிகவும் நல்லது, அபூ தல்ஹாவே! அது (மறுமையில் உங்களுக்கு) இலாபம் தரும் செல்வமாகும். அதை உங்களிடமிருந்து ஏற்று உங்களிடமே திருப்பித் தருகின்றோம். உங்கள் நெருங் கிய உறவினர்களிடையே அதைப் பங்கிட்டுவிடுங்கள்” என்று கூறினார்கள். அபூதல்ஹா (ரலி) அவர்கள் அதைத் தம் இரத்த சொந்தமுள்ள உறவினர் களுக்குத் தர்மம் செய்துவிட்டார்கள். அவர்களிடையே உபை பின் கஅப் (ரலி) அவர்களும், ஹஸ்ஸான் பின் ஸாபித் (ரலி) அவர்களும்கூட இருந்தனர். அதில் தமக்குக் கிடைத்த பங்கை ஹஸ்ஸான் (ரலி) அவர்கள் முஆவியா (ரலி) அவர்களுக்கு விற்றுவிட்டார்கள். அப்போது அவர்களிடம், ‘‘அபூதல்ஹாவின் தர்மத்தையா விற்கின்றீர்?” என்று கேட்கப்பட்டது. அதற்கு அவர்கள், ‘‘ஒரு ஸாஉ பேரீச்சம்பழத்தை ஒரு ஸாஉ திர்ஹத்துக்காக நான் விற்கமாட்டேனா? (அது போலத்தான் இதுவும்)” என்று பதில் சொன்னார்கள்.18 அந்த (பைருஹா) தோட்டம் முஆவியா (ரலி) அவர்கள் கட்டிய பனூ ஹுதைலா கோட்டை இருந்த இடத்தில் அமைந் திருந்தது.19 அத்தியாயம் : 55",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		}
	]
}