{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"55": "Wills and Testaments (Wasaayaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: என் தந்தை உஹுத் போரின்போது கொல்லப்பட்டுவிட்டார்கள். அவர்கள் ஆறு பெண் மக்களை விட்டுச்சென்றார்கள். தம்மீது கடனையும் விட்டுச்சென்றார்கள். பேரீச்சம் பழங்களைப் பறிக்கும் காலம் வந்தபோது, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, ‘‘அல்லாஹ் வின் தூதரே! என் தந்தை உஹுத் போரின்போது கொல்லப்பட்டுவிட்டதையும் தம்மீது நிறையக் கடன்களை விட்டுச் சென்றிருப்பதையும் தாங்கள் அறிவீர்கள். கடன்காரர்கள் தங்களைப் பார்க்க வேண்டுமென்று நான் விரும்புகிறேன்” என்று கூறினேன். நபி (ஸல்) அவர்கள், ‘‘நீ போய், ஒவ்வொரு (வகைப்) பேரீச்சம் பழத்தையும் களத்தில் அதனதன் இடத்தில் குவித்து வை” என்று கூறினார்கள். நான் அவ்வாறே செய்தேன்; பிறகு நபியவர்களை அழைத்தேன். கடன்காரர்கள் நபி (ஸல்) அவர்களைக் கண்டவுடன் அந்த நேரத்தில் என்னிடம் இன்னும் அதிகமாக வற்புறுத்தலாயினர். அவர்கள் (இப்படிச்) செய்ததைக் கண்ட நபி (ஸல்) அவர்கள், அவற்றில் மிகவும் பெரிய குவியலை மூன்றுமுறை சுற்றி வந்து அதன் அருகே உட்கார்ந்து கொண்டார்கள். பிறகு, ‘‘உன் கடன்காரர்களைக் கூப்பிடு” என்று சொன்னார்கள். (அவர்கள் வந்ததும்) என் தந்தையின் கடனை அல்லாஹ் நிறைவேற்றித்தரும்வரை, அவர்களுக்கு அளந்து கொடுத்துக் கொண்டேயிருந்தார்கள். அல்லாஹ்வின் மீதாணையாக! ஒரேயொரு பேரீச்சம் பழத்தைக்கூட எடுத்துக்கொண்டு என் சகோதரிகளிடம் திரும்பிச் செல்ல முடியாது என்ற நிலை ஏற்பட்டாலும் (பரவாயில்லை); என் தந்தையின் கடன் சுமையை அல்லாஹ் தீர்த்து வைத்தால் போதும் என்று நான் இருந்தேன். அல்லாஹ்வின் மீதாணையாக! குவியல் கள் அனைத்தும் அப்படியே (குறையாமல்) இருந்தன; அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்திருந்த குவியலை நான் பார்த்தேன். அதிலிருந்து ஒரேயொரு பேரீச்சம் பழம்கூட குறையாததைப் போன்று அப்படியே இருந்தது.31 அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன்: (‘அதிகமாக வற்புறுத்தினார்கள்’ என்பதைக் குறிக்க) இங்கு மூலத்தில் ‘அஃகர்ரூ’ எனும் சொல் ஆளப்பட்டுள்ளது. அதாவது என்னைத் திணறடித்துவிட்டார்கள். ‘‘நாம் அவர்களிடையே பகைமையையும் வெறுப்பையும் மூட்டினோம்” (5:14) எனும் வசனத்தொடரில் ‘அஃக்ரைனா’ எனும் சொல் ஆளப்பட்டுள்ளது. அத்தியாயம் : 55",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 44
			}
		}
	]
}