{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உம்மு ஹராம் பின்த் மில்ஹான் (ரலி) அவர்களின் வீட்டிற்குச் செல்பவராக இருந்தார்கள்.7 அப்போது அவர் நபி (ஸல்) அவர்களுக்கு உணவு கொடுப்பார். உம்மு ஹராம் (ரலி) அவர்கள், உபாதா பின் அஸ்ஸாமித் (ரலி) அவர்களின் மனைவியாக இருந்தார்கள். (இவ்வாறே ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உம்மு ஹராம் (ரலி) அவர்களிடம் சென்றார்கள். அவர் நபி (ஸல்) அவர்களுக்கு உணவு கொடுத்துவிட்டு அவர்களின் தலையில் பேன்பார்க்கத் தொடங்கினார். அப்படியே நபி (ஸல்) அவர்கள் உறங்கிவிட்டார்கள். பிறகு சிரித்துக்கொண்டே கண் விழித் தார்கள். உம்மு ஹராம் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! ஏன் (இப்படிச்) சிரிக்கிறீர்கள்?” என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘என் சமுதாயத்தைச் சேர்ந்த மக்கள் சிலர் எனக்குக் காட்டப்பட்டனர்; அவர்கள் இறைவழியில் அறப்போர் புரியும் வீரர்களாவர். அவர்கள் இந்தக் கடலின் முதுகில் கட்டில்களில் (சாய்ந்து) அமர்ந்திருக்கும் மன்னர்களாக லிஅல்லது கட்டில்களில் அமர்ந்திருக்கும் மன்னர்களைப் போன்றுலி ஏறிச்செல்கின் றார்கள்” என்று பதிலளித்தார்கள். அதற்கு உம்மு ஹராம் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! அவர்களில் ஒருத்தியாக என்னை ஆக்கும்படி அல்லாஹ்விடம் பிரார்த்தியுங்கள்” என்று கூறினார்கள். அவருக்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பிரார்த்தனை செய்தார்கள். பிறகு தமது தலையை(த் தலையணை யில்) வைத்(து உறங்க ஆரம்பித்)தார்கள்; பிறகு சிரித்தபடியே விழித்தெழுந்தார்கள். அப்போது உம்மு ஹராம் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! ஏன் சிரிக் கிறீர்கள்” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், ‘‘என் சமுதாயத்தைச் சேர்ந்த மக்கள் சிலர், இறைவழியில் அறப்போர் புரிபவர்களாக எனக்குக் காட்டப்பட்டனர்....” என்று முன்பு போலவே கூறினார்கள். உம்மு ஹராம் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! அவர்களில் ஒருத்தி யாக என்னை ஆக்கும்படி அல்லாஹ்விடம் பிரார்த்தியுங்கள்” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், ‘‘நீங்கள் (அறப்போருக்காகக் கடலில்) முதன்முதலாகப் பயணிப்பவர்களில் ஒருவராக இருப்பீர்கள்” என்று கூறினார்கள். அவ்வாறே, முஆவியா பின் அபீசுஃப்யான் (ரலி) அவர்கள் (கிழக்கு ரோம்மீது போர் புரியச் சென்ற) காலத்தில் உம்மு ஹராம் (ரலி) அவர்களும் கடல் பயணம் மேற்கொண்டார்கள். பிறகு கடலிலிருந்து புறப்பட்டு (கரைக்கு) வந்தபோது, தமது வாகனத்திலிருந்து கீழே விழுந்து இறந்து போனார்கள். அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		}
	]
}