{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொற்பொழிவு மேடைமீது நின்று, ‘‘எனக் குப்பின், உங்கள் விஷயத்தில் நான் அஞ்சுவதெல்லாம் பூமியின் அருள் வளங்கள் உங்களுக்குத் திறந்துவிடப்பட விருப்பதைத்தான்” என்று கூறிவிட்டு, உலகின் அழகையும் செழிப்பையும் கூறினார்கள். (அவற்றில்) முதலில் ஒன்றை (அருள் வளங்கள்) பற்றிக் கூறி, பிறகு மற்றொன்றை (உலகின் கவர்ச்சி) பற்றி இரண்டாவதாகக் கூறினார்கள். அப்போது ஒரு மனிதர் எழுந்து, ‘‘அல்லாஹ்வின் தூதரே! (செல்வம் என்ற) நன்மை, தீமையைக் கொண்டுவருமா?” என்று கேட்டார். நபி (ஸல்) அவர்கள் அவருக்குப் பதிலளிக்காமல் மௌனமாக இருந்தார்கள். இதைக் கண்ட நாங்கள், ‘‘நபி (ஸல்) அவர்களுக்கு வேதஅறிவிப்பு அருளப்படுகிறது” என்று கூறிக்கொண்டோம். மக்கள் அனைவரும் தம் தலைகளில் பறவைகள் அமர்ந்திருப்பதைப் போன்று (ஆடாமல் அசையாமல்) மௌனமாக இருந்தனர். பிறகு நபி (ஸல்) அவர்கள் தமது முகத்திலிருந்து (வழிந்த) வியர்வையைத் துடைத்துவிட்டு, ‘‘சற்று முன்பு கேள்வி கேட்டவர் எங்கே? (செல்வம்) ஒரு நன்மையா?” என்று மூன்று முறை கூறினார்கள். பிறகு, ‘‘(உண்மையிலேயே) நன்மை(யாக இருக்கும் ஒரு பொருள்)நன்மையைத் தவிர வேறெதையும் கொண்டுவராதுதான். ஆனால், வாய்க்கால் (தாவரங்களை) விளைவிக்கும்போதெல்லாம், (அவற்றைத் தின்னும்கால்நடைகளை) வயிறு புடைக்கவைத்து கொன்றுவிடுகின்றன; அல்லது கொல்லும் அளவுக்குச் சென்றுவிடுகின்றன. (அப்போதுதான் துளிர்விட்ட பசும்புற் களைத் தின்னும் கால்நடைகளைத் தவிர!) அவை (அதைத்) தின்று வயிறு நிரம்பிவிடும்போது, (அசைபோடுவதற் காகச்) சூரியனை நோக்கி(ப் படுத்துக்)கொள்கிறது. (இதனால், நன்கு சீரணமாகி குழைந்த) சாணமிடுகிறது; சிறுநீர் கழிக்கி றது. பின்னர் (வயிறு காலியானவுடன்) மறுபடியும் மேய்கிறது. (இவ்வாறே) இந்தச் செல்வமும் பசுமையானதும் இனிமையானதும் ஆகும். அதை முறைப்படி அடைந்து, அதை அல்லாஹ்வின் பாதையிலும் அனாதை களுக்காகவும் ஏழை எளியவர்களுக்காகவும் செலவிட்ட முஸ்லிமுக்கு அந்தச் செல்வம் சிறந்த தோழனாகும். அதை முறைப்படி அடையாதவன் உண்டும் வயிறு நிரம்பாத வரைப் போன்றவர் ஆவார். அச்செல்வம் மறுமை நாளில் அவருக்கெதிரான சாட்சி யாக அமையும்” என்று கூறினார்கள்.28 அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 58
			}
		}
	]
}