{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் (ஒருமுறை) அபூதல்ஹா (ரலி) அவர்களிடம், ‘‘உங்கள் சிறுவர்களில் ஒரு சிறுவரை எனக்குப் பணிவிடை புரிவதற்காகத் தேடுங்கள்; நான் கைபருக்குப் புறப்பட வேண்டும்” என்று சொன்னார்கள். ஆகவே, அபூ தல்ஹா (ரலி) அவர்கள் என்னை (தமது வாகனத்தின்) பின்னால் அமர வைத்துக் கொண்டு புறப்பட்டார்கள். அப்போது நான் பருவ வயதை நெருங்கிவிட்டிருந்த சிறுவனாக இருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கேனும் தங்கி னால் அவர்களுக்கு நான் பணிவிடைகள் புரிந்துவந்தேன். அப்போது அவர்கள், ‘‘இறைவா! துக்கத்திலிருந்தும், கவலையிலிருந்தும், இயலாமையிலிருந்தும், சோம்பலிலிருந் தும், கஞ்சத்தனத்திலிருந்தும், கோழைத் தனத்திலிருந்தும், கடன் சுமையிலிருந்தும், பிற மனிதர்களின் அடக்கு முறை’லிருந்தும் நான் உன்னிடம் பாதுகாப்புக் கோருகிறேன்” என்று பிரார்த்திப்பதை அதிகமாகச் செவியுற்றுவந்தேன். பிறகு நாங்கள் கைபருக்குச் சென்றுசேர்ந்தோம். நபி (ஸல்) அவர்களுக்கு அல்லாஹ் (கமூஸ்) கோட்டையின் வெற்றியை அளித்தபோது, ஸஃபிய்யா பின்த் ஹுயை பின் அக்தப் அவர்களின் அழகு பற்றி அவர்களுக்குக் கூறப்பட்டது. அப்போது (நடந்த போரில்) ஸஃபிய்யாவின் கணவர் கொல்லப்பட்டிருந்தார். அவர் புதுமணப் பெண்ணாகவும் இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஸஃபிய்யாவைத் தமக்காக (விரும்பித்) தேர்ந்தெடுத்து (மணந்து)கொண்டார்கள். நபி (ஸல்) அவர்கள் அவரைத் தம்முடன் அழைத்துக் கொண்டு புறப்பட்டார்கள். நாங்கள், யிசத்துஸ் ஸஹ்பா’ எனுமிடத்தை அடைந்தவுடன் ஸஃபிய்யா (ரலி) அவர்கள் மாதவிடாயிலிருந்து தூய்மையடைந்தார்கள். அப்போது அவருடன் நபி (ஸல்) அவர்கள் தாம்பத்தியத்தை மேற்கொண்டார்கள். பிறகு சிறிய பாத்திரம் ஒன்றில் (பேரீச்சம் பழம், நெய், பாலாடை ஆகியவற்றைக் கலந்து) யிஹைஸ்’ என்ற உணவைத் தயாரித்தார்கள். பிறகு ‘‘உன்னைச் சுற்றியிருப்பவர் களுக்கு (மணவிருந்துக்கு வரும்படி) அறிவிப்புச்செய்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னார்கள்.அது ஸஃபிய்யா (ரலி) அவர்களை மணந்ததற்காக நபி (ஸல்) அவர்கள் அளித்த மணவிருந்தாக அமைந்தது. பின்னர் நாங்கள் மதீனாவுக்குப் புறப் பட்டோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஸஃபிய்யாவுக்காகத் தமக்குப் பின்னால் (வாகனத்தில்) போர்வையால் திரை அமைத்ததை நான் பார்த்தேன். பிறகு தமது ஒட்டகத்தின் அருகே அமர்ந்து தமது முழங்காலை வைத்தார்கள். நபி (ஸல்) அவர்களின் முழங்கால்மீது தமது காலை வைத்து ஸஃபிய்யா (ரலி) அவர்கள் (ஒட்டகத்தில்) ஏறினார்கள். நாங்கள் மதீனாவை நெருங்கியபோது நபி (ஸல்) அவர்கள் உஹுத் மலையைப் பார்த்து, ‘‘இது நம்மை நேசிக்கின்ற மலை; நாமும் இதை நேசிக்கின்றோம்” என்று கூறினார்கள். பிறகு மதீனாவை நோக்கி, ‘‘இறைவா! இப்ராஹீம் (அலை) அவர்கள் மக்காவைப் புனிதமானதாக அறிவித்ததைப் போன்று இந்த இரு மலைகளுக்கிடை யிலுள்ள நிலப் பகுதியை (மதீனாவை)ப் புனிதமானதாக நான் அறிவிக்கிறேன். இறைவா! மதீனாவாசிகளின் யிமுத்’, அவர்களுடைய ‘ஸாஉ’ ஆகியவற்றில் வளம் வழங்குவாயாக!” என்று துஆ செய்தார்கள். அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		}
	]
}