{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "சஹ்ல் பின் சஅத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் (யூத) இணைவைப்போரும் (கைபரில்) சந்தித்துப் போரிட்டுக்கொண்ட னர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் படையினரிடமும் எதிரிகள் தம் படை ‘னரிடமும் திரும்பிச் சென்றுவிட்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர்களிடையே ஒருவர் இருந்தார். அவர், (எதிரிகளில்) போரில் கலந்துகொள்ளாமல் ஒதுங்கி நிற்பவர், படையிலிருந்து விலகிப்போய் தனியே சென்றவர் என எவரையும் நபித்தோழர் களுக்கு விட்டுவைக்காமல் அவர்களைப் பின்தொடர்ந்து சென்று தமது வாளால் வெட்டி வீழ்த்திக்கொண்டிருந்தார். (அவரது வீரத்தைக் கண்ட) நபித் தோழர்கள், ‘‘இந்த மனிதர் போரிட்டதைப் போன்று இன்று நம்மில் வேறு யாரும் தேவையான அளவுக்குப் போரிடவில்லை” என்று (வியந்து) கூறினார்கள். இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அவரோ நரகவாசியாவார்” என்று கூறினார்கள். அப்போது கூட்டத்தி லிருந்த ஒரு மனிதர், ‘‘நான் அவருடன் இருக்கப்போகிறேன் (அவர் என்ன செய்கிறார் என்று பார்ப்பதற்கு)” என்று சொல்லிவிட்டு அந்த மனிதருடன் புறப்பட்டார். அவர் நின்றபோதெல்லாம் இவரும் நின்றார். அவர் விரைந்தால் இவரும் விரைந்தார். (ஒரு கட்டத்தில்) அந்த வீரர் கடுமையாக காயப்படுத்தப்பட்டார். அதனால் அவர் அவசரமாக இறந்துபோக விரும்பி, தமது வாளின் (கைப்பிடியுள்ள) முனையை பூமியில் ஊன்றி, அதன் கூரான முனையைத் தம் இரு மார்புகளுக்கு இடையே வைத்து, அந்த வாளின் மீது தமது உடலை சாய்த்துக்கொண்டு தற்கொலை செய்துகொண்டார். (இதை உடனிருந்து கண்காணித்துவிட்டு) அந்த மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, ‘‘தாங்கள் அல்லாஹ்வின் தூதர்தான் என்று நான் உறுதி கூறுகிறேன்” என்று சொன்னார். நபி (ஸல்) அவர்கள், ‘‘என்ன விஷயம்?” என்று கேட்டார்கள். அவர், ‘‘சற்று முன்பு தாங்கள் ஒருவரைப் பற்றி ‘அவர் நரகவாசி’ என்று கூறினீர்கள் அல்லவா? அதைக் கண்டு மக்கள் வியப்படைந்தனர். நான் (மக்களிடம்), ‘‘உங்களுக்காக (அவருடைய நிலைகளை அறிந்து வர) நான் அவருடன் போய் வருகிறேன்” என்று கூறிவிட்டு, அவரைத் தேடிப் புறப்பட்டேன். அவர் கடுமையாக காயப்படுத்தப் பட்டார். உடனே அவர் அவசரமாக மரணமடைய விரும்பி, வாளின் பிடி முனையை பூமியில் நட்டு, அதன் கூர் முனையைத் தம் இரு மார்புகளுக்கிடையே வைத்து, அதன்மீது தன்னை சாய்த்துக் கொண்டு தற்கொலை செய்துகொண்டார்” என்று கூறினார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘மக்களின் வெளிப் பார்வைக்கு ஒரு மனிதர் சொர்க்கவாசி களின் (நற்)செயலைச் செய்துவருவார். ஆனால், அவர் (உண்மையில்) நரகவாசி யாக இருப்பார். மக்களின் வெளிப் பார்வைக்கு ஒரு மனிதர் நரகவாசிகளின் செயலைச் செய்துவருவார். ஆனால், (உண்மையில்) அவர் சொர்க்கவாசியாக இருப்பார்” என்று சொன்னார்கள். அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		}
	]
}