{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னையும் ஸுபைர் பின் அல்அவ்வாம் (ரலி), மிக்தாத் பின் அல்அஸ்வத் (ரலி) ஆகியோரையும், ‘‘நீங்கள் யிரவ்ளத்து காக்’ எனுமிடம்122 வரை செல்லுங்கள். ஏனெனில், அங்கு ஒட்டகச் சிவிகையில் ஒரு பெண் இருக்கிறாள். அவளிடம் ஒரு கடிதம் இருக்கும். அதை அவளிடமிருந்து எடுத்துக்கொள்ளுங்கள்” என்று கூறி அனுப்பினார்கள். (அவ்வாறே) நாங்கள் சென்றோம். எங்களைச் சுமந்துகொண்டு எங்கள் குதிரைகள் விரைந்தன. இறுதியில், நாங்கள் யிரவ்ளா’ எனும் அந்த இடத்தை அடைந்தோம். அங்கு ஒரு (சிவிகைப்) பெண்ணைக் கண்டோம். நாங்கள் (அவளிடம்), ‘‘கடிதத்தை வெளியே எடு” என்று கூறினோம். அவள், ‘‘என்னிடம் கடிதம் எதுவுமில்லை” என்று கூறினாள். நாங்கள், ‘‘ஒன்று நீயாகக் கடிதத்தை எடுத்து (கொடுத்து)விடு; இல்லையேல் (உன்) ஆடையை நாங்கள் கழற்றி (சோதனை’)ட வேண்டியதிருக்கும்” என்று சொன்னோம். உடனே, அவள் (இடுப்புவரை நீண்டிருந்த) தனது சடையின் பின்னல்களுக்கிடையேயிருந்து கடிதத்தை வெளியே எடுத்தாள். நாங்கள் அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுசென்றோம். அதில், ஹாத்திப் பின் அபீபல்தஆ அவர்கள் மக்காவாசிகளான இணைவைப்போர் சிலருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் (போர்த்) திட்டங்கள் சிலவற்றை (முன்கூட்டியே) தெரிவித்திருந்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘ஹாத்திபே! என்ன இது?” என்று கேட்டார்கள். ஹாத்திப் (ரலி) அவர்கள், ‘‘அல்லாஹ் வின் தூதரே! என் விஷயத்தில் அவசரப் பட்டு (நடவடிக்கை எடுத்து)விடாதீர்கள். நான் குறைஷியரில் ஒருவனாக இருக்க வில்லை. அவர்களைச் சார்ந்து வாழ்பவ னாக இருந்துவந்தேன். தங்களுடன் இருக்கும் முஹாஜிர்களுக்கு அவர்களு டைய வீட்டாரையும் சொத்துகளையும் பாதுகாப்பதற்கு மக்கா நகரில் உறவினர்கள் பலர் இருக்கின்றனர். எனக்கு அவர்களி டையே அத்தகைய உறவினர்கள் (எவரும்) இல்லாததால் மக்காவாசிகளுக்கு உபகாரம் எதையாவது செய்து, அதன் பிரதியாக அவர்கள் என் உறவினர்களைக் காப்பாற்ற வேண்டுமென்று நான் விரும்பினேன். (அதனால் அவர்கள் கேட்டுக்கொண்டபடி இந்தத் தகவலைத் தெரிவித்தேன்.) நான் இறைமறுப்பாலோ, (இஸ்லாத்தைத் துறந்து) வேறு மதத்தைத் தழுவுவதற்காகவோ, இஸ்லாத்தைத் தழுவியபின் இறைமறுப்பை விரும்பியோ இவ்விதம் செய்யவில்லை” என்று கூறினார்கள். (இதைக் கேட்ட) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இவர் உங்களிடம் உண்மை பேசினார்” என்று கூறினார்கள். உமர் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் தூதரே! என்னை விடுங்கள்! இந்த நயவஞ்சகனின் கழுத்தை வெட்டிவிடுகிறேன்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இவர் பத்ர் போரில் கலந்துகொண்டிருக்கிறார். உமக்கென்ன தெரியும்? ஒரு வேளை அல்லாஹ் பத்ர் போரில் கலந்துகொண்டவர்களைப் பார்த்து, ‘நீங்கள் விரும்பியதைச் செய்துகொள்ளுங்கள். உங்களை நான் மன்னித்துவிட்டேன்’ என்று கூறிவிட்டிருக்கலாம்” என்று சொன்னார்கள். ‘‘என்ன (பலமான) அறிவிப்பாளர்தொடர் இது!” என்று இந்த நபிமொழியின் அறிவிப்பாளர்தொடரைக் கண்டு இதன் அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் (வியந்து) கூறினார்கள். அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		}
	]
}