{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பத்துப் பேர் கொண்ட ஒரு குழுவினரை உளவுப் படையாக (ஓரிடத்திற்கு) அனுப்பிவைத்தார்கள். இப்படைக்கு உமர் பின் அல்கத்தாப் (ரலி) அவர்களுடைய மகன் ஆஸிமின் (தாய்வழிப்) பாட்டனார் ஆஸிம் பின் ஸாபித் அல் அன்சாரி (ரலி) அவர்களைத் தலைவராக்கி னார்கள்.154 அவர்கள் புறப்பட்டு, உஸ்ஃபானுக்கும் மக்காவுக்கும் இடையிலுள்ள யிஹத்ஆ’ எனுமிடத்திற்கு வந்தபோது ஹுதைல் குலத்தைச் சேர்ந்த பனூ லிஹ்யான் எனப்படும் ஒரு கிளை’னருக்கு இந்த உளவுப் படையினர் வரும் விவரம் தெரிவிக்கப்பட்டது. உடனே அக்கிளை ‘னர் (அவர்களைப் பிடிப்பதற்காக) அம்பெய்யும் வீரர்கள் சுமார் இருநூறு வீரர்களைத் தங்களுக்காகத் திரட்டிக் கொண்டு இந்த உளவுப் படையினரின் பாதச் சுவடுகளைப் பின்தொடர்ந்தனர். (வழியில்) உளவுப் படையினர் மதீனாவிலிருந்து பயண உணவாகக் கொண்டு வந்திருந்த பேரீச்சம் பழங்களை உண்ட இடத்தில் அவற்றைக் கண்டனர். அப்போது ‘‘இது யஸ்ரிபுடைய (மதீனாவுடைய) பேரீச்சம்பழம்” என்று கூறினர். எனவே, அவர்கள் கால் சுவடுகளைப் பின்பற்றிச் சென்றனர். அவர்களை ஆஸிம் (ரலி) அவர்களும் அவர்களுடைய சகாக்களும் கண்டபோது, உயரமான (குன்று போன்ற) ஓரிடத்தில் (புகலிடம் தேடி) ஒதுங்கி நின்றுகொண்டனர். அவர்களை பனூ லிஹ்யான் குலத்தார் சூழ்ந்துகொண்டனர். அவர்கள் அந்த உளவுப் படையினரிடம், ‘‘நீங்கள் இறங்கி வந்து எங்களிடம் சரணடைந்துவிடுங்கள். உங்களுக்கு நாங்கள் உறுதிமொழியும் வாக்கும் அளிக்கிறோம். உங்களில் எவரையும் நாங்கள் கொல்லமாட்டோம்” என்று கூறினார்கள். உளவுப் படையின் தலைவரான ஆஸிம் பின் ஸாபித் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! இன்று நான் ஓர் இறைமறுப்பாளனின் (வாக்குறு தியை நம்பி அவனது) பொறுப்பில் இறங்கிச் செல்லமாட்டேன்” என்று கூறி விட்டு, ‘‘இறைவா! எங்கள் நிலை குறித்து உன் தூதருக்குத் தெரிவித்துவிடு” என்று பிரார்த்தித்தார்கள். அவர்கள்மீது எதிரிகள் அம்பெய்து ஆஸிம் உட்பட ஏழு பேரைக் கொன்று விட்டனர். உளவுப் படையினரில் (எஞ்சியிருந்த) மூன்று பேர் எதிரிகளின் உறுதிமொழி மற்றும் வாக்குறுதியின் பேரில் இறங்கினார்கள். அவர்கள் அன்சாரியான குபைப் (ரலி) அவர்களும், இப்னு தஸினா (ரலி) அவர்களும் மற்றுமொருவரும் ஆவர்.155 இவர்கள் தங்கள் கையில் கிடைத்தவுடன் இறைமறுப்பாளர்கள் தம் விற்களின் நாண்களை அவிழ்த்து அவர்களைக் கட்டினார்கள். (உளவுப் படையில் எஞ்சிய மூவரில்) மூன்றாவது மனிதர், ‘‘இது முதலாவது நம்பிக்கை துரோகம். அல்லாஹ்வின் மீதாணையாக! நான் உங்களுடன் வரமாட்டேன். (கொல்லப்பட்ட) இவர்கள் எனக்கு (நல்ல) ஒரு பாடமாக அமைந்துள்ளனர்” என்று (எதிரிகளிடம்) கூறினார். உடனே அவர்கள் அவரை இழுத்துச் சென்று தம்மோடு வரும்படி கட்டாயப்படுத்தினர். அதற்கு அவர் மறுத்துவிடவே அவரைக் கொலை செய்துவிட்டார்கள். பிறகு குபைப் (ரலி) அவர்களையும் இப்னு தஸினா (ரலி) அவர்களையும் பிடித்துச் சென்று மக்காவில் விற்றுவிட்டனர். இது பத்ர் போருக்குப் பிறகு நடந்த சம்பவமாகும். குபைப் அவர்களை பனூ ஹாரிஸ் என்னும் குலத்தார் விலைக்கு வாங்கினர். (அந்தக் குலத்தின் தலைவர்) ஹாரிஸ் பின் ஆமிர் என்பவரை குபைப் (ரலி) அவர்கள் பத்ர் போரில் கொன்று விட்டிருந்தார்கள். ஆகவே, (அதற்குப் பழிவாங்குவதற்காக குபைப் அவர்களை பனூ ஹாரிஸ் குலத்தார் வாங்கிக் கைது செய்து வைத்திருந்தனர்.) அவர்களிடம் குபைப் (ரலி) அவர்கள் (புனித மாதம் கழியும்வரை) கைதியாக இருந்தார்கள். உபைதுல்லாஹ் பின் இயாள் (ரஹ்) அவர்கள் கூறியதாக அறிவிப்பாளர் ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறினார்கள்: ஹாரிஸ் பின் ஆமிரின் மகள் என்னி டம் கூறினார்:156 குபைப் அவர்களைக் கொல்வதற்காக (எங்கள் குடும்பத்தார்) ஒன்றுகூடியபோது, குபைப் (மறைவான உறுப்புகளிலிருந்த) முடிகளைக் களைவதற்காக ஒரு சவரக்கத்தியை என்னிடமிருந்து இரவல் வாங்கினார். அப்போது என் குழந்தை ஒருவனை அவர் கையிலெடுத்துக்கொண்டார். அவன் அவரிடம் சென்றபோது நான் (பார்க்காமல்) கவனக் குறைவாக இருந்து விட்டேன். அவர் கையில் சவரக்கத்தி இருக்க, தமது மடியின் மீது அவனை உட்காரவைத்திருப்பதை நான் கண்டேன். அதைக் கண்டு நான் கடும் பீதியடைந் தேன். என் முகத்தில் தெரிந்த பீதியை குபைப் புரிந்துகொண்டார். உடனே, ‘‘நான் இவனைக் கொன்றுவிடுவேன் என்று நீ பயப்படுகிறாயா? நான் அப்படிச் செய்யமாட்டேன்” என்று கூறினார். அல்லாஹ்வின் மீதாணையாக! குபைப் அவர்களைவிடச் சிறந்த ஒரு கைதியை நான் ஒருபோதும் பார்த்ததில்லை. அல்லாஹ்வின் மீதாணையாக! அவர் ஒருநாள் தமது கையிலிருந்த திராட்சைக் குலை ஒன்றிலிருந்து (பழங்களை எடுத்து) உண்டுகொண்டிருக்கக் கண்டேன். அப்போது அவர் இரும்புச் சங்கிலிகளால் பிணைக்கப்பட்டிருந்தார். மேலும், அப்போது மக்கா நகரில் பழம் (விளையும் பருவம்) எதுவும் இருக்கவில்லை. லிமேலும், ஹாரிஸின் மகள், ‘‘அது அல்லாஹ்விடமிருந்து கிடைத்த உண வாகும். அல்லாஹ் அதை குபைப் அவர்களுக்கு அளித்திருந்தான்” என்று கூறி வந்தார்லி (என அறிவிப்பாளர் இடையில் கூறுகிறார்.) (தொடர்ந்து அறிவிப்பாளர் கூறு கிறார்:) அவர்கள் குபைப் (ரலி) அவர்களைக் கொல்வதற்காக புனித ஹரம் எல்லைக்கு வெளியே உள்ள இடத்திற்குப் புறப்பட்டுச் சென்றபோது அவர்களிடம் குபைப் அவர்கள், ‘‘என்னை இரண்டு ரக்அத்கள் தொழ விடுங்கள்” என்று கேட்டார்கள். (தொழுது முடித்த)பிறகு, ‘‘நான் (மரணத்தைக் கண்டு) அஞ்சுகிறேன் என்று நீங்கள் எண்ணுவீர்கள் என்ற அச்சம் எனக்கில்லாமல் இருந்திருந்தால் நான் நீண்ட நேரம் தொழுதிருப்பேன்” என்று கூறிவிட்டு, ‘‘இறைவா! இவர்களை எண்ணி வைத்துக்கொண்டு (ஒருவர் விடாமல்) பழிவாங்குவாயாக!” என்று பிரார்த்தித்தார்கள். நான்முஸ்லிமாகக் கொல்லப்படுகையில்எதைப் பற்றியும்பொருட்படுத்தப்போவதில்லைஎந்த இடத்தில்நான் இறந்தாலும்இறைவனுக்காககொல்லப்படுகிறேன் (என்பதில் மகிழ்ச்சியே!) நான் கொல்லப்படுவதுஇறையன்புக்காக எனும்போது,அவன் நாடினால்துண்டிக்கப்பட்டஎன் உறுப்புகளின்இணைப்புகள்மீதுகூடவளம் வழங்குவான். என்று கவி பாடினார்கள். பின்னர், குபைப் (ரலி) அவர்களை ஹாரிஸின் மகன் (உக்பா) கொன்றுவிட்டார். அன்றிலிருந்து கட்டிவைத்துக் கொல்லப் படும் ஒவ்வொரு முஸ்லிமுக்கும், கொல்லப்படுவதற்குமுன் இரண்டு ரக்அத் கள் தொழுவதை முன்மாதிரியாக்கியவர் குபைப் அவர்களே என்றாயிற்று. ஆஸிம் பின் ஸாபித் (ரலி) அவர்கள் கொல்லப்பட்ட போது, அவர்கள் செய்த பிரார்த்தனையை அல்லாஹ் ஏற்றுக்கொண்டு (அவர்களின் நிலை குறித்து தன் தூதருக்குத் தெரிவித்து) விட்டான். நபி (ஸல்) அவர்கள் தம் தோழர்களுக்கு உளவுப் படையினரின் செய்தியையும், அவர்களுக்கு நேர்ந்த கதியையும் தெரிவித்தார்கள். குறைஷி இறைமறுப்பாளர்களில் சிலருக்கு ஆஸிம் அவர்கள் கொல்லப் பட்டது குறித்துத் தெரிவிக்கப்பட்டவுடன் (கொல்லப்பட்டது அவர்தான் என்று) அவரை அடையாளம் தெரிந்துகொள்ள அவரது அங்கம் எதையாவது தமக்குக் கொடுத்தனுப்பும்படி கேட்டு அவர்கள் ஆளனுப்பினார்கள். ஏனெனில், ஆஸிம் (ரலி) அவர்கள் பத்ர் போரின்போது குறைஷி தலைவர்களில் ஒருவரைக் கொன்றிருந்தார்கள். (ஆஸிம் அவர்களின் உடலில் ஓர் உறுப்பைத் துண்டிக்க எதிரிகள் முற்பட்ட போது) ஆஸிம் (ரலி) அவர்களுக்கு (பாதுகாப்பாக) ஆண் தேனீக்களின் கூட்டம் ஒன்று நிழல் தரும் மேகத்தைப் போன்று (அவரைச் சுற்றிலும் அரணாகப் படர்ந்திருக்கும்படி) அனுப்பப்பட்டது. அது அவர்களை குறைஷித் தூதுவரிடமிருந்து காப்பாற்றியது. ஆகவே, அவர்களின் சதையிலிருந்து அவர்களால் எதையும் துண்டித்து எடுத்துச் செல்ல முடியவில்லை.157 அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 251
			}
		}
	]
}