{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) ஸுபைர் பின் அல் அவ்வாம் (ரலி) அவர்கள் யிஜமல்’ போரின் போது நின்றபடி என்னை அழைத்தார்கள்.46 நான் அவர்களின் பக்கத்தில் சென்று நின்றேன். அவர்கள், ‘‘என் அன்பு மகனே! இன்று (தமக்கு எதிரானவரின் பார்வையில்) அக்கிரமக்காரராகவோ (தமது பார்வையில்) அநீதி இழைக்கப்பட்டவராகவோ இருப்பவரைத் தவிர வேறெவரும் கொல்லப்படமாட்டார்கள். நான் இன்று அநீதியிழைக்கப்பட்ட நிலையில் (நிரபராதி யாகக்) கொல்லப்பட்டுவிடுவேன் என்றே கருதுகிறேன். (அதைவிட) எனது கடன் தான் எனக்கு மிகவும் கவலையளிக்கிறது. நமது கடன் நமது செல்வத்தில் எதையாவது மீதிவைக்கும் என்று நீ கருதுகிறாயா? மகனே! நம் சொத்தை விற்றுவிட்டு என் கடனை அடைத்துவிடு” என்று சொன்னார்கள். பிறகு தமது சொத்தில் மூன்றிலொரு பங்கை (இன்ன நற்பணிகளுக்காகச் செலவிட வேண்டுமென்று இறுதி விருப்பம் தெரிவித்து) சாசனம் செய்தார்கள். அந்த மூன்றிலொரு பங்கில் மூன்றிலொரு பங்கைத் தம் மக்களுக்கு லி அப்துல்லாஹ்வின் மக்களுக்கு லி கொடுக்கப்பட வேண்டும் என்று விருப்பம் தெரிவித்தார்கள். அதாவது ‘‘ஒன்பதில் ஒரு பங்கைலி அதுவும் நம் சொத்திலிருந்து கடனை அடைத்த பின்பு மீதியிருந்தால் லி உன் மக்களுக்குக் கொடுத்துவிட வேண்டும்” என்று விருப்பம் தெரிவித்தார்கள். லிஏனெனில், அறிவிப்பாளர்களில் ஒருவரான ஹிஷாம் பின் உர்வா (ரஹ்) அவர்கள் கூறுகிறார்கள்: அப்துல்லாஹ் (ரலி) அவர்களின் பிள்ளைகள் சிலர், ஸுபைர் (ரலி) அவர் களின் பிள்ளைகளான குபைப், அப்பாத் ஆகியோருக்கு ஈடான வயதுடையவர் களாய் இருந்தனர். அப்போது ஸுபைர் (ரலி) அவர்களுக்கு ஒன்பது ஆண் பிள்ளைகளும் ஒன்பது பெண் பிள்ளை களும் இருந்தனர்லி (தொடர்ந்து) அப்துல்லாஹ் பின் அஸ் ஸுபைர் (ரலி) அவர்கள் கூறுகிறார்கள்: தமது கடனை அடைத்துவிடும்படி என்னிடம் சொல்லத் தொடங்கினார்கள். பிறகு, ‘‘என் அன்பு மகனே! அதில் சிறிது உன்னால் அடைக்க முடியவில்லையென் றால் என் எஜமானிடம் உதவி கேள்” என்று சொன்னார்கள். அல்லாஹ்வின் மீதாணையாக! அவர்கள், யிஎன் எஜமான்’ என்று யாரைக் குறிப்பிட்டார்கள் என்று (முதலில்) எனக்குத் தெரியவில்லை. அதனால் நான், ‘‘என் தந்தையே! தங்கள் எஜமான் யார்?” என்று கேட்டேன். அவர்கள், ‘‘அல்லாஹ்தான்” என்று பதிலளித்தார்கள். அல்லாஹ்வின் மீதாணையாக! அவர்களின் கடனை அடைப்பதில் எனக்குச் சிரமம் ஏற்பட்ட போதெல்லாம், ‘‘(என் தந்தை) ஸுபைர் (ரலி) அவர்களின் எஜமானனே! அவர் சார்பாக அவரது கடனை நீ அடைப்பாயாக!” என்று பிரார்த்தித்துவந்தேன். அந்த (எஜமான்) அல்லாஹ்வும் அதை அடைத்துவந்தான். ஸுபைர் (ரலி) அவர்கள் போரில் கொல்லப்பட்டார்கள். ஆனால், அவர்கள் ஒரு பொற்காசையோ வெள்ளிக்காசையோகூட (ரொக்கமாக) விட்டுச்செல்லவில்லை; இரண்டு நிலங்களைத் தவிர. அவற்றில் ஒன்று ‘அல்ஃகாபா’வில் இருந்த நிலமாகும்.47 மற்றும் மதீனாவில் பதினொரு வீடுகளையும் பஸ்ராவில் இரண்டு வீடுகளையும் கூஃபாவில் ஒரு வீட்டையும் எகிப்தில் ஒரு வீட்டையும் அவர்கள் விட்டுச்சென்றார்கள். அவர்கள் மீதிருந்த கடன் ஏற்பட்ட விதம் இதுதான்: ஒரு மனிதர் ஸுபைர் (ரலி) அவர்களிடம் சில பொருட்களைக் கொண்டுவந்து அடைக்கலமாகத் தந்து விட்டுச் செல்வது வழக்கம். ஸுபைர் (ரலி) அவர்கள், ‘‘வேண்டாம். இதை நான் அடைக்கலப் பொருளாக ஏற்கமாட்டேன். மாறாக, இது என் பொறுப்பில் கடனாகும். அது அழிந்துபோய்விடுமோ என்று நான் அஞ்சுகிறேன்” என்று சொன்னார்கள். ஸுபைர் (ரலி) அவர்கள் எந்த ஆட்சிப் பொறுப்பையும் ஒருபோதும் விரும்பியதில்லை. யிகராஜ்’ (எனும் காப்பு) வரி வசூலிக்கும் பொறுப்பையோ வேறெந்தப் பணப் பொறுப்பையுமோ ஏற்றுக்கொண்டதில்லை; நபி (ஸல்) அவர்களுடன், அல்லது அபூபக்ர், உமர், உஸ்மான் (ரலி) ஆகியோருடன் அறப் போரில் பங்கெடுத்து (அதனால் கிடைத்த போர்ச் செல்வங்களில் பங்குபெற்றுக்) கொண்டதைத் தவிர (வேறெந்த வழியிலும் அதிகாரத்தைப் பயன்படுத்திப் பொருளீட் டியதில்லை). நான் அவர்கள் மீதிருந்த கடனை எண்ணிப்பார்த்தேன். மொத்தம் இருபத்திரண்டு லட்சம் கடன் இருக்கக் கண்டேன். அப்போது ஹகீம் பின் ஹிஸாம் (ரலி) அவர்கள் என்னைச் சந்தித்து, ‘‘என் சகோதரர் மகனே! என் சகோதரர்மீது எவ்வளவு கடன் இருக்கின்றது?” என்று கேட்டார்கள்.48 நான் அதை மறைத்து, ‘‘ஒரு லட்சம்தான்” என்று சொன்னேன். ஹகீம் பின் ஹிஸாம் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! உங்கள் சொத்துகள் அவ்வளவு கடனையும் அடைக்கப் போதாதே” என்று சொன்னார்கள். நான், ‘‘என் தந்தையின் கடன் இருபத்திரண்டு லட்சமாக இருந்தால் என்ன சொல்வீர்கள்?” என்று கேட்டேன். அதற்கு அவர்கள், ‘‘இவ்வளவு (பெருந்தொகையை அடைக்க) உங்களால் முடியாது என்றே நான் கருதுகிறேன். உங்களால் அதில் ஓரளவு அடைக்க முடியாமல்போனால் என்னிடம் உதவி கேளுங்கள்” என்று சொன்னார்கள். ஸுபைர் (ரலி) அவர்கள் ‘அல்ஃகாபா’ வில் ஒரு லட்சத்து எழுபதாயிரத்திற்கு ஒரு சொத்தை வாங்கியிருந்தார்கள். அதை நான் பதினாறு லட்சத்திற்கு விலை மதிப்பிட்டிருந்தேன். பிறகு (மக்களிடையே), எழுந்து நின்று, ‘‘எவருக்கு ஸுபைர் (ரலி) அவர்கள் கடன் தர வேண்டியுள்ளதோ அவர் நம்மிடம் அல்ஃகாபாவுக்கு வரட்டும்” என்று அறிவித்தேன். உடனே அப்துல்லாஹ் பின் ஜஅஃபர் (ரலி) அவர்கள், என்னிடம் வந்தார்கள். ஏனெனில், அவர்களுக்கு ஸுபைர் (ரலி) அவர்கள் நான்கு லட்சம் தர வேண்டி யிருந்தது. ஆகவே, அவர்கள் என்னிடம், ‘‘நீங்கள் விரும்பினால் என் கடனை உங்களுக்கே விட்டுக்கொடுத்து விடுகி றேன்” என்று சொன்னார்கள். நான், ‘‘வேண்டாம்” என்று சொன்னேன். உடனே அவர்கள், ‘‘சரி, நீங்கள் (சில கடன்களை) சற்றுத் தாமதமாக அடைப்பதாயிருந்தால் என் கடனையும் அப்படிப்பட்ட கடன்களில் ஒன்றாக நீங்கள் விரும்பினால் ஆக்கிக்கொள்ளுங்கள்” என்று சொன்னார்கள். நான், ‘‘அதுவும் வேண்டாம் (உடனே உங்கள் கடனை வாங்கிக் கொள்ளுங்கள்)” என்று சொல்லிவிட்டேன். அவர்கள், ‘‘அப்படியென்றால் (உங்கள் நிலத்திலிருந்து என் கடனுக்குச் சமமான) ஒரு பகுதியை எனக்குத் தந்துவிடுங்கள்” என்று சொன்னார்கள். நான், ‘‘இங்கிருந்து இதுவரை உங்களுக்கு உரியது” என்று (அவருக்குச் சேரும் நிலத்தின் அளவை வரையறுத்துச்) சொன்னேன். நான் அந்த ‘அல்ஃகாபா’ (மற்றும் வீடுகளில்) சிலவற்றை விற்று என் தந்தை ஸுபைர் (ரலி) அவர்களின் கடனை (முழுவதுமாக) அடைத்துவிட்டேன். அல்ஃகாபாவின் நிலத்தில் நாலரைப் பங்குகள் மட்டும் விற்கப்படாமல் மீதமாயிருந்தன. முஆவியா (ரலி) அவர்களிடம் அம்ர் பின் உஸ்மான், முன்திர் பின் ஸுபைர், அப்துல்லாஹ் பின் ஸம்ஆ (ரலி) ஆகியோர் இருக்க, நான் அங்கு சென்றேன். முஆவியா (ரலி) அவர்கள் என்னிடம், ‘‘அல்ஃகாபாவிலிருக்கும் (உங்கள் தந்தை ஸுபைர் (ரலி) அவர் களின்) சொத்திற்கு எவ்வளவு விலைமதிப்பு சொல்லப்பட்டது?” என்று என்னிடம் கேட்க, நான், ‘‘ஒவ்வொரு பங்கும் ஒரு லட்சம்” என்று பதிலளித்தேன். அவர்கள், ‘‘அதில் எவ்வளவு (விற்காமல்) எஞ்சி யுள்ளது?” என்று கேட்டார்கள். நான், ‘‘நாலரைப் பங்குகள் எஞ்சியுள்ள”’ என்று பதில் சொன்னேன். முன்திர் பின் ஸுபைர் அவர்கள், ‘‘நான் ஒரு பங்கை ஒரு லட்சம் கொடுத்து எடுத்துக்கொள்கிறேன்” என்று சொன்னார். அம்ர் பின் உஸ்மான் அவர்கள், ‘‘நான் ஒரு பங்கை ஒரு லட்சம் கொடுத்து எடுத்துக்கொள்கிறேன்” என்று சொன்னார் கள். இப்னு ஸம்ஆ (ரலி) அவர்கள், ‘‘நான் ஒரு பங்கை ஒரு லட்சம் கொடுத்து எடுத்துக்கொள்கிறேன்” என்று சொன்னார் கள். முஆவியா (ரலி) அவர்கள், ‘‘இப்போது எவ்வளவு மீதியுள்ளது?” என்று கேட்டார்கள். நான், ‘‘ஒன்றரைப் பங்கு (மட்டும்தான்) மீதியுள்ளது” என்று பதில் சொன்னேன். உடனே அவர்கள், ‘‘நான் அதை ஒன்றரை லட்சம் கொடுத்து எடுத்துக்கொள்கிறேன்” என்று சொன்னார்கள். அப்துல்லாஹ் பின் ஜஅஃபர் (ரலி) அவர்கள் (தமக்கு வர வேண்டிய நான்கு லட்சத்திற்குப் பதிலாக தமக்குத் தரப்பட்ட நிலத்தை) முஆவியா (ரலி) அவர்களிடம் ஆறு லட்சத்திற்கு விற்று (இரண்டு லட்சம் இலாபம் அடைந்து)விட்டார்கள். நான் என் தந்தையின் கடன்களையெல்லாம் அடைத்து முடித்தபிறகு (என் சகோதரர்களான) ஸுபைர் (ரலி) அவர்களின் மக்கள், ‘‘நமக்கிடையே நமது வாரிசுச் சொத்தைப் பங்கிட்டுவிடுங்கள்” என்று என்னிடம் கோரினர். நான், ‘‘முடியாது, அல்லாஹ்வின் மீதாணையாக! நான் (ஹஜ்) பருவத்தில் நான்காண்டுகளுக்கு, ‘‘ஸுபைர் (ரலி) அவர்கள் எவருக்குக் கடன் தர வேண்டி யுள்ளதோ, அவர் நம்மிடம் வரட்டும். நாம் அவர் கடனை அடைப்போம்” என்று அறிவிக்காமல் உங்களிடையே அவருடைய சொத்துகளைப் பங்கிடவே மாட்டேன்” என்று சொல்லிவிட்டேன். பிறகு ஒவ்வோர் ஆண்டும் ஹஜ்ஜுப் பருவத்தில் அறிவிப்புக் கொடுக்கத் தொடங்கினேன். நான்காண்டுகள் கழிந்து விட்டபின் (யாரும் ஸுபைர் (ரலி) அவர்கள் கடன் தர வேண்டியிருப்பதாகக் கேட்டு வராததால் என் சகோதர சகோதரி களான) ஸுபைர் (ரலி) அவர்களின் மக்களுக்கிடையே மீதிச் சொத்துகளைப் பங்கிட்டுவிட்டேன். (என் தந்தை) ஸுபைர் (ரலி) அவர்களுக்கு நான்கு துணைவியர் இருந்தனர். ஸுபைர் (ரலி) அவர்கள் தமது இறுதி விருப்பமாகத் தெரிவித்த (மரண சாசனப் பங்கான) மூன்றில் ஒரு பங்கைக் கொடுத்தது போக, மீதியை அவர்களின் துணைவியருக்குக் கொடுத்தேன். ஒவ்வொருவருக்கும் பன்னிரண்டு லட்சம் கிடைத்தது. ஆக, ஸுபைர் (ரலி) அவர்களின் சொத்துகளின் மொத்த மதிப்பு (கடனுக்காகக் கொடுத்தது, நல்லறங்களுக்காகச் செய்த மரண சாசனத் தொகை, வாரிசுகளுக்குக் கிடைத்தது ஆகிய அனைத்தும் சேர்ந்து) ஐந்து கோடியே இரண்டு இலட்சமாகும் (என மற்றோர் அறிவிப்பில் இடம்பெற்றுள்ளது).49 அத்தியாயம் : 57",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 38
			}
		}
	]
}