{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "மர்வான் பின் அல் ஹகம் மற்றும் மிஸ்வர் பின் மக்ரமா (ரலி) ஆகியோர் கூறியதாவது: ஹவாஸின் குலத்தின் தூதுக் குழு வினர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் முஸ்லிம்களாக வந்தபோது நபி (ஸல்) அவர்களிடம் தம் செல்வங்களை யும் போர்க் கைதிகளையும் திருப்பித் தந்துவிடும்படி கேட்டார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘பேச்சில் எனக்கு மிகவும் பிரியமானது உண்மையான பேச்சேயாகும். போர்க் கைதிகள் அல்லது (உங்கள்) செல்வங்கள் இரண்டில் நீங்கள் விரும்பியதைத் திரும்பப் பெற்றுக்கொள்ளுங்கள். நான் உங்களை எதிர்பார்த்(துக் காத்)திருந்தேன்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாயிஃபிலிருந்து திரும்பியபோது பத்துக் கும் மேற்பட்ட நாட்கள் ஹவாஸின் குலத் தாரை எதிர்பார்த்துக் காத்திருந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரண்டிலொன்றைத்தான் திருப்பித் தருவார்கள் என்று அவர்களுக்குத் தெளிவாகிவிட்டபோது, ‘‘நாங்கள் எங்கள் கைதிகளையே திரும்பப் பெற்றுக் கொள்கிறோம்” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முஸ்லிம்களிடையே எழுந்து நின்று, அல்லாஹ்வை அவனுக்குரிய முறையில் புகழ்ந்துவிட்டு, ‘‘அல்லாஹ்வைப் போற்றிப் புகழ்ந்தபின் கூறுகிறேன்: உங்களுடைய இந்தச் சகோதரர்கள் நம்மிடம் மனம் திருந்தியவர்களாக வந்துள்ளனர். இவர்களில் (நம்மிடம்) போர்க் கைதிகளாக இருப்பவர்களை இவர்களிடமே திருப்பிக் கொடுத்துவிடுவதை நான் உசிதமானதாகக் கருதுகிறேன். எவர் மனப்பூர்வமாக இதற்குச் சம்மதிக்கிறாரோ அவர் திருப்பித் தந்துவிடட்டும்; அல்லாஹ் (இனிவரும் நாட்களில்) முதலாவதாக நமக்குத் தரவிருக்கும் (வெற்றி கொள்ளப்படும் நாட்டின்) செல்வங்களிலிருந்து நாம் தருகின்ற வரை அவற்றைத் தம்மிடமே வைத்திருக்க எவர் விரும்புகிறாரோ அவர் அவ்வாறே வைத்திருக்கட்டும்” என்று கூறினார்கள். அப்போது மக்கள், ‘‘நாங்கள் மனப் பூர்வமாக (போர்க் கைதிகளைத்) திருப்பிக் கொடுக்கச் சம்மதிக்கின்றோம், அல்லாஹ் வின் தூதரே!” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், ‘‘உங்களில் இதற்கு (உண்மையிலேயே) யார் சம்மதிக்கிறார்; யார் சம்மதிக்கவில்லை என்று எமக்குத் தெரியாது. ஆகவே, நீங்கள் திரும்பிச் செல்லுங்கள். உங்களிடையேயுள்ள தலைவர்கள் உங்கள் முடிவை எனக்குத் தெரிவிக்கட்டும்” என்று கூறினார்கள். மக்கள் திரும்பிச் செல்ல, அவர்களிடம் அவர்களின் தலைவர்கள் பேசினார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தலைவர்கள் திரும்பி வந்து மக்கள் மனப்பூர்வமாகச் சம்மதித்துவிட்டதாகத் தெரிவித்தார்கள். (அறிவிப்பாளர் இப்னு ஷிஹாப் (ரஹ்) அவர்கள் கூறுகிறார்:) இதுதான் ஹவாஸின் குலத்தாரின் போர்க் கைதிகள் குறித்து நமக்கு எட்டிய செய்தியாகும்.53 அத்தியாயம் : 57",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}