{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "ஸஹ்தம் பின் முளர்ரிப் (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது கோழிக்கறி உணவு வந்தது. அவர்களிடம் தைமுல்லாஹ் குலத்தைச் சேர்ந்த சிவப் பான மனிதர் ஒருவர் இருந்தார். அவர் (கிழக்கு ரோமானியரிடையேயிருந்து பிடித்துக் கொண்டுவரப்பட்ட) போர்க் கைதிகளில் ஒருவரைப் போன்று காணப் பட்டார். அபூமூசா (ரலி) அவர்கள் அந்த மனிதரை உணவு உண்ண அழைத்தார்கள். அதற்கு அந்த மனிதர், ‘‘இந்தக் கோழி (அசுத்தம்) எதையோ தின்பதை நான் பார்த்தேன். அது எனக்கு அருவருப்பை உண்டாக்கவே இதை இனி உண்பதில்லை என்று சத்தியம் செய்துவிட்டேன்” என்று சொன்னார். இதைக் கேட்ட அபூமூசா (ரலி) அவர்கள், ‘‘இங்கே வா! இதைப் பற்றி உனக்கு (நபி (ஸல்) அவர்களிடமிருந்து) அறிவிக்கி றேன்” என்று சொல்லிவிட்டுக் கூற லானார்கள்: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (என்) அஷ்அரீ குலத்தார் சிலருடன் எங்களை(யும் எங்கள் பயணச் சுமைகளையும்) சுமந்து செல்ல ஒட்டகங்கள் ஏற்பாடு செய்யும்படி கேட்டுச் சென்றேன். நபி (ஸல்) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (ஒட்டகத்தில்) ஏற்றியனுப்ப முடியாது. ஏனெனில், உங்களை ஏற்றியனுப்பத் தேவையான ஊர்தி ஒட்டகங்கள் என்னிடம் இல்லை” என்று சொன்னார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் கொண்டுவரப்பட்டன. உடனே எங்களைக் குறித்து, ‘‘அஷ்அரீ குலத்தைச் சேர்ந்தவர்கள் எங்கே?” என்று கேட்டுவிட்டு, எங்களுக்கு (ஒட்டக மந்தைகளில்) வெள்ளைத் திமில்கள் கொண்ட ஐந்து மந்தைகளைத் தரும்படி உத்தரவிட்டார்கள். நாங்கள் (அதைப் பெற்று) சென்றுகொண்டிருந்தபோது, நாங்கள் எங்களுக்குள், ‘‘நாம் என்ன காரியம் செய்துவிட்டோம். (நமக்குக் கொடுக்க முடியாது என்று நபி (ஸல்) அவர்கள் கூறியபின் மீண்டும் இவற்றை நாம் வாங்கிச் சென்றால்) இவற்றில் நமக்கு வளம் வழங்கப்படாதே” என்று பேசிக்கொண்டு நபி (ஸல்) அவர்களிடம் திரும்பிச் சென்றோம். ‘‘நாங்கள் தங்களிடம், யிநாங்கள் பயணம் செய்ய எங்களுக்கு ஒட்டகங்கள் கொடுங்கள்’ என்று கேட்டோம். யிநாங்கள் ஏறிச் செல்ல ஒட்டகம் கொடுக்க முடியாது’ என்று நீங்கள் சத்தியம் செய்தீர்களே மறந்துவிட்டீர்களா?” என்று கேட்டோம். அதற்கு அவர்கள், ‘‘நான் உங்களை ஒட்டகத்தில் ஏற்றி அனுப்பவில்லை. மாறாக, அல்லாஹ்தான் உங்களை (ஒட்டகத்தில்) ஏற்றி அனுப்பினான். அல்லாஹ்வின் மீதாணையாக! அவன் நாடினால், நான் இனி எந்த ஒரு வாக்குக்காகவும் சத்தியம் செய்து, பிறகு அது அல்லாததை அதைவிடச் சிறந்த தாகக் கருதும்பட்சத்தில், சிறந்ததையே செய்வேன்; சத்தியத்தை முறித்து அதற் காகப் பரிகாரம் செய்துவிடுவேன்” என்று சொன்னார்கள். இது இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 56",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		}
	]
}