{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘பஹ்ரைனுடைய நிதி எம்மிடம் வந்தால் உனக்கு இப்படி, இப்படி, இப்படி (அள்ளிக்) கொடுப்பேன்” என்று கூறினார்கள். நபி (ஸல்) அவர்கள் இறக்கும்வரை பஹ்ரைனுடைய நிதி வரவில்லை. (அபூபக்ர் (ரலி) அவர்களின் காலத்தில்) பஹ்ரைனுடைய நிதி வந்தபோது அபூபக்ர் (ரலி) அவர்கள் பொது அறிவிப்புச் செய்பவர் ஒருவரை அனுப்பினார்கள். அவர், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (இருந்து வரவேண்டிய) கடனோ, (நிறைவேற்றப்பட வேண்டிய) வாக்குறுதியோ (நிறைவேறாமல்) இருக்குமாயின் அவர் நம்மிடம் வரட்டும்” என்று கூறினார். நான், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் இன்னின்னவாறு சொன்னார்கள்” என்று கூறினேன். உடனே அபூபக்ர் (ரலி) அவர்கள் மூன்று முறை இரு கைகளையும் குவித்து அள்ளித் தந்தார்கள். அறிவிப்பாளர் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் தம் இரு கைகளையும் ஒன்றுசேர்த்து அள்ளிப் போடுவது போல் சைகை செய்யத் தொடங்கினார்கள். பிறகு எங்களிடம், ‘‘இப்படித்தான் எங்களிடம் முஹம்மத் பின் முன்கதிர் (ரஹ்) அவர்கள் சொன் னார்கள்” என்று கூறினார்கள்.55 ஒருமுறை சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் (இப்னுல் முன்கதிர் (ரஹ்) அவர்கள் வழியாகக்) கூறியதாவது: ஜாபிர் (ரலி) அவர்கள் கூறினார்கள்: நான் அபூபக்ர் (ரலி) அவர்களிடம் சென்று கேட்டேன். அவர்கள் எனக்குக் கொடுக்கவில்லை. மீண்டும் நான் அவர்களிடம் சென்றேன். அவர்கள் எனக்குக் கொடுக்கவில்லை. பிறகு மூன்றாம் முறையாக நான் அவர்களிடம் சென்று, ‘‘உங்களிடம் நான் (முதல் முறையாகக்) கேட்டும் நீங்கள் எனக்குத் தரவில்லை. பிறகு மீண்டும் உங்களிடம் கேட்டேன். நீங்கள் எனக்குத் தரவில்லை. பிறகு மீண்டும் உங்களிடம் கேட்டேன். நீங்கள் எனக்குத் தரவில்லை. ஒன்று, நீங்கள் எனக்குத் தர வேண்டும்; இல்லையெனில், என்னிடம் நீங்கள் கஞ்சத்தனம் காட்டுவதாகப் பொருள்” என்று கூறினேன். அதற்கு அவர்கள், ‘‘நான் உங்களிடம் கஞ்சத்தனம் காட்டுகிறேன் என்றா சொன்னீர்கள்? நான் உங்களுக்குத் தராமலிருந்துவிட்ட ஒவ்வொரு முறையும் உங்களுக்குத் தர விரும்பிய நிலையில்தான் (இருந்தேன்; இருப்பினும் தவிர்க்க முடியாத காரணத்தாலேயே) அப்படிச் செய்தேன்” என்று கூறினார்கள். மற்றோர் அறிவிப்பில், ‘‘எனக்கு அபூபக்ர் (ரலி) அவர்கள் கைகள் நிறைய ஒரு முறை அள்ளித் தந்துவிட்டு, யிஇதை எண்ணிக்கொள்’ என்று கூறினார்கள். நான் (எண்ணிப் பார்த்தபோது) அது ஐநூறு இருக்கக் கண்டேன். அபூபக்ர் (ரலி) அவர்கள், யிஇது போன்றதை இரு முறை எடுத் துக்கொள்’ என்று சொன்னார்கள்” என்று ஜாபிர் (ரலி) அவர்கள் கூறினார்கள். அறிவிப்பாளர் முஹம்மத் பின் முன்கதிர் (ரஹ்) அவர்கள், ‘‘கருமித்தனத்தை விட மோசமான நோய் உண்டா?” என்று சொன்னார்கள். அத்தியாயம் : 57",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 45
			}
		}
	]
}