{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"59": "Beginning of Creation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: நான் இறையில்லம் கஅபாவில் இரு மனிதர்களுக்கிடையே (பாதி) தூக்கமாகவும் (பாதி) விழிப்பாகவும் இருந்தபோது நுண்ணறிவாலும் இறைநம்பிக்கையாலும் நிரப்பப்பட்ட தங்கத் தட்டு ஒன்று என்னி டம் கொண்டுவரப்பட்டது. எனது நெஞ்சம் காறையெலும்பிலிருந்து அடிவயிறுவரை பிளக்கப்பட்டது. பிறகு ‘ஸம்ஸம்’ நீரால் என் வயிறு கழுவப்பட்டது. பிறகு, (என் இதயம்) நுண்ணறிவாலும் இறைநம்பிக்கை யாலும் நிரப்பப்பட்டது.20 மேலும், கோவேறுக் கழுதையைவிடச் சிறியதும் கழுதையைவிடப் பெரியதுமான யிபுராக்’ என்னும் (மின்னல் வேக) வாகனம் ஒன்று என்னிடம் கொண்டுவரப்பட்டது. நான் (அதில் ஏறி வானவர்) ஜிப்ரீல் (அலை) அவர்களுடன் சென்றேன். நாங்கள் முதல் வானத்தை அடைந்தோம். ‘‘யார் அது?” என்று கேட்கப்பட்டது. ஜிப்ரீல் (அலை), ‘‘ஜிப்ரீல்” என்று பதிலளித் தார். ‘‘உங்களுடன் (வந்திருப்பவர்) யார்?” என்று கேட்கப்பட்டது. அவர், ‘‘முஹம்மத்” என்று பதிலளித்தார். ‘‘அவரை அழைத்து வருமாறு ஆள் அனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், ‘‘ஆம்” என்றார். ‘‘அவரது வரவு நல்வரவாகட்டும்! அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. பிறகு நான் ஆதம் (அலை) அவர்களிடம் சென்றேன். அவர்களுக்கு சலாம் சொன்னேன். அவர்கள், ‘‘(என்) மகனும் இறைத் தூதருமான உங்கள் வரவு நல்வரவாகுக!” என்று சொன்னார்கள். பிறகு இரண்டாவது வானத்திற்கு நாங்கள் சென்றோம். ‘‘யார் அது?” என்று வினவப்பட்டது. அவர், ‘‘ஜிப்ரீல்” என்று பதிலளிக்க, ‘‘உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. அதற்கு அவர், ‘‘முஹம்மத் ‘‘ என்று பதிலளித்தார். ‘‘(அவரை அழைத்து வருமாறு) அவரிடம் ஆளனுப்பப்பட்டதா?” என்று கேட்கப் பட்டது. அதற்கு அவர், ‘‘ஆம்” என்று பதிலளித்தார். ‘‘அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. பிறகு நான், ஈசா (அலை) அவர்களிடமும் யஹ்யா (அலை) அவர்களிடமும் சென்றேன். அவ்விருவரும், ‘‘சகோதரரும் நபியுமாகிய உங்களின் வரவு நல்வர வாகட்டும்” என்று சொன்னார்கள். பிறகு நாங்கள் மூன்றாவது வானத்திற் குச் சென்றோம். ‘‘யார் அது?” என்று கேட்கப்பட்டது. யிஜிப்ரீல்’ என்று பதிலளிக் கப்பட்டது. ‘‘உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. ‘‘முஹம்மத்” என்று பதிலளித்தார். ‘‘(அவரை அழைத்து வருமாறு) அவருக்கு ஆளனுப்பப்பட்டதா?” என்று கேட்கப்பட்டது. ‘‘ஆம்” என்று பதிலளித்தார். ‘‘அவரது வரவு நல்வரவாகட் டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. பிறகு, நான் யூசுஃப் (அலை) அவர்களிடம் சென்றேன். அவர்களுக்கு சலாம் உரைத் தேன். அவர்கள், ‘‘சகோதரரும் நபியுமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்து) சொன்னார்கள். பிறகு, நாங்கள் நான்காவது வானத்திற் குச் சென்றோம். ‘‘யார் அது?” என்று கேட்கப்பட்டது. ‘‘ஞீஜிப்ரீல்” என்று பதிலளித்தார். உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. ‘‘முஹம்மத்” என்று பதிலளிக்கப்பட்டது. ‘‘(அவரை அழைத்து வருமாறு) அவருக்கு ஆளனுப்பப்பட்டதா?” என்று கேட்கப்பட்டது. ‘‘ஆம்” என்று பதிலளித்தார். ‘‘அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. நான் இத்ரீஸ் (அலை) அவர்களிடம் சென்றேன். அவர்களுக்கு சலாம் உரைத்தேன். அவர்கள், ‘‘சகோதரரும் நபியுமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்து) சொன்னார்கள். பிறகு நாங்கள் ஐந்தாவது வானத்திற்குச் சென்றோம். ‘‘யார் அது?” என்று கேட்கப்பட்டது. ‘‘ஞீஜிப்ரீல்” என்று பதிலளிக்கப்பட்டது. ‘‘உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. ‘‘முஹம்மத்” என்று பதிலளிக்கப்பட்டது. ‘‘(அவரை அழைத்து வருமாறு) அவருக்கு ஆளனுப்பப்பட்டதா?” என்று கேட்கப்பட்டது. ‘‘ஆம்” என்று (ஜிப்ரீல்) பதிலளித்தார். ‘‘அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. பிறகு நாங்கள் ஹாரூன் (அலை) அவர்களிடம் சென்றோம். நான் அவர்களுக்கு சலாம் உரைத்தேன். அவர்கள், ‘‘சகோதரரும் நபியுமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்து) சொன்னார்கள். பிறகு நாங்கள் ஆறாவது வானத்திற்குச் சென்றோம்..’ஞீயார் அது?” என்று கேட்கப் பட்டது. ‘‘ஜிப்ரீல்” என்று பதிலளிக்கப் பட்டது. ‘‘உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. ‘யிமுஹம்மத்” என்று பதிலளிக்கப்பட்டது. ‘‘(அவரை அழைத்து வருமாறு) அவருக்கு ஆளனுப் பப்பட்டதா? அவரது வரவு நல்வரவாகட் டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப்பட்டது. நான் மூசா (அலை) அவர்களிடம் சென்று (அவர்களுக்கு) சலாம் உரைத்தேன். அவர்கள், ‘‘சகோதரரும் நபியுமான உங்கள் வரவு நல்வரவாகட்டும்” என்று வாழ்த்தினார்கள். நான் அவர்களைக் கடந்து சென்றபோது அவர்கள் அழுதார்கள். ‘‘நீங்கள் ஏன் அழுகிறீர்கள்?” என்று அவர்களிடம் கேட்கப்பட்டது. அவர், ‘‘இறைவா! என் சமுதாயத்தாரில் சொர்க்கம் செல்பவர்களைவிட அதிகமானவர்கள் எனக்குப் பிறகு அனுப்பப்பட்ட இந்த இளைஞரின் சமுதாயத்தாரிலிருந்து சொர்க்கம் செல்வார்கள்” என்று பதிலளித்தார்கள். பிறகு நாங்கள் ஏழாவது வானத்திற்குச் சென்றோம். ‘‘யார் அது?” என்று வினவப்பட்டது. ‘‘ஜிப்ரீல்” என்று பதிலளிக்கப்பட்டது. ‘‘உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. ‘‘முஹம்மத்” என்று பதிலளிக்கப்பட்டது. ‘‘(அவரை அழைத்து வருமாறு) அவருக்கு ஆளனுப்பப்பட்டதா? அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்து) சொல்லப் பட்டது. நான் இப்ராஹீம் (அலை) அவர்களிடம் சென்று (அவர்களுக்கு) சலாம் உரைத்தேன். அவர்கள், ‘‘மகனும் நபியுமான உங்கள் வரவு நல்வரவாகட்டும்” என்று சொன் னார்கள். பிறகு, ‘அல்பைத்துல் மஅமூர்’ எனும் (வானவர்கள் அதிகம் சஞ்சரிக்கும்) இறையில்லம் எனக்கு (அருகே கொண்டு வந்து) காட்டப்பட்டது. நான் அதைக் குறித்து ஜிப்ரீலிடம் கேட்டேன். அவர், ‘‘இதுதான் ‘அல்பைத்துல் மஅமூர்’ ஆகும். இதில் ஒவ்வொரு நாளும் எழுபதாயிரம் வானவர்கள் தொழுகிறார்கள். அவர்கள் இதிலிருந்து வெளியே சென்றால் திரும்ப இங்கு வரமாட்டார்கள். அதுவே அவர்கள் கடைசியாக நுழைந்ததாகிவிடும்” என்று சொன்னார். பிறகு (வான் எல்லையிலுள்ள இலந்தை மரமான) யிசித்ரத்துல் முன்தஹா’ எனக்கு (அருகே கொண்டுவந்து) காட்டப்பட்டது. அதன் பழங்கள் (யமனில் உள்ள) யிஹஜ்ர்’ எனுமிடத்தின் (தயாரிக்கப்படும்) கூஜாக்கள் போல் இருந்தன. அதன் இலைகள் யானைகளின் காதுகளைப்போல் இருந்தன. அதன் வேர்ப் பகுதியில் நான்கு ஆறுகள் ஓடிக்கொண்டிருந்தன. (சல்சபீல், கவ்ஸர் ஆகிய) இரண்டு ஆறுகள் உள்ளே ஓடிக்கொண்டிருந்தன; மற்றும் (யூப்ரடீஸ், நைல் ஆகிய) இரண்டு ஆறுகள் வெளியே ஓடின. நான் ஜிப்ரீல் (அலை) அவர்களிடம் அவற்றைக் குறித்துக் கேட்டேன். அவர்கள், ‘‘உள்ளே இருப்பவை இரண்டும் சொர்க்கத்தில் உள்ளவையாகும். வெளியே இருப்பவை இரண்டும் நைல் நதியும் யூப்ரடீஸ் நதியும் ஆகும்” என்று பதிலளித்தார்கள். பிறகு என்மீது ஐம்பது (நேரத்) தொழுகைகள் கடமையாக்கப்பட்டன. நான் முன்னேறிச் சென்று இறுதியில் மூசா (அலை) அவர்களை அடைந்தேன். அவர்கள், ‘‘என்ன செய்தீர்கள்?” என்று கேட்டார்கள். நான், ‘‘என்மீது ஐம்பது தொழுகைகள் கடமையாக்கப்பட்டுள்ள”’ என்று பதிலளித்தேன். அதற்கு அவர்கள், ‘‘எனக்கு மக்களைப் பற்றி உங்களைவிட அதிகமாகத் தெரியும். நான் இஸ்ரவேலர் களுடன் பழகி நன்கு அனுபவப்பட்டுள் ளேன். உங்கள் சமுதாயத்தார் (இதைத்) தாங்கமாட்டார்கள். ஆகவே, உங்கள் இறைவனிடம் திரும்பிச் சென்று அவனி டம் (தொழுகைகளின் எண்ணிக்கையைக்) குறைத்துத் தரும்படி கேளுங்கள்” என்று சொன்னார்கள். நான் திரும்பச் சென்று இறைவனிடம் (அவ்வாறே) கேட்டேன். அதை அவன் நாற்பதாக ஆக்கினான். பிறகும் முதலில் சொன்னவாறே நடந்தது. மீண்டும் (சென்று நான் கேட்க, இறைவன் அதை) முப்பதாக ஆக்கினான். மீண்டும் அதைப் போலவே நடக்க (அதை) இறைவன் இருபதாக ஆக்கினான். நான் மூசா (அலை) அவர்களிடம் சென்றபோது அவர்கள் முன்பு போலவே சொல்ல (நான் இறைவனிடம் மீண்டும் குறைத்துக் கேட்க) அவன் அதை ஐந்தாக ஆக்கினான். பிறகு நான் மூசா (அலை) அவர்களி டம் சென்றேன். அவர்கள், ‘‘என்ன செய்தீர் கள்?” என்று கேட்க, ‘‘அதை இறைவன் ஐந்தாக ஆக்கிவிட்டான்” என்றேன். அதற்கு அவர்கள், ‘‘முன்பு சொன்னதைப் போலவே (இன்னும் குறைத்துக் கேட்கும்படி) சொன்னார்கள். அதற்கு, ‘‘நான் (இந்த எண்ணிக்கைக்கு) ஒப்புக்கொண்டுவிட்டேன்” என்று பதிலளித்தேன். அப்போது (அல்லாஹ்வின் தரப்பிலிருந்து அசரீரியாக), ‘‘நான் என் (ஐந்து வேளைத் தொழுகை எனும்) விதியை செயல்படுத்திவிட்டேன். என் அடியார்களுக்கு (ஐம்பது வேளைகளிலிருந்து ஐந்து வேளையாகக் குறைத்து கடமையை) எளிதாக்கி விட்டேன். ஒரு நற்செயலுக்குப் பத்து நன்மைகளை நான் வழங்குவேன்” என்று அறிவிக்கப்பட்டது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது ‘அல்பைத்துல் மஅமூர்’ தொடர்பாக அபூஹுரைரா (ரலி) அவர்களும் அறிவித்துள்ளார்கள். அத்தியாயம் : 59",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 18
			}
		}
	]
}