{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "அபூதர் (ரலி) அவர்கள் அறி வித்து வந்ததாக அனஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: நான் மக்காவில் இருந்தபோது என் வீட்டின் கூரை (முகடு) பிரிக்கப்பட்டது. (அங்கிருந்து வானவர்) ஜிப்ரீல் அவர்கள் இறங்கி (வந்து) என் நெஞ்சைப் பிளந் தார்கள். பிறகு அதை, ‘ஸம்ஸம்’ தண்ணீ ரால் கழுவினார்கள். பிறகு நுண்ணறி வாலும் இறைநம்பிக்கையாலும் நிரம்பிய தங்கத் தட்டு ஒன்றைக் கொண்டுவந்து என் நெஞ்சில் அதை ஊற்றி (நிரப்பி) னார்கள். பிறகு என் கையைப் பிடித்து என்னை அழைத்துக்கொண்டு வானத் திற்கு ஏறிச் சென்றார்கள். (பூமிக்கு) அண்மையிலுள்ள வானத் திற்கு வந்தபோது வானத்தின் காவலரி டம், ‘‘திறங்கள்” என்று கூறினார்கள். அதற்கு அவர், ‘‘யார் அது?” என்று கேட்டார். ஜிப்ரீல் அவர்கள், ‘‘இதோ ஜிப்ரீல்” என்று பதிலளித்தார்கள். அதற்கு அவர், ‘‘உங்களுடன் வேறெவரேனும் இருக்கிறரா?” என்று கேட்டார். அவர்கள், ‘‘என்னுடன் முஹம்மத் அவர்கள் இருக்கிறார்கள்” என்று பதிலளித்தார்கள். அதற்கு அவர், ‘‘(அவரை அழைத்துவரச் சொல்லி) அவரிடம் (ஆள்) அனுப்பப் பட்டதா?” என்று கேட்க, ஜிப்ரீல் அவர்கள், ‘‘ஆம், திறங்கள்” என்று கூறினார்கள். (முதல் வானத்தின் கதவு திறக்கப் பட்டு) நாங்கள் வானத்தில் (இன்னும்) மேலே சென்றபோது அங்கே ஒரு மனிதர் இருந்தார். அவரது வலப் பக்கத்திலும் மக்கள் இருந்தனர்; இடப் பக்கத் திலும் மக்கள் இருந்தனர். அவர் தமது வலப் பக்கம் பார்க்கும்போது சிரித்தார்; தமது இடப் பக்கம் பார்க்கும்போது அழுதார். (பிறகு, என்னைப் பார்த்து,) ‘‘நல்ல இறைத்தூதரே வருக! நல்ல மகனே வருக!” என்று கூறினார். நான் ‘‘ஜிப்ரீலே! இவர் யார்?” என்று கேட்டேன். அவர், ‘‘இவர் ஆதம் (அலை) அவர்கள்; அவர்களுடைய வலப் பக்கமும் இடப் பக்கமும் இருக்கும் மக்கள் அவர்களுடைய சந்ததிகள். அவர்களில் வலப் பக்கமிருப்பவர்கள் சொர்க்கவாசிகள். இடப் பக்கத்தில் இருப்பவர்கள் நரகவாசிகள். ஆகவேதான், அவர்கள் வலப் பக்கம் (சொர்க்கவாசிகளான) தம் மக்களைப் பார்க்கும்போது (மகிழ்ச்சியால்) சிரிக்கி றார்கள்; இடப் பக்கம் (நரகவாசிகளான தம் மக்களைப்) பார்க்கும்போது (வேதனைப் பட்டு) அழுகிறார்கள்” என்று பதிலளித் தார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் (இன்னும் உயரத்திற்கு) ஏறிச் சென்றார்கள். பிறகு இரண்டாம் வானத்திற்கு வந்து அதன் காவலரிடம், ‘‘திறங்கள்” என்று கூறினார்கள். அதன் காவலரும் முதலாமவர் கேட்டதைப் போன்றே கேட்டார். பிறகு (முன்பு போலவே ஜிப்ரீல் அவர்கள் பதில் கூறிய பின் வாயிலைத்) திறந்தார். அனஸ் (ரலி) அவர்கள் தொடர்ந்து கூறினார்கள்: ‘‘நபி (ஸல்) அவர்கள், வானங்களில் இத்ரீஸ் (அலை), மூசா (அலை), ஈசா (அலை), இப்ராஹீம் (அலை) ஆகியோரைக் கண்டதாகக் கூறினார்களே தவிர அவர் களுடைய இருப்பிடங்கள் எங்கிருந்தன என்று அவர்கள் எனக்குக் குறிப்பிட்டுக் கூறவில்லை. அவர்கள் ஆதம் (அலை) அவர்களை அண்மையிலுள்ள (முதல்) வானத்தில் கண்டதாகவும் இப்ராஹீம் (அலை) அவர்களை ஆறாவது வானத்தில் கண்டதாகவும் மட்டுமே சொன்னார்கள்” என்று அபூதர் (ரலி) அவர்கள் கூறினார்கள். அனஸ் (ரலி) அவர்கள் மேலும் கூறினார்கள்: ‘‘ஜிப்ரீல் (அலை) அவர்கள் இத்ரீஸ் (அலை) அவர்களைக் கடந்து சென்ற போது, ‘‘நல்ல இறைத்தூதரே வருக! நல்ல சகோதரரே, வருக!” என்று கூறினார்கள். நான், ‘‘இவர் யார்?” என்று கேட்டேன். அதற்கு ஜிப்ரீல் (அலை) அவர்கள், ‘‘இவர் இத்ரீஸ்” என்று கூறினார்கள். பிறகு மூசா அவர்களைக் கடந்து சென்றேன். அப்போது அவர்கள், ‘‘நல்ல நபியே வருக! நல்ல சகோதரரே, வருக” என்று கூறினார்கள். நான், ‘‘இவர் யார்?” என்று (ஜிப்ரீலிடம்) கேட்டேன். அவர்கள், ‘‘இவர் மூசா” என்று கூறினார்கள். பிறகு நான், ஈசா அவர்களைக் கடந்து சென்றேன். அவர்களும், ‘‘நல்ல நபியே வருக! நல்ல சகோதரரே, வருக!” என்று கூறினார்கள். நான், ‘‘இவர் யார்?” என்று (ஜிப்ரீலிடம்) கேட்டேன். அதற்கு ஜிப்ரீல் அவர்கள், ‘‘(இவர்) ஈசா” என்று பதிலளித் தார்கள். பிறகு நான் இப்ராஹீம் (அலை) அவர் களைக் கடந்து சென்றேன். அவர்கள், ‘‘நல்ல நபியே, வருக! நல்ல மகனே, வருக!” என்று கூறினார்கள். நான், ‘‘இவர் யார்?” என்று கேட்டேன். அதற்கு, ‘‘இவர் இப்ராஹீம்” என்று ஜிப்ரீல் அவர்கள் பதிலளித்தார்கள்.” என்று நபி (ஸல்) அவர்கள் கூறினார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள், அபூஹய்யா அல்அன்சாரி (ரலி) அவர்கள் ஆகிய இருவரும் அறிவித்ததாக இப்னு ஹஸ்ம் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் கூறினார்கள்: பிறகு ஜிப்ரீல் அவர்கள் என்னை அழைத்துக்கொண்டு மேலே சென்றார்கள். நான் ஓர் உயரமான இடத்திற்கு வந்தபோது அங்கு நான் (வானவர்கள் விதிகளை எழுதிக்கொண்டிருக்கும்) எழுதுகோல்களின் ஓசையைச் செவியுற்றேன். இப்னு ஹஸ்ம் (ரஹ்) அவர்களும் அனஸ் பின் மாலிக் (ரலி) அவர்களும் கூறியதாவது: நபி (ஸல்) அவர்கள் கூறினார்கள்: அப்போது அல்லாஹ் என்மீது (என் சமுதாயத்தாருக்காக) ஐம்பது தொழுகை களைக் கடமையாக்கினான். அதைப் பெற்றுக்கொண்டு நான் திரும்பியபோது மூசா அவர்களைக் கடந்து சென்றேன். அப்போது மூசா அவர்கள், ‘‘உங்கள் சமுதாயத்தார் மீது என்ன கடமையாக்கப்பட்டது?” என்று கேட்டார்கள். நான், ‘‘அவர்கள்மீது ஐம்பது தொழுகைகள் கடமையாக்கப்பட்டுள்ள”’ என்று பதிலளித்தேன். அவர்கள், ‘‘அப்படியானால் உங்கள் இறைவனிடம் திரும்பிச்சென்று (சற்று குறைத்துக் கடமையாக்கும்படி) கேளுங்கள். ஏனெனில், உங்கள் சமுதாயத்தாரால் அதை நிறை வேற்ற முடியாது” என்று கூறினார்கள். உடனே நான் என் இறைவனிடம் திரும்பிச் சென்று (தொழுகைகளின் எண்ணிக்கையைக் குறைக்கும்படி) கேட்டேன். அவன் அதில் ஒரு பகுதியைக் குறைத்தான். மூசா அவர்களிடம் திரும்பிச் சென்றபோது, ‘‘உங்கள் இறைவனிடம் திரும்பிச் செல்லுங்கள்” என்று கூறி முன்புபோல் (‘‘உங்கள் சமுதாயத்தாரால் அதை நிறைவேற்ற முடியாது”) என்று கூறினார்கள். (நான் அவ்வாறே திரும்ப இறைவனிடம் சென்று இன்னும் குறைக்கும்படி கோர) அவன் அதில் ஒரு பகுதியைக் குறைத்தான். நான் மூசா அவர்களிடம் மீண்டும் சென்று கூறிய போது, ‘‘உங்கள் இறைவனிடம் திரும்பச் சென்று இன்னும் குறைத்துக் கேளுங்கள். ஏனெனில், உங்கள் சமுதாயத்தார் அதற்குச் சக்தி பெறமாட்டார்கள்” என்று கூற, நான் திரும்பிச் சென்று, என் இறைவனிடம் (இன்னும் சற்று குறைக்கும்படி) கேட்டேன். அதற்கு அவன், ‘‘அவை ஐந்து (வேளைத் தொழுகைகள்) ஆகும். அவையே (பிரதிபலனில்) ஐம்பது (வேளைத் தொழுகைக்கு ஈடு) ஆகும். (ஒருமுறை சொல்லப் பட்ட) சொல் என்னிடம் மாற்றப்படுவதில்லை” என்று கூறினான். உடனே, நான் மூசா (அலை) அவர்களிடம் திரும்பிச் சென்றேன். அவர்கள், ‘‘உங்கள் இறைவனிடம் திரும்பிச் செல்லுங்கள்” என்று கூறினார்கள். நான், ‘‘என் இறைவனிடம் (மேலும் சலுகை கோர) வெட்கப்படுகின்றேன்” என்று பதிலளித்தேன். பிறகு ஜிப்ரீல் (அலை) அவர்கள் என்னை அழைத்துக்கொண்டு (வானுலகின் எல்லையான) யிசித்ரத்துல் முன்தஹா’வுக்குச் சென்றார்கள். அப்போது நான் அறிய முடியாதபடி பல வண்ணங்கள் அதைச் சூழ்ந்து மூடியிருந்தன. பிறகு நான் உள்ளே அனுமதிக்கப்பட்டேன். அப்போது அங்கே முத்தாலான கூடாரங்களைக் கண்டேன். அதன் மண் (நறுமணம் வீசும்) கஸ்தூரியாக இருந்தது.17 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 60",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		}
	]
}