{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3344,
			"arabicnumber": 3344,
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்: அலீ (ரலி) அவர்கள் (யமனிலிருந்து) நபி (ஸல்) அவர்களிடம் சிறிய தங்கக் கட்டி ஒன்றை அனுப்பிவைத்தார்கள். அதை நபி (ஸல்) அவர்கள் அக்ரஉ பின் ஹாபிஸ் அல்ஹன்ழலீ அல்முஜாஷியீ (ரலி), உயைனா பின் பத்ர் அல் ஃபஸாரீ (ரலி), பனூ நப்ஹான் குலத்தாரில் ஒருவ ரான ஸைத் அத்தாயீ (ரலி), பனூ கிலாப் குலத்தாரில் ஒருவரான அல்கமா பின் உலாஸா அல்ஆமிரி (ரலி) ஆகிய நால்வரிடையே பங்கிட்டுவிட்டார்கள். அதனால் குறைஷியரும் அன்சாரிகளும் கோபமடைந்து, ‘‘நஜ்த்வாசிகளின் தலைவர் களுக்குக் கொடுக்கிறார்; நம்மை விட்டு விடுகிறாரே” என்று கூறினார்கள். அதற்கு நபி (ஸல்) அவர்கள், ‘‘இவர் கள் (இப்போதுதான் இஸ்லாத்தைத் தழுவி யிருப்பதால்) அவர்களுடைய உள்ளங் களை (முழுமையாக) இணக்கமாக்கு வதற்காக (அவர்களுடன் நேசம் பாராட்டும் விதத்தில்)தான் கொடுத்தேன்” என்று கூறினார்கள். அப்போது கண்கள் பஞ்சடைந்த, கன்னங்கள் உப்பியிருந்த, நெற்றியோரங்கள் உயர்ந்திருந்த, அடர்த்தியான தாடி கொண்ட, தலைமுடி மழிக்கப்பட்டிருந்த மனிதர் ஒருவர் முன்வந்து, ‘யிமுஹம்மதே! அல்லாஹ்வுக்கு அஞ்சுங்கள்” என்று கூறினார். உடனே நபி (ஸல்) அவர்கள் ‘‘நானே (அல்லாஹ்வுக்கு) மாறு செய்தால் வேறெவர்தான் அவனுக்குக் கீழ்ப்படிவார்? பூமியில் வசிப்பவர்கள் விஷயத்தில் அல்லாஹ் என்மீது நம்பிக்கை வைத்திருக்க, நீங்கள் என்மீது நம்பிக்கை வைக்க மாட்டீர்களா?” என்று கேட்டார்கள். அப்போது வேறொரு மனிதர் இப்படி (குறை) சொன்னவரைக் கொல்வதற்கு அனுமதி கேட்டார். அனுமதி கேட்ட அவர் காலித் பின் அல்வலீத் (ரலி) அவர்கள் தான் என்று நினைக்கின்றேன்லி அவரை நபி (ஸல்) அவர்கள், (இதைச் சொன்னவரைக் கொல்ல வேண்டாமென்று) தடுத்துவிட்டார்கள். (குறை சொன்ன) அந்த ஆள் திரும்பிச் சென்றபோது நபி (ஸல்) அவர்கள், ‘‘இந்த மனிதரின் பரம்பரையிலிருந்து லிஅல்லது இவரின் பின்னேலி ஒரு சமுதாயத்தார் தோன்றுவர். அவர்கள் குர்ஆனை ஓதுவார்கள். ஆனால், அது அவர்களு டைய தொண்டைக் குழிகளை தாண்டிச் செல்லாது. அவர்கள் வேட்டையாடப்பட்ட பிராணியின் உடலிலிருந்து (அதன் மீது எய்யப்பட்ட) அம்பு வெளியேறிவிடு வதைப்போல் மார்க்கத்திலிருந்து வெளி யேறிவிடுவார்கள்; இஸ்லாமியர்களைக் கொல்வார்கள்; சிலைவழிபாடு புரிபவர் களை விட்டுவிடுவார்கள். நான் அவர்க(ள் வாழும் நாட்க)ளை அடைந்தால் யிஆத்’ கூட்டத்தார் அழிக்கப்பட்டதைப் போன்று அவர்களை நான் நிச்சயம் அழித்து விடுவேன்.” என்று கூறினார்கள்.20 அத்தியாயம் : 60",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 19
			}
		}
	]
}