{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3358,
			"arabicnumber": 3358,
			"text": "நபி (ஸல்) அவர்கள் சொன்ன தாக) அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: இப்ராஹீம் (அலை) அவர்கள் மூன்று பொய்களைத் தவிர வேறு பொய் எதுவும் பேசியதில்லை. அவற்றில் இரண்டு வல்லமையும் மாண்புமிக்க அல்லாஹ்வின் (மார்க்கத்தின் நலன் காக்கும்) விஷயத்தில் சொன்னவையாகும். அவை: 1. (அவரை இணைவைக்கும் திருவிழாவிற்கு மக்கள் அழைத்தபோது,) ‘‘நான் நோயுற்றிருக்கின்றேன்” என்று (அதில் கலந்துகொள்ளாமல் தவிர்ப்பதற்காகக்) கூறியது.30 2. (சிலைகளை உடைத்துப் பெரிய சிலையின் தோளில் கோடரியை மாட்டி விட்டு மக்கள், ‘‘இப்படிச் செய்தது யார்?” என்று கேட்டபோது,) ‘‘ஆயினும், இவர்களில் பெரியதான இந்தச் சிலைதான் இதைச் செய்தது” என்று கூறியது.31 3. (மூன்றாவது முறையாகப் பொய் சொன்ன சூழ்நிலை வருமாறு:) ஒருநாள் இப்ராஹீம் (அலை) அவர்களும் (அவர்களின் துணைவியார்) சாரா (அலை) அவர்களும் கொடுங்கோல் மன்னர்களில் ஒருவனுடைய வழியாகச் சென்றார்கள்.32 அப்போது அந்த மன்னனிடம் (அவர்களைக் குறித்து) ‘‘இங்கு ஒரு மனிதர் வந்திருக்கிறார்: அவருடன் மனிதர்களிலேயே மிக அழகான பெண்ணும் இருக்கிறாள்” என்று கூறப்பட்டது. உடனே இப்ராஹீம் (அலை) அவர்களை அழைத்து வரச்சொல்லி அந்த மன்னன் ஆள் அனுப்பி னான். (அவர்கள் வந்தவுடன்) அவர்களிடம் சாராவைப் பற்றி, ‘‘இவர் யார்?” என்று விசாரித்தான். இப்ராஹீம் (அலை) அவர்கள், ‘‘என் சகோதரி” என்று பதிலளித் தார்கள். பிறகு சாரா (அலை) அவர்களிடம் சென்று, ‘‘சாராவே! பூமியின் மீது உன்னையும் என்னையும் தவிர இறைநம்பிக்கை உடையவர் (தற்போது) எவரும் இல்லை. இவனோ என்னிடம் உன்னைப் பற்றிக் கேட்டுவிட்டான். நான், ‘நீ என் சகோதரி’ என்று அவனுக்குத் தெரிவித்துவிட்டேன். ஆகவே, நீ (உண்மையைச் சொல்லி) என்னைப் பொய்யனாக்கிவிடாதே” என்று கூறினார்கள் அந்த மன்னன் சாரா (அலை) அவர்களைக் கூப்பிட்டு அனுப்பினான். சாரா (அலை) அவர்கள் அவனிடம் சென்றபோது அவன் அவரைத் தன் கையால் தழுவ முயன்றான். உடனே அவன் (வலிப்பு நோயால்) தண்டிக்கப் பட்டான். அவன் (சாரா (அலை) அவர்களிடம்,) ‘‘அல்லாஹ்விடம் எனக்காக (என் கைகளை குணப்படுத்தும்படி) பிரார்த்தனை செய். நான் உனக்குத் தீங்கு செய்யமாட்டேன்” என்று சொன்னான். உடனே, சாரா (அலை) அவர்கள் அல்லாஹ்விடம் பிரார்த்திக்க, அவன் (வலிப்பிலிருந்து) விடுவிக்கப்பட்டான். பிறகு, இரண்டாவது முறையாக அவர்களை அணைக்க முயன்றான். முன்பு போலவே மீண்டும் தண்டிக்கப்பட்டான். அல்லது அதைவிடக் கடுமையாகத் தண்டிக்கப் பட்டான். அப்போதும், ‘‘எனக்காக (என் கைகளை குணப்படுத்தும்படி) அல்லாஹ் விடம் பிரார்த்தனை செய். நான் உனக்குத் தீங்கு செய்யமாட்டேன்” என்று சொன் னான். அவ்வாறே அவர் பிரார்த்திக்க, அவன் (வலிப்பிலிருந்து) விடுவிக்கப்பட்டான். பிறகு, தன் காவலன் ஒருவனை அழைத்து, ‘‘நீங்கள் என்னிடம், ஒரு மனிதரைக் கொண்டு வரவில்லை; ஒரு ஷைத்தானைத் தான் கொண்டுவந்துள்ளீர்கள்” என்று சொன்னான். பிறகு ஹாஜர் அவர்களை, சாரா (அலை) அவர்களுக்குப் பணியாளாகக் கொடுத்தான். சாரா (அலை) அவர்கள், இப்ராஹீம் (அலை) அவர்களிடம் அவர்கள் தொழுதுகொண்டிருக்கும்போது வந்தார்கள். இப்ராஹீம் (அலை) அவர்கள் கைகளால் சைகை செய்து, யிஎன்ன நடந்தது?› என்று கேட்டார்கள். அவர், ‘‘அல்லாஹ் நிராகரிப்பாளனின் லிஅல்லது தீயவனின்லி சூழ்ச்சியை முறியடித்து அவன் மீதே திருப்பிவிட்டான். ஹாஜரைப் பணிப்பெண்ணாக அளித்தான் என்று கூறினார்கள்.33 (அபூஹுரைரா (ரலி) அவர்கள் கூறினார்கள்:) வான் மழை (பிரதேச) மக்களே! அவர் (ஹாஜர்)தான் உங்கள் தாயார்.34 அத்தியாயம் : 60",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 33
			}
		}
	]
}