{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3404,
			"arabicnumber": 3404,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: மூசா (அலை) அவர்கள் மிகவும் வெட்கப்படுபவர்களாகவும் அதிகமாக (தம் உடலை) மறைத்துக்கொள்பவர்களாகவும் இருந்தார்கள். அவர்களுடைய மேனியிலிருந்து சிறிதளவுகூட வெளியே தெரியாது. அவர்கள் (அதிகமாக) வெட்கப்பட்ட காரணத்தால்தான் இப்படி தம் உடலை அவர்கள் மறைத்துக்கொண்டார்கள். அப்போது, இஸ்ரவேலர்களில் அவர்களுக்கு மனவேதனை தர விரும்பியவர்கள் அவர்களுக்குத் துன்பம் தந்தனர்; ‘‘இவருடைய சருமத்தில் ஏதோ குறைபாடு இருப்பதால்தான் இந்த அளவுக்கு இவர் (தமது மேனியை) மறைத்துக்கொள்கிறார். (இவருக்குக்) தொழுநோய் இருக்க வேண்டும்; அல்லது விரை வீக்கம் இருக்க வேண்டும்; அல்லது வேறு ஏதேனும் குறைபாடு இருக்க வேண்டும்” என்று கூறினார்கள். மூசா (அலை) அவர்களைப் பற்றி அவர்கள் சொன்ன குறைகளிலிருந்து அவர் தூய்மையானவர் என்று நிரூபித்திட அல்லாஹ் விரும்பினான். ஆகவே, (இறைவனின் திட்டப்படி) ஒருநாள் மூசா (அலை) அவர்கள் மட்டும் (குளிக்குமிடத் திற்குத்) தனியாகச் சென்று, தம் ஆடைகளை (கழற்றி)க் கல்லின் மீது வைத்துவிட்டுப் பிறகு குளித்தார்கள். குளித்து முடித்தவுடன் தம் துணிகளை எடுத்துக்கொள்வதற்காக அவற்றை நோக்கிச் சென்றார்கள். அப்போது அந்தக் கல் அவர்களுடைய துணியுடன் ஓடலாயிற்று. மூசா (அலை) அவர்கள், தம் தடியை எடுத்துக்கொண்டு கல்லை விரட்டிப் பிடிக்க முனைந்தார்கள். ‘‘கல்லே என் துணி! கல்லே என் துணி!” என்று குரல் எழுப்பலானார்கள். (அதை விரட்டிச் சென்றபடி) இறுதியில் இஸ்ர வேலர்களின் பிரமுகர்கள் இருக்கும் இடத்திற்கு வந்து சேர்ந்தார்கள். அப்போது இஸ்ரவேலர்கள், மூசா (அலை) அவர்கள் அல்லாஹ்வின் படைப்புகளிலேயே மிக அழகானவர்களாக இருப்பதை, அவர்களை ஆடையில்லா கோலத்தில் கண்டதன் மூலம் பார்த்துக்கொண்டார்கள். அவர்கள் சொன்ன குறைபாட்டிலிருந்து மூசா (அலை) அவர்களை அல்லாஹ் தூய்மை யாளராக ஆக்கினான். கல் (ஓடாமல்) நின்றுவிட்டது. உடனே மூசா (அலை) அவர்கள், தமது துணியை எடுத்துக்கொண்டு (கோபத்தில்) தம் கைத்தடியால் அந்தக் கல்லை அடிக்க லானார்கள். (அறிவிப்பாளர் அபூஹுரைரா (ரலி) அவர்கள் கூறுகிறார்கள்:) அல்லாஹ்வின் மீதாணையாக! அந்தக் கல்லின் மீது அவர்கள் (தடியால்) அடித்த காரணத்தால் மூன்று அல்லது நான்கு அல்லது ஐந்து வடுக்கள் ஏற் பட்டன. இந்த நிகழ்ச்சியைத்தான், ‘‘இறைநம்பிக்கையாளர்களே! மூசாவுக்குத் துன்பம் தந்தவர்களைப் போன்று நீங்கள் ஆகிவிடாதீர்கள். அவர்கள் (இட்டுக்கட்டிக்) கூறியவற்றிலிருந்து மூசா தூய்மையானவர் என்று அல்லாஹ் நிரூபித்துவிட்டான். மேலும், அவர் அல்லாஹ்விடம் கண்ணியத்திற்குரியவராக இருந்தார்” (33:69) எனும் இறைவசனம் குறிக்கின்றது.83 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 60",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 77
			}
		}
	]
}