{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "நபி (ஸல்) அவர்கள்கூறினார்கள்: மூன்று பேரைத் தவிர வேறெவரும் தொட்டிலில் (குழந்தையாக இருக்கும்போது) பேசியதில்லை. (ஒருவர்) ஈசா (அலை) அவர்கள். (மற்றொருவர்) இஸ்ரவேலர்களால் யிஜுரைஜ்’ என்றழைக்கப்பட்டுவந்த (நல்ல) மனிதர் ஒருவர். (ஒருமுறை) அவர் தொழுதுகொண்டிருந்தார். அப்போது அவருடைய தாயார் வந்து அவரை அழைத்தார். ஜுரைஜ் (தம் மனத்திற்குள்) ‘‘அவருக்கு நான் பதிலளிப்பதா? தொழுவதா?” என்று கூறிக்கொண்டார். (பதிலளிக்கவில்லை.) அதனால் கோபமடைந்த அவரின் தாய், ‘‘இறைவா! இவனை விபசாரிகளின் முகங்களில் விழிக்கச்செய்யாமல் மரணிக்கச்செய்யாதே!” என்று கூறிவிட்டார். (ஒருமுறை) ஜுரைஜ் தமது ஆசிரமத்தில் இருந்தபோது அவரிடம் ஒரு பெண் வந்து (தன்னுடன் தகாத உறவு கொள்ளும்படி அழைத்துப்) பேசினாள். அதற்கு அவர் மறுத்துவிட்டார். ஆகவே, (அவள் அவரைப் பழிவாங்குவதற்காக) ஓர் ஆட்டு இடையனிடம் சென்று அவனைத் தன் வசப்படுத்தி (அவனுடன் விபசாரம் புரிந்து) ஒரு குழந்தையைப் பெற்றெடுத் தாள். பிறகு யிஇது ஜுரைஜுக்குப் பிறந்தது’ என்று (மக்களிடம்) சொன்னாள். உடனே மக்கள் ஜுரைஜிடம் சென்று அவரது ஆசிரமத்தை இடித்து அவரைக் கீழே இறங்கிவரச்செய்து அவரை ஏசினார்கள். உடனே ஜுரைஜ் அங்கத் தூய்மை செய்து தொழுதுவிட்டு, பின்னர் அந்தக் குழந்தையிடம் சென்று, ‘‘குழந்தையே! உன் தந்தை யார்?” என்று கேட்டார். அக்குழந்தை, ‘‘(இன்ன) இடையன்” என்று பேசியது. அதைக் கண்டு (உண்மையை உணர்ந்துகொண்ட) அந்த மக்கள், ‘‘தங்கள் ஆசிரமத்தை நாங்கள் தங்கத்தால் கட்டித் தருகிறோம்” என்று கூறினார்கள். அதற்கு அவர், ‘‘இல்லை, களிமண்ணால் கட்டித் தந்தாலே போதும்” என்று கூறிவிட்டார். (மூன்றாமவர்) இஸ்ரவேலர்களில் ஒரு பெண் தன் மகன் ஒருவனுக்குப் பால் கொடுத்துக்கொண்டிருந்தாள். அப்போது அழகும் பொலிவும் மிக்க ஒரு மனிதன் வாகனத்தில் ஏறிச் சென்றுகொண்டிருந்தான். உடனே அவள், ‘‘இறைவா! என் மகனை இவனைப் போல் ஆக்குவாயாக!” என்று துஆ செய்தாள். உடனே அந்தக் குழந்தை அவளது மார்பை விட்டுவிட்டு சவாரி செய்பவனை நோக்கி, ‘‘இறைவா! இவனைப் போல் என்னை ஆக்கிவிடாதே” என்று கூறியது. பிறகு அவளது மார்பை நோக்கிப் பால் குடிக்கச் சென்றது. லிஇந்த இடத்தில் நபி (ஸல்) அவர்கள் தம் விரலை உறிஞ்சுவது போல் தெரிந்ததுலி பிறகு அக் குழந்தை ஓர் அடிமைப் பெண்ணுக்கு அருகில் கொண்டு செல்லப்பட்டது. அப்போது அந்தப் பெண், ‘‘இறைவா! என் மகனை இவளைப்போல் ஆக்கிவிடாதே” என்று கூறினாள். உடனே அக்குழந்தை அவளது மார்பை விட்டுவிட்டு, ‘‘இறைவா! என்னை இவளைப் போல் ஆக்குவாயாக!” என்று கூறியது. அந்தப் பெண் (வியப்படைந்து), ‘‘ஏன் இப்படிச் சொல்கிறாய்?” என்று கேட்டதற்கு அக்குழந்தை, ‘‘வாகனத்தில் ஏறிச் சென்றவன் கொடுங் கோலர்களில் ஒருவன்; இந்த அடிமைப் பெண்ணைக் குறித்து மக்கள் (அவதூறாக) ‘நீ திருடிவிட்டாய்; விபசாரம் செய்து விட்டாய்’ என்று கூறுகிறார்கள். ஆனால், இவள் அப்படி எதுவும் செய்யவில்லை” என்று பதிலளித்தது.119 அத்தியாயம் : 60",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 107
			}
		}
	]
}