{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"7": "Rubbing hands and feet with dust (Tayammum)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 347,
			"arabicnumber": 347,
			"text": "ஷகீக் பின் சலமா (ரஹ்) அவர்கள் கூறியதாவது: நான் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி), அபூமூசா அல்அஷ்அரீ (ரலி) ஆகியோருடன் அமர்ந்திருந்தேன். அப்போது அபூமூசா (ரலி) அவர்கள் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம், “பெருந்துடக்கு ஏற்பட்டு (குளியல் கடமையாகி)விட்ட ஒரு மனித ருக்கு ஒரு மாத காலம்வரை தண்ணீர் கிடைக்காவிட்டாலும் ‘தயம்மும்’ செய்யா மலும் தொழாமலும் இருந்துவிட வேண்டி யதுதானா? அப்படியானால் ‘அல்மாயிதா’ அத்தியாத்தில் வரும் “உங்களுக்குத் தண்ணீர் கிடைக்காதபோது, சுத்தமான மண்ணால் ‘தயம்மும்’ செய்து கொள்ளுங் கள்” எனும் இந்த (5:6ஆவது) வசனத்தை என்ன செய்வீர்கள்?” என்று கேட்டார்கள். அதற்கு அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், “இந்த விஷயத்தில் (மக்களுக்குப் பொதுவாக) அனுமதி அளிக்கப்பட்டுவிடுமானால், தண்ணீர் அவர்களுக்குக் குளிராகத் தெரிந்தால்கூட தயம்மும் செய்யத் தொடங்கிவிடுவார்கள்” என்றார்கள். -(அறிவிப்பாளர் அஃமஷ் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஷகீக் (ரஹ்) அவர்களிடம்,) “இதற்காகத்தான் ‘தயம்மும்’ செய்வதை நீங்கள் வெறுக்கிறீர்களா?” என்று நான் கேட்டேன். அதற்கு ஷகீக் (ரஹ்) அவர்கள் ‘ஆம்’ என்று பதிலளித் தார்கள்.- உடனே அபூமூசா (ரலி) அவர்கள் கேட்டார்கள்: உமர் (ரலி) அவர்களிடம் அம்மார் பின் யாசிர் (ரலி) அவர்கள் சொன்ன செய்தியை நீங்கள் கேள்விப்பட வில்லையா? (அச்செய்தி வருமாறு:) அம்மார் (ரலி) அவர்கள் கூறினார்கள்: என்னை ஒரு தேவைக்காக (படைப்பிரி வொன்றில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுப்பிவைத்தார்கள். அப்போது எனக்கு பெருந்துடக்கு ஏற்பட்டு (குளியல் கடமையாகி)விட்டது. ஆனால், தண்ணீர் கிடைக்கவில்லை. எனவே, நான் (குளியலுக்குத் தயம்மும் செய்வதற்காகப்) பிராணிகள் புரள்வதைப் போன்று மண்ணில் புரண்டேன். (ஊர் திரும்பியதும்) இந்தச் செய்தியை நான் நபி (ஸல்) அவர்களிடம் சொன் னேன். அப்போது நபி (ஸல்) அவர்கள் தமது கையை பூமியில் ஓர் அடி அடித்து, பின்னர் அதை உதறிவிட்டு, ‘தமது வலக் கரத்தால் இடது புறங்கையை’ அல்லது ‘தமது இடக் கரத்தால் வலது புறங்கையைத்’ தடவினார்கள். பிறகு இரு கைகளால் தமது முகத்தையும் தடவிவிட்டு, “இப்படி நீர் செய்திருந்தால் உமக்குப் போதுமான தாயிருந்திருக்கும்” என்று கூறினார்கள். (இந்நிகழ்ச்சியைக் கேட்டுவிட்டு) அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள், “அம்மார் சொன்னதில் உமர் (ரலி) அவர்களுக்கு மனநிறைவு ஏற்படவில்லை என்பது உங்களுக்குத் தெரியாதா?” என்று (அபூமூசா (ரலி) அவர்களிடம்) கேட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் ஒன்றில் ஷகீக் பின் சலமா (ரஹ்) அவர்கள் பின்வரும் கூடுதலான தகவலையும் குறிப்பிட்டுள்ளார்கள்: நான் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி), அபூமூசா (ரலி) ஆகியோருடன் இருந்தேன். அப்போது அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் அபூமூசா (ரலி) அவர்கள், “உமர் (ரலி) அவர்களிடம் அம்மார் பின் யாசிர் (ரலி) அவர்கள் ‘என்னையும் உங்களையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (படைப் பிரிவொன்றில்) அனுப்பிவைத்தார்கள். எனக்குப் பெருந்துடக்கு ஏற்பட்டு (குளியல் கடமையாகி)விட்டது. அப்போது நான் மண்ணில் (கிடந்து) புரண்டேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நாம் வந்து விஷயத்தைத் தெரிவித்தபோது அவர்கள் தமது முகத்தையும் (மணிக்கட்டு வரை) இரு கைகளையும் ஒரேயொரு தடவை தடவிவிட்டு, ‘இப்படி நீர் செய்திருந்தால் உமக்குப் போதுமான தாயிருந்திருக்கும்’ என்று சொன்ன செய்தியை நீங்கள் கேள்விப்படவில் லையா?” என்றார்கள். அத்தியாயம் : 7",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		}
	]
}