{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3505,
			"arabicnumber": 3505,
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: ஆயிஷா (ரலி) அவர்களுக்கு, நபி (ஸல்) மற்றும் அபூபக்ர் (ரலி) ஆகியோருக்கு அடுத்தபடியாக, (தம் சகோதரி அஸ்மாவின் மகன்) அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) மீது எல்லா மனிதர்களைவிடவும் அதிகமான பிரியம் இருந்தது. மக்களிலேயே அதிகமாக ஆயிஷா (ரலி) அவர்களுக்கு நன்மை புரியக்கூடியவராக அப்துல்லாஹ் (ரலி) இருந்தார். ஆயிஷா (ரலி) அவர்கள், தம்மிடம் வருகின்ற அல்லாஹ்வின் கொடை எதையும் தம்மிடமே வைத்துக் கொள்ளாமல் தர்மம் செய்துவிடுவது வழக்கம். ஆகவே, அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள், “ஆயிஷா (ரலி) அவர்களின் கரத்தை (தர்மம் செய்ய விடாமல்) பிடித்துக்கொள்வது அவசியம்” என்று கூறினார்கள்.18 அதனால் அவர்கள் (கோபமுற்று), “(தர்மம் செய்ய விடாமல்) என் கையைப் பிடித்துக்கொள்வதா? (நான் இனி அப்துல்லாஹ்வுடன் பேச மாட்டேன்.) அவருடன் (என் சபதத்தை மீறி) நான் பேசினால் (சத்தியத்தை முறித்த குற்றத்திற்காக) நான் பரிகாரம் செய்ய நேரிடும்” என்று சொன்னார்கள். அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள், (ஆயிஷா (ரலி) அவர்களின் கோபத்தைத் தணித்து அவர்களைத் தம்முடன் பேசச் செய்வதற்காக) (அன்னை) ஆயிஷா (ரலி) அவர்களிடம் தமக்காகப் பரிந்துரை செய்யும்படி குறைஷியர் சிலரையும் குறிப்பாக, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தாய்மாமன்மார்களையும் கேட்டுக்கொண்டார்கள். (அவர்கள் பரிந்துரை செய்தும்) ஆயிஷா (ரலி) அவர்கள் பேச மறுத்துவிட்டார்கள். ஆகவே, அப்துர் ரஹ்மான் பின் அஸ்வத் பின் அப்து யகூஸ் மற்றும் மிஸ்வர் பின் மக்ரமா உள்ளிட்ட நபி (ஸல்) அவர்களின் தாய் மாமன்களான பனூ ஸுஹ்ரா கிளையினர் அப்துல்லாஹ்விடம், “நாங்கள் ஆயிஷா (ரலி) அவர்களிடம் உள்ளே வர அனுமதி கேட்டுக்கொண்டி ருக்கும்போதே நீங்கள் திரையைக் கடந்து (அனுமதி பெறாமலே) சென்றுவிடுங்கள்” என்று சொன்னார்கள். அவ்வாறே அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களும் செய்தார் கள். பிறகு (ஆயிஷா (ரலி) அவர்களும் ஒப்புக்கொண்டு பேசிவிட்டார்கள். அவர் களின் சத்தியம் முறிந்துபோனதற்குப் பரிகாரமாக) அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்கள் ஆயிஷா (ரலி) அவர்களிடம் பத்து அடிமைகளை (விடுதலை செய்வதற்காக) அனுப்பிவைத்தார்கள். அவர்களை ஆயிஷா (ரலி) அவர்கள் விடுதலை செய்துவிட்டார்கள். பிறகு (இது போதுமான பரிகாரம் ஆகாதோ என்ற எண்ணத்தில்) தொடர்ந்து நாற்பது எண்ணிக்கையை அடையும்வரை அடிமைகளை விடுதலை செய்துகொண்டேயிருந்தார்கள். இறுதியில், நான் (அப்துல்லாஹ்வுடன் பேசமாட்டேன் என்று) சத்தியம் செய்தபோதே, “என் சத்தியம் முறிந்துபோனால் அதற்குக் குறிப்பிட்ட பரிகாரத்தைச் செய்வேன்' என்று முடிவு செய்துவிட்டிருந்தால் அதை மட்டும் செய்து பொறுப்பிóருந்து விடுபட்டிருப்பேன். (“இன்ன பரிகாரம் என்று குறிப்பிட்டு முடிவு செய்யாததால் இவ்வளவு செய்தும் இந்த அளவு பரிகாரம் நிவர்த்தியானதோ இல்லையோ என்ற சந்தேகம் இன்னும் என்னை வாட்டுகிறது”) என்று சொன்னார்கள். அத்தியாயம் : 61",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 15
			}
		}
	]
}