{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3522,
			"arabicnumber": 3522,
			"text": "அபூஜம்ரா (ரஹ்) அவர்கள் கூறியதாவது: எங்களிடம் இப்னு அப்பாஸ் (ரலி) அவர்கள், “அபூதர் (ரலி) அவர்கள் இஸ்லாத்தைத் தழுவிய விதம் குறித்து உங்களுக்கு நான் அறிவிக்கட்டுமா?” என்று கேட்க, நாங்கள், “சரி (அறிவியுங் கள்)” என்றோம். அப்போது அவர்கள் பின்வருமாறு கூறினார்கள்: அபூதர் (ரலி) அவர்கள் (என்னிடம்) சொன்னார்கள்: நான் ஃகிஃபார் குலத்தைச் சேர்ந்த ஒரு மனிதனாக இருந்தேன். அப்போது “ஒரு மனிதர் தம்மை நபி என்று வாதிட்டபடி மக்கா நகரில் புறப்பட்டிருக்கிறார்' என்று எங்களுக்குச் செய்தி எட்டியது. ஆகவே, நான் என் சகோதரர் (அனீஸ்) இடம், “நீ இந்த மனிதரிடம் போய்ப் பேசி அவரது செய்தியை (அறிந்து) என்னிடம் கொண்டுவா” என்று சொன்னேன். அவ்வாறே அவர் சென்று அவரைச் சந்தித்துப் பிறகு திரும்பி வந்தார். நான், “உன்னிடம் என்ன செய்தி உண்டு?' என்று கேட்டேன். “நன்மை புரியும்படி கட்டளை யிடவும் தீமையிலிருந்து (மக்களைத்) தடுக்கவும் செய்கின்ற ஒரு மனிதராக நான் அவரைக் கண்டேன்” என்றார். நான் அவரிடம், “போதிய செய்தியை எனக்கு நீ கொண்டுவரவில்லை' என்று கூறினேன். பிறகு தோலால் ஆன (தண்ணீர்) பையையும் கைத் தடியையும் எடுத்துக் கொண்டு மக்காவை நோக்கிச் சென்றேன். அவரை நான் (தேடி வந்திருப்பதாகக்) காட்டிக்கொள்ளாமலிருக்கத் தொடங்கி னேன். அவரைப் பற்றி விசாரிக்கவும் நான் விரும்பவில்லை. (வேறு உணவு இல்லாத தால்) ஸம்ஸம் தண்ணீரைக் குடித்துக் கொண்டு இறையில்லத்தில் (தங்கி) இருந்தேன். அப்போது அலீ (ரலி) அவர்கள் (கஅபாவில்) என்னைக் கடந்து சென்றார்கள். (என்னைக் கண்டதும்), “ஆள் (ஊருக்குப்) புதியவர் போலத் தெரிகிறதே” என்று கேட்டார்கள். நான், “ஆம்” என்றேன். உடனே அவர்கள், “அப்படியென்றால் (நம்) வீட்டிற்கு நடங்கள் (போகலாம்)” என்று சொன்னார்கள். நான் அவர்களுடன் எதைப் பற்றியும் கேட்காமலும் (எதையும்) அவர்களுக்குத் தெரிவிக்காமலும் சென்றேன். காலையானதும் நபி (ஸல்) அவர்களைப் பற்றி விசாரிக்க இறையில்லத்திற்குச் சென்றேன். ஆனால், (அங்கு) ஒருவரும் அவர்களைப் பற்றி எதையும் எனக்குத் தெரிவிக்கவில்லை. அப்போது அலீ(ரலி) அவர்கள் என்னைக் கடந்து சென்றார்கள். “மனிதர் (தாம் தங்க வேண்டிய) தமது வீட்டை அடையாளம் தெரிந்துகொள்ளும் நேரம் இன்னும் வரவில்லையா?” என்று (சாடையாகக்) கேட்டார்கள். நான், “இல்லை” என்றேன். உடனே அலீ (ரலி) அவர்கள், “என்னுடன் நடங்கள்” என்று சொல்லிவிட்டு, “உங்கள் விவகாரம் என்ன? இந்த ஊருக்கு எதற்காக வந்தீர்கள்?” என்று கேட்டார்கள். அதற்கு, “நான் சொல்வதைப் பிறருக்குத் தெரியாமல் நீங்கள் மறைப்ப தாயிருந்தால் நான் உங்களுக்குத் தெரிவிக்கிறேன்” என்று சொன்னேன். அதற்கு அவர்கள், “அவ்வாறே செய்கிறேன்” என்று சொன்னார்கள். நான் அப்போது “இங்கே தம்மை இறைத்தூதர் என்று வாதிட்டபடி ஒரு மனிதர் புறப்பட்டிருக்கிறார்' என்று எங்களுக்குச் செய்தி எட்டியது. ஆகவே, நான் என் சகோதரரை அவரிடம் பேசும்படி அனுப்பி னேன். போதிய பதிலை என்னிடம் அவர் கொண்டுவரவில்லை. ஆகவே, நான் அவரை (நேரடியாகச்) சந்திக்க விரும்பி னேன்” என்று சொன்னேன். அதற்கு அவர்கள், “நீங்கள் நேரான வழியை அடைந்துள்ளீர்கள். இது நான் அவரிடம் செல்லும் நேரம். ஆகவே, என்னைப் பின்தொடர்ந்து வாருங்கள். நான் நுழையும் வீட்டில் நீங்கள் நுழையுங்கள். ஏனெனில், (என்னுடன் வருவதால்) இவனால் உங்களுக்கு ஆபத்து ஏற்படும் என்று நான் அஞ்சுகின்ற ஒருவனைக் காண்பேனாயின், என் செருப்பைச் சரி செய்வதைப் போல் சுவரோரமாக நான் நின்று கொள்வேன். நீங்கள் போய்க்கொண்டிருங்கள்” என்று சொன்னார்கள். இறுதியில் அவர்கள் நபி (ஸல்) அவர்களிடம் செல்ல, நானும் அவர்களுடன் உள்ளே சென்றேன். நான் நபி (ஸல்) அவர்களிடம், “எனக்கு இஸ்லாத்தை எடுத்துரையுங்கள்” என்று சொன்னேன். அவர்கள் அதை எடுத்துரைத்தார்கள். நான் இருந்த அதே இடத்தில் இஸ்லாத்தை ஏற்றுக்கொண்டேன். நபி (ஸல்) அவர்கள் என்னிடம், “அபூதர்ரே! (நீ இஸ்லாத்தை ஏற்ற) இந்த விஷயத்தை மறைத்துவைப்பீராக. உமது ஊருக்குத் திரும்பிச் செல்வீராக. நாங்கள் மேலோங்கிவிட்ட செய்தி உமக்கு எட்டும் போது எங்களை நோக்கி வருவீராக” என்று சொன்னார்கள். அதற்கு நான், “உங்களைச் சத்திய மார்க்கத்துடன் அனுப்பியவன் மீதாணையாக! நான் இதை (ஏகத்துவக் கொள்கையை) அவர்களுக் கிடையே உரக்கச் சொல்வேன்” என்று சொல்லிவிட்டு, இறையில்லத்திற்கு வந்தேன். அப்போது குறைஷியர் அங்கே இருந்தனர். நான், “குறைஷி குலத்தாரே! “அல்லாஹ்வைத் தவிர வேறு இறைவ னில்லை' என்று நான் உறுதி கூறுகின்றேன். “முஹம்மத் (ஸல்) அவர்கள் அவனுடைய அடியாரும் அவனுடைய தூதரும் ஆவார்' என்றும் நான் உறுதி கூறுகின் றேன்” என்று சொன்னேன். உடனே அவர்கள், “இந்த மதம் மாறி(ய துரோகி)யை எழுந்து சென்று கவனியுங்கள்” என்று சொன்னார்கள். அவர்கள் எழுந்து வந்தார்கள். என் உயிர் போவது போல் நான் அடிக்கப்பட்டேன். அப்போது அப்பாஸ் (ரலி) அவர்கள் என்னை அடையாளம் புரிந்துகொண்டு என்மீது கவிழ்ந்து (அடிபடாமல் பார்த்துக்)கொண்டார்கள். பிறகு குறைஷியரை நோக்கி, “உங்களுக்குக் கேடு உண்டாகட்டும்! ஃகிஃபார் குலத்தைச் சேர்ந்த மனிதரையா நீங்கள் கொல்கிறீர்கள்? நீங்கள் வியாபாரம் செய்யுமிடமும் நீங்கள் (வாணிபத்திற்காகக்) கடந்து செல்ல வேண்டிய பாதையும் ஃகிஃபார் குலத்தார் வசிக்கு மிடத்தையொட்டித்தானே உள்ளது! (அவர்கள் பழிவாங்க வந்தால் நீங்கள் என்ன செய்வீர்கள்?)”38 என்று கேட்டார்கள். உடனே அவர்கள் என்னைவிட்டு விலகிவிட்டார்கள். மறுநாள் காலை வந்தவுடன் நான் திரும்பிச் சென்று நேற்று சொன்னதைப் போலவே சொன்னேன். அவர்கள், “இந்த மதம் மாறி(ய துரோகி)யை எழுந்து சென்று கவனியுங்கள்” என்று சொன்னார்கள். நேற்று என்னிடம் நடந்துகொண்டதைப் போலவே நடந்துகொண்டார்கள். அப்பாஸ் (ரலி) அவர்கள் என்னைப் புரிந்துகொண்டு என்மீது கவிழ்ந்து (அடிபடாதவாறு பார்த்துக்)கொண்டார்கள். நேற்று அப்பாஸ் அவர்கள் சொன்னதைப் போலவே (இன்றும்) சொன்னார்கள். (இதை அறிவித்தபிறகு) இப்னு அப்பாஸ் (ரலி) அவர்கள், “இது அபூதர் (ரலி) அவர்கள் இஸ்லாத்தைத் தழுவிய ஆரம்பக் காலத்தில் நடந்த நிகழ்ச்சியாகும். அல்லாஹ் அபூதர்ருக்கு கருணை காட்டுவானாக!” என்று சொன்னார்கள். அத்தியாயம் : 61",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 32
			}
		}
	]
}