{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அபூதல்ஹா (ரலி) அவர்கள் (தம் மனைவி) உம்மு சுலைம் (ரலி) அவர்களி டம், “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய குரலை பலவீனமானதாகக் கேட்டேன். அதில் நான் (அவர்களுக் கிருக்கும்) பசியைப் புரிந்துகொண்டேன். உன்னிடம் (உணவு) ஏதாவது இருக்கிறதா?” என்று கேட்டார்கள். அதற்கு உம்மு சுலைம் (ரலி) அவர்கள், “ஆம், இருக்கி றது” என்று கூறிவிட்டு தொலி நீக்கப்படாத கோதுமை ரொட்டித் துண்டுகள் சிலவற்றை எடுத்தார்கள். பிறகு உம்மு சுலைம் (ரலி) அவர்கள், தமது முகத்திரை ஒன்றை எடுத்து அதன் ஒரு பகுதியால் அதைச் சுருட்டி என் கை (அக்குளு)க்குக் கீழே அதை மறைத்து வைத்து அதன் ஒரு பகுதியால் என் கையைக் கட்டிவிட்டார்கள்.90 பிறகு என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுப்பினார்கள். நான் அதைக் கொண்டுசென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பள்ளிவாசலில் கண்டேன். அவர்களுடன் மக்கள் இருந்தனர். நான் அவர்களுக்குமுன் நின்றேன். உடனே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உன்னை அபூதல்ஹா அனுப்பினாரா?” என்று கேட்டார்கள். நான், “ஆம்' என்றேன். “உணவுடனா அனுப்பியுள்ளார்?” என்று கேட்டார்கள். நான், “ஆம்' என்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்முடன் இருந்தவர்களிடம், “எழுந்திருங்கள்' என்று சொல்லிவிட்டு நடந்தார்கள். நான் அவர்களுக்கு முன்னால் நடந்தேன். இறுதியில், அபூதல்ஹா (ரலி) அவர்களிடம் வந்து (நபி (ஸல்) அவர்கள் தம் தோழர்களுடன் வந்துகொண்டிருக்கும்) விவரத்தைத் தெரிவித்தேன். உடனே அபூதல்ஹா (ரலி) அவர்கள் (என் தாயாரிடம்), “உம்மு சுலைமே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களுடன் வந்திருக்கிறார்கள். ஆனால், நம்மிடம் அவர்களுக்கு உணவளிக்க எதுவுமில்லையே” என்று சொன்னார்கள். உம்மு சுலைம் (ரலி) அவர்கள், “அல்லாஹ் வும் அவனுடைய தூதருமே அறிந்தவர் கள்” என்று கூறினார்கள். உடனே அபூதல்ஹா (தாமே நபி (ஸல்) அவர்களை முன்சென்று வரவேற்பதற்காக) நடந்து சென்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைச் சந்தித்தார்கள். அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் அபூதல்ஹா தம்முடனிருக்க, உம்மு சுலைம் அவர்களை நோக்கிச் சென்று, “உம்மு சுலைமே! உங்களிடமிருப்பதைக் கொண்டுவாருங் கள்!” என்று சொன்னார்கள். உடனே, அவர்கள் அந்த ரொட்டியைக் கொண்டு வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதைத் துண்டு துண்டாகப் பிய்க்கும்படி உத்தரவிட, அவ்வாறே அது பிய்க்கப்பட்டது. பிறகு, உம்மு சுலைம் (ரலி) அவர்கள் தோல் பையிலிருந்து வெண்ணெய் எடுத்துப் பிழிந்து அதை உருக்கினார்கள். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறைவன் நாடியவற்றை (பிஸ்மில்லாஹ்வையும் மற்ற பிரார்த்தனைகளையும்) சொன்னார்கள். பிறகு, “பத்து பேருக்கு (உள்ளே வர) அனுமதி கொடுங்கள்” என்று (அபூதல்ஹாவிடம்) சொன்னார்கள். அவ்வாறே அவர்களுக்கு அபூதல்ஹா (ரலி) அவர்கள் அனுமதி கொடுத்தார்கள். பிறகு அவர்கள் வயிறு நிரம்பும்வரை உண்டுவிட்டு வெளியேறினர். பிறகு நபி (ஸல்) அவர்கள், “இன்னொரு பத்துப் பேருக்கு (உள்ளே வர) அனுமதி கொடுங்கள்” என்று கூறினார்கள். அவ்வாறே அபூதல்ஹா (ரலி) அவர்கள் அனுமதி கொடுத்தார்கள். அவர்களும் வயிறு நிரம்பும்வரை உண்டுவிட்டு வெளியேறினர். பிறகு, “பத்துப் பேருக்கு (உள்ளே வர) அனுமதி கொடுங்கள்” என்று சொன்னார்கள். அவ்வாறே அவர்களுக்கு அபூதல்ஹா (ரலி) அவர்கள் அனுமதி கொடுத்தார்கள். பிறகு அவர்கள் வயிறு நிரம்பும்வரை உண்டுவிட்டு வெளியேறினார்கள். பிறகு, “பத்துப் பேருக்கு (உள்ளே வர) அனுமதி கொடுங்கள்” என்று சொன்னார்கள். அவ்வாறே அவர்களுக்கு அபூதல்ஹா (ரலி) அவர்கள் அனுமதி கொடுத்தார்கள். பிறகு அவர்கள் வயிறு நிரம்பும்வரை உண்டுவிட்டு வெளியேறினர். மக்கள் அனைவரும் (இவ்வாறே) வயிறு நிரம்பும்வரை உண்டார்கள். அப்படி உண்ட மக்கள் எழுபது அல்லது எண்பது பேர் ஆவர். அத்தியாயம் : 61",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 87
			}
		}
	]
}