{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3632,
			"arabicnumber": 3632,
			"text": "அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்கள் கூறியதாவது: சஅத் பின் முஆத் (ரலி) அவர்கள் உம்ரா செய்யச் சென்றார்கள். (மக்காவில் இணைவைப்போரின் தலைவர்களில் ஒருவனான) உமய்யா பின் கலஃப் அபூஸஃப்வானிடம் தங்கினார்கள். உமய்யா (வியாபாரத்திற்காக) ஷாம் (சிரியா) நாட்டிற்கு மதீனா வழியாகச் செல்லும்போது சஅத் (ரலி) அவர்களிடம் தங்கு(ம் பழக்கம் உடையவன் ஆ)வான். உமய்யா, “நண்பகல் நேரம் வரும்வரை சற்றுக் காத்திருந்து, மக்கள் ஓய்வெடுத்துக் கொள்ளும் (அந்த) நேரத்தில் நீங்கள் சென்று (கஅபாவை) சுற்றலாமே” என்று கேட்டான். அவ்வாறே, சஅத் (ரலி) அவர்கள் சுற்றிக்கொண்டிருந்தபோது அபூஜஹ்ல் வந்து, “கஅபாவைச் சுற்றுவது யார்?” என்று கேட்டான். சஅத் (ரலி) அவர்கள், “நான்தான் சஅத்” என்று கூறினார்கள். அதற்கு அபூஜஹ்ல், “(மதீனாவாசி களான) நீங்கள் முஹம்மதுக்கும் அவருடைய தோழர்களுக்கும் (மதீனாவில்) புகலிடம் கொடுத்திருக்க, இங்கே கஅபாவை நீ அச்சமின்றி சுற்றிக் கொண்டிருக்கிறாயா?” என்று கேட்டான். அதற்கு சஅத் (ரலி) அவர்கள், “ஆம் (அதற்கென்ன?)” என்று கேட்டார்கள். அவ்விருவருக்குமிடையே (அதையொட்டி) சச்சரவும் வாக்குவாதமும் ஏற்பட்டது. உடனே உமய்யா, சஅத் (ரலி) அவர்களிடம், “அபுல்ஹகமைவிடக் குரலை உயர்த்தாதீர். ஏனெனில், அவர் இந்த (மக்கா) பள்ளத்தாக்கின் தலைவர்” என்று சொன்னான்.151 பிறகு சஅத் (ரலி) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! இறையில்லத்தைச் சுற்ற விடாமல் என்னை நீ தடுத்தால் நீ ஷாம் (சிரியா) நாட்டிற்குச் செல்லும் வணிக வழியை நான் துண்டித்துவிடுவேன்” என்று சொன்னார்கள். அப்போது உமய்யா, சஅத் (ரலி) அவர்களிடம், “உங்கள் குரலை உயர்த்தாதீர்கள்” என்று சொல்லத் தொடங்கினான்- அவர்களைப் பேச விடாமல் தடுக்கலானான். ஆகவே, சஅத் (ரலி) அவர்கள் கோபமுற்று, “உமது வேலையைப் பாரும். (அபூஜஹ்லுக்கு வக்காலத்து வாங்காதீர்.) ஏனெனில், முஹம்மத் (ஸல்) அவர்கள் உன்னைக் கொல்லவிருப்பதாகச் சொன்னதை நான் கேட்டிருக்கிறேன்” என்று உமய்யாவிடம் சொன்னார்கள். அதற்கு அவன், “என்னையா (கொல்ல விருப்பதாகச் சொன்னார்)?” என்று கேட்டான். சஅத் (ரலி) அவர்கள், “ஆம் (உன்னைத்தான்)” என்று பதிலளித்தார்கள். அவன், “அல்லாஹ்வின் மீதாணையாக! முஹம்மத் பேசினால் பொய் பேசுவ தில்லை” என்று சொல்லிவிட்டு தம் மனைவியிடம் சென்று, “என்னிடம் என் யஸ்ரிப் (மதீனா) நகர தோழர் என்ன சொன்னார் என்று உனக்குத் தெரியுமா?” என்று கேட்க, அவள், “என்ன சொன்னார்?” என்று வினவினாள். “முஹம்மத் என்னைக் கொல்லவிருப்பதாகச் சொன்னதாக அவர் கூறினார்” என்று அவன் பதிலளித்தான். அவள், “அப்படியென்றால் (அது உண்மையாகத்தானிருக்கும்.) அல்லாஹ்வின் மீதாணையாக! முஹம்மத் பொய் சொல்வதில்லை” என்று சொன்னாள். மக்காவாசிகள் பத்ர் போருக்குப் புறப்பட்டுச் செல்ல, போருக்கு அழைப்பவர் வந்(து மக்களை அழைத்)தபோது உமய்யாவிடம் அவனுடைய மனைவி, “உம்முடைய யஸ்ரிப் நகரத் தோழர் சொன்னது உமக்கு நினைவில்லையா?” என்று கேட்டாள். ஆகவே, (பயத்தின் காரணத்தால்) அவன் போருக்குப் புறப்பட விரும்பவில்லை. அபூஜஹ்ல் அவனிடம், “நீ (மக்கா) பள்ளத்தாக்கின் தலைவர்களில் ஒருவன். ஆகவே (நீயே போரில் கலந்துகொள்ளாமல் போய்விட்டால் நன்றாக இருக்காது.) ஒரு நாளைக்கு அல்லது இரண்டு நாட்களுக்காவது போ(ய்க் கலந்துகொள்)” என்று சொன்னான். அவ்வாறே அவனும் (இரண்டு நாட்களுக்காகச்) சென்றான். (அப்படியே அவன் போர்க்களம்வரை சென்றுவிட, அங்கே) அவனை அல்லாஹ் கொன்றுவிட்டான். அத்தியாயம் : 61",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 136
			}
		}
	]
}