{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3661,
			"arabicnumber": 3661,
			"text": "அபுத்தர்தா (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களிடம் அமர்ந்திருந்தேன். அப்போது அபூபக்ர் (ரலி) அவர்கள் தமது முழங்கால் வெளியே தெரியுமளவுக்கு ஆடையின் ஒரு பக்கத்தை (தூக்கிப்) பிடித்தபடி (எங்களை நோக்கி) வந்தார்கள். உடனே நபி (ஸல்) அவர்கள், “உங்கள் தோழர் வழக்காடிவிட்டு வந்திருக்கிறார்” என்று சொன்னார்கள். அபூபக்ர் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களுக்கு) சலாம் கூறிவிட்டு, “அல்லாஹ்வின் தூதரே! எனக்கும் கத்தாபின் மகனா(ர் உம)ருக்கும் இடையே சிறிது வாக்குவாதம் ஏற்பட்டது. நான் (கோபமாக) அவரை நோக்கி விரைந்தேன். பிறகு (என் செய்கைக்காக) நான் வருந்தி அவரிடம் என்னை மன்னிக்கும்படி கேட்டேன். அவர் என்னை மன்னிக்க மறுத்துவிட்டார். ஆகவே உங்களிடம் வந்தேன்” என்று சொன்னார்கள். அப்போது நபி (ஸல்) அவர்கள், “அபூபக்ரே! அல்லாஹ் உங்களை மன்னிப்பானாக!” என்று மும்முறை கூறினார்கள். பிறகு உமர் (ரலி) அவர்கள் (அபூபக்ர் (ரலி) அவர்களை மன்னிக்க மறுத்துவிட்டதற்காக) மனம் வருந்தி அபூபக்ர் (ரலி) அவர்களின் வீட்டிற்குச் சென்று, “அங்கே அபூபக்ர் (ரலி) அவர்கள் இருக்கிறார்களா?” என்று கேட்க வீட்டார், “இல்லை” என்று பதிலளித்தார்கள். ஆகவே, அவர்கள் நபி (ஸல்) அவர்களிடம் சென்றார்கள். அப்போது நபி (ஸல்) அவர்களுடைய முகம், (கோபத்தால்) நிறம் மாறலாயிற்று. எனவே, அபூபக்ர் (ரலி) அவர்கள் பயந்துபோய் தம் முழங்கால்களின் மீது மண்டியிட்டு அமர்ந்து, “அல்லாஹ்வின் தூதரே! அல்லாஹ்வின் மீதாணையாக! நான்தான் (வாக்குவாதத்தை தொடங்கியதால் உமரைவிட) அதிகம் அநீதியிழைத்த வனாகிவிட்டேன்” என்று இருமுறை கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள், “(மக்களே!) அல்லாஹ் என்னை உங்களிடம் அனுப்பினான். “பொய் சொல்கிறீர்' என்று நீங்கள் கூறினீர்கள். அபூபக்ர் அவர்களோ, “நீங்கள் உண்மையே சொன்னீர்கள்' என்று கூறினார்; மேலும் (இறைமார்க்கத்தை நிலைநிறுத்தும் பணியில்) தம்மையும் தமது செல்வத்தை யும் அர்ப்பணித்து என்னிடம் பரிவுடன் நடந்துகொண்டார். அத்தகைய என் தோழரை எனக்காக நீங்கள் (மன்னித்து) விட்டுவிடுவீர்களா?” என்று இருமுறை சொன்னார்கள். அதன் பிறகு அபூபக்ர் (ரலி) அவர்கள் மன வேதனைக்கு உள்ளாக்கப்படவில்லை. அத்தியாயம் : 62",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 13
			}
		}
	]
}