{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் பயணங்களில் ஒன்றில் அவர்களுடன் புறப்பட்டோம்.31 நாங்கள் (மதீனாவுக்கருகில் உள்ள) “பைதா' எனுமிடத்தை -அல்லது “தாத்துல் ஜைஷ்' எனுமிடத்தை- அடைந்தபோது, எனது கழுத்து மாலை ஒன்று (எங்கோ) அவிழ்ந்து விழுந்துவிட்டது. ஆகவே, அதைத் தேடுவதற்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஓரிடத்தில் (முகாமிட்டுத்) தங்கினார்கள். மக்களும் அவர்களுடன் தங்கினர். அப்போது அவர்கள் எந்த நீர்நிலை அருகிலும் இருக்கவில்லை. அவர்களிடமும் தண்ணீர் எதுவும் இருக்கவில்லை. எனவே, மக்கள் அபூபக்ர் (ரலி) அவர்களிடம் வந்து, “(உங்கள் மகள்) ஆயிஷா என்ன செய்தார் என்று நீங்கள் கவனிக்கமாட்டீர்களா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்களையும் மக்களையும் (இங்கு) தங்கும்படி செய்துவிட்டார். இங்கும் தண்ணீர் இல்லை; மக்களிடமும் தண்ணீர் இல்லை” என்று முறையிட்டனர். உடனே அபூபக்ர் (ரலி) அவர்கள், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் மடியில் தலை வைத்துத் தூங்கி விட்டிருந்த நிலையில் வருகை தந்தார்கள். “நீ அல்லாஹ்வின் தூதர் (ஸல்) அவர் களையும் மக்களையும் (பயணத்தைத் தொடர முடியாமல்) தடுத்துவிட்டாயே! இங்கும் தண்ணீர் இல்லை. மக்களிடமும் தண்ணீர் இல்லை” என்று கூறினார்கள். மேலும் அவர்கள் எதைச் சொல்ல அல்லாஹ் நாடினானோ அதையெல்லாம் சொல்லிவிட்டு, என்னைத் தமது கரத்தால் என் இடுப்பில் குத்தலானார்கள். அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் என் மடியில் படுத்துக்கொண்டிருந்ததுதான் என்னை அசைய விடாமல் (அடிவாங்கிக்கொண்டி ருக்கும்படி) செய்துவிட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உறங்கி, அதிகாலையில் விழித்தெழுந்தபோதும் தண்ணீர் கிடைக்கவில்லை. அப்போது, அல்லாஹ் “தயம்மும்' உடைய (4:43) வசனத்தை அருளினான். (இது குறித்து) உசைத் பின் அல்ஹுளைர் (ரலி) அவர்கள் “அபூபக்ரின் குடும்பத்தாரே! (“தயம்மும்' என்ற சலுகையான) இது, உங்களால் (சமுதாயத்திற்குக் கிடைத்த) முதல் வளம் (பரக்கத்) அல்ல. (இதற்கு முன்பும் பல நன்மைகள் உங்கள் மூலம் கிடைத்துள்ளன)” என்று சொன்னார்கள். பிறகு, நான் பயணம் செய்து வந்த ஒட்டகத்தை (அது அமர்ந்திருந்த இடத்திலிருந்து) நாங்கள் எழுப்பியபோது, அதற்குக் கீழே (நான் தொலைத்துவிட்ட) கழுத்து மாலையை நாங்கள் கண்டோம்.32 அத்தியாயம் : 62",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 22
			}
		}
	]
}