{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் நபி (ஸல்) அவர்களிடம் (விருந்தாளியாக) வந்தார். நபி (ஸல்) அவர்கள் (அவருக்கு உணவளிப்பதற்காகத்) தம் துணைவியரிடம் சொல்லியனுப்பினார் கள். அப்போது துணைவியர், “எங்களிடம் தண்ணீரைத் தவிர வேறெதுவும் இல்லை” என்று பதிலளித்தார்கள். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் தோழர்களை நோக்கி), “ “இவரை (தம்முடன் உணவில்) சேர்த்துக்கொள்பவர் யார்?' அல்லது “இவருக்கு விருந்தளிப்பவர் யார்” என்று கேட்டார்கள். அப்போது அன்சாரிகளில் ஒருவர், “நான் (விருந்தளிக்கிறேன்)” என்று சொல்லி அவரை அழைத்துக்கொண்டு தம் மனைவியிடம் சென்றார். (மனைவியிடம்) “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய விருந்தாளியைக் கண்ணியப்படுத்து” என்று சொன்னார். அதற்கு அவருடைய மனைவி, “நம்மிடம் நம் குழந்தைகளின் உணவைத் தவிர வேறெதுவுமில்லை” என்று சொன்னார். அதற்கு அந்த அன்சாரித் தோழர், “உன் (குடும்பத்திற்கான) உணவைத் தயாராக எடுத்துவைத்துவிட்டு விளக்கை ஏற்றி (விடுவதைப்போல் பாவனை செய்து அணைத்து)விடு. உன் குழந்தைகள் உணவு உண்ண விரும்பினால் அவர்களைத் தூங்கச் செய்துவிடு” என்று சொன்னார். அவ்வாறே அவருடைய மனைவியும் உணவைத் தயாராக எடுத்துவைத்து, விளக்கை ஏற்றிவிட்டுத் தம் குழந்தைகளைத் தூங்கச் செய்துவிட்டார். பிறகு விளக்கை சரி செய்வதுபோல் நின்று (பாவனை செய்துகொண்டே) விளக்கை அணைத்து விட்டார். பிறகு அவரும் அவரின் மனைவியும் உண்பதுபோல் (விருந்தாளி யான) அந்த மனிதருக்கு (பாவனை) காட்டலானார்கள். பிறகு இருவரும் (உணவு உண்ணாமல்) வயிறு ஒட்டியவர்களாக இரவைக் கழித்தனர். காலையானதும் அந்த அன்சாரீ அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றார். நபி (ஸல்) அவர்கள், “நீங்கள் இருவரும் செய்ததைக் கண்டு அல்லாஹ் இன்றிரவு (மகிழ்ச்சியால்) “சிரித்துக் கொண்டான்' அல்லது “வியப்படைந்தான்' என்று சொன்னார்கள். அப்போது அல்லாஹ், “தமக்கே தேவை இருந்தும்கூட, தம்மைவிடப் பிறருக்கே அவர்கள் முன்னுரிமை வழங்குகிறார்கள். உண்மையில், யார் தம் உள்ளத்தின் கருமித்தனத்திலிருந்து பாதுகாக்கப்பட்டுவிட்டார்களோ அவர்கள் தான் வெற்றியாளர்கள்” எனும் (59:9ஆம்) வசனத்தை அருளினான். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 23
			}
		}
	]
}