{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: ஸைத் பின் அம்ர் பின் நுஃபைல், (நபித்துவக் காலத்திற்கு முன்பு) ஏகத்துவ மார்க்கத்தைப் பற்றி விசாரித்துப் பின்பற்றுவதற்காக ஷாம் (சிரியா) நாட்டை நோக்கிப் புறப்பட்டார். அப்போது யூத அறிஞர் ஒருவரைச் சந்தித்து யூதர்களின் மார்க்கத்தைப் பற்றி அவரிடம் விசாரித்தார். அந்த அறிஞரிடம், “நான் உங்கள் மார்க்கத்தை ஏற்றுப் பின்பற்றக்கூடும். ஆகவே, எனக்கு (அதைப் பற்றித்) தெரிவியுங்கள்” என்று சொன்னார். அதற்கு அந்த அறிஞர், “அல்லாஹ்வின் கோபத்தில் உனக்குள்ள பங்கை நீ எடுத்துக்(கொண்டு அதற்காக வேதனையை அனுபவித்துக்)கொள்ளாத வரை நீ எங்கள் மார்க்கத்தில் இருக்க முடியாது” என்று சொன்னார். ஸைத் அவர்கள், “நான் அல்லாஹ்வின் கோபத்திலிருந்துதானே வெருண்டோடி வருகிறேன்! மேலும், அல்லாஹ்வின் கோபத்தில் சிறிதளவைக்கூட ஒருபோதும் நான் தாங்கமாட்டேன். என்னால் எப்படி அதைத் தாங்க முடியும்? வேறெந்த மார்க்கத்தையாவது எனக்கு அறிவித்துத் தர முடியுமா?” என்று கேட்டார். அந்த அறிஞர், “அது (ஏகத்துவ மார்க்கமான) நேரிய மார்க்கம் (ஹனீஃப்) ஆகத் தவிர வேறொன்றாக இருக்க முடியாது என்பதை நான் நன்கறிவேன்” என்று பதிலளித்தார். ஸைத் அவர்கள், “நேரிய மார்க்கம் என்றால் என்ன?” என்று கேட்டார். அதற்கு அந்த அறிஞர், “அது இப்ராஹீம் (அலை) அவர்களின் மார்க்கம். அவர்கள் யூதராகவும் இருக்கவில்லை. கிறித்தவராகவும் இருக்கவில்லை. மேலும், அல்லாஹ்வைத் தவிர வேறெவரையும் அவர்கள் வழிபடமாட்டார்கள்” என்று சொன்னார். (மீண்டும்) புறப்பட்டுச் சென்று கிறித்தவ அறிஞர் ஒருவரைச் சந்தித்தார். அவரும் யூத அறிஞரைப் போலவே, “அல்லாஹ்வின் (கருணையைவிட்டு அப்புறப்படுத்தப்படும்) சாபத்தில் உனக்குள்ள பங்கை நீ எடுத்துக்கொள்ளாத வரை நீ எங்கள் மார்க்கத்தில் இருக்க முடியாது” என்று சொன்னார். ஸைத் அவர்கள், “அல்லாஹ்வின் சாபத்திலிருந்துதானே நான் வெருண்டோடி வருகின்றேன். அல்லாஹ்வின் சாபத்திலிருந்தும் அவனது கோபத்திலிருந்தும் சிறிதளவைக்கூட ஒருபோதும் நான் தாங்கமாட்டேன். (அவற்றை) எப்படி என்னால் தாங்க முடியும்? வேறெந்த மார்க்கத்தையாவது எனக்கு நீங்கள் அறிவித்துத் தருவீர்களா?” என்று கேட்க, அதற்கு அவர், “நேரிய (ஏகத்துவ) மார்க்கமாகத்தான் அது இருக்குமென்பதை நான் நன்கறிவேன்” என்று சொன்னார். ஸைத் அவர்கள், “நேரிய மார்க்கம் என்றால் என்ன?” என்று கேட்டார். அதற்கு அந்த அறிஞர், “இப்ராஹீம் (அலை) அவர்களின் மார்க்கம். அவர்கள் யூதராகவோ கிறித்தவராகவோ இருக்கவில்லை. மேலும் அல்லாஹ்வைத் தவிர வேறெவரையும் அவர்கள் வழிபடமாட்டார்கள்” என்று பதிலளித்தார். ஸைத் அவர்கள் அந்த அறிஞர்கள் இப்ராஹீம் (அலை) அவர் களின் மார்க்கத்தைப் பற்றிக் கூறியதைக் கண்டபோது, (அவர்களிடமிருந்து) புறப்பட்டு வெளியே வந்ததும் தம் கைகளை உயர்த்தி, “இறைவா! நான் இப்ராஹீம் (அலை) அவர்களுடைய (ஏகத்துவ) மார்க்கத்தில் உள்ளேன் என்று உறுதிகூறுகிறேன்” எனச் சொன்னார். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 52
			}
		}
	]
}