{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் (ஒரு விஷயத் தைப் பற்றி), “நான் இதைக் குறித்து இப்படிக் கருதுகிறேன்” என்று சொல்ல நான் கேட்பேனாயின், அந்த விஷயம் அவர்கள் கூறியதைப் போலத்தான் இருக்கும். ஒருமுறை உமர் (ரலி) அவர்கள் (தம் இடத்தில்) அமர்ந்திருந்தபொழுது அழகான ஒரு மனிதர் அவர்களைக் கடந்து சென்றார். அப்போது உமர் (ரலி) அவர்கள், “ஒன்று நான் (இவர் அஞ்ஞானக் கலாசாரத்தில் இருப்பவர் என்று) நினைத்தது தவறாயிருக்க வேண்டும்; அல்லது (நான் நினைத்தது சரியாக இருக்குமானால்) இந்த மனிதர் தமது (பழைய) அறியாமைக் கால மார்க்கத்திலேயே இருக்க வேண்டும்; அல்லது (அறியாமைக் கால) அம்மக்களுக்குக் குறிசொல்பவராக (சோதிடராக) இருந்திருக்க வேண்டும். அந்த மனிதரை என்னிடம் அழைத்து வாருங்கள்” என்று சொன்னார்கள். அவ்வாறே அவர், உமர் (ரலி) அவர்களிடம் அழைத்துவரப்பட்டார். உமர் (ரலி) அவர்கள், தாம் (முன்பு சந்தேகத்துடன்) கூறியதையே அந்த மனிதரிடமும் கேட்டார்கள். அந்த மனிதர் (தம்மைப் பற்றி உமர் முன்வைத்த சந்தேகத்தால் வெறுப்படைந்தவராய்), “இன்று ஒரு முஸ்லிமான மனிதருக்குக் கொடுக்கப்பட்ட வரவேற்பு போன்று நான் (எப்போதும்) பார்த்ததில்லை” என்று சொன்னார். உமர் (ரலி) அவர்கள், “நீ எனக்கு (அறியாமைக் காலத்தில் நடந்த) செய்தியைச் சொல்லத்தான் வேண்டும் என்று விரும்பு கிறேன்” என்று சொன்னார்கள். அதற்கு அவர், “நான் அறியாமைக் காலத்தில் அம்மக்களின் சோதிடனாக (குறிகாரனாக) இருந்தேன்” என்று சொன்னார். உமர் (ரலி) அவர்கள், “உனது பெண் ஜின் உன்னிடம் கொண்டுவந்த செய்திகளிலேயே மிகவும் வியப்புக்குரியது எது?” என்று கேட்டார்கள். அம்மனிதர், “நான் ஒரு நாள் கடைவீதியில் இருந்தபோது, பெண் ஜின் என்னிடம் வந்தது. அதனிடம் பீதியைக் கண்டேன். அப்போது “ஜின்கள் அடைந்துள்ள அச்சத்தை நீங்கள் பார்க்கவில்லையா? அவை (மேலுலகச் செய்திகளை ஒட்டுக் கேட்க முடியாமல்) தோல்வியுற்றுத் திரும்புவதால் அடைந்துள்ள நிராசையை யும் நீங்கள் பார்க்கவில்லையா? அவை இளம் ஒட்டகங்களையும் அவற்றின் (சேண இருக்கையின் கீழே விரிக்கப்படும்) துணியையும் பின்பற்றிச் செல்வதைக் காணவில்லையா?'108 என்று கேட்டது” என்று சொன்னார். உமர் (ரலி) அவர்கள், “இவர் உண்மை சொன்னார். நான் (கஅபாவில்) இணைவைப்பாளர்களின் கடவுள் (சிலை)களுக்கு அருகே தூங்கிக்கொண்டிருந்தபோது, ஒரு மனிதர் காளைக் கன்று ஒன்றைக் கொண்டுவந்து (பலி கொடுத்து) அதை அறுத்தார். அப்போது அசரீரிக் குரல் ஒன்று வந்தது. அதைவிடக் கடுமையான குரலில் குரல் கொடுப்பவர் எவரையும் நான் செவியுற்றதேயில்லை. அது, “பகிரங்கமாகப் பகைத்துக்கொண்டவரே! வெற்றிகரமான ஒரு விஷயம். பேச்சுத் திறனுள்ள ஒரு மனிதர், “(அல்லாஹ்வே!) உன்னைத் தவிர வேறு இறைவனில்லை' என்று சொல்வார்” என்று குரல் கொடுத்தது. உடனே (இணைவைக்கும்) மக்கள் குதித்தெழுந்தார்கள். நான், “இந்த மர்மக் குரலுக்குப் பின்னால் என்ன உள்ளது என்பதை அறிந்துகொள்ளாமல் விடமாட்டேன்” என்று சொன்னேன். பிறகு (மீண்டும்) அந்த அசரீரி, “பகிரங்கமாகப் பகைத்துக் கொண்டவரே! வெற்றிகரமான ஒரு விஷயம். பேச்சுத் திறனுள்ள ஒரு மனிதர், “அல்லாஹ்வைத் தவிர வேறு இறைவ னில்லை' என்று சொல்வார்” என்று குரல் கொடுத்தது. நான் எழுந்து சென்றுவிட்டேன். சிறிது காலத்திற்குள்ளாகவே, “இதோ ஒரு நபி (வந்துவிட்டார்)” என்று சொல்லப் பட்டது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		}
	]
}