{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: நான் (இறையில்லம் கஅபா அருகில்) “ஹத்தீமில்' அல்லது “ஹிஜ்ரில்' படுத்துக் கொண்டிருந்தேன். அப்போது என்னிடம் ஒருவர் (வானவர் ஜிப்ரீல்) வந்து (என் நெஞ்சைப்) பிளந்தார். -அறிவிப்பாளர்களில் ஒருவரான அனஸ் (ரலி) அவர்கள், “இங்கிருந்து இது வரையில் அவர் பிளந்தார்” என்று நபி (ஸல்) அவர்கள் சொன்னதாகக் கூறி னார்கள். அறிவிப்பாளர் கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் என்னருகில் இருந்த (அனஸ் (ரலி) அவர்களின் நண்பர்) ஜாரூத் (ரஹ்) அவர்களிடம், “அனஸ் (ரலி) அவர்கள், இங்கிருந்து இதுவரையில்... என்று எதைக் கருத்தில் கொண்டு கூறினார்கள்?” என்று கேட்டேன். அதற்கு ஜாரூத் (ரஹ்) அவர்கள், “நபி (ஸல்) அவர்களின் “நெஞ்சின் காறையெலும்பிலிருந்து அடிவயிறுவரை' அல்லது “நெஞ்சின் ஆரம்பத்திலிருந்து அடிவயிறுவரை' என்ற கருத்தில் அனஸ் (ரலி) அவர்கள் கூறினார்கள்” என்று பதிலளித்தார்கள்.- பிறகு அ(ந்த வான)வர் (ஜிப்ரீல்) எனது இதயத்தை வெளியில் எடுத்தார். பிறகு, இறைநம்பிக்கையால் நிரப்பப்பட்ட தங்கத் தட்டு ஒன்று என்னிடம் கொண்டுவரப் பட்டு, எனது இதயம் கழுவப்பட்டு, (அதில்) அந்த இறைநம்பிக்கை நிரப்பப்பட்டது. பிறகு பழையபடி மீண்டும் (எனது இதயம், மூடி)வைக்கப்பட்டது. பிறகு கோவேறுக் கழுதையைவிடச் சிறியதும் கழுதையை விடப் பெரியதுமான வெள்ளை நிறத்தில் அமைந்த (மின்னல் வேக) வாகனம் ஒன்றும் என்னிடம் கொண்டுவரப்பட்டது. -(இந்த ஹதீஸின் அறிவிப்பாளர்களில் ஒருவரான) அனஸ் (ரலி) அவர்களிடம் ஜாரூத் (ரஹ்) அவர்கள், “அது புராக் எனும் வாகனம்தானே, அபூஹம்ஸா அவர்களே?” என்று கேட்டார்கள். அதற்கு அனஸ் (ரலி) அவர்கள், “ஆம், (அது புராக்தான்.) அந்த வாகனம் பார்வை எட்டுகிற தூரத்திற்கு ஓர் எட்டு வைக்கும்” என்று கூறினார்கள்.- பிறகு நான் அந்த வாகனத்தில் ஏற்றப்பட்டேன். என்னை ஜிப்ரீல் முதல் வானத் திற்கு அழைத்துச்சென்று அதன் கதவைத் திறக்கும்படி கூறினார். அப்போது, “யார் அது?” என்று கேட்கப்பட்டது. அதற்கு அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் (வந்திருப்பவர்) யார்?” என்று கேட்கப்பட்டது. அதற்கு அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரச்சொல்லி) அவரிடம் ஆள் அனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். “அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. அப்போது (அந்த வானத்தின் காவலர்) கதவைத் திறந்தார். நான் அங்கு சென்றடைந்தபோது அங்கு (ஆதி மனிதர்) ஆதம் (அலை) அவர்கள் இருந்தார்கள். (என்னிடம் ஜிப்ரீல்) “இவர்கள் உங்கள் தந்தை ஆதம். இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று கூறினார். அவர்களுக்கு நான் சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு, ஆதம் (அலை) அவர்கள், “(என்) நல்ல மகனும், நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகுக!” என்று சொன்னார்கள். பிறகு (என்னை அழைத்துக்கொண்டு ஜிப்ரீல்) இரண்டாம் வானத்தில் ஏறி அதைத் திறக்கும்படி சொன்னார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளிக்க, “உங்களுடன் (இருப்பவர்) யார்?” என்று வினவப்பட்டது. (அதற்கு) அவர், “முஹம்மத்' என்று பதிலளித்தார், “(அவரை அழைத்து வரும் படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்று பதிலளித்தார். “அவரது வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. பிறகு (அந்த வானத்தின் காவலர் கதவைத்) திறந்தார். நான் அங்கு சென்றடைந்த போது, அங்கு யஹ்யா (அலை) அவர்களும், ஈசா (அலை) அவர்களும் இருந்தனர். -அவ்விருவரும் சிற்றன்னையின் மக்களாவர்.-134 இது யஹ்யா அவர்களும், ஈசா அவர்களும் ஆவர். இவர்களுக்கும் சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் (அவர்கள் இருவருக்கும்) சலாம் சொன்னபோது அவர்கள் சலாமிற்குப் பதில் கூறினார்கள். பிறகு அவர்கள் இருவரும், “நல்ல சகோதரரும், நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்துக்) கூறினர். பிறகு ஜிப்ரீல் என்னை அழைத்துக்கொண்டு மூன்றாம் வானத்திற்கு ஏறினார். (அந்த வானத்தின் கதவைத்) திறக்கும்படி கூறினார். “யார் அது?” என்று கேட்கப் பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித் தார். “உங்களுடன் (இருப்பவர்) யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டி ருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்று பதிலளித்தார். “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. பிறகு (அந்த வானத்தின் கதவு) திறக்கப்பட்டது. அங்கு நான் சென்றடைந்த போது அங்கு யூசுஃப் (அலை) அவர்கள் இருந்தார்கள். “இவர்கள்தான் (இறைத்தூதர்) யூசுஃப். இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் உரைத்தேன். அவர்களும் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத் தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்துச்) சொன்னார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் நான்காம் வானத்திற்கு ஏறினார். (அந்த வானத்தின் கதவைத்) திறக்குமாறு சொன்னார். “யார் அது” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் இருப்பவர் யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று வினவப்பட்ட போது, “ஆம்' என்று அவர் பதிலுரைத்தார். “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (எனக்கு வாழ்த்துச்) சொல்லப்பட்டு(க் கதவும்) திறக்கப்பட்டது. அங்கு நான் சென்றடைந்தபோது அங்கு இத்ரீஸ் (அலை) அவர்கள் இருந்தார்கள். “இவர்கள்தான் இத்ரீஸ் (அலை) அவர்கள். இவர்களுக்கு சலாம் கூறுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்களும் எனக்குப் பதில் சலாம் கூறினார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும்” என்று (வாழ்த்தும்) சொன்னார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் ஐந்தாம் வானத்திற்கு வந்து சேர்ந்து அதைத் திறக்கும்படி சொன்னார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் (இருப்பவர்) யார்?” என்று வினவப்பட்டது. அவர், “முஹம்மத்' என்று பதிலளித்தார். “(அவரை அழைத்து வருமாறு) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். “அவர் வரவு நல்வரவாகட்டும். அவர் வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொல்லப்பட்டது. நான் அங்கு சென்றடைந்தபோது ஹாரூன் (அலை) அவர்கள் அங்கிருந் தார்கள். “இவர்கள்தான் ஹாரூன். இவர்களுக்கும் சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் சொன்னார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன்னார்கள். பிறகு அவர்கள், “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வரவாகட்டும் “ என்று (வாழ்த்துச்) சொன்னார்கள். பிறகு என்னுடன் அவர் ஆறாம் வானத்திற்கு ஏறினார். (அதன் கதவைத்) திறக்கும்படி கூறினார். “யார் அது?” என்று கேட்கப்பட்டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் யார்?” என்று கேட்கப்பட்டது. அவர், “முஹம்மத்' என்றார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். (அந்த வானத்தின் காவலர்,) “அவர் வரவு நல்வரவாகட்டும். அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொன்னார். அங்கு நான் சென்றடைந்தபோது மூசா (அலை) அவர்கள் அங்கிருந்தார்கள். “இவர்கள்தான் மூசா. இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்கு) பதில் சலாம் சொன் னார்கள். பிறகு, “நல்ல சகோதரரும் நல்ல இறைத்தூதருமான உங்கள் வரவு நல்வர வாகட்டும்” என்று (வாழ்த்துச்) சொன்னார் கள். நான் (மூசா (அலை) அவர்களைக்) கடந்து சென்றபோது அவர்கள் அழுதார் கள். “தங்கள் அழுகைக்கு என்ன காரணம்?” என்று அவர்களிடம் கேட்கப் பட்டது. அவர்கள், “என் சமுதாயத்தாரில் சொர்க்கம் புகுபவர்களைவிட அதிகமான வர்கள், எனக்குப் பிறகு அனுப்பப்பட்ட இந்த இளைஞரின் சமுதாயத்திலிருந்து சொர்க்கம் புகுவார்கள் என்பதால்தான் அழுகிறேன்” என்று பதிலளித்தார்கள். பிறகு என்னை அழைத்துக்கொண்டு ஜிப்ரீல் ஏழாவது வானத்திற்கு ஏறினார். (அதன் கதவைத்) திறக்கும்படி ஜிப்ரீல் கூறினார். “யார் அது?' என்று கேட்கப்பட் டது. அவர், “ஜிப்ரீல்' என்று பதிலளித்தார். “உங்களுடன் இருப்பவர் யார்?” என்று வினவப்பட்டபோது அவர், “முஹம்மத்' என்று பதில் சொன்னார். “(அவரை அழைத்து வரும்படி) அவரிடம் ஆளனுப்பப்பட்டிருந்ததா?” என்று கேட்கப்பட்டது. அவர், “ஆம்' என்றார். (அந்த வானத்தின் காவலர்,) “அவரது வரவு நல்வரவாகட்டும், அவரது வருகை மிக நல்ல வருகை” என்று (வாழ்த்துச்) சொன்னார். நான் அங்கு சென்றடைந்தபோது, இப்ராஹீம் (அலை) அவர்கள் அங்கிருந்தார்கள். “இவர்கள்தான் உங்கள் தந்தை. இவர்களுக்கு சலாம் சொல்லுங்கள்” என்று ஜிப்ரீல் கூறினார். நான் அவர்களுக்கு சலாம் சொன்னேன். அவர்கள் (எனக்குப்) பதில் சலாம் உரைத்தார்கள். அவர்கள், “நல்ல மகனும், நல்ல இறைத்தூதருமான இவரது வரவு நல்வரவாகட்டும்” என்று வாழ்த்துச் சொன்னார்கள். பிறகு, (வான எல்லையில் அமைந்துள்ள இலந்தை மரமான) “சித்ரத்துல்முன்(த்)தஹா' எனும் இடத்திற்கு நான் கொண்டுசெல்லப்பட்டேன். அதன் (இலந்தைப்) பழங்கள் (யமனில் உள்ள) “ஹஜர்' எனுமிடத்தின் (உற்பத்திப் பொருளான மண்) கூஜாக்கள்போல் இருந்தன. அதன் இலைகள் யானைகளின் காதுகள் போலிருந்தன. “இதுதான் சித்ரத்துல் முன்(த்)தஹா” என்று ஜிப்ரீல் (அறிமுகப்படுத்திக்) கூறினார். அங்கு (அந்த மரத்தின் வேர்ப்பகுதியில் இருந்து ஓடிவருகின்ற) நான்கு ஆறுகள் இருந்தன. இரண்டு ஆறுகள் உள்ளே இருந்தன. மற்றும் இரண்டு ஆறுகள் வெளியே இருந்தன. “ஜிப்ரீலே! இவ்விரண்டு ஆறுகள் எவை?” என்று நான் கேட்டேன். அவர், “உள்ளேயிருப்பவை இரண்டும் சொர்க்கத் தில் உள்ள (ஸல்ஸபீல், கவ்ஸர் ஆகியவை)வையாகும். வெளியே இருப்பவை இரண்டும் நீல் நதியும் யூப்ரடீஸ் நதியும் ஆகும்” என்று பதிலளித்தார்கள். பிறகு, “அல்பைத்துல் மஅமூர்' (எனும் “வானவர்கள் அதிகம் சஞ்சரிக்கும் இறையில்லம்') எனக்கு (அருகே கொண்டுவந்து) காட்டப்பட்து. பிறகு என்னிடம் ஒரு பாத்திரத்தில் மதுவும், ஒரு பாத்திரத்தில் பாலும் இன்னொரு பாத்திரத்தில் தேனும் கொண்டுவரப்பட்டது. நான் பாலை (தேர்ந்து) எடுத்தேன். (பிறகு அதைக் குடித்தேன்.) அப்போது ஜிப்ரீல், “இதுதான் நீங்களும் உங்கள் சமுதாயத்தாரும் இருக்கும் (இஸ்லாம் எனும்) இயற்கை நெறியாகும்” என்று கூறினார்கள். பிறகு என்மீது ஒவ்வொரு தினத்திற்கும் ஐம்பது (வேளைத்) தொழுகைகள் கடமையாக்கப்பட்டன. நான் திரும்பிவந்தபோது மூசா (அலை) அவர்களைக் கடந்து சென்றேன். அப்போது அவர்கள், “உங்களுக்கு என்ன உத்தரவிடப்பட்டது?” என்று கேட்டார்கள். “ஒவ்வொரு நாளும் ஐம்பது (வேளைத்) தொழுகை (கட்டாயக் கடமையாக நிறைவேற்றும்படி) எனக்கு உத்தரவிடப்பட்டது” என்று நான் பதிலளித்தேன். உங்கள் சமுதாயத்தார் ஒரு தினத்திற்கு ஐம்பது வேளைத் தொழுகையைத் தாங்கமாட்டார்கள். அல்லாஹ்வின் மீதாணையாக! நான் உங்களுக்கு முன் மக்களிடம் அனுபவப்பட்டுள்ளேன். இஸ்ரவேலர்களுடன் பழகி நன்கு பக்குவப் பட்டுள்ளேன். ஆகவே, உங்கள் இறைவனிடம் திரும்பிச் சென்று அவனிடம் உங்கள் சமுதாயத்தாருக்காக (தொழுகையின் எண்ணிக்கையைக்) குறைத்துக் தரும்படி கேளுங்கள்” என்று சொன்னார்கள். நான் திரும்பிச் சென்றேன். (இறைவனிடம் குறைத்துத் தரும்படி கேட்டேன்) இறைவன் (ஐம்பதிலிருந்து) பத்தை எனக்குக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். முன்பு போலவே (இன்னும் குறைத்துக் கேட்கும் படி) சொன்னார்கள். நான் திரும்பிச் சென்றேன். அப்போது (நாற்பதிலிருந்து) பத்தைக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போதும் முன்பு போலவே (இன்னும் குறைத்துக் கேட்கும்படி) கூறினார்கள். நான் (இறைவனிடம்) திரும்பிச் சென்றேன். எனக்கு (முப்பதி óருந்து) பத்தைக் குறைத்தான். நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போது அவர்கள் முன்பு போலவே (குறைத்து கேட்கும்படி) கூறினார்கள். நான் திரும்பிச் சென்றேன். எனக்கு (இருபதிலிருந்து பத்து குறைக்கப்பட்டு) தினந்தோறும் பத்து (வேளைத்) தொழுகைகள் (தொழும்படி) உத்தரவிடப்பட்டது. நான் (மூசா (அலை) அவர்களிடம்) திரும்பி வந்தேன். அப்போதும் அவர்கள் முன்பு போலவே சொன்னார்கள். நான் திரும்பிச் சென்றேன். ஒவ்வொரு நாளும் ஐந்து (வேளைத்) தொழுகைகள் (நிறைவேற்றும்படி) எனக்கு உத்தரவிடப்பட்டது. நான் மூசா (அலை) அவர்களிடம் திரும்பி வந்தேன். அப்போது, “உங்களுக்கு என்ன உத்தரவிடப்பட்டது?”என்று கேட்டார்கள். ஒவ்வொரு நாளைக்கும் ஐந்து (நேரத்) தொழுகைகள் எனக்கு உத்தரவிடப்பட்டுள்ளன” என்று சொன்னேன். “ஒவ்வொரு நாளும் ஐந்து (நேரத்) தொழுகைகளை உங்கள் சமுதாயத்தார் தாங்கமாட்டார்கள். உங்களுக்கு முன்பே மக்களுடன் பழகி நான் நன்கு அனுபவப்பட்டுள்ளேன். நான் இஸ்ர வேலர்களுடன் பழகி நன்கு பக்குவப் பட்டுள்ளேன். எனவே, உங்கள் இறைவனிடம் திரும்பிச் சென்று உங்கள் சமுதாயத்தாருக்காக இன்னும் குறைத்துத் தரும்படி கேளுங்கள்” என்று கூறினார்கள். அதற்கு நான், “(கடமையான தொழுகை களின் எண்ணிக்கையைக் குறைத்துத் தரும்படி பலமுறை இறைவனிடம்) எனக்கே வெட்கமேற்படும்வரையில் நான் கேட்டுவிட்டேன். ஆகவே, நான் திருப்தி யடைகிறேன்; (இந்த எண்ணிக்கையை) ஒப்புக்கொள்கிறேன்” என்று கூறினேன். பிறகு (அந்த இடத்தை) நான் கடந்தபோது (அல்லாஹ்வின் தரப்பிலிருந்து), “நான் என் (ஐந்து நேரத் தொழுகை எனும்) விதியை நடைமுறைப்படுத்திவிட்டேன். என் அடியார்களுக்கு (ஐம்பது வேளை களிலிருந்து ஐந்து நேரமாகக் குறைத்துக் கடமையை) எளிதாக்கிவிட்டேன்” என்று ஒரு (அசரீரிக்) குரல் ஒலித்தது.135 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 112
			}
		}
	]
}