{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: என் பெற்றோர் (அபூபக்ரும் உம்மு ரூமானும்) எனக்கு விவரம் தெரிந்தது முதல் (இஸ்லாமிய) மார்க்கத்தைக் கடைப்பிடிப்பவர்களாகவே இருந்தனர். பகலின் இரண்டு ஓரங்களான காலையிலும் மாலையிலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் வராமல் எங்களின் எந்த நாளும் கழிந்ததில்லை. (மக்கா நகரில் வாழ்ந்த) முஸ்லிம்கள் இணை வைப்பவர் களால் பல்வேறு துன்பங்கள்) சோதனை களுக்கு உள்ளாக்கப்பட்டபோது, அபூபக்ர் அவர்கள் அபிசீனிய நாட்டை நோக்கி, நாடு துறந்து (ஹிஜ்ரத்) சென்றார்கள். அவர்கள் (யமன் செல்லும் வழியில்) “பர்குல் கிமாத்'152 எனும் இடத்தை அடைந்தபோது இப்னுத் தஃகினா என்பவர் அவர்களைச் சந்தித்தார். -அவர் “அல்காரா' எனும் (பிரபல) குலத்தின் தலைவராவார்- அவர் “அபூபக்ரே எங்கே செல்கிறீர்?” என்று கேட்டார். “என் சமுதாயத்தார் என்னை (நாடு துறந்து) வெளியேறிச் செல்லும் நிலைக்குத் தள்ளிவிட்டனர். ஆகவே, நான் பூமியில் பரவலாகப் பயணம் செய்து (நிம்மதியாக) என் இறைவனை வழிபடப்போகிறேன்” என்று அவர்கள் பதிலளித்தார்கள். அப்போது இப்னுத் தஃகினா, “அபூபக்ரே! தங்களைப் போன்றவர்கள் (தாமாகவும்) வெளியேறக் கூடாது, (பிறரால்) வெளியேற்றப்படவும் கூடாது. (ஏனெனில்) நீங்கள் ஏழைகளுக்காக உழைக்கிறீர்கள். இரத்த பந்த உறவுகளைப் பேணி நடந்து கொள்கிறீர்கள். (சிரமப்படுவோரின்) பாரத்தைச் சுமக்கிறீர்கள். விருந்தினர் களை உபசரிக்கிறீர்கள். சத்திய சோதனை களில் (ஆட்பட்டோருக்கு) உதவி புரிகிறீர்கள் என்று (அவர்களின் அறச் சேவைகளைப் புகழ்ந்து) கூறிவிட்டு, “தங்களுக்கு நான் அடைக்கலம் தரு கிறேன். நீங்கள் (மக்காவிற்கே) திரும்பிச் சென்று உங்களது (அந்த) ஊரிலேயே உங்கள் இறைவனை வழிபடுங்கள்” என்று கூறினார். அபூபக்ர் (அபிசீனிய பயணத்தை ரத்துச் செய்துவிட்டு மக்காவிற்குத்) திரும்பினார்கள். அவர்களுடன் இப்னுத் தஃகினாவும் பயணமா(கித் திரும்பி)னார். மாலையில் இப்னுத் தஃகினா குறைஷிக் குல பிரமுகர்களைப் போய்ச் சந்தித்து அவர்களிடம், “(நாட்டு மக்களுக்காகப் பாடுபடும்) அபூபக்ரைப் போன்றவர்கள் (நாட்டிலிருந்து தாமாக) வெளியேறுவதோ, (பிறரால்) வெளியேற்றப்படுவதோ கூடாது. ஏழைகளுக்கு உழைக்கும், உறவுகளைப் பேணி வாழும், (சிரமப்படுவர்களின்) பாரஞ் சுமந்துவரும், விருந்தினர்களை உபசரித்துவரும், சத்திய சோதனைகளில் (ஆட்படுத்தப்பட்டோருக்கு) உதவிவரும் ஒரு (ஒப்பற்ற) மனிதரையா (நாடு துறந்து) வெளியேறிச் செல்லும் நிலைக்கு உள்ளாக்குகிறீர்கள்?” என்று கேட்டார். (அபூபக்ர் (ரலி) அவர்களுக்குத் தாம் அடைக்கலம் தரப்போவதாகக் கோரிய) இப்னுத் தஃகினாவின் அடைக்கலத்தை குறைஷியர் மறுக்கவில்லை. அவர்கள் இப்னுத் தஃகினாவை நோக்கி, “அபூபக்ர், தமது இல்லத்திற்குள்ளேயே தமது இறைவனை வழிபடவோ, தொழவோ, தாம் விரும்பியதை ஓதவோ செய்யட்டும். ஆனால், இவற்றின் மூலம் எங்களுக்கு இடையூறு செய்யவோ இவற்றைப் பகிரங்கமாகச் செய்யவோ கூடாது. ஏனெனில் எங்கள் மனைவி, மக்கள் (புதிய மத நம்பிக்கை மற்றும் வணக்க வழிபாட்டு முறைகளைப் பார்த்து) குழப்ப மடைந்துவிடுவார்களோ என்று நாங்கள் அஞ்சுகிறோம் என அவரிடம் கூறி விடுங்கள்” என்று சொன்னார்கள். அ(வர்கள் கூறிய)தை இப்னுத் தஃகினா அபூபக்ர் (ரலி) அவர்களிடம் தெரிவித்தார். அதன்படி அபூபக்ர் (ரலி) அவர்கள் தமது இல்லத்திற்குள் தம்முடைய இறைவனை வழிபட்டும், தமது தொழுகை யைப் பகிரங்கப்படுத்தாமலும் தமது வீட்டுக்கு வெளியில் (திருக்குர்ஆன் வசனங்களை) ஓதாமலும் (அவர்கள் விதித்த நிபந்தனைப்படி) இருந்துவந்தார்கள். பிறகு அபூபக்ர் (ரலி) அவர்களுக்கு (மாற்று யோசனை) தோன்றியது. தமது வீட்டு முற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி அதில் தொழுதுகொண்டும் திருக்குர்ஆனை ஓதியும் வந்தார்கள். அப்போது, இணைவைப்பாளர்களின் மனைவி, மக்கள் அபூபக்ர் அவர்களைப் பார்த்து ஆச்சரியப்பட்டு (அவர்களைச் சூழ்ந்து கொண்டு வேடிக்கை பார்ப்பதற்காக) அவர்கள்மீது முண்டியடித்து விழுந்தனர். அபூபக்ர் (ரலி) அவர்கள் குர்ஆன் ஓதும்போது தம் கண்களைக் கட்டுப்படுத்த முடியாமல் (கண்ணீர் உகுத்த வண்ணம்) அதிகமாக அழக்கூடியவராக இருந்தார்கள். (அபூபக்ர் அவர்களின்) இந்த நடவடிக்கை (எங்கே தம்முடைய இளகிய இதயம் படைத்த மனைவி, மக்களை மதம்மாறச் செய்துவிடுமோ என்ற அச்சம்) இணைவைப்பாளர்களான குறைஷியரைப் பீதிக்குள்ளாக்கியது.153 அதனால் அவர்கள் இப்னுத் தஃகினாவிடம் ஆளனுப்பினர். அவரும் குறைஷியரிடம் வந்தார். அப்போது அவர்கள், “அபூபக்ர் தமது இல்லத்திற்குள்ளேயே தம் இறைவனை வழிபட்டுக்கொள்ளட்டும் என்று (நிபந்தனையிட்டு) அவருக்கு நீங்கள் அடைக்கலம் தந்ததன் பேரிலேயே நாங்கள் அவருக்கு அடைக்கலம் தந்தோம். அவர் அதை மீறிவிட்டுத் தமது வீட்டுமுற்றத்தில் தொழுமிடம் ஒன்றை உருவாக்கி அந்த இடத்தில் பகிரங்கமாகத் தொழுதுகொண்டும், (குர்ஆனை) ஓதிக் கொண்டும் இருக்கிறார். நாங்கள் எங்கள் மனைவி, மக்கள் குழப்பத்திற்குள்ளாகி விடுவார்களோ என்று அஞ்சுகிறோம். எனவே அபூபக்ரைத் தடுத்துவையுங்கள். அவர், அவருடைய இறைவனைத் தமது இல்லத்தில் வழிபடுவதோடு மட்டும் நிறுத்திக்கொள்ள விரும்பினால் அவ்வாறு செய்யட்டும். அவர் அதை மறுத்துப் பகிரங்கப்படுத்தவே செய்வேன் என்றால், அவரிடம் உமது (அடைக்கலப்) பொறுப் பைத் திரும்பத் தருமாறு கேளுங்கள். ஏனெனில், (உங்களது உடன்பாட்டை முறித்து) உங்களுக்கு நாங்கள் மோசடி செய்வதை வெறுக்கிறோம். (அதே சமயம்) அபூபக்ர் (அவற்றை) பகிரங்கமாகச் செய்ய நாங்கள் அனுமதிப்போராகவும் இல்லை” என்று கூறினர். ஆயிஷா (ரலி) அவர்கள் கூறுகிறார்கள்: இப்னுத் தஃகினா அபூபக்ர் (ரலி) அவர்களிடம் வந்து, “நான் எ(ந்)த (நிபந்தனையி)ன் பேரில் உங்களிடம் ஒப்பந்தம் செய்தேன் என்பதைத் தாங்கள் அறிவீர்கள். ஆகவே ஒன்று, அதனோடு மட்டும் நீங்கள் நிறுத்திக்கொள்ள வேண்டும். அல்லது எனது (அடைக்கலப்) பொறுப்பை என்னிடம் திரும்பத் தந்துவிட வேண்டும். ஏனென்றால், நான் உடன்படிக்கை செய்துகொண்ட ஒரு மனிதரின் விஷயத்தில் ஏமாற்றப்பட்டேன் என்று அரபியர் கேள்விப்படுவதை நான் விரும்பமாட்டேன்” என்று கூறினார். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “உமது அடைக்கலத்தை உம்மிடமே திரும்பத் தந்துவிடுகிறேன். வல்லமையும் மாண்புமிக்க அல்லாஹ்வின் அடைக்கலம் குறித்து நான் திருப்திப்படுகிறேன்” என்று கூறினார்கள். அன்றைக்கு நபி (ஸல்) அவர்கள் மக்காவில் இருந்துகொண்டி ருந்தார்கள். அப்போது நபி (ஸல்) அவர்கள் முஸ்லிம்களைப் பார்த்து, “இரு கருங்கல் மலைகளுக்கிடையே பேரீச்ச மரங்கள் நிறைந்த (மதீனா) பகுதியை நீங்கள் ஹிஜ்ரத் செல்கின்ற நாடாக நான் (கனவில்) காட்டப்பட்டேன்” என்று கூறினார்கள். எனவே, மதீனா நோக்கி ஹிஜ்ரத் சென்றவர்கள் சென்றார்கள். (ஏற்கெனவே) அபிசீனிய நாட்டிற்கு ஹிஜ்ரத் சென்றிருந்த வர்கள் பலர் (முஸ்லிம்கள் மதீனாவில் குடியேறுவதைக் கேள்விப்பட்டு) மதீனா வுக்குத் திரும்பினார்கள். (மக்காவிலிருந்து) அபூபக்ர் அவர்களும் மதீனா நோக்கி (ஹிஜ்ரத் புறப்பட) ஆயத்தமானார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “சற்று பொறுங்கள். எனக்கு (ஹிஜ்ரத்திற்கு) அனுமதி வழங்கப்படுவதை நான் எதிர்பார்த்துக்கொண்டிருக்கிறேன்” என்று (அபூபக்ர் (ரலி) அவர்களிடம்) கூறினார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “என் தந்தை தங்களுக்கு அர்ப்பணம்; அனுமதியை(த்தான்) எதிர்பார்க்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு, “ஆம் (எதிர்பார்க்கிறேன்)” என்று நபி (ஸல்) அவர்கள் பதிலளித்தார்கள். ஆகவே அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடன் (ஹிஜ்ரத்) செல்வதற்காகத் தன்(பயணத்தி)னை நிறுத்தினார்கள். மேலும் அபூபக்ர் அவர்கள் (இந்தப் பயணத்திற் காகவே) தம்மிடம் இருந்த இரு ஊர்தி ஒட்டகங்களுக்கு நான்கு மாதம் கருவேலந் தழையைத் தீனிபோட்டு (வளர்த்து)வந்தார்கள்.154 ஆயிஷா (ரலி) அவர்கள் (தொடர்ந்து) கூறுகிறார்கள்: நாங்கள் ஒருநாள் அபூபக்ர் (ரலி) அவர்களின் இல்லத்தில் உச்சிப் பொழுதில் அமர்ந்துகொண்டிருந்தோம். அப்போது ஒருவர் அபூபக்ர் (ரலி) அவர்களிடம், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமது தலையை மூடிய வண்ணம் -நம்மிடம் வருகை தராத ஒரு நேரத்தில் (வழக்கத்திற்கு மாற்றமாக)- இதோ வந்து கொண்டிருக்கிறார்கள்” என்று கூறினார். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “என் தந்தையும் என் தாயும் (நபி) அவர்களுக்கு அர்ப்பணமாகட்டும்! அல்லாஹ்வின் மீதாணையாக! ஏதோ (முக்கிய) விஷயம் தான் அவர்களை இந்த நேரத்தில் (இங்கு) வரச்செய்திருக்கிறது” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்து (இல்லத்திற்குள் நுழைய) அனுமதி கோரினார்கள். அவர்களுக்கு அனுமதியளிக்கப்பட்ட வுடன் அவர்கள் உள்ளே நுழைந்து, அபூபக்ர் (ரலி) அவர்களிடம், “உங்களிடம் இருப்பவர்களை வெளியேபோகச் சொல்லுங்கள். (உங்களிடம் ஒரு ரகசியம் பேச வேண்டும்)” என்று கூறினார்கள். அதற்கு, அபூபக்ர் (ரலி) அவர்கள் (இல்லத்திற்குள் இருக்கும்) இவர்கள் உங்களுடைய (துணைவியின்) குடும்பத்தார்தான். என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும்! அல்லாஹ்வின் தூதரே!” என்று சொன்னார்கள். அதற்கு நபி (ஸல்) அவர்கள் (ஹிஜ்ரத்) புறப்பட்டுச் செல்ல எனக்கு அனுமதி வழங்கப்பட்டு விட்டது” என்று கூறினார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள், “தங்களுடன் நானும் வர விரும்புகிறேன்! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும் அல்லாஹ்வின் தூதரே!” என்று கேட்டார்கள். “சரி! (நீங்களும் வாருங்கள்)” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிலளித்தார்கள். “அல்லாஹ்வின் தூதரே! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும். இந்த என் இரு ஊர்தி ஒட்டகங்களில் ஒன்றைத் தாங்கள் எடுத்துக்கொள்ளுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “விலைக்குத்தான் (இதை நான் எடுத்துக்கொள்வேன்)” என்று கூறினார்கள். ஆயிஷா (ரலி) அவர்கள் கூறுகிறார் கள்: அவர்கள் இருவருக்காகவும் தேவையான பயண ஏற்பாடுகளை வெகு விரைவாக நாங்கள் செய்து முடித்தோம். ஒரு தோல்பையில் பயண உணவை நாங்கள் தயார் செய்துவைத்தோம். அப்போது அபூபக்ரின் மகள் (என் சகோதரி) அஸ்மா தனது இடுப்புக் கச்சிலிருந்து ஒரு துண்டை(க் கிழித்து) அதை அந்தப் பையின் வாய்மீது வைத்துக் கட்டினார்கள். இதனால்தான் அவர்களுக்கு “கச்சுடையாள்' என்று பெயர் வந்தது. பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் (பயணம் புறப்பட்டு) “ஸவ்ர்' மலையில் உள்ள ஒரு குகைக்கு வந்து சேர்ந்து அதில் மூன்று நாட்கள் ஒளிந்திருந்தார்கள். (அந்த மூன்று நாட்களில்) அவர்கள் இருவருடன் அப்துல்லாஹ் பின் அபீபக்ரும் இரவில் வந்து தங்கியிருப்பார் -அவர் சமயோசித அறிவு படைத்த, புத்திக் கூர்மையுள்ள இளைஞராக இருந்தார்- பின்னிரவு (சஹர்) நேரத்தில் அவர்கள் இருவரைவிட்டுப் புறப்பட்டு மக்கா குறைஷியருடன் இரவில் தங்கியிருந்தவர் போல அவர்களுடன் காலையில் இருப்பார். அவர்கள் இருவரைப் பற்றி (குறைஷியரால் செய்யப்படும்) சூழ்ச்சிகளைக் கேட்டு, அவற்றை நினைவில் இருத்திக்கொண்டு இருள் கவிழும் நேரத்தில் அவர்கள் இருவரிடமும் அந்தச் செய்திகளைக் கொண்டுவந்துவிடுவார். அவர்கள் இருவருக்காக அபூபக்ர் (ரலி) அவர்களின் (முன்னாள்) அடிமை ஆமிர் பின் ஃபுஹைரா (அபூபக்ர் அவர்களின்) மந்தையிலிருந்து ஒரு பால் தரும் ஆட்டை மேய்த்து வருவார். இரவில் சிறிது நேரம் கழிந்தவுடன் அதனை அவர்கள் இருவரிடமும் ஓட்டிவருவார். அந்தப்பாலிலேயே இருவரும் இரவைக் கழித்துவிடுவார்கள்-அது புத்தம் புதிய, அடர்த்தி அகற்றப்பட்ட பாலாகும் -அந்த ஆட்டை ஆமிர் பின் ஃபுஹைரா இரவின் இருட்டு இருக்கும்போதே விரட்டிச் சென்றுவிடுவார். இதை (அவர்கள் இருவரும் அந்தக் குகையில் தங்கியிருந்த) மூன்று இரவுகளில் ஒவ்வோர் இரவிலும் அவர் செய்துவந்தார். மேலும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும், அபூபக்ர் (ரலி) அவர்களும் பனூ அப்த் பின் அதீ குலத்தில் “பனூ அத்தீல்' எனும் கிளையைச் சேர்ந்த கை தேர்ந்த ஒருவரை155 பயண வழிகாட்டி யாக இருக்கக் கூலிக்கு அமர்த்தினர். அவர் ஆஸ் பின் வாயில் அஸ்ஸஹ்மீ எனும் குலத்தாருடன் நட்புறவு ஒப்பந்தம் செய்துகொண்டிருந்தார். (ஆனாலும்) அவர் குறைஷி இறைமறுப்பாளர்களின் மதத்தில் இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் அவரை நம்பி, தங்களது இரு ஊர்தி ஒட்டகங்களை ஒப்படைத்து மூன்று இரவுகளுக்குப் பின் “ஸவ்ர்' குகைக்கு வந்துவிடுமாறு வாக்குறுதி வாங்கியிருந்தனர். மூன்றாம் (நாள்) அதிகாலையில் அந்த இரு ஊர்திகளுடன் (அவர் ஸவ்ர் குகைக்கு வந்து சேர்ந்தார்.) அவர்கள் இருவருடன் ஆமிர் பின் ஃபுஹைராவும் பயண வழிகாட்டியும் சென்றனர். பயண வழிகாட்டி அவர்களைக் கடற்கரைப் பாதையில் அழைத்துச் சென்றார்.156 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 130
			}
		}
	]
}