{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "சுராகா பின் (மாலிக் பின்) ஜுஅஷும் (ரலி) அவர்கள் கூறியதாவது: குறைஷிக் குலத்தின் தூதுவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை யும் அபூபக்ர் (ரலி) அவர்களையும் கொலை செய்பவருக்கு, அல்லது (உயிருடன்) கைதுசெய்து வருபவருக்கு இருவரில் ஒவ்வொருவருக்கும் (நூறு ஒட்டகம் என்று) பரிசை நிர்ணயம் செய்(து அறிவித்)தவர்களாக எங்களிடம் வந்த னர். அப்போது நான் எங்களது பனூ முத்லிஜ் சமுதாயத்தின் அவைகளில் ஒன்றில் அமர்ந்திருந்தேன். அப்போது அவர்களில் ஒருவர் எழுந்து வந்து, அமர்ந்துகொண்டிருந்த எங்களிடையே நின்றுகொண்டு, “சுராகாவே! சற்றுமுன் நான் கடலோரத்தில் சில உருவங்களைப் பார்த்தேன். அவர்கள் முஹம்மதும் அவருடைய தோழர்களும் தான் என்று நான் கருதுகிறேன்” என்று கூறினார். அவர்கள் முஹம்மதும் தோழர்களும் தான் என்று நான் அறிந்துகொண்டேன். (இருப்பினும் அவரைத் திசை திருப்புவதற் காக) “அவர்கள் முஹம்மதும் தோழர்களும் அல்லர். மாறாக, இன்னார் இன்னாரைத்தான் நீ பார்த்திருப்பாய். அவர்கள் எங்கள் கண்ணெதிரேதான் (தங்களின் காணாமற்போன ஒட்டகங்களைத் தேடிப்)போனார்கள்” என்று நான் அவரிடம் கூறினேன். பிறகு அந்த அவையிலேயே சிறிது நேரம் இருந்தேன். அதற்குப் பிறகு எழுந்து (எனது இல்லத்திற்குள்) நுழைந்து என் அடிமைப் பெண்ணிடம் எனது குதிரையை வெளியே கொண்டுவரும்படி உத்தரவிட்டேன். - அப்போது குதிரை ஒரு மலைக்குன்றுக்கு அப்பால் இருந்தது.- எனக்காக அதை அவள் (அங்கே) கட்டிவைத்திருந்தாள். பின்பு, நான் என்னுடைய ஈட்டியை எடுத்துக்கொண்டு வீட்டின் பின்புற வாசல் வழியாக வெளியேறினேன். (ஈட்டியை நான் தாழ்த்திப் பிடித்திருந்ததால்) அதன் கீழ் முனையால் (என்னையும் அறியாம லேயே) தரையில் கோடு கிழித்தேன். மேலும், அதன்மேல் நுனியை தாழ்த்திக் கொண்டு என் குதிரையிடம் வந்து அதன் மீது ஏறிக்கொண்டேன். அதன் முன்னங் கால் இரண்டையும் ஒரே நேரத்தில் உயர்த்தி ஒரே நேரத்தில் பூமியில் வைக்குமாறு செய்து மிக வேகமாகப் புறப்பட்டு அவர்களை நெருங்கினேன். அப்போது எனது குதிரை காலிடறி அதிலிருந்து நான் விழுந்துவிட்டேன். உடனே நான் எழுந்து எனது கையை அம்புக்கூட்டை நோக்கி நீட்டி, அதிலி ருந்து (சகுனச் சொற்கள் எழுதப்பட்ட) அம்புகளை எடுத்தேன். அவற்றின் மூலம் என்னால் அவர்களுக்குப் பாதிப்பை உருவாக்க முடியுமா; அல்லது முடியாதா என்று குறிபார்த்தேன். நான் விரும்பாத (வகையில், என்னால் அவர்களுக்குப் பாதிப்பு ஏற்படுத்த முடியாது என்ப)தே வந்தது. என் அம்புகளுக்கு மாறு செய்துவிட்டு எனது குதிரையில் ஏறினேன். அது பாய்ந்த வண்ணம் சென்றது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (திருக்குர்ஆன்) ஓதியதை நான் கேட்டேன். அவர்கள் திரும்பிப் பார்க்கவில்லை. அபூபக்ர் அவர்கள் அடிக் கடி திரும்பிப் பார்த்துக்கொண்டிருந்தார்கள். (அப்போது) எனது குதிரையின் முன்கால்கள் இரண்டும் முட்டுக் கால்கள்வரையிலும் பூமியில் புதைந்துகொண்டன. நான் குதிரையிலிருந்து கீழே விழுந்துவிட்டேன். பிறகு (அதை எழச்செய்வதற்காக) அதை நான் அரற்றினேன். அது எழுந்(திருக்க முயற்சித்)தது. (ஆனால்,) அதன் கால்களை அதனால் வெளியே எடுக்க முடியவில்லை. அது நேராக எழுந்து நின்றபோது இரு முன்னங்கால்களின் அடிச் சுவட்டிலிருந்து புகை போல வானத்தில் பரவலாகப் புழுதி கிளம்பிற்று. உடனே நான் (எனது) அம்புகளைக் கொண்டு (சகுனக்) குறிபார்த்தேன். நான் விரும்பாததே வந்தது. உடனே நான் எனக்கு (உயிர்) பாதுகாப்பு நல்கும்படி அவர்களை அழைத்தேன். உடனே அவர்கள் நின்றுவிட்டனர். நான் எனது குதிரையிலேறி அவர்களிடம் வந்து சேர்ந்தேன். அவர்களைவிட்டு (எனது குதிரை) தடுக்கப்பட்ட அந்த நிகழ்ச்சியை நான் கண்டபோது எனது மனதிற்குள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் (மார்க்க) விஷயம் மேலோங்கும் என்று தோன்றியது. நான் அல்லாஹ்வின் தூதரிடம், “உங்களுடைய (குறைஷி) சமுதாயத்தார் உங்களுக்காகப் பரிசை நிர்ணயித்துள்ள னர்” என்று கூறிவிட்டு அந்த (குறைஷி) மக்கள் முஸ்லிம்களைப் பற்றி என்ன எண்ணுகிறார்கள் என்ற தகவல்களை அவர்களிடம் எடுத்துச் சொன்னேன். மேலும், எனது பயண உணவுப் பொருள் களை எடுத்துக்காட்டினேன். அவர்கள் என்னிடமிருந்து ஒன்றையும் (எடுத்து) எனக்கு குறைவு செய்யவுமில்லை; (என்னிடமிருந்த எதையும்) அவர்கள் இருவரும் என்னிடம் கேட்கவுமில்லை. ஆயினும், நபி (ஸல்) அவர்கள் (என்னிடம்), “எங்களைப் பற்றி(ய செய்தியை) மறைத்துவிடு” என்று கூறினார்கள். உடனே, நான் நபி (ஸல்) அவர்களிடம் எனக்கு ஒரு பாதுகாப்புப் பத்திரம் எழுதித் தரும்படி வேண்டினேன். அப்போது, நபி (ஸல்) அவர்கள் ஆமிர் பின் ஃபுஹைராவுக்கு உத்தரவிட அவர் பாடமிடப்பட்ட தோல் துண்டில் (பாதுகாப்புப் பத்திரத்தின் வாசகத்தை) எழுதினார். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (சகாக்களுடன் மதீனா நோக்கிச்) சென்றார்கள்.157 உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: ஷாம் நாட்டிலிருந்து (வியாபாரத்தை முடித்துக்கொண்டு) திரும்பிக்கொண்டிருந்த முஸ்லிம்களின் வணிகக் குழுவிலிருந்த ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சந்தித்தார்கள். அப்போது ஸுபைர் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும், அபூபக்ர் (ரலி) அவர்களுக்கும் வெண்ணிற ஆடைகளைப் போர்த்தினார்கள். மதீனா விலிருந்த முஸ்லிம்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவிலிருந்து புறப்பட்டுவிட்டதைக் கேள்விப்பட்டு, ஒவ்வொரு நாள் காலையிலும் (மதீனா வின் புறநகர்ப் பகுதியிலிருந்த கருங்கற்கள் நிறைந்த) “அல்ஹர்ரா' எனுமிடத்திற்கு வந்து நண்பகலின் வெப்பம் அவர்களைத் திருப்பியனுப்பும்வரையில் நபி (ஸல்) அவர்களை எதிர்பார்த்துக்கொண்டிருந் தனர். அப்படி ஒருநாள் நீண்ட நேரம் நபி (ஸல்) அவர்களை எதிர்பார்த்துவிட்டு (ஊருக்குள்) அவர்கள் திரும்பித் தத்தமது வீட்டுக்குள் ஒதுங்கியபோது யூதர்களில் ஒருவர் அவர்களது கோட்டைகளில் ஒன்றின் மீது எதையோ பார்ப்பதற்காக ஏறியிருந்தார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களின் தோழர்களும் வெண்ணிற ஆடையில், கானல் நீர் விலக வருவதைப் பார்த்தார். அந்த யூதரால் (தம்மைக்) கட்டுப்படுத்த இயலாமல் உரத்த குரலில், “அரபுக் குழாமே! இதோ நீங்கள் எதிர்பார்த்துக் காத்திருந்த உங்களுடைய நாயகர்” என்று கூவினார். உடனே, முஸ்லிம்கள் (நபி (ஸல்) அவர்களைப் பாதுகாப்புடன் வரவேற்பதற்காக). ஆயுதங்களை நோக்கிக் கிளர்ந்தெழுந்தனர். அந்த (கருங்கற்கள் நிறைந்த) அல்ஹர்ராவின் பரப்பில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைச் சந்தித்தார்கள். அவர்களுடன் நபி (ஸல்) அவர்கள் வலப் பக்கமாகத் திரும்பி (“குபா'வில் உள்ள) பனூஅம்ர் பின் அவ்ஃப் குலத்தாரி(ன் குடியிருப்புப் பகுதியி)ல் தங்கினார்கள். இது ரபீஉல் அவ்வல் மாதம் திங்கள்கிழமை நடந்தது. அப்போது மக்களை நோக்கி அபூபக்ர் (ரலி) அவர்கள் எழுந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மௌனமாக அமர்ந்திருந்தார்கள். அப்போது அங்கு வந்திருந்த -நபி (ஸல்) அவர்களைப் பார்த்திராத- அன்சாரிகளில் சிலர் (அபூபக்ர் (ரலி) அவர்களை அல்லாஹ்வின் தூதர் என்று எண்ணிக் கொண்டு) அபூபக்ர் (ரலி) அவர்களுக்கு முகமன் கூறிக்கொண்டிருந்தனர். இறுதியில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்மீது வெயில் பட்டபோது உடனே அபூபக்ர் (ரலி) அவர்கள் சென்று தமது துண்டால் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்மீது நிழலிட்டார்கள். அப்போதுதான் மக்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அறிந்து கொண்டனர். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பனூ அம்ர் பின் அவ்ஃப் குலத்தாரிடையே (குபாவில்) பத்துக்கும் மேற்பட்ட நாட்கள் தங்கியிருந்து “இறையச் சத்தின்மீது அடித்தளமிடப்பட்ட (மஸ்ஜித் குபா) பள்ளிவாசலை' நிறுவினார்கள். (தாம் தங்கியிருந்த நாட்களில்) அந்தப் பள்ளி வாசலில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதார்கள். பிறகு தமது வாகனத்தில் ஏறிப் பயணமானார்கள். அவர்களுடன் மக்களும் நடந்து சென்றனர். முடிவாக (அவர்களது) ஒட்டகம் மதீனாவில் (தற்போது) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது பள்ளிவாசல் (அமைந்துள்ள இடம்) அருகே மண்டியிட்டு படுத்துக்கொண்டது. அந்த நாளில் முஸ்லிம்களில் சிலர் அங்குதான் தொழுதுகொண்டிருந்தனர். அது சஅத் பின் ஸுராரா (ரலி) அவர்களின் பொறுப்பிலிருந்த சஹ்ல், சுஹைல் என்ற இரு அநாதைச் சிறுவர்களுக்குச் சொந்தமான பேரீச்சம் பழம் (உலரவைக்கப்படும்) களமாக இருந்தது. அந்த இடத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வாகனம் மண்டியிட்டுப் படுத்தபோது அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள், “இன்ஷா அல்லாஹ் இதுதான் (நமது) தங்குமிடம்” என்று கூறினார்கள். பிறகு அந்த இரு சிறுவர்களையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைத்து அந்தக் களத்தை பள்ளிவாசல் அமைப்பதற்காக விலைக்குக் கேட்டார்கள். அவர்கள் இருவரும், “இல்லை; அதை உங்களுக்கு அன்பளிப்பாகத் தருகிறோம் அல்லாஹ் வின் தூதரே!” என்று கூறினர். அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் சிறுவர்களிட மிருந்து அதை அன்பளிப்பாகப் பெற மறுத்து இறுதியில் அதை அவர்களிட மிருந்து விலைக்கே வாங்கினார்கள். பிறகு அதில் ஒரு பள்ளிவாசலைக் கட்டினார்கள். அதைக் கட்டும்போது அவர்களுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் செங்கல் சுமக்கலானார்கள். (அப்போது,) “இந்தச் சுமை கைபரின் சுமையல்ல. இது எங்களது இறைவனிடம் (சேமித்துவைக்கப்படும்) நீடித்த நன்மையும் (கைபரின் சுமையை விடப்) பரிசுத்தமானதுமாகும்” என்று (“ரஜ்ஸ்' எனும் ஈரசைச் சீரில் அமைந்த பாடலைப் பாடியபடி) கூறிக்கொண்டிருந்தார்கள். மேலும், “இறைவா (உண்மையான) பலன் மறுமையின் பலனே. ஆகவே (மறுமைப் பலனுக்காக பாடுபடும்) அன்சாரிகளுக்கும் முஹாஜிர்களுக்கும் கருணை காட்டுவாயாக” என்று கூறினார்கள். அப்போது முஸ்லிம்களில் ஒருவரின் கவிதையை நபியவர்கள் பாடிக்காட்டி னார்கள். அவரது பெயர் என்னிடம் கூறப்படவில்லை (என்று அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் (ரஹ்) அவர்கள் கூறிவிட்டு தொடர்ந்து) இப்னு ஷிஹாப் (ரஹ்) அவர்கள் சொன்னார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்தப் பாடல் (வரி)களைத் தவிர ஒரு முழுமையான கவிதையின் பாடலைப் பாடியதாக எனக்கு ஹதீஸ்களில் (செய்தி) எட்டவில்லை. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		}
	]
}