{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தமக்குப் பின்னால் அபூபக்ர் (ரலி) அவர்கள் வர (மக்காவிலிருந்து) மதீனா நோக்கி (ஹிஜ்ரத்) சென்றார்கள். அபூபக்ர் (ரலி) அவர்கள் (இளநரையின் காரணத்தால் தோற்றத்தில்) மூத்தவராகவும், (மதீனாவாசி களிடையே வியாபார நிமித்தமாக அடிக்கடி சென்றதில் அவர்களிடையே) அறிமுகமானவராகவும் இருந்தார்கள். ஆனால், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (நரை விழாத காரணத்தால் உருவத்தில்) இளையவராகவும் (வெளியூர் சென்று நீண்ட காலமாகிவிட்டதால் அந்த மக்களிடையே) அறிமுகமற்றவராகவும் இருந்தார்கள். (அவர்கள் இருவரும் ஹிஜ்ரத் சென்ற அந்தப் பயணத்தின்போது) அபூபக்ர் (ரலி) அவர்களை ஒரு மனிதர் சந்தித்து, “அபூபக்ரே! உமக்கு முன்னால் உள்ள இந்த மனிதர் யார்?” என்று கேட்கிறார். அதற்கு, அபூபக்ர் (ரலி) அவர்கள், “இந்த மனிதர் எனக்கு வழிகாட்டுபவர்” என்று (நபி (ஸல்) அவர்களை எதிரிக்குக் காட்டிக் கொடுத்துவிடாமலும், அதே சமயம் உண்மைக்குப் புறம்பில்லாமலும் இரு பொருள்படும்படி) பதிலளிக்கிறார்கள். இதற்கு, “(பயணத்தில்) பாதை (காட்டுபவர்)' என்றே அபூபக்ர் பொருள் கொள்கிறார் என எண்ணுபவர் எண்ணிக்கொள்வார். ஆனால், “நன்மார்க்கத்திற்கு (வழி காட்டுபவர்)' என்ற பொருளையே அபூபக்ர் கொண்டிருந்தார்கள். அப்போது, அபூபக்ர் (ரலி) அவர்கள் திரும்பிப் பார்த்தார்கள். அங்கு (அவர்களுக்குப் பின்னால்) ஒரு குதிரை வீரர் (சுராக்கா) அவர்களைப் பின்தொடர்ந்து வந்துகொண்டிருந்தார். உடனே அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! (இதோ!) இந்தக் குதிரை வீரர் நம்மை (நெருங்கி) வந்தடைந்துவிட்டார்” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திரும்பிப் பார்த்து விட்டு, “இறைவா! அவரைக் கீழே விழச் செய்!” என்று பிரார்த்தித்தார்கள். உடனே குதிரை அவரைக் கீழே தள்ளிவிட்டது; பிறகு கனைத்துக்கொண்டே எழுந்து நின்றது. (உடனே சுராக்கா மனம் திருந்தி), “அல்லாஹ்வின் தூதரே! நீங்கள் விரும்பியதை எனக்கு உத்தரவிடுங்கள்” என்று கூறினார். அதற்கு நபி (ஸல்) அவர்கள், “இங்கேயே நின்றுகொள். எங்களைப் பின்தொடர்ந்து வரும் எவரையும் விட்டுவிடாதே” என்று கூறினார்கள். இந்த சுராக்கா முற்பகலில் அல்லாஹ்வின் நபிக்கெதிராகப் போரிடுபவராக இருந்தார்; பிற்பகலில் நபியைக் காக்கும் ஆயுதமாக மாறினார். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (கருங்கற்கள் நிறைந்த) “அல்ஹர்ரா' பகுதியில் இறங்கி(த் தங்கி)னார்கள். (அங்கே குபாவில் ஒரு பள்ளிவாசலையும் கட்டச் செய்தார்கள்.) பிறகு, (குபாவிலிருந்துகொண்டு மதீனாவாசிகளான) அன்சாரிகளிடம் ஆளனுப்பினார்கள். உடனே அன்சாரிகள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமும் அபூபக்ர் (ரலி) அவர்களிடமும் வந்து, அவர்கள் இருவருக்கும் சலாம் சொன்னார்கள். பிறகு, “(இப்போது) நீங்கள் இருவரும் அச்சமற்றவர்களாவும் (ஆணையிடும்) அதிகாரம் படைத்தவர்களாவும் பயணம் செய்யலாம்” என்று கூறினர். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் (மதீனா நோக்கிப்) பயணமாயினர். அன்சாரிகள் (அவர்களுக்குப் பாதுகாப்பாக) ஆயுதங் களுடன் (அவர்களைச்) சூழ்ந்தபடி சென்றனர். அப்போது மதீனாவில், “அல்லாஹ்வின் தூதர் (ஸல்) வந்துவிட்டார் கள். அல்லாஹ்வின் தூதர் (ஸல்) வந்துவிட்டார்கள்” என்று சொல்லப்பட்டது. எதிர்பார்த்துக்கொண்டிருந்த மக்கள், “அல்லாஹ்வின் தூதர் வந்துவிட்டார்கள்” என்று கூறலாயினர். நபி (ஸல்) அவர்கள் சிறிது தூரம் பயணித்த பின்னர் (தமது வாகனத்திலிருந்து) அபூஅய்யூப் (அல்அன்சாரீ -ரலி) அவர்களின் வீட்டிற்குப் பக்கத்தில் இறங்கினார்கள். (அங்கே) நபியவர்கள் தம் குடும்பத்தாரிடம் உரையாற்றிக்கொண்டிருந்தார்கள். அப்போது தமது குடும்பத்தாருக்குச் சொந்தமான பேரீச்சந்தோட்டத்தில் கனிகளைப் பறித்துக் கொண்டிருந்த (யூத அறிஞர்) அப்துல்லாஹ் பின் சலாம் அவர்கள் இதைக் கேட்டுவிட்டு, குடும்பத்தாருக்காகப் பறித்தவற்றை அவர்களுக்கென எடுத்துவைக்கத் தவறி, அவற்றைத் தம்முடன் கொண்டுவந்துவிட்டார். அங்கே அல்லாஹ்வின் தூதர் (ஸல்) அவர்(கள் மக்களுக்குச் சொல்லிக் கொண்டிருந்த அறிவுரைகளை160 அவர்)களிடமிருந்து கேட்டுவிட்டுத் தம் வீட்டாரிடம் திரும்பிச் சென்றார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “எங்கள் குடும்பத்தாரின் வீடுகளில் அருகிலிருப்பது எது?”161 என்று கேட் டார்கள். அதற்கு அபூஅய்யூப் அவர்கள், “அல்லாஹ்வின் தூதரே! இது என் வீடு. இதுதான் என் (வீட்டு) வாசல். (நானே உங்கள் குடும்பத்தாரில் மிக அருகில் உள்ளவன்)” என்று கூறினார்கள். நபி (ஸல்) அவர்கள், “நீங்கள் சென்று மதிய ஓய்வு கொள்வதற்காக (உங்கள் வீட்டை) எமக்குத் தயார் செய்யுங்கள்” என்று கூறினார்கள். அபூஅய்யூப் (ரலி) அவர்கள், “உயர்ந்தவ னான அல்லாஹ்வின் அருள்வளத்துடன் நீங்கள் இருவரும் எழுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அபூஅய்யூப் அல்அன்சாரீ (ரலி) அவர் களின் இல்லத்திற்கு) வந்தபோது (யூத அறிஞர்) அப்துல்லாஹ் பின் சலாம் அவர்கள் வந்து (சில விளக்கங்களைக் கேட்டு உறுதி செய்துகொண்ட பிறகு), “தாங்கள் அல்லாஹ்வின் தூதர் என்றும், தாங்கள் சத்திய (மார்க்க)த்துடன் வந்துள்ளீர்கள் என்றும் நான் சாட்சியம் அளிக்கிறேன். யூதர்கள் என்னைப் பற்றி, நான் அவர்களின் தலைவன் என்றும், அவர்களின் தலைவருடைய மகன் என்றும், அவர்களில் நான் மிகவும் அறிந்தவன் என்றும், அவர்களில் மிகவும் அறிந்தவரின் மகன் என்றும் அறிந்துள்ளனர். நான் முஸ்லிமாகிவிட்டேன் என்பதை அவர்கள் அறியும் முன்பாக அவர்களை அழைத்து என்னைப் பற்றி அவர்களிடம் கேளுங்கள். ஏனெனில், நான் முஸ்óமாகிவிட்டேன் என்பதை அவர்கள் அறிந்தால் என்னிடம் இல்லாத (குற்றங்குறைகள் முதலிய)வற்றை என்னிடமிருப்பதாகக் கூறுவர்” என்று சொன்னார்கள். (யூதர்களை அழைத்து வரும்படி) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆளனுப்பினார்கள். யூதர்கள் நபி (ஸல்) அவர்களை நோக்கி வந்தனர். (உடனே அப்துல்லாஹ் பின் சலாம் அவர்கள் ஓரிடத்தில் மறைந்துகொண்டார்கள்.) அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “யூதப் பெருமக்களே! அல்லாஹ்வை நீங்கள் அஞ்சுங்கள்! (இல்லையேல்,) உங்களுக்குக் கேடுதான். எவனைத் தவிர வேறு இறைவன் இல்லையோ அவன் மீதாணையாக! நான் உண்மையிலேயே அல்லாஹ்வின் தூதர்தான் என்றும், நான் சத்திய(மார்க்க)த்துடன் உங்களிடம் வந்துள்ளேன் என்றும் நீங்கள் அறிவீர்கள். எனவே, நீங்கள் முஸ்லிமாகிவிடுங்கள்” என்று கூறி னார்கள். யூதர்கள் (ஏற்க மறுத்து), “அ(த்தகைய தூதர் ஒரு)வரை நாங்கள் அறியமாட்டோம்” என்று -நபி (ஸல்) அவர்களிடம் கூற, நபியவர்கள் அதையே மூன்று முறை- கூறினார்கள். (பிறகு,) நபி (ஸல்) அவர்கள், “உங்களிடையே அப்துல்லாஹ் பின் சலாம் எத்தகைய மனிதர்?” என்று கேட்டார்கள். அவர்கள், “அவர் எங்களின் தலைவர்; எங்களுடைய தலைவரின் மகன்; மேலும் எங்களில் மிகப் பெரிய அறிஞர்; மிகப் பெரிய அறிஞரின் மகன்” என்று கூறினர். “அவர் முஸ்லிமாகிவிட்டால் (என்ன செய்வீர்கள்?) கூறுங்கள்” என்றார்கள். அவர்கள், “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். நபி (ஸல்) அவர்கள், “அவர் முஸ்லிமாகிவிட்டால் (என்ன செய்வீர்கள்?) கூறுங்கள்” என்று (மீண்டும்) கேட்க, அவர்கள் (முன்பு போலவே), “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். “அவர் முஸ்லிமாகிவிட்டால் கூறுங்கள்” என்று (மீண்டும்) நபி (ஸல்) அவர்கள் கேட்க, அவர்கள், “அல்லாஹ் காப்பாற்றட்டும்! அவர் முஸ்லிமாகமாட்டார்” என்று கூறினர். நபி (ஸல்) அவர்கள், “இப்னு சலாமே! இவர்களிடம் வாருங்கள்” என்று சொன்னார்கள். உடனே, அப்துல்லாஹ் பின் சலாம் அவர்கள் வெளியே வந்து, “யூதப் பெருமக்களே! அல்லாஹ்வை அஞ்சுங்கள்! எவனைத் தவிர வேறு இறைவன் இல்லையோ அவன்மீதாணையாக! இவர்கள் அல்லாஹ்வின் தூதர்தான் என்பதையும் இவர்கள் சத்திய (மார்க்க)த் துடன் வந்துள்ளார்கள் என்பதையும் நீங்கள் நன்கறிவீர்கள்” என்று கூறி னார்கள். உடனே யூதர்கள், “நீ பொய் சொன் னாய்” என்று கூறினார்கள். உடனே யூதர் களை நபி (ஸல்) அவர்கள் (தம்மிடத்திலிருந்து) வெளியேறச் செய்தார்கள். அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		}
	]
}