{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "காரிஜா பின் ஸைத் பின் ஸாபித் (ரஹ்) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களிடம் உறுதிமொழி அளித்திருந்த அன்சாரி பெண்களில் ஒருவரான (என் தாயார்) உம்முல் அலா (ரலி) அவர்கள் என்னிடம் தெரிவித்தார் கள்: (மதீனாவுக்கு ஹிஜ்ரத் செய்துவந்த) முஹாஜிர்களின் தங்குமிடத்தி(னை முடிவு செய்வத)ற்காக அன்சாரிகள் சீட்டுக் குலுக்கிப் போட்டபோது, உஸ்மான் பின் மழ்ஊன் (ரலி) அவர்களின் பெயர் எங்கள் பங்கில் வந்தது. எங்களிடம் (வந்து தங்கிய) உஸ்மான் (ரலி) நோய்வாய்ப்பட்டார். ஆகவே, அவருக்கு நான் நோய்க் காலப் பணிவிடைகள் செய்துவந்தேன். இறுதியில் அவர் இறந்தும்விட்டார். அவருக்கு அவரது துணிகளால் கஃபனிட்டோம். அப்போது நபி (ஸல்) அவர்கள் எங்களிடம் வந்தார்கள். நான் (இறந்துபோன உஸ்மானை நோக்கி), “அபூசாயிபே! அல்லாஹ்வின் கருணை உங்கள்மீது உண்டாகட்டும்! அல்லாஹ் உங்களைக் கண்ணியப்படுத்திவிட்டான் என்பதற்கு நான் சாட்சியம் பகர்கிறேன்” என்று கூறினேன். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ் அவரைக் கண்ணியப்படுத்தி விட்டான் என்று உமக்கெப்படித் தெரியும்?” என்று கேட்டார்கள். நான், “எனக்குத் தெரியாது. என் தந்தையும் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும், அல்லாஹ்வின் தூதரே! (அல்லாஹ் இவரைக் கண்ணியப்படுத்தாவிட்டால் பின்) யாரைத்தான் (கண்ணியப்படுத்துவான்)?” என்று நான் சொன்னேன். நபி (ஸல்) அவர்கள், “இவருக்கோ மரணம் வந்துவிட்டது; அல்லாஹ்வின் மீதாணையாக! நான் இவருக்கு நன்மையையே எதிர்பார்க்கின்றேன்; அல்லாஹ்வின் மீதாணையாக! நான் அல்லாஹ்வின் தூதராக இருந்தும் என்னிடம் (மறுமையில்) எப்படி நடந்துகொள்ளப்படும் என்பதே அல்லாஹ்வின் மீதாணையாக! எனக்குத் தெரியாது” என்று சொன்னார்கள். (இதைக் கேட்ட) நான், “அல்லாஹ்வின் மீதாணையாக! இவருக்குப் பிறகு எவரையும் நான் தூய்மையானவர் என்று கூறமாட்டேன்” என்று சொன்னேன். நபி (ஸல்) அவர்கள், இப்படிச் சொன்னது எனக்குக் கவலையளித்தது. பிறகு, நான் தூங்கியதும் (கனவில்) உஸ்மான் பின் மழ்ஊன் (ரலி) அவர்களுக்குரிய ஓர் ஆறு (சொர்க்கத்தில்) ஓடிக்கொண்டிருப்ப தாகக் கண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து அதைத் தெரிவித்தேன். நபி (ஸல்) அவர்கள், “அது அவருடைய (நற்)செயல்” என்று சொன்னார்கள்.177 அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 154
			}
		}
	]
}