{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: “விடைபெறும் ஹஜ்'ஜின்போது நபி (ஸல்) அவர்கள், நோயுற்றிருந்த என்னை (நலம்) விசாரிக்க வந்தார்கள். அந்த நோயால் நான் இறப்பின் விளிம்புக்கே சென்றுவிட்டிருந்தேன். (நபி (ஸல்) அவர்களைக் கண்டதும்) நான், “அல்லாஹ் வின் தூதரே! நான் ஒரு செல்வந்தன்; எனக்கு ஒரேயொரு மகளைத் தவிர வேறு (நேரடி வாரிசு) எவரும் இல்லை. இந் நிலையில் நீங்கள் பார்க்கின்ற வேதனை என்னை வந்தடைந்துவிட்டது. ஆகவே, நான் என் செல்வத்தில் மூன்றில் இரண்டு பங்கைத் தர்மம் செய்துவிடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “வேண்டாம்” என்று சொன்னார்கள். நான், “அப்படியென் றால் அதில் பாதியைத் தர்மம் செய்து விடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “மூன்றிலொரு பங்கு (போதும்.) சஅதே! மூன்றிலொரு பங்கே அதிகம்தான். நீங்கள் உங்கள் சந்ததிகளை மக்களிடம் கையேந்தும் நிலையில் ஏழைகளாக விட்டுச்செல்வதைவிடத் தன்னிறைவுடையவர் களாக விட்டுச்செல்வதே சிறந்ததாகும். நீங்கள் அல்லாஹ்வின் அன்பை நாடிச் செலவழிக்கின்ற எதுவாயினும் அதற்குரிய பிரதிபலனை அல்லாஹ் உங்களுக்கு அளித்தே தீருவான்; உங்கள் மனைவியின் வாயில் நீங்கள் ஊட்டும் ஒரு கவளம் உணவாயினும் சரியே” என்று சொன்னார்கள். நான், “அல்லாஹ்வின் தூதரே! என் தோழர்கள் (எல்லாரும் மதீனாவுக்குச்) சென்றுவிட்ட பிறகு நான் (மட்டும், இங்கே மக்காவில்) பின்தங்கிவிடுவேனா?” என்று கேட்டேன். அதற்கு அவர்கள்,” நீங்கள் (இங்கு) பின்தங்கியிருந்து அல்லாஹ்வின் அன்பை நாடி நீங்கள் புரியும் நற்செயல் எதுவாயினும் அதனால் உங்களுக்குத் தகுதியும் உயர்வும் அதிகமாகவே செய்யும். சில சமுதாயத்தார் உங்களால் பலனடைவ தற்காகவும் வேறுசிலர் இழப்புக்குள்ளாவ தற்காகவும் (உங்கள் ஆயுள் நீட்டிக்கப்பட்டு இங்கேயே) நீங்கள் பின்தங்கிவிடக்கூடும்” என்று சொல்லிவிட்டு, “இறைவா! என் தோழர்கள் தங்கள் ஹிஜ்ரத்தை முழுமை யாக நிறைவேற்றும்படி செய்வாயாக! அவர்களைத் தம் கால்சுவடுகளின் வழியே (பழைய அறியாமைக் கால நிலைக்குத்) திருப்பியனுப்பிவிடாதே” என்று பிரார்த்தித் தார்கள். மேலும், “ஆயினும் சஅத் பின் கவ்லாதான் பாவம்” என்று சொன்னார்கள். சஅத் பின் கவ்லா (ரலி) அவர்கள் மக்காவிலேயே இறந்துவிட்டதற்காக அனுதாபம் தெரிவிக்கும் விதத்தில்தான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இப்படிக் கூறினார்கள்.184 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இரு அறிவிப்புகளில், (உங்கள் வாரிசுகளை என்பதற்குப் பதிலாக) “உங்கள் வாரிசுகளை ஏழைகளாக நீங்கள் விட்டுச்செல்வது” என்று (நபி (ஸல்) அவர்கள் கூறியதாக) காணப்படுகிறது. அத்தியாயம் : 63",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 161
			}
		}
	]
}