{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "அலீ (பின் அபீதாலிப் - ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குதிரை வீரர்களான என்னையும், அபூமர்ஸத் (கன்னாஸ் பின் ஹுஸைன்- ரலி) அவர்களையும், ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களையும், “நீங்கள் “ரவ்ளத்து காக்' எனுமிடம்வரை செல்லுங்கள்; ஏனெனில், அங்கு (ஒட்டகச் சிவிகையில்) இணைவைப்பாளர்களில் ஒருத்தி இருக்கிறாள். இணைவைப்பாளர்(களின் தலைவர்)களுக்கு ஹாதிப் பின் அபீபல்(த்)தஆ அனுப்பியுள்ள (நமது ரகசியத் திட்டங்களைத் தெரிவிக்கும்) கடிதம் ஒன்று அவளிடம் இருக்கும்; (அவளிடமிருந்து கடிதத்தைக் கைப்பற்றி வாருங்கள்)” என்று கூறினார்கள். (பிறகு நாங்கள் புறப்பட்டுப் போனோம்.) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குறிப்பிட்ட இடத்தில் அந்தப் பெண் தனது ஒட்டகத்தில் சென்று கொண்டிருக்க, அவளை நாங்கள் அடைந் தோம். அவளிடம், “கடிதம் (எங்கே? அதை எடு)” என்று கேட்டோம். அவள், “எம்மிடம் கடிதம் எதுவுமில்லை” என்று பதிலளித்தாள். (அவள் அமர்ந்திருந்த) ஒட்டகத்தை நாங்கள் படுக்கவைத்து (அந்தக் கடிதத்தைத்) தேடினோம். எந்தக் கடிதத்தையும் நாங்கள் காணவில்லை. அப்போது, “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பொய் சொல்லமாட்டார்கள். ஒன்று, நீயாகக் கடிதத்தை எடு(த்துக் கொடு); அல்லது உன்னை(ச் சோதிப்பதற்காக) நாங்கள் கழற்ற வேண்டியிருக்கும்” என்று சொன்னோம். விடாப்பிடியாக (நாங்கள்) இருப்பதை அவள் கண்டபோது, (கூந்தல் நீண்டு தொங்கும்) தனது இடுப்புப் பகுதிக்கு அவள் கையைக் கொண்டுசென்றாள். அவள் ஒரு துணியை இடுப்பில் கட்டியிருந்தாள். (அங்கிருந்து) அ(ந்தக் கடிதத்)தை வெளியில் எடுத்தாள். அந்தக் கடிதத்துடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நோக்கி நடந்தோம். அப்போது உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! அவர் (ஹாதிப் பின் அபீபல்(த்)தஆ) அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும், இறை நம்பிக்கையாளர்களுக்கும் துரோகமிழைத்துவிட்டார். என்னை விடுங்கள்; அவரது கழுத்தைக் கொய்துவிடுகிறேன்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் (ஹாதிப் அவர்களை நோக்கி), “ஏன் இப்படிச் செய்தீர்கள்?” என்று கேட்டார்கள். “அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் விசுவாசமில்லாதவனாக நடந்துகொள்ள வேண்டுமென்பது என் நோக்கமல்ல. இணைவைப்பாளர்(களுக்கு நான் செய்யும் இந்த உதவியால் அவர்)களிடம் எனக்கு ஒரு செல்வாக்குக் கிடைத்து, அதன் மூலம் அல்லாஹ் (மக்காவிóருக்கும்) என் மனைவி மக்களையும், என் செல்வத்தையும் பாதுகாக்க வேண்டும் என்றே நான் நினைத்தேன். தங்கள் தோழர்கள் அனைவருக்குமே மக்காவில் அவர்களுடைய மனைவி மக்களையும், அவர்களது செல்வத்தையும் எவர் மூலமாக அல்லாஹ் பாதுகாப்பானோ அத்தகைய உறவினர்கள் இருக்கின்றனர்” என்று கூறினார். (இதைக் கேட்ட) நபி (ஸல்) அவர்கள், “இவர் உண்மை சொன்னார். இவரைப் பற்றி நல்லதையே சொல்லுங்கள்” என்று (தோழர்களைப் பார்த்துக்) கூறினார்கள். அப்போது உமர் (ரலி) அவர்கள், “இவர் அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும், இறைநம்பிக்கையாளர்களுக்கும் துரோகமிழைத்துவிட்டார். என்னை விடுங்கள்; இவரது கழுத்தைக் கொய்துவிடுகிறேன்” என்று (மீண்டும்) கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள், “இவர் பத்ர் போரில் கலந்துகொண்டவர் அல்லவா? பத்ரில் கலந்துகொண்டவர்களை நோக்கி அல்லாஹ், “நீங்கள் விரும்பியதைச் செய்யுங்கள். உங்களுக்குச் சொர்க்கம் உறுதியாகிவிட்டது' அல்லது “உங்கள் பாவங்களை நான் மன்னித்துவிட்டேன்' என்று கூறிவிட்டிருக்கலாம் அல்லவா?” என்று சொன்னார்கள்.25 இதைக் கேட்ட உமர் (ரலி) அவர்கள் தம் கண்கள் கண்ணீர் உகுத்துக் கொண்டிருக்க, “அல்லாஹ்வும் அவனு டைய தூதருமே நன்கறிந்தவர்கள்” என்று கூறினார்கள்.26 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 34
			}
		}
	]
}