{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3989,
			"arabicnumber": 3989,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பத்துப் பேரை உளவுப்படையாக (ஓரிடத்திற்கு) அனுப்பிவைத்தார்கள். இப்படைக்கு உமர் பின் அல்கத்தாப் (ரலி) அவர்களுடைய மகன் ஆஸிமின் (தாய் வழிப்)பாட்டனார் ஆஸிம் பின் ஸாபித் அல்அன்சாரீ (ரலி) அவர்களைத் தலைவராக்கினார்கள். அவர்கள் (மதீனாவிலிருந்து புறப்பட்டு வந்து) மக்காவிற்கும் உஸ்ஃபானுக்கும் இடையிலுள்ள “அல்ஹத்தா' என்ற இடத்தில் இருந்தபோது “ஹுதைல்' குலத்தைச் சேர்ந்த “பனூ லிஹ்யான்' எனும் கிளைக் குலத்தாருக்கு அவர்களைப் பற்றித் தெரிவிக்கப்பட்டது. உடனே அக்கிளையினர் (அவர் களைப் பிடிப்பதற்காக) அம்பெய்யும் வீரர்கள் சுமார் நூறு பேருடன் திரண்டு, உளவுப்படையினரின் பாதச்சுவடுகளைப் பின்தொடர்ந்து வந்தனர். அவர்கள் இறங்கித் தங்கி, சாப்பிட்டுவிட்டுச் சென்றிருந்த இடத்தில் பேரீச்சம் பழங்களைக் கண்டனர். “(இது) யஸ்ரிப் (மதீனா) நகரின் பேரீச்சம் பழம்” என்று (தங்களுக்குள்) பேசிக்கொண்டனர். எனவே, அவர்களின் பாதச்சுவடுகளைப் பின்தொடர்ந்தனர். இவர்களின் வருகை ஆஸிம் (ரலி) அவர்களுக்கும், அவர்களுடைய தோழர்களுக்கும் தெரிந்தபோது அவர்கள் (மலைப் பாங்கான) உயரமான ஓரிடத்தில் தஞ்சம் புகுந்தனர். அப்போது (துரத்தி வந்த) அந்தக் கூட்டத்தார் அவர்களைச் சுற்றி வளைத்துக்கொண்டு அவர்களைப் பார்த்து, “இறங்கி வந்து சரணடைந்துவிடுங்கள். உங்களில் யாரையும் கொல்லமாட்டோம் என்று உங்களுக்கு உறுதிமொழியும் வாக்குறுதியும் தருகிறோம்” என்று கூறினர். அப்போது ஆஸிம் பின் ஸாபித் அவர்கள் (தம் சகாக்களை நோக்கி), “(என்) சமூகத்தாரே! நான் ஓர் இறைமறுப்பாளனின் (வாக்குறுதியை நம்பி அவனது) பொறுப்பில் இறங்கிச் செல்லமாட்டேன்” (என்று கூறிவிட்டு,) “இறைவா! எங்களைப் பற்றிய செய்தியை உன் தூதருக்குத் தெரிவித்துவிடு” என்று சொன்னார்கள். அந்த இறை மறுப்பாளர்கள், உளவுப்படையினரின் மீது அம்பெய்து, ஆஸிமை(யும், மற்றும் அறுவரையும்) கொன்றுவிட்டனர். பிறகு குபைப், ஸைத் பின் அத்தஸினா மற்றும் இன்னொரு மனிதர் (ஆகிய மூவரும்) அவர்களுடைய உறுதிமொழி மற்றும் வாக்குறுதியின் பேரில் இறங்கி வந்தனர். அவர்கள் (மூவரும்) தம் கையில் கிடைத்தவுடன் இறைமறுப்பாளர்கள் தம் விற்களின் நாண்களை அவிழ்த்து அதன் மூலம் அவர்களைப் பிணைத்தனர். (இதைக் கண்ட) அந்த மூன்றாம் மனிதர், “இது முதல் துரோகம். அல்லாஹ்வின் மீதாணையாக! நான் உங்களுடன் வரமாட்டேன். இவர்களிடம் எனக்கு நல்ல அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 40
			}
		}
	]
}