{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அபூராஃபிஉவிடம் அப்துல்லாஹ் பின் அத்தீக் (ரலி) அவர்களையும், அப்துல்லாஹ் பின் உத்பா (ரலி) அவர்களையும் அவர்களுடன் இன்னும் சிலரையும் அனுப்பிவைத்தார்கள். அவர்கள் சென்று கோட்டையை நெருங்கியபோது அவர்களை நோக்கி (தலைவர்) அப்துல்லாஹ் பின் அத்தீக் (ரலி) அவர்கள், “நான் சென்று பார்த்து வரும்வரையில் நீங்கள் (இங்கேயே) இருங்கள்” என்று கூறினார்கள். தொடர்ந்து பின்வருமாறு கூறினார்கள்: அப்போது (கோட்டைவாசிகளுக்குத் தெரியாமல்) கோட்டைக்குள் நுழைவதற்காக நான் உபாயம் செய்தேன். அப்போது யூதர்களுடைய கழுதையொன்று காணாமற் போய்விட்டது. அதைத் தேடிய வண்ணம் தீப்பந்தத்துடன் அவர்கள் (கோட்டையிலிருந்து) வெளியேறினர். நான் அடையாளம் கண்டுகொள்ளப்பட்டுவிடுவேனோ என்று அஞ்சினேன். நான் இயற்கைக் கடனை நிறைவேற்றுவது போல (எனது ஆடையால்) என் தலையையும் காலையும் மூடிக்கொண்டேன். பிறகு காவலன், “யார் (கோட்டைக்குள்) நுழைய விரும்புகிறார்களோ அவர்கள் நான் கதவை மூடுவதற்குமுன் நுழைந்து கொள்ளட்டும்” என்று கூறினான். உடனே நான் நுழைந்து கோட்டைவாசலுக்கு அருகிலிருந்த கழுதைத் தொழுவம் ஒன்றில் பதுங்கிக்கொண்டேன். அப்போது (யூத) மக்கள் அபூராஃபிஉவிடம் இரவுச் சாப்பாட்டை உண்டனர். பிறகு இரவின் ஒரு பகுதி முடியும் வரையில் (கதை) பேசிக்கொண்டிருந்தனர். பிறகு மக்கள் தத்தமது வீடுகளுக்குத் திரும்பினர். பின்னர் ஆரவாரங்கள் அடங்கி, எந்த அரவமும் கேட்காமலிருந்தபோது நான் (பதுங்கியிருந்த இடத்திலிருந்து) வெளியேறினேன். (கோட்டையின்) காவலன் மாடத்தில் கோட்டையின் சாவியை வைத்ததை நான் (பதுங்கிக்கொண்டிருந்தபோது) பார்த்திருந்தேன். அதை நான் எடுத்துக் கோட்டைக் கதவைத் திறந்தேன். நான் (என் மனத்திற்குள்) “மக்கள் என்னை இனம் கண்டுகொண்டால் நிதானமாக(த் தப்பி)ச் சென்றுவிட வேண்டும்' என்று சொல்லிக் கொண்டேன். பிறகு, அந்த மக்கள் தங்கியிருந்த அறைகளின் கதவுகளை வெளியிலிருந்து பூட்டினேன். பிறகு அபூராஃபிஉ (தங்கியிருந்த மாடியறை) நோக்கி ஏணி வழியாக ஏறினேன். அப்போது அவனது அறை இருள் சூழ்ந்திருந்தது. அதன் விளக்கு அணைக்கப்பட்டிருந்தது. அந்த மனிதன் எங்கே (இருக்கிறான்) என்று என்னால் அறிய முடியவில்லை. உடனே நான், “அபூராஃபிஉவே!” என்று அழைத்தேன். அவன், “யார் அது?' என்று கேட்டான். உடனே நான் சப்தம் வந்த திசையைக் குறிவைத்து அவனை வெட்டினேன். அவன் கூச்சலிட்டான். அது (நான் நினைத்த) பலனைத் தரவில்லை. பிறகு அவனுக்கு நான் உதவி செய்வது போல, “அபூராஃபிஉவே! உனக்கு என்ன நேர்ந்தது?” என்று என் குரலை மாற்றிக்கொண்டு கேட்டேன். உடனே அவன், “உனக்கு நான் ஆச்சரியமாகத் தெரிகிறேனா? உன் தாய்க்குக் கேடு உண் டாகட்டும். என்னிடம் ஒருவன் வந்து வாளால் என்னை வெட்டினான்” என்று கூறினான். மீண்டும் (குரல் வந்த திசையைக்) குறிவைத்து அவனை நான் வெட்டினேன்.(நான் நினைத்தபடி) அப்போதும் எந்தப் பலனும் கிடைக்கவில்லை. மீண்டும் அவன் கூச்சலிட்டான். அவனுடைய வீட்டார் எழுந்துவிட்டனர். பிறகு அவனுக்கு உதவி செய்பவனைப் போன்று (பாசாங்கு செய்தபடி) குரலை மாற்றிக்கொண்டு (அவனுக்கு அருகில்) வந்தேன். அப்போது அவன் மல்லாந்து படுத்திருந்தான். உடனே (எனது) வாளை அவனது வயிற்றில் வைத்துச் செலுத்தினேன். அப்போது (அவனது) எலும்பின் (மீது என் வாள் குத்துகின்ற) சப்தத்தை நான் கேட்டேன். பிறகு பதறிக்கொண்டே (அவனது அறையிலிருந்து) வெளியேறி ஏணிப்படிக்கு வந்தேன். இறங்க விரும்பினேன். (ஆனால்,) அதிலிருந்து நான் விழுந்துவிட்டேன். எனது கால் முறிந்துவிட்டது. எனவே, நான் அதை (எனது தலைப்பாகைத் துணியால்) கட்டினேன். பிறகு (கோட்டைக்கு வெளியிலிருந்த) என் சகாக்களிடம் நொண்டிக்கொண்டே வந்து அவர்களை நோக்கி, “நீங்கள் (விரைவாகச்) சென்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (காரியம் முடிந்துவிட்ட) நற்செய்தியைச் சொல்லுங்கள். (மரணச் செய்தி அறிவிப்பவனிடமிருந்து அபூராஃபிஉவின் மரணச்) செய்தியை நான் கேட்கும்வரையில் நான் (இங்கிருந்து) நகரமாட்டேன்” என்று கூறினேன். பிறகு அதிகாலை நேரத்தில் மரணச் செய்தி அறிவிப்பவன் (கோட்டைச் சுவர் மீது) ஏறி, “அபூராஃபிஉ இறந்துவிட்டார்” என்று அறிவிப்புச் செய்தான். உடனே நான் எழுந்து நடக்கலானேன். (அளவு கடந்த மகிழ்ச்சியால்) எனக்கு வலிகூடத் தெரியவில்லை. என் சகாக்கள் நபி (ஸல்) அவர்களிடம் சென்று சேர்வதற்கு முன் நான் சகாக்களைச் சென்றடைந்துவிட்டேன். ஆதலால், நானே நபி (ஸல்) அவர்களிடம் (அந்த) நற்செய்தியைச் சொன்னேன்.105 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 87
			}
		}
	]
}