{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "ஜஅஃபர் பின் அம்ர் பின் உமய்யா அள்ளம்ரீ (ரஹ்) அவர்கள் கூறிய தாவது: நான் (ஒரு பயணத்தில்) உபைதுல்லாஹ் பின் அதீ பின் அல்கியார் (ரலி) அவர்களுடன் புறப்பட்டுச் சென்றேன். நாங்கள் ஹிம்ஸு (நகரு)க்கு138 வந்து சேர்ந்தபோது என்னிடம், உபைதுல்லாஹ் பின் அதீ அவர்கள், “(உஹுத் போரின்போது ஹம்ஸா (ரலி) அவர்களைக் கொன்றவரான) வஹ்ஷீ (ரலி) அவர்களைச் சந்திக்க உங்களுக்கு விருப்பமுண்டா? (நாம் அவர்களைச் சந்தித்து) ஹம்ஸா (ரலி) அவர்களைக் கொன்றது பற்றிக் கேட்போமே!” என்று கூறினார்கள். நான், சரி என்றேன். வஹ்ஷீ (ரலி) அவர்கள் ஹிம்ஸில் வசித்துக்கொண்டி ருந்தார். (நாங்கள் அங்கு போய் அங்குள்ளவர்களிடம்) அவரைப் பற்றி விசாரித்தோம். “அவர் தமது அந்தக் கோட்டைக்குள் இருக்கிறார்; அவர் தண்ணீரால் நிரப்பப்பட்ட பெரிய தோல் பை போன்று (பருமனாக) இருப்பார்” என்று எங்களிடம் கூறப்பட்டது. பிறகு நாங்கள் (அவரிடம்) வந்தோம். சிறிது நேரம் அவரருகில் நின்றோம். பிறகு அவருக்கு நாங்கள் சலாம் சொன்னபோது, அவர் (எங்களுக்கு) பதில் சலாம் சொன்னார். உபைதுல்லாஹ் (ரலி) அவர்கள் தமது தலைப்பாகைத் துணியால், தம் இரு கண்களையும் கால்களையும் தவிர வேறெதையும் வஹ்ஷீ (ரலி) அவர்கள் பார்க்க முடியாத அளவுக்குச் சுற்றிக் கட்டியிருந்தார். அப்போது, உபைதுல்லாஹ் (ரலி) அவர்கள், “வஹ்ஷீ அவர்களே! என்னை உங்களுக்கு அடையாளம் தெரிகிறதா?” என்று கேட்டார்கள். அப்போது வஹ்ஷீ (ரலி) அவர்கள், உபைதுல்லாஹ் அவர்களைப் பார்த்தார். பிறகு “அல்லாஹ்வின் மீதாணையாக! இல்லை. (உங்களை எனக்கு அடையாளம் தெரியவில்லை.) ஆயினும், எனக்கு இது தெரியும்: அதீ பின் அல்கியார் ஒரு பெண்ணைத் மணமுடித்தார்.139 அந்தப் பெண், “உம்மு கித்தால் பின்த் அபில்ஈஸ்' என்று அழைக்கப்பட்டார். அதீ அவர்களுக்கு (மனைவி) உம்மு கித்தால் மக்காவில் வைத்து ஒரு ஆண் குழந்தையைப் பிரசவித்தார். அப்போது, அந்தக் குழந்தைக்குப் பாலூட்டும் செவிலித் தாயை நானே தேடினேன். (பாலூட்டுபவளைக் கண்டு பிடித்த பிறகு) நான் அந்தக் குழந்தையைச் சுமந்துகொண்டு, அதன் தாயுடன் சென்று அந்தக் குழந்தையைப் பாலூட்டுபவளிடம் ஒப்படைத்தேன். (அந்தக் குழந்தையின் பாதங்களை அப்போது நான் பார்த்தேன்.) உம்முடைய இரு பாதங்களைப் பார்த்தால் அது போலவே இருக்கிறது” என்று கூறினார். அப்போது உபைதுல்லாஹ் (ரலி) அவர்கள், மூடியிருந்த தமது முகத்தைத் திறந்தார்கள். பிறகு, “ஹம்ஸா (ரலி) அவர்களை நீங்கள் கொன்றது பற்றி எங்களுக்கு அறிவிக்கக் கூடாதா?” என்று கேட்டார்கள். வஹ்ஷீ (ரலி), “சரி (சொல்கிறேன்)” என்று கூறினார். (பிறகு, கொலைச் சம்பவத்தைப் பற்றிப் பின்வருமாறு கூறினார்:) ஹம்ஸா (ரலி) அவர்கள் பத்ர் போரில் (என் எசமான் ஜுபைருடைய தந்தையின் சகோதரரான) துஐமா பின் அதீ பின் அல்கியார் என்பாரைக் கொலை செய்திருந்தார். எனவே, என் எசமான் ஜுபைர் பின் முத்இம் என்னிடம், “என் சிறிய தந்தை(யின் கொலை)க்குப் பதிலாக ஹம்ஸாவை நீ கொன்றால் நீ (அடிமைத் தளையிலிருந்து) விடுதலையாவாய்” என்று கூறினார். ஆகவே, அய்னைன் (உஹுத்) ஆண்டில் -அய்னைன் என்பது உஹுத் மலைக்கருகிலுள்ள ஒரு மலையாகும். இந்த இரு மலைகளுக்குமிடையில் ஒரு பள்ளத்தாக்கு உண்டு - (குறைஷி) மக்கள் (போருக்காகப்) புறப்பட்டுச் சென்றபோது அம்மக்களுடன் போர்(க் களம்) நோக்கி நானும் சென்றேன். மக்கள் போருக்காக அணிவகுத்து நின்றபோது சிபாஉ பின் அப்தில் உஸ்ஸா என்பவன் (அணியை விட்டு) முன்னால் வந்து, “(என்னோடு) தனியே மோதுபவர் உண்டா?” என்று கேட்டான். அவனை நோக்கி ஹம்ஸா பின் அப்தில் முத்தலிப் (ரலி) அவர்கள் கிளம்பி வந்து, பெண்களுக்கு விருத்தசேதனம் செய்யும் உம்மு அன்மாரின் மகனே! சிபாஉவே! நீ அல்லாஹ்வுடனும் அவனுடைய தூதர் (ஸல்) அவர்களுடனும் (பகைத்துக்கொண்டு) மோத வந்திருக்கி றாயா?” என்று கேட்டார்கள். பிறகு ஹம்ஸா (ரலி) அவர்கள் அவன் மீது (பாய்ந்து) கடுமையாகத் தாக்கினார்கள்.அவன் கழிந்து போய்விட்ட நேற்றையதினம் போல் (மடிந்தவனாக) ஆகிவிட்டான். நான் ஹம்ஸா (அவர்களைக் கொல்லத் தருணம் எதிர்பார்த்து) அவர்களுக்காக ஒரு பாறைக்கு அடியில் ஒளிந்துகொண்டேன். ஹம்ஸா அவர்கள் என்னை(க் கவனிக்காமல்) நெருங்கி வந்தபோது, எனது ஈட்டியை அவரது மர்மஸ்தானத்தை நோக்கி எறிந்தேன். அது (பாய்ந்து) அவரது புட்டத்திற்கிடையிலிருந்து வெளியேறியது. அதுதான் ஹம்ஸா அவர்களின் வாழ்நாள் முடிவிற்குக் காரணமாக அமைந்தது. பிறகு குறைஷியர் (உஹுதிலிருந்து மக்காவை நோக்கி) திரும்பிச் சென்றபோது நானும் அவர்களுடன் திரும்பினேன். மக்காவிற்குப் போய் அங்கு (வெற்றி கிடைத்து) இஸ்லாம் பரவும் வரையில் தங்கினேன். (மக்கா வெற்றி கொள்ளப்பட்டபின்) அங்கிருந்து வெளியேறி தாயிஃபிற்கு (ஓடிச்) சென்றுவிட்டேன். தாயிஃப்வாசிகள் (இஸ்லாத்தை அறிந்துகொள்ளவும், அதை ஏற்று நடக்கவும் கருதி) தங்கள் தூதுக் குழுவினரை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுப்பி வைத்தனர்.140 அப்போது, என்னிடம், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம்மிடம் வரும்) தூதுவர்களுக்குத் தொல்லை தரமாட்டார் கள்; (எனவே, தூதுக் குழுவினருடன் சேர்ந்து நீங்களும் செல்லுங்கள்)” என்று கூறப்பட்டது. எனவே, தூதுக் குழுவின ருடன் நானும் புறப்பட்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து சேர்ந்தேன். என்னை அவர்கள் கண்டபோது, “நீர் வஹ்ஷீதானே?” என்று கேட்டார்கள். நான், “ஆம்' என்று கூறினேன். “நீர் தானே ஹம்ஸாவைக் கொன்றீர்?” என்று கேட்டார்கள். நான், “உங்களுக்குக் கிடைத்த தகவலின்படி விஷயம் நடந்தது உண்மைதான்” என்று கூறினேன். அப்போது அவர்கள், “(உம்மைக் காணும்போது என் தந்தையின் சகோதரர் ஹம்ஸாவின் நினைவு வரும், எனவே,) என்னைவிட்டு உன் முகத்தை மறைத்துக்கொள்ள முடியுமா?” என்று கேட்டார்கள். உடனே, நான் (அங்கிருந்து) புறப்பட்டுவிட்டேன். நபி (ஸல்) அவர்கள் இறந்துவிட்டபோது, (தன்னை ஒரு நபி என்று வாதிட்ட வண்ணம்) பெரும் பொய்யன் முசைலிமா கிளம்பினான். (அவன் நபித்தோழர்களுடன் போர் புரிவதற்காகப் பெரும்படை ஒன்றைத் திரட்டலானான். அவனை முறியடிப்பதற்காக அபூபக்ர் அஸ்ஸித்தீக் (ரலி) அவர்களும் படை திரட்டி அதற்கு காலித் பின் அல்வலீத் (ரலி) அவர்களைத் தளபதியாக நியமித்தார்கள்) நான் (என் மனத்திற்குள்), “நிச்சயம் நான் முசைலிமாவை நோக்கிப் புறப்பட்டுச் செல்வேன். அவனை நான் கொல்ல (வாய்ப்புக் கிடைக்க)லாம். அதன் மூலம், (முன்பு) நான் ஹம்ஸா (ரலி) அவர்களைக் கொன்றதற்கு(ப் பிரயாசித்தம் தேடி) ஈடு செய்யலாம்” என்று கூறிக்கொண்டேன். (அபூபக்ர் (ரலி) அவர்கள் அனுப்பிய போர்ப்படையிóருந்த) மக்களுடன் நானும் புறப்பட்டுச் சென்றேன். அப்போதுதான் அவனுடைய விஷயத்தில் நடக்க வேண்டியது நடந்து முடிந்தது.141 அப்(போரின்)போது ஒரு மனிதன் ஒரு சுவரின் இடைவெளியில் நின்று கொண்டிருந்தான். அவன் தலைவிரி கோலத்துடன் (போரின் புழுதி படிந்து) சாம்பல் நிற ஒட்டகம் போன்றிருந்தான். அவன்மீது (ஹம்ஸா அவர்களைக் கொலை செய்த அதே) எனது ஈட்டியை எறிந்தேன். நான் அந்த ஈட்டியை அவனது இரு மார்புகளுக்கு மத்தியில் பாய்ச்சினேன். அது அவனது பின்தோள்களுக்கிடையிóருந்து வெளியேறியது. அவனை நோக்கி அன்சாரிகளில் ஒருவர் ஓடிவந்தார். தமது வாளால் அவனது உச்சந்தலைமீது ஓங்கி வெட்டிவிட்டார். (அவன்தான் முசைóமா.) அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறுகிறார்கள்: (முசைலிமா கொல்லப்பட்டபோது) ஒரு சிறுமி வீட்டின் முகட்டிலிருந்துகொண்டு, “அந்தோ! நம்பிக்கையாளர்களின் தலைவரை ஒரு கறுப்பு அடிமை (வஹ்ஷீ) கொலை செய்துவிட்டான்” என்று (உரக்கச் சப்தமிட்டுச்) சொன்னாள். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 117
			}
		}
	]
}