{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4091,
			"arabicnumber": 4091,
			"text": "அனஸ் (பின் மாலிக் - ரலி) அவர்கள் கூறியதாவது: (என் தாயார்) உம்மு சுலைம் அவர்களின் சகோதரர், என் தாய் மாமா (ஹராம் பின் மில்ஹான் - ரலி) அவர்களை (குர்ஆனை நன்கறிந்தவர்களான எழுபது) பயணிகளில் ஒருவராக நபி (ஸல்) அவர்கள் அனுப்பிவைத்தார்கள். இணைவைப்பாளர்களின் தலைவன் ஆமிர் பின் துஃபைல், பின்வரும் மூன்று விஷயங்களில் ஒன்றைத் தேர்ந் தெடுக்கும்படி (நபி (ஸல்) அவர்களிடம்) கூறினான்: கிராமப்புற மக்கள் உங்களுக்குச் சொந்தம்; (அவர்களுக்கு ஆட்சியாளராக நீங்கள் இருங்கள்;) நகர்ப்புற மக்கள் எனக்குச் சொந்தம். (நான் அவர்களுக்கு ஆட்சியாளராக இருப்பேன்.) அல்லது நான் உங்களுக்கு கலீஃபாவாக (பிரதிநிதியாக) இருப்பேன். அல்லது ஆயிரக்கணக்கான ஃகதஃபான் குலத்தாருடன் (வந்து) உங்களோடு போர் தொடுப்பேன்” என்று கூறினான். பிறகு இன்னாரின் தாய் வீட்டில் “ஆமிர்' கொள்ளை நோயால் பீடிக்கப்பட்டான். அப்போது அவன், “இன்னாரின் குடும்பத்தைச் சேர்ந்த ஒரு பெண்ணின் வீட்டில் இளம் ஒட்டகத்திற்கு ஏற்படும் கொள்ளை நோய் போன்று (எனக்கும்) ஏற்பட்டுவிட்டது. எனவே, எனது குதிரையை என்னிடம் கொண்டுவாருங்கள்” என்று கூறினான். பிறகு அவன் தனது குதிரையின் முதுகின் மீதே இறந்துபோனான்.165 (என் தாய்) உம்மு சுலைம் அவர்களின் சகோதரர் ஹராம் பின் மில்ஹான் (ரலி) அவர்களும், கால் ஊனமுற்றவர் ஒருவரும், இன்னாரின் குடும்பத்தைச் சேர்ந்தவர்களில் ஒருவரும்166 (நபி (ஸல்) அவர்களின் ஆணையின் பேரில் பனூ ஆமிர் குலத்தாரை நோக்கி) நடந்தார்கள். அப்போது ஹராம் அவர்கள் (தம்மிரு சகாக்களை நோக்கி), “நீங்கள் இருவரும் (எனக்கு) அருகிலேயே இருங்கள். நான் பனூ ஆமிர் குலத்தாரிடம் செல்கிறேன். அவர்கள் எனக்குப் பாதுகாப்பளித்தால் நீங்கள் (அப்படியே) இருங்கள். என்னை அவர்கள் கொன்றுவிட்டால் நீங்கள் உங்கள் சகாக்களிடம் சென்று (தெரிவித்து)விடுங்கள்” என்று கூறி னார்கள். (பிறகு, பனூ ஆமிர் குலத்தாரிடம் சென்று, அவர்களை நோக்கி,) “எனக்குப் பாதுகாப்புத் தருவீர்களா? அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தூதுச் செய்தியைத் தெரிவிக்கிறேன்” என்று கேட்டுவிட்டு அவர்களிடம் (அந்தச் செய்தியைப்) பேசலானார்கள். அப்போது அக்குலத்தார் ஒருவனுக்குச் சைகை செய்ய, அவன் ஹராம் (ரலி) அவர்களுக்குப் பின்னால் வந்து அவர்களை (ஈட்டியால்) குத்திவிட்டான். -அறிவிப்பாளர் ஹம்மாம் பின் யஹ்யா (ரஹ்) கூறுகிறார்கள்: “ஈட்டியால் குத்தி (மறுபக்கம்வரை) செலுத்தினான்' என்று கூறியதாக எண்ணுகிறேன்.- உடனே ஹராம் அவர்கள், “அல்லாஹு அக்பர் (அல்லாஹ் மிகப் பெரியவன்). கஅபாவின் அதிபதி மீதாணையாக! நான் வெற்றி பெற்றுவிட்டேன்” என்று கூறினார்கள். பிறகு அன்னாரின் உயிர் பிரிந்தது. கால் ஊனமுற்றவரைத் தவிர மற்ற அனைவரும் கொல்லப்பட்டனர். அந்த நேரத்தில் அந்த ஊனமுற்றவர் மலை உச்சியில் இருந்தார். பிறகு, (இச்சம்பவத்தில் உயிர்நீத்தவர்கள் தொடர்பாக) அல்லாஹ் எங்கள்மீது (ஒரு வசனத்தை) அருளினான். பிறகு அந்த வசனம் (அல்லாஹ்வின் ஆணையின்படி) நீக்கப்பட்டுவிட்டது. “நாங்கள் எங்கள் இறைவனிடம் சென்று சேர்ந்துவிட்டோம். அவன் எங்கள்மீது அன்பு கொண்டான். (அருள் வளங்களை அள்ளித் தந்து) எங்களை அவன் அன்பு கொள்ளச் செய்தான்” (என்பதே அந்த வசனம்). ஆகவே, நபி (ஸல்) அவர்கள், ரிஅல், தக்வான், பனூ லிஹ்யான், அல்லாஹ்வுக்கும் அவனுடைய தூதருக் கும் விரோதமாக நடந்துகொண்ட உஸய்யா ஆகிய குலத்தாருக்கெதிராக முப்பது நாள் அதிகாலை(த் தொழுகை)யில் பிரார்த்தனை புரிந்தார்கள்.167 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 135
			}
		}
	]
}