{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4093,
			"arabicnumber": 4093,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: (மக்கா இறைமறுப்பாளர்கள் கொடுத்த) தொல்லை கடுமையானபோது (மதீனாவுக்கு ஹிஜ்ரத்) புறப்பட அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம் அனுமதி கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், “(சற்று) பொறுங்கள்” என்று கூறினார்கள். அப்போது அவர்கள், “அல்லாஹ்வின் தூதரே! (அல்லாஹ்வின் தரப்பிலிருந்து நீங்கள் ஹிஜ்ரத் செல்ல) தங்களுக்கு அனுமதி வழங்கப்படுவதை எதிர்பார்க்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள், (“ஆம்') நான் அதை நம்பிக்கையுடன் எதிர்பார்க்கிறேன்” என்று கூறிவந்தார்கள். ஆயிஷா (ரலி) அவர்கள் கூறுகிறார் கள்: அபூபக்ர் (ரலி) அவர்கள் நபி (ஸல்) அவர்களை எதிர்பார்த்துக் காத்துக்கொண்டிருந்தார்கள். பின்பு ஒருநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், லுஹ்ர் நேரத்தில் அபூபக்ர் (ரலி) அவர்களிடம் வந்து அவர்களை அழைத்தார்கள். மேலும், “(அபூபக்ர் அவர்களே! நான் இரகசியம் பேச வேண்டும்) உங்களுடன் இருப்பவர்களை வெளியே செல்லும்படி கூறுங்கள்” என்று கூறினார்கள். அதற்கு அபூபக்ர் (ரலி) அவர்கள் (என்னுடனிருக்கும்) இந்த இருவரும் என்னிரு பெண்மக்கள் (ஆயிஷாவும், அஸ்மாவும்)தான்” என்று பதிலளித்தார்கள். அப்போது நபி (ஸல்) அவர்கள் (ஹிஜ்ரத் செய்து, மக்காவிலிருந்து) புறப்பட எனக்கு அனுமதி வழங்கப்பட்டுவிட்டது உங்களுக்குத் தெரிந்ததா?” என்று கேட்டார்கள். அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! நானும் உடன் வருவதை விரும்புகிறீர்களா?” என்று கேட்டார்கள். அதற்கு, “(ஆம்) உடன் வருவதை விரும்புகிறேன்” என்று கூறினார்கள். அல்லாஹ்வின் தூதரே! என்னிடம் இரண்டு ஒட்டகங்கள் இருக்கின்றன. அவற்றை முன்கூட்டியே (ஹிஜ்ரத்) புறப்பட்டுச் செல்வதற்கென தயார் நிலையில் வைத்துள்ளேன்” என்று அபூபக்ர் (ரலி) அவர்கள் கூறினார்கள். பின்பு, அவற்றில் ஒன்றை நபி (ஸல்) அவர்களுக்குக் கொடுத்தார்கள். அந்த ஒட்டகத்திற்கு “ஜத்ஆ' என்று பெயர். பிறகு இருவரும் பயணம் புறப்பட்டுச் சென்று, ஸவ்ர் (மலைக்) குகைக்கு வந்து அதில் அவர்கள் இருவரும் ஒளிந்துகொண்டனர். ஆமிர் பின் ஃபுஹைரா, என் தாய்வழிச் சகோதரர் துஃபைல் பின் அப்தில்லாஹ் பின் சக்பரா அவர்களின் அடிமையாக இருந்தார். மேலும், (என் தந்தை) அபூபக்ர் அவர்களிடம் பால் தரும் ஒட்டகம் ஒன்றிருந்தது. ஆமிர் பின் ஃபுஹைரா அந்த ஒட்டகத்தை மக்காவாசிகளுடன் மதிய வேளையிலும் காலை வேளையிலும் ஓட்டிச் செல்லக் கூடியவராக இருந்தார். காலை நேரத்தில் மக்காவாசிகளுடன் இருக்கும் அவர், இரவின் கடைசி நேரத்தில் நபி (ஸல்) அவர்களிடமும் அபூபக்ர் (ரலி) அவர்களிடமும் (அவர்களுக்கு ஒட்டகப் பால் தருவதற்காகச்) சென்றுவிடுவார். பிறகு அந்த ஒட்டகத்தை (மேய்ப்பதற்கு) ஓட்டிச் செல்வார். ஆனால், இடையர்களில் யாருக்கும் இது தெரியாது. நபி (ஸல்) அவர்கள் (குகையிலிருந்து அபூபக்ருடன்) புறப்பட்டபோது அவ்விருவருடன் ஆமிர் பின் ஃபுஹைராவும் புறப்பட்டார். மதீனா போய்ச் சேரும்வரையில் அவர்கள் இருவரும் (முறைமாற்றி) ஆமிரைத் தமக்குப்பின் அமர்த்திக்கொண்டனர். (பின்பு) பிஃரு மஊனா நாளில் ஆமிர் பின் ஃபுஹைரா கொல்லப்பட்டார்.168 உர்வா (பின் அஸ்ஸுபைர் -ரஹ்) அவர்கள் கூறுகிறார்கள்: பிஃரு மஊனாவில் இருந்த (குர்ஆனை நன்கறிந்த)வர்கள் கொல்லப்பட்டு அம்ர் பின் உமய்யா அள்ளம்ரீ (ரலி) அவர்கள் கைது செய்யப்பட்டபோது அன்னாரைப் பார்த்து ஆமிர் பின் துஃபைல், கொல்லப்பட்டுக் கிடந்த (உயிர்த் தியாகிகளில்) ஒருவரைச் சுட்டிக்காட்டி, “இவர் யார்?” என்று கேட்டான். அதற்கு அம்ர் பின் உமய்யா (ரலி) அவர்கள், “இவர் ஆமிர் பின் ஃபுஹைரா” என்று கூறினார். அதற்கு ஆமிர் பின் துஃபைல், “இவர் கொல்லப்பட்ட பின்பு இவர் வானத்திற்கு உயர்த்தப்படுவதை நான் கண்டேன். எந்த அளவுக்கென்றால் வானத்தை நான் நோக்கியபோது, வானத்திற்கும் பூமிக்கும் இடையில் அவர் இருந்தார். பிறகு அவர் (பூமியில்) வைக்கப்பட்டார்” என்று கூறினான். (கொல்லப்பட்ட) அவர்களின் செய்தி நபி (ஸல்) அவர்களுக்கு (வானவர் ஜிப்ரீல் மூலம்) எட்டியது. அவர்கள் கொல்லப்பட்ட செய்தியைத் தம் தோழர்களுக்கு (பின்வருமாறு) நபி (ஸல்) அவர்கள் தெரிவித்தார்கள்: உங்கள் தோழர்கள் கொல்லப்பட்டுவிட்டனர். அவர்கள் தம் இறைவனிடம், “இறைவா! நாங்கள் உன்மீது அன்பு கொண்டோம். நீ எங்கள்மீது அன்பு கொண்டாய்; எங்களைப் பற்றிய இந்தச் செய்தியை எங்கள் சகோதரர்களுக்குத் தெரிவித்துவிடுவாயாக!” என்று கூறினர். எனவே இறைவன் அவர்களைப் பற்றிய செய்தியை நமக்கு அறிவித்தான். அறிவிப்பாளர் உர்வா பின் அஸ் ஸுபைர் (ரஹ்) கூறுகிறார்கள்: (பிஃரு மஊனா நிகழ்ச்சி நடந்த) அந்நாளில் அவர்களில் உர்வா பின் அஸ்மா பின் அஸ்ஸல்த் (ரலி) அவர்களும் கொல்லப்பட்டார்கள். எனவேதான், (ஸுபைர் (ரலி) அவர்களின் மகனாகிய) எனக்கு அவரது பெயர் சூட்டப்பட்டது. (அன்று) முன்திர் பின் அம்ர் (ரலி) அவர்களும் கொல்லப்பட்டார்கள். எனவேதான், (என் சகோதரர் முன்திர் பின் ஸுபைருக்கு) “முன்திர்' எனப் பெயரிடப்பட்டது. அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 137
			}
		}
	]
}