{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4108,
			"arabicnumber": 4108,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நான் (என் சகோதரி) ஹஃப்ஸா (ரலி) அவர்களிடம் சென்றேன். அவர்களது கூந்தலில் இருந்து தண்ணீர் சொட்டிக் கொண்டிருந்தது. நான் அவர்களிடம், “மக்களின் (அரசியல்) விவகாரங்களில் நீங்கள் பார்ப்பது நடந்துகொண்டிருக்கிறது. எனக்கோ இந்த (ஆட்சியதிகார) விஷயத்தில் எந்தப் பங்கும் வழங்கப்படவில்லை. (இந்நிலையில், அவர்கள் கூட்டியுள்ள இந்த ஆலோசனைக் கூட்டத்திற்கு நான் செல்லத்தான் வேண்டுமா?”) என்று கேட்டேன்.181 அப்போது ஹஃப்ஸா (ரலி) அவர்கள், “(நடந்துகொண்டிருக்கும் ஆலோசனைக் கூட்டத்திற்குப்) போய்ச் சேர்வீராக. ஏனெனில், அவர்கள் உம்மை எதிர்பார்த்துக்கொண்டிருப்பார்கள். நீர் செல்லாமல் இருப்பதால் மக்களிடையே (மேலும்) பிளவு ஏற்பட்டுவிடுமோ என்று நான் அஞ்சுகிறேன்” என்று கூறினார்கள். நான் செல்லும்வரை என்னை அவர்கள் விடாமல் வற்புறுத்திக்கொண்டே இருந்தார்கள். (நானும் சென்றேன். அங்கே ஒருமித்த கருத்து உருவாகாமல்) மக்கள் பிளவுபட்டிருந்தபோது முஆவியா (ரலி) அவர்கள் உரை நிகழ்த்தினார்கள்.182 அவர்கள் தமது உரையில் (இப்னு உமர் (ரலி) அவர்களையும் அன்னாருடைய தந்தை உமர் (ரலி) அவர்களையும் கருத்தில் கொண்டு), “எவர் இந்த (ஆட்சிப் பொறுப்பு) விஷயத்தில் கருத்துச் சொல்ல விரும்புகிறாரோ அவர் தம் தலையைக் காட்டட்டும். ஏனெனில், அவரைவிடவும் அவருடைய தந்தையைவிடவும் நாமே ஆட்சிப் பொறுப்பிற்கு மிகவும் அருகதையானோர்” என்று கூறினார்கள். ஹபீப் பின் மஸ்லமா (ரலி) அவர்கள் கூறுகிறார்கள்: நான் (இப்னு உமர் -ரலி) அவர்களிடம், “நீங்கள் (அப்போது) முஆவியா (ரலி) அவர்களுக்கு எந்தப் பதிலும் அளிக்கவில்லையா?” என்று கேட்டேன். அதற்கு அவர்கள், “அப்போது நான் எனது துண்டை அவிழ்த்து (உதறிப் போட்டு)க்கொண்டு “(உஹுத் மற்றும் “கன்தக்' போர்களில் முஆவியாவே,) உங்களுடனும் உங்கள் தந்தை (அபூசுஃப்யான்) உடனும் இஸ்லாத்திற்காகப் போரிட்ட (அலீ (ரலி) போன்ற)வரே இந்த (ஆட்சியதிகார) விஷயத்திற்கு உங்களைவிடத் தகுதி வாய்ந்தவர்' என்று சொல்ல நினைத்தேன். ஆயினும், மக்களிடையே பிளவை ஏற்படுத்தி, இரத்தம் சிந்தச் செய்துவிடும் ஒரு வார்த்தையை நான் கூறிவிடுவேனோ; நான் கூறிய வார்த்தைக்கு நான் நினைக்காத கருத்து கற்பிக்கப்பட்டுவிடுமோ என்றெல்லாம் அஞ்சினேன். மேலும், சொர்க்கத்தில் (பொறுமையாளர்களுக்காக) அல்லாஹ் தயாரித்துவைத்துள்ளவற்றை எண்ணிப் பார்த்தேன் (அதனால் அவர்களுக்குப் பதில் கூறவில்லை)” என்று கூறினார்கள். அப்போது நான், “(நல்ல வேளை, நீங்கள் கோப உணர்ச்சிக்கு ஆளாகாமல்) பாதுகாக்கப்பட்டீர்கள்” என்று கூறினேன். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் மஹ்மூத் (ரஹ்) அவர்களது அறிவிப்பில் (“கூந்தல்' என்பதைக் குறிக்க “நஸ்வாத்' எனும் சொல்லுக்குப் பதிலாக) “நவ்சாத்' எனும் சொல் இடம்பெற்றுள்ளது. அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 152
			}
		}
	]
}