{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4185,
			"arabicnumber": 4185,
			"text": "நாஃபிஉ (ரஹ்) அவர்கள் கூறிய தாவது: (அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி) அவர்களை ஹஜ்ஜாஜின் ராணுவம் முற்றுகையிட்டிருந்த குழப்பமான கால கட்டத்தில், உம்ராவிற்காக மக்காவிற்குச் செல்லத் திட்டமிட்டிருந்த) அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடம் அவர்களின் புதல்வர்களில் ஒருவர்-உபைதுல்லாஹ் பின் அப்தில்லாஹ், சாலிம் பின் அப்தில்லாஹ் ஆகிய இருவரும் என ஓர் அறிவிப்பில் காணப்படுகிறது- “இந்த வருடம் தாங்கள் (உம்ராவிற்குச் செல்லாமல் இங்கேயே) தங்கிவிடலாமே. ஏனென்றால், நீங்கள் கஅபாவிற்குப் போய் சேரமாட்டீர்கள் என்று நான் அஞ்சுகிறேன்” என்று கூறினார். அதற்கு அவர்கள், “நாங்கள் (ஹுதைபியா ஆண்டு) நபி (ஸல்) அவர்களுடன் (உம்ரா செய்வதற்காக மக்கா) புறப்பட்டுச் சென்றோம்; அப்போது, குறைஷி குல இறைமறுப்பாளர்கள் எங்களை கஅபாவுக்குச் செல்ல விடாமல் தடுத்தனர். எனவே, நபி (ஸல்) அவர்கள் தமது குர்பானி பிராணிகளை அறுத்துவிட்டுத் (தமது) தலையை மழித்துக்கொண்டார்கள். நபி (ஸல்) அவர்களின் தோழர்கள் தலைமுடியைக் குறைத்துக்கொண்டனர். (அனைவரும் இஹ்ராமிலிருந்து விடுபட்டனர்)” என்று கூறினார்கள். தொடர்ந்து அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள், “நான் உம்ரா செய்ய முடிவு செய்துவிட்டேன் என்பதற்கு உங்களைச் சாட்சியாக்குகிறேன். கஅபாவிற்குச் செல்ல எனக்கு வழி விடப்பட்டால் “தவாஃப்' செய்வேன். அங்கு செல்ல முடியாதவாறு நான் தடுக்கப்பட்டால், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்தது போல நானும் செய்வேன்” என்று கூறினார்கள். பின்னர் சிறிது நேரம் நடந்துவிட்டு, “(இஹ்ராமிலிருந்து விடுபடுகிற விஷயத்தில் ஹஜ், உம்ரா ஆகிய) அந்த இரண்டையும் நான் ஒன்று போலவே கருதுகிறேன். நான் என் உம்ராவுடன் ஹஜ்ஜையும் (என்மீது) கடமையாக்கிக்கொண்டேன் என்பதற்கு உங்களைச் சாட்சியாக்குகிறேன்” என்று கூறினார்கள். (பிறகு மக்காவிற்குப் போனபோது) ஒரேயொரு தவாஃபும் ஒரேயொரு சஃயும் செய்து (ஹஜ் உம்ரா ஆகிய) இரண்டிலிருந்தும் விடுபட்டார் கள்.247 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 225
			}
		}
	]
}