{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4192,
			"arabicnumber": 4192,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: “உக்ல்' மற்றும் “உரைனா' குலத்தாரில் சிலர் மதீனாவிற்கு வந்து நபி (ஸல்) அவர்களிடம், தாங்கள் இஸ்லாத்தை ஏற்பதாகப் பேசினர். அப்போது அவர்கள், “அல்லாஹ்வின் தூதரே! நாங்கள் பால் தரும் கால்நடைகள் வைத்திருப்பவர்கள். நாங்கள் விளைநிலங்கள் வைத்திருப்பவர்கள் அல்லர். (நாங்கள் பால் தரும் கால்நடை களைக் காடுகளில் மேய்த்து அதன் பாலை அருந்துபவர்களாய் இருந்தோம்)” என்று கூறினர். அவர்களுக்கு மதீனா(வின் தட்ப வெப்பம்) ஒத்துக்கொள்ளவில்லை. எனவே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், (பத்துக்குட்பட்ட) ஒட்டகங்களை யும் ஒரு மேய்ப்பரையும் அவர்களு(டைய உபயோகத்து)க்காக வழங்கும்படி உத்தரவிட்டார்கள். மேலும் “ஒட்டகங்கள் (மேயும்) இடத்திற்குச் சென்று அந்த ஒட்டகங்களின் பாலையும் சிறுநீரையும் பருகிக்கொள்ளுங்கள் (இன்ஷா அல்லாஹ் நிவாரணம் கிடைக்கும்)” என்று உத்தரவிட்டார்கள். அவ்வாறே அவர்கள் சென்றனர். (அவற்றின் பாலை அருந்தி நிவாரணமும் பெற்றனர்.) அவர்கள் (கருங்கற்கள் நிறைந்த) “அல்ஹர்ரா' பகுதியில் இருந்தபோது இஸ்லாத்திலிருந்து விலகி இறை மறுப்பாளர்களாக (மதம்) மாறிவிட்டனர். மேலும், நபி (ஸல்) அவர்களின் கால்நடை மேய்ப்பாளர் (யசார்-ரலி) அவர்களைக் கொலை செய்துவிட்டு ஒட்டகங்களை (தங்களுடன்) ஓட்டிச் சென்றுவிட்டனர். இந்த விஷயம் நபி (ஸல்) அவர்களுக்கு எட்டியபோது, (அவர்களைப் பிடித்து வர) அவர்களைத் தொடர்ந்து ஆளனுப்பினார்கள். (அவர்கள் பிடிபட்டு மதீனாவுக்குக் கொண்டுவரப்பட்டபோது) அவர்களுக்கு தண்டனை கொடுக்குமாறு நபி (ஸல்) அவர்கள் கட்டளையிட்டார்கள். (மக்கள்) அவர்களுடைய கண்களில் பழுக்கக் காய்ச்சிய ஆணிகளால் சூடு போட்டார்கள். அவர்களுடைய கை(கால்)கள் வெட்டப்பட்டு, (மதீனாவின் புறநகரான) “அல்ஹர்ரா' பகுதியில் அவர்கள் விடப்பட்டனர். அவர்கள் அந்த நிலையிலேயே மாண்டுபோயினர்.253 அறிவிப்பாளர் கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: அதற்குப் பிறகு நபி (ஸல்) அவர்கள் (மக்களைத்) தர்மம் செய்யுமாறு தூண்டிக்கொண்டும் சித்திரவதை செய்ய வேண்டாமென தடுத்துக்கொண்டும் இருந்தார்கள். இந்த ஹதீஸ் ஆறு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் கத்தாதா (ரஹ்) அவர்களின் அறிவிப்பில், (நபி (ஸல்) அவர்களிடம் வந்தவர்கள்) உரைனா குலத்தார் (மட்டுமே) என்று காணப்படுகிறது. மற்றோர் அறிவிப்பில், “உக்ல் குலத்தாரில் சிலர் வந்தனர்” என்று இடம் பெற்றுள்ளது. அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 232
			}
		}
	]
}