{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "மஹ்மூத் பின் அர்ரபீஉ அல் அன்சாரி (ரலி) அவர்கள் கூறியதாவது: பத்ர் போரில் கலந்துகொண்ட அன்சாரி களில் ஒருவரான நபித்தோழர் இத்பான் பின் மாலிக் (ரலி) அவர்கள் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “அல்லாஹ்வின் தூதரே! எனது பார்வை (மங்கிப்)போய்விட்டது. நான் என் சமூகத்தாருக்கு (இமாமாக இருந்து) தொழுகை நடத்திவருகிறேன். மழைக் காலங்களில் என(து இல்லத்து)க்கும் அவர்களுக்கும் இடையே உள்ள பள்ளத்தாக்கில் தண்ணீர் ஓடுவதால் அவர்களின் பள்ளிவாசலுக்குச் சென்று என்னால் தொழுவிக்க முடியவில்லை. எனவே, அல்லாஹ்வின் தூதரே! தாங்கள் எனது இல்லத்திற்கு வந்து அதில் (ஓர் இடத்தில்) தொழ வேண்டும். அதை நான் தொழு(விக்கு)ம் இடமாக ஆக்கிக்கொள்ள வேண்டும் என ஆசைப்படுகிறேன்” என்று சொன்னார்கள். அப்போது அவரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ் நாடினால் (இன்ஷா அல்லாஹ்) அவ்வாறே நான் செய்வேன்” என்று கூறினார்கள். இத்பான் பின் மா-க் (ரலி) அவர்கள் கூறுகிறார்கள்: (மறு நாள்) முற்பகல் நேரத்தில் அபூபக்ர் (ரலி) அவர்களுடன் அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் வந்து (எனது இல்லத்துக்குள்) நுழைய அனுமதி கேட்டார்கள். அவர்களுக்கு நான் அனுமதியளித்தேன். வீட்டில் நுழைந்ததும். உட்காராமலேயே, “உங்கள் வீட்டில் எந்த இடத்தில் நான் தொழ வேண்டுமென விரும்புகிறீர்கள்?” என்று (என்னிடம்) கேட்டார்கள். அப்போது நான் அவர்களுக்கு வீட்டின் ஒரு பகுதியைக் காட்டினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அவ்விடத்தில்) நின்று ‘தக்பீர் (தஹ்ரீமா)’ கூறினார்கள். நாங்களும் அவர்களுக்குப் பின்னால் (தொழுகையில்) அணிவகுத்து நின்றோம். அப்போது அவர்கள் இரண்டு ரக்அத்கள் தொழு(வித்)துவிட்டு ‘சலாம்’ கொடுத்தார்கள். நபி (ஸல்) அவர்களுக்காக நாங்கள் தயாரித்துவைத்திருந்த ‘கஸீரா’ எனும் (கஞ்சி வகை) உணவி(னை உட்கொள்வத)ற்காக அவர்களை நாங்கள் இருக்கவைத்தோம். (நபியவர்களின் வருகையை அறிந்த) அப்பகுதி மக்களில் கணிசமானோர் வீட்டில் வந்து குழுமிவிட்டனர். அப்போது அவர்களில் ஒருவர், ‘மா-க் பின் துகைஷின்’ அல்லது ‘இப்னு துக்ஷுன்’ எங்கே என்று கேட்டார். மற்றொருவர், “அவர் ஒரு நயவஞ்சகர் (முனாஃபிக்); அல்லாஹ்வையும் அவனுடைய தூதரையும் நேசிக்காதவர் (அதனால்தான் அல்லாஹ்வின் தூதரைக் காண அவர் வரவில்லை)” என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அவ்வாறு சொல்லாதே! அல்லாஹ்வின் அன்பை நாடி, அவர் அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை (லா இலாஹ இல்லல்லாஹ்) என்று சொல்-விட்டிருப்பதை நீ பார்க்கவில்லையா?” என்று கேட்டார்கள். அவர், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்” என்று கூறிவிட்டு, “அவர் (மாலிக் பின் துக்ஷுன்) நயவஞ்சகர்களுடன் தொடர்பு வைத்திருப்பதையும் (அவர்கள்மீது) அபிமானம் கொண்டிருப்பதையும் காண் கிறோம்” என்று சொன்னார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ்வின் அன்பை நாடி ‘லா இலாஹ இல்லல்லாஹ்’ என்று யார் சொன்னாரோ அவர்மீது அல்லாஹ் நரகத்தைத் தடை செய்துவிட்டான்” என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் (அஸ்ஸுஹ்ரீ-ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு நான் பனூ சா-ம் குலத்தைச் சேர்ந்தவரும் அவர்களின் பிரமுகர்களில் ஒருவருமான ஹுஸைன் பின் முஹம்மத் அல்அன்சாரி (ரஹ்) அவர்களிடம் மஹ்மூத் பின் அர்ரபீஉ (ரலி) அவர்களின் ஹதீஸ் குறித்துக் கேட்டேன். அன்னார் சொன்ன ஹதீஸை ஹுஸைன் பின் முஹம்மத் (ரஹ்) அவர்கள் உறுதிப்படுத்தி னார்கள். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		}
	]
}