{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் பத்ர் போரில் கலந்துகொண்ட மூத்த வயதினருடன் வயதில் இளையவனான எனக்கும் (தமது அவையில்) இடமளித்துவந்தார் கள். ஆகவே, அவர்களில் சிலர், “எங்களுடன் இந்த இளைஞருக்கு ஏன் இடமளிக்கிறீர்கள்? எங்களுக்கு அவர் வயதில் பிள்ளைகள்கூட இருக்கின்ற னரே?” என்று கேட்டார்கள். அதற்கு உமர் (ரலி) அவர்கள், “அவர் நீங்கள் அறிந்துவைத்துள்ள (கல்வித் தகுதி படைத்த)வர்களில் ஒருவர்” என்று பதிலளித்தார்கள். பிறகு, ஒருநாள் அவர்களையெல்லாம் அழைத்தார்கள்; அவர்களுடன் என்னையும் அழைத்தார்கள். அவர்களுக்கு என் (தகுதியினைப் பற்றி உணர்த்திக்காட்டுவதற்காகவே என்னை அவர்கள் அழைத்ததாகக் கருதுகிறேன். (அவர்களெல்லாரும் வந்தவுடன் அவர்களிடம்) உமர் (ரலி) அவர்கள், “இதா ஜாஅ நஸ்ருல்லாஹி” (நபியே! இறைவனின் உதவியும் வெற்றியும் வந்து, மக்கள் கூட்டம் கூட்டமாக இறைமார்க்கத்தில் இணைவதை நீர் பார்க்கும்போது உம்முடைய இறைவனைப் புகழ்ந்து அவனைத் துதிப்பீராக! மேலும், அவனிடம் பாவமன்னிப்புக் கோருவீராக!)” எனும் (குர்ஆனின் 110ஆவது “அந்நஸ்ர்') அத்தியாயத்தை இறுதிவரை ஓதிக்காட்டி, “இதற்கு நீங்கள் என்ன (விளக்கம்) கூறுகிறீர்கள்?” என்று கேட்டார்கள். அவர்களில் சிலர், “நமக்கு உதவியும் வெற்றியும் அளிக்கப்படும்போது அல்லாஹ்வைப் புகழும்படியும் அவனிடம் பாவமன்னிப்புக் கோரும்படியும் நாம் கட்டளையிடப்பட்டுள்ளோம்” என்று (விளக்கம்) கூறினர். சிலர், “எங்களுக்குத் தெரியாது” என்றனர். அல்லது அவர்களில் சிலர் எந்தக் கருத்தும் கூறவில்லை. பிறகு உமர் (ரலி) அவர்கள் என்னிடம், “இப்னு அப்பாஸே! நீங்களும் இப்படித்தான் கூறுகிறீர்களா?” என்று கேட்டார்கள். நான், “இல்லை” என்றேன். அவர்கள், “அப்படியென்றால் நீங்கள் என்ன கூறுகிறீர்கள்?” என்று கேட்டார்கள். நான், “அது, அல்லாஹ் தன் தூதர் (ஸல்) அவர்களுக்கு, அவர்களின் ஆயுட்காலம் முடிந்து (இறப்பு நெருங்கி)விட்டது என அறிவித்த அறிவிப்பாகும். ஆகவே, “அல்லாஹ்வின் உதவியும் வெற்றியும் வந்து' என்பதில் உள்ள “வெற்றி' என்பது மக்கா வெற்றியைக் குறிக்கும். மக்கா வெற்றிதான், (நபியே!) உமது ஆயுட்காலம் முடியவிருப்பதற்கான அடையாளம். ஆகவே, நீர் உம்முடைய இறைவனைப் புகழ்ந்து அவனது தூய்மையை எடுத்துரைத்து, அவனிடம் பாவமன்னிப்புக் கோருவீராக! அவன் (நீர் மன்னிப்புக் கோருவதை ஏற்று) உமக்கு மன்னிப்பளிப்பவன் ஆவான்' என்பதே இதன் கருத்தாகும்” என்று சொன்னேன். உமர் (ரலி) அவர்கள், “நீங்கள் இந்த அத்தியாயத்திலிருந்து என்ன (கருத்தை) அறிகின்றீர்களோ அதையே நானும் அறிகின்றேன்” என்று சொன்னார்கள்.333 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 327
			}
		}
	]
}