{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறிய தாவது: உத்பா பின் அபீவக்காஸ் தம் சகோதரர் சஅத் பின் அபீவக்காஸ் (ரலி) அவர்களிடம், “ஸம்ஆவின் அடிமைப் பெண்ணுடைய மகன் என் மகன்தான்'என்று கூறி (மக்கா செல்லும்போது)அவனைப் பிடித்து(வைத்து)க்கொள்ளும்படி உறுதிமொழி வாங்கியிருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், மக்கா வெற்றியின் சமயம் மக்காவுக்கு (தம் தோழர்களுடன்) வருகை தந்தபோது, சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் ஸம்ஆவின் அடிமைப் பெண்ணுடைய மகனைப் பிடித்துக்கொண்டு அல்லாஹ் வின் தூதர் (ஸல்) அவர்களை நோக்கிச் சென்றார்கள். அவர்களுடன் ஸம்ஆவின் மகன் அப்த் (ரலி) அவர்களும் சென்றார்கள். சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் (நபி (ஸல்) அவர்களிடம், ஸம்ஆவின் அடிமைப் பெண்ணுடைய மகனைச் சுட்டிக்காட்டி), “இவன் என் சகோதரரின் மகன்; இவனைத் தன் மகன் என்று (சொல்லி, இவனைப் பிடித்துக்கொள்ளும்படி என்னிடம்) என் சகோதரர் உறுதிமொழி வாங்கியுள்ளார்” என்று சொன்னார். அப்த் பின் ஸம்ஆ, “அல்லாஹ்வின் தூதரே! இவன் என் சகோதரன். இவன் (என் தந்தை) ஸம்ஆவின் அடிமைப் பெண்ணுடைய மகன்; அவள் என் தந்தையின் அதிகாரத்தில் இருந்தபோதுதான் இவன் பிறந்தான்” என்று சொன்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஸம்ஆவின் அடிமைப் பெண்ணுடைய மகனைக் கூர்ந்துபார்த்தார்கள். அவன் (மக்காவாசிகளிலேயே) உத்பா பின் அபீவக்காஸை (தோற்றத்தில்) மிகவும் ஒத்திருந்தான். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இவன் உனக்குரியவன்தான்; இவன் உன் சகோதரன்தான், அப்த் பின் ஸம்ஆவே!” என்று சொன்னார்கள். அவன் ஸம்ஆவின் அதிகாரத்தில் (அவனுடைய தாய்) இருந்தபோது பிறந்த காரணத்தால் அப்படிச் சொன்னார்கள். மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உத்பா பின் அபீவக்காஸின் சாயலில் அந்த இளைஞன் இருந்ததைப் பார்த்த காரணத்தால், (தம் துணைவியார் சவ்தா (ரலி) அவர்களை நோக்கி, “ஸம்ஆ வின் மகள்) சவ்தாவே! இவனிடமிருந்து நீ திரையிட்டுக்கொள்” என்று சொன்னார்கள். இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறினார்கள்: “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் “(ஒரு பெண்) யாருடைய அதிகாரத்தில் இருக்கும்போது குழந்தை பிறக்கிறதோ அவருக்கே அக்குழந்தை உரியது. விபசாரம் செய்தவருக்கு இழப்புதான் உரியது' என்று சொன்னார்கள்” என ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்.338 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. மேலும் அபூஹுரைரா (ரலி) அவர்கள் நபி (ஸல்) அவர்களின் இந்தத் தீர்ப்பை (மக்களுக்கு) உரக்க அறிவித்துவந்தார்கள். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 336
			}
		}
	]
}