{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ், தன் தூதர் (ஸல்) அவர்களுக்கு ஹவாஸின் குலத்தாரின் செல்வத்தை (வெற்றிப் பரிசாக) அளித்தபோது நபி (ஸல்) அவர்கள் (புதிதாக இஸ்லாத்தைத் தழுவிய) மக்களுக்கு நூறு ஒட்டகங்களைக் கொடுக்கலானார்கள். உடனே (அன்சாரிகளில்) சிலர், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அல்லாஹ் மன்னிப்பானாக! (எதிரிகளான) குறைஷியரின் இரத்தம் நம் வாட்களில் சொட்டிக்கொண்டிருக்க, (நமக்குக் கொடுக்காமல்) இவர்களுக்குக் கொடுக்கிறார்களே; ஆனால், (தியாகங்கள் பல புரிந்த) நம்மை விட்டுவிடுகிறார் களே!” என்று (கவலையுடன்) சொன்னார் கள். அவர்களின் இந்தப் பேச்சு அல்லாஹ் வின் தூதர் (ஸல்) அவர்களுக்குத் தெரிவிக்கப்பட்டது. உடனே நபி (ஸல்) அவர்கள் அன்சாரி களுக்கு ஆளனுப்பி அவர்களைப் பதனிடப்பட்ட தோலால் ஆன ஒரு கூடாரத்தில் ஒன்று திரட்டினார்கள். அவர்களுடன் மற்றவர்களை நபி (ஸல்) அவர்கள் அழைக்கவில்லை. அவர்கள் ஒன்றுகூடியதும் நபி (ஸல்) அவர்கள் எழுந்து நின்று, “உங்களைக் குறித்து எனக்கு எட்டியுள்ள செய்தி என்ன? (உண்மைதானா?)” என்று கேட்க அன்சாரிகளில் விவரமானவர்கள், “அல்லாஹ்வின் தூதரே! எங்கள் தலைவர்கள் எதுவும் சொல்லவில்லை. எங்களில் இளவயதுடைய மக்கள் சிலர்தான், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை அல்லாஹ் மன்னிப்பானாக! நம்முடைய வாட்களில் குறைஷியரின் இரத்தம் சொட்டிக்கொண்டிருக்க, நம்மை விட்டுவிட்டு அவர்களுக்குக் கொடுக்கிறார்களே!' என்று பேசிக்கொண்டனர்” என்று கூறினார்கள். அப்போது, நபி (ஸல்) அவர்கள், “இறைமறுப்பைவிட்டு இப்போதுதான் புதிதாக இஸ்லாத்தில் இணைந்த சிலருக்கு நான் கொடுக்கிறேன். (அதன் வாயிலாக) அவர்களுடன் நான் இணக்கம் ஏற்படுத்திக்கொள்கிறேன். மக்கள் (பிற உலகச்) செல்வங்களை எடுத்துக் கொண்டு செல்ல, நீங்கள் உங்கள் இல்லங்களுக்கு இறைத்தூதரையே கொண்டு செல்வதை விரும்பவில்லையா? அல்லாஹ்வின் மீதாணையாக! அவர்கள் பெற்றுத் திரும்பும் செல்வங்களைவிட நீங்கள் பெற்றுத் திரும்புவதே சிறந்ததாகும்” என்றுசொன்னார்கள். அன்சாரிகள், “அல்லாஹ்வின் தூதரே! நாங்கள் (எங்களுடன் உங்களைக் கொண்டுசெல்வதையே) விரும்புகிறோம்” என்று சொன்னார்கள். அப்போது அவர்களிடம் நபி (ஸல்) அவர்கள், “விரைவில் (உங்களைவிடப் பிறருக்கு ஆட்சியதிகாரத்தில்) அதிகமாக முன்னுரிமை வழங்கப்படுவதைக் காண்பீர்கள். ஆகவே, அல்லாஹ்வையும் அவனுடைய தூதரையும் (மறுமையில்) சந்திக்கும்வரை பொறுமையாயிருங்கள். ஏனெனில், அன்று நான் (எனக்கு வழங்கப்படவுள்ள சிறப்புப் பரிசான “அல்கவ்ஸர்' எனும்) தடாகத்தின் அருகே இருப்பேன்” என்று சொன்னார்கள். ஆனால், மக்கள் பொறுமையாக இருக்க வில்லை.366 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 360
			}
		}
	]
}