{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஹுனைன் போரின்போது ஹவாஸின் குலத்தாரும் ஃகதஃபான் குலத்தாரும் மற்றவர்களும் தம் கால்நடைகளுடனும் குழந்தை குட்டிகளுடனும் (போர்க் களத்தில்) நபி (ஸல்) அவர்களை எதிர்கொண்டனர்.அப்போது நபி (ஸல்) அவர்களுடன் பத்தாயிரம் பேரும் (மக்கா வெற்றியில்) பொதுமன்னிப்பு அளிக்கப்பட்டு (புதிய முஸ்லிம்களாக) இருந்தவர்களில் பலரும் இருந்தனர். அவர்கள் நபி (ஸல்) அவர்களை (தனியாக) விட்டுவிட்டுப் பின்வாங்கிச் சென்றுவிட்டனர். இறுதியில், நபி (ஸல்) அவர்கள் மட்டும் தனியே எஞ்சி நின்றார்கள். அப்போது, அவர்கள் இரண்டு (முறை) அழைப்பு விடுத்தார்கள். இரண்டையும் கலந்துவிடாமல் (இடைவெளி இருக்குமாறு) பார்த்துக்கொண்டார்கள். தம் வலப் பக்கம் திரும்பி, “அன்சாரி களே!” என்று அழைக்க அவர்கள், “இதோ, வந்துவிட்டோம், அல்லாஹ்வின் தூதரே! நாங்கள் உங்களுடன்தான் இருக்கின்றோம்; (கவலைப்படாமல்) மகிழ்ச்சியுடனிருங்கள்” என்று சொன்னார்கள். பிறகு நபி (ஸல்) அவர்கள் தம் இடப் பக்கம் திரும்பி, “அன்சாரிகளே! என்று அழைத்தார்கள். அவர்கள் (மீண்டும்), “இதோ, தங்கள் அழைப்புக்குக் கீழ்ப்படிந்து வந்தோம், அல்லாஹ்வின் தூதரே! (கவலையின்றி) மகிழ்ச்சியுடனிருங்கள். நாங்கள் உங்களுடன்தான் இருக்கின்றோம்” என்று சொன்னார்கள். அப்போது நபி (ஸல்) அவர்கள் தமது “பைளா' எனும் வெள்ளைக் கோவேறு கழுதையின் மீது அமர்ந்திருந்தார்கள். பிறகு அதிலிருந்து இறங்கி, “நான் அல்லாஹ்வின் அடியாரும் அவனுடைய தூதரும் ஆவேன்” என்று சொன்னார்கள். பிறகு, இணைவைப்பாளர்கள் (அந்தப் போரில்) தோற்றுப்போனதால், ஏராளமான போர்ச் செல்வங்களை நபி (ஸல்) அவர்கள் பெற்றார்கள்; அவற்றை முஹாஜிர்களிடையேயும் (மக்கா வெற்றியில்) பொதுமன்னிப்பு அளிக்கப்பட்டவர்களிடையேயும் பங்கிட்டார்கள்; அன்சாரிகளுக்கு எதையும் கொடுக்கவில்லை. ஆகவே அன்சாரிகள் (சிலர்), “ஏதேனும் (போர் போன்ற) கடுமையான பிரச்சினை என்றால் (உயிரை அர்ப்பணித்து உதவிட) நாங்கள் அழைக்கப்படுகிறோம். ஆனால், (பிரச்சினை தீர்ந்ததும்) மற்றவர்களுக்குப் போர்ச் செல்வங்கள் கொடுக்கப்படுகின்றன” என்று (மனக் குறையுடன்) பேசிக்கொண்டார்கள். இவர் கள் இப்படிப் பேசிக்கொள்ளும் செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியது. உடனே அன்சாரிகளை ஒரு கூடாரத்தில் ஒன்று கூட்டி, “அன்சாரிகளே! உங்களைக் குறித்து எனக்கு எட்டிய இந்தச் செய்தி என்ன? (உண்மைதானா?)” என்று கேட்டார்கள். அவர்கள் (உண்மைதான் என்பது போல்) மௌனமாயிருந்தார்கள். உடனே நபி (ஸல்) அவர்கள், “அன்சாரிகளே! மக்கள் உலகச் செல்வத்தைத் தங்களுடன் கொண்டுசெல்ல, நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை சொந்தமாக்கிக்கொண்டு உங்கள் இல்லங்களுக்குச் செல்வதை நீங்கள் விரும்ப வில்லையா?” என்று கேட்டார்கள். அன்சாரிகள், “ஆம் (நாங்கள் அதைத்தான் விரும்புகிறோம்) என்று பதிலளித்தார்கள். அப்போது நபி (ஸல்) அவர்கள், “மக்களெல்லாரும் ஒரு பள்ளத்தாக்கில் செல்ல, அன்சாரிகள் மட்டும் வேறொரு பள்ளத்தாக்கில் செல்வார்களாயின் நான் அன்சாரிகள் செல்லும் பள்ளத்தாக்கையே தேர்ந்தெடுப்பேன்” என்று சொன்னார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான ஹிஷாம் பின் ஸைத் (ரஹ்) அவர்கள் (இதைத் தமக்கு அறிவித்த தம் பாட்டனாரான அனஸ் (ரலி) அவர்களிடம்,) “அபூஹம்ஸாவே! நீங்கள் இந்நிகழ்ச்சியைப் பார்த்தீர்களா?” என்று கேட்க, அனஸ் (ரலி) அவர்கள், “நான் நபி (ஸல்) அவர்களைவிட்டு எங்கே போவேன்?” என்று பதிலளித்தார்கள். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 366
			}
		}
	]
}