{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் யமன் நாட்டில் இருந்தேன். அப்போது யமன்வாசிகளில் “தூ கலாஉ' மற்றும் “தூ அம்ர்' ஆகிய இருவரை நான் சந்தித்தேன்.391 அவர்களிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பற்றிப் பேசலானேன். அப்போது “தூ அம்ர்' என்னிடம், “நீங்கள் சொல்லும் உங்கள் தோழரின் செய்தி உண்மையெனில் அவர் இறந்துபோய் மூன்று நாட்கள் கடந்துவிட்டன என்பதை உங்களுக்குத் தெரிவித்துக்கொள்கிறேன்” என்றார். அவர்கள் இருவரும் என்னுடன் வந்தார்கள். நாங்கள் இன்னும் பயணத்திலேயே இருந்துகொண்டிருக்கும்போது மதீனாவின் திசையிலிருந்து ஒரு பயணக் கூட்டம் வந்துகொண்டிருப்பது தென்பட்டது. நாங்கள் அவர்களிடம் விசாரித்தோம். அவர்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறந்துவிட்டார்கள். அபூபக்ர் (ரலி) கலீஃபாவாக (ஆட்சியாளராக) ஆக்கப்பட்டுவிட்டார்கள். மக்கள் அனை வரும் நல்லவர்களாக உள்ளனர்” என்று பதிலளித்தனர். உடனே “தூ கலாஉ' மற்றும் “தூ அம்ர்' இருவரும், “நாங்கள் இருவரும் புறப்பட்டு வந்தோம். (எனினும், இப்போது திரும்பிச் செல்கிறோம்.) இறைவன் நாடினால் (அவரிடம்) திரும்பி வருவோம்' என்று உங்கள் தோழரிடம் (அபூபக்ரிடம்) சொல்லுங்கள்” என்று கேட்டுக்கொண்டார்கள். பிறகு யமன் நாட்டிற்குத் திரும்பிச் சென்றுவிட்டார்கள். நான் அபூபக்ர் (ரலி) அவர்களிடம் யமன்வாசிகளின் செய்தியைத் தெரிவித்தேன். அபூபக்ர் (ரலி) அவர்கள், “அவர்களை (என்னிடம்) நீங்கள் அழைத்துவந்திருக்கக் கூடாதா?” என்று கேட்டார்கள். பிறகு (என்னைச் சந்திக்கும்) ஒரு சந்தர்ப்பம் வந்தபோது தூ அம்ர், “ஜரீரே! நீங்கள் எனக்கு உபகாரம் செய்திருக்கிறீர்கள். ஆகவே, நான் உங்களுக்கு ஒரு செய்தியைத் தெரிவிக்கிறேன். அரபு மக்களாகிய நீங்கள், தலைவர் ஒருவர் இறந்துவிட்டால், (உங்களுக்குள் ஒருவரையொருவர் கலந்தாலோசித்து) வேறொருவரைத் தலைவராகத் தேர்ந் தெடுத்துக்கொள்ளும்வரை நன்மையில் இருப்பீர்கள். (ஆட்சித் தலைமை) வாள் பலத்தால் உருவாவதாயிருந்தால், ஆட்சித் தலைவர் களாக வருபவர்கள் மன்னர்களாக இருப்பார்கள். அவர்கள் மன்னர்கள் கோபப்படுவதைப் போன்றே (சொந்த நலன்களுக்காகக்) கோபப்பட்டு, மன்னர்கள் திருப்தியடைவதைப் போன்றே (சொந்த நலன்களுக்காகத்) திருப்தியடைவார்கள்” என்று சொன்னார். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 385
			}
		}
	]
}