{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4372,
			"arabicnumber": 4372,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் “நஜ்த்' பகுதியை நோக்கி குதிரைப் படையொன்றை அனுப்பினார்கள். அந்தப் படையினர் “பனூ ஹனீஃபா' குலத்தைச் சேர்ந்த ஸுமாமா பின் உஸால் என்றழைக்கப்படும் மனிதர் ஒருவரை (கைது செய்து) கொண்டுவந்தார்கள். பள்ளிவாசலின் தூண்களில் ஒன்றில் அவரைக் கட்டிப் போட்டார்கள். நபி (ஸல்) அவர்கள் அவரிடம் வந்து, “(உன் விஷயத்தில் நான் சொல்லப்போகும் முடிவைப் பற்றி) நீர் என்ன கருதுகிறீர், ஸுமாமாவே?” என்று கேட்டார்கள். அவர், “நான் நல்லதே கருதுகிறேன் முஹம்மதே! நீங்கள் என்னைக் கொன்றால் பழிக்குப்பழி வாங்க வேண்டிய ஒருவனையே கொல்கிறீர்கள்; (என்னை மன்னித்து எனக்கு) நீங்கள் உபகாரம் செய்தால், நன்றி செய்யக்கூடிய ஒருவனுக்கே உபகாரம் செய்கிறீர்கள்; நீங்கள் செல்வத்தை விரும்பினால் அதில் நீங்கள் விரும்புவதைக் கேளுங்கள்” என்று பதிலளித்தார். எனவே, அவர் (அப்படியே) விடப்பட்டார். மறுநாள் வந்தபோது அவரிடம், “ஸுமாமாவே! என்ன கருதுகிறீர்?” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அதற்கு அவர், தங்களிடம் நான் (ஏற்கெனவே) கூறியதுதான்: நீங்கள் உபகாரம் செய்தால் நன்றியுள்ளவனுக்கே உபகாரம் செய்கிறீர்கள்” என்றார். அவரை நபியவர்கள் (அன்றும் அப்படியே) விட்டுவிட்டார்கள். நாளை மறுநாள் வந்தபோது, “நீர் என்ன கருதுகிறீர்? ஸுமாமாவே!” என்று நபி (ஸல்) அவர்கள் கேட்டார்கள். அவர், “நான் ஏற்கெனவே தங்களிடம் சொன்னதைத்தான் கருதுகிறேன்” என்று பதிலளித்தார். நபி (ஸல்) அவர்கள், “ஸுமாமாவை அவிழ்த்துவிடுங்கள்” என்று சொன்னார்கள். உடனே ஸுமாமா, பள்ளிவாசலுக்கு அருகிலிருந்த பேரீச்சந்தோட்டத்திற்குச் சென்று குளித்துவிட்டு, பள்ளிவாசலுக்கு வந்து, “அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை என்று நான் உறுதிமொழி கூறுகிறேன். மேலும், முஹம்மத், அல்லாஹ்வின் தூதர் என்றும் நான் உறுதிமொழி கூறுகிறேன்” என மொழிந்துவிட்டு, “முஹம்மதே! அல்லாஹ்வின் மீதாணையாக! உங்கள் முகத்தைவிட என்னிடம் வெறுப்புக்குரிய முகம் பூமியில் வேறெதுவும் இருக்கவில்லை. ஆனால், (இன்று) உங்களுடைய முகம் எல்லா முகங்களையும்விட எனக்கு மிகவும் பிரியமானதாக ஆகிவிட்டது. அல்லாஹ்வின் மீதாணையாக! உங்கள் மார்க்கத்தைவிட என் வெறுப்புக்குரிய மார்க்கம் வேறெதுவும் இருக்கவில்லை. ஆனால், (இன்று) மார்க்கங்களிலேயே எனக்கு மிகவும் பிரியமானதாக உங்கள் மார்க்கம் ஆகிவிட்டது. அல்லாஹ்வின் மீதாணையாக! உங்கள் ஊரைவிட எனக்கு வெறுப்பான ஊர் வேறெதுவும் இருந்திருக்கவில்லை. ஆனால், இப்போது உங்கள் ஊரே எனக்கு மிகவும் பிரியமான ஊராகிவிட்டது. நான் (மக்காவுக்குச் சென்று) உம்ரா செய்யத் திட்டமிட்டிருந்த நிலையில்தான் உங்கள் குதிரைப் படையினர் என்னைப் பிடித்துக்கொண்டனர். இப்போது தாங்கள் என்ன கருதுகிறீர்கள்?” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவருக்கு நற்செய்தி கூறி உம்ரா செய்ய அவருக்கு அனுமதியளித்தார்கள். அவர் மக்காவிற்குச் சென்றபோது (அங்கே) ஒருவர் அவரிடம், “நீர் மதம் மாறிவிட்டீரா?” என்று கேட்டார். அதற்கு ஸுமாமா (ரலி) அவர்கள், “இல்லை. அல்லாஹ்வின் மீதாணையாக! (நான் மதம் மாறவில்லை.) மாறாக, அல்லாஹ்வின் தூதர் முஹம்மத் (ஸல்) அவர்களுடன் இணைந்து இறைவனுக்குக் கீழ்ப்படியும் முஸ்லிமாக மாறிவிட்டேன். அல்லாஹ்வின் மீதாணையாக! நபி (ஸல்) அவர்கள் அனுமதி தரும்வரை (எனது நாடான) யமாமாவிóருந்து ஒரு கோதுமை தானியம்கூட (மக்காவாசி களான) உங்களுக்கு வராது” என்று சொன்னார்கள்.407 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 398
			}
		}
	]
}