{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4383,
			"arabicnumber": 4383,
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒருமுறை), “பஹ்ரைனின் நிதி வந்தால் உனக்கு நான் இப்படி இப்படி மூன்று முறை (அள்ளிக்) கொடுப்பேன்” என்று என்னிடம் சொல்லியிருந்தார்கள். ஆனால், பஹ்ரைன் நிதி அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறக்கும்வரை வரவில்லை. அபூபக்ர் (ரலி) அவர்களிடம் (அவர்களின் ஆட்சிக் காலத்தில்) அந்த நிதி வந்தபோது அவர்கள் பொது அறிவிப்புகள் செய்பவர் ஒருவரிடம், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எவருக்காவது கடன் தர வேண்டியிருந்தாலோ அல்லது அவர்கள் எவருக்காவது ஏதேனும் வாக்களித்திருந்(து அதை நிறைவேற்றும் முன்பாக அவர்கள் இறந்துவிட்டிருந்)தாலோ அவர் என்னிடம் வரட்டும்” என்று அறிவிப்புச் செய்யும்படி உத்தரவிட்டார்கள். ஆகவே, நான் அபூபக்ர் (ரலி) அவர்களிடம் வந்து, “நபி (ஸல்) அவர்கள், “பஹ்ரைன் நிதி வந்தால் உனக்கு நான் இப்படி இப்படி மூன்று முறை (அள்ளிக்) கொடுப்பேன்' என்று சொன்னார்கள்” எனத் தெரிவித்தேன். அப்போது எனக்கு அபூபக்ர் (ரலி) அவர்கள் (சிறிது) கொடுத்தார்கள். அதற்குப்பின் அவர்களை நான் சந்தித்து மீண்டும் கேட்டேன். அப்போது அவர்கள் (எதுவும்) எனக்குத் தரவில்லை. பிறகு மீண்டும் அவர்களிடம் நான் சென்றேன். அப்போதும் அவர்கள் ஏதும் தரவில்லை. மீண்டும் நான் அவர்களிடம் மூன்றாவது முறையாகச் சென்றேன். அப்போதும் எனக்குத் தரவில்லை. ஆகவே, நான் அவர்களிடம், “(முதலில்) நான் உங்களிடம் வந்தேன். அப்போது நீங்கள் எனக்குத் தரவில்லை. பிறகு (இரண்டாம் முறையாக) வந்தேன். அப்போதும் நீங்கள் எனக்குத் தரவில்லை. பிறகு (மூன்றாம் முறை நான்) உங்களிடம் வந்தேன். அப்போதும் நீங்கள் எனக்குத் தரவில்லை. ஒன்று நீங்கள் எனக்குக் கொடுக்க வேண்டும். இல்லையென்றால், என்னிடம் நீங்கள் கருமித்தனம் காட்டுவதாகவே நான் கருதுவேன்” என்று சொன்னேன். அப்போது அவர்கள், “நான் கருமித்தனம் காட்டுவதாகவா நீ சொன்னாய். கருமித்தனத்தைவிடக் கொடிய நோய் ஏது?” என்று மூன்று முறை கேட்டார்கள். “ஒவ்வொரு முறை உனக்குத் தர மறுத்தபோதும் உனக்குக் கொடுக்க வேண்டுமென்றே கருதினேன்” என்றும் கூறினார்கள். அம்ர் பின் தீனார் (ரஹ்) அவர்களது அறிவிப்பில், “நான் அபூபக்ர் (ரலி) அவர்களிடம் வந்தேன். அப்போது அவர்கள் என்னிடம், “இதை எண்ணிக்கொள்' என்று சொன்னார்கள். நான் அதை எண்ணிப் பார்த்தேன். அது ஐநூறு (தீனார்/திர்ஹம்) இருந்தது. அப்போது அவர்கள், “இதே போன்று இன்னும் இரண்டு மடங்கை நீ எடுத்துக் கொள்' என்று சொன்னார்கள்” என ஜாபிர் (ரலி) அவர்கள் கூறியதாக வந்துள்ளது.418 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 406
			}
		}
	]
}