{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4385,
			"arabicnumber": 4385,
			"text": "ஸஹ்தம் பின் முளர்ரிப் (ரஹ்) அவர்கள் கூறியதாவது: அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் (உஸ்மான் (ரலி) அவர்களின் ஆட்சிக் காலத்தில் கூஃபா நகரின் ஆட்சியாளராக) வருகை தந்தபோது, இந்த “ஜர்ம்' குடும்பத்தாரைச் (சந்தித்து அவர்களை)க் கண்ணியப்படுத்தினார்கள்.422 (ஒருமுறை) நாங்கள் அவர்களிடம் அமர்ந்திருந்தோம். அப்போது அவர்கள் கோழியைப் பகல் உணவாக உண்டு கொண்டிருந்தார்கள். அப்போது கூட்டத்தில் ஒரு மனிதர் அமர்ந்திருந்தார். அபூமூசா (ரலி) அவர்கள் அவரை உணவு உண்ண அழைத்தார்கள். அம்மனிதர், “இது, (அசுத்தம்) எதையோ தின்றுகொண்டி ருப்பதை நான் பார்த்தேன். ஆகவே, நான் இதை அருவருக்கிறேன்” என்றார். உடனே அபூமூசா (ரலி) அவர்கள், “இங்கே வா! நபி (ஸல்) அவர்கள் இதை உண்பதை நான் பார்த்திருக்கிறேன்” என்று சொன்னார்கள். அம்மனிதர், “நான் இதை உண்ணமாட்டேன் என்று சத்தியம் செய்துள்ளேன்” என்று சொன்னார். உடனே அபூமூசா (ரலி) அவர்கள், “இங்கே வா! உன் சத்தியத்தைப் பற்றி நான் உனக்குத் தெரிவிக்கிறேன். நாங்கள், அஷ்அரீ குலத்தாரில் சிலர் நபி (ஸல்) அவர்களிடம் சென்றோம். நாங்கள் (பயணம் செய்ய) வாகனம் அளித்து உதவும்படி அவர்களிடம் கேட்டோம். அவர்கள் எங்களுக்கு வாகனம் அளிக்க மறுத்துவிட்டார்கள். ஆகவே, மீண்டும் அவர்களிடம் (பயணம் செய்ய) வாகனம் கேட்டோம். அவர்கள், “நீங்கள் பயணம் செய்வதற்காக உங்களுக்கு வாகனம் தரமாட்டேன்” என்று சத்தியம் செய்துவிட்டார்கள். பிறகு சிறிது நேரம்தான் தங்கியிருந்திருப்பார்கள். அதற்குள் போரில் கிடைத்த ஒட்டகங்கள் கொண்டுவரப்பட்டன. எங்களுக்கு (பத்துக்குட்பட்ட ஒட்டகங்கள் கொண்ட மந்தைகளில்) ஐந்து மந்தைகள் வழங்கும்படி கட்டளையிட்டார்கள். நாங்கள் அதை எங்கள் கைவசம் பெற்றுக்கொண்டபோது, “நபி (ஸல்) அவர்களுக்கு அவர்களின் சத்தியத்தை நாம் மறக்கடித்துவிட்டோம். எனவே, நாம் ஒருபோதும் முன்னேற முடியாது” என்று சொல்லிக்கொண்டோம். உடனே நான் அவர்களிடம் சென்று, “அல்லாஹ்வின் தூதரே! நாங்கள் பயணம் செய்ய வாகனம் தரமாட்டேன் என்று தாங்கள் சத்தியம் செய்துவிட்டு இப்போது நாங்கள் பயணம் செய்ய எங்களுக்கு வாகனம் தந்துவிட்டீர்களே” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஆம்! ஆயினும், நான் ஒரு விஷயத்திற்காகச் சத்தியம் செய்து அதன் பின் அதுவல்லாத வேறொன்றை, அதைவிடச் சிறந்ததாகக் கண்டால் அந்தச் சிறந்ததையே செய்வேன் (சத்தியத்தை முறித்ததற்காகப் பரிகாரம் செய்துவிடுவேன்)” என்று சொன்னார்கள்.423 அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 408
			}
		}
	]
}