{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: ஒரு கறுப்பு நிற அடிமைப்பெண் அரபியரில் ஒரு குடும்பத்தாருக்குச் சொந்தமானவளாயிருந்தாள். பின்னர் அவளை அவர்கள் விடுதலை செய்து விட்டனர். ஆயினும், அவர்களுடனேயே அவள் இருந்துவந்தாள். அந்தப் பெண் (தனது வாழ்வில் நடந்த நிகழ்ச்சி ஒன்றை பின்வருமாறு என்னிடம்) கூறினாள்: (ஒரு நாள்) அந்தக் குடும்பத்தைச் சேர்ந்த ஒரு இளம்பெண் (மணமுடித்த புதிதில்) சிவப்புத் தோ-ல் முத்துகள் பதிக்கபட்ட அரையணித் தோள் பட்டிகை அணிந்துகொண்டு (குளியலறைக்குப்) புறப்பட்டாள்.45 அப்போது ‘அவள் அதை (ஓர் இடத்தில் கழற்றி) வைத்தாள்’ அல்லது ‘(எதிர்பாராத விதமாக) அந்தப் பட்டிகை அவளிடமிருந்து (கழன்று) விழுந்துவிட்டது’. கீழே கிடந்த அதைக் கடந்து சென்ற பருந்துக் குஞ்சு ஒன்று, இறைச்சி என்று நினைத்துக் கொத்திச் சென்றுவிட்டது. அவர்கள் அதைத் தேடினர். ஆனால், அவர்களுக்கு அது கிடைக்கவில்லை. அந்தக் குடும்பத்தார் (அதை நான்தான் திருடியிருப்பேன் என்று எண்ணி) என்மீது குற்றம்சாட்டி (என்னை வதைத்த)னர். (எந்த அளவுக்கென்றால்,) எனது பிறவி உறுப்பில்கூட சோதனையிட்டனர். அல்லாஹ்வின் மீது சத்தியமாக! நான் அவர்களுடன் நின்றுகொண்டிருந்தபோது, பறந்துவந்த அந்தப் பருந்துக் குஞ்சு அந்தப் பட்டிகையைக் (கீழே) போட அவர்களுக்கு மத்தியில் அது விழுந்தது. (உடனே) நான் (அவர்களிடம்), “நிரபராதியான என்மீது (திருட்டுக்)குற்றம் சாட்டி, (அதை நான் எடுத்துவிட்டதாக)க் கூறினீர்களே! அந்தப் பட்டிகை இதோ இங்கு இருக்கிறது” என்று சொன்னேன். இதற்குப் பிறகு நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து இஸ்லாத்தைத் தழுவினேன். ஆயிஷா (ரலி) அவர்கள் கூறு கிறார்கள்: (மஸ்ஜிதுந் நபவீ) பள்ளிவாச-ல் அந்தப் பெண்ணுக்கென முடியாலான ஒரு கூடாரம்’ அல்லது ‘சிறிய குடில்’ இருந்தது. (அதில் அவள் வசித்துவந்தாள்.) அந்தப் பெண் என்னிடம் வந்து பேசிக்கொண்டிருப்பார். அவர் என்னிடம் அமர்ந்திருந்த ஒவ்வோர் அமர்வி(ன் முடிவி)லும் (பின்வருமாறு) பாடாமல் அவர் இருந்ததில்லை: எம் இறைவனின் விந்தைப் பட்டி ய-ல் அந்த அரையணிப் பட்டிகை நாளும் ஒன்றே! எனை இறைமறுப்பின் பட்டியி-ருந்து ஈடேற்றிக் காத்த நாளும் அன்றே! (ஒரு நாள்) நான் அவரிடம், “நீ என்னுடன் அமரும்போதெல்லாம் இதை நீ சொல்லாமல் இருப்பதில்லையே! உனக்கு என்ன நேர்ந்தது?” என்று கேட்டேன். அப்போதுதான் அந்தப் பெண் (மேற்கண்ட) அந்தச் செய்தியை என்னிடம் கூறினார். அத்தியாயம் : 8",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		}
	]
}