{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4406,
			"arabicnumber": 4406,
			"text": "அபூபக்ரா நுஃபைஉ பின் அல்ஹாரிஸ் (ரலி) அவர்கள் கூறியதாவது: “வானங்களும் பூமியும் படைக்கப்பட்ட நாளில் இருந்த (பழைய) நிலைக்குக் காலம் திரும்பிவிட்டது. ஆண்டு என்பது பன்னிரண்டு மாதங்களாகும். அவற்றில் நான்கு மாதங்கள் புனிதமானவை. (அவற்றில்) மூன்று மாதங்கள் தொடர்ந்து வரக்கூடியவை. அவை துல்கஅதா, துல்ஹிஜ்ஜா மற்றும் முஹர்ரம் ஆகியனவாகும். (மற்றொன்று) ஜுமாதல் ஆகிராவுக்கும் ஷஅபான் மாதத்திற்கும் இடையிலுள்ள “முளர்' குலத்தாரின் ரஜப் மாதமாகும்” என்று நபி (ஸல்) அவர்கள் சொன்னார்கள்.442 (ஹஜ்ஜத்துல் வதாவின்போது, துல்ஹஜ் பத்தாம் நாளான) நஹ்ருடைய நாளில் நபி (ஸல்) அவர்கள் எங்களுக்கு உரை நிகழ்த்தினார்கள். அப்போது, “இது எந்த மாதம் என்பதை நீங்கள் அறிவீர்களா?” எனக் கேட்டார்கள். நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்றோம். அவர்கள் அந்த மாதத்திற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவுக்கு மௌனமாக இருந்துவிட்டு, “இது துல்ஹிஜ்ஜா மாதம் இல்லையா?” என்று கேட்டார்கள். நாங்கள், “ஆம்' என்றோம். (பிறகு,) “இது எந்த நகரம்?” எனக் கேட்டார்கள். அதற்கு நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்றோம். அப்போதும், அவர்கள் அதற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவுக்கு மௌனமாக இருந்துவிட்டு, “இது (புனிதமிக்க) நகரமல்லவா?” எனக் கேட்க, நாங்கள், “ஆம்' என்றோம். மேலும், “இது எந்த நாள்?” என்று கேட்டார்கள். நாங்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிவர்” என்றோம். அவர்கள் அதற்கு வேறு பெயர் சூட்டுவார்களோ என்று நாங்கள் எண்ணுமளவிற்கு மௌனமாக இருந்துவிட்டு, “இது நஹ்ருடைய (துல்ஹிஜ்ஜா பத்தாம்) நாள் அல்லவா?” எனக் கேட்க, நாங்கள், “ஆம்' என்றோம். (பிறகு,) “உங்களது புனிதமிக்க இந்த நகரத்தில், உங்களின் புனிதமிக்க இந்த மாதத்தில் இன்றைய தினம் எந்த அளவு புனிதமானதோ அந்த அளவுக்கு உங்கள் உயிர்களும் உங்கள் உடைமைகளும் - உங்கள் மானமும் - உங்களுக்குப் புனிதமானவையாகும். நீங்கள் (மறுமையில்) உங்களுடைய இறைவனைச் சந்திப்பீர்கள். அப்போது அவன் உங்களிடம் உங்கள் செயல்கள் குறித்து விசாரணை செய்வான். அறிந்துகொள்ளுங்கள்: எனக்குப் பிறகு ஒருவர் மற்றவரின் கழுத்தை வெட்டி மாய்த்துக்கொள்ளும் வழிதவறியவர்களாய் நீங்கள் மாறிவிடாதீர்கள். இதோ! இங்கு வந்தவர்கள் வராதவர் களுக்கு (நான் சொன்ன கட்டளைகளை) அறிவித்துவிடுங்கள். ஏனெனில், இந்தச் செய்தி எவரிடம் தெரிவிக்கப்படுகிறதோ அவர், தாம் யாரிடமிருந்து இதைக் கேட்டாரோ அவரைவிட (அதாவது தமக்கு இதைச் சொன்னவரைவிட) நன்கு (புரிந்து) பாதுகாப்பவராயிருக்கலாம்.443 -இதன் அறிவிப்பாளர்களில் ஒருவரான முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள் இதை அறிவிக்கும்போது, “முஹம்மத் (ஸல்) அவர்கள் உண்மை சொன்னார்கள்” என்று கூறுவார்கள்.- பிறகு, நபி (ஸல்) அவர்கள், “நான் உங்களிடம் (இறைச்செய்திகள் அனைத்தை யும்) சேர்த்துவிட்டேனா?” என்று இரண்டு முறை கேட்டார்கள். அறிவிப்பாளர்களில் ஒருவரான முஹம்மத் பின் சீரீன் (ரஹ்) அவர்கள்கூறுகிறார்கள்: “உங்கள் மானமும்' என்பதையும் சேர்த்தே அபூபக்ரா (ரலி) அவர்கள் கூறியதாக நான் எண்ணுகிறேன். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 428
			}
		}
	]
}