{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறிய தாவது: என் நண்பர்கள் என்னை அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் சென்று, தமக்காக (பயண) வாகனம் கேட்கும்படி அனுப்பினார்கள். அப்போது அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர் களுடன் உஸ்ரா (போரின்) படையுடன் செல்லவிருந்தனர்- உஸ்ரா போரே தபூக் போராகும்- அப்போது நான், “அல்லாஹ்வின் தூதரே! என் நண்பர்கள் தமக்காக வாகனம் கேட்கும்படி என்னைத் தங்களிடம் அனுப்பிவைத்துள்ளனர்” என்று சொன்னேன். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ் வின் மீதாணையாக! உங்களுக்கு எந்த வாகனத்தையும் என்னால் தரவியலாது” என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபத்திóருந்த சமயத்தில் நான் அவர்களிடம் சென்று விட்டேன். நான் அதை அறிந்திருக்க வில்லை. நபி (ஸல்) அவர்கள் (வாகனம் தர) மறுத்ததாலும் என்மீது அவர்கள் வருத்தம் கொண்டிருப்பார்கள் என்ற அச்சத்தாலும் நான் கவலை கொண்டவனாகத் திரும்பி னேன். நபி (ஸல்) அவர்கள் கூறியதை என் நண்பர்களிடம் வந்து தெரிவித்தேன். சிறிது நேரம்தான் கழிந்திருக்கும். அதற்குள், “அப்துல்லாஹ் பின் கைஸே!” என்று பிலால் (ரலி) அவர்கள் அழைப்பதைக் கேட்டேன். உடனே நான் பதிலளித்தேன். அப்போது அவர்கள், “உங்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைக்கிறார்கள். அவர்களது அழைப்பை ஏற்றுச் செல்லுங்கள்” என்று சொன்னார்கள். நான் நபி (ஸல்) அவர்களிடம் சென்றபோது அவர்கள், “ஒரே ஈற்றில் பிறந்த இந்த இரு ஒட்டகங்களையும், ஒரே ஈற்றில் பிறந்த இந்த இரு ஒட்டகங்களையும்....” என்று ஆறு ஒட்டகங்களைக் காட்டி, “பிடித்துக்கொள்வீராக” என்று சொன் னார்கள். அவற்றை அப்போதுதான் சஅத் பின் உபாதா (ரலி) அவர்களிடமிருந்து விலைக்கு வாங்கியிருந்தார்கள். உங்கள் நண்பர்களிடம் இவற்றை (ஓட்டி)க்கொண்டு சென்று அவர்களிடம், “ அல்லாஹ் அல்லது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இந்த ஒட்டகங்களை உங்கள் பயணத்திற்காக அளித்துள்ளார்கள். எனவே, இவற்றில் ஏறிப் பயணம் செய்யும்படி சொல்லச் சொன்னார்கள்' எனத் தெரிவியுங்கள்” என்று கூறினார்கள். அவர்களிடம் நான் அவற்றை (ஓட்டி)க்கொண்டு சென்று, “நபி (ஸல்) அவர்கள் இவற்றின் மீது உங்களைப் பயணம் செல்லும்படி கூறினார்கள். அல்லாஹ்வின் மீதாணையாக! உங்களில் சிலர் என்னுடன் வந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (“நான் எந்த வாகனமும் தரமாட்டேன்' என்று) கூறியதைக் கேட்டவர்களிடம் விசாரிக்கும்வரையில் உங்களை நான் விடமாட்டேன். ஏனெனில், நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்லாத ஒன்றை உங்களிடம் சொல்லிவிட்டதாக நீங்கள் நினைத்துவிடக் கூடாதல்லவா?” எனக் கூறினேன். அதற்கு என் நண்பர்கள், “(அதற்கெல்லாம் அவசியமில்லை.) உங்களை உண்மையாளர் என்றே நாங்கள் கருதுகிறோம். (இருந்தாலும், நீங்கள் விரும்புகிறீர்கள் என்ற காரணத்தால்) நீங்கள் விரும்பியபடி நாங்கள் செய்கிறோம்” என்று சொன்னார் கள். நான் அவர்களில் சிலரை அழைத்துக்கொண்டு, “நான் அவர்களுக்குத் தரமாட்டேன்” என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முதóல்) மறுத்ததையும், பிறகு அவர்களே தந்ததையும் அறிந்த சிலரிடம் அழைத்துச் சென்றேன். அப்போது அந்தச் சிலர், நான் மக்களிடம் சொன்னதைப் போன்றே கூறினார்கள். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 437
			}
		}
	]
}