{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4418,
			"arabicnumber": 4418,
			"text": "கஅப் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: தபூக் போரைத் தவிர, நபி (ஸல்) அவர்கள் புரிந்த எந்தப் போரிலும் நான் கலந்துகொள்ளாமல் இருந்ததில்லை. தவிரவும் நான் பத்ர் போரிலும் கலந்து கொள்ளவில்லை. இருப்பினும் பத்ரில் கலந்துகொள்ளாத எவரும் (அல்லாஹ்வால்) கண்டிக்கப்படவில்லை. (ஏனெனில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குறைஷியரின் வணிகக் குழுவை (வழி மறிக்க) நாடியே (பத்ருக்குப்) போனார்கள். (போன இடத்தில்) போர் செய்யும் திட்டம் இல்லாமலேயே அவர்களையும் எதிரிகளையும் அல்லாஹ் (பத்ர் களத்தில்) சந்திக்கும்படி செய்துவிட்டான்.455 “இஸ்லாத்தில் நாங்கள் நிலைத்திருப் போம்' என (அன்சாரிகளான) நாங்கள் உறுதிமொழி அளித்த “அகபா இரவில்' அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் நானும் இருந்தேன். இதற்குப் பதிலாக பத்ர் போரில் கலந்துகொள்ளும் வாய்ப்பு எனக்குக் கிடைத்திருக்க வேண்டும் என நான் விரும்பியதில்லை; “அல்அகபா' பிரமாணத்தைவிட “பத்ர்', மக்களிடையே பெயர்பெற்றதாக இருந்தாலும் சரியே!456 (தபூக் போரில் கலந்துகொள்ளாததையடுத்து நடந்த நிகழ்ச்சிகள் குறித்த) எனது செய்திகள் சில பின்வருமாறு: அந்த (தபூக்) போரில் நான் கலந்துகொள்ளாதபோது இருந்த உடல் பலமும் பொருள் வசதியும் (என் வாழ்நாளில்) வேறெப்போதும் எனக்கு இருந்ததில்லை. அல்லாஹ்வின் மீதாணையாக! ஒரே நேரத்தில் இரண்டு ஒட்டகங்கள் ஒரு போதும் என்னிடம் இருந்ததில்லை. ஆனால், அந்தப் போரின்போது ஒரே நேரத்தில் இரண்டு ஒட்டகங்களை நான் வைத்திருந்தேன். மேலும், அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் ஓர் அறப்போருக்குச் செல்ல நாடினால் (பெரும்பாலும்) வேறெதற்கோ செல்வது போன்று (இரு பொருள்படும்படி பேசிப் பாசாங்கு செய்து) அதை மறைக்காமல் இருந்ததில்லை.457 ஆனால், தபூக் போர் (நேரம்) வந்தபோது அதற்காகக் கடும் வெயிலில் நபி (ஸல்) அவர்கள் படையெடுத்துச் செல்லவிருந்தார்கள். தொலைதூரப் பயணம் மேற்கொள்ள வேண்டியிருக்கும் என்றும், பெரும் (பாலைவன) வனாந்திரப் பிரதேசத்தைக் கடந்து செல்ல வேண்டியிருக்கும் என்றும், அதிக (எண்ணிக்கையிலான) எதிரிகளைச் சந்திக்க வேண்டியிருக்கும் என்றும் எதிர்பார்த்தார்கள். எனவே, முஸ்லிம்களுக்கு அவர்கள் எதிர்கொள்ள வேண்டியது பற்றி வெளிப்படையாகவே தெரிவித்துவிட்டார்கள். அப்போதுதான் அவர்கள் தங்களின் போருக்கான ஆயத்த ஏற்பாடுகளைச் செய்துகொள்ள முடியும். தாம் விரும்பிய திசையை (தபூக்கை) அவர்களுக்குத் தெரிவித்தும்விட்டார்கள்.458 “எழுதப்படும் எந்தப் பதிவேடும் இத்தனைப் பேருக்கு இடமளிக்காது' எனும் அளவுக்கு முஸ்லிம்கள் பெரும் எண்ணிக்கையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் இருந்தார்கள். (போரில் கலந்துகொள்ளாமல்) தலைமறைவாகிவிடலாமென நினைக்கும் எந்த மனிதரும், அல்லாஹ்விடமிருந்து இறைஅறிவிப்பு (வஹீ) வராத வரையில், (தாம் போருக்கு வராத) விஷயம் நபி (ஸல்) அவர்களுக்குத் தெரியவராது என்று எண்ணவே செய்வார். (அந்த அளவுக்குப் படையினரின் எண்ணிக்கை மிகுந்திருந் தது. பேரீச்சம்) பழங்கள் பழுத்து மர நிழல்கள் அடர்ந்து நின்ற (அறுவடைக் காலமான அந்த வெப்பம் மிகுந்த வெயில்) காலத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தப் போருக்குச் செல்ல ஆயத்தமானார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும், அவர்களுடன் முஸ்óம்களும் பயண ஏற்பாடுகளைச் செய்துகொண்டி ருந்தனர். நானும் அவர்களுடன் சேர்ந்துகொண்டு பயண ஏற்பாடுகளைச் செய்யக் காலை நேரத்தில் செல்லலானேன். எனது பயணத்திற்கான எந்த ஏற்பாட்டை யும் செய்து முடிக்காமல் திரும்பி வந்துவிடுவேன். “(நினைக்கும்போது) அந்த ஏற்பாடுகளைச் செய்து முடிக்க எனக்குத்தான் சக்தியிருக்கிறதே! (பிறகு நான் ஏன் அவசரப்பட வேண்டும்?)' என்று என் மனத்திற்குள் கூறிக்கொண்டேன். என் நிலை இப்படியே நீடித்துக்கொண்டிருந்தது. மக்கள் (ஆயத்தப் பணிகளில்) மும்முரமாக ஈடுபட்டனர். (ஒரு வழியாகப் பயண ஏற்பாடு முடிந்தது.) பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தம்முடன் முஸ்óம்களை அழைத்துக்கொண்டு (ஒரு) காலை நேரத்தில் புறப்பட்டுவிட்டார்கள். அப்போதும் நான் எனது பயணத்திற்கு வேண்டிய எந்த ஏற்பாட்டையும் செய்து முடித்திருக்கவில்லை. “நபி (ஸல்) அவர்கள் சென்றபின் ஒரு நாள் அல்லது இரண்டு நாட்களில் பயண ஏற்பாடுகளைச் செய்துகொண்டு அவர்களுடன் போய்ச் சேர்ந்துகொள்வேன்' என்று நான் (என் மனத்திற்குள்) சொல்லிக்கொண்டேன். அவர்கள் அனைவரும் சென்றபிறகு (அன்றைய இரவும் கழிந்து) மறுநாள் காலை பயண ஏற்பாடுகளைச் செய்ய நினைத்தேன். ஆனால், அன்றைய தினமும் எந்த ஏற்பாட்டையும் செய்து முடிக்காமல் திரும்பி வந்தேன். அதற்கு அடுத்த நாள் காலையிலும் நினைத்தேன். அன்றும் எந்த ஏற்பாடும் செய்து முடிக்கவில்லை. (இன்று, நாளை என்று) எனது நிலை இழுபட்டுக்கொண்டே சென்றது. முஸ்லிம்கள் விரைவாகப் புறப்பட்டுச் சென்றுவிட்டனர். (எனக்கு) அந்தப் போர் கைநழுவி விட்டது. நான் உடனடியாகப் புறப் பட்டுச் சென்று படையினருடன் சேர்ந்து கொள்ளலாம் என்று நினைத்தேன். அப்படி நான் செய்திருந்தால் நன்றாக இருந்திருக்கும். (ஆனால், என்ன செய்வது?) அது என் விதியில் எழுதப் பட்டிருக்கவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் போருக்குச் சென்றதன் பின்னால், மதீனா வில் நான் மக்களிடையே சுற்றி வரும்போது எனக்குப் பெரும் வருத்தமே ஏற்பட்டது. நயவஞ்சகர் எனச் சந்தேகிக்கப்பட்ட மனிதர்களையும் இறைவனால் சலுகை வழங்கப்பட்ட (முதியோர், பெண்கள் போன்ற) பலவீனர்களையும் தவிர வேறெவரையும் நான் (மதீனாவிற்குள்) பார்க்கவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தபூக் சென்றடையும்வரையில் என்னை நினைவுகூரவேயில்லை. தபூக்கில் மக்க ளிடையே அமர்ந்துகொண்டிருக்கும் போதுதான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “கஅப் என்ன ஆனார்?” என்று கேட்டார்கள். பனூ சலிமா குலத்தைச் சேர்ந்த ஒரு மனிதர், “அல்லாஹ்வின் தூதரே! அவரின் இரு சால்வைகளும் (ஆடை அணிகலன்களும்) அவற்றைத் தம் தோள்களில் போட்டு அவர் (அழகு) பார்த்துக்கொண்டிருப்பதும்தான் அவரை வர விடாமல் தடுத்துவிட்டன” என்று கூறினார். உடனே முஆத் பின் ஜபல் (ரலி) அவர்கள், (அந்த மனிதரை நோக்கி), “தீய வார்த்தை சொன்னாய். அல்லாஹ்வின் மேல் ஆணையாக! அவரைக் குறித்து நல்லதைத் தவிர வேறெதையும் நாங்கள் அறிந்திருக்கவில்லை; அல்லாஹ்வின் தூதரே!” என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பதிலேதும் கூறாமல்) மௌனமாகவே இருந்தார்கள். நபி (ஸல்) அவர்கள் (தபூக்கிலிருந்து) திரும்பி வந்துகொண்டிருக்கிறார்கள் என்ற செய்தி எனக்கு எட்டியபோது கவலை என் மனத்தில் (குடி) புகுந்தது. (அல்லாஹ்வின் தூதரிடம் சாக்குப் போக்குச் சொல்வதற்காகப்) பொய்யான காரணங்களை நான் யோசிக்கத் தொடங்கினேன். “நாளை நபியவர்களின் கோபத்திலிருந்து நான் எப்படித் தப்புவேன்?” என்று எனக்கு நானே கேட்டுக்கொண்டேன். மேலும், அதற்காக நான் என் குடும்பத்தாரில் கருத்துள்ள ஒவ்வொருவரிடமும் (ஆலோசனை) உதவி தேடினேன். ஆனால், அல்லாஹ்வின் தூதர் (ஸல்)அவர்கள் (மதீனாவை) நெருங்கி வந்துவிட்டார்கள் என்று (செய்தி) சொல்லப் பட்டபோது (நான் புனைந்துவைத்திருந்த) பொய்மை என் மனத்தைவிட்டு விலகி விட்டது. “பொய்யான காரணம் எதையும் சொல்லி நபி (ஸல்) அவர்களிடமிருந்து ஒருபோதும் தப்பித்துக்கொள்ள முடியாது. (அல்லாஹ் எல்லாவற்றையும் அறிந்தவன். அவன் தன் தூதருக்கு உண்மை நிலவரத் தைத் தெரிவித்துவிடுவான்)' என்று உணர்ந்து, நபி (ஸல்) அவர்களிடம் உண்மையைச் சொல்லிவிட முடிவு செய்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் காலை நேரத்தில் (மதீனாவிற்கு) வருகை புரிந்தார்கள். (பொதுவாக) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு பயணத்திலிருந்து திரும்பி வந்தால் முதலில் பள்ளிவாசலுக்குச் சென்று அங்கு இரண்டு ரக்அத்கள் தொழுதபின் மக்களைச் சந்திப்பதற்காக (அங்கு) அமர்ந்துகொள்வது அவர்களின் வழக்கம். (வழக்கம்போல்) அதை அவர்கள் செய்தபோது, (தபூக் போரில் கலந்துகொள்ளச் செல்லாமல்) பின்தங்கிவிட்டவர்கள் அவர்களிடம் வந்து, அவர்களுக்கு முன்னால் சத்தியமிட்டு (தாம் போருக்கு வராமல்போனதற்கு) சாக்குப்போக்குக் கூறத் தொடங்கினர். அவர்கள் எண்பதுக்கும் மேற்பட்ட நபர்களாக இருந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அவர்களின் வெளிப்படையான காரணங்களை ஏற்றுக்கொண்டு அவர்களிடம் உறுதிப் பிரமாணம் செய்து கொடுத்தார்கள். அவர்களுக்காகப் பாவமன்னிப்பும் தேடினார்கள். அவர்களின் அந்தரங்கத்தை அல்லாஹ்விடம் ஒப்படைத்துவிட்டார்கள். அப்போது, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தேன். அவர்களுக்கு நான் சலாம் சொன்னபோது கோபத்திóருப்பவர் எவ்வாறு புன்னகைப் பாரோ அதுபோலப் புன்னகைத்தார்கள். பிறகு, “வாருங்கள்” என்று கூறினார்கள். உடனே நான் அவர்களிடம் (சில எட்டுகள் வைத்து) நடந்து சென்று அவர்களின் முன்னிலையில் அமர்ந்துகொண்டேன். அப்போது அவர்கள் என்னிடம், “(போரில்) நீர் ஏன் கலந்துகொள்ளவில்லை. நீர் (போருக்காக) வாகனம் வாங்கிவைத்திருந்தீர் அல்லவா?” என்று கேட்டார்கள். நான், “ஆம். (வாங்கிவைத்திருந்தேன்.) அல்லாஹ்வின் மீதாணையாக! தாங்கள் அல்லாத (வேறு எவரேனும் ஓர்) உலகாதாயவாதிக்கு அருகில் நான் அமர்ந்துகொண்டிருந்தால் ஏதாவது (பொய்யான) சாக்குப்போக்குச் சொல்லி (அவரது) கோபத்திலிருந்து தப்பித்துக் கொள்ள உடனடியாக வழி கண்டிருப்பேன். (எவராலும் வெல்ல முடியாத) வாதத்திறன் எனக்கு வழங்கப்பட்டுள்ளது. ஆயினும், அல்லாஹ்வின் மீதாணையாக! தங்களிடம் ஏதாவது பொய்யைச் சொல்லி இன்று உங்களை நான் என்னைக் குறித்துத் திருப்தியடையச் செய்துவிட்டாலும், அல்லாஹ் வெகுவிரைவில் (உண்மை நிலவரத்தைத் தங்களுக்குத் தெரியப்படுத்தி) என்மீது தங்களைக் கடுங்கோபம் கொள்ளச் செய்துவிடுவான் என்பதை நான் நன்கு அறிந்துள்ளேன். (அதே சமயம்) தங்களிடம் நான் உண்மையைச் சொல்லிவிட்டால் (தற்சமயம்) அது தொடர்பாக என்மீது தாங்கள் வருத்தப்படுவீர்கள். ஆயினும், அது விஷயத்தில் அல்லாஹ்வின் மன்னிப்பை நான் எதிர்பார்க்கிறேன். இல்லை; அல்லாஹ்வின் மீதாணையாக! (நான் போரில் கலந்துகொள்ளாததற்கு) என்னிடம் எந்தக் காரணமும் இல்லை. அல்லாஹ்வின் மீதாணையாக! தங்களை விட்டு நான் பின்தங்கிவிட்ட அந்த நேரத்தில் எனக்கு இருந்த உடல் பலமும் வசதி வாய்ப்பும் அதற்குமுன் ஒருபோதும் எனக்கு இருந்ததில்லை” என்று கூறினேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இவர் உண்மை சொல்லிவிட்டார்” (என்று கூறிவிட்டு என்னை நோக்கி) சரி! எழுந்து செல்லுங்கள். உங்கள் விஷயத்தில் அல்லாஹ்வே தீர்ப்பளிப்பான்” என்று கூறினார்கள். உடனே நான் எழுந்து சென்றேன். பனூ சலிமா குலத்தைச் சேர்ந்த சிலர் என்னைப் பின்தொடர்ந்து ஓடி வந்து, “அல்லாஹ்வின் மீதாணையாக! இதற்கு முன்னால் எந்தப் பாவத்தையும் நீங்கள் செய்ததாக நாங்கள் அறிந்ததில்லை. (போரில்) கலந்துகொள்ளாத (மற்ற)வர்கள் சொன்ன அதே (பொய்க்) காரணத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சொல்வதற்குக்கூட உங்களால் இயலாமல் போய்விட்டதே! நீங்கள் செய்த பாவத்திற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கேட்கும் பாவமன்னிப்பே உங்களுக்குப் போதுமானதாய் இருந்திருக்குமே!” என்று சொன்னார்கள். அல்லாஹ்வின் மீதாணையாக! பனூ சலிமா குலத்தார் என்னைக் கடுமையாக ஏசிக்கொண்டேயிருந்தனர். எந்த அளவுக் கென்றால், நான் (அல்லாஹ்வின் தூதரிடம்) திரும்பிச் சென்று (இதற்குமுன்) நான் சொன்னது பொய் என்று (கூறி, போரில் கலந்துகொள்ளாததற்கு ஏதாவது பொய்க் காரணத்தைச்) சொல்லிவிடலாமா என்றுகூட நான் நினைத்தேன். பிறகு நான் பனூ சலிமா குலத்தாரை நோக்கி, “(தீர்ப்பு தள்ளிவைக்கப்பட்ட) இந்த நிலையை என்னுடன் வேறு யாரேனும் சந்தித்திருக்கிறார்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “ஆம். இரண்டு பேர் நீங்கள் சொன்னதைப் போன்றே (உண்மையான காரணத்தை நபியவர்களிடம்) சொன்னார்கள். உங்களுக்குச் சொல்லப்பட்டதுதான் அப்போது அவர்கள் இருவருக்கும் (பதிலாகச்) சொல்லப்பட்டது” என்று கூறினார்கள். அப்போது நான், “அவர்கள் இருவரும் யார்?” என்று கேட்டேன். அதற்கு அவர்கள், “முராரா பின் ரபீஉ அல்அம்ரீ அவர்களும், ஹிலால் பின் உமய்யா அல்வாக்கிஃபீ அவர்களும்” என்று பத்ர் போரில் கலந்துகொண்ட இரண்டு நல்ல மனிதர்களின் பெயர்களை என்னிடம் கூறினர். அவர்கள் இருவராலும் (எனக்கு) ஆறுதல் கிடைத்தது. அவர்கள் இருவரின் பெயர்களையும் பனூ சலிமா குலத்தார் என்னிடம் சொன்னவுடன் நான் (என் இல்லத்திற்குச்) சென்றுவிட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தப் போரில் கலந்துகொள்ளாதவர்களில் எங்கள் மூவரிடம் மட்டும் (யாரும்) பேசக் கூடாதென முஸ்லிம்களுக்குத் தடை விதித்துவிட்டார்கள். எனவே, மக்கள் எங்களைத் தவிர்த்தனர். மேலும், அவர்கள் (முற்றிலும்) எங்கள் விஷயத்தில் மாறிப்போய்விட்டனர். (வெறுத்துப் போனதால்) என் விஷயத்தில் இப்புவியே மாறிவிட்டது போலவும் அது எனக்கு அந்நியமானது போலவும் நான் கருதினேன். இதே நிலையில் நாங்கள் ஐம்பது நாட்கள் இருந்தோம். என் இரு சகாக்களும் (முராராவும், ஹிலாலும்) செயலிழந்துபோய்த் தம் இல்லங்களிலேயே அமர்ந்துகொண்டு அழுதுகொண்டிருந்தனர். ஆனால் நான், மக்களிடையே (உடல்) பலம் மிக்கவனாகவும் (மன) வலிமை படைத்தவனாகவும் இருந்தேன். எனவே, நான் (வீட்டைவிட்டு) வெளியேறி முஸ்óம்களுடன் (ஐங்காலத்) தொழுகையில் கலந்துகொண்டும், கடைவீதிகளில் சுற்றிக்கொண்டுமிருந்தேன். என்னிடம் எவரும் பேசமாட்டார்கள். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் செல்வேன். தொழுகையை முடித்துக்கொண்டு அவர்கள் அமர்ந்திருக்கும்போது சலாம் கூறுவேன். எனக்குப் பதில் சலாம் சொல்வதற்காக அவர்கள், தம் உதடுகளை அசைக்கிறார்களா இல்லையா என்று எனக்கு நானே கேட்டுக்கொள்வேன். பிறகு, அவர்களுக்கு அருகிலேயே (கூடுதலான) தொழுகைகளை நிறைவேற்றுவேன். அப்போது (என்னை நபி (ஸல்) அவர்கள் பார்க்கிறார்களா என்று) ஓரக் கண்ணால் இரகசியமாகப் பார்ப்பேன். நான் என் தொழுகையில் ஈடுபட்டவுடன் அவர்கள் என்னைக் கவனிப்பதும், அவர்கள் பக்கம் நான் திரும்பியதும் அவர்கள் என்னிடமிருந்து முகத்தைத் திருப்பிக்கொள்வதுமாக இருந்தார்கள். மக்களின் புறக்கணிப்பு நீடித்துக் கொண்டே சென்றபோது, நான் நடந்து போய் அபூகத்தாதா (ரலி) அவர்களின் தோட்டத்தின் மதில் சுவர்மீது ஏறினேன். -அவர் என் தந்தையின் சகோதரர் புதல்வரும், மக்களில் எனக்கு மிகவும் பிரியமானவரும் ஆவார்- அவருக்கு நான் சலாம் சொன்னேன். அல்லாஹ்வின் மீதாணையாக! அவர் எனக்குப் பதில் சலாம் சொல்லவில்லை. உடனே நான், “அபூகத்தாதா! அல்லாஹ்வை முன்வைத்து உம்மிடம் கேட்கிறேன். அல்லாஹ்வையும் அவனுடைய தூதரையும் நான் நேசிக்கி றேன் என்று நீர் அறிவீர்தானே?” என்று கேட்டேன். அதற்கு அவர் (பதிலேதும் கூறாமல்) மௌனமாயிருந்தார். பிறகு மீண்டும் அவரிடம் அல்லாஹ்வை முன்வைத்து (முன்பு போலவே) கேட்டேன். அப்போதும் அவர் மௌனமாகவேயிருந்தார். (மூன்றாம் முறையாக) மீண்டும் அவரிடம் நான் அல்லாஹ்வை முன்வைத்துக் கேட்டேன். அப்போது அவர், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்” என்று (மட்டும்) பதிலளித்தார். அப்போது என் இரு கண்களும் (கண்ணீரைப்) பொழிந்தன. பிறகு நான் திரும்பி வந்து அந்தச் சுவரில் ஏறி (வெளியேறி)னேன். (நிலைமை இவ்வாறு நீடித்துக்கொண்டிருக்க) ஒருநாள் மதீனாவின் கடைத் தெருவில் நடந்து சென்றுகொண்டிருந்தேன். அப்போது மதீனாவிற்கு உணவு தானிய விற்பனைக்காக வந்திருந்த ஷாம் (சிரியா) நாட்டு விவசாயிகளில் ஒருவர், “கஅப் பின் மாலிக்கை எனக்கு அறிவித்துத் தருபவர் யார்?” என்று (என்னைக் குறித்து) விசாரித்துக்கொண்டிருந்தார். மக்கள் (என்னை நோக்கி) அவரிடம் சைகை செய்யலாயினர். உடனே அவர் என்னிடம் வந்து, “ஃகஸ்ஸான்' நாட்டின் அரசனிடமிருந்து (எனக்கு எழுதப் பட்டிருந்த) கடிதமொன்றைத் தந்தார். அதில் பின்வருமாறு எழுதப்பட்டிருந்தது: நிற்க! உங்கள் தோழர் (முஹம்மத்) உங்களைப் புறக்கணித்து (ஒதுக்கி)விட்டார் என்று எனக்குச் செய்தி எட்டியது. உங்களை இழிவு செய்து (உங்கள் உரிமைகள்) வீணடிக்கப்படும் நாட்டில் நீங்கள் நீடிக்க வேண்டுமென்ற அவசியத்தை உங்களுக்கு அல்லாஹ் ஏற்படுத்தவில்லை. எனவே, எங்களிடம் வந்துவிடுங்கள். நாங்கள் உங்களிடம் நேசம் காட்டுகிறோம். இதை நான் படித்தபோது, “இது இன்னொரு சோதனையாயிற்றே!” என்று (என் மனதிற்குள்) கூறிக்கொண்டு அதை எடுத்துச் சென்று (ரொட்டி சுடும்) அடுப்பிலிட்டு எரித்துவிட்டேன். ஐம்பது நாட்களில் நாற்பது நாட்கள் கழிந்தபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய ஒரு தூதர் என்னிடம் வந்து, “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நீங்கள் உங்கள் மனைவி யிடமிருந்து விலகிவிட வேண்டுமென்று உத்தரவிடுகிறார்கள்” என்று கூறினார். அதற்கு நான், “அவரை நான் மணவிலக்குச் செய்துவிடவா? அல்லது நான் என்ன செய்ய வேண்டும்?” என்று கேட்டேன். அவர், “இல்லை. (விவாகரத்துச் செய்ய வேண்டாம்.) அவரைவிட்டு நீங்கள் விலகிவிட வேண்டும். அவரை நெருங்கக் கூடாது (இதுவே இறைத்தூதர் உத்தரவு)” என்று கூறினார். இதைப் போன்றே என் இரு சகாக்களுக்கும் (நபி (ஸல்) அவர்கள் உத்தரவு) அனுப்பியிருந்தார்கள். ஆகவே, நான் என் மனைவியிடம், “உன் குடும்பத்தாரிடம் சென்று, இது விஷயத்தில் அல்லாஹ் தீர்ப்பளிக்கும்வரையில் அவர்களுடனேயே இருந்து வா!” என்று சொன்னேன். (என் சகா) ஹிலால் பின் உமய்யா (ரலி) அவர்களின் மனைவி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, “(என் கணவர்) ஹிலால் பின் உமய்யா செயல்பட முடியாத வயோதிகர். அவரிடம் ஊழியர் யாருமில்லை. நானே (தொடர்ந்து) அவருக்கு ஊழியம் செய்வதைத் தாங்கள் வெறுப்பீர்களா?” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “இல்லை. ஆயினும், அவர் உன்னை (தாம்பத்திய உறவு கொள்ள) நெருங்க வேண்டாம்” என்று சொன்னார்கள். ஹிலால் அவர்களின் மனைவி, “அல்லாஹ்வின் மீதாணையாக! என் கணவரிடம் எந்த இயக்கமும் இல்லை. அல்லாஹ்வின் மீதாணையாக! அவருடைய விஷயத்தில் இந்த நிகழ்ச்சி நடைபெற்றதிலிருந்து இந்த நாள்வரையில் அழுதுகொண்டேயிருக்கிறார்” என்றும் (அல்லாஹ்வின் தூதரிடம்) கூறினார். கஅப் (ரலி) அவர்கள் கூறுகிறார்கள்: என் வீட்டாரில் ஒருவர், “தம் கணவ ருக்குப் பணிவிடை புரிய ஹிலால் பின் உமய்யா அவர்களின் மனைவியை அனுமதித்ததுபோல், உங்கள் மனைவியை (உங்களுக்குப் பணிவிடை புரிய) அனுமதிக்கும்படி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்டால் (நன்றாயிருக்குமே)” என்று கூறினார். அதற்கு நான், “அல்லாஹ்வின் மீதாணையாக! என் மனைவி விஷயத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் அனுமதி கேட்கமாட்டேன். என் மனைவி விஷயத்தில் நான் அனுமதி கோரும்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்ன (பதில்) சொல்வார்கள் என்று எனக்குத் தெரியவில்லை. நானோ இளைஞனாக (வேறு) இருக்கிறேன். (ஹிலால், வயோதிகர். அதனால் அவருக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சலுகை காட்டியிருக்கலாம்)” என்று கூறி (மறுத்து)விட்டேன். அதற்குப்பின் பத்து நாட்கள் (இவ்வாறே) இருந்தேன். எங்களிடம் பேசக் கூடாதென அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தடை விதித்த நாளிலிருந்து ஐம்பது நாட்கள் எங்களுக்குப் பூர்த்தியாயின. நான் ஐம்பதாம் நாளின் ஃபஜ்ர் தொழுகையை எங்கள் வீடுகளில் ஒன்றின் மாடியில் நிறைவேற்றிவிட்டு அல்லாஹ் (எங்கள் மூவரையும் குறித்து 9:118ஆவது வசனத்தில்) குறிப்பிட்ட நிலையில் அமர்ந்திருந்தேன். (அதாவது:) “பூமி இத்தனை விரிவாய் இருந்தும் என்னைப் பொறுத்தவரை அது குறுகி, நான் உயிர் வாழ்வதே மிகக் கஷ்டமாயிருந்தது. அப்போது, “சல்உ' மலைமீதேறிப் பொது அறிவிப்புச் செய்பவர் ஒருவர் உரத்த குரலில், “கஅப் பின் மாóக்கே! உமக்கு ஒரு நற்செய்தி!” என்று கூறினார். உடனே நான் சஜ்தாவில் விழுந் தேன். விடிவுகாலம் வந்துவிட்டது என்று நான் அறிந்துகொண்டேன். “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஃபஜ்ர் தொழுதுகொண்டிருந்தபோது (வஹீ அறிவிக்கப்பட்டு) எங்களை அல்லாஹ் மன்னித்துவிட்டான் என்று அறிவித்துவிட்டார்கள்' என நான் விளங்கிக்கொண்டேன். எங்களுக்கு நல்வாழ்த்துச் சொல்ல மக்கள் வரலாயினர். என் இரு சகாக்களை நோக்கி நற்செய்தி சொல்பவர்கள் சென்றனர். என்னை நோக்கி ஒருவர் குதிரையில் விரைந்து வந்தார். அஸ்லம் குலத்தைச் சேர்ந்த ஒருவர் ஓடிச் சென்று மலைமீது ஏறிக்கொண்டார். (மேலும், உரத்த குரலில் எனக்கு நற்செய்தி சொன்னார்.) மேலும், (மலைமீதிருந்து வந்த) அந்தக் குரல் அக்குதிரையைவிட வேகமாக வந்து சேர்ந்தது. எவரது குரலை (மலைமீதிருந்து) கேட்டேனோ அவர் என்னிடம் நற்செய்தி சொல்ல (நேரடியாக) வந்தபோது நான் என் இரு ஆடைகளையும் கழற்றி அவர் சொன்ன நற்செய்திக்குப் பதிலாக (பரிசாக) அவருக்கு அணிவித்தேன். அல்லாஹ்வின் மீதாணையாக! (அந்த வகை ஆடைகளில்) அந்த இரண்டைத் தவிர வேறெதுவும் அப்போது எனக்குச் சொந்தமானதாய் இருக்கவில்லை. (வேறு) இரண்டு ஆடைகளை (அபூகத்தாதா அவர்களிடமிருந்து) இரவல் வாங்கி நான் அணிந்துகொண்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நோக்கி நடந்தேன். அப்போது (வழியில்) மக்கள் கூட்டங்கூட்டமாக வந்து என்னைச் சந்தித்து, எனக்குப் பாவமன்னிப்புக் கிடைத்ததால், “அல்லாஹ் உங்கள் பாவத்தை மன்னித்து விட்டதற்காக உங்களுக்கு வாழ்த்துச் சொல்கிறோம்” என்று கூறலாயினர். நான் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலுக்குள் நுழைந்தேன். அங்கு தம்மைச் சுற்றிலும் மக்கள் இருக்க அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்திருந்தார்கள். அப்போது என்னை நோக்கி தல்ஹா பின் உபைதில்லாஹ் (ரலி) அவர்கள் எழுந் தோடி வந்து எனக்குக் கைலாகு கொடுத்து என்னை வாழ்த்தவும் செய்தார்கள். அல்லாஹ்வின் மீதாணையாக! முஹாஜிர்களில் அவர்களைத் தவிர வேறெவரும் என்னை நோக்கி (வருவ தற்காக) எழவில்லை. தல்ஹா (ரலி) அவர் களின் இந்த அன்பை நான் ஒருபோதும் மறக்கமாட்டேன். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு சலாம் சொன்னபோது, மகிழ்ச்சியால் அவர்கள் தம் முகம் மின்னிக்கொண்டிருக்க அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உம்மை உம்முடைய தாய் பெற்றெடுத்தது முதல் உம்மைக் கடந்து சென்ற நாட்களில் மிகச் சிறந்த நாளான இன்று உமக்கு (பாவமன்னிப்புக் கிடைத்த) நற்செய்தி கூறுகிறேன்” என்று கூறினார்கள். நான், “அல்லாஹ்வின் தூதரே! (இந்த நற்செய்தியைத்) தாங்களே தங்கள் தரப்பிலிருந்து தெரிவிக்கிறீர்களா? அல்லது அல்லாஹ்வின் தரப்பிலிருந்து (வந்த வேதஅறிவிப்பின் அடிப்படையில்) தெரிவிக்கிறீர்களா?” என்று கேட்டேன். அவர்கள், “இல்லை. (என் தரப்பிலிருந்து நான் இதைத் தெரிவிக்கவில்லை.) அல்லாஹ்வின் தரப்பிலிருந்து (வந்துள்ள வேதஅறிவிப்பின் அடிப்படையில்)தான் தெரிவிக்கிறேன்” என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு (ஏதாவது) மகிழ்ச்சி ஏற்படும்போது அவர்களது முகம் சந்திரனின் ஒரு துண்டுபோல் பிரகாசிக்கும். அவர்களது முகத்தின் பிரகாசத்தை வைத்து அவர்களது சந்தோஷத்தை நாங்கள் அறிந்துகொள்வோம்.459 அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முன்னால் நான் அமர்ந்துகொண்டபோது, “அல்லாஹ்வின் தூதரே! எனது பாவம் மன்னிக்கப்பட்டதற்காக என் செல்வங்கள் அனைத்தையும் அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் (அவர்கள் விரும்பும் வழியில் செலவிட்டுக்கொள்வ தற்காக) தர்மமாக அளித்துவிடுகிறேன்” என்று சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “உங்கள் செல்வத்தில் சிறிதளவை உங்களுக்காக வைத்துக்கொள்ளுங்கள். அதுவே உங்களுக்கு நல்லது” என்று கூறினார்கள். “கைபர் போரில் எனக்குக் கிடைத்த பங்கை நான் (எனக்காக) வைத்துக் கொள்கிறேன்.460 அல்லாஹ்வின் தூதரே! உண்மை பேசிய காரணத்தால்தான் அல்லாஹ் என்னைக் காப்பாற்றினான். (உண்மைக்குக் கிடைத்த பரிசாக) என் பாவம் மன்னிக்கப்பட்டதையடுத்து நான் உயிரோடு வாழும்வரையில் உண்மையைத் தவிர வேறெதையும் பேசமாட்டேன்” என்று கூறினேன். ஆகவே, அல்லாஹ்வின் மீதாணையாக! நான் இந்த வார்த்தையை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறிய நாளிலிருந்து உண்மை பேசியதற்காக எனக்கு அல்லாஹ் அருள் புரிந்ததைப் போன்று வேறெந்த முஸ்óமுக்கும் அல்லாஹ் அருள் புரிந்ததாக நான் அறியவில்லை. இந்த உறுதிமொழியை நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சொன்ன நாளிலிருந்து எனது இந்த நாள்வரை நான் பொய்யை நினைத்துப் பார்த்ததுகூட இல்லை. நான் (உயிரோடு) எஞ்சியிருக்கும் கால(மனை)த்திலும் அல்லாஹ் என்னைப் (பொய் சொல்ல விடாமல்) பாதுகாப்பான் என்று நான் உறுதியாக நம்புகிறேன். மேலும், தன் தூதர் (ஸல்) அவர்களுக்கு அல்லாஹ், “நிச்சயமாக அல்லாஹ், இந்த நபியையும் நெருக்கடியான நேரத்தில் அவரைப் பின்பற்றிய முஹாஜிர்கள் மற்றும் அன்சாரிகளையும் அவர்களில் ஒரு பிரிவினரின் உள்ளங்கள் பிறழ முற்பட்ட பின்னரும் மன்னித்துவிட்டான். மறுபடியும் அவர்களை மன்னித்தான். நிச்சயமாக அவர்கள்மீது அவன் பரிவுடையவனும் மிகுந்த கருணையாளனும் ஆவான். (தீர்ப்பு) ஒத்திவைக்கப்பட்டிருந்த அந்த மூவரையும் (அல்லாஹ் மன்னித்தான்). இறுதியில் பூமி விரிந்ததாக இருந்தும்கூட அது அவர்களுக்குச் சுருங்கிவிட்டது. அவர்களின் உள்ளங்களும் அவர்களுக்கு இறுக்கமாகிவிட்டன. மேலும், அல்லாஹ்விடமிருந்து (தப்பிக்க) அவனை விட்டால் வேறு புகóடம் கிடையாது என்று அவர்கள் (உறுதியாக) எண்ணினர். அவர்கள் பாவமீட்சி பெற வேண்டுமென்பதற்காக மீண்டும் அவர்களை அல்லாஹ் மன்னித்தான். நிச்சயமாக அல்லாஹ் பாவமன்னிப்புக் கோரிக்கையை அதிகமாக ஏற்பவனும் மிகுந்த கருணையாளனும் ஆவான். இறைநம்பிக்கை கொண்டோரே! நீங்கள் அல்லாஹ்வை அஞ்சுங்கள்; உண்மையாளர்களுடன் இருங்கள் (9:117-119) எனும் வசனங்களை அருளினான். ஆகவே, அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் எனக்கு இஸ்லாத்திற்கு வழிகாட்டியபின், தன் தூதர் (ஸல்) அவர்களிடம் என்னை உண்மை பேசச்செய்து உபகாரம் புரிந்ததைப் போன்று வேறெந்த உபகாரத்தையும் நான் மிகப் பெரியதாக ஒருபோதும் கருதவில்லை. நான் அவர்களிடம் பொய் பேசியிருந்தால், (போருக்குச் செல்லாமல்) பொய் சொன்னவர்(களான நயவஞ்சகர்)கள் அழிந்துபோனது போல நானும் அழிந்துவிட்டிருப்பேன். ஏனெனில், இறைவன் வேதஅறிவிப்பு (வஹீ) அருளியபோது யாருக்கும் சொல்லாத கடுமையான சொற்களைப் பொய் சொன்னவர்கள் குறித்து அருளினான். “(இறைநம்பிக்கையாளர்களே!) நீங்கள் (போர் முடிந்து) அவர்களிடம் திரும்பிவந்தால், அவர்களை நீங்கள் கண்டுகொள்ளாமல் விட்டுவிட வேண்டும் என்பதற்காக உங்களிடம் அல்லாஹ்வின் மீது சத்தியம் செய்வார்கள். எனவே, அவர்களை நீங்கள் அலட்சியப்படுத்திவிடுங்கள். அவர்கள் அசுத்தமானோர் ஆவர். அவர்களின் புகலிடம் நரகமாகும். அவர்கள் தேடிக்கொண்டிருந்த (தீய)வற்றுக்கு (இதுவே) தண்டனை ஆகும். (இறைநம்பிக்கையாளர்களே! அவர்கள் குறித்து நீங்கள் திருப்தியடைய வேண்டும் என்பதற்காக உங்களிடம் அவர்கள் சத்தியம் செய்வார்கள். அவர்கள் குறித்து நீங்கள் திருப்தியடைந்தாலும், பாவம் புரியும் இக்கூட்டத்தார் குறித்து அல்லாஹ் திருப்தியடையமாட்டான்” (9:95,96) என்று உயர்ந்தோனும் வளமிக்கோனுமான அல்லாஹ் கூறினான். குறிப்பாக, எங்கள் மூவரின் விவகாரம் மட்டும் தள்ளிவைக்கப்பட்டிருந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு முன்னால் (பொய்ச்) சத்தியம் செய்தவர்களை ஏற்றுக்கொண்டு அவர்களிடமும் உறுதிப் பிரமாணம் பெற்று அவர்களுக்காகப் பாவமன்னிப்பும் தேடினார்கள். (எங்களது) அந்த விவகாரத்தில் அல்லாஹ்வே தீர்ப்பளிக்கும்வரையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் விவகாரத்தைத் தள்ளிப்போட்டுவந்தார்கள். இதனால்தான் (9ஆவது அத்தியாயத்தின் 118ஆவது வசனத்தில்) அல்லாஹ் எங்களைக் குறித்து, “தீர்ப்பு ஒத்திவைக்கப்பட்ட அந்த மூவரையும்' என்று பொதுவாகவே குறிப்பிட்டுள்ளான். “போருக்குச் செல்லாத மூவர்' என்று கூறவில்லை. “நபி (ஸல்) அவர்கள் தம்மிடம் பொய்யான சாக்குப்போக்குக் கூறியவர்களின் காரணங்களை உடனுக்குடன் ஏற்றுக்கொண்டது போலல்லாமல் எங்கள் விவகாரத்தை (உடனே தீர்க்காது) அல்லாஹ் தள்ளிப்போட்டு வந்தான்” என்பதே அதன் கருத்தாகும். “தபூக் போரின்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் செல்லாமல், தாம் பின்தங்கிவிட்ட காலகட்டத்தைக் குறித்து தம் தந்தை கஅப் பின் மாலிக் (ரலி) அவர்கள் அறிவித்தபோது இதை அவர்கள் கூற நான் கேட்டேன்” என்று கஅப் (ரலி) அவர்கள் முதிய வயதடைந்து கண்பார்வை இழந்துவிட்ட சமயம் அவர்களைக் கைப்பிடித்து அழைத்துச் செல்பவராயிருந்த -அவர்களுடைய புதல்வர்- அப்துல்லாஹ் பின் கஅப் (ரஹ்) அவர்கள் மேற்கண்ட ஹதீஸை அறிவிக்கிறார்கள். அத்தியாயம் : 64",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 440
			}
		}
	]
}