{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4480,
			"arabicnumber": 4480,
			"text": "அனஸ் (ரலி) அவர்கள் கூறிய தாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மதீனாவுக்கு) வந்திருக்கும் செய்தி (யூத அறிஞராயிருந்த) அப்துல்லாஹ் பின் சலாம் அவர்களுக்கு, அவர்கள் ஒரு (தோட்ட) நிலத்தில் பழம் பறித்துக்கொண்டிருந்த சமயம் எட்டியது. உடனே அவர்கள் நபி (ஸல்) அவர்களிடம் வந்து, “தங்களிடம் நான் மூன்று விஷயங்களைப் பற்றிக் கேட்கப்போகிறேன். அவற்றை ஓர் இறைத் தூதர் மட்டுமே அறிவார்” என்று கூறினார்கள். பிறகு, “1. இறுதி நாளின் அடையாளங்களில் முதலாவது அடையாளம் எது? 2. சொர்க்கவாசிகள் உண்ணும் முதல் உணவு எது? 3. குழந்தை தன் தந்தையின் சாயலில், அல்லது தாயின் சாயலில் இருப்பது எதனால்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “சற்று முன்புதான் ஜிப்ரீல் (அலை) எனக்கு இவற்றைக் குறித்து (விளக்கம்) தெரிவித்தார்” என்று கூறினார்கள். உடனே அப்துல்லாஹ் பின் சலாம் அவர்கள், “ஜிப்ரீலா (தங்களுக்குத் தெரிவித்தார்!)” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “ஆம்' என்று பதிலளிக்க, “வானவர்களிலேயே ஜிப்ரீல்தான் யூதர் களுக்குப் பகைவராயிற்றே!” என்று அப்துல்லாஹ் பின் சலாம் அவர்கள் கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள், “(நபியே!) நீர் கூறுவீராக: எவர் ஜிப்ரீலுக்குப் பகைவரோ (அவர் அல்லாஹ்வுக்கும் பகைவரே). ஏனெனில், நிச்சயமாக அவர் அல்லாஹ்வின் ஆணைக்கிணங்கவே இ(வ்வேதத்)தை உமது இதயத்தில் இறக்கிவைத்தார்” எனும் இந்த (2:97ஆவது) வசனத்தை ஓதிக்காட்டினார்கள். பிறகு, “அறிக! இறுதி நாளின் அடை யாளங்களில் முதலாவது அடையாளம், ஒரு நெருப்பாகும். அது கிழக்கிலிருந்து மக்களை(த் துரத்திக்கொண்டு வந்து) மேற்குத் திசையில் ஒன்றுதிரட்டும். அறிக! சொர்க்கவாசிகள் உண்ணும் முதல் உணவு, பெரிய மீனின் ஈரல் பகுதியிலுள்ள கூடுதலான சதையாகும். (குழந்தை தந்தையின் சாயலில், அல்லது தாயின் சாயலில் அமையக் காரணம், ஓர் ஆண் தன் மனைவியுடன் உடலுறவு கொள்ளும்போது) ஆணின் நீர் (விந்து உயிரணு) பெண்ணின் நீரை (கருமுட்டை உயிரணுவை) முந்திவிட்டால் குழந்தை அவனது சாயலைப் பெறுகிறது. பெண்ணின் நீர் (கருமுட்டை உயிரணு) முந்திக்கொண்டால் குழந்தை அவளது சாயலைப் பெறுகிறது” என்று பதிலளித்தார்கள். (உடனே) அப்துல்லாஹ் பின் சலாம் அவர்கள், “அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்று நான் உறுதிமொழிகிறேன். தாங்கள் அல்லாஹ்வின் தூதர்தான் என்றும் நான் உறுதிமொழிகிறேன்” என்று கூறினார்கள். பிறகு, “அல்லாஹ்வின் தூதரே! யூதர்கள் பொய்யில் ஊறித் திளைத்த சமுதாயத்தார் ஆவர். தாங்கள் (என்னைப் பற்றி) அவர்களிடம் விசாரித்து (அறிந்து)கொள்வதற்கு முன்பாக, நான் இஸ்லாத்தை ஏற்றுக்கொண்டதை அவர்கள் அறிந்தால் என்னைப் பற்றி (அவதூறு கற்பித்துத்) தங்களிடம் பொய்யுரைப்பார்கள்” என்று கூறினார்கள். அப்போது யூதர்கள் வந்தனர். (உடனே, அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள் அறைக்குள் சென்று மறைந்துகொண்டார்கள்.) பிறகு, நபி (ஸல்) அவர்கள் (யூதர்களிடம்), “உங்களில் அப்துல்லாஹ் பின் சலாம் எத்தகைய மனிதர்?” என்று கேட்டார்கள். அதற்கு அவர்கள், “அவர் எங்களில் நல்லவரும், எங்களில் நல்லவரின் புதல்வருமாவார்; எங்கள் தலைவரும், எங்கள் தலைவரின் புதல்வருமாவார்” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள், “அப்துல்லாஹ் பின் சலாம் இஸ்லாத்தை ஏற்றுக்கொண்டார் என்றால் நீங்கள் என்ன நினைப்பீர்கள்?” என்று கேட்டார்கள். அதற்கு யூதர்கள், “அல்லாஹ் அவரை அதிலிருந்து காப்பாற்றுவானாக!” என்று சொன்னார்கள். உடனே அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள் வெளியே வந்து, “அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் தூதராவார்கள் என்றும் நான் உறுதிமொழிகிறேன்” என்று சொன்னார்கள். உடனே யூதர்கள், “இவர் எங்களில் கெட்டவரும் எங்களில் கெட்டவரின் மகனுமாவார்” என்று அப்துல்லாஹ் பின் சலாமைக் குறித்துக் குறைகூறினர். அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள், “இதைத்தான் நான் அஞ்சிக்கொண்டி ருந்தேன், அல்லாஹ்வின் தூதரே!” என்று கூறினார்கள்.16 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 7
			}
		}
	]
}