{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அபூசுஃப்யான் (ரலி) அவர்கள் தம் வாய்ப்பட எனக்கு அறிவித்ததாவது: (குறைஷியரின் முக்கிய தலைவராயிருந்த) எனக்கும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் இடையிலான (ஹுதைபியா சமாதான ஒப்பந்தம் நடைமுறையில் இருந்த) காலகட்டத்தில் நான் (வியாபாரத்திற்காக வணிகக் குழுவினருடன் ஷாம் நாட்டிற்குச்) சென்றிருந்தேன். நான் ஷாம் (சிரியா) நாட்டில் இருந்துகொண்டிருந்தபோது நபி (ஸல்) அவர்களிடமிருந்து (கிழக்கு ரோமானியப் பேரரசர் சீசர்) ஹிரக்ளீயஸிற்குக் கடிதமொன்று கொண்டுவரப்பட்டது. அதை நபி (ஸல்) அவர்களிடமிருந்து “திஹ்யா அல்கல்பீ' அவர்கள் கொண்டுவந்து, “புஸ்ரா'வின் அரசரிடம் கொடுக்க, அவர் அதை ஹிரக்ளீயஸிடம் கொடுத்தனுப்பியிருந்தார். அப்போது ஹிரக்ளீயஸ் (தம்மைச் சூழ அமர்ந்திருந்த பிரதிநிதிகளிடம்) “தம்மை இறைவனின் தூதரெனக் கூறிக்கொண்டிருக்கும் இந்த மனிதரின் (முஹம்மதின்) சமுதாயத்தைச் சேர்ந்த எவரேனும் இங்கு (நம் நாட்டில்) இருக்கின்றார்களா?” என்று கேட்டார். அதற்கு அவர்கள், “ஆம்' என்று பதிலளித் தார்கள். அப்போது (ஷாமில் வியாபாரத் திற்காகத் தங்கியிருந்த) நான் குறைஷியர் சிலருடன் அழைக்கப்பட்டேன். ஆகவே, நாங்கள் ஹிரக்ளீயஸிடம் சென்றோம். அவர் முன்னிலையில் (அரசவையில்) எங்களை அமரச் செய்தார்கள். அப்போது ஹிரக்ளீயஸ், “தம்மை அல்லாஹ்வின் தூதர் என்று சொல்óக்கொண்டிருக்கும் அந்த மனிதருக்கு உங்களில் நெருங்கிய உறவினர் யார்?” என்று கேட்டார். அதற்கு நான், “நான்(தான் நெருங்கிய உறவினன்)” என்று சென்னேன். ஆகவே, அவரது முன்னிலையில் என்னை அமரவைத்தனர். என் சகாக்களை எனக்குப் பின்னால் அமரவைத்தனர். பிறகு ஹிரக்ளீயஸ் தம் மொழிபெயர்ப்பாளரை அழைத்து (அவரிடம்), “தம்மை அல்லாஹ்வின் தூதர் என்று சொல்லிக்கொண்டிருக்கும் இந்த மனிதரைப் பற்றி இவரிடம் கேட்கப்போகிறேன்; இவர் என்னிடம் பொய் சொன்னால் (நமக்குத்) தெரிவிக்கும்படி இவருடைய சகாக்களிடம் சொல்” என்றார். அல்லாஹ்வின் மீது சத்தியமாக! நான் பொய் சொன்னால் அதை என் சகாக்கள் தெரிவித்துவிடுவார்கள் என்பது (குறித்த அச்சம்) மட்டும் இல்லாதிருந்தால் (முஹம்மத் (ஸல்) அவர்களைப் பற்றி) நான் பொய்(யான விவரங்களைச்) சொல்லியிருப்பேன். பிறகு, ஹிரக்ளீயஸ் தம் மொழிபெயர்ப் பாளரிடம், “உங்களிடையே அந்த மனிதரின் குடும்பப் பாரம்பரியம் எப்படிப் பட்டது? என்று இவரிடம் கேள்” என்று சென்னார். நான், “அவர் எங்களிடையே சிறந்த குடும்பப் பாரம்பரியத்தை உடைய வராவார்” என்று பதிலளித்தேன். ஹிரக்ளீயஸ், “அவருடைய முன்னோர்களில் அரசர் எவராவது இருந்திருக்கி றாரா?” என்று கேட்டார். நான் “இல்லை' என்று சொன்னேன். ஹிரக்ளீயஸ், “அவர் தம்மை “நபி' என வாதிப்பதற்குமுன் அவர் (மக்களிடம்) பொய் சொன்னார் என்று (எப்போதாவது) நீங்கள் சந்தேகம் கொண்டீர்களா?” என்று கேட்டார். நான், “இல்லை” என்று சொன்னேன். “அவரை மக்களில் மேட்டுக்குடியினர் பின்பற்றுகின்றனரா? அல்லது அவர்களில் பலவீனர்கள் (ஒடுக்கப்பட்டவர்கள்) பின்பற்றுகின்றனரா?” என்று கேட்டார். நான், “இல்லை; பலவீனமானவர்கள்தான் அவரைப் பின்பற்றுகின்றனர்” என்றேன். அவர், “அவரைப் பின்பற்றுவோர் அதிகரித்துக்கொண்டே செல்கின்றனரா? அல்லது குறைந்துகொண்டே போகின்றனரா?” என்று கேட்டார். நான், “இல்லை; அவர்கள் அதிகரித்துக்கொண்டே செல்கின்றனர்” என்று சொன்னேன். அவர், “அவரது மார்க்கத்தில் இணைந்தபிறகு தம் புதிய மார்க்கத்தின் மீது அதிருப்தியடைந்து எவரேனும் தமது பழைய மதத்திற்கே திரும்பிச் செல்வதுண்டா?” என்று கேட்டார். நான், “இல்லை' என்று சொன்னேன். அவர், “அவருடன் நீங்கள் போர் புரிந்ததுண்டா?” என்று கேட்டார். நான், “உண்டு' என்று சொன்னேன். அவர், “அவ்வாறாயின், அவருடன் நீங்கள் நடத்திய போர்க(ளின் முடிவு)கள் எவ்வாறு இருந்தன?” என்று கேட்டார். நான், எங்களிடையேயான போர்கள் (கிணற்று) வாளிகள்தான். (அவை சுழல் முறையில் மாறி மாறி வருகின்றன. ஒருமுறை) அவர் எங்களை வெற்றி கொள்வார். (மறுமுறை) நாங்கள் அவரை வெற்றி கொள்வோம்” என்று சொன்னேன். அவர், “அந்த மனிதர் வாக்கு மீறுகின்றாரா?” என்று கேட்டார். நான், “இல்லை; (தற்போது நடைமுறையிலுள்ள ஹுதைபியா சமாதான உடன்படிக்கையின்) இந்தக் காலகட்டத்தில் நாங்கள் இருக் கின்றோம். இதில் அவர் எப்படி நடந்து கொள்வார் என்பது எங்களுக்குத் தெரியாது” என்று சொன்னேன். அல்லாஹ்வின் மீதாணையாக! இதைத் தவிர (நபியவர்களைக் குறைசொல்வதற்கு) வேறு எந்த வார்த்தையையும் புகுத்த எனக்குவாய்ப்புக் கிடைக்கவில்லை. (பிறகு) அவர், “இவருக்கு முன்னால் (குறைஷியரில்) வேறு எவரேனும் இப்படி (தம்மை “நபி' என) வாதித்ததுண்டா?” என்று கேட்டார். நான், “இல்லை” என்று சொன்னேன். பிறகு ஹிரக்ளீயஸ் தம் மொழி பெயர்ப்பாளரிடம் (இவ்வாறு) கூறினார்: “அவரிடம் கூறுங்கள்: நான் உம்மிடம் உங்களிடையே அவருடைய குடும்பப் பாரம்பரியம் குறித்துக் கேட்டேன். அவர் சிறந்த பாரம்பரியத்தைச் சேர்ந்தவர் என்று நீர் பதிலளித்தீர். இவ்வாறே இறைத் தூதர்கள் சிறந்த பாரம்பரியத்திóருந்தே தேர்ந்தெடுக்கப்படுவர். நான் உம்மிடம் அவருடைய முன்னோர்களில் அரசர் எவரேனும் இருந்திருக்கிறாரா என்று கேட்டேன். அதற்கு நீர் “இல்லை' என்றீர். அவருடைய முன்னோர்களில் அரசர் எவரேனும் இருந்திருப்பாராயின், “தம் முன்னோர்களின் ஆட்சியதிகாரத்தை (தாமும் அடைய) விரும்பும் ஒரு மனிதர் இவர்' என்று நான் கூறியிருப்பேன். “மக்களில் அவரைப் பின்பற்றுபவர்கள் மேட்டுக்குடியினரா? அல்லது பலவீனமானவர்களா?” என்று அவரைப் பின்பற்றுபவர்களைக் குறித்துக் கேட்டேன். அதற்கு நீர் ஒடுக்கப்பட்ட மக்களே அவரைப் பின்பற்றுகின்றனர் என்று பதிலளித்தீர். (பெரும்பாலும்) அவர்கள்தான் இறைத்தூதர்களைப் பின்பற்றுவோர் ஆவர். நான் உம்மிடம், “அவர் தம்மை “நபி' என வாதிப்பதற்கு முன்பு (அவர் மக்களிடம்) பொய் பேசினார் என்று எப்போதாவது நீங்கள் சந்தேகித்ததுண்டா?” என்று கேட்டேன். அதற்கு நீர் “இல்லை' என்று பதிலளித்தீர். இதிலிருந்து மக்களிடம் பொய் பேச(த் துணிய)ôத அவர் அல்லாஹ்வின் மீது பொய் சொல்லமாட்டார் என்று நான் புரிந்துகொண்டேன். உம்மிடம் நான் “அவரது மார்க்கத்தை ஏற்றுக்கொண்டோரில் எவராவது தமது (புதிய) மார்க்கத்தின் மீது அதிருப்திகொண்டு அதிóருந்து வெளியேறிச் செல்வதுண்டா?” என்று கேட்டேன். அதற்கு “இல்லை' என்றீர். இறைநம்பிக்கை இத்தகையதே! உள்ளத்தின் எழிலோடு அது கலந்து விடும்போது (அதைக் குறித்து யாரும் வெறுப்படையமாட்டார்.) உம்மிடம் நான் “அவரைப் பின்பற்றுவோர் (நாளுக்கு நாள்) அதிகரித்துவருகின்றனரா? அல்லது குறைந்துவருகின்றனரா?” என்று கேட்டேன், நீர் “அதிகரித்தே வருகின்றனர்' என்று பதிலளித்தீர். இறைநம்பிக்கை அத்தகையதுதான். அது முழுமையடையும்வரை (அதிகரித்துக்கொண்டே செல்லும்). மேலும் உம்மிடம் நான், “அவருடன் நீங்கள் போர் புரிந்ததுண்டா?” என்று கேட்டேன். அதற்கு நீங்கள் போர் புரிந்தீர்கள் என்றும், உங்களுக்கும் அவருக்கும் இடையே போர் கிணற்று வாளிகள்தான் (போரில் வெற்றியும் தோல்வியும் சுழல் முறையில் மாறி மாறிவருகின்றன) என்றும், (ஒருமுறை) அவர் உங்களை வெற்றிகொண்டால் (மறுமுறை) நீங்கள் அவரை வெற்றிகொள்கிறீர்கள் என்றும் பதிலளித்தீர். இறைத்தூதர்கள் அப்படித்தான் சோதிக்கப்படுவார்கள். ஆனால், இறுதி வெற்றி அவர்களுக்கே கிடைக்கும். “அவர் வாக்கு மீறுகின்றாரா?” என்று உம்மை நான் கேட்டதற்கு நீர், “அவர் வாக்கு மீறுவதில்லை' என்று கூறினீர். இறைத்தூதர்கள் இத்தகையவர்களே; அவர்கள் வாக்கு மீறுவதில்லை. நான், “இவருக்குமுன் உங்களில் எவராவது இந்த வாதத்தை முன்வைத்த துண்டா?” என்று உம்மிடம் கேட்டபோது நீர் “இல்லை' என்று பதிலளித்தீர். அவருக்கு முன்னரும் எவரேனும் இந்த வாதத்தை முன்வைத்திருந்ததாக (நீர் கூறி) இருப்பின், “தமக்கு முன்னர் (சிலரால்) முன்வைக்கப்பட்ட ஒரு வாதத்தையே பின்பற்றிச் செல்கின்ற ஒரு மனிதர் இவர்' என நான் சொல்லியிருப்பேன்” என்று சொன்னார். பிறகு ஹிரக்ளீயஸ், “அவர் என்ன செய்யும்படி உங்களுக்குக் கட்டளையிடு கின்றார்?” என்று கேட்டார். நான், “தொழுகையை நிறைவேற்றும்படியும், தர்மம் செய்யும்படியும், உறவைக் காத்து வரும்படியும், ஒழுக்கமாக வாழும்படியும் அவர் எங்களுக்குக் கட்டளையிடுகின்றார்” என்று சொன்னேன். ஹிரக்ளீயஸ், “அவரைக் குறித்து நீர் சொன்னவை அனைத்தும் உண்மை யானால், அவர் இறைத்தூதர்தான். அவர் வரப்போகிறார் என்று நான் அறிந்துவைத்திருந்தேன். ஆனால், அவர் (குறைஷியராகிய) உங்களிலிருந்து வருவார் என்று நான் எண்ணியிருக்கவில்லை. நான் அவரைச் சென்றடைவேன் என அறிந்தால் அவரைச் சந்திக்க நான் விரும்புவேன். அவர் அருகில் நான் இருந்திருந்தால் அவரின் கால்களைக் கழுவியிருப்பேன். அவரது ஆட்சி (ஒரு காலத்தில்) என் இரு பாதங்களுக்குக் கீழுள்ள (இந்த) இடத்தையும் எட்டியே தீரும்” என்று சொன்னார். பிறகு ஹிரக்ளீயஸ் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது கடிதத்தைக் கொண்டுவரும்படி உத்தரவிட்டார். (அது கொண்டுவரப்பட்டது.) அதை அவர் வாசிக்கச் செய்தார். அதில் பின்வருமாறு எழுதப்பட்டிருந்தது: அளவிலா அருளாளன் நிகரிலா அன்புடையோன் அல்லாஹ்வின் திருப் பெயரால்... இது அல்லாஹ்வின் தூதர் முஹம்மதிடமிருந்து கிழக்கு ரோமாபுரியின் அதிபர் ஹிரக்ளீயஸுக்கு (எழுதப்பட்ட கடிதம்:) நல்வழியைப் பின்பற்றியவர்மீது (இறைவனின்) சாந்தி நிலவட்டும். இஸ்லாத்தை ஏற்குமாறு உங்களை நான் அழைக்கின்றேன். இஸ்லாத்தை ஏற்றுக் கொள்ளுங்கள். (ஏற்றுக்கொண்டால், ஈருலகிலும்) நீங்கள் பாதுகாப்புப் பெறுவீர்கள். நீங்கள் இஸ்லாத்தை ஏற்றுக்கொள்ளுங்கள். அல்லாஹ் உங்க ளுக்குச் சேர வேண்டிய நன்மையை இரு மடங்காகத் தருவான். நீங்கள் புறக்கணித்தால், (குடிமக்களான) விவசாயி களின் பாவமும் (அவர்கள் இஸ்லாத்தை ஏற்காமல்போவதன் குற்றமும்) உங்களையே சாரும். வேதக்காரர்களே! எங்களுக்கும் உங்களுக்கும் இடையிலுள்ள பொதுவான ஒரு விஷயத்திற்கு வாருங்கள். (அது யாதெனில்:) “அல்லாஹ்வைத் தவிர வேறு எதையும் நாம் வணங்கலாகாது; அவனுக்கு எதையும் நாம் இணை வைக்கலாகாது; அல்லாஹ்வையன்றி நம்மில் யாரும் யாரையும் கடவுள்களாக ஆக்கிக்கொள்ளலாகாது'. இதன் பிறகும் அவர்கள் ஏற்க மறுத்தால், “நிச்சயமாக நாங்கள் (அல்லாஹ்வுக்கு அடிபணிகின்ற) முஸ்óம்கள்தான் என்பதற்கு நீங்கள் சாட்சிகளாக இருங்கள்' என்று கூறிவிடுங்கள். ஹிரக்ளீயஸ் அந்தக் கடிதத்தைப் படித்து முடித்தபோது, அவருக்கு அருகிலேயே (அவரைச் சுற்றிலுமிருந்த கிழக்கு ரோமானிய ஆட்சியாளர்களின்) குரல்கள் உயர்ந்தன. கூச்சல் அதிகரித்தது. எங்களை வெளியே கொண்டுசெல்லும்படி உத்தரவிடப்பட்டது. உடனே நாங்கள் (அரசவையிலிருந்து) வெளியேற்றப்பட்டோம். நாங்கள் வெளியே வந்தபோது, நான் என் சகாக்களிடம், “இப்னு அபீகப்ஷா (முஹம்மது)வின் விவகாரம் வலிமை பெற்றுவிட்டது. மஞ்சள் நிற இனத்தாரின் (கிழக்கு ரோமரின்) மன்னரே அவருக்கு அஞ்சுகிறாரே!” என்று சொன்னேன். (அன்று முதல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய மார்க்கம் விரைவில் வெற்றி பெறும் என்று உறுதி கொண்டவனாகவே நான் இருந்துவந்தேன். முடிவில் அல்லாஹ் என் உள்ளத்தில் இஸ்லாத்தைப் புகுத்தினான். ஸுஹ்ரீ (ரஹ்) அவர்கள் (தமது அறிவிப்பில்) கூறியிருப்பதாவது: “பிறகு ஹிரக்ளீயஸ் கிழக்கு ரோமானிய ஆட்சியாளர்களுக்கு அழைப்பு விடுத்து, அவர்களைத் தமது மாளிகை ஒன்றில் ஒன்றுகூட்டி அவர்களிடையே, “அந்திமக் காலத்தில் உங்களுக்கு வெற்றியும் நல்வழியும் கிடைக்க வேண்டுமென்ற ஆசையும், உங்களது ஆட்சி உங்களிடமே நீடிக்க வேண்டும் என்ற எண்ணமும் உங்களுக்கு உண்டா? (அப்படியானால் இந்த இறுதித் தூதரை நம்புங்கள்)” என்று பேசினார். இதைக் கேட்டவுடனேயே காட்டுக் கழுதைகள் வெருண்டோடுவதுபோல வாயில்களை நோக்கி அவர்கள் வெருண் டோடி, வாயில் அருகில் சென்றதும், அவை தாளிடப்பட்டிருக்கக் கண்டனர். அப்போது மன்னர் ஹிரக்ளீயஸ், “அவர்களை என்னிடம் திருப்பிக் கொண்டுவாருங்கள்” என அவர்களுக்கு அழைப்புவிடுத்தார். (அவ்வாறே அழைத்துவரப்பட்டனர். அவர்களிடம்) “நீங்கள் உங்கள் மதத்தின் மீது எவ்வளவு பிடிப்புக் கொண்டுள்ளீர்கள் என்பதை நான் சோதிக்கவே இவ்வாறு செய்தேன். நான் விரும்பியதை இப்போது ஐயமற அறிந்துகொண்டேன்” என்று அவர் கூறியதும், அனைவரும் அவருக்குச் சிரம்பணிந்தனர். அவரைக் குறித்துத் திருப்தியும் அடைந்தனர்.10 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 75
			}
		}
	]
}