{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4568,
			"arabicnumber": 4568,
			"text": "அல்கமா பின் வக்காஸ் (ரஹ்) அவர்கள் கூறியதாவது: (மதீனா ஆளுநர்) மர்வான் பின் அல்ஹகம்25 தம் காவலரிடம், “ராஃபிஉ! நீர் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் சென்று, “தமக்கு அளிக்கப்பட்டவை குறித்து மகிழ்ச்சி அடைகின்ற, தாம் செய்யாத (சாதனைகள் முதலிய)வற்றுக்காகத் தாம் புகழப்பட வேண்டுமென்று விரும்புகின்ற மனிதர் ஒவ்வொருவரும் வேதனை செய்யப்படுவர் என்றிருப்பின், நாம் அனைவருமே வேதனை செய்யப்பட வேண்டி வருமே!' என்று (நான் வினவியதாகக்) கேள்” என்று சொன்னார். (அவ்வாறே இப்னு அப்பாஸ் (ரலி) அவர்களிடம் சென்று ராஃபிஉ கேட்ட போது) “உங்களுக்கு இது தொடர்பாக என்ன (குழப்பம்) நேர்ந்தது? (இதன் உண்மை என்னவென்றால்,) நபி (ஸல்) அவர்கள் யூதர்களை அழைத்து அவர்களிடம் ஒரு விஷயம் (தவ்ராத்தில் உள்ளதா என்பது) குறித்துக் கேட்டார்கள். அப்போது யூதர்கள் அதை மறைத்து விட்டு (உண்மைக்குப் புறம்பான) வேறொன்றை நபியவர்களிடம் தெரிவித்தார்கள். தங்களிடம் நபி (ஸல்) அவர்கள் வினவியது தொடர்பாகத் தாங்கள் அன்னாரிடம் (தகவல்) தெரிவித்ததற்காகப் பாராட்டை எதிர்பார்ப்பதுபோல் அவர்கள் காட்டிக்கொண்டார்கள். தங்களுக்கு (இறைவன் மூலம்) வழங்கப்பெற்ற (உண்மை)தனைத் தாங்கள் மறைத்துவிட்டது குறித்து அவர்கள் மகிழ்ச்சியடைந்தார்கள்” என்று கூறிவிட்டு (பின்வரும்) இந்த வசனங்களை இப்னு அப்பாஸ் (ரலி) அவர்கள் ஓதினார்கள்: வேதம் வழங்கப்பட்டவர்களிடம் “நீங்கள் அதை மக்களுக்குத் தெளிவாக்கிட வேண்டும்; அதனை மறைக்கக் கூடாது' என அல்லாஹ் உறுதிமொழி வாங்கி னான். ஆனால், அதை அவர்கள், தம் முதுகுக்குப் பின்னே எறிந்துவிட்டு, அதற்குப் பதிலாக அற்ப விலையை வாங்கிக்கொண்டனர் என்பதை (நபியே! அவர்களுக்கு நினைவூட்டுவீராக!) அவர்கள் வாங்கிக்கொண்டது மிக மோசமானதாகும். தாம் செய்த (தீய)வை குறித்து மகிழ்ந்துகொண்டும், தாம் செய்யாதவற்றைக் கொண்டு பாராட்டப்பட வேண்டும் என விரும்பிக்கொண்டும் இருப்போர் வேதனையிóருந்து தப்பிவிடுவார்கள் என்று ஒருபோதும் நீர் எண்ண வேண்டாம்; அவர்களுக்கு வதைக்கும் வேதனை உண்டு. (3:187, 188).26 இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 90
			}
		}
	]
}