{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4589,
			"arabicnumber": 4589,
			"text": "ஸைத் பின் ஸாபித் (ரலி) அவர்கள் 4:88ஆவது இறைவசனம் குறித்துக் கூறியதாவது: (உஹுத் போருக்காக) நபி (ஸல்) அவர்களுடன் (சென்று) இருந்தவர்களில் சிலர் (நயவஞ்சகர்கள்) உஹுதிலிருந்து (வழியிலேயே) திரும்பி வந்துவிட்டனர். இவர்கள் விஷயத்தில் (என்ன நடவடிக்கை எடுக்கலாம் என்பது தொடர்பாகக் கருத்து வேறுபாடு கொண்டு) மக்கள் இரு பிரிவினராக ஆகிவிட்டனர். ஒரு பிரிவினர், “(நயவஞ்சகர்களாகிய) அவர்களைக் கொன்றுவிடுங்கள் (அல்லாஹ்வின் தூதரே!)” என்று கூறினர். மற்றொரு பிரிவினர், “(வெளிப்படையில் முஸ்லிம்களாகிய அவர்களைக் கொல்ல) வேண்டாம்” என்று கூறினர். அப்போதுதான், “உங்களுக்கு என்ன நேர்ந்துவிட்டது? நயவஞ்சகர்கள் விஷயத்தில் இரு (வேறு கருத்துகள் கொண்ட) குழுவினராய் ஆகிவிட்டீர்களே! அல்லாஹ்வோ அவர்களை, அவர்கள் சம்பாதித்துக்கொண்ட (தீய)வற்றின் காரணத்தால் தலைகுனியச் செய்துவிட்டான்” எனும் (4:88ஆவது) இறைவசனம் அருளப்பெற்றது. மேலும், நபி (ஸல்) அவர்கள், “மதீனா தூய்மையானது; நெருப்பு, வெள்ளியின் அழுக்கை நீக்கிவிடுவதைப் போல் அது தீமையை அகற்றிவிடும்” என்றுசொன்னார்கள்.20 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அமைதியளிக்கக்கூடிய அல்லது அச்சம் தரக்கூடிய ஏதேனும் செய்தி அவர்களிடம் வந்தால் அதை அவர்கள் பரப்பிவிடுகிறார்கள். ஆனால், அதைத் தூதரிடமும் அவர்களில் பொறுப்புள்ளவர்களிடமும் தெரிவித்திருப்பார் களாயின், நுணுகி ஆராயும் திறனுடையவர்கள் அ(ச்செய்தியின் உண்மை நிலை)தனை நன்கு அறிந்திருப்பார்கள் (எனும் 4:83ஆவது வசனத்தொடர்). (இந்த வசனத்தின் மூலத்தில் இடம் பெற்றுள்ள) “அஃதாஊ' எனும் சொல்லுக்கு “பரப்பிவிடுவார்கள்' என்பது பொருள். “யஸ்தன்பித்தூன' எனும் சொல்லுக்கு “ஆராய்ந்து முடிவு செய்கிறார்கள்' என்பது பொருள். (4:86ஆவது வசனத்தின் மூலத்தி லுள்ள) “ஹசீப்' எனும் சொல்லுக்கு “போதுமானவன்' என்பது பொருள். (4:117ஆவது வசனத்தின் மூலத்திலுள்ள) “இனாஸ்' எனும் சொல் கல், மண் போன்ற உயிரற்ற பொருட்களைக் குறிக்கும். “மரீத்' எனும் சொல்லுக்கு “(தீமையில்) பிடிவாதமாக இருப்பவன்' என்பது பொருள். (4:119ஆவது வசனத்தின் மூலத்திலுள்ள) “ஃபலயுபத்திகுன்ன' எனும் சொற்றொடருக்கு “அவர்கள் (தம் கால்நடைகளின் காதுகளைக்) கிழித்துத் துண்டிப்பார்கள்” என்பது பொருள். (4:122ஆவது வசனத்தின் மூலத்திலுள்ள) “கீல்' எனும் பதமும் “கவ்ல்' எனும் பதமும் (பேச்சு, சொல் எனும்) ஒரே பொருள் கொண்டவை ஆகும். (4:155ஆவது வசனத்தின் மூலத்திலுள்ள “தபஅ' எனும் சொல்லின் செயப்பாட்டு வினைச்சொல்லான) “துபிஅ' எனும் சொல்லுக்கு “முத்திரையிடப்பட்டது' என்பது பொருள். அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 111
			}
		}
	]
}