{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "அபூகிலாபா அப்துல்லாஹ் பின் ஸைத் (ரஹ்) அவர்கள் கூறியதாவது: நான் (உமய்யா கலீஃபா) உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்களுக்குப் பின்னால் அமர்ந்திருந்தேன். (அறியாமைக் காலத்து “அல்கசாமா' எனும் சத்தியமுறை பற்றி அன்னார் கேட்க, அது பற்றி) மக்கள் சொல்லிக்கொண்டே இருந்தார்கள். (இதில் பழிவாங்கல் இருப்பது உண்மைதான். உங்களுக்கு முன்பிருந்த) கலீஃபாக்கள் இதன்படி பழிவாங்க உத்தரவிட்டுள்ளார்கள் என்றும் சொன்னார்கள். உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள் தம் முதுகுக்குப் பின்னால் அமர்ந்திருந்த என் பக்கம் திரும்பி, “அப்துல்லாஹ் பின் ஸைத் அவர்களே! நீங்கள் என்ன சொல்கிறீர்கள்' அல்லது “அபூகிலாபாவே! நீங்கள் என்ன சொல்கிறீர்கள்?' என்று கேட்டார்கள். நான், “திருமணமான பின்பு விபசாரம் புரிந்த மனிதரையும், அல்லது உயிருக்குப் பதிலாக அன்றி (அநியாயமாக) ஓர் உயிரைக் கொன்றவரையும், அல்லது அல்லாஹ்வையும் அவனுடைய தூதர் (ஸல்) அவர்களையும் எதிர்த்துப் போரிட்டவரையும் தவிர, வேறு எந்த மனிதரையும் கொல்வதற்கு இஸ்லாத்தில் அனுமதியிருப்பதாக நான் அறியவில்லை” என்று சொன்னேன். அப்போது அன்பஸா பின் சயீத் (ரஹ்) அவர்கள், “என்னிடம் அனஸ் பின் மாலிக் (ரலி) அவர்கள் (“அல்கசாமா' மற்றும் “உரைனா' சம்பவம் குறித்து) இப்படி இப்படியெல்லாம் அறிவித்தார்கள்” என்று சொன்னார்கள். நான் சொன்னேன்: “அனஸ் (ரலி) அவர்கள் என்னிடம்கூட (இப்படிச்) சொன்னார்கள்: நபி (ஸல்) அவர்களிடம் ஒரு சமுதாயத்தார் (“உக்ல்' மற்றும் “உரைனா' குலத்தைச் சேர்ந்தவர்கள்) வந்து உரையாடினார்கள். அப்போது அவர்கள், “இந்தப் பூமி (மதீனா)எங்களுக்கு ஒத்துக்கொள்ளவில்லை (நாங்கள் நோய்வாய்ப்பட்டுவிட்டோம்)” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “இதோ, எங்களின் (தர்ம காரியத்திற் காக வந்துள்ள) இந்த ஒட்டகங்கள் (மேய்ச்சலுக்காக நகருக்கு) வெளியே செல்லவிருக்கின்றன. நீங்களும் இவற்று டன் சென்று இவற்றின் பாலையும் இவற்றின் சிறுநீரையும் அருந்துங்கள்” என்று சொன்னார்கள். அவ்வாறே அவர்கள் அவற்றுடன் வெளியே சென்று அவற்றின் சிறுநீரையும் அவற்றின் பாலையும் அருந்தி (நோய் நீங்கி) குணமடைந்தனர். பின்னர், ஒட்டகம் மேய்ப்பவரின்மீது பாய்ந்து அவரைக் கொன்றுவிட்டனர்; ஒட்டகங்களை ஓட்டியும் சென்றுவிட்டனர். ஓர் உயிரை (அநியாயமாகக்) கொன்று அல்லாஹ்வுடனும் அவனுடைய தூதருட னும் போர் புரிந்து, அல்லாஹ்வின் தூதரை அச்சுறுத்திய இ(ந்தக் கொடுஞ்செயல் புரிந்த)வர்களுக்குத் தண்டனை கொடுப்பதில் தாமதம் காட்ட முடியுமா, என்ன? அப்போது அன்பஸா (ரஹ்) அவர்கள், (வியப்புத் தெரிவிப்பது போல) “சுப்ஹானல்லாஹ்' (அல்லாஹ் தூயவன்) என்று சொன்னார்கள். நான், “என்னை நீங்கள் சந்தேகப்படுகின்றீர்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “(இல்லை) இதை எங்களுக்கு அனஸ் (ரலி) அவர்கள் அறிவித்தார்கள்” என்று கூறிவிட்டு, “இந்த ஊர் (ஷாம்)வாசிகளே! இவரையும் இவரைப் போன்றவர் களையும் அல்லாஹ் உங்களிடையே வாழவைத்திருக்கும்வரை நீங்கள் நன்மையிலேயே நீடிப்பீர்கள்” என்று சொன்னார்கள்.8 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 132
			}
		}
	]
}