{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4650,
			"arabicnumber": 4650,
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: (காரிஜிய்யா கூட்டத்தைச் சேர்ந்த) ஒரு மனிதர் என்னிடம் வந்து, “அபூஅப்திர் ரஹ்மானே! அல்லாஹ் தன் வேதத்தில் (பின்வருமாறு) கூறியிருப்பதை நீங்கள் கேட்கவில்லையா? என்று கேட்டார். “இறைநம்பிக்கையாளர்களில் இரு பிரிவினர் தங்களுக்குள் சண்டையிட்டுக் கொண்டால் அவ்விருவருக்குமிடையே சமாதானப்படுத்திவிடுங்கள். பின்னர் அவர்களில் ஒரு பிரிவினர் மற்றொரு பிரிவினரின் மீது (எல்லை மீறி) அநீதியிழைத்தால், அநீதியிழைத்தோர் அல்லாஹ்வுடைய கட்டளையின் பக்கம் வரும்வரை அவர்களை நீங்கள் எதிர்த்துப் போரிடுங்கள். அவர்கள் (அல்லாஹ்வின் கட்டளைகளின் பக்கம்) திரும்பிவிட்டால், நியாயமான முறையில் அவ்விருவருக்கிடையே நடந்துகொள்ளுங்கள். நிச்சயமாக, அல்லாஹ் நீதிமான்களை நேசிக்கின்றான்” (49:9). “இந்நிலையில், அல்லாஹ் தன் வேதத்தில் கூறியுள்ளபடி நீங்கள் போரிட முன்வராமல் இருப்பது ஏன்?” என்றும் கேட்டார். நான், “என் சகோதரர் மகனே! இந்த (49:9ஆவது) வசனத்திற்கு ஏதேனும் சமாதானம் கூறிவிட்டு (முஸ்லிம்களில் ஒரு பிரிவினருக்கெதிராகப்) போர் புரியாமல் இருந்துவிடுவது, “ஓர் இறை நம்பிக்கையாளரை ஒருவன் வேண்டுமென்றே கொலை செய்துவிட்டால் அவனுக்குரிய பிரதிபலன் நரகமாகும். அதில் அவன் நிரந்தரமாக வீழ்ந்து கிடப்பான். மேலும், அவன்மீது அல்லாஹ்வின் கோபமும் அவனுடைய சாபமும் உள்ளது. மேலும், மிகப் பெரிய வேதனையும் அவனுக்காகத் தயார் செய்து வைத்துள்ளான்” என்ற (4:93ஆவது) வசனத்திற்குச் சமாதானம் சொல்வதைவிட எனக்கு உவப்பாதாயிருக்கும்” என்று கூறினேன்.4 அந்த மனிதர் “ “(பூமியிóருந்து) குழப்பம் நீங்கி, கீழ்ப்படிதல் முற்றிலுமாக அல்லாஹ்வுக்கென்றே ஆகிவிடும் வரை அவர்களுடன் நீங்கள் போர் புரியுங்கள்' (8:39) என்று அல்லாஹ் கூறுகின்றானே!” என்று கேட்டார். நான், “(இதை) நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் காலத்தில் செயல்படுத்திவிட்டோம். அப்போது இஸ்லாம் (உறுப்பினர் எண்ணிக்கையில்) குறைவானதாக இருந்தது. அப்போது (இஸ்லாத்தை ஏற்றுக்கொண்ட) ஒரு மனிதர் தமது மார்க்கத்தின் விஷயத்தில் குழப்பத்திற்கு(ம் சோதனைக்கும்) உள்ளாக்கப்பட்டார்; ஒன்று (எதிரிகள்) அவரைக் கொன்றுவிடுவார்கள். அல்லது அவரைக் கட்டிவைத்துவிடுவார்கள். முடிவில் இஸ்லாம் (அதன் உறுப்பினர்களால்) அதிகரித்தபோது எந்தக் குழப்பமும் (எஞ்சி) இருக்கவில்லை” என்று பதிலளித்தேன். தாம் எண்ணி வந்ததற்கு நான் இணங்காததை அவர் கண்டதும், “அலீ (பின் அபீதாலிப்) மற்றும் உஸ்மான் (பின் அஃப்பான்) விஷயத்தில் தாங்கள் என்ன கருதுகிறீர்கள்?” என்று கேட்டார். நான், “அலீ மற்றும் உஸ்மான் ஆகியோர் விஷயத்தில் என் கருத்து (இதுதான்:) உஸ்மான் (ரலி) அவர்களை அல்லாஹ்வே மன்னித்துவிட்டான். ஆனால் அவர்களை மன்னிக்க நீங்கள் விரும்பவில்லை. அலீ (ரலி) அவர்களோ அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தந்தையின் சகோதரர் மகனும் நபியவர்களின் மருமகனும் ஆவார்கள்” என்று கூறினேன்.5 (இதன்அறிவிப்பாளர் நாஃபிஉ (ரஹ்) அவர்கள் கூறுகிறார்கள்:) இப்னு உமர் (ரலி) அவர்கள், “இதோ நீங்கள் காண்கின்ற இந்த இடத்தில் உள்ளதுதான் நபியவர்களின் புதல்வியார் (ஃபாத்திமாவின்) இல்லமாகும்” என்று -தம் கரத்தால் சைகை செய்தவாறு- கூறினார்கள். அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 172
			}
		}
	]
}