{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4665,
			"arabicnumber": 4665,
			"text": "இப்னு அபீமுளைக்கா அப்துல்லாஹ் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: இப்னு ஸுபைர் (ரலி) அவர்களுக் கும் இப்னு அப்பாஸ் (ரலி) அவர்களுக்கும் இடையே சிறிது (மனத்தாங்கல்) ஏற்பட்டிருந்தது. அப்போது நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம் காலையில் சென்று, “நீங்கள் இப்னு ஸுபைர் (ரலி) அவர்களுடன் போரிட்டு அல்லாஹ்வின் (புனிதத் தலமான) ஹரமை (இரத்தம் சிந்த) அனுமதிக்கப்பட்ட இடமாக (ஹலாலானதாக) ஆக்க விரும்புகிறீர்களா?” என்று கேட்டேன். அதற்கு அவர்கள், “இறைவன் காப்பாற்றட்டும். இப்னு ஸுபைரையும் பனூ உமய்யாக்களையும்தான் ஹரமில் போர் புரிவதை அனுமதிக்கின்றவர்களாக அல்லாஹ் எழுதிவைத்துள்ளான். அல்லாஹ்வின் மீதாணையாக! நான் அதை ஒருபோதும் அனுமதிக்கமாட்டேன்” என்று கூறினார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள்: மக்கள் (என்னிடம்) “இப்னு ஸுபைர் (ரலி) அவர்களுக்கு விசுவாசப் பிரமாணம் செய்யுங்கள்' என்று சொன்னார்கள். நான், “இந்த ஆட்சியதிகாரம் அவரைவிட்டு எங்கே போய்விடும்? அவருடைய தந்தையோ -அதாவது ஸ‚பைர் பின் அல்அவ்வாம் (ரலி) அவர்களோ- நபி (ஸல்) அவர்களின் பிரத்யேக உதவியாளராவார். அவருடைய பாட்டனாரோ -அதாவது அபூபக்ர் (ரலி) அவர்களோ- (நபி (ஸல்) அவர்களின்) குகைத்தோழர் ஆவார். அவருடைய தாயாரோ -அதாவது அஸ்மா (ரலி) அவர்களோ- “கச்சுடையாள்' (என்று நபி (ஸல்) அவர்களால் சிறப்புப் பெயர் சூட்டப்பெற்றவர்) ஆவார். அவர்களுடைய சிறிய தாயாரோ -அதாவது ஆயிஷா (ரலி) அவர்களோ- இறைநம்பிக்கையாளர்களின் அன்னை யாவார். அவர்களுடைய அத்தையோ -அதாவது ஹதீஜா (ரலி) அவர்களோ- நபி (ஸல்) அவர்களுடைய துணைவியார் ஆவார். நபி (ஸல்) அவர்களின் அத்தையோ -அதாவது ஸஃபிய்யா (ரலி) அவர்களோ- அவருடைய பாட்டியாவார். மேலும் அவர், இஸ்லாத்தில் நெறி பிறழாதவர்; குர்ஆனை நன்கறிந்தவர். அல்லாஹ்வின் மீதாணையாக! உமய்யாக்கள் என்னுடன் உறவாடுகிறார்கள் என்றால் சொந்தத்தின் காரணத்தால் உறவாடுகிறார்கள்.12 எனக்கு அவர்கள் ஆட்சியாளர் களானால் அதற்குத் தகுதியுடையோராயும் சிறந்த பாரம்பரியமுடையோராயுமே ஆட்சியாளர்களாகின்றனர். (அப்படியிருந்தும் நான் அவர்களைக் கைவிட்டு, இப்னு ஸுபைருக்கு விசுவாசப் பிரமாணம் செய்ய உறுதிபூண்டேன். ஆனால்) அவரோ “துவைத்'களுக்கும், “உசாமா'க்களுக்கும், “ஹுமைத்'களுக்கும் (என்னைவிட) முன்னுரிமை அளித்துவிட்டார். (இப்னு ஸுபைருடைய குலத்தாரான) “பனூ அசத்' குலத்தைச் சேர்ந்த பனூ துவைத், பனூ உசாமா, பனூ ஹுமைத் ஆகிய குடும்பங்களையே குறிப்பிடுகின்றார்கள்.13 இப்னு அபில்ஆஸ் -அப்துல் மலிக் பின் மர்வான்- அவர்கள் (தம் சகாக்களிடையே பல சிறப்புகள் பெற்று) முன்னேறிச் செல்கிறார். இவரோ -இப்னுஸ் ஸுபைரோ- பின்னடைவுக்கு ஆளாகிவிட்டார். அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 187
			}
		}
	]
}