{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4678,
			"arabicnumber": 4678,
			"text": "அப்துர் ரஹ்மான் பின் அப்தில்லாஹ் பின் கஅப் (ரஹ்) அவர்கள் கூறியதாவது: (என் பாட்டனார்) கஅப் பின் மாலிக் (ரலி) அவர்களின் (இறுதிக் காலத்தில் கண் பார்வையற்ற அவர்களுக்கு) வழிகாட்டியாக இருந்த (என் தந்தை) அப்துல்லாஹ் பின் கஅப் (ரஹ்) அவர்கள் கூறினார்கள்: (என் தந்தை) கஅப் பின் மாலிக் (ரலி) அவர்கள் தாம் தபூக் போரில் கலந்து கொள்ளாமலிருந்துவிட்ட செய்தியை அறிவித்தபோது நான் அவர்களிடமிருந்து (பின்வருமாறு) செவியுற்றேன்: அல்லாஹ்வின் மீதாணையாக!உண்மை பேசுவதில் என்னைச் சோதித்ததை விடச் சிறப்பாக வேறெவரையும் அல்லாஹ் சோதித்ததாக நான் அறியவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் உண்மை பேசியதிலிருந்து இந்த நாள்வரை நான் திட்டமிட்டுப் பொய் சொல்ல முனைந்ததில்லை. அந்தச் சமயத்தில் (என் உண்மைக்குப் பரிசாக) அல்லாஹ் பின்வரும் வசனங்களை அருளினான்: நிச்சயமாக அல்லாஹ் (தன்) தூதர்மீது அருள்புரிந்தான். (அவ்வாறே) துன்ப வேளையில் அவரைப் பின்பற்றிய முஹாஜிர்கள் மற்றும் அன்சாரிகள்மீதும் (அருள் புரிந்தான்.) அவர்களில் ஒரு பிரிவினரின் இதயங்கள் தடுமாறிக்கொண்டிருந்த பின்னரும் அவர்களை மன்னித்(து அவர்கள்மீது அருள் புரிந்)தான். நிச்சயமாக அவன் அவர்கள்மீது அன்பும் கருணையும் உடையோனாக இருக்கிறான். மேலும், தீர்ப்பு ஒத்திவைக்கப்பட்டிருந்த அந்த மூவரையும் அவன் மன்னித்தான்; (அவர்கள் நிலைமை எந்த அளவுக்கு மோசமாகிவிட்டிருந்த தெனில்,) பூமி இத்துணை விரிவாய் இருந்தும் அவர்களைப் பொறுத்த வரை அது குறுகி அவர்கள் உயிர் வாழ்வதே சிரமமாகிவிட்டிருந்தது. இன்னும் அல்லாஹ்விடமிருந்து தப்பிப்பதற்கு அவன் பக்கம் திரும்புவதைத் தவிர வேறு புகலிடம் இல்லை என்பதை அவர்கள் அறிந்துகொண்டார்கள். பின்னர், அவர்கள் பாவத்திலிருந்து மீள வேண்டும் என்பதற்காக அவர்களை அல்லாஹ் மன்னித்தான். நிச்சயமாக அல்லாஹ்தான் மிகவும் மன்னிப்போனும் மிகுந்த கருணையாளனும் ஆவான். இறைநம்பிக்கை கொண்டவர்களே! அல்லாஹ்வை அஞ்சுங்கள்; மேலும் வாய்மையாளர்களுடன் இருங்கள். (9:117-119) அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 200
			}
		}
	]
}