{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "சயீத் பின் ஜுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் இப்னு அப்பாஸ் (ரலி) அவர்களிடம், ‘‘இறைத்தூதரான மூசா (அலை) அவர்கள், களிர் (அலை) அவர்களைச் சந்தித்த மூசா அல்லர் (அவர் வேறொரு மூசா) என்று (பேச்சாளர்) நவ்ஃப் அல்பிகாலி கூறுகிறார்” என்றேன். அதற்கு இப்னு அப்பாஸ் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் விரோதி பொய் சொல்லிவிட்டார். உபை பின் கஅப் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து எமக்கு (பின்வருமாறு) அறிவித்தார்கள் என்றார்: (ஒருமுறை) மூசா (அலை) அவர்கள், பனூ இஸ்ராயீல்களிடையே நின்று சொற்பொழிவாற்றிக்கொண்டிருந்தார்கள். அப்போது அவர்களிடம், ‘‘மக்களில் மிகவும் அறிந்தவர் யார்?” என்று வினவப்பட்டது. அதற்கு மூசா (அலை) அவர்கள், ‘‘நான்தான்” என்று பதிலளித்துவிட்டார்கள். ஆகவே, அவர்களை அல்லாஹ் கண்டித்தான். ஏனெனில், மூசா (அலை) அவர்கள், ‘‘(இதைப் பற்றிய) அறிவு அல்லாஹ்வுக்கே உண்டு” என்று சொல்லாமல் விட்டுவிட்டார்கள். ஆகவே, அல்லாஹ் மூசா (அலை) அவர்களுக்கு, ‘‘இல்லை; இரு கடல்கள் சங்கமிக்கும் இடத்தில் என் அடியார்களில் ஒருவர் இருக்கிறார். அவர் உம்மைவிட அதிகமாக அறிந்தவர்” என்று அறிவித்தான். மூசா (அலை) அவர்கள், ‘‘என் இறைவா! அவரைச் சந்திப்பதற்கு (எனக்கு) வழி எப்படி?” என்று கேட்டார்கள். அதற்கு அல்லாஹ், ‘‘நீங்கள் ஒரு மீனைப் பிடித்து அதை ஒரு கூடையில் போட்டுக்கொள்ளுங்கள். (அப்படியே கடலோரமாக நடந்து பயணம் செய்யுங் கள்.) நீங்கள் எங்கே அந்த மீனைத் தவறவிடுகிறீர்களோ அங்கேதான் அவர் இருப்பார். அவரைப் பின்பற்றிச் செல்லுங்கள்” என்று சொன்னான். எனவே, மூசா (அலை) அவர்கள் தம் உதவியாளர் ‘யூஷஉ பின் நூனுடன்’ அந்த மீன் சகிதமாகப் புறப்பட்டு (இரு கடல்கள் சங்கமிக்கும் இடத்திற்கு அருகிலிருந்த) பாறைக்கு வந்து சேர்ந்து அதனருகில் ஓய்வெடுத்தார்கள். உடனே மூசா (அலை) அவர்கள் தம் தலையை வைத்து (படுத்து) உறங்கியும்விட்டார்கள். அறிவிப்பாளர் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்: அம்ர் பின் தீனார் (ரஹ்) அல்லாதோரின் அறிவிப்பில், ‘‘மேலும் அந்தப் பாறைக் கடியில் ஒரு நீரூற்று இருந்தது. அதற்கு ‘ஜீவ நீரூற்று’ என்று பெயர். அதன் நீர் பட்ட எந்தப் பொருளும் உயிர் பெறாமல் இருக்காது. அவ்வாறே அந்த மீனின் மீதும் அந்த ஊற்றின் நீர் பட்டது” என்று காணப்படுகிறது. உடனே அந்த மீன் (உயிர் பெற்று) அசைந்து, கூடையிலிருந்து நழுவி கடலுக்குள் புகுந்தது. மூசா (அலை) அவர்கள் கண் விழித்த போது தம் உதவியாளரை நோக்கி, ‘‘நமது காலைச் சிற்றுண்டியைக் கொண்டுவா! நாம் நமது இந்தப் பயணத்தில் மிகவும் களைப்படைந்துவிட்டோம்” என்று சொன்னார்கள். (18:62) தமக்குக் கட்டளையிடப்பட்ட (இடத்)தைத் தாண்டிச் செல்லும்வரை மூசா (அலை) அவர்கள் களைப்பை உணர வில்லை. உதவியாளர் யூஷஉ பின் நூன் மூசா (அலை) அவர்களிடம், ‘‘நாம் அந்தப் பாறையில் (ஓய்வெடுக்க) ஒதுங்கினோமே பார்த்தீர்களா? அங்கேதான் நான் மீனை மறந்து (தவறவிட்டு)விட்டேன். அதை நான் (உங்களுக்குக்) கூறுவதை ஷைத்தானே எனக்கு மறக்கடித்துவிட்டான். (அவ்விடத்தில் அது, கடலில் செல்ல) விந்தையான விதத்தில் தன் வழியை அமைத்துக்கொண்டது” என்று கூறினார். அதற்கு மூசா, ‘‘நாம் தேடி வந்த இடம் அதுதான்” என்று கூறினார். (18:63, 64) ஆகவே, அவர்களிருவரும் தங்கள் அடிச்சுவடுகளைப் பின்பற்றி வந்த வழியே திரும்பிச் சென்றார்கள். (மீன் நழுவிய பாறைக்கு அருகிலிருந்த கடற்பகுதிக்கு அவர்கள் வந்து சேர்ந்தபோது) மீன் (நீந்திச்) சென்ற இடத்தில் (இருந்த தண்ணீர்) வளையம் போலிருக்கக் கண்டனர். மூசா (அலை) அவர்களின் உதவியாளருக்கு அது வியப்பாகவும், மீனுக்கு அது (தப்பும்) வழியாகவும் இருந்தது. அவர்கள் இருவரும் அந்தப் பாறைக்குப் போய்ச் சேர்ந்தபோது அங்கே தம்மை முழுவதுமாக ஆடையால் (போர்த்தி) மூடிக்கொண்டபடி ஒரு மனிதர் (களிர்) இருந்தார். மூசா (அலை) அவர்கள் அவருக்கு சலாம் (முகமன்) சொல்ல, அம்மனிதர், ‘‘உங்களுடைய (இந்த) வட்டாரத்தில் (அறியப்படாத) சலாம் (உங்களுக்கு மட்டும்) எவ்வாறு (தெரியும்? நீங்கள் யார்)?” என்று வினவினார். அதற்கு மூசா (அலை) அவர்கள், ‘‘நான்தான் மூசா” என்று பதிலளித்தார்கள். அம்மனிதர், ‘‘பனூ இஸ்ராயீல்களின் (இறைத்தூதரான) மூசாவா?” என்று கேட்டார். மூசா (அலை) அவர்கள், ‘ஆம்’ என்று பதிலளித்துவிட்டு, ‘‘உங்களுக்குக் கற்றுத் தரப்பட்டுள்ள அறிவிலிருந்து எனக்கும் (சிறிது) நீங்கள் கற்றுத்தருவதற்காக உங்களைப் பின்தொடர்ந்து வரட்டுமா?” என்று கேட்டார்கள். அதற்கு களிர் (அலை) அவர்கள், மூசா (அலை) அவர்களிடம், ‘‘மூசாவே! அல்லாஹ் உங்களுக்குக் கற்றுத்தந்த ஓர் அறிவு உங்களிடம் உள்ளது. அதை நான் அறியமாட்டேன். அல்லாஹ் எனக்குக் கற்றுத்தந்த ஓர் அறிவு என்னிடம் உள்ளது. அதை நீங்கள் அறியமாட்டீர்கள்” என்று கூறினார்கள். (மீண்டும்) மூசா (அலை) அவர்கள், ‘‘இல்லை; நான் உங்களைத் தொடர்ந்து வருவேன்” என்று கூறினார்கள். அதற்கு களிர் (அலை) அவர்கள், ‘‘நீர் என்னைப் பின்தொடர்ந்து வருவதாயின், எந்த ஒரு விஷயத்தைப் பற்றியும், நானாக உமக்கு அறிவிக்கும்வரையில் நீர் என்னிடம் அதைப் பற்றி (ஏன், எதற்கு என்று) கேட்கலாகாது” என்று கூறினார். பிறகு (மூசா, களிர்) இருவரும் கடற்கரையோரமாக நடந்து சென்றார்கள். அப்போது மரக்கலம் ஒன்று அவர்களைக் கடந்து சென்றது. அப்போது (ஏழைகளான மரக்கல உரிமையாளர்களால்) களிர் (அலை) அவர்கள் அடையாளம் கண்டுகொள்ளப்பட்டு அவர்களைத் தங்கள் மரக்கலத்தில் அவர்கள் கட்டணம் ஏதுமின்றி ஏற்றிக்கொண்டனர்.அவர்களிருவரும் மரக்கலத்தில் பயணம் மேற்கொண்டனர். அப்போது சிட்டுக்குருவியொன்று வந்து மரக்கலத்தின் விளிம்பின் மீது விழுந்து, தன் (சின்னஞ் சிறிய) அலகைக் கடலில் அமிழ்த்தி (ஓரிரு ‘மிடறு’ நீர்அருந்தி)யது. அப்போது மூசா (அலை) அவர்களிடம் களிர் (அலை) அவர்கள், ‘‘உம்முடைய அறிவும், என்னுடைய அறிவும், (ஏன்) படைப்பினங்கள் யாவற்றின் அறிவும் அல்லாஹ்வின் அறிவோடு ஒப்பிடுகையில், இந்தச் சிட்டுக்குருவி தன் அலகை (கடலுக்குள்) அமிழ்த்தி (நீர் எடுத்தி)ட்ட அளவுதான்” என்று சொன்னார்கள். மூசா (அலை) அவர்கள் மரக்கலத்தில் ஏறிச் சிறிது நேரம்தான் கழிந்திருக்கும். களிர் (அலை) அவர்கள் வாய்ச்சி ஒன்றை எடுத்து மரக்கலத்தை ஓட்டையாக்கி (அதை முளைக்குச்சியால் அடைத்து)விட்டார்கள். உடனே மூசா (அலை) அவர்கள், களிரை நோக்கி, ‘‘கட்டணம் இல்லாமலேயே நம்மை ஏற்றி வந்தவர்களின் மரக்கலத்தை வேண்டு மென்றே ஓட்டையாக்கிவிட்டீர்களே! இதில் பயணம் செய்பவர்களை மூழ்கடிக்கவா (இப்படிச் செய்தீர்கள்)? நீங்கள் பெரிய (அபாயமான) செயலைச் செய்துவிட்டீர்கள்” என்று கூறினார்கள். பிறகு இருவரும் (மரக்கலத்திலிருந்து இறங்கி,) நடந்து, சிறுவர்களுடன் விளையாடிக்கொண்டிருந்த ஒரு சிறுவனுக்கருகில் சென்றனர். அப்போது களிர் (அலை) அவர்கள், அச்சிறுவனின் தலையைப் பிடித்துத் துண்டாக்கி(த் தனியே எடுத்து)விட்டார்கள். உடனே மூசா (அலை) அவர்கள், களிர் (அலை) அவர்களிடம், ‘‘ஒரு பாவமும் அறியாத (பச்சிளம்) உயிரையா நீங்கள் பறித்துவிட்டீர்கள்? அவன் வேறெந்த உயிரையும் பறிக்கவில்லையே! நீங்கள் மிகக் கேடான செயலைச் செய்துவிட்டீர்கள்!” என்று கூறினார்கள். அதற்கு களிர் (அலை) அவர்கள்,” நீங்கள் என்னுடன் பொறுமையாக இருக்க முடியாது என்று முன்பே நான் சொல்லவில்லையா?” என்று கேட்டார்கள். மூசா (அலை) அவர்கள், ‘‘இதற்குப் பின்னால் நான் உங்களிடம் ஏதாவது (விளக்கம்) கேட்டால், என்னை உங்களுடன் சேர்த்துக்கொள்ளாதீர்கள். என்னிடமிருந்து (பிரிந்து செல்ல) உங்களுக்குத் தக்க காரணம் கிடைத்துவிட்டது” என்றார்கள். தொடர்ந்து இருவரும் நடந்தார்கள். இறுதியில் ஓர் ஊருக்கு வந்தார்கள். அந்த ஊர் மக்களிடம் உணவு கேட்டார்கள். ஆனால், அவர்கள் அவ்விருவருக்கும் விருந்தோம்பல் செய்ய மறுத்துவிட்டார்கள். (இந்நிலையில்) அந்த ஊரில் சாய்ந்தவாறு கீழே விழலாமா என யோசித்துக்கொண்டிருந்த சுவர் ஒன்றை அவர்கள் இருவரும் கண்டார்கள். (அதைப் பார்த்த) உடன் களிர் (அலை) அவர்கள் இவ்வாறு தமது கரத்தால் அதைச் செப்பனிட்டார்கள். அப்போது மூசா (அலை) அவர்கள் களிரிடம், ‘‘இந்த ஊருக்குள் நாம் வந்து(உணவு கேட்டு)ம், இவர்கள் நமக்கு விருந்தோம்பல் செய்யவில்லை; நமக்கு உணவளிக்கவுமில்லை. (அவ்வாறிருந்தும் வேண்டுமென்றே நீங்கள் அவர்களது சுவரைச் செப்பனிட்டுள்ளீர்கள்.) நீங்கள் நினைத்திருந்தால் அதற்குக் கூலி பெற்றுக் கொண்டிருக்கலாமே!” என்றார்கள். களிர் (அலை) அவர்கள், ‘‘இதுதான் நானும் நீங்களும் பிரிய வேண்டிய நேரம். உங்களால் பொறுமையாக இருக்க முடியாத (இம்மூன்று) விஷயங்களின் விளக்கத்தை நான் உங்களுக்கு (இப்போது) அறிவித்து விடுகிறேன்” என்று கூறினார்கள். (இந்த நிகழ்ச்சியைக் கூறி முடித்தபின்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘மூசா பொறுமையாக இருந்திப்பாரே யானால் அவ்விருவர் பற்றி(ய நிறைய செய்திகள்) நமக்கு அறிவிக்கப்பட்டிருக்கும் என நாம் விரும்பினோம்” என்று கூறினார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள், (18:79ஆவது வசனத்தின் மூலத்தில்) ‘‘வ கான அமாமஹும் மலிக்குன் யஃகுது குல்ல சஃபீனத்தின் ஸாலிஹத்தின் ஃகஸ்பா” என்று ஓதுவார்கள். (பொருள்: அவர்களுக்கு முன்னே ஒரு மன்னன் ஆளும் பகுதி இருந்தது. அவன் பழுதில்லா நல்ல மரக்கலங்கள் ஒவ்வொன்றையும் அபகரித்துக்கொண்டிருந்தான்.) மேலும், (18:80ஆவது வசனத்தின் மூலத்தில்) ‘‘வ அம்மல் ஃகுலாமு ஃப கான காஃபிரன்” என்று ஓதுவார்கள். (பொருள்: அந்தச் சிறுவன் இறைமறுப்பாளனாக இருந்தான்.)9 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 249
			}
		}
	]
}