{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4741,
			"arabicnumber": 4741,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வல்லமையும் மாண்புமிக்க அல்லாஹ் மறுமை நாளில் (ஆதி மனிதரை நோக்கி,) ‘ஆதமே!’ என்பான். அதற்கு அவர்கள், ‘‘என் இறைவா! இதோ வந்துவிட்டேன். கட்டளையிடு! காத்திருக்கிறேன்” என்று கூறுவார்கள். அப்போது ‘‘நீங்கள் உங்கள் வழித்தோன்றல்களிருந்து நரகத்திற்கு அனுப்பப்படவிருப்பவர்களை (மற்றவர்களிóருந்து) தனியாகப் பிரிக்குமாறு அல்லாஹ் உங்களுக்கு ஆணையிடு கிறான்” என்று ஒருவர் அறைகூவல் விடுப்பார். ஆதம் (அலை) அவர்கள், ‘‘எத்தனை நரகவாசிகளை?” என்று கேட்பார்கள். அதற்கு அவர், ‘‘ஒவ்வோர் ஆயிரம் பேரிலிருந்தும் தொள்ளாயிரத்துத் தொண்ணூற்றொன்பது பேரை (வெளியே கொண்டுவாருங்கள்)” என்று பதிலளிப்பார். இப்படி அவர் கூறும் வேளையில் (அங்கு நிலவும் பயங்கர சூழ்நிலையின் காரணத்தால்) கர்ப்பம் கொண்ட பெண் ஒவ்வொருத்தியும் கர்ப்பத்தை (பீதியின் காரணத்தால் அரைகுறையாகப்) பிரசவித்துவிடுவாள்; பாலகன்கூட நரைத்து (மூப்படைந்து)விடுவான். மக்களை போதையுற்றவர்களாய் நீர் காண்பீர். ஆனால், அவர்கள் (உண்மையிலேயே மதுவால்) போதையுற்றிருக்கமாட்டார் கள். ஆனால், (அந்த அளவுக்கு) அல்லாஹ்வின் வேதனை கடுமையாய் இருக்கும்”. நபியவர்கள் இவ்வாறு கூறியது (அங்கு கூடியிருந்த) மக்களுக்குச் சிரமமாக இருந்தது. (அச்சத்தினால்) அவர்களின் முகங்கள் நிறம் மாறிவிட்டன. அப்போது நபி (ஸல்) அவர்கள், ‘‘உங்களில் ஒருவருக்கு யஃஜூஜ், மஃஜூஜ் கூட்டத்தாரில் ஓராயிரம் பேர் (தனியாகப் பிரிக்கப்படாமல், நரகம் செல்லும் குழுவிலேயே) இருப்பார்கள்” என்று கூறிவிட்டு பிறகு, ‘‘ ‘நீங்கள் (மறுமை நாளில் கூடியிருக்கும்) மக்களில் வெண்ணிறக் காளையின் மேனியில் உள்ள கறுப்பு முடியைப் போலத்தான்’ அல்லது ‘கருநிறக் காளையின் மேனியில் உள்ள வெண்ணிற முடியைப் போலத்தான்’ (மொத்த மக்களில் குறைந்த எண்ணிக்கையில்) இருப்பீர்கள்” என்று கூறினார்கள். பின்னர் ‘‘(என் சமுதாயத்தாராகிய) நீங்கள் சொர்க்கவாசிகளில் கால் பங்கினராக இருக்க வேண்டும் என்று நான் விரும்புகிறேன்” என்று கூறினார்கள். உடனே நாங்கள் (மகிழ்ச்சியூட்டும் இந்த நற்செய்தி கேட்டு) ‘‘அல்லாஹு அக்பர்” (அல்லாஹ் மிகப் பெரியவன்) என்று கூறினோம். பிறகு நபியவர்கள், ‘‘சொர்க்கவாசிகளில் நீங்கள் மூன்றில் ஒரு பங்கினராக இருக்க வேண்டும்” என்று கூறினார்கள். நாங்கள் (பெரும் மகிழ்ச்சியால் மீண்டும்,) ‘‘அல்லாஹு அக்பர்” என்று கூறினோம். பிறகு நபியவர்கள், ‘‘சொர்க்கவாசிகளில் பாதித் தொகையினராக நீங்கள் இருக்க வேண்டும்” என்று கூறினார்கள். நாங்கள் (இப்போதும்) ‘‘அல்லாஹு அக்பர்” என்று கூறினோம். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.2 இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் அபூஉசாமா (ரஹ்) அவர்களின் அறிவிப்பி லும் இவ்வாறே காணப்படுகிறது. ஜரீர் பின் அப்தில் ஹமீத், ஈசா பின் யூனுஸ், அபூமுஆவியா (ரஹ்) ஆகியோரின் அறிவிப்பில், (இந்த 22:2ஆவது வசனத்தின் மூலத்திலுள்ள ‘சுகாரா’ எனும் சொல்லுக்குப் பதிலாக) ‘சக்ரா’ என்று காணப்படுகிறது. (பொருள் ஒன்றே). அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 263
			}
		}
	]
}