{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4793,
			"arabicnumber": 4793,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ரொட்டியும் இறைச்சியும் விருந்தாக அளித்து, ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்களுடன் தாம்பத்திய உறவைத் தொடங்கினார்கள். (வலீமா விருந்து) உணவுக்காக மக்களை அழைப்பதற்கு நான் அனுப்பப்பட்டேன். ஒரு கூட்டத்தார் வருவார்கள். அவர்கள் உண்பார்கள்; புறப்பட்டுவிடுவார்கள். பிறகு மற்றொரு கூட்டத்தார் வருவார்கள். உண்பார்கள்; போய்விடுவார்கள். இனி அழைப்பதற்கு ஒருவரும் இல்லை என்பதுவரை நான் மக்களை அழைத்தேன். பிறகு, ‘‘அல்லாஹ்வின் தூதரே! நான் அழைப்பதற்கு இனி ஒருவரும் இல்லை” என்றேன். அவர்கள், ‘‘உங்கள் உணவை எடுத்துச் செல்லுங்கள்!” என்றார்கள். (விருந்து முடிந்தும்) மூன்று பேர் மட்டும் வீட்டில் பேசிக்கொண்டே இருந்து விட்டனர். நபி (ஸல்) அவர்கள் புறப்பட்டு ஆயிஷா (ரலி) அவர்களின் அறைக்குச் சென்று ‘‘வீட்டாரே! அஸ்ஸலாமு அலைக்கும் வ ரஹ்மத்துல்லாஹ் (உங்கள்மீது அல்லாஹ்வின் சாந்தியும் கருணையும் உண்டாகட்டும்!)” என்று கூறினார்கள். ஆயிஷா (ரலி) அவர்கள், ‘‘வ அலைக்குமுஸ் ஸலாம், வ ரஹ்மத்துல்லாஹ் (தங்கள்மீதும் அல்லாஹ்வின் சாந்தியும் கருணையும் உண்டாகட்டும்!) தங்களின் (புதிய) துணைவியாரை எப்படிக் கண்டீர்கள்? பாரக்கல்லாஹ் (அல்லாஹ் தங்களுக்கு வளம் வழங்கட்டும்!)” என்று (மணவாழ்த்துச்) சொன்னார்கள். பிறகு, நபி (ஸல்) அவர்கள் தம் துணைவியர் அனைவரின் அறைகளையும் தேடிச்சென்று ஆயிஷா (ரலி) அவர்களுக்குச் சொன்னதைப் போன்றே (முகமன்) சொல்ல, அவர்களும் ஆயிஷா (ரலி) அவர்கள் கூறியதைப் போன்றே (பிரதி முகமனும் மணவாழ்த்தும்) கூறினார்கள். பிறகு நபி (ஸல்) அவர்கள் (புதுமணப் பெண் ஸைனப் (ரலி) அவர்களிடம்) திரும்பி வர, அப்போதும் வீட்டில் அந்த மூன்று பேரும் பேசிக்கொண்டிருந்தனர்.நபி (ஸல்) அவர்களோ அதிக வெட்க (சுபாவ)ம் உடையவர்களாய் இருந்தார்கள். ஆகவே, (அவர்களை விரைவாகப் போகச் சொல்லாமல்,) ஆயிஷா (ரலி) அவர்களின் அறையை நோக்கி நடந்தபடி (மீண்டும்) புறப்பட்டார்கள். அந்த மூவரும் வெளியேறிவிட்டார்கள் என்று ‘நான் அவர்களுக்குத் தெரிவித்தேனா?’ அல்லது, ‘(மற்றவர் மூலம்) தெரிவிக்கப்பட்டதா?’ என்பது எனக்குத் தெரியவில்லை. (இதைக் கேட்ட உடன்) நபி (ஸல்) அவர்கள் (ஸைனபின் அறைக்கு) திரும்பி வந்தார்கள். அவர்கள் ஒரு காலை வாசற்படியிலும் மற்றொன்றை வெளியேயும் வைத்தபோது, எனக்கும் தமக்குமிடையே திரையைத் தொங்க விட்டார்கள். (அப்போதுதான்) பர்தா (சட்டம்) தொடர்பான இறைவசனம் அருளப்பெற்றது. அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 315
			}
		}
	]
}