{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4809,
			"arabicnumber": 4809,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அப்துல்லாஹ் பின் மஸ்ஊத் (ரலி) அவர்களிடம் சென்றோம். அவர்கள், ‘‘மக்களே! ஒன்றை அறிந்தவர், அதைப் பற்றிக் கூறட்டும்! அறியாதவர், ‘அல்லாஹ்வே நன்கறிந்தவன்’ என்று கூறட்டும்! ஏனெனில், ஒருவர் தாம் அறியாததைக் குறித்து ‘அல்லாஹ்வே நன்கறிந்தவன் (எனக்குத் தெரியாது)’ என்று சொல்வதும் அறிவின்பாற்பட்டதாகும். வல்லமையும் மாண்பும் மிக்க அல்லாஹ், ‘‘(நபியே!) கூறுக: நான் இதற்காக உங்களிடம் கூலி எதையும் கோரவில்லை. மேலும், நான் (இல்லாததைச் சொல்லி) பாவனை செய்வோரில் ஒருவனும் அல்லன்” என்று தன் தூதர் (ஸல்) அவர்களுக்குக் கூறியுள்ளான். (38:86) இதோ (கிந்தா எனுமிடத்தில் ஒருவர் பேசிவரும்) புகையைக் குறித்து உங்களுக்கு நான் சொல்கிறேன் (கேளுங்கள்): அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குறைஷியரை இஸ்லாத்திற்கு (வருமாறு) அழைத்தார்கள். ஆனால், அவர்கள் அதில் காலம் தாழ்த்தினார்கள். அப்போது நபி (ஸல்) அவர்கள் ‘‘இறைவா! (இவர்களைத் திருத்த உன் தூதர்) யூசுஃப் (அலை) அவர்கள் காலத்து ஏழு (பஞ்சம் நிலவிய) ஆண்டுகளைப் போல் இவர்களுக்கும் ஏழு (பஞ்சம் நிறைந்த) ஆண்டுகளைக் கொடுத்து இவர்களுக்கெதிராக எனக்கு உதவி செய்!” எனப் பிரார்த்தித்தார்கள். எனவே, அவர்களைப் பஞ்சம் வாட்டியது. அது அனைத்தையும் அழித்துவிட்டது. எந்த அளவுக்கென்றால், (பஞ்சத்தின் கோரப் பிடியினால்) அவர்கள் பிணத்தையும், (பிராணிகளின்) தோல்களையும் உண்டார்கள். மேலும், கடும் பசியால் (கண் பஞ்சடைந்து அவர்களில்) ஒருவர் தமக்கும் வானத்திற்குமிடையே புகையைத்தான் காண்பார். அல்லாஹ் கூறுகின்றான்: (நபியே!) தெளிவானதொரு புகை வானத்திலிருந்து வரும் நாளை நீங்கள் எதிர்பார்த்திருங்கள். மனிதர்களை அது சூழ்ந்துகொள்ளும். அது வதைக்கும் வேதனையாகும். (44:10,11) உடனே குறைஷியர், ‘‘எங்கள் இறைவா! எங்களைவிட்டு இவ்வேதனையை நீக்கிவிடு; நிச்சயமாக நாங்கள் (உன்னை) விசுவாசிக்கிறோம்” என்று வேண்டினர். (44:12) ‘‘(ஆனால், அந்நேரத்தில்) அவர்களுக்கு நல்லுணர்ச்சி எவ்வாறு பயனளிக்கும்? நிச்சயமாக (நம்முடைய) வெளிப்படையான தூதர் அவர்களிடம் வந்தே இருக்கின்றார். எனினும், அவர்கள் அவரைப் புறக்கணித்து (அவரைப் பற்றி, ‘இவர்) எவராலோ பயிற்றுவிக்கப்பட்ட ஒரு பைத்தியக்காரர்தான்’ என்று கூறினர். மெய்யாகவே (நீங்கள் திருந்தக் கூடுமென்று) அவ்வேதனையை (இன்னும்) சிறிது (காலத்திற்கு) நீக்கி வைத்தோம். (எனினும்,) நிச்சயமாக நீங்கள், (பாவம் செய்யவே) மீளுகின்றீர்கள்.” (44:13-15) (நபி (ஸல்) அவர்களின் வேண்டுதலால் அவர்களைவிட்டுப் பஞ்சம் அகன்றது.) ஆனால், மறுமை நாள் வேதனை (அவர்களைவிட்டு) அகற்றப்படவா போகிறது? ஆக, பஞ்சம் அகற்றப்பட்டது. பிறகு மீண்டும் அவர்கள் இறைமறுப்பிற்கே திரும்பிவிட்டனர். ஆகவே, அல்லாஹ் அவர்களை பத்ர் போரின்போது (கடுமையாகப்) பிடித்தான். உயர்ந்தோன் அல்லாஹ் கூறுகின்றான்: மிக்க பலமாக அவர்களை நாம் பிடிக்கும் அந்நாளில் நிச்சயமாக (அவர்களிடம்) பழிவாங்கியே தீருவோம். (44:16)6 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 331
			}
		}
	]
}