{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4855,
			"arabicnumber": 4855,
			"text": "மஸ்ரூக் பின் அல்அஜ்தஉ (ரஹ்) அவர்கள் கூறியதாவது: நான் ஆயிஷா (ரலி) அவர்களிடம், ‘‘அன்னையே! முஹம்மத் (ஸல்) அவர்கள் தம் இறைவனை (விண்ணுலகப் பயணத்தின்போது நேரில்) பார்த்தார்களா?” என்று கேட்டேன். அதற்கு அவர்கள், ‘‘நீங்கள் சொன்னதைக் கேட்டு என் ரோமம் சிலிர்த்துவிட்டது. மூன்று விஷயங்கள் (பற்றிய உண்மைகள்) உங்களுக்கு எப்படித் தெரியாமல் போயின? அவற்றை உங்களிடம் யார் தெரிவிக்கிறாரோ அவர் பொய்யுரைத்துவிட்டார். முஹம்மத் (ஸல்) அவர்கள் தம் இறைவனை (நேரில்) பார்த்தார்கள் என்று உங்களிடம் யார் கூறுகிறாரோ அவர் பொய் சொல்லிவிட்டார்” என்று கூறிவிட்டு, பிறகு (தமது கருத்திற்குச் சான்றாக,) ‘‘கண் பார்வைகள் அவனை எட்ட முடியாது; அவனோ அனைத்தையும் பார்க்கின்றான். அவன் நுட்பமானவனும் நன்கறிந்தவனும் ஆவான்” எனும் (6:103ஆவது) வசனத்தையும், ‘‘எந்த மனிதருடனும் அல்லாஹ் நேருக்கு நேர் பேசுவதில்லை. ஆயினும் வஹீயின் (வேதஅறிவிப்பின்) மூலமோ, திரைக்கு அப்பாலிருந்தோ, ஒரு தூதரை அனுப்பி வைத்துத் தன் அனுமதியின் பேரில் தான் நாடுகின்றவற்றை அறிவிக்கச் செய்தோ அல்லாமல் நேரடியாகப் பேசுவதில்லை” எனும் (42:51ஆவது) வசனத்தையும் ஓதினார்கள். மேலும், ‘‘எவர் உங்களிடம் முஹம்மத் (ஸல்) அவர்கள் நாளை நடப்பவற்றையும் அறிவார்கள்” என்று சொல்கிறாரோ, அவரும் பொய்யே சொன்னார்” என்று கூறிவிட்டு, பிறகு (தமது கருத்திற்குச் சான்றாக,) ‘‘எந்த மனிதனும் நாளை என்ன சம்பாதிக்கப்போகிறான் என்பதை அறிவதில்லை” எனும் (31:34ஆவது) வசனத்தை ஓதினார்கள். மேலும், ‘‘எவர் உங்களிடம் முஹம்மத் (ஸல்) அவர்கள் (மக்களுக்கு எடுத்துரைத்து விடுமாறு பணிக்கப்பட்ட ஒன்றை) மறைத்துவிட்டார்கள்” என்று சொன்னாரோ, அவரும் பொய்யே சொன்னார் என்று கூறிவிட்டு, பிறகு (தமது கருத்திற்குச் சான்றாக,) ‘‘தூதரே! உம்முடைய இறைவனிடமிருந்து உம்மீது இறக்கி வைக்கப்பட்டவற்றை (மக்களுக்கு) எடுத்துரைத்துவிடுவீராக!...” எனும் (5:67ஆவது) வசனத்தை ஓதினார்கள். ‘‘மாறாக, முஹம்மத் (ஸல்) அவர்கள் (வானவர்) ஜிப்ரீல் (அலை) அவர்களையே அவரது (நிஜத்) தோற்றத்தில் இரண்டு முறை கண்டார்கள்” என்று சொன்னார்கள்.4 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 376
			}
		}
	]
}