{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4889,
			"arabicnumber": 4889,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து எனக்கு (தாங்க முடியாத பசித்) துன்பம் ஏற்பட்டுள்ளது, அல்லாஹ்வின் தூதரே!” என்று கூறினார். நபி (ஸல்) அவர்கள் தம் துணைவியரிடம் ஆளனுப்பி (அவர்களிடம் உணவு ஏதேனும் இருக்கிறதா என்று கேட்டுவரச் சொன்)னார்கள். அவர்களிடம் ஏதும் இருக்கவில்லை. அப்போது, ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் தோழர்களை நோக்கி), ‘‘இன்றிரவு இவருக்கு விருந்தளிக்கும் ஆள் உண்டா? அவருக்கு அல்லாஹ் அருள் புரிவான்” என்று சொன்னார்கள். அப்போது அன்சாரிகளில் ஒருவர், ‘‘நான் (இவருக்கு விருந்தளிக்கிறேன்), அல்லாஹ்வின் தூதரே!” என்று சொல்லி (அவரை அழைத்துக்கொண்டு) தம் வீட்டாரிடம் சென்று தம் துணைவியாரை நோக்கி, ‘‘(இவர்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் விருந்தாளி. (இவருக்குத் தராமல்) எதனையும் நீ (உன்னிடமே) சேமித்துவைத்துக்கொள்ளாதே!” என்று சொன்னார். அதற்கு அவர் மனைவி, ‘‘அல்லாஹ்வின் மீதாணையாக! நம் குழந்தைகளின் உணவைத் தவிர என்னிடம் வேறெதுவுமில்லை” என்று பதிலளித்தார். அவர், ‘‘(நம்) குழந்தைகள் உணவு உண்ண விரும்பினால் அவர்களை (எப்படியாவது சமாதானப்படுத்தி) தூங்கச் செய்துவிடு! பிறகு நீ வந்து, (வீட்டிலிருக்கும் உணவைத் தயாராக எடுத்துவைத்துவிட்டு, விளக்கை ஏற்றிவிடுவதுபோல் பாவனை செய்து) விளக்கை அணைத்துவிடு! (இருப்பதை விருந்தாளிக்குக் கொடுத்துவிட்டு) இன்றிரவு நாம் வயிற்றைச் சுருக்கிக்கொள்வோம்” என்று சொன்னார். அவ்வாறே அவர் (மனைவி) செய்தார். பிறகு, (விருந்தளித்த) அம்மனிதர் காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றபோது, நபி (ஸல்) அவர்கள், ‘‘இன்னார் இன்னாரை (உங்கள் இருவரை)க் கண்டு வல்லமையும் மாண்பும் மிக்க அல்லாஹ் ‘வியப்படைந்தான்’ அல்லது (மகிழ்ச்சியால்) ‘சிரித்துக்கொண்டான்’ ‘‘ என்று சொன்னார்கள். அப்போது வல்லமையும் மாண்பும் மிக்க அல்லாஹ், ‘‘தமக்கே தேவை இருந்தும்கூட தம்மைவிடப் பிறருக்கே அவர்கள் முன்னுரிமை வழங்குகிறார்கள்...” எனும் (59:9ஆவது) வசனத்தை அருளினான்.8 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 409
			}
		}
	]
}