{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4900,
			"arabicnumber": 4900,
			"text": "ஸைத் பின் அர்கம் (ரலி) அவர்கள் கூறியதாவது: ஓர் அறப்போரில் நான் இருந்து கொண்டிருந்தேன்.2 அப்போது, (நயவஞ்சகர்களின் தலைவன்) அப்துல்லாஹ் பின் உபை (பின் சலூல்) என்பவன், ‘‘அல்லாஹ்வின் தூதருடன் இருப்பவர்களுக்கு (முஹாஜிர்களுக்கு) செலவு செய்வதை நிறுத்திவிடுங்கள்; அதனால், அவர்கள் அல்லாஹ்வின் தூதரிடமிருந்து விலகிச் சென்றுவிடுவார்கள்” என்று கூறிவிட்டுத் தொடர்ந்து, ‘‘நாம் இங்கிருந்து (மதீனாவுக்குத்) திரும்பினால், (எங்கள் இனத்தாரான) கண்ணியவான்கள் இழிந்தோ(ரான முஹாஜி)ர்களை மதீனாவிலிருந்து நிச்சயம் வெளியேற்றுவார்கள்” என்று கூறினான். அவன் கூறியதை ‘(நான்) என் சிறிய தந்தை(யாக மதிக்கும் ஒருவர்) இடம்’ அல்லது ‘உமர் (ரலி) அவர்களிடம்’ கூறினேன். அவர் அதை நபி (ஸல்) அவர்களிடம் கூறிவிட்டார். அப்போது நபி (ஸல்) அவர்கள் என்னை அழைத்தார்கள். (நான் சென்று அவன் சொன்னதை) நபி (ஸல்) அவர்களிடம் எடுத்துரைத்தேன். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அப்துல்லாஹ்விற்கும் அவனுடைய நண்பர்களுக்கும் ஆளனுப்பினார்கள். (அவர்கள் தம்மிடம் வந்தபோது அது குறித்து நபியவர்கள் வினவினார்கள்.) ‘‘நாங்கள் அவ்வாறு சொல்லவேயில்லை” என்று அவர்கள் சாதித்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நான் சென்னதை நம்ப மறுத்துவிட்டார்கள்; அப்துல்லாஹ் பின் உபை (சத்தியமிட்டுச்) சொன்னதை உண்மையென்று நம்பினார்கள். அப்போது, எனக்குக் கவலை ஏற்பட்டது. அது போன்ற கவலை (என் வாழ்நாளில்) ஒருபோதும் எனக்கு ஏற்பட்டதில்லை. பிறகு நான் என் வீட்டில் அமர்ந்துகொண்டிருந்தேன். அப்போது என் சிறிய தந்தை என்னிடம், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உன்னை நம்ப மறுத்து, உன் மீது கோபம் கொள்ளும் அளவுக்குச் செல்வார்கள் என நான் நினைத்துக்கூடப் பார்க்கவில்லை” என்று கூறினார்கள். அப்போது, ‘‘இந்த நயவஞ்சகர்கள் உங்களிடம் வருகின்றபோது” என்று தொடங்கும் இந்த (63:1ஆவது) வசனத்தை அல்லாஹ் அருளினான். உடனே நபி (ஸல்) அவர்கள் எனக்கு ஆளனுப்பினார்கள். (நான் சென்றபோது தம்மீது அருளப்பட்டிருந்த வசனத்தை எனக்கு) ஓதிக்காட்டினார்கள். பிறகு, ‘‘ஸைதே! அல்லாஹ் உம்மை உண்மைப்படுத்தி விட்டான் (நீர் சொன்னதை உண்மை என்று தெளிவுபடுத்திவிட்டான்)” என்று கூறினார்கள். அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 420
			}
		}
	]
}