{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4904,
			"arabicnumber": 4904,
			"text": "ஸைத் பின் அர்கம் (ரலி) அவர்கள் கூறியதாவது: நான் என் சிறிய தந்தையாருடன் இருந்துகொண்டிருந்தேன். அப்போது (நயவஞ்சகர்களின் தலைவன்) அப்துல்லாஹ் பின் உபை பின் சலூல் என்பான், ‘‘அல்லாஹ்வின் தூதருடன் இருப்போருக்கு (முஹாஜிர்களுக்கு) நீங்கள் செலவு செய்வதை நிறுத்திவிடுங்கள். அவர்கள் (அவரிடமிருந்து) விலகிச் சென்றுவிடுவர். நாங்கள் மதீனாவிற்குத் திரும்பிச் சென்றால், (எங்கள் இனத்தாரான) கண்ணியவான்கள் இழிந்தோ(ராகிய முஹாஜி)ர்களை அங்கிருந்து நிச்சயம் வெளியேற்றிவிடுவர்” என்று கூறுவதை நான் கேட்டேன். அதை நான் என் சிறிய தந்தையாரிடம் கூறினேன். என் சிறிய தந்தையார் அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சொல்லிவிட்டார்கள். (ஆனால்,) அப்துல்லாஹ்வையும் அவனுடைய ஆட்களையும் உண்மையாளர்கள் என நபியவர்கள் நம்பினார்கள். பின்னர், என்னை அழைத்(து விசாரித்)தார்கள். நான் அவர்களிடம் (நடந்ததை) எடுத்துரைத்தேன். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அப்துல்லாஹ் பின் உபை மற்றும் அவனுடைய நண்பர்களுக்கு ஆளனுப்பினார்கள். அவர்கள் வந்து, ‘‘நாங்கள் அப்படிச் சொல்லவேயில்லை” என்று சத்தியம் செய்தனர். (அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நம்பினார்கள்.) என்னை நம்ப மறுத்துவிட்டார்கள். (என் வாழ்நாளில்) அதற்குமுன் இது போன்ற ஒரு கவலை ஏற்பட்டதே இல்லை எனும் அளவுக்கு என்னைக் கவலை ஆட்கொண்டது. ஆகவே, நான் எனது வீட்டில் (கவலையோடு) அமர்ந்தேன். என் சிறிய தந்தையார் (என்னிடம்), ‘‘நபி (ஸல்) அவர்கள் உன்னை நம்ப மறுத்து, உன்மீது கோபமடையும் அளவுக்குச் செல்வார்கள் என நான் நினைக்கவில்லை” என்று கூறினார்கள். அப்போது அல்லாஹ், ‘‘(நபியே!) இந்த நயவஞ்சகர்கள் உம்மிடம் வருகின்றபோது, நிச்சயமாக, நீங்கள் அல்லாஹ்வின் தூதராவீர்கள் என நாங்கள் சாட்சியம் அளிக்கின்றோம் என்று கூறுகின்றனர்” எனும் (63:1ஆவது) வசனத்தை அருளினான். உடனே எனக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஆளனுப்பினார்கள். (நான் அவர்களிடம் சென்றபோது) அந்த வசனத்தை எனக்கு ஓதிக்காட்டினார்கள். பிறகு, ‘‘ஸைதே! அல்லாஹ் உம்மை உண்மைப்படுத்திவிட்டான்” என்று கூறினார்கள்.3 அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 424
			}
		}
	]
}