{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4970,
			"arabicnumber": 4970,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் பத்ர் போரில் கலந்துகொண்ட புண்ணியவான்களுடன் எனக்கும் (தம் அவையில்) இடமளித்து வந்தார்கள். ஆகவே, அவர்களில் சிலர் வருத்தமடைந்து, ‘‘எங்களுக்கு இவரைப் போன்ற (வயதில்) பிள்ளைகள் இருக்க, இவரை எங்களுடன் ஏன் அமரச் செய்கிறீர்கள்?” என்று கேட்டார்கள். அதற்கு உமர் (ரலி) அவர்கள், ‘‘அவர் நீங்கள் அறிந்துள்ள வகையில் (அருமை பெருமைகள் உடையவராக) இருக்கிறார் என்பதால்தான்” என்றார்கள். பின்னர் ஒருநாள் (எங்களை) உமர் (ரலி) அவர்கள் (தமது அவைக்கு) அழைத்தார்கள். அப்போதும் என்னை அவர்களுடன் அமரச் செய்தார்கள். அவர்களுக்கு (என் தகுதியை உணர்த்திக்) காட்டுவதற்காகவே அன்று என்னை அழைத்தார்கள் என்றே கருதினேன். (எனவே, அனைவரும் வந்ததும் அவர்களிடம்) உமர் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் உதவியும் வெற்றியும் வந்துவிட்டால்...” எனும் (110:1ஆவது) இறைவசனம் குறித்து நீங்கள் என்ன (விளக்கம்) கூறுகிறீர்கள்? என்று கேட்டார்கள். அதற்கு அவர்களில் சிலர், ‘‘நமக்கு உதவியும் வெற்றியும் அளிக்கப்படும்போது அல்லாஹ்வைப் புகழும்படியும் அவனிடம் பாவமன்னிப்புக் கோரும்படியும் நாம் பணிக்கப்பட்டுள்ளோம்” என்று (அவ்வசனத்திற்கு விளக்கம்) கூறினர். அவர்களில் இன்னும் சிலர் ஏதும் சொல்லாமல் அமைதியாயிருந்தனர். அப்போது உமர் (ரலி) அவர்கள் என்னிடம், ‘‘இப்னு அப்பாஸே! நீங்களும் இவ்வாறுதான் கூறுகிறீர்களா?” எனக் கேட்டார்கள். நான், ‘இல்லை’ என்றேன். ‘‘அவ்வாறாயின், நீங்கள் என்ன கூறுகின்றீர்கள்?” என்று கேட்டார்கள். நான், ‘‘அது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு அவர்களது ஆயுட்காலம் (முடிந்துவிட்டதைக்) குறித்து (முன்)அறிவிப்புச் செய்ததாகும். ‘இறைவனின் உதவியும் வெற்றியும் வந்துவிட்டால்...’ அதாவது இது, உங்களின் ஆயுட்காலம் (முடிந்துவிட்டது) பற்றிய அறிகுறியாகும். எனவே, உங்களுடைய இறைவனைப் புகழ்ந்து, அவனது தூய்மையை எடுத்துரைத்து, அவனிடம் பாவமன்னிப்புக் கோருங்கள். அவன் பாவமன்னிப்பை ஏற்றுக்கொள்பவன் ஆவான் (என்பதே இதன் விளக்கமாகும்)” என்று பதிலளித்தேன். அப்போது உமர் (ரலி) அவர்கள், ‘‘நீங்கள் கூறுகின்ற விளக்கத்தையே இ(ந்த அத்தியாயத்)திலிருந்து நானும் அறிகின்றேன்” என்று சொன்னார்கள்.4 111. ‘அல்லஹப்’ அத்தியாயம்1 (அளவிலா அருளாளன் நிகரிலா அன்புடையோன் அல்லாஹ்வின் திருப்பெயரால்...) (111:1ஆவது வசனத்தின் மூலத்திலுள்ள ‘தப்ப’ எனும் சொல்லின் வேர்ச்சொல்லும், 40:37ஆவது வசனத்தின் மூலத்தில் இடம்பெற்றதுமான) ‘தபாப்’ எனும் சொல்லுக்கு ‘இழப்பு’ என்பது பொருள். (11:101ஆவது வசனத்தின் மூலத்திலுள்ள) ‘தத்பீப்’ எனும் சொல்லுக்கு ‘சீரழிவு’ என்று பொருள். அத்தியாயம் : 65",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 492
			}
		}
	]
}