{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4986,
			"arabicnumber": 4986,
			"text": "(வேதஅறிவிப்பை எழுதுவோரில் ஒருவராக இருந்த) ஸைத் பின் ஸாபித் அல்அன்சாரீ (ரலி) அவர்கள் கூறியதாவது: யமாமா போர் நடைபெற்றபின் (கலீஃபா) அபூபக்ர் (ரலி) அவர்கள், எனக்கு ஆளனுப்பி (என்னை அழைத்துவரச் சொன்)னார்கள். (நான் சென்றேன்.) அங்கே அவர்களுடன் உமர் பின் அல்கத்தாப் (ரலி) அவர்களும் இருந்தார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் கூறினார்கள்: உமர் (ரலி) அவர்கள் என்னிடம் வந்து, ‘‘இந்த யமாமா போரில் ஏராளமான குர்ஆன் அறிஞர்கள் கொல்லப்பட்டுவிட்டனர். (இறைமறுப் பாளர்களுடன் போர் நடக்கும்) பல்வேறு இடங்களில் குர்ஆன் அறிஞர்களில் ஏராளமான பேர் கொல்லப்பட்டு, அதனால் குர்ஆனின் பெரும் பகுதி (நம்மைவிட்டுப்) போய்விடுமோ என நான் அஞ்சுகிறேன். (ஆகவே,) தாங்கள் குர்ஆனைத் திரட்டி ஒன்றுசேர்க்க உத்தரவிட வேண்டுமென நான் கருதுகின்றேன்” என்று கூறினார்கள். நான், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நாம் எப்படிச் செய்வது?” என உமர் அவர்களிடம் கேட்டேன். அதற்கு உமர் அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! இது (குர்ஆனைத் திரட்டுவது) நன்மை(யான பணி)தான்” என்று கூறினார்கள். இதற்காக என் மனத்தை அல்லாஹ் விரிவாக்கும்வரை இந்த விஷயத்தில் (தொடர்ந்து) அவர்கள் என்னிடம் வலியுறுத்திக்கொண்டேயிருந்தார்கள். (முடிவில்) உமர் அவர்கள் கருதியதை(யே) நானும் (உசிதமானதாகக்) கண்டேன். (இதை அபூபக்ர் அவர்கள் என்னிடம் தெரிவித்தபோது உமர் (ரலி) அவர்கள் ஏதும் பேசாமல் அபூபக்ர் (ரலி) அவர்களுக்கு அருகில் அமர்ந்துகொண்டிருந்தார்கள்.) (பிறகு) அபூபக்ர் (ரலி) அவர்கள் (என்னிடம்), ‘‘(ஸைதே!) நீங்கள் புத்திசாóயான இளைஞர்; உங்களை நாங்கள் (எந்த விதத்திலும்) சந்தேகப்படமாட்டோம். நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக ‘வஹீ’ (வேத வசனங்களை) எழுதக்கூடியவராயிருந்தீர்கள். எனவே, நீங்கள் குர்ஆனைத் தேடிக் கண்டுபிடித்து (ஒரே பிரதியில்) ஒன்றுதிரட்டுங்கள்” என்று கூறினார்கள். அல்லாஹ்வின் மீதாணையாக! மலைகளில் ஒன்றை நகர்த்த வேண்டுமென எனக்கு அவர்கள் கட்டளையிட்டிருந்தாலும்கூட அது எனக்குப் பளுவாக இருந்திருக்காது. குர்ஆனை ஒன்றுதிரட்டும்படி எனக்கு அவர்கள் கட்டளையிட்டது அதைவிட எனக்குப் பளுவாக இருந்தது. நான், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நீங்கள் எப்படிச் செய்கிறீர்கள்?” என்று கேட்டேன். அதற்கு அபூபக்ர் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! இது நன்மை(யான பணி)தான்” என்று பதிலளித்தார்கள். இதையே அன்னார் என்னிடம் தொடர்ந்து வலியுறுத்திக்கொண்டிருந்தார்கள். முடிவில் எதற்காக அபூபக்ர் மற்றும் உமர் ஆகியோரின் மனத்தை அல்லாஹ் விரிவாக்கினானோ அதற்காக என் மனத்தையும் அல்லாஹ் விரிவாக்கினான். (குர்ஆனை ஒன்றுதிரட்ட முன்வந்தேன்.) ஆகவே, (மக்களின் கரங்களிலிருந்த) குர்ஆன் (சுவடிகளைத்) தேடினேன். அவற்றை பேரீச்ச மட்டைகள், ஓடுகள் மற்றும் (குர்ஆனை மனனம் செய்திருந்த) மனிதர்களின் நெஞ்சுகளிலிருந்து திரட்டினேன். (இவ்வாறு திரட்டியபோது) ‘அத்தவ்பா’ எனும் (9ஆவது) அத்தியாயத்தின் கடைசி (இரு) வசனங்களை அபூகுஸைமா அல்அன்சாரீ (ரலி) அவர்களிடமிருந்து பெற்றேன்; அவரல்லாத வேறெவரிடமிருந்தும் அவற்றை நான் பெறவில்லை. (அவை:) உங்களிலிருந்தே ஒரு தூதர் உங்களிடம் வந்திருக்கின்றார். நீங்கள் துன்பத்திற்குள்ளாவது அவருக்குக் சிரமமாக இருக்கிறது. மேலும், உங்கள் (வெற்றியின்) விஷயத்தில் பேராவல் கொண்டவராகவும், நம்பிக்கையாளர்கள் மீது அதிகப் பரிவும், கருணையும் உடையோராகவும் அவர் இருக்கின்றார். (நபியே! இதற்குப்) பின்னரும் அவர்கள் உம்மைப் புறக்கணித்தால் நீர் கூறிவிடும்: அல்லாஹ் எனக்குப் போதுமானவன். அவனைத் தவிர வேறு இறைவன் இல்லை. அவனையே நான் முழுமையாகச் சார்ந்திருக்கின்றேன். மேலும், அவன் மகத்தான அரியணையின் அதிபதியாயிருக்கின்றான். (9:128, 129) (என் வாயிலாக) திரட்டித் தொகுக்கப்பட்ட குர்ஆன் பிரதிகள் (கலீஃபா) அபூபக்ர் (ரலி) அவர்களிடம், அவர்களை அல்லாஹ் இறக்கச் செய்யும்வரை இருந்(து வந்)தது. பின்னர் (கலீஃபாவான) உமர் (ரலி) அவர்களிடம் அவர்களின் வாழ்நாளில் இருந்தது. (அவர்களது இறப்பிற்குப்) பிறகு உமர் (ரலி) அவர்களுடைய புதல்வி ஹஃப்ஸா (ரலி) அவர்களிடம் இருந்தது.8 அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 8
			}
		}
	]
}