{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4987,
			"arabicnumber": 4987,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் உஸ்மான் (ரலி) அவர்களிடம் (அவர்களது ஆட்சிக் காலத்தின்போது மதீனாவிற்கு) வருகை புரிந்தார்கள். அப்போது (கலீஃபா) உஸ்மான் (ரலி) அவர்கள், அர்மீனியா மற்றும் ஆதர்பைஜான் ஆகிய நாடுகளை இராக்கியருடன் சேர்ந்து வெற்றி கொள்வதற்கு ஷாம்வாசிகளை ஆயத்தப்படுத்தியிருந்தார்கள்.9 (இப்போரில் கலந்துகொண்டிருந்த) ஹ’தைஃபா (ரலி) அவர்களை, குர்ஆன் ஓதும் முறைகளில் மக்களிடையே எழுந்த கருத்து வேறுபாடு அதிர்ச்சிக் குள்ளாக்கியது.10 ஆகவே, ஹுதைஃபா (ரலி) அவர்கள் உஸ்மான் (ரலி) அவர்களிடம், ‘‘யூதர்களும் கிறித்தவர்களும் (தங்களுடைய வேதங்களில்) கருத்து வேறுபாடு கொண்டதுபோல் இந்தச் சமுதாயமும் இந்த(த் திருக்குர்ஆன்) வேதத்தில் கருத்து வேறுபாடு கொள்வதற்கு முன்பே இவர்களைக் காப்பாற்றுங்கள், இறைநம்பிக்கையாளர்களின் தலைவர் அவர்களே!” என்று கூறினார்கள். ஆகவே, உஸ்மான் (ரலி) அவர்கள் (அன்னை) ஹஃப்ஸா (ரலி) அவர்களிடம் ஆளனுப்பி, ‘‘தங்களிடமுள்ள குர்ஆன் பதிவை எங்களிடம் கொடுத்து அனுப்புங் கள்! நாங்கள் அதனைப் பல பிரதிகள் படியெடுத்துவிட்டு திருப்பித் தந்துவிடுகிறோம்” என்று தெரிவித்தார்கள். எனவே, ஹஃப்ஸா (ரலி) அவர்கள் தம்மிடமிருந்த குர்ஆன் பதிவை உஸ்மான் (ரலி) அவர்களிடம் கொடுத்தனுப்பினார்கள். ஸைத் பின் ஸாபித் (ரலி), அப்துல்லாஹ் பின் அஸ்ஸுபைர் (ரலி), சயீத் பின் அல்ஆஸ் (ரலி), அப்துர் ரஹ்மான் பின் ஹாரிஸ் பின் ஹிஷாம் (ரலி) ஆகியோரிடம் அவற்றைப் பல பிரதிகளில் படியெடுக்கும்படி உஸ்மான் (ரலி) அவர்கள் உத்தரவிட்டார்கள். மேலும், உஸ்மான் (ரலி) அவர்கள் (அந்த நால்வரில்) குறைஷிக் குழுவினரான மூவரை நோக்கி, ‘‘நீங்களும் (அன்சாரியான) ஸைத் பின் ஸாபித் அவர்களும் குர்ஆனில் ஏதேனும் ஒரு (எழுத்திலக்கண) விஷயத்தில் கருத்து வேறுபாடு கொண்டால் குறைஷியரின் (வட்டார) மொழி வழக்குப்படியே பதிவு செய்யுங்கள். ஏனெனில், குர்ஆன் குறைஷியரின் மொழி வழக்குப்படியே அருளப்பெற்றது” என்று கூறினார்கள். அந்த நால்வரும் அவ்வாறே செயல்பட்டார்கள். (ஹஃப்ஸா (ரலி) அவர்களிடமிருந்த) அந்த குர்ஆன் பதிவைப் பல பிரதிகளில் படியெடுத்தார்கள். பிறகு உஸ்மான் (ரலி) அவர்கள் அந்தப் பிரதியை ஹஃப்ஸா (ரலி) அவர்களிடமே திருப்பிக் கொடுத்துவிட்டார்கள். பிறகு அவர்கள் படியெடுத்த பிரதிகளில் ஒவ்வொன்றையும் ஒவ்வொரு பகுதிக்கு அனுப்பிவைத்தார்கள். இதுவல்லாமல் (புழக்கத்திலிருந்த) இதர பிரதிகளை, அல்லது ஏடுகளை எரித்துவிடும்படி உஸ்மான் (ரலி) அவர்கள் உத்தரவிட்டார்கள். அத்தியாயம் : 66",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 9
			}
		}
	]
}