{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5122,
			"arabicnumber": 5122,
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (என் தந்தை) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் (தம் மருமகன்) குனைஸ் பின் ஹுதாஃபா அஸ்ஸஹ்மீ (ரலி) அவர்கள் இறந்துவிட்டதால் (மகள்) ஹஃப்ஸா விதவையானபோது (அவரை வேறொருவருக்கு மணமுடித்துவைக்க எண்ணினார்கள்.) -குனைஸ் (ரலி) அவர்கள் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களுடைய தோழர்களில் ஒருவராவார். மேலும், அவர் மதீனாவில் இறந்தார்.- உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் கூறினார்கள்: எனவே, நான் உஸ்மான் பின் அஃப்பான் (ரலி) அவர்களிடம் சென்று, (என் மகள்) ஹஃப்ஸாவைக் குறித்து எடுத்துக் கூறினேன். அதற்கு உஸ்மான் (ரலி) அவர்கள், ‘‘(தங்கள் மகளை நான் மணமுடித்துக்கொள்ளும் இந்த) என் விஷயத்தில் நான் யோசிக்க வேண்டி யுள்ளது; (யோசித்து என் முடிவைக் கூறுகிறேன்)” என்று சொன்னார்கள். சில நாட்கள் பொறுத்திருந்தேன். பிறகு உஸ்மான் (ரலி) அவர்கள் என்னைச் சந்தித்து, ‘‘இப்போது திருமணம் செய்துகொள்ள வேண்டாம் என்றே எனக்குத் தோன்றியது” என்று கூறினார்கள். ஆகவே, நான் அபூபக்ர் அஸ்ஸித்தீக் (ரலி) அவர்களைச் சந்தித்தேன். (அவர்களிடம்) ‘‘நீங்கள் விரும்பினால், என் மகள் ஹஃப்ஸாவைத் தங்களுக்குத் திருமணம் முடித்து வைக்கிறேன்” என்று கூறினேன். அபூபக்ர் (ரலி) அவர்கள் அமைதியாக இருந்தார்கள். எனக்கு அவர்கள் எந்தப் பதிலையும் கூறவில்லை. எனவே, உஸ்மான் (ரலி) அவர்களைவிட அபூபக்ர் (ரலி) அவர்கள்மீதே நான் மிகவும் மனவருத்தம் கொண்டவனாக இருந்தேன். சில நாட்கள் பொறுத்திருந்தேன். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஹஃப்ஸாவைப் பெண் கேட்டார்கள். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு ஹஃப்ஸாவைத் திருமணம் செய்துவைத்தேன். பிறகு (ஒருநாள்) அபூபக்ர் (ரலி) அவர்கள் என்னைச் சந்தித்து, ‘‘நீங்கள் என்னிடம் ஹஃப்ஸா அவர்களைக் குறித்துச் சொன்னபோது நான் உங்களுக்குப் பதிலேதும் கூறாததால், உங்களுக்கு என்மீது மனவருத்தம் இருக்கக்கூடும்” என்று கூறினார்கள். நான், ‘‘ஆம்” என்று சொன்னேன். (அதற்கு) அபூபக்ர் (ரலி) அவர்கள், ‘‘நீங்கள் கூறியபோது நான் உங்களுக்கு பதில் கூறாததற்குக் காரணம், அல்லாஹ் வின் தூதர் (ஸல்) அவர்கள் ஹஃப்ஸா அவர்களை (தாம் மணம் புரிந்துகொள்வது) பற்றிப் பேசியதை நான் அறிந்திருந்ததே ஆகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் இந்த இரகசியத்தை நான் வெளிப்படுத்த விரும்பவில்லை. (எனவேதான், உங்களுக்குப் பதிலேதும் கூறவில்லை). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ‘ஹஃப்ஸாவை (திருமணம் செய்யாமல்) விட்டிருந்தால், உறுதியாக அவர்களை நான் (மனைவியாக) ஏற்றுக்கொண்டிருப்பேன்” என்று கூறினார்கள்.62 அத்தியாயம் : 67",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 58
			}
		}
	]
}