{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5259,
			"arabicnumber": 5259,
			"text": "சஹ்ல் பின் சஅத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: அஜ்லான் குலத்தைச் சேர்ந்த உவைமிர் (ரலி) அவர்கள் (தமது குலத்தின் தலைவரான) ஆஸிம் பின் அதீ அல்அன்சாரீ (ரலி) அவர்களிடம் வந்து, ‘‘ஆஸிம் அவர்களே! தம் மனைவியுடன் மற்றோர் அந்நிய ஆடவன் (தகாத உறவு கொண்டபடி) இருக்கக் கண்ட ஒரு மனிதனின் விஷயத்தில் என்ன கூறுகின்றீர்கள்? அவன் அந்த (அந்நிய) ஆடவனைக் கொன்றுவிடலாமா? அவ்வாறு கொன்றுவிட்டால் (பழிவாங்கும் சட்டப்படி) அவனை நீங்கள் கொன்றுவிடுவீர்களா? அல்லது அவன் வேறு என்ன செய்ய வேண்டும்? எனக்காக இந்த விவகாரம் குறித்து ஆஸிமே! நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்டுச் சொல்லுங்கள்” என்று கூறினார். ஆகவே, (ஆஸிம் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று கேட்கத் தொடங்க) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இத்தகைய) கேள்விகளை விரும்பவில்லை. அவற்றை அநாகரிகமாகக் கருதலானார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து கேட்ட (கண்டன) வார்த்தைகள் ஆஸிம் (ரலி) அவர்களுக்குக் கடினமாயிற்று. ஆஸிம் (ரலி) அவர்கள் தம் வீட்டாரிடம் திரும்பி வந்தபோது உவைமிர் வந்து, ‘‘ஆஸிம் அவர்களே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உங்களிடம் என்ன சொன்னார்கள்?” என்று கேட்டார்கள். அதற்கு ஆஸிம் (ரலி) அவர்கள், ‘‘நீ எனக்கு நன்மை செய்யவில்லை. (சிக்கலில் என்னைச் சிக்கவைத்துவிட்டாய்;) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு நான் கேட்ட இந்தக் கேள்வி பிடிக்கவில்லை” என்று பதிலளித்தார்கள். அதற்கு உவைமிர், ‘‘அல்லாஹ்வின் மீதாணையாக! நானே (நேரடியாக) இது குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேட்காமல் ஓயமாட்டேன்” என்று கூறியபடி மக்களிடையேயிருந்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை நோக்கிச் சென்றார். பிறகு, ‘‘அல்லாஹ்வின் தூதரே! ஒரு மனிதன் தன் மனைவியுடன் அந்நிய ஆடவன் (தகாத உறவு கொண்ட நிலையில்) இருக்கக் கண்டால் அவன் அந்த ஆடவனைக் கொல்லலாமா? (அப்படிக் கொன்றுவிட்டால் பழிக்குப்பழியாக) நீங்கள் அம்மனிதனைக் கொன்றுவிடுவீர்களா? அல்லது அவன் வேறு என்ன செய்ய வேண்டும்? சொல்லுங்கள்” என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அல்லாஹ் உமது விஷயத்திலும் உம்முடைய மனைவி விஷயத்திலும் (குர்ஆன் வசனத்தை) அருளிவிட்டான். ஆகவே, நீர் சென்று, உம்முடைய மனைவியை அழைத்து வாரும்!” என்று சொன்னார்கள். பிறகு அவர்கள் இருவரும் (‘லிஆன்’ எனும்)சாப அழைப்புப் பிரமாணம் செய்தனர். அப்போது மக்களுடன் நானும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அருகில் இருந்தேன். (தம்பதியர்) இருவரும் (லிஆன் செய்து) முடித்தபோது (கணவரான) உவைமிர், ‘‘அல்லாஹ்வின் தூதரே! நான் இவளை (மணவிலக்குச் செய்யாமல் மனைவியாகவே இனியும்) வைத்திருந்தால் இவள்மீது நான் பொய்(யான குற்றச்சாட்டு) சொன்னவனாக ஆகிவிடுவேன்” என்று கூறிவிட்டு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவருக்கு ஆணையிடுவதற்கு முன்பே அவளை முத்தலாக் சொல்லிவிட்டார். (இதன் அறிவிப்பாளர்களில் ஒருவரான) இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு இந்த வழிமுறையே (அவர்களுக்குப்பின்) ‘லிஆன்’ செய்யும் தம்பதியருக்கு முன்மாதிரி ஆகிவிட்டது.11 அத்தியாயம் : 68",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 9
			}
		}
	]
}