{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5375,
			"arabicnumber": 5375,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: எனக்கு (பசியால்) கடும் சோர்வு ஏற்பட்டது. ஆகவே, நான் உமர் பின் அல்கத்தாப் (ரலி) அவர்களைச் சந்தித்தேன். அப்போது நான் அவர்களிடம், அல்லாஹ்வின் வேதத்திலிருந்து ஏதேனும் ஒரு வசனத்தை ஓதும்படி கேட்டேன். உடனே அவர்கள் தம் வீட்டினுள் நுழைந்து குர்ஆன் வசனத்தை எனக்கு ஓதிக்காட்டினார்கள்.4 (அங்கிருந்து வெளியேறி) சற்று தூரம்தான் நான் நடந்திருப்பேன். அதற்குள் சோர்வாலும் பசியாலும் நான் முகம் குப்புற விழுந்துவிட்டேன். (மூர்ச்சை தெளிந்து பார்த்தபோது) என் தலைமாட்டில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நின்றுகொண்டிருந்தார்கள். அவர்கள் (என்னை நோக்கி), ‘அபூஹுரைரா!’ என்று அழைத்தார்கள். நான், ‘‘இதோ கீழ்ப்படியக் காத்திருக்கிறேன், அல்லாஹ்வின் தூதரே; கட்டளையிடுங்கள்” என்று பதிலளித்தேன். அவர்கள் என் கரத்தைப் பிடித்து என்னைத் தூக்கி நிறுத்தினார்கள். எனக்கேற்பட்டிருந்த நிலையைப் புரிந்துகொண்டார்கள். என் னைத் தம்முடன் அழைத்துக்கொண்டு தமது இல்லம் சென்றார்கள். எனக்கு ஒரு பெரிய பாத்திரத்தில் பால் வழங்க உத்தரவிட்டார்கள். நான் அதிலிருந்து (பால்) அருந்தினேன். பிறகு நபி (ஸல்) அவர்கள் ‘‘இன்னும் அருந்துங்கள், அபூஹிர்!” என்று சொன்னார்கள். அவ்வாறே நான் மறுபடியும் அருந்தினேன். பிறகு ‘‘மீண்டும் (அருந்துங்கள்)” என்றார்கள். நான் வயிறு நிரம்பும்வரை மீண்டும் அருந்தினேன். ஆகவே, வயிறு (உப்பி) பாத்திரத்தைப் போன்றாகிவிட்டது. பிறகு, நான் உமர் (ரலி) அவர்களைச் சந்தித்து, அவர்களிடம் எனக்கு நடந்த நிகழ்ச்சியைத் தெரிவித்தேன். ‘‘(என் பசியைப் போக்கும் பொறுப்பை) உங்களைவிட அதற்கு மிகவும் தகுதியுடையவரிடம் அல்லாஹ் ஒப்படைத்துவிட்டான். உமரே! அல்லாஹ்வின் மீதாணையாக! உங்களைவிட நான் இறைவசனத்தை நன்கு ஓதத் தெரிந்தவனாக இருந்துகொண்டே அதை எனக்கு ஓதிக்காட்டும்படி உங்களிடம் நான் கேட்டேன்” என்று சொன்னேன். உமர் (ரலி) அவர்கள், ‘‘அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (என் வீட்டிற்கு) அழைத்துச் சென்று (உங்களுக்கு உணவளித்து) இருந்தால், அதுவே எனக்கு (விலை உயர்ந்த) சிவப்பு ஒட்டகங்கள் கிடைப்பதைவிட விருப்பமானதாய் இருந்திருக்கும்” என்று சொன்னார்கள்.5 அத்தியாயம் : 70",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 3
			}
		}
	]
}