{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5401,
			"arabicnumber": 5401,
			"text": "பத்ர் போரில் கலந்துகொண்ட அன்சாரி நபித்தோழர்களில் ஒருவரான இத்பான் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, ‘‘அல்லாஹ்வின் தூதரே! நான் என் சமூகத்தாருக்குத் தொழுகை நடத்துபவனாக இருக்கிறேன். நான் கண் பார்வையை இழந்துவருகிறேன். மழை வந்தால் எனக்கும் (என் சமூகத்தாரான) அவர்களுக்குமிடையே உள்ள பள்ளத்தாக்கில் வெள்ளம் வழிந்தோடும். அவர்களின் பள்ளிவாசலுக் குச் சென்று அவர்களுக்கு என்னால் தொழவைக்க இயலவில்லை. ஆகவே, அல்லாஹ்வின் தூதரே! தாங்கள் வந்து எனது வீட்டில் தொழுகை நடத்த வேண்டுமென்றும் (தாங்கள் நின்று தொழும்) அந்த இடத்தை நான் (என்) தொழுமிடமாக ஆக்கிக்கொள்ள வேண்டுமென்றும் நான் விரும்பினேன்” என்று சொன்னேன். அதற்கு நபி (ஸல்) அவர்கள், ‘‘இன்ஷா அல்லாஹ் (அல்லாஹ் நாடினால்) நான் (அவ்வாறே) செய்வேன்” என்று சொன்னார்கள். தொடர்ந்து இத்பான் (ரலி) அவர்கள் கூறலானார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் மறுநாள் நண்பகல் நேரத்தில் என்னிடம் வந்தனர். நபி (ஸல்) அவர்கள் (என் இல்லத்தினுள் வர) அனுமதி கேட்டார்கள். நான் அனுமதியளித்தேன். வீட்டினுள் வந்த நபி (ஸல்) அவர்கள் உடனே உட்காரவில்லை. பிறகு என்னிடம், ‘‘(இத்பானே!) உங்கள் வீட்டில் எந்த இடத்தில் நான் தொழ வேண்டுமென்று நீங்கள் விரும்புகிறீர்கள்?” என்று கேட்டார்கள். நான் வீட்டின் ஒரு மூலையைக் காட்டினேன். நபி (ஸல்) அவர்கள் (அந்த இடத்தில்) நின்று ‘தக்பீர் (தஹ்ரீம்)’ சொன்னார்கள். நாங்கள் (அவர்களுக்குப் பின்னே) அணிவகுத்து நின்றுகொண்டோம். அவர்கள் இரண்டு ரக்அத்கள் தொழுதுவிட்டு ‘சலாம்’ கொடுத்தார்கள். நாங்கள் தயாரித்திருந்த ‘கஸீர்’ எனும் (கஞ்சி) உணவி(னை உட்கொள்வத)ற்காக அவர்களை நாங்கள் இருக்கவைத்தோம். (நபி (ஸல்) அவர்கள் வந்திருந்ததைக் கேள்விப்பட்ட) அந்தப் பகுதி மக்களில் கணிசமான பேர் (சிறுகச் சிறுக) வந்து என் வீட்டில் திரண்டுவிட்டனர். அம்மக்களில் ஒருவர், ‘‘மாலிக் பின் துக்ஷுன் எங்கே?” என்று கேட்டார். அதற்கு அவர்களில் மற்றொருவர், ‘‘அவர் அல்லாஹ்வையும் அல்லாஹ்வுடைய தூதரையும் நேசிக்காத ஒரு நயவஞ்சகர். (அதனால்தான் அல்லாஹ்வின் தூதரைச் சந்திக்க அவர் வரவில்லை)” என்று சொன்னார். நபி (ஸல்) அவர்கள் ‘‘அப்படிச் சொல்லாதீர்கள். அல்லாஹ்வின் அன்பை நாடியவராக அவர் ‘‘லா இலாஹ இல்லல்லாஹு” (அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை) என்று சொன்னதை நீங்கள் பார்க்கவில்லையா?” என்று கேட்டார்கள். அதற்கு அவர், ‘‘அல்லாஹ்வும் அவனுடைய தூதரும் மிக அறிந்தவர்கள்” என்று சொன்னார். அப்போது நாங்கள் ‘‘(அல்லாஹ்வின் தூதரே!) அவர் (மாலிக் பின் துக்ஷுன்) நயவஞ்சகர்களுடன் தொடர்பு வைத்திருப் பதையும் அவர்கள்மீது அபிமானம் கொண்டிருப்பதையும் காண்கிறோம். (அதனால்தான் அவ்வாறு சொல்லப்பட்டது)” என்று கூறினோம். அதற்கு நபி (ஸல்) அவர்கள், ‘‘அல்லாஹ்வின் அன்பை நாடி ‘லா இலாஹ இல்லல்லாஹ்’ என்று சொன்ன வரை நரகத்திலிருந்து அல்லாஹ் தடுத்து (ஹராமாக்கி)விட்டான் அல்லவா?” என்று கேட்டார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அறிவிப்பாளர் களில் ஒருவரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் சொன்னார்கள்: பனூ சாலிம் குலத்தாரில் ஒருவரும் அவர்களில் முக்கியமானவர்களில் ஒருவருமான ஹுசைன் பின் முஹம்மத் அல்அன்சாரீ (ரஹ்) அவர்களிடம் மஹ் மூத் பின் ரபீஉ அல்அன்சாரீ அவர்கள் அறிவித்த இந்த ஹதீஸ் குறித்துக் கேட்டேன். அவர்கள் அதை (‘‘இது உண்மைதான்” என்று) உறுதிப்படுத்தி னார்கள்.25 அத்தியாயம் : 70",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 29
			}
		}
	]
}