{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5407,
			"arabicnumber": 5407,
			"text": "அபூகத்தாதா அஸ்ஸலமீ (ரலி) அவர்கள் கூறியதாவது: நான் (ஹுதைபிய்யா ஆண்டில்) ஒரு நாள் மக்கா (செல்லும்) சாலையில் இருந்த ஓரிடத்தில் நபித்தோழர்கள் சிலருடன் அமர்ந்திருந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்கள் முன்னால் தங்கியிருந்தார்கள். மக்கள் அனைவரும் இஹ்ராம் கட்டியிருந்தார்கள். நான் (மட்டும்) இஹ்ராம் கட்டியிருக்கவில்லை. அப்போது மக்கள் ஒரு காட்டுக் கழுதையைக் கண்டனர். நானோ எனது செருப்பைத் தைப்பதில் ஈடுபட்டிருந்தேன். அவர்கள் அக்கழுதை குறித்து எனக்கு அறிவிக்கவில்லை. (ஆனால்,) நான் அதைப் பார்க்க வேண்டுமென்று அவர்கள் விரும்பினார்கள். நான் (தற்செயலாக) அதைத் திரும்பிப் பார்த்தேன். உடனே நான் எழுந்து குதிரையின் பக்கம் சென்று அதற்குச் சேணமிட்டு அதில் ஏறினேன். சாட்டையையும் ஈட்டியையும் (எடுத்துக்கொள்ள) நான் மறந்துவிட்டேன். நான் அவர்களிடம் ‘‘அந்தச் சாட்டையையும் ஈட்டியையும் எடுத்து என்னிடம் கொடுங்கள்” என்று சொன்னேன். அதற்கு (இஹ்ராம் கட்டியிருந்த) அவர்கள், ‘‘மாட்டோம். அல்லாஹ்வின் மீதாணையாக! இதற்குச் சிறிதும் நாங்கள் உமக்கு உதவமாட்டோம்” என்று சொன்னார்கள். நான் கோபமுற்று இறங்கி அவ்விரண்டையும் எடுத்துக்கொண்டு (குதிரையின் மீது) ஏறினேன். காட்டுக் கழுதையைத் தாக்கி அதை (அதன் கால் நரம்புகளில்) வெட்டினேன். பிறகு அதை (மக்களிடம்) கொண்டுவந்தேன். அதற்குள் அது இறந்துவிட்டிருந்தது. மக்கள் அதை(ச் சமைத்து) உண்பதற்காக அதன்மீது பாய்ந்தார்கள். பிறகு அவர்கள் ‘தாம் இஹ்ராம் கட்டியிருந்த நிலையில் அதை உண்டது சரிதானா?’ என்று சந்தேகம் கொண்டார்கள். அப்போது நாங்கள் (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம்) சென்றோம். நான் (அதன்) முன்னங்கால் சப்பையை (எடுத்து) என்னிடம் பத்திரப்படுத்தி வைத்திருந்தேன். நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றவுடன் இது குறித்து அவர்களிடம் வினவினோம். அவர்கள், ‘‘அதிலிருந்து மிச்சம் மீதி ஏதாவது உள்ளதா?” என்று கேட்டார்கள். நான் அந்த முன்னங்கால் சப்பையை எடுத்துக் கொடுத்தேன். அதன் எலும்பைக் கடித்துத் துப்பும்வரை அதை அவர்கள் சாப்பிட்டார்கள். அப்போது நபி அவர்கள் இஹ்ராம் கட்டியிருந்தார்கள்.30 இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 70",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 35
			}
		}
	]
}