{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5425,
			"arabicnumber": 5425,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அபூதல்ஹா (ஸைத் பின் சஹ்ல்-ரலி) அவர்களிடம், ‘‘உங்கள் சிறுவர்களில் ஒருவரை எனக்குச் சேவகம் செய்ய அழைத்து வாருங்கள்” என்று சொன்னார்கள். உடனே அபூதல்ஹா (ரலி) அவர்கள் (தமது வாகனத்தில்) என்னைத் தமக்குப் பின்னால் அமர்த்திக்கொண்டு புறப்பட்டார்கள். ஆகவே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குச் சேவகம் புரிந்துவந்தேன். அவர்கள் (வழியில் எங்கேனும்) இறங்கித் தங்கும்போதெல்லாம் ‘‘இறைவா! துக்கம், கவலை, இயலாமை, சோம்பல், கஞ்சத்தனம், கோழைத்தனம், கடன்சுமை, மனிதர்களின் அடக்குமுறை ஆகியவற்றிலிருந்து உன்னிடம் நான் பாதுகாப்புக் கோருகிறேன்” என்று அதிகமாகப் பிரார்த்தனை புரிவதை நான் செவியுற்றுள்ளேன். நாங்கள் கைபரிலிருந்து புறப்பட்டுச் செல்லும்வரை நான் அவர்களுக்குச் சேவகம் செய்துகொண்டேயிருந்தேன். ஸஃபிய்யா பின்த் ஹுயை அவர்களை (கைபர் போர்ச் செல்வத்தில் தமது பங்காகத்) தேர்ந்தெடுத்துக்கொண்டபின் அவர்களுடன் நபி (ஸல்) அவர்கள் புறப்பட்டுச் சென்றார்கள். அப்போது நபி (ஸல்) அவர்கள் ஸஃபிய்யாவுக்காக ஓர் ‘அங்கியால்’ அல்லது ‘ஒரு போர்வையால்’ தமக்குப் பின்னே திரை அமைத்துப் பிறகு அவர்களைத் தமக்குப் பின்னால் (வாகனத்தில்) அமர்த்திக்கொள்வதை நான் பார்த்தேன். நாங்கள் ‘(சத்துஸ்) ஸஹ்பா’ எனும் இடத்தை அடைந்தபோது அவர்கள் ‘ஹைஸ்’ எனும் பலகாரத்தைத் தயாரித்து ஒரு தோல் விரிப்பில் வைத்தார்கள். பிறகு என்னை அவர்கள் அனுப்பிட நான் (வலீமா விருந்திற்காக) மக்களை அழைத்தேன். அவர்கள் வந்து விருந்து உண்டார்கள். அது (அன்னை) ஸஃபிய்யா (ரலி) அவர்களுடன் நபி (ஸல்) அவர்கள் தாம்பத்திய உறவைத் தொடங்கிய(தற்கு அளித்த மணவிருந்)தாக அமைந்தது. பிறகு அவர்கள் முன்னேறிச் செல்ல அவர்களுக்கு ‘உஹுத்’ மலை தென்பட்டது. அவர்கள், ‘‘இது நம்மை நேசிக்கின்ற ஒரு மலை. இதை நாமும் நேசிக்கின்றோம்” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள் மதீனா நகரை நெருங்கியபோது, ‘‘இறைவா! இப்ராஹீம் (அலை) அவர்கள் மக்காவைப் புனிதமானதாக அறிவித்ததைப் போன்று மதீனாவின் இரு மலைகளுக்கிடையேயுள்ள அதன் நிலப்பரப்பை நான் புனிதமானதாக அறிவிக்கிறேன். இறைவா! மதீனாவாசிகளின் ‘ஸாஉ’ மற்றும் அவர்களின் ‘முத்(து)’ ஆகிய அளவைகளில் அவர்களுக்கு வளத்தைக் கொடுப்பாயாக” என்று பிரார்த்தித்தார்கள்.47 அத்தியாயம் : 70",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 53
			}
		}
	]
}