{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"71": "Sacrifice on Occasion of Birth (`Aqiqa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5470,
			"arabicnumber": 5470,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: (என் தாயார் உம்மு சுலைம் அவர்களின் இரண்டாவது கணவரான) அபூதல்ஹா (ரலி) அவர்களின் புதல்வர் ஒருவர் நோய்வாய்ப்பட்டு இருந்தார். (ஒருமுறை) அபூதல்ஹா (ரலி) அவர்கள் வெளியே செல்ல அப்போது அந்தப் பையன்இறந்துவிட்டான். அபூதல்ஹா (ரலி) அவர்கள் திரும்பி வந்தபோது ‘‘என் மகன் என்ன ஆனான்?” என்று கேட்டார்கள். (அவருடைய துணைவியார்) உம்மு சுலைம் (துக்கத்தை வெளிக்காட்டாமல்), ‘‘அவன் முன்பைவிட நிம்மதியாக இருக்கிறான்” என்று பதிலளித்துவிட்டு, அவர்களுக்கு முன்னால் இரவு உணவை வைத்தார். அபூதல்ஹா (ரலி) அவர்கள் இரவு உணவை அருந்தினார்கள். பிறகு உம்மு சுலைம் அவர்களுடன் (அன்றிரவு) தாம்பத்திய உறவு கொண்டார்கள். உறவு கொண்டு முடித்தபோது, உம்மு சுலைம் அவர்கள் (தம் கணவரிடம் மகன் இறந்த விவரத்தைக் கூறி) ‘‘பையனை அடக்கம் செய்(ய ஏற்பாடு செய்)யுங்கள்” என்று கூறினார்கள். விடிந்ததும் அபூதல்ஹா (ரலி) அவர்கள் அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் சென்று (நடந்ததைத்) தெரிவித்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இன்றிரவு தாம்பத்திய உறவுகொண்டீர்களா?” எனக் கேட்டார்கள். அபூதல்ஹா (ரலி) அவர்கள், ‘‘ஆம்” என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘இறைவா! அவர்களின் இரவில் அவர்கள் இருவருக்கும் வளம் வழங்குவாயாக” என்று பிரார்த்தித் தார்கள்.5 பின்னர் உம்மு சுலைம் (ரலி) அவர்கள் ஆண் குழந்தை ஒன்றைப் பெற்றெடுத்தார்கள். என்னிடம் அபூதல்ஹா (ரலி) அவர்கள், ‘‘குழந்தையை நபி (ஸல்) அவர்களிடம் பத்திரமாகக் கொண்டுசெல்” என்று கூறினார்கள். அவ்வாறே நான் குழந்தையை நபி (ஸல்) அவர்களிடம் கொண்டுசென்றேன். என்னிடம் உம்மு சுலைம் (ரலி) அவர்கள் பேரீச்சம்பழங்கள் சிலவற்றைக் கொடுத்தனுப்பி யிருந்தார்கள். நபி (ஸல்) அவர்கள் குழந்தையை வாங்கிக்கொண்டு, ‘‘இக்குழந்தையுடன் ஏதேனும் (இனிப்புப்) பொருள் உள்ளதா?” என்று கேட்டார்கள். (அங்கிருந்த) மக்கள் ‘‘ஆம்; பேரீச்சம்பழங்கள் உள்ளன” என்று பதிலளித்தார்கள். உடனே நபி (ஸல்) அவர்கள் அதை வாங்கி (தம் வாயால்) மென்று பிறகு தமது வாயிலிருந்து அதை எடுத்துக் குழந்தையின் வாயில் வைத்து அதைத் தடவினார்கள். குழந்தைக்கு ‘அப்துல்லாஹ்’ எனப் பெயர் சூட்டினார் கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 71",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 4
			}
		}
	]
}