{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5518,
			"arabicnumber": 5518,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல்ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்துகொண்டிருந் தோம்.- ‘ஜர்ம்’ கூட்டத்தைச் சேர்ந்த எங்களுக்கும் இந்த (அஷ்அரீ) கூட்டத்தாருக்குமிடையே சகோதரத்துவ உறவு (நட்பு) இருந்தது.- அப்போது கோழி இறைச்சியுடன் உணவு கொண்டு வரப்பட்டது. மக்களிடையே சிவப்பான மனிதர் ஒருவர் அமர்ந்திருந்தார். (அவரை உணவு உண்ண அபூமூசா (ரலி) அவர்கள் அழைத்தார்கள்.) ஆனால், அவர் உணவை நெருங்கவில்லை. அப்போது அபூமூசா (ரலி) அவர்கள், ‘‘அருகில் வாருங்கள் (வந்து சாப்பிடுங்கள்). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இதைச் சாப்பிட நான் பார்த்துள்ளேன்” என்று சொன் னார்கள். அதற்கு அம்மனிதர், ‘‘இந்தக் கோழி (இனம், அசுத்தம்) எதையோ தின்பதை நான் பார்த்தேன். அது எனக்கு அருவருப்பை உண்டாக்கவே ‘இதை இனிமேல் நான் உண்ணமாட்டேன்’ என்று சத்தியம் செய்துவிட்டேன்” என்று சொன்னார். அதற்கு அபூமூசா (ரலி) அவர்கள் ‘‘அருகில் வாருங்கள்; உங்களுக்கு (விவரமாக)த் தெரிவிக்கிறேன்” என்று கூறி(விட்டுப் பின்வருமாறு சொன்)னார்கள்: நான் நபி (ஸல்) அவர்களிடம் (என்) அஷ்அரீ குலத்தார் சிலருடன் சென்றேன். அப்போது அவர்கள் சினத்துடன் இருந்தார்கள். தர்ம ஒட்டகங்களை அவர்கள் பங்கிட்டுக்கொண்டிருந்தார்கள். அப்போது எங்களை(யும் எங்கள் பயணச் சுமைகளை யும்) சுமந்து செல்ல (ஒட்டகங்கள் ஏற்பாடு) செய்யும்படி அவர்களிடம் நாங்கள் வேண்டினோம். அப்போது அவர்கள் ‘‘உங்களைச் சுமந்து செல்ல ஒட்டகங்கள் தரமாட்டேன்” என்று சத்தியம் செய்தார்கள். மேலும், ‘‘உங்களை ஏற்றியனுப்பத் தேவையான (வாகன) ஒட்டகங்கள் என்னிடம் (தற்போது கைவசம்) இல்லை” என்று சொன்னார்கள். (சிறிது நேரத்திற்குப்) பிறகு அல்லாஹ் வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த சில ஒட்டகங்கள் கொண்டுவரப் பட்டன. உடனே (எங்களைக் குறித்து) ‘‘அஷ்அரீ குலத்தைச் சேர்ந்தவர்கள் எங்கே? அஷ்அரீ குலத்தைச் சேர்ந்தவர் கள் எங்கே?” என்று (இருமுறை) கேட்டுவிட்டு, (நாங்கள் வந்தபோது) எங்களுக்கு வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை வழங்கினார்கள். நாங்கள் சிறிது நேரமே (அங்கு) இருந்திருப்போம். அப்போது நான் என் தோழர்களிடம், ‘‘அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நாம் ஏறிச்செல்ல ஒட்டகம் தரமாட்டேன் என்று செய்த) தமது சத்தியத்தை மறந்துவிட்டார்கள். அல்லாஹ்வின் மீதாணையாக! நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை, அவர்கள் செய்த சத்தியத்திலிருந்து கவனத்தைத் திருப்பியிருந்தால் நாம் ஒருபோதும் வெற்றியடையமாட்டோம்” என்று கூறிவிட்டு, நபி (ஸல்) அவர்களிடம் நாங்கள் திரும்பி வந்தோம். அப்போது நாங்கள், ‘‘அல்லாஹ்வின் தூதரே! நாங்கள் ஏறிச்செல்வதற்காகத் தங்களிடம் ஒட்டகம் கேட்டோம். அப்போது தாங்கள், எங்களை ஏற்றிச்செல்லும் ஒட்டகம் தரமாட்டேன் என்று சத்தியம் செய்தீர்கள். (ஆனால், பிறகு போரில் கிடைத்த ஒட்டகங்களை எங்களுக்குத் தந்தீர்கள்.) ஆகவே, நீங்கள் உங்களது சத்தியத்தை மறந்துவிட்டீர்கள் என்று நாங்கள் எண்ணினோம்” என்று சொன்னோம். அதற்கு நபி (ஸல்) அவர்கள், ‘‘அல்லாஹ்வே உங்களை ஒட்டகத்தில் ஏற்றி அனுப்பிடச்செய்தான். அல்லாஹ் வின் மீதாணையாக! அவன் நாடினால், நான் இனி எந்த ஒன்றுக்காகவும் சத்தியம் செய்து, பிறகு அது அல்லாததை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் சிறந்ததையே செய்வேன்; சத்தியத்தை முறித்து அதற்காகப் பரிகாரமும் செய்து விடுவேன்” என்று சொன்னார்கள்.37 அத்தியாயம் : 72",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 44
			}
		}
	]
}