{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5611,
			"arabicnumber": 5611,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: மதீனா அன்சாரிகளிலேயே அபூதல்ஹா ஸைத் பின் சஹ்ல் (ரலி) அவர்கள் ஏராளமான பேரீச்சமரங்களுடைய (பெரும்) செல்வராக இருந்தார். அவருடைய செல்வங்களில் ‘பைருஹா’ எனும் தோட்டமே அவருக்கு மிகவும் விருப்பமானதாக இருந்தது. அது (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலுக்கு எதிரில் இருந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அத்தோட்டத்திற்குச் சென்று அங்குள்ள நல்ல (சுவை) நீரை அருந்துவது வழக்கம். ‘‘நீங்கள் விரும்புகின்றவற்றிலிருந்து தானம் செய்யாத வரை ஒருபோதும் நீங்கள் (நிறைவான) பலனை அடையமாட்டீர்கள்” எனும் (3:92ஆவது) வசனம் அருளப்பெற்றதும் அபூதல்ஹா (ரலி) அவர்கள் எழுந்து, ‘‘அல்லாஹ்வின் தூதரே! அல்லாஹ், ‘நீங்கள் விரும்புகின்றவற்றிலிருந்து தானம் செய்யாத வரை ஒருபோதும் நீங்கள் (நிறைவான) பலனை அடையமாட்டீர்கள்’ எனக் கூறுகின்றான். என் செல்வங்களில் எனக்கு மிகவும் விருப்பமானது ‘பைருஹா’ (எனும் இந்தத் தோட்டமே) ஆகும். (இனி) அது அல்லாஹ்வுக்காக (நான் வழங்கும்) தர்மமாகும். அதற்கான நன்மையையும், அது (மறுமையில் எனக்குரிய) சேமிப்பாக இருப்பதையும் நான் அல்லாஹ்விடம் எதிர்பார்க்கிறேன். ஆகவே, அல்லாஹ்வின் தூதரே! அல்லாஹ் தங்களுக்குக் காட்டியுள்ள வழியில் அதைப் பயன் படுத்திக்கொள்ளுங்கள்” என்று சொன்னார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘நல்லது. அது ‘(மறுமையில்) இலாபம் தரும் செல்வம்தானே!’ அல்லது ‘அது நன்மை கிடைத்துவிட்ட செல்வம்தானே!’ என்று கூறினார்கள். -அறிவிப்பாளர் அப்துல்லாஹ் பின் மஸ்லமா (இவ்வாறு) சந்தேகத்துடன் அறிவிக்கிறார்.- (தொடர்ந்து நபி (ஸல்) அவர்கள், ‘‘தர்மம் செய்வது குறித்து) நீங்கள் கூறியதை நான் செவியுற்றேன். அதை உங்கள் நெருங்கிய உறவினர்களிடையே (தானமாக) வழங்குவதையே நான் (உசிதமாகக்) கருதுகிறேன்” என்று சொன்னார்கள். அதற்கு அபூதல்ஹா (ரலி) அவர்கள், ‘‘(அவ்வாறே) செய்கிறேன், அல்லாஹ்வின் தூதரே!” எனக் கூறிவிட்டுத் தம் நெருங்கிய உறவினர்களுக்கும், தம் தந்தையின் சகோதரர் மக்களுக்கும் பங்கிட்டுக் கொடுத்துவிட்டார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் இஸ்மாயீல் பின் அபீஉவைஸ் (ரஹ்) அவர்களும் யஹ்யா பின் யஹ்யா (ரஹ்) அவர்களும் ‘நன்மை கிடைத்துவிட்ட செல்வம்தானே!’ என்றே அறிவித்துள் ளார்கள்.33 அத்தியாயம் : 74",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 37
			}
		}
	]
}