{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5705,
			"arabicnumber": 5705,
			"text": "ஆமிர் அஷ்ஷஅபீ (ரஹ்) அவர்கள் கூறியதாவது: இம்ரான் பின் ஹுஸைன் (ரலி) அவர்கள், ‘‘கண்ணேறு, அல்லது விஷக்கடி தவிர வேறெதற்காகவும் ஓதிப்பார்த்த(லி)ல் (சிறப்பு) கிடையாது” என்று கூறினார்கள். (அறிவிப்பாளர் ஹுஸைன் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறுகிறார்கள்:) நான் இதை சயீத் பின் ஜுபைர் (ரஹ்) அவர்களிடம் எடுத்துரைத்தேன். அப்போது அவர்கள் தமக்கு இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) அறிவித்தார்கள் என்று கூறினார்கள்: (ஒருநாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (மிஅராஜ் எனும் விண்ணுலகப் பயணத்தின்போது) எனக்குப் பல சமுதாயத்தார் எடுத்துக் காட்டப்பட்டனர். அப்போது இறைத்தூதர் களில் ஓரிருவருடன் (அவர்களுடைய சமுதாயத்தாரில் பத்துக்குட்பட்ட) ஒரு சிறு கூட்டமே கடந்து செல்லலாயினர். ஓர் இறைத்தூதர் தம்முடன் ஒருவருமில்லாத நிலையில் கடந்து சென்றார். பின்னர் எனக்கு ஒரு பெரும் கூட்டம் காட்டப்பட்டது. நான், ‘‘இது எந்தச் சமுதாயம்? இது என் சமுதாயமா?” என்று கேட்டேன். அப்போது, ‘‘அல்ல. இது (இறைத்தூதர்) மூசாவும் அவருடைய சமுதாயமும்” என்று எனக்குச் சொல்லப்பட்டது.28 அப்போது ‘‘அடிவானத்தைப் பாருங்கள்” என்று என்னிடம் கூறப்பட்டது. அங்கு அடிவானத்தையே அடைத்திருந்த ஏராளமான மக்கள் திரளை நான் பார்த்தேன். பிறகு என்னிடம், ‘‘அடிவானங்களில் இங்கும் இங்கும் பாருங்கள்” எனச் சொல்லப்பட்டது. அப்போது நான் அடிவானங்களை அடைத்திருந்த ஏராளமான மக்கள் திரளைக் கண்டேன். ‘‘இது உங்கள் சமுதாயம். விசாரணையின்றி சொர்க்கம் செல்லும் எழுபதாயிரம் பேரும் இவர்களில் அடங்குவர்” என்று எனக்குச் சொல்லப்பட்டது. (விசாரணையின்றி சொர்க்கம் செல்லும் அந்த எழுபதாயிரம் பேர் யார் என்பதை) தோழர்களுக்கு விளக்காமலேயே நபி (ஸல்) அவர்கள் (தமது வீட்டுக்குள்) நுழைந்துவிட்டார்கள். (அது தொடர்பாக) மக்கள் விவாதிக்கத் தொடங்கினார்கள். ‘‘நாம்தான் அவர்கள். (ஏனெனில்,) நாமே அல்லாஹ்வை நம்பிக்கை கொண்டு அவனுடைய தூதரைப் பின்பற்றினோம்; அல்லது நம் பிள்ளைகள்தான் அவர்கள். (ஏனெனில்,) அவர்கள் இஸ்லாத்தில் பிறந்தவர்கள். நாமோ அறியாமைக் காலத்தில் பிறந்தோம்” என்று சொன்னார்கள். இந்தச் செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியது. ஆகவே, அவர்கள் புறப்பட்டு வந்து, ‘‘(விசாரணையின்றி சொர்க்கம் செல்லவுள்ள) அவர்கள் யாரெனில், அவர்கள் ஓதிப்பார்க்கமாட்டார்கள்; பறவைகளை வைத்து சகுனம் பார்க்கமாட்டார்கள்; (நோய்க்காக) சூடிட்டுக்கொள்ளமாட்டார்கள். தம் இறைவனையே சார்ந்திருப்பார்கள்” என்று சொன்னார்கள். அப்போது உக்காஷா பின் மிஹ்ஸன் (ரலி) அவர்கள் எழுந்து, ‘‘அவர்களில் நானும் ஒருவனா? அல்லாஹ்வின் தூதரே!” என்று கேட்க, நபி (ஸல்) அவர்கள், ‘‘ஆம்” என்று பதிலளித்தார்கள். மற்றொருவர் எழுந்து நின்று, ‘‘அவர்களில் நானும் ஒருவனா?” என்று கேட்க, நபி (ஸல்) அவர்கள் ‘‘இவ்விஷயத்தில் உக்காஷா உம்மை முந்திக்கொண்டுவிட்டார்” என்று சொன்னார்கள். அத்தியாயம் : 76",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 25
			}
		}
	]
}