{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5765,
			"arabicnumber": 5765,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குச் சூனியம் செய்யப்பட்டது. அதையடுத்து அவர்கள் தம் துணைவி யரிடம் செல்லாமலேயே அவர்களிடம் சென்று வருவதாக நினைக்கலானார்கள். -அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்: அவ்வாறிருந்தால் அது சூனியத்திலேயே கடுமையானதாகும்.- (ஒருநாள்) நபி (ஸல்) அவர்கள் கூறினார்கள்: ஆயிஷா! (விஷயம்) தெரியுமா? நான் எந்த விஷயத்தில் அல்லாஹ்விடம் தெளிவைத் தரும்படி கேட்டுக்கொண்டிருந்தேனோ, அந்த விஷயத்தில் அல்லாஹ் எனக்குத் தெளிவை வழங்கிவிட்டான். (கனவில் வானவர்கள்) இரண்டு பேர் என்னிடம் வந்து, ஒருவர் என் தலைமாட்டிலும் இன்னொருவர் என் கால்மாட்டிலும் அமர்ந்துகொண்டனர். என் தலைமாட்டில் இருந்தவர் மற்றொருவரிடம், ‘‘இந்த மனிதரின் நிலையென்ன?” என்று கேட்டார். மற்றவர் ‘‘சூனியம் செய்யப்பட்டுள்ளார்” என்று சொன்னார். அதற்கு அவர், ‘‘யார் அவருக்குச் சூனியம் வைத்தார்?” என்று கேட்டார். மற்றவர், ‘‘யூதர்களின் நட்புக் குலமான ‘பனூ ஸுரைக்’ குலத்தைச் சேர்ந்த லபீத் பின் அஃஸம் என்பவர். இவர் நயவஞ்சகராக இருந்தார்” என்று பதிலளித்தார். அவர், ‘‘எதில் (சூனியம் வைக்கப்பட்டுள்ளது)?” என்று கேட்க, மற்றவர், ‘‘சீப்பிலும் சிக்கு முடியிலும்” என்று பதிலளித்தார். அவர், ‘‘எங்கே (சூனியம் வைக்கப்பட்டுள்ளது)?” என்று கேட்க, மற்றவர், ‘‘ஆண் பேரீச்சம் பாளையின் உறையில் ‘தர்வான்’ குலத்தாரின் கிணற்றிலுள்ள கல் ஒன்றின் அடியில் வைக்கப்பட்டுள்ளது” என்று பதிலளித்தார். பிறகு நபி (ஸல்) அவர்கள் அந்தக் கிணற்றுக்குச் சென்று அ(ந்தப் பாளைஉறை)தனை வெளியே எடுத்தார்கள். பிறகு (என்னிடம் திரும்பிவந்த) நபி (ஸல்) அவர்கள், ‘‘இதுதான் எனக்குக் (கனவில்) காட்டப்பட்ட கிணறு. இதன் தண்ணீர் மருதாணிச் சாற்றைப் போன்று (கலங்கலாக) உள்ளது. இதன் பேரீச்சமரங்கள் ஷைத்தான்களின் தலைகளைப் போன்று உள்ளன” என்று சொல்லிவிட்டுப் பிறகு ‘‘அந்தப் பேரீச்சம்பாளை உறை வெளியே எடுக்கப்பட்டது” என்றும் கூறினார்கள். நான், ‘‘தாங்கள் (பாளைஉறையை) ஏன் உடைத்துக்காட்டக் கூடாது?” எனக் கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், ‘‘அல்லாஹ் எனக்கு (இந்தச் சூனியத்திó ருந்து) நிவாரணம் அளித்துவிட்டான். (சூனியப் பொருளைத் திறந்துகாட்டி) மக்களில் எவரையும் குழப்பத்தில் ஆழ்த்த நான் விரும்பவில்லை” என்று சொல்லிவிட்டார்கள்.92 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 76",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 79
			}
		}
	]
}