{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5825,
			"arabicnumber": 5825,
			"text": "இக்ரிமா (ரஹ்) அவர்கள் கூறியதாவது: ரிஃபாஆ அல்குறழீ (ரலி) அவர்கள் தம் மனைவியை மணவிலக்குச் செய்துவிட, அந்தப் பெண்ணை அப்துர் ரஹ்மான் பின் ஸபீர் அல்குறழீ (ரலி) அவர்கள் மணந்து கொண்டார்கள். (பிறகு நடந்தவற்றை) ஆயிஷா (ரலி) அவர்கள் கூறுகிறார்கள்: (ஒருமுறை) அந்தப் பெண்மணி பச்சைநிற முகத்திரை அணிந்துகொண்டு என்னிடம் (வந்து தம் கணவர் அப்துர் ரஹ்மான் தம்மைத் துன்புறுத்துவதாக) முறையிட்டார். தம் கணவர் தம்மை அடித்ததால் தமது மேனியில் (கன்றியிருந்த) பச்சைநிற அடையாளத்தை எனக்குக் காட்டினார். -(இக்ரிமா கூறுகிறார்:) பெண்கள் ஒருவருக்கொருவர் உதவி செய்வது வழக்கம் தானே?) அந்த வழக்கப்படி- (நபி (ஸல்) அவர்கள் வந்தபோது, ‘‘அல்லாஹ்வின் தூதரே!) நான் (ஆயிஷா) இறைநம்பிக்கையுடைய பெண்கள் சந்திக்கும் துன்பத்தைப் போன்று எங்கும் பார்த்ததில்லை. இவருடைய மேனி (இவருடைய கணவர் அப்துர் ரஹ்மான் அடித்ததால் கன்றிப்போய்) இவரது (பச்சைநிற முகத்திரைத்) துணியைவிடக் கடுமையான பச்சை நிறமுடையதாக உள்ளது” என்று சொன்னேன். (இதற்கிடையில்) -அப்துர் ரஹ்மான் பின் ஸபீர் (ரலி) அவர்கள் தம் மனைவி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று தம்மைப் பற்றி முறையிட்டார் என்று கேள்விப்பட்டார். ஆகவே, மற்றொரு மனைவியின் மூலமாகத் தமக்குப் பிறந்த இரு மகன்களைத் தம்முடன் அழைத்துவந்தார். அப்பெண்மணி, ‘‘(அல்லாஹ்வின் தூதரே!) அல்லாஹ்வின் மீதாணையாக! நான் இவருக்கு எந்தக் குறையும் வைக்கவில்லை. ஆனால், (தாம்பத்திய சுகத்தில்) இவரிடமிருந்து இதைவிட அதிகமாக ஒன்றும் என்னைத் திருப்திப்படுத்த முடியவில்லை” என்று கூறி, தமது ஆடையின் முந்தானைக் குஞ்சத்தை எடுத்துக் காட்டினார். அப்துர் ரஹ்மான் பின் ஸபீர், ‘‘பொய் சொல்கிறாள், அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதரே! (தாம்பத்திய உறவின்போது) பதனிடப்பட்ட தோலை உதறியெடுப்பதைப் போன்று நான் இவளை (முழுமையாக அனுபவித்து) உதறியெடுத்துவிடுவேன். எனினும், இவள்தான் ரிஃபாஆவை (மீண்டும் மணந்து கொள்ள) விரும்பி எனக்குக் கீழ்ப்படிய மறுக்கிறாள்” என்று சொன்னார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ‘‘அப்படி (ரிஃபாஆவை மீண்டும் நீ மணந்துகொள்ள விரும்பினா)யானால், (உன் இரண்டாம் கணவரான) இவர் உன்னிடம் (தாம்பத்திய) இன்பத்தை அனுபவிக்கும்வரை அ(ந்த முதல் கண)வருக்கு நீ ‘அனுமதிக்கப்பட்டவள்’ அல்லது ‘ஏற்றவள்’ அல்லள்” என்று சொன்னார்கள். அப்துர் ரஹ்மான் அவர்களுடன் இருந்த அவர்களுடைய இரு மகன்களை யும் நபி (ஸல்) அவர்கள் பார்த்தார்கள். ‘‘இவர்கள் உங்கள் புதல்வர்களா?” என்று (அப்துர் ரஹ்மான் அவர்களிடம்) கேட்டார்கள். அவர், ‘‘ஆம்” என்று சொன்னார். நபி (ஸல்) அவர்கள், ‘‘இவரைப் பற்றியா நீ இப்படிச் சொல்கிறாய்? அல்லாஹ்வின் மீதாணையாக! ஒரு காக்கை மற்றொரு காக்கைக்கு ஒப்பாக இருப்பதைவிடவும் அதிகமாக இந்தப் புதல்வர்கள் இவரை ஒத்திருக்கின்றனர்” என்று சொன்னார்கள்.45 அத்தியாயம் : 77",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 42
			}
		}
	]
}