{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5843,
			"arabicnumber": 5843,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: ‘‘நபி (ஸல்) அவர்களுக்கெதிராக (அவர்களைச் சங்கடப்படுத்தும் வகை யில்) கூடிப்பேசிச் செயல்பட்ட அந்த இரு துணைவியர் யார்?” என உமர் (ரலி) அவர்களிடம் கேட்க வேண்டுமென ஓராண்டு காலமாக நான் (நினைத்துக் கொண்டு) இருந்தேன். ஆயினும், உமர் (ரலி) அவர்கள்மேல் (மரியாதை கலந்த) அச்சம் கொள்ளலானேன். இவ்வாறிருக்கையில் (ஹஜ்ஜுக்கு வந்த) உமர் (ரலி) அவர்கள் ஒருநாள் (‘மர்ருழ் ழஹ்ரான்’ எனும்) ஓரிடத்தில் தங்கினார்கள். அப்போது (தமது இயற்கைக் கடனை நிறைவேற்றுவதற்காக) ‘அராக்’ (மிஸ்வாக்) மரத்தடிக்குச் சென்றார்கள். அவர்கள் (தமது தேவையை முடித்துக்கொண்டு) வந்தபோது அவர்களிடம் நான் அது பற்றிக் கேட்டேன். அதற்கு அவர்கள், ‘‘ஆயிஷாவும் ஹஃப்ஸாவுமே (அந்த இரு துணைவியர்)” என்று பதிலளித்துவிட்டு (பின்வருமாறு) கூறினார்கள்: அறியாமைக் காலத்தில் நாங்கள் பெண்களை ஒரு பொருட்டாகவே மதித்த தில்லை. இஸ்லாம் வந்து, அல்லாஹ் பெண்களைக் குறித்து (அவர்களின் உரிமைகளையும் கடமைகளையும் பேணுமாறு தனது வேதத்தில்) குறிப்பிட்ட போதுதான் பெண்களுக்கு எங்கள்மீதுள்ள உரிமையை அறிந்துகொண்டோம். ஆயினும், எங்கள் விவகாரங்கள் எதிலும் தலையிட பெண்களை நாங்கள் அனுமதிக்கவில்லை. (இந்நிலையில் ஒருநாள்) எனக்கும் என் மனைவிக்குமிடையே (காரசாரமான) வாக்குவாதம் ஏற்பட்டது. அப்போது அவர் என்னைக் கடுமையாகப் பேசிவிட்டார். உடனே நான், ‘‘நீ அங்கேயே (உன் இடத்திலேயே) இரு! (என் விஷயத்தில் தலையிடாதே)” என அவரிடம் சொன் னேன். அவர் ‘‘என்னிடம்தான் நீங்கள் இவ்வாறு பேசுகிறீர்கள். (ஆனால்,) உங்கள் புதல்வி (ஹஃப்ஸாவோ தம் துணைவர்) நபி (ஸல்) அவர்களை (எதிர்த்துப் பேசி) மன வேதனைக்குள்ளாக்கியுள்ளார்” என்றார். உடனே நான் (என் புதல்வி) ஹஃப்ஸா விடம் சென்று, ‘‘அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் மாறுசெய்ய வேண்டாமென உன்னை நான் எச்சரிக்கி றேன்” என்று சொன்னேன். நபி (ஸல்) அவர்களை மன வேதனைக்குள்ளாக்கிய விஷயத்தில் முதலில் நேராக ஹஃப்ஸா விடமே சென்றேன். அடுத்து (நபி (ஸல்) அவர்களின் இன்னொரு துணைவியாரும் என் உறவினருமான) உம்மு சலமாவிடம் சென்று (ஹஃப்ஸாவிடம் சொன்னதைப் போன்றே) கூறினேன். உடனே அவர், ‘‘உமரே! உம்மைக் கண்டு நான் வியப்புறுகிறேன். எங்கள் விவகாரங்கள் அனைத்திலும் நீங்கள் தலையிட்டுவிட்டு, இறுதியில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் அவர்களுடைய துணைவியருக்கும் இடையிலான விவகாரத்தையும்கூட நீங்கள் விட்டுவைக்கவில்லை” என்று கூறி (என்னை) மடக்கிவிட்டார். மேலும், அன்சாரிகளில் (எனக்கு நண்பர்) ஒருவர் இருந்தார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் அவையில் அவர் இல்லாமல்போய் நான் அங்கு இருந்தால், அங்கு நடப்பதை நான் அவருக்குத் தெரிவிப்பேன். (இதைப் போன்றே) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது அவையில் நான் இல்லாமல் அவர் இருந்தால், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து கிடைக்கும் தகவல்களை அவர் எனக்குத் தெரிவிப்பார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைச் சுற்றியிருந்த (அரசர்கள் மற்றும் குலத் தலை)வர்கள் அனைவரும் அவர்களுடன் சுமுக உறவை ஏற்படுத்திக்கொண்டிருந்தனர். (அன்றைய) ஷாம் நாட்டின் ‘ஃகஸ்ஸான்’ அரசன் ஒரு வனைத் தவிர வேறு யாரும் (பகைமை கொண்டு) இருக்கவில்லை. அவன் (எங்கள்மீது போர் தொடுக்க) வரலாம் என நாங்கள் அச்சம் கொண்டிருந்தோம். (இந்நிலையில் ஒருநாள்) அந்த அன்சாரி (நண்பர்) திடீரென்று வந்து ‘‘ஒரு சம்பவம் நடந்துவிட்டது” என்றார். நான் ‘‘என்ன அது? ஃகஸ்ஸானிய(மன்ன)ன் (படையெடுத்து)வந்துவிட் டானா?” என்று அவரிடம் கேட்டேன். அதற்கு அவர், ‘‘அதைவிட மிகப் பெரிய சம்பவம் நடந்து விட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் துணைவியரை மணவிலக்குச் செய்துவிட்டார்கள்” என்றார். உடனே நான் (புறப்பட்டு) வந்தேன். அப்போது நபி (ஸல்) அவர்களுடைய துணைவியர் அனைவரின் அறைகளி லிருந்தும் அழுகைச் சத்தம் வந்துகொண்டி ருந்தது. நபி (ஸல்) அவர்களோ தமது மாடியறைக்கு ஏறிவிட்டிருந்தார்கள். மாடியின் தலைவாசலில் பணியாளர் (ரபாஹ்) அமர்ந்துகொண்டிருந்தார். நான் அவரிடம் வந்து, ‘‘எனக்காக (அல்லாஹ்வின் தூதரிடம் செல்ல) அனுமதி கேள்” என்றேன். (அவரும் உள்ளே சென்று அனுமதி கேட்க) நபி (ஸல்) அவர்கள் எனக்கு அனுமதியளித்தார்கள். நான் (படியிலேறி அறைக்குள்) சென்றேன். அப்போது நபி (ஸல்) அவர்கள் ஓர் (ஈச்சம்) பாயில் (படுத்து) இருந்தார்கள். அந்தப் பாய் அவர்களின் விலாவில் சுவடு பதித்திருந்தது. அவர்களின் தலைக்குக் கீழே ஈச்ச நார்கள் நிரப்பப்பட்ட தோல் தலையணை ஒன்றிருந்தது. அங்கு (அவர்களது தலைமாட்டில்) பதனிடப்படாத தோல்கள் தொங்கவிடப்பட்டிருந்தன. (கால்மாட்டில்) கருவேல இலைகள் இருந்தன. அப்போது ஹஃப்ஸா, உம்மு சலமா ஆகியோரிடம் நான் கூறியதையும், உம்மு சலமா என்னிடம் கூறிய பதிலையும் நபி (ஸல்) அவர்களிடம் எடுத்துச்சொன்னேன். அதைக் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்துவிட்டார்கள். (அந்த மாடியறையில்) நபி (ஸல்) அவர்கள் இருபத்தொன்பது நாட்கள் (தங்கி) இருந்தார்கள். பிறகு (அங்கிருந்து) இறங்கினார்கள்.61 அத்தியாயம் : 77",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 60
			}
		}
	]
}