{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6063,
			"arabicnumber": 6063,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கு (சூனியம் செய்யப்பட்டதால்) அவர்கள் இன்னின்ன வாறு நடந்துகொண்டார்கள். அவர்கள் தம் வீட்டாரிடம் செல்லாமலேயே சென்றுவந்துவிட்டதாகப் பிரமையூட்டப் பட்டார்கள். அவர்கள் ஒருநாள் என்னிடம், “ஆயிஷா! நான் எந்த விவகாரத்தில் தெளிவைத் தரும்படி அல்லாஹ்விடம் கேட்டுக்கொண்டிருந்தேனோ அதில் அவன் எனக்குத் தெளிவை அளித்துவிட்டான். (நான் உறங்கிக் கொண்டிருந்தபோது கனவில் வானவர்கள்) இரண்டுபேர் என்னிடம் வந்தனர். அவர்களில் ஒருவர் என் கால்மாட்டிலும் மற்றவர் என்னுடைய தலைமாட்டிலும் அமர்ந்தனர். அப்போது என் கால்மாட்டில் அமர்ந்திருந்தவர் என் தலைமாட்டில் அமர்ந்திருந்தவரிடம் (என்னைக் காட்டி), “இந்த மனிதரின் நிலை என்ன?” என்று கேட்க, மற்றவர், “இவருக்குச் சூனியம் வைக்கப்பட்டுள்ளது” என்று பதிலளித்தார். முதலாமவர், “இவருக்குச் சூனியம் வைத்தவர் யார்?” என்று கேட்க, மற்றவர், ‘லபீத் பின் அஃஸம்’ என்று பதிலளித்தார். முதலாமவர், “எதில் (சூனியம் வைக்கப்பட்டுள்ளது)?” என்று கேட்க, மற்றவர், “ஆண் பேரீச்சம் பாளையின் உறை, (தலைவாரும்) சீப்பு, சிக்குமுடி ஆகியவற்றில் (சூனியம்) செய்யப்பட்டு ‘தர்வான்’ (குலத்தாரின்) கிணற்றில் ஒரு பாறைக்கடியில் வைக்கப்பட்டுள்ளது” என்று பதிலளித்தார். ஆகவே, நபி (ஸல்) அவர்கள் (தம் தோழர்கள் சிலருடன் அந்தக் கிணற்றுக்கு) வந்து (பார்த்துவிட்டு), “இந்தக் கிணறுதான் எனக்குக் (கனவில்) காட்டப்பட்டது. அந்தக் கிணற்றைச் சுற்றியிருந்த பேரீச்சம் மரங்களின் தலைகள் ஷைத்தான்களின் தலைகளைப் போன்றிருந்தன. அந்தக் கிணற்றின் தண்ணீர் மருதாணிச் சாற்றைப் போன்றிருந்தது” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள் உத்தரவிட அது வெளியே எடுக்கப்பட்டது. நான், “அல்லாஹ்வின் தூதரே! அ(ந்தப் பாளை உறை)தனைப் பிரித்துப் பார்க்கவில்லையா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள் “அல்லாஹ் என்னைக் குணப்படுத்திவிட்டான். நானோ (அதைப் பிரித்துக் காட்டுவதால்) மக்களுக்கெதிராக வன்மத்தைத் தூண்டிவிடுவதை அஞ்சுகிறேன்” என்று சொன்னார்கள். (நபி (ஸல்) அவர்களுக்குச் சூனியம் வைத்த) லபீத் பின் அஃஸம், பனூ ஸுரைக் குலத்தாரிலுள்ள ஒருவன் ஆவான். (அவன்) யூதர்களின் நட்புக் குலத்தவன் ஆவான்.81 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 93
			}
		}
	]
}