{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6216,
			"arabicnumber": 6216,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களுடன் மதீனாவின் தோட்டங்களில் ஒன்றில் இருந்தேன். நபி (ஸல்) அவர்களின் கையில் தடி ஒன்று இருந்தது. (ஏதோ யோசனையில் ஆழ்ந்திருந்த) அவர்கள் அந்தத் தடியால் நீருக்கும் களிமண்ணுக்கும் இடையே (தரையில்) அடித்துக் கொண்டிருந்தார்கள். அப்போது ஒரு மனிதர் வந்து (வாயிற்கதவைத்) திறக்கும்படி கேட்டார். நபி (ஸல்) அவர்கள், “அவருக்காகத் திறந்துவிடுங்கள்; அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். நான் சென்றேன். அங்கே அபூபக்ர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்காக (வாயிற்கதவைத்) திறந்தேன். அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக (நபி (ஸல்) அவர்கள் கூறிய) நற்செய்தியைத் தெரிவித்தேன். பிறகு ஒரு மனிதர் வந்து (கதவைத்) திறக்கும்படி கோரினார். (நான் நபியவர்களிடம் அனுமதி கேட்க) நபி (ஸல்) அவர்கள், “அவருக்குத் திறந்துவிடுங்கள்; அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். அங்கு உமர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்காக(க் கதவை)த் திறந்து அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக (நபி (ஸல்) அவர்கள் கூறிய) நற்செய்தியைத் தெரிவித்தேன். பிறகு ஒரு மனிதர் (கதவைத்) திறக்கும்படி கோரினார். (நான் நபியவர்களிடம் சென்று அனுமதி கேட்க) சாய்ந்துகொண்டிருந்த நபி (ஸல்) அவர்கள் (நேராக நிமிர்ந்து) அமர்ந்து, “(அவருக்கும்) திறந்துவிடுங்கள்; அவருக்கு நேரவிருக்கும் ஒரு துன்பத்தையடுத்து சொர்க்கம் அவருக்குக் கிடைக்கவிருக்கிறது என்று அவருக்கு நற்செய்தி சொல்லுங்கள்” என்று சொன்னார்கள். நானும் சென்றேன். (கதவைத் திறந்தேன்.) அங்கு உஸ்மான் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருக்கும் நற்செய்தியைத் தெரிவித்து, நபி (ஸல்) அவர்கள் கூறியதையும் தெரிவித்தேன். அவர்கள் “(எனக்கு நேரவிருக்கும் அந்தத் துன்பத்தின்போது) அல்லாஹ்வே (பொறுமையைத் தந்து) உதவி புரிபவன் ஆவான்” என்று சொன்னார்கள்.249 அத்தியாயம் : 78",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 240
			}
		}
	]
}