{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்காவைத் துறந்து) மதீனாவுக்கு வந்தபோது எனக்குப் பத்து வயது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாழ்வி(ன் இறுதிப் பகுதியி)ல் பத்தாண்டு காலம் நான் அவர்களுக்குச் சேவகம் செய்தேன். பர்தா தொடர்பான வசனம் அருளப்பெற்றது குறித்து மக்களில் நானே மிகவும் அறிந்தவனாயிருந்தேன். அது குறித்து உபை பின் கஅப் (ரலி) அவர்கள் என்னிடம் கேட்டு(த் தெரிந்து) உள்ளார்கள். (அன்னை) ஸைனப் பின்த் ஜஹ்ஷ் (ரலி) அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மணந்து தாம்பத்திய உறவைத் தொடங்கிய சந்தர்ப்பத்தில் தான் (இந்த வசனம்) ஆரம்பமாக அருளப்பெற்றது. நபி (ஸல்) அவர்கள் ஸைனபின் மணாளராக இருந்தபோது (மணவிருந்துக்காக) மக்களை அழைத்தார் கள். மக்கள் வந்து உணவருந்திவிட்டு வெளியேறினர். அவர்களில் ஒரு குழுவினர் மட்டும் (எழுந்து செல்லாமல்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அருகிலேயே நீண்ட நேரம் இருந்தனர். அவர்கள் வெளியேறட்டும் என்பதற்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெளியேறினார்கள். நானும் அவர்களுடன் வெளியேறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நடக்க, நானும் அவர்களுடன் நடந்தேன். இறுதியில் ஆயிஷா (ரலி) அவர்களது அறையின் நிலைப்படிக்கு வந்தார்கள். பிறகு அக்குழுவினர் வெளியேறியிருப்பார்கள் என்று எண்ணியவாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஸைனப் அவர்களின் இல்லத்திற்குத்) திரும்பினார்கள். நானும் அவர்களுடன் திரும்பினேன். ஸைனப் (ரலி) அவர்களிடம் வந்தபோது அந்தக் குழுவினர் கலைந்து செல்லாமல் அங்கேயே அமர்ந்து கொண்டிருந்தார்கள். இதைக் கண்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மீண்டும்) திரும்பி வந்தார்கள். நானும் அவர்களுடன் திரும்பினேன். (இப்போதும்) ஆயிஷா (ரலி) அவர்களது அறையின் நிலைப் படிக்கு வந்தார்கள். அக்குழுவினர் வெளியேறியிருப்பார்கள் என்று நினைத்துக் கொண்டு மீண்டும் திரும்பினார்கள். நானும் அவர்களுடன் திரும்பினேன். அப்போது அந்தக் குழுவினர் வெளியேறிச் சென்றுவிட்டிருந்தனர். அப்போதுதான் பர்தா தொடர்பான (33:53ஆவது) இறைவசனம் அருளப் பெற்றது. உடனே எனக்கும் தமக்கு மிடையே நபி (ஸல்) அவர்கள் திரையிட்டார்கள்.14 அத்தியாயம் : 79",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		}
	]
}