{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுடன் நாங்கள் (மஸ்ஜிதுந் நபவீ) பள்ளிவாசலில் அமர்ந் திருந்தபோது, ஒட்டகத்தில் ஒரு மனிதர் வந்து பள்ளிவாச(லின் வாயி)லில் ஒட்டகத் தைப் படுக்கவைத்து அத(ன் முன்னங் காலி)னை மடக்கிக் கட்டினார். பிறகு மக்களிடம் “உங்களில் முஹம்மத் அவர்கள் யார்?” என்று கேட்டார். -அப்போது நபி (ஸல்) அவர்கள் மக்களிடையே சாய்ந்து அமர்ந்திருந்தார்கள்.- “இதோ சாய்ந்து அமர்ந்திருக்கும் இந்த வெள்ளை நிற மனிதர்தான்” என்று நாங்கள் சொன்னோம். உடனே அம்மனிதர் நபி (ஸல்) அவர்களை ‘அப்துல் முத்தலிபின் (மகனின்) புதல்வரே!’ என்று அழைத்தார். அதற்கு நபியவர்கள் “உமது அழைப்பை ஏற்றேன்” என்று சொன்னார்கள். அப்போது அம்மனிதர் நபி (ஸல்) அவர்களிடம், “நான் உங்களிடம் சில கேள்விகள் கேட்கப்போகிறேன்; கேள்வியில் கடுமை காட்டப்போகிறேன். அதற்கு நீங்கள் என்மீது கோபப்பட்டுவிடக் கூடாது” என்றார். அதற்கு நபி (ஸல்) அவர்கள் “உமது மனதில் பட்டதைக் கேளும்” என்றார்கள். அப்போது அம்மனிதர், “உம்முடைய, உமக்குமுன் இருந்தவர்களுடைய இறைவன்மீது ஆணையாகக் கேட்கி றேன்; அல்லாஹ்தான் உம்மை மனித இனம் முழுவதற்கும் தூதராக அனுப்பி னானா?” என்றார். அதற்கு நபி (ஸல்) அவர்கள் “ஆம், அல்லாஹ் சாட்சியாக!” என்றார்கள். அடுத்து அவர் “அல்லாஹ்வை முன் வைத்து உம்மிடம் நான் கேட்கிறேன்; அல்லாஹ்தான் இரவிலும் பகலிலுமாக (நாளொன்றுக்கு) ஐவேளைத் தொழுகை களை நாம் தொழுது வரவேண்டுமென்று உமக்கு(ம் மக்களுக்கும்) கட்டளையிட்டி ருக்கின்றானா?” என்று கேட்டார். அதற்கும் நபி (ஸல்) அவர்கள் “ஆம், அல்லாஹ் சாட்சியாக” என்றார்கள். அவர் “அல்லாஹ்வை முன்வைத்து உம்மிடம் நான் கேட்கிறேன்; அல்லாஹ் தான் ஒவ்வொரு ஆண்டிலும் (குறிப்பிட்ட) இந்த (ரமளான்) மாதத்தில் நாம் நோன்பு நோற்க வேண்டும் என்று உமக்குக் கட்டளையிட்டிருக்கின்றானா?” என்று கேட்டார். அதற்கும் நபி (ஸல்) அவர்கள் “ஆம், அல்லாஹ் சாட்சியாக!’ என்றார்கள். அவர், “அல்லாஹ்வை முன்வைத்து உம்மிடம் நான் கேட்கிறேன்: அல்லாஹ்தான் எங்களில் செல்வர்களிடமிருந்து இந்த (ஸகாத் எனும்) தர்மத்தைப் பெற்று எங்களில் வறியோரிடையே விநியோகிக்குமாறு உமக்குக் கட்டளையிட்டிருக்கின்றானா?” என்று கேட்டார். அதற்கும் நபி (ஸல்) அவர்கள், “ஆம், அல்லாஹ் சாட்சியாக!” என்றார்கள். (இவற்றைக் கேட்டுவிட்டு) அம்மனிதர், “நீங்கள் (இறைவனிடமிருந்து) கொண்டுவந்தவற்றை நான் நம்பி ஏற்கின்றேன்” என்று கூறிவிட்டு, “நான், என் கூட்டத்தாரில் இங்கு வராமல் இருப்பவர்களின் தூதுவன் ஆவேன்; நான்தான் பனூ சஅத் பின் பக்ர் குலத்தாரில் ஒருவரான ளிமாம் பின் ஸஅலபா” என்றும் கூறினார். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 3",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		}
	]
}