{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6362,
			"arabicnumber": 6362,
			"text": "அனஸ் (ரலி) அவர்கள் கூறியதாவது: நபித்தோழர்கள் (சிலர்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், (அவர்களுக்குப் பிடிக்காத) சில விஷயங்கள் குறித்து வற்புறுத்திக் கேட்டுக்கொண்டி ருந்தனர். இதனால் கோபமடைந்த நபி (ஸல்) அவர்கள் சொற்பொழிவு மேடை (மிம்பர்) மீதேறி, “(நான் அறிகின்றவற்றை நீங்கள் அறிந்தால் குறைவாகச் சிரிப்பீர்கள்; அதிகமாக அழுவீர்கள்.) இன்று நீங்கள் என்னிடம் எதைப் பற்றிக் கேட்டாலும் அதைப் பற்றி நான் உங்களுக்குத் தெளிவுபடுத்தாமல் இருக்கப்போவதில்லை” என்று சொன்னார்கள். அப்போது நான் வலப் பக்கமும் இடப் பக்கமும் திரும்பிப் பார்க்கத் தலைப்பட்டபோது அங்கிருந்த ஒவ்வொருவரும் தத்தமது ஆடையால் தம் தலைகளைச் சுற்றிப் போர்த்தியவாறு அழுதுகொண்டிருந்தார்கள். இந்நிலையில் அங்கு ஒரு மனிதர் இருந்தார். அவர் மற்றவர்களுடன் சண்டை சச்சரவு செய்யும்போது, அவருடைய தந்தையல்லாத மற்றொருவரின் மகன் என அழைக்கப்பட்டுவந்தார். ஆகவே அவர், “அல்லாஹ்வின் தூதரே! என் தந்தை யார்?” என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஹுதாஃபா(தான் உன் தந்தை)” என்று பதிலளித்தார்கள். (நபி (ஸல்) அவர்களின் சாந்த முகத்தில் கோபத்தின் ரேகை படர்வதைக் கண்ட) உமர் (ரலி) அவர்கள், “நாங்கள் அல்லாஹ்வை இறைவனாகவும், இஸ்லாமை மார்க்கமாகவும், முஹம்மத் (ஸல்) அவர்களை இறைத்தூதராகவும் மனநிறைவுடன் ஏற்றுக்கொண்டோம். சோதனைகளிலிருந்து அல்லாஹ்விடம் பாதுகாப்புக் கோருகிறோம்” என்று கூறலானார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “நன்மையிலும் தீமையிலும் இன்றைய தினத்தைப் போன்று எந்த நாளையும் நான் ஒருபோதும் கண்டதில்லை. எனக்குச் சொர்க்கமும் நரகமும் காட்டப்பட்டன. அவற்றை (மிஹ்ராபின்) இந்தச் சுவருக்கு அப்பால் கண்டேன்” என்று சொன்னார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான ஹிஷாம் (ரஹ்) அவர்கள் கூறு கிறார்கள்:) இந்த நபிமொழியை அறிவிக்கும்போது கத்தாதா (ரஹ்) அவர்கள், “இறை நம்பிக்கை கொண்டவர்களே! சில விஷயங்களைப் பற்றி (அவசியமில்லாமல்) கேட்டுக்கொண்டிராதீர்கள். (ஏனெனில்,) அவை உங்களுக்கு வெளிப்படுத்தப்படு மானால் உங்களுக்கு மனவருத்தத்தை ஏற்படுத்தும்” எனும் (5:101ஆவது) இறைவசனத்தைக் குறிப்பிடுவார்கள்.49 அத்தியாயம் : 80",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 59
			}
		}
	]
}