{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்விடம் வானவர்கள் சிலர் உள்ளனர். அவர்கள் அல்லாஹ்வை நினைவுகூர்ந்து போற்றுவோரைத் தேடிய வண்ணம் தெருக்களில் சுற்றி வருகின்றனர். அல்லாஹ்வை நினைவுகூர்ந்து போற்றிக் கொண்டிருக்கும் ஒரு குழுவினரை அவர்கள் கண்டால், “உங்கள் தேவையைப் பூர்த்திசெய்ய வாருங்கள்” என்று அவர்கள் (தம்மில்) ஒருவரை ஒருவர் அழைக்கின்றனர். பின்னர் அந்த வானவர்கள் அல்லாஹ்வைப் போற்றுகின்றவர்களைத் தம் இறக்கைகளால் முதல் வானம்வரை சூழ்ந்துகொள்கின்றனர். அப்போது அவ்வானவர்களிடம் அவர்களுடைய இறைவன் “என் அடியார்கள் என்ன கூறுகின்றனர்?” என்று கேட்கின்றான். -அவ்வானவர்களைவிட அவனே தம் அடியார்களை நன்கறிந்தவன் ஆவான்.- “அவர்கள் உன்னைத் தூய்மையானவன் என்று கூறி துதிக்கின்றனர். உன்னைப் பெருமைப்படுத்திக்கொண்டும், உன்னைப் புகழ்ந்துகொண்டும், உன்னைப் போற்றிக்கொண்டும் இருக்கின்றனர்” என்று வானவர்கள் கூறுகின்றனர். அதற்கு இறைவன், “அவர்கள் என்னைப் பார்த்திருக்கிறார்களா?” என்று கேட்பான். அதற்கு வானவர்கள், “இல்லை; உன் மீதாணையாக! அவர்கள் உன்னைப் பார்த்ததில்லை” என்று பதிலளிப்பார்கள். அதற்கு இறைவன், “என்னைப் பார்த் திருந்தால் எப்படியிருப்பார்கள்?” என்று கேட்பான். வானவர்கள், “உன்னை அவர்கள் பார்த்திருந்தால் இன்னும் அதிகமாக உன்னை வழிபடுவார்கள்; இன்னும் கூடுதலாக உன்னைப் போற்றிப் புகழ்ந்து துதிப்பார்கள்” என்று பதிலளிப்பார்கள். அதற்கு இறைவன், “என்னிடம் அவர்கள் என்ன வேண்டுகின்றார்கள்?” என்று (தனக்குத் தெரியாதது போலக்) கேட்பான். வானவர்கள், “அவர்கள் உன்னிடம் சொர்க்கத்தைக் கேட்கின்றனர்” என்பார்கள். அதற்கு இறைவன், “அவர்கள் அதைப் பார்த்ததுண்டா?” என்று கேட்பான். அதற்கு வானர்கள், “இல்லை; உன் மீதாணையாக! அதிபதியே! அவர்கள் அதைப் பார்த்ததில்லை” என்பர். அதற்கு இறைவன், “அவ்வாறாயின் அதை அவர்கள் பார்த்திருந்தால் அவர்கள் நிலை எப்படியிருக்கும்?” என்று கேட்பான். வானவர்கள், “சொர்க்கத்தை அவர்கள் பார்த்திருந்தால் இன்னும் அதிகமாக அதன் மீது ஆசை கொண்டு, அதிக வேட்கையுடன் தீவிரமாக அதைத் தேடுவார்கள்” என்று பதிலளிப்பார்கள். இறைவன், “அவர்கள் எதிலிருந்து (என்னிடம்) பாதுகாப்புக் கோருகின்றனர்?” என்று வினவுவான். வானவர்கள், “நரகத்திலிருந்து (பாதுகாப்புக் கோருகின்றனர்)” என்று பதிலளிப்பர். இறைவன், “அதை அவர்கள் பார்த்திருக்கிறார்களா?” என்று கேட்பான். வானவர்கள், “இல்லை; உன் மீதாணையாக! அதை அவர்கள் பார்த்ததில்லை” என்பர். அதற்கு இறைவன், “அவ்வாறாயின் அவர்கள் அதைப் பார்த்திருந்தால் அவர்கள் நிலை என்னவாக இருந்திருக்கும்?” என்று கேட்பான். வானவர்கள், “நரகத்தை அவர்கள் பார்த்திருந்தால் நிச்சயம் அதிலிருந்து கடுமையாக வெருண்டோடுபவர்களாகவும் அதனை மிகவும் அஞ்சுபவர்களாகவும் இருப்பார்கள்” என்பர். அப்போது இறைவன், “ஆகவே (வானவர்களே!) அவர்களை நான் மன்னித்துவிட்டேன் என்பதற்கு உங்களை நான் சாட்சிகளாக ஆக்குகிறேன்” என்று கூறுவான். அந்த வானவர்களிடையே உள்ள ஒரு வானவர், “(அந்தக் குழுவினரிடையே அமர்ந்திருந்த) இன்ன மனிதன், உன்னைப் போற்றுகின்ற அவர்களில் உள்ளவன் அல்லன். அவன் ஏதோ தேவை நிமித்தமாகவே அங்கு வந்தான்” என்பார். அதற்கு இறைவன், “அவர்கள் ஒன்றாக அமர்ந்துள்ள நண்பர்கள். அவர்களுடன் வந்து அமர்ந்த ஒருவன் அவர்களால் (நற்பேறு பெறுவானே தவிர,) நற்பேறற்றவனாக ஆகமாட்டான்” என்று கூறுவான். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 80",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		}
	]
}