{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6530,
			"arabicnumber": 6530,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (மறுமை நாளில்) அல்லாஹ் (ஆதி மனிதரை நோக்கி) ‘ஆதமே!’ என்று அழைப்பான். அதற்கு அவர்கள், “(இறைவா!) இதோ கீழ்ப்படியக் காத்திருக்கிறேன். (கட்டளையிடு.) நலம் அனைத்தும் உன் கரங்களில்தான்” என்று கூறுவார்கள். அப்போது அல்லாஹ் “(உங்கள் சந்ததிகளில்) நரகத்திற்குச் செல்லவிருப்பவர்களை (மற்றவர்களிலிருந்து) தனியாகப் பிரித்திடுங்கள்” என்று கூறுவான். ஆதம் (அலை) அவர்கள், “எத்தனை நரகவாசிகளை?” என்று கேட்பார்கள். அதற்கு அவன் “ஒவ்வோர் ஆயிரம் பேரிóருந்தும் தொள்ளாயிரத்துத் தொண்ணூற்றொன்பது பேரை (தனியாகப் பிரித்திடுங்கள்)” என்று பதிலளிப்பான். (அப்போதுள்ள பயங்கர சூழ்நிலையின் காரணத்தால்) பாலகன்கூட நரைத்து (மூப்படைந்து)விடுகின்ற, கர்ப்பம் கொண்ட ஒவ்வொரு பெண்ணும் கர்ப்பத்தை(ப் பீதியின் காரணத்தால் அரைகுறையாக)ப் பிரசவித்துவிடுகின்ற நேரம் இதுதான். மக்களை (அச்சத்தால்) போதையுற்றவர்களாக நீங்கள் காண்பீர்கள். ஆனால், அவர்கள் (உண்மையிலேயே மதுவால்) போதையுற்றிருக்கமாட்டார்கள். மாறாக, அல்லாஹ்வின் வேதனை கடுமை யானதாகும். இவ்வாறு நபியவர்கள் கூறியது மக்களுக்குச் சிரமமாக இருந்தது. எனவே அவர்கள், “அல்லாஹ்வின் தூதரே! (ஒவ்வோர் ஆயிரத்திலும் நரகத்திற்குச் செல்லாமல் எஞ்சியிருக்கும்) அந்த ஒரு நபர் எங்களில் யார்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “(பயப்படாதீர்கள்;) நற்செய்தி பெறுங்கள். யஃஜூஜ் மஃஜூஜ் கூட்டத்தாரில் ஆயிரம்பேர் என்றால், உங்களில் ஒருவர் (நரகத்திற்குச் செல்ல தனியாக பிரிக்கப்பட்டோரில்) இருப்பார்” என்று கூறிவிட்டுப் பிறகு, “என் உயிர் எவன் கையிலுள்ளதோ அவன்மீதாணையாக! நீங்கள் சொர்க்க வாசிகளில் மூன்றில் ஒரு பங்கினராக இருக்க வேண்டும் என்று நான் பேராவல் கொள்கிறேன்” என்று கூறினார்கள். உடனே நாங்கள் அல்லாஹ்வைப் புகழ்ந்து தக்பீர் (அல்லாஹு அக்பர்) முழக்கமிட்டோம். பிறகு நபி (ஸல்) அவர்கள், “என் உயிர் எவன் கையிலுள்ளதோ அவன்மீதாணையாக! நீங்கள் சொர்க்கவாசிகளில் பாதிப்பேராக இருக்க வேண்டுமென நான் பேராவல் கொள்கின்றேன். மற்றச் சமுதாயங்களோடு ஒப்பிடுகையில் நீங்கள் கறுப்புக் காளை மாட்டின் தோலிலுள்ள வெள்ளை முடியைப் போன்று, அல்லது கழுதையின் காலிலுள்ள வெள்ளை சொட்டையைப் போன்று இருக்கிறீர்கள்” என்று சொன்னார்கள். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள்.111 அத்தியாயம் : 83",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 119
			}
		}
	]
}