{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6623,
			"arabicnumber": 6623,
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: நான் (என்) அஷ்அரீ குலத்தாரில் ஒரு குழுவினருடன் நபி (ஸல்) அவர்களிடம் சென்று, (எங்களையும் எங்கள் பயணச் சுமைகளையும்) சுமந்து செல்ல (ஒட்டகங்கள் ஏற்பாடு) செய்யுமாறு கேட்டேன். அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (ஒட்டகத்தில்) ஏற்றியனுப்ப முடியாது. ஏனெனில், உங்களை ஏற்றியனுப்பத் தேவையான (ஊர்தி) ஒட்டகங்கள் என்னிடம் (தற்போது கைவசம்) இல்லை” என்று சொன்னார்கள். பிறகு அல்லாஹ் நாடிய நேரம்வரை நாங்கள் (அங்கேயே) இருந்தோம். பின்பு நபியவர்களிடம் வெள்ளைத் திமில்கள் கொண்ட மூன்று ஒட்டக மந்தைகள் கொண்டுவரப்பட்டன. ஆகவே, அவற்றின் மீது எங்களை ஏற்றி அனுப்பினார்கள். நாங்கள் (அங்கிருந்து விடைபெற்றுச்) சென்றுகொண்டிருந்தபோது ‘நாங்கள் எங்களுக்குள்’ அல்லது ‘எங்களில் சிலர்’, “அல்லாஹ்வின் மீதாணையாக! (நபி (ஸல்) அவர்கள் தரமாட்டேனென்று சத்தியம் செய்தபிறகு இவற்றை நாம் வாங்கிச் சென்றால் இவற்றில்) நமக்கு வளம் (பரக்கத்) ஏற்படாது. நபி (ஸல்) அவர்களிடம் நம்மைச் சுமந்து செல்ல (ஒட்டகங்கள் ஏற்பாடு) செய்யும்படி கேட்டோம். அவ்வாறு நம்மை ஏற்றி யனுப்பத் தம்மால் இயலாது என நபியவர்கள் சத்தியம் செய்து கூறினார்கள். பிறகு, நாம் ஏறிச்செல்ல ஒட்டகங் கள் வழங்கினார்கள். ஆகவே, நபி (ஸல்) அவர்களிடம் நாம் மீண்டும் சென்று (அவர்கள் செய்த சத்தியத்தை) அவர்களுக்கு நினைவுபடுத்துவோம்” என்று சொல்லிக்கொண்டோம். அவ்வாறே நபி அவர்களிடம் சென்றோம். (அவர்கள் செய்த சத்தியத்தை நினைவுபடுத்தினோம்.) அப்போது அவர்கள், “நான் உங்களை ஒட்டகத்தில் ஏற்றி அனுப்பவில்லை, மாறாக, அல்லாஹ்தான் உங்களை (அதில்) ஏற்றி அனுப்பினான். அல்லாஹ்வின் மீதாணையாக! அவன் நாடினால், இனிமேல் நான் ஏதேனும் ஒரு சத்தியம் செய்து, பிறகு அதுவல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் ‘சத்திய முறிவுக்காகப் பரிகாரம் செய்துவிட்டு, அந்தச் சிறந்ததையே செய்வேன்’; அல்லது ‘சிறந்ததையே செய்துவிட்டு, சத்திய முறிவுக்காகப் பரிகாரம் செய்துவிடுவேன்’ என்று சொன்னார்கள்.4 அத்தியாயம் : 83",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 3
			}
		}
	]
}