{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "அஸ்வத் பின் யஸீத (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் ஆயிஷா (ரலி) அவர்களிடம் இருந்தபோது, தொழுகையை விடாமல் தொழுவது பற்றியும் அதன் முக்கியத்துவம் குறித்தும் பேசிக்கொண்டிருந்தோம். அப்போது ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எந்த நோயில் இறந்துபோனார்களோ அந்த நோயின்போது (ஒரு) தொழுகையின் நேரம் வந்து, தொழுகை அறிவிப்புச் செய்யப்பட்டது. அப்போது அவர்கள், “அபூபக்ர் அவர்களை மக்களுக்குத் தொழுவிக்கச் சொல்லுங்கள்” என்று கூறினார்கள். அதற்கு, “அபூபக்ர் (ரலி) அவர்கள் வேகமாகத் துக்கப்படுகின்ற மனிதர்; (தொழுவதற்காக) நீங்கள் நிற்குமிடத்தில் அவர்கள் நின்றால் (மனம் நெகிழ்ந்து அழுதுவிடுவார்கள்.) அவர்களால் மக்களுக்குத் தொழுவிக்க முடியாது” என்று சொல்லப்பட்டது. நபி (ஸல்) அவர்கள் முன்பு சொன்னதைப் போன்றே மீண்டும் சொன்னார்கள். மக்களும் முன்பு சொன்ன பதிலையே மீண்டும் சொன்னார்கள். மூன்றாவது முறை “(பெண்களாகிய) நீங்கள் யூசுஃபுடைய (அழகில் மயங்கிய) தோழிகள் போன்(று உள்நோக்கத்துடன் பேசுகின்)றவர்கள். அபூபக்ர் அவர்களிடம் மக்களுக்குத் தொழுவிக்கச் சொல்லுங்கள்” என்று கூறினார்கள். ஆகவே, அபூபக்ர் (ரலி) அவர்கள் புறப்பட்டு வந்து (மக்களுக்குத்) தொழுவிக்கலானார்கள். நபி (ஸல்) அவர்கள் தமது உடல் நலம் சற்றுத் தேறியிருப்பதை (அப்போது) கண்டார்கள். உடனே இரண்டு மனிதர் களுக்கிடையே தொங்கியபடி புறப்பட்டு வந்தார்கள். நோயினால் (கால்களை ஊன்ற முடியாமல்) தம் கால்கள் (பூமியில்) இழுபட அவர்கள் புறப்பட்டு வந்ததை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது. (நபி (ஸல்) அவர்கள் பள்ளிவாசலுக்குள் வருவதை அறிந்த) அபூபக்ர் (ரலி) அவர்கள் பின்வாங்க முனைந்தார்கள். அப்போது அவர்களிடம் நபி (ஸல்) அவர்கள், ‘உங்கள் இடத்திலேயே இருங்கள்’ என்று (கையால்) சைகை செய்தார்கள். பிறகு நபி (ஸல்) அவர்கள் (பள்ளிவாசலுக்கு உள்ளே) கொண்டுவரப்பட்டார்கள். அவர்கள் அபூபக்ர் (ரலி) அவர்களுக்குப் பக்கத்தில் அமர்ந்தார்கள். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அஃமஷ் (ரஹ்) அவர்கள் இதை அறிவித்துக்கொண்டிருந்தபோது அவர்களிடம், “(அப்போது) நபி (ஸல்) அவர்கள் தொழுகை நடத்த, அவர்களைப் பின்பற்றி அபூபக்ர் (ரலி) அவர்கள் தொழுதார்களா? அபூபக்ர் (ரலி) அவர்களைப் பின்பற்றி மக்கள் தொழுதனரா?” என்று கேட்கப்பட்டது. அதற்கு அஃமஷ் (ரஹ்) அவர்கள் தமது தலையால் ‘ஆம்’ என (சைகையால்) பதிலளித்தார்கள். அஃமஷ் (ரஹ்) அவர்களின் அறிவிப்பில் ஒரு பகுதியை அபூதாவூத் அத்தயா-சீ (ரஹ்) அவர்கள் அறிவித்துள்ளார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அபூமுஆவியா (முஹம்மத் பின் காஸிம் -ரஹ்) அவர்களது அறிவிப்பில், “நபி (ஸல்) அவர்கள் அபூபக்ர் (ரலி) அவர்களுக்கு இடப் பக்கத்தில் அமர்ந்(து தொழு)தார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் நின்றவாறு தொழுதுகொண்டிருந்தார்கள்” என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		}
	]
}