{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6649,
			"arabicnumber": 6649,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல்ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: (குளாஆ குலத்தைச் சேர்ந்த) இந்த (எங்கள்) ஜர்ம் கோத்திரத்தாருக்கும் (யமன் நாட்டவர்களான) அஷ்அரீ குலத்தாருக்குமிடையே நட்புறவும் சகோதரத்துவமும் இருந்துவந்தது. (ஒரு முறை) நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது அபூமூசா (ரலி) அவர்களுக்கு அருகில் உணவு வைக்கப்பட்டது. அதில் கோழி இறைச்சி இருந்தது. அபூமூசா (ரலி) அவர்களுக்குப் பக்கத்தில் ‘பனூ தைம்’ குலத்தைச் சேர்ந்த சிவப்பான மனிதர் ஒருவர் இருந்தார். அவர் அடிமைகளில் ஒருவரைப் போன்று காணப்பட்டார். அபூமூசா (ரலி) அவர்கள் அந்த மனிதரையும் உணவு உண்ண அழைத்தார்கள். அதற்கு அந்த மனிதர், “இந்தக் கோழி (இனம், அசுத்தம்) ஒன்றைத் தின்பதை நான் கண்டேன். அது எனக்கு அருவருப்பை உண்டாக்கவே இதை இனிமேல் நான் உண்ணமாட்டேன் என்று சத்தியம் செய்துவிட்டேன்” என்று சொன்னார். (இதைக் கேட்ட) அபூமூசா (ரலி) அவர்கள், “எழுந்து (இங்கே) வாருங்கள்! இதைப் பற்றி உங்களுக்கு நான் (நபிகளாரின் சமூகத்தில் நடந்த ஒரு சம்பவத்தை) அறிவிக்கிறேன்” என்று சொல்லிவிட்டுக் கூறலானார்கள்: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (என்) அஷ்அரீ குலத்தார் சிலருடன் எங்களை(யும் எங்கள் பயணச் சுமைகளையும்) சுமந்துசெல்ல ஒட்டகங்கள் தரும்படி கேட்டுச் சென்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! உங்களை ஏற்றியனுப்பத் தேவையான (ஊர்தி) ஒட்டகங்கள் என்னிடம் இல்லை. எனவே, உங்களை நான் (ஒட்டகத்தில்) ஏற்றி அனுப்பமாட்டேன்” என்று கூறினார்கள். (ஆகவே நாங்கள் திரும்பிச் சென்றுவிட்டோம்.) அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த (ஃகனீமத்) ஒட்டகங்கள் கொண்டுவரப்பட்டன. உடனே, “அஷ்அரீ குலத்தார் எங்கே?” என எங்களைக் குறித்து கேட்டுவிட்டு, எங்களுக்கு வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை வழங்குமாறு உத்தரவிட்டார்கள். நாங்கள் (அவர்களிடமிருந்து அதைப் பெற்றுக்கொண்டு) சென்றுகொண்டிருந்த போது (நாங்கள் எங்களுக்குள்) “நாம் என்ன காரியம் செய்துவிட்டோம்! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நமக்கு (ஊர்தி) ஒட்டகங்கள் வழங்கப் போவதில்லையெனச் சத்தியம் செய்தார்கள்; அவர்களிடம் (அதற்கான) ஒட்டகங்களும் இருக்கவில்லை. பிறகு (என்ன நடந்ததோ!) நமக்கு ஒட்டகங்களை வழங்கினார்கள். (ஒருவேளை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் சத்தியத்தை நாம் மறக்கும்படி செய்துவிட்டோமா! (அப்படிச் செய்தால்) அல்லாஹ்வின் மீது சத்தியமாக! நாம் ஒருபோதும் வெற்றியடையப் போவதில்லை” என்று பேசிக்கொண்டோம். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பிச் சென்றோம். அவர்களிடம், “நாங்கள் தங்களிடம் எங்களை(யும் எங்கள் பயணச் சுமைகளையும்) ஏற்றிச்செல்ல ஒட்டகங்கள் கேட்டு (முதலில்) வந்தபோது எங்களுக்கு ஒட்டகங்கள் தரப்போவதில்லையெனத் தாங்கள் சத்தியம் செய்தீர்கள். தங்களிடம் எங்களை ஏற்றியனுப்ப(த் தேவையான) ஒட்டகங்களும் இருக்கவில்லை. (பிறகு எங்களுக்கு ஒட்டகங்கள் தரும்படி மறதியாகச் சொல்லிவிட்டீர்களோ?)” என்று கேட்டோம். அதற்கு நபி (ஸல்) அவர்கள், “நான் உங்களை ஏற்றிச்செல்ல ஒட்டகங்கள் வழங்கவில்லை. மாறாக, அல்லாஹ்தான் உங்களை ஏற்றிச்செல்ல ஒட்டகங்கள் வழங்கினான். அல்லாஹ்வின் மீது சத்தியமாக! (பொதுவாக) நான் எந்த ஒன்றுக்காகவும் சத்தியம் செய்து, பிறகு அது அல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் சிறந்ததையே நான் செய்வேன்; சத்தியத்தை முறித்து அதற்காகப் பரிகாரமும் செய்வேன்” என்று கூறினார்கள்.29 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 83",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 28
			}
		}
	]
}