{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல் ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: நாங்கள் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். ‘ஜர்ம்’ குலத்தாரான எங்களுக்கும் இந்த (அஷ்அரீ) குலத்தாருக்கும் இடையே நட்புறவும் ஒத்துழைப்பும் இருந்தது. அப்போது (அபூமூசா அவர்களுக்கு) உணவு கொண்டுவரப்பட்டது. அந்த உணவில் கோழி இறைச்சி இருந்தது. அங்கு பனூ தைமுல்லாஹ் குலத்தைச் சேர்ந்த சிவப்பு மனிதர் ஒருவர் இருந்தார். அவர் ஓர் அடிமையைப் போன்று காணப்பட்டார். அவர் (உணவின் பக்கம்) நெருங்கவில்லை. ஆகவே, அவரிடம் அபூமூசா “அருகில் வாருங்கள். ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோழி இறைச்சி உண்பதை நான் பார்த்திருக்கிறேன்” என்றார்கள். அதற்கு அவர், “இந்தக் கோழி (இனம்) நான் அருவருப்பாகக் கருதும் ஒன்றைத் தின்னப் பார்த்தேன். உடனே ஒரு போதும் இதை நான் உண்ணமாட்டேன் என்று சத்தியம் செய்துவிட்டேன்” என்றார். அப்போது அபூமூசா (ரலி) அவர்கள் “அருகில் வாருங்கள். அது குறித்து உங்களுக்குத் தெரிவிக்கிறேன்” என்று சொல்லிவிட்டு(ப் பின்வருமாறு) கூறலானார்கள்: நாங்கள் அஷ்அரீ குலத்தார் சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றோம். அப்போது அவர்கள் தர்ம ஒட்டகங்களில் சிலவற்றை பங்கிட்டுக் கொண்டிருந்தார்கள். நான் (எங்களைச்) சுமந்துசெல்ல ஒட்டகங்கள் தருமாறு அவர்களிடம் கேட்டேன். -அப்போது நபியவர்கள் கோபமாக இருந்தார்கள் என்று அறிவிப்பாளர் கூறியதாகவே நான் கருதுகிறேன் என அய்யூப் (ரஹ்) அவர்கள் கூறினார்கள்- அப்போது நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை (ஒட்டகத்தில்) ஏற்றியனுப்ப முடியாது. ஏனெனில், உங்களை ஏற்றியனுப்பத் தேவையான (ஊர்தி) ஒட்டகங்கள் என்னிடம் (தற்போது கைவசம்) இல்லை” என்று சொன்னார்கள். ஆகவே, நாங்கள் சென்றுவிட்டோம். பிறகு, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் கொண்டுவரப்பட்டன. உடனே “இந்த அஷ்அரீகள் எங்கே? இந்த அஷ்அரீகள் எங்கே?” என்று வினவப்பட்டது. இதையடுத்து நாங்கள் (நபியவர்களிடம்) சென்றோம். அப்போது வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை எங்களுக்கு வழங்கும்படி உத்தரவிட்டார்கள். (அவற்றைப் பெற்றுக்கொண்டு) விரைவாக நாங்கள் புறப்பட்டோம். அப்போது நான் என் தோழர்களிடம், “நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று நாம் ஏறிச்செல்ல வாகனம் கேட்டோம். அவ்வாறு நம்மை ஏற்றியனுப்ப இயலாது என அவர்கள் சத்தியம் செய்தார்கள். பிறகு நம்மை அழைத்து ஏற்றியனுப்பினார்கள். ஆகவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாம் செய்த சத்தியத்தை மறந்துவிட்டார்கள். அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தாம் செய்த சத்தியத்தை மறக்கும்படி நாம் செய்திருந்தால் ஒருபோதும் நாம் வெற்றியடையமாட்டோம். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பச் சென்று, அவர்கள் செய்த சத்தியத்தை அவர்களுக்கு நாம் நினைவுபடுத்துவோம்” என்று கூறினேன். ஆகவே, நாங்கள் திரும்பச் சென்று, “அல்லாஹ்வின் தூதரே! நாங்கள் ஒட்டகம் கேட்டுத் தங்களிடம் வந்தோம். எங்களுக்குத் தரமுடியாது எனத் தாங்கள் சத்தியம் செய்தீர்கள். பிறகு எங்களை (அழைத்து) ஒட்டகங்களில் ஏற்றியனுப்பினீர்கள். ஆகவே, தாங்கள் செய்த சத்தியத்தை மறந்துவிட்டீர்களென நாங்கள் ‘எண்ணுகிறோம்’ அல்லது ‘அறிகிறோம்’ என்று கூறினோம். அதற்கு நபி (ஸல்) அவர்கள், “செல்லுங்கள். நான் உங்களை ஒட்டகத் தில் ஏற்றியனுப்பவில்லை. மாறாக, அல்லாஹ்தான் உங்களை அதில் ஏற்றியனுப்பினான். அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் நாடினால், இனிமேல் நான் எந்த ஒன்றுக்காகவும் சத்தியம் செய்து, பிறகு அது அல்லாத வேறொன்றை அதைவிடச் சிறந்ததாகக் கருதும்பட்சத்தில் அந்தச் சிறந்ததையே நான் செய்வேன். சத்திய முறிவுக்காகப் பரிகாரம் செய்துவிடுவேன்” என்று கூறினார்கள்.21 இந்த ஹதீஸ் ஆறு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		}
	]
}