{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6733,
			"arabicnumber": 6733,
			"text": "சஅத் பின் அபீவக்காஸ் (ரலி) அவர்கள் கூறியதாவது: (‘விடைபெறும்’ ஹஜ்ஜின்போது) மக்காவில் நான் கடுமையாக நோய்வாய்ப்பட்டு மரணத்தை எதிர்நோக்கியிருந்தேன். அப்போது நபி (ஸல்) அவர்கள் என்னை நலம் விசாரிக்க வந்தார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! என்னிடம் ஏராளமான செல்வங்கள் உள்ளன. என் ஒரு மகளைத் தவிர வேறு வாரிசுகள் யாரும் எனக்கில்லை. எனவே, எனது செல்வத்தில் மூன்றில் இரு பங்கை நான் தர்மம் செய்துவிடட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘வேண்டாம்’ என்றார்கள். “அவ்வாறாயின் பாதியை தர்மம் செய்யட்டுமா?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், ‘வேண்டாம்’ என்று சொன்னார்கள். “மூன்றில் ஒரு பங்கை (தர்மம் செய்யட்டுமா?)” என்று கேட்டேன். நபியவர்கள், “மூன்றில் ஒரு பங்குகூட அதிகம்தான். நீங்கள் உங்கள் பிள்ளைகளை மக்களிடம் கையேந்தும் ஏழைகளாக விட்டுச்செல்வதைவிடத் தன்னிறைவு உடையவர்களாக விட்டுச்செல்வதே சாலச்சிறந்ததாகும். (நல்ல நோக்கத்தில்) நீங்கள் செய்கின்ற ஒவ்வொரு செலவுக்கும் உங்களுக்கு நிச்சயம் நற்பலன் வழங்கப்படும்; நீங்கள் உங்கள் மனைவியின் வாயில் ஊட்டுகின்ற ஒரு கவளம் உணவாயினும் சரி! (அதற்கும் நற்பலன் உண்டு)” என்று சொன்னார்கள். அப்போது நான், “அல்லாஹ்வின் தூதரே! (ஹஜ் முடிந்து என் தோழர்கள் அனைவரும் மதீனா சென்றுவிடுவார்கள்.) நான் மட்டும் என் ஹிஜ்ரத் பூமி(யான மதீனாவு)க்குச் செல்லாமல் (மக்காவிலேயே) தங்கிவிடுவேனா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், “நான் (மதீனா) சென்றபிறகு நீங்கள் இங்கேயே தங்கியிருந்து, அல்லாஹ்வின் அன்பை நாடி எந்த நல்லறம் புரிந்தாலும் அதன் மூலம் உங்கள் உயர்வும் தகுதியும் அதிகமாகவே செய்யும். நான் (மதீனா) சென்றபிறகு, உங்கள் மூலம் சிலர் நன்மையடைவதற்காவும் மற்றச் சிலர் துன்பம் அடைவதற்காகவும் நீங்கள் இங்கேயே தங்கவைக்கப்படலாம். ஆனால், பாவம், சஅத் பின் கவ்லா! (அவருடைய ஆசை நிறைவேறவில்லை)” என்று மக்காவிலேயே இறந்துவிட்ட சஅத் பின் கவ்லா (ரலி) அவர்களுக்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுதாபம் தெரிவித்தார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்: சஅத் பின் கவ்லா (ரலி) அவர்கள் ஆமிர் பின் லுஅய் குலத்தைச் சேர்ந்தவராவார்.14 அத்தியாயம் : 86",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 10
			}
		}
	]
}