{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6899,
			"arabicnumber": 6899,
			"text": "அபூகிலாபா (ரஹ்) அவர்கள் கூறியதாவது: (கலீஃபா) உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள் ஒருநாள் மக்களிடம் பேசுவதற்காகத் தமது ஆசனத்தை எடுத்து வெளியே வைத்தார்கள். பிறகு மக்களுக்கு அனுமதி அளித்திட மக்கள் உள்ளே வந்தனர். பின்னர் (அவர்களிடம்) “அல்கசாமா சத்தியம் குறித்து நீங்கள் என்ன கூறுகின்றீர்கள்?” என்று கேட்டார்கள். மக்கள், “அல்கசாமா மூலம் பழிவாங்கிடல் உண்டு என்றே கருதுகிறோம். கலீஃபாக்கள் அதைக் கொண்டு பழிவாங்கியுள்ளனர்” என்று கூறினர். உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள் மக்களின் பார்வையில் நான் படும்வகையில் என்னை நிறுத்தி வைத்து என்னிடம், “அபூகிலாபா அவர்களே! (இது குறித்து) நீங்கள் என்ன சொல்கின்றீர்கள்?” என்று கேட்டார்கள். அப்போது நான், “இறைநம்பிக்கையாளர்களின் தலைவரே! உங்களிடம் படைத் தளபதி(களான ஆளுநர்)களும் அரபுத் தலைவர்களும் உள்ளனர். இவர்களில் ஐம்பது பேர் திமஷ்க் (டமாஸ்கஸ்) நகரிலுள்ள திருமணமான ஒரு மனிதர் குறித்து, அவரைப் பார்க்காமலேயே அவர் விபசாரம் புரிந்துவிட்டதாகச் சாட்சியம் அளித்தால் அவருக்கு நீங்கள் கல்லெறி தண்டனை வழங்கிவிடுவீர்களா, சொல்லுங்கள்?” என்று கேட்டேன். உமர் (ரஹ்) அவர்கள் “இல்லை” என்று சொன்னார்கள். நான், “இவர்களில் ஐம்பது பேர் ஹிம்ஸ் (சிரியா) நாட்டிலுள்ள ஒரு மனிதர் திருடிவிட்டார் என்று அவரைப் பார்க்காமலேயே அவருக்கெதிராகச் சாட்சியம் அளித்தால் அவரது கையை நீங்கள் துண்டித்துவிடுவீர்களா, சொல்லுங்கள்!” என்று கேட்டேன். உமர் பின் அப்தில் அஸீஸ் (ரஹ்) அவர்கள், “இல்லை” என்றார்கள். நான், “அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மூன்று காரணங்களில் ஒன்றுக்காக தவிர (வேறு எதற்காகவும்) எவரையும் கொல்லுமாறு உத்தரவிட்டதில்லை” என்று கூறினேன். (அந்த மூன்று காரணங்கள் வருமாறு:) 1. மன இச்சையின் பேரில் (அநியாயமாகப் படு)கொலை செய்தவர். (அதற்குத் தண்டனையாக) அவர் கொல்லப்படுவார். 2. திருமணமான பின்னர் விபசாரம் புரிந்த மனிதர். 3. அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் எதிராகப் போர்புரியத் துணிந்து இஸ்லாத்திலிருந்து (வெளியேறி இறைமறுப்பிற்குத்) திரும்பிச் சென்றுவிட்ட மனிதர். அப்போது மக்கள், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சில திருடர்க(ளின் கை கால்க)ளைத் துண்டித்துக் கண்களில் சூடிட்டுப் பிறகு அவர்களை வெயிலில் தூக்கி எறிந்தார்கள் என அனஸ் பின் மாலிக் (ரலி) அவர்கள் அறிவிக்கவில்லையா?” என்று கேட்டார்கள். உடனே நான், “உங்களுக்கு அனஸ் பின் மாலிக் (ரலி) அவர்களின் அறிவிப்பைக் கூறுகிறேன்” என்று சொல்லிவிட்டு அனஸ் (ரலி) அவர்கள் கூறியதை(ப் பின்வருமாறு) தெரிவித்தேன்:39 ‘உக்ல்’ எனும் குலத்தைச் சேர்ந்த எட்டுப்பேர் கொண்ட குழு ஒன்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து இஸ்லாத்தை ஏற்று உறுதிமொழி வழங்கினர். அப்போது (மதீனா) பூமியின் தட்பவெப்பம் அவர்களுக்கு ஒத்துக் கொள்ளவில்லை. ஆதலால் அவர்களின் உடல்நலம் பாதித்தது. எனவே, இது குறித்து அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் முறையிட்டனர். அவர்களிடம் நபி (ஸல்) அவர்கள், “நீங்கள் நம் மேய்ப்பருடன் சென்று அவரிடமுள்ள (முஸ்லிம்களுக்குச் சொந்தமான) ஒட்டகங்களின் பாலையும் சிறுநீரையும் அருந்தலாமே!” என்று (யோசனை) கூறினார்கள். உக்ல் குலத்தார், ‘சரி’ என்று சொல்லிவிட்டு அங்கு சென்றனர். அந்த ஒட்டகங்களின் பாலையும் சிறுநீரையும் அருந்தி உடல் நலம் தேறினர். பிறகு அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் மேய்ப்பாளரைக் கொலை செய்துவிட்டு அந்த ஒட்டகங்களை ஓட்டிச் சென்றுவிட்டனர். இந்தச் செய்தி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு எட்டியது. உடனே (அவர்களைப் பிடித்துவருமாறு) அவர்களைப் பின்தொடர்ந்து ஆட்களை அனுப்பிவைத்தார்கள். ஆகவே, அவர்கள் பிடிக்கப்பட்டு (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம்) கொண்டுவரப்பட்டனர். அப்போது அவர்களின் கைகளையும் கால்களையும் வெட்டுமாறும் அவர்களின் கண்களில் சூடிடுமாறும் உத்தரவிட்டார்கள். பிறகு அவர்கள் இறக்கும்வரை அவர்களை வெயிலில் தூக்கி எறிந்தார்கள்.40 நான், “இந்த உக்ல் குலத்தார் செய்ததை விடக்கொடிய செயல் வேறேது? அவர்கள் இஸ்லாத்திலிருந்து (இறைமறுப்பிற்கு) திரும்பிச்சென்றுவிட்டார்கள்; கொலை செய்தார்கள்; கொள்ளையடித்தார்கள்” என்று சொன்னேன். அப்போது அன்பஸா பின் சயீத் (ரஹ்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! இன்று (உம்மிடம் இதைச் செவியுற்றது)போல் ஒருபோதும் நான் செவியுற்றதில்லை” என்று கூறினார்கள். உடனே நான், “அன்பஸா! என் செய்தியை நீங்கள் மறுக்கின்றீர்களா?” என்று கேட்டேன். அவர், “இல்லை (நான் மறுக்கவில்லை). மாறாக, இச்செய்தியை நீங்கள் உள்ளபடி கூறினீர்கள்” என்று கூறிவிட்டு, “அல்லாஹ்வின் மீதாணயாக! இந்த (ஷாம்) மாகாணத்தாரிடையே இந்த மூதறிஞர் வாழ்ந்துகொண்டிருக்கும்வரை மக்கள் நன்மையில் நீடிப்பர்” என்று (என்னைக் குறித்துக்) கூறினார்கள். நான், “இந்த (கசாமா) விஷயம் தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து முன்மாதிரி கிடைத்துள்ளது” என்றேன். (அதாவது) அன்சாரிகளில் சிலர் நபி (ஸல்) அவர்களிடம் வந்து அவர்களிடம் பேசிக்கொண்டிருந்தனர். அப்போது அவர்களில் ஒருவர் (மட்டும் முன்பே கைபர் செல்வதற்காக) வெளியேறினார். (அங்கு) அவர் கொல்லப்பட்டார். பிறகு அவருக்குப் பின்னால் மற்றவர்களும் புறப்பட்டுச் சென்றனர். அங்கு அவர்கள் தம் தோழர் இரத்த (வெள்ள)த்தில் மிதப்பதைக் கண்டனர். உடனே அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பிவந்து, “அல்லாஹ்வின் தூதரே! எங்களுடன் பேசிக்கொண்டிருந்த எங்கள் நண்பர் எங்களிடமிருந்து புறப்பட்டுச் சென்றார். நாங்கள் சென்று பார்த்தபோது அவர் இரத்த (வெள்ள)த்தில் மிதக்கிறார்” என்று கூறினர். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வெளியேறிச்சென்று, “இவரை யார் கொலை செய்திருப்பார் என்று நீங்கள் கருதுகின்றீர்கள்?” என்று கேட்டார்கள். மக்கள், “யூதர்கள்தான் இவரைக் கொலை செய்திருப்பார்கள் என்று நாங்கள் கருதுகிறோம்” என்று கூறினர். உடனே நபி (ஸல்) அவர்கள் யூதர்களை அழைத்து வரும்படி ஆளனுப்பினார்கள். (யூதர்கள் வந்ததும் அவர்களை நோக்கி) “நீங்களா இவரைக் கொலை செய்தீர்கள்?” என்று கேட்டார்கள். அவர்கள், “இல்லை” என்று பதிலளித்தார்கள். நபி (ஸல்) அவர்கள் (வாதிகளான அன்சாரிகளை நோக்கி) “யூதர்களில் ஐம்பதுபேர் ‘நாங்கள் அவரைக் கொலை செய்யவில்லை’ என்று சத்தியம் செய்வதை நீங்கள் விரும்புகின்றீர்களா?” என்று கேட்டார்கள். அதற்கு அவர்கள், “எங்கள் அனைவரையும் கொலை செய்துவிட்டு (தாங்கள் கொலை செய்யவில்லையென) சத்தியம் செய்யக்கூட யூதர்கள் தயங்கமாட்டார்கள்” என்று கூறினர். நபி (ஸல்) அவர்கள் (முஸ்லிம்களைப் பார்த்து), “உங்களில் ஐம்பதுபேர் (யூதர்களே கொலையாளிகள் என்று) சத்தியம் செய்வதன் மூலம் இழப்பீட்டுத் தொகைக்கு உரிமை பெறுகிறீர்களா?” என்று கேட்டார்கள். மக்கள், “நாங்கள் சத்தியம் செய்வதற்கு (தயாராக) இல்லை” என்று பதிலளித்தனர். ஆகவே, கொல்லப்பட்டவருக்காக நபி (ஸல்) அவர்களே தமது தரப்பிலிருந்து இழப்பீட்டுத் தொகை வழங்கினார்கள்.41 அறிவிப்பாளர் அபூகிலாபா (ரஹ்) அவர்கள் தொடர்ந்து கூறுகிறார்கள்: மேலும், நான் (பின்வருமாறும்) கூறினேன்: ஹுதைல் குலத்தார் அறியாமைக் காலத்தில் தாம் நட்புறவு ஒப்பந்தம் செய்திருந்த ஒருவனிடம் ஒப்பந்த முறிவுப் பிரகடனத்தை வெளியிட்டனர். ஆகவே, அந்த ஒப்பந்த முறிவுக்குள்ளானவன் (மக்காவிலுள்ள) ‘பத்ஹா’ எனுமிடத்திலிருந்த யமன் நாட்டைச் சேர்ந்த ஒரு குடும்பத்தை இரவு நேரத்தில் தாக்கிக் கொள்ளையடிக்க முற்பட்டான். அப்போது அவர்களில் ஒருவர் அவனைக் கண்டு விழித்துக்கொண்டு அவனை நோக்கி வாளை வீசி அவனைக் கொன்றுவிட்டார். உடனே ஹுதைல் குலத்தார் வந்து அந்த யமன்வாசியைப் பிடித்துக்கொண்டனர். பின்னர் ஹஜ் காலத்தில் அவரை (கலீஃபா) உமர் (ரலி) அவர்களிடம் கொண்டுவந்து நிறுத்தி, “இவர் எங்கள் (ஒப்பந்த) நண்பரைக் கொன்றுவிட்டார்” என்று கூறினர். அதற்கு அந்த யமன்வாசி, “(நான் திருடனைத்தான் கொலை செய்தேன்.) ஹுதைல் குலத்தார் அவனுடனான ஒப்பந்தத்தை முறித்துக்கொண்டுவிட்டனர்” என்று கூறினார். உடனே உமர் (ரலி) அவர்கள், “ஹுதைல் குலத்தாரில் ஐம்பதுபேர் ‘(நாங்கள்) அவருடனான ஒப்பந்தத்தை முறித்துக்கொள்ளவில்லை’ எனச் சத்தியம் செய்யட்டும்” என்றார்கள். ஆகவே, அவர்களில் நாற்பத்தொன்பது பேர், (நாங்கள் அந்த மனிதருடனான ஒப்பந்தத்தை முறிக்கவில்லை என்று பொய்ச்) சத்தியம் செய்தனர். அப்போது ஹுதைல் குலத்தாரில் ஒருவர் ஷாம் நாட்டிலிருந்து வந்தார். (ஐம்பதாவது நபராக) அவரையும் சத்தியம் செய்திடுமாறு ஹுதைல் குலத்தார் கோரினர். ஆனால், அவர் தமது சத்தியத்திற்குப் பதிலாக ஆயிரம் திர்ஹங்களை அவர்களிடம் வழங்கினார். (சத்தியம் செய்வதிலிருந்து விலகிக் கொண்டார்.) இதையடுத்து அவரது இடத்தில் மற்றொருவரை அவர்கள் சேர்த்துக் கொண்டதுடன், அந்த (ஐம்பதாவது) நபரைக் கொலையுண்டவரின் சகோதரரிடம் ஒப்படைத்தும்விட்டனர். அவரது கை இவரது கையுடன் பிணைக்கப்பட்டது. பின்னர் அவர்களிருவரும் சத்தியம் செய்த ஐம்பது (49) பேரும் புறப்பட்டார்கள். அவர்கள் (மக்காவிற்கு அருகிலுள்ள) ‘நக்லா’ எனுமிடத்தை அடைந்தபோது மழை பிடித்துக்கொண்டது. எனவே, அவர்கள் அங்கிருந்த ஒரு மலையின் குகைக்குள் நுழைந்துகொண்டார்கள். அப்போது அந்தக் குகை (பொய்ச் சத்தியம் செய்த) அந்த ஐம்பது பேர்மீது இடிந்து விழுந்து அவர்கள் அனைவரும் மாண்டுபோயினர். (கை கோத்துவிடப்பட்ட) அந்த இரு நண்பர்களும் தப்பித்துக்கொண்டனர். அப்போது அவர்களை ஒரு கல் தொடர்ந்து வந்து கொலையுண்டவருடைய சகோதரரின் காலை முறித்துவிட்டது. பிறகு அவர் ஓராண்டு காலம் வாழ்ந்து பிறகு மரணித்தார்.42 (தொடர்ந்து அபூகிலாபா (ரஹ்) அவர்கள் கூறுகிறார்கள்:) அப்துல் மலிக் பின் மர்வான் ‘அல்கசாமா’வைக் கொண்டு ஒருவரை பழிவாங்கிடுமாறு ஆணையிட்டார். பிறகு தமது செயல் குறித்து அவர் வருந்தினார். ஆகவே, சத்தியம் செய்த ஐம்பதுபேரின் பெயர்களை (படை வீரர்களின்) பெயர் பதிவேட்டிலிருந்து நீக்கியதுடன் அவர்களை ஷாம் நாட்டிற்கு நாடு கடத்தவும் செய்தார். அத்தியாயம் : 87",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 38
			}
		}
	]
}