{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6923,
			"arabicnumber": 6923,
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நான் ஒருமுறை நபி (ஸல்) அவர்களை நோக்கிச் சென்றேன். என்னுடன் (என்) அஷ்அரீ குலத்தைச் சேர்ந்த இருவரும் இருந்தனர். அவர்களில் ஒருவர் என் வலப் பக்கத்திலும் இன்னொருவர் என் இடப் பக்கத்திலும் இருந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பல் துலக்கிக்கொண்டிருந்தார்கள். (என்னுடன் வந்த) அவ்விருவரும் (நபி (ஸல்) அவர்களிடம் ஏதேனும் அரசாங்கப் பதவி அளிக்குமாறு கோரினர். அப்போது நபி (ஸல்) அவர்கள், ‘அபூமூசாவே’ அல்லது ‘அப்துல்லாஹ் பின் கைஸே!’ என்றார்கள். நான், “சத்திய (மார்க்க)த்துடன் தங்களை அனுப்பியவன் மீதாணையாக! இவர்கள் இருவரும் தமது மனத்தில் இருந்ததை என்னிடம் தெரிவிக்கவுமில்லை; இவர்கள் பதவி கேட்பார்கள் என்று எனக்குத் தெரியவும் செய்யாது” என்று சொன்னேன். அப்போது நபி (ஸல்) அவர்களின் இதழுக்குக் கீழ் துருத்திக்கொண்டிருந்த பல்துலக்கும் குச்சியினை இப்போதும் கூட நான் பார்ப்பதைப் போன்றுள்ளது. நபி (ஸல்) அவர்கள், “எவர் பதவியை விரும்புகிறாரோ அவருக்கு நாம் பதவி ‘கொடுப்பதில்லை’ அல்லது ‘ஒருபோதும் கொடுக்கமாட்டோம்’. ஆகவே, ‘அபூமூசாவே’ அல்லது ‘அப்துல்லாஹ் பின் கைஸே’ நீங்கள் யமன் நாட்டிற்கு (ஆளுனராக)ச் செல்லுங்கள்” என்று சொன்னார்கள். (அவ்வாறே அபூமூசா (ரலி) அவர்கள் யமன் நாட்டிற்குச் சென்றார்கள்.) பிறகு அபூமூசா அவர்களைப் பின்தொடர்ந்து முஆத் பின் ஜபல் (ரலி) அவர்களை (யமன் நாட்டுக்கு) நபியவர்கள் அனுப்பிவைத்தார்கள். முஆத் பின் ஜபல் (ரலி) அவர்கள் அபூமூசா (ரலி) அவர்களிடம் சென்றபோது (அவர்களைக் கண்ணியப்படுத்தும் விதமாக) அவர்களுக்கு தலையணை ஒன்றை அபூமூசா (ரலி) அவர்கள் எடுத்துவைத்து, “வாகனத்திலிருந்து இறங்குங்கள் (இதில் அமருங்கள்)” என்று சொன்னார்கள். அப்போது அபூமூசா (ரலி) அவர்களின் அருகில் ஒரு மனிதர் கட்டப்பட்டிருப்பதைக் கண்டு, “இவர் யார்?” என்று முஆத் (ரலி) அவர்கள் கேட்டார்கள். அபூமூசா (ரலி) அவர்கள், “இவர் யூதராயிருந்து இஸ்லாத்தைத் தழுவினார். அதற்குப் பிறகு (இஸ்லாத்தை விட்டுவெளியேறி) யூதராகிவிட்டார்” என்றார்கள். (மீண்டும் அபூமூசா (ரலி) அவர்கள் முஆத் (ரலி) அவர்களிடம்) “அமருங்கள்” என்று கூறினார்கள். அதற்கு முஆத் (ரலி) அவர்கள், “இல்லை. அல்லாஹ்வுடையவும் அவனுடைய தூதருடையவும் தீர்ப்புப்படி இவருக்கு மரண தண்டனை அளிக்கப்படாத வரை (நான் அமரமாட்டேன்)” என்று மூன்று முறை சொன்னார்கள். எனவே, அவருக்கு மரணதண்டனையளிக்குமாறு (அபூமூசா -ரலி) அவர்கள் உத்தரவிட அவ்வாறே அவர் கொல்லப்பட்டார். பிறகு அவர்கள் இருவரும் இரவில் நின்று வழிபடுவது குறித்துப் பேசிக் கொண்டனர். அப்போது அவர்களில் ஒருவர் (முஆத் (ரலி) அவர்கள்), “நான் (இரவில் சிறிது நேரம்) நின்று வழிபடுகிறேன். (சிறிது நேரம்) உறங்கு கிறேன். நின்று வழிபடுவதற்கு நான் பிரதிபலனை எதிர்பார்ப்பதைப் போன்றே என் உறக்கத்திற்கும் நான் பிரதிபலனை எதிர்பார்க்கிறேன்” என்று சொன்னார்கள்.9 அத்தியாயம் : 88",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 6
			}
		}
	]
}