{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "சஅத் பின் உபைதா (ரஹ்) அவர்கள் கூறியதாவது: (உஸ்மான் (ரலி) அவர்களுடைய ஆதரவாளர்களில் ஒருவரான) அபூஅப்திர் ரஹ்மான் அவர்கள் (அலீ (ரலி) அவர்களின் ஆதரவாளர்களில் ஒருவரான) ஹிப்பான் பின் அத்திய்யா அவர்களிடம் சர்ச்சையிட்டுக்கொண்டு, “உங்கள் தோழர் அலீ அவர்களுக்கு இரத்தம் சிந்தச்செய்யும் துணிவைக் கொடுத்தது எது என்று நான் உறுதிபட அறிவேன்” என்று கூறினார்கள். ஹிப்பான் அவர்கள், “தந்தையற்றுப் போவாய்! (அலீ அவர்களுக்குத் துணிவைத் தந்த) அந்த விஷயம் எது?” என்று கேட்டார்கள். அபூஅப்திர் ரஹ்மான் அவர்கள், “அது ஒரு சம்பவம். அதை அலீ (ரலி) அவர்களே கூற நான் கேட்டுள்ளேன்” என்று சொன்னார்கள். ஹிப்பான் அவர்கள், “என்ன சம்பவம் அது?” என்று கேட்க, (பின்வருமாறு) அபூஅப்திர் ரஹ்மான் அவர்கள் கூறினார்கள்: (அலீ (ரலி) அவர்கள் கூறினார்கள்:) குதிரை வீரர்களான என்னையும் ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களையும் அபூமர்ஸத் (ரலி) அவர்களையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “நீங்கள் ‘ரவ்ளத்து ஹாஜ்’ எனும் இடம்வரை செல்லுங்கள். -இவ்வாறு ‘ஹாஜ்’ என்றே அபூஅவானா (ரஹ்) அவர்கள் கூறினார்கள் என அபூசலமா கூறுகிறார்கள். (மற்ற அறிவிப்புகளில் ‘ரவ்ளத்து காக்’ என வந்துள்ளது)- அங்கு ஒரு பெண் இருப்பாள். அவளிடம் ஹாத்திப் பின் அபீபல்த்தஆ (மக்காவிலிருக்கும்) இணைவைப்பாளர்களுக்கு எழுதிய (நமது இரகசிய திட்டங்களைத் தெரிவிக்கும்) கடிதம் ஒன்றிருக்கும். அதை (அவளிடமிருந்து கைப்பற்றி) என்னிடம் கொண்டுவாருங்கள்” என்று கூறி அனுப்பினார்கள். உடனே நாங்கள் எங்கள் குதிரைகளின் மீதேறிச் சென்றோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் குறிப்பிட்ட அந்த இடத்தில் தனது ஒட்டகம் ஒன்றின் மீது அவள் செல்வதைக் கண்டோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்காவை வெற்றி கொள்வதற்காக) மக்காவாசிகளை நோக்கிப் புறப்படவிருப்பது தொடர்பாக ஹாத்திப் பின் அபீபல்த்தஆ (அக்கடிதத்தில்) மக்காவாசிகளுக்கு எழுதியிருந்தார். நாங்கள் (அவளிடம்), “உன்னிடம் உள்ள அந்தக் கடிதம் எங்கே?” என்று கேட்டோம். அவள், “என்னிடம் கடிதம் எதுவுமில்லை” என்று சொன்னாள். உடனே நாங்கள் அவள் அமர்ந்திருந்த அந்த ஒட்டகத்தை மண்டியிடச் செய்து அவளிருந்த சிவிகைக்குள் (கடிதத்தைத்) தேடினோம். (அதில்) எதுவும் கிடைக்கவில்லை. அப்போது என் சகாக்கள் இருவரும் “இவளிடம் எந்தக் கடிதத்தையும் நம்மால் காண முடியவில்லையே” என்று சொன்னார்கள். நான், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பொய் சொல்ல மாட்டார்கள் என்று திட்டவட்டமாக நாம் அறிந்துள்ளோம்” என்று கூறிவிட்டு, சத்தியம் செய்வதற்கு தகுதிபெற்ற (இறை)வன்மீது ஆணையிட்டு, “ஒன்று நீயாக அதை வெளியே எடுக்க வேண்டும். அல்லது நான் உன்னை (சோதனை யிடுவதற்காக உனது ஆடையைக்) கழற்ற வேண்டியிருக்கும்” என்று சொன்னேன். இதைக் கேட்ட அவள் தனது இடுப்பை நோக்கி(த் தனது கையை)க் கொண்டுசென்றாள். அவள் (இடுப்பில்) ஒரு துணி கட்டியிருந்தாள். (அதற்குள் ளேயிருந்து) அந்தக் கடிதத்தை வெளியே எடுத்தாள். அந்தக் கடிதத்தை நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவந்தோம். (பிறகு அதை நான் நபி (ஸல்) அவர்களுக்குப் படித்துக் காட்டி னேன்.) அப்போது உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் தூதரே! ஹாத்திப் பின் அபீபல்த்தஆ அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் இறைநம்பிக்கையாளர்களுக்கும் துரோகமிழைத்துவிட்டார். என்னை விடுங்கள்; அவரது கழுத்தைக் கொய்துவிடுகிறேன்” என்றார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “ஹாத்திபே! ஏன் இப்படிச் செய்தீர்கள்?” என்று கேட்டார்கள். ஹாத்திப் பின் அபீபல்த்தஆ, “அல்லாஹ்வின் தூதரே! அல்லாஹ்வையும் அவனுடைய தூதரையும் நம்பிக்கை கொள்ளாமலிருக்க எனக்கு என்ன நேர்ந்துவிட்டது? (நான் இறைநம்பிக்கையைக் கைவிட்டுவிடவில்லை.) மாறாக, மக்காவாசிகளுக்கு நான் உபகாரம் ஏதேனும் செய்து அதற்குப் பிரதியுபகாரமாக அவர்கள் (அங்குள்ள பலவீனமான) என் உறவினர்களையும் என் செல்வங்களையும் காப்பாற்ற வேண்டுமென்று விரும்பினேன்; தங்களுடைய (முஹாஜிர்) தோழர்கள் அனைவருக்குமே அவர்களுடைய குடும்பத்தாரையும் செல்வத்தையும் எவர் மூலமாக அல்லாஹ் பாதுகாப்பானோ அத்தகைய உறவினர்கள் அங்கு உள்ளனர்” என்று கூறினார். நபி (ஸல்) அவர்கள், “இவர் உண்மை பேசினார். இவர் குறித்து நல்லதையே சொல்லுங்கள்” என்று கூறினார்கள். உமர் (ரலி) அவர்கள் மீண்டும் “அல்லாஹ்வின் தூதரே! இவர் அல்லாஹ்வுக்கும் அவனு டைய தூதருக்கும் இறைநம்பிக்கை யாளர்களுக்கும் துரோகமிழைத்து விட்டார். என்னை விடுங்கள்; இவரது கழுத்தைக் கொய்துவிடுகிறேன்” என்று சொன்னார்கள். நபி (ஸல்) அவர்கள், “இவர் பத்ர் போரில் கலந்துகொண்டவர் இல்லையா? உங்களுக்கு என்ன தெரியும்? ஒருவேளை அல்லாஹ் பத்ர் போரில் கலந்துகொண்டவர்களிடம் ‘நீங்கள் விரும்பியதைச் செய்துகொள்ளுங்கள். சொர்க்கத்தை உங்களுக்கு நான் உறுதி யாக்கிவிட்டேன்’ என்று கூறிவிட்டிருக்க லாம்” என்று சொன்னார்கள். இதைக் கேட்ட உமர் (ரலி) அவர்களின் கண்கள் கண்ணீரில் மூழ்கின. அப்போது உமர் (ரலி) அவர்கள், “அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்” என்று சொன்னார்கள்.26 அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன்: (அந்த இடத்தின் பெயர்) ‘ரவ்ளத்து காக்’ என்பதே சரியான தகவலாகும். ஆயினும், ‘ரவ்ளத்து ஹாஜ்’ என்றே அபூஅவானா கூறுகிறார். இது திரிபாகும். இது ஓர் இடத்தின் பெயராகும். ஹுஷைம் பின் பஷீர் (ரஹ்) அவர்கள் ‘காக்’ என்றே குறிப்பிடுகிறார்கள். அத்தியாயம் : 88",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}