{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு இனிப்பும் தேனும் விருப்ப மானவையாக இருந்தன. நபி (ஸல்) அவர்கள் அஸ்ர் தொழுகையை முடித்ததும் தம் துணைவியரிடம் வந்து பகல்பொழுதைக் கழிப்பார்கள்; அவர் களுடன் நெருக்கமாக இருப்பார்கள். இவ்வாறு (ஒருநாள்) ஹஃப்ஸா (ரலி) அவர்களிடம் சென்ற நபியவர்கள் வழக்கத்திற்கு மாறாக அதிக நேரம் இருந்துவிட்டார்கள். அது குறித்து நான் விசாரித்தேன். அப்போது ஹஃப்ஸாவின் குடும்பத்தைச் சேர்ந்த ஒரு பெண் அவருக்கு (தாயிஃப் நகர சுத்த)த் தேன் உள்ள ஒரு தோல் பையை அன்பளிப்பாக வழங்கினாள் என்றும், அதிலிருந்து தயாரித்த பானத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு ஹஃப்ஸா புகட்டினார் என்றும் என்னிடம் கூறப்பட்டது. உடனே நான் “அல்லாஹ்வின் மீதாணையாக! இதை நிறுத்துவதற்காக இதோ ஒரு தந்திரம் செய்வோம்” என்று கூறிக்கொண்டு, (நபியவர்களின் துணைவியரில் ஒருவரான) சவ்தா (ரலி) அவர்களிடம் அதைப் பற்றிக் கூறி, “நபி (ஸல்) அவர்கள் உங்களிடம் வரும்போது உங்களை நெருங்குவார்கள். அப்போது, அல்லாஹ்வின் தூதரே! கருவேலம் பிசின் சாப்பிட்டீர்களா? என்று கேளுங்கள். ‘இல்லை’ என்று நபியவர்கள் கூறுவார்கள். உடனே இது என்ன வாடை? என்று அவர்களிடம் கேளுங்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்மிடமிருந்து (துர்) வாடை வீசுவதைக் கடுமையாகக் கருதுவார்கள். ஆதலால், ‘எனக்கு ஹஃப்ஸா தேன் பானம் புகட்டினார்’ என்று கூறுவார்கள். உடனே நீங்கள் ‘இதன் தேனீக்கள் கருவேல மரத்தில் அமர்ந்து (தேனை உறிஞ்சி)விட்டு வந்திருக்கலாம். (ஆகவேதான், வாடை வருகிறது)’ என்று சொல்லுங்கள். நானும் இவ்வாறே சொல்வேன். ஸஃபிய்யாவே! நீங்களும் இவ்வாறே சொல்லுங்கள் என்று (மற்றொரு துணைவியாரான ஸஃபிய்யாவிடமும்) சொன்னேன். நபி (ஸல்) அவர்கள் சவ்தா (ரலி) அவர்களிடம் சென்றபோது (நான் சொன்னபடி செய்துவிட்டு) சவ்தா (என்னிடம்) கூறினார்கள்: எவனைத் தவிர வேறு இறைவனில்லையோ அவன் மீதாணையாக! நபி (ஸல்) அவர்கள் என் வீட்டுவாசலில் இருந்தபோது உங்களுக்குப் பயந்து நீங்கள் என்னிடம் சொன்னபடி நபியவர்களிடம் சொல்ல விரைந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னை) நெருங்கியதும் அவர்களிடம், “அல்லாஹ்வின் தூதரே! தாங்கள் கருவேலம் பிசினைச் சாப்பிட்டீர் களா?” என்று கேட்டேன். அவர்கள் “இல்லை” என்று பதிலளித்தார்கள். “அப்படியானால், இது என்ன வாடை?” என்று கேட்டேன். நபி (ஸல்) அவர்கள், “ஹஃப்ஸா எனக்குத் தேன் பானம் புகட்டினார்” என்று சொன்னார்கள். நான், “அதன் தேனீக்கள் கருவேல மரத்தில் அமர்ந்து (தேன் உறிஞ்சி)விட்டு வந்திருக்கலாம் (ஆகவேதான், தேனில் வாடை ஏற்பட்டுவிட்டதுபோலும்)” என்று சொன்னேன். (தொடர்ந்து ஆயிஷா (ரலி) அவர்கள் கூறுகிறார்கள்:) என்னிடம் நபி (ஸல்) அவர்கள் வந்தபோது அதைப் போன்றே நானும் சொன்னேன். ஸஃபிய்யாவிடம் நபி (ஸல்) அவர்கள் சென்றபோது அவரும் அதைப் போன்றே தெரிவித்தார். பிறகு (மறுநாள்) நபி (ஸல்) அவர்கள் ஹஃப்ஸாவிடம் சென்றபோது நபியவர்களிடம் அவர், “அல்லாஹ்வின் தூதரே! அருந்துவதற்குத் தங்களுக்குச் சிறிதளவு தேன் தரட்டுமா?” என்று கேட்டார். நபி (ஸல்) அவர்கள், “அது எனக்குத் தேவையில்லை” என்று கூறினார்கள். (இது குறித்து) சவ்தா (ரலி) அவர்கள், “அல்லாஹ் தூயவன்! நபி (ஸல்) அவர் களை, அதை அருந்தவிடாமல் நாம் தடுத்துவிட்டோமே!” என்று (வருத்தத்து டன்) கூறுவார்கள். நான் அவரிடம், “சும்மா இருங்கள்! (விஷயம் பரவிவிடப் போகிறது)” என்று சொல்வேன்.26 அத்தியாயம் : 90",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		}
	]
}