{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6980,
			"arabicnumber": 6980,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: அண்மையில் இருப்பதால் அண்டை வீட்டாரே அதிக உரிமை படைத்தவராவார். இதை அபூராஃபிஉ (ரலி) அவர்கள் அறிவிக்கிறார்கள். சிலர் கூறுகின்றனர்: ஒருவர் ஒரு வீட்டை இருபதாயிரம் வெள்ளிக் காசுகள் கொடுத்து வாங்க விரும்பினார். அவர் (அண்டை வீட்டாருக்குரிய விலைக்கோள் உரிமையைச் செயóழக்கச் செய்யப் பின்வருமாறு) தந்திரம் செய்வதில் தவறில்லை. அதாவது இருபதாயிரம் வெள்ளிக் காசுகள் விலைபேசி வீட்டை அவர் வாங்கிக் கொள்வார். ஆனால், விற்றவரிடம் 9,999 வெள்ளிக் காசுகளையும், இருபதாயிரத்தில் மீதியுள்ள (10,001) வெள்ளிக் காசுகளுக்குப் பதிலாக ஒரு பொற்காசையும் அவர் ரொக்கமாகச் செலுத்துவார். இந்நிலையில், விலைக்கோள் உரிமை கோருபவர் தமது உரிமையைக் கோரினால், (பேசப்பட்டுவிட்ட) இருபதாயிரம் வெள்ளிக்காசுகளைக் கொடுத்து வீட்டை எடுத்துக்கொள்ளலாம். இல்லையேல், அந்த வீட்டின் மீது அவருக்கு எந்த அதிகாரமும் கிடையாது. மேலும், இந்த நிலையில், அது வேறொருவருக்குச் சொந்தமான வீடு என்று தெரியவந்தால், விலைக்கு வாங்கியவர் விற்றவரிடம் செலுத்திய தொகையை மட்டுமே திரும்பப் பெறுவார். அது 9,999 வெள்ளிக் காசுகளும் ஒரு பொற்காசுமாகும். ஏனெனில், விற்கப்பட்ட பொருள் வேறொருவருக்குச் சொந்தமானது என்று தெரியவரும்போது, ஏற்கெனவே விற்றவரும் வாங்கியவரும் செய்துகொண்ட (10,001 வெள்ளிக்காசுகளுக்குப் பதிலாக) ஒரு பொற்காசு என்ற நாணயமாற்று ஒப்பந்தம் முறிந்துவிடும். அதே நேரத்தில், விலைக்கு வாங்கியவர் அந்த வீட்டில் குறைபாடு உள்ளதைக் கண்டார்; ஆனால், வீடு மற்றவருக்குச் சொந்தமானது என உரிமை கோரப்படவில்லை. அப்போது, இருபதாயிரம் வெள்ளிக்காசுகளைப் பெற்றுக்கொண்டு வீட்டை உரியவரிடம் திருப்பிக் கொடுத்துவிடுவார். (இது முன்னுக்குப்பின் முரணாகும். ஏனெனில், இவர் செலுத்தியதோ 9,999 வெள்ளிக் காசுகளும் ஒரேயொரு பொற்காசும்தான். திரும்பப் பெறுவதோ இருபதாயிரம் வெள்ளிக்காசுகள்.) அபூஅப்தில்லாஹ் (புகாரீ) கூறுகிறேன்: இவ்வாறு கூறும் இவர்கள் முஸ்லிம்களிடையே மோசடி நடைபெறுவதை அனுமதிக்கின்றனர். ஆனால், நபி (ஸல்) அவர்களோ, “முஸ்லிமின் வியாபாரத்தில் எந்தக் குறையோ, தீங்கோ, மோசடியோ இராது” என்று கூறினார்கள்.34 அத்தியாயம் : 90",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 27
			}
		}
	]
}