{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7121,
			"arabicnumber": 7121,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இரு பெரும் குழுக்களிடையே பெரும் போர் ஏற்பட்டு அவை ஒன்றோ டொன்று சண்டையிட்டுக்கொள்ளாத வரை மறுமை நாள் வராது. அவ்விரு குழுக்கள் முன்வைக்கும் வாதமும் ஒன்றாகவே இருக்கும்.51 மேலும், ஏறத்தாழ முப்பது பெரும் பொய்யர்களான தஜ்ஜால்கள் (உலகில்) தோன்றாத வரை மறுமை நாள் வராது. அவர்களில் ஒவ்வொருவனும் தன்னை இறைத்தூதர் என்று வாதிடுவான்.52 மேலும், (கல்வியாளர்களின் மறைவால்) கல்வி கைப்பற்றப்பட்டு, நிலநடுக்கங்கள் அதிகமாகி, காலம் சுருங்கி, குழப்பங்கள் தோன்றி, கொலை பெருகாதவரை மறுமை நாள் வராது..53 மேலும், உங்களிடையே செல்வம் பெருகிக் கொழிக்காத வரை மறுமை நாள் வராது. அப்போது செல்வன் தனது தர்மத்தை ஏற்பவர் யாரேனும் கிடைக்கமாட்டாரா என்று கவலைப்படுவான். அவன் அதை எடுத்து ஒருவருக்குக் கொடுக்க முனையும்போது, இது தமக்குத் தேவையில்லை என்று அவர் சொல்லிவிடுவார்..54 மேலும், மக்கள் கட்டடங்களை (போட்டி போட்டுக்கொண்டு) உயரமாகக் கட்டாத வரை மறுமை நாள் வராது. மேலும், ஒரு மனிதன் மற்றொரு மனிதனின் மண்ணறையைக் கடந்துசெல்லும்போது, ‘அந்தோ! நான் இவனுடைய இடத்தில் (மண்ணறைக்குள்) இருக்கக் கூடாதா?’ என்று (ஏக்கத்துடன்) கூறாத வரை மறுமை நாள் வராது..55 சூரியன் மேற்குத் திசையிலிருந்து உதயமாகாத வரை மறுமை நாள் வராது. அவ்வாறு உதயமாகும்போது அதைக் காணும் மக்கள் அனைவரும் இறைநம்பிக்கை கொள்வார்கள். ஆனால், அதற்கு முன்பே இறை நம்பிக்கை கொள்ளாத, அல்லது இறை நம்பிக்கை கொண்டும் (அதை மெய்ப்பிக்கும் வகையில்) நற்செயல் எதுவும் புரியாத எந்த மனிதனும் அப்போது நம்பிக்கை கொள்வது அவனுக்குப் பயனளிக்காத நேரமாக அது இருக்கும்.56 இரண்டு பேர் தங்களுக்கு முன்னே தங்கள் துணிகளை (வியாபாரத்திற்காக) விரித்துவைப்பார்கள். அந்தத் துணியை வியாபாரம் செய்திருக்கவுமாட்டார்கள்; அதைச் சுருட்டி வைத்திருக்கவுமாட்டார்கள்; அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது ஒட்டகத்தின் பாலைக் (கறந்து எடுத்துக்)கொண்டு அப்போதுதான் திரும்பியிருப்பார்; அதை அவர் அருந்தியிருக்கவுமாட்டார். அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது தடாகத்தை அப்போதுதான் செப்பனிட்டிருப்பார்; அதிலிருந்து அவர் (தம் கால்நடைகளுக்கு) நீர் புகட்டியிருக்கவுமாட்டார். அதற்குள் மறுமை நாள் வந்துவிடும். ஒருவர் தமது உணவைத் தம் வாயருகே கொண்டுசென்றிருப்பார்; ஆனால், இன்னும் அதை உண்டிருக்கமாட்டார்; அதற்குள் மறுமை நாள் வந்துவிடும். (அந்த அளவுக்குத் திடீரென உலக அழிவுநாள் ஏற்படும்.) இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 92",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 68
			}
		}
	]
}