{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7191,
			"arabicnumber": 7191,
			"text": "(வேதஅறிவிப்பை எழுதி யோரில் ஒருவரான) ஸைத் பின் ஸாபித் (ரலி) அவர்கள் கூறியதாவது: யமாமா (போரில்) வீரர்கள் கொல்லப் பட்டபோது அபூபக்ர் (ரலி) அவர்கள் (என்னை அழைத்து வரும்படி) ஆள னுப்பினார்கள். (நான் சென்றேன்.) அங்கே அவர்களுடன் உமர் (ரலி) அவர்களும் இருந்தார்கள். அப்போது அபூபக்ர் (ரலி) அவர்கள் கூறினார்கள்: உமர் (ரலி) அவர்கள் என்னிடம் வந்து, இந்த யமாமா போர், குர்ஆன் அறிஞர்கள் பலரைப் பலிகொண்டு விட்டது. (இறைமறுப்பாளர்களுடன் போர் நடக்கும்) எல்லா இடங்களிலும் குர்ஆன் அறிஞர்கள் பலர் கொல்லப்பட்டு, அதனால் குர்ஆனில் பெரும்பகுதி (அந்த நெஞ்சங்களுடன் அழிந்து) போய்விடுமோ என்று நான் அஞ்சுகின்றேன். ஆகவே, (கலீஃபாவான) நீங்கள் குர்ஆனைத் திரட்டுமாறு ஆணையிட வேண்டுமென நான் கருதுகின்றேன்” என்று கூறினார்கள். அதற்கு நான், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நான் எப்படிச் செய்ய முடியும்?” என்று (உமர் (ரலி) அவர்களிடம்) கேட்டேன். அதற்கு உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! இது நன்மை(யான பணி)தான்” என்று கூறினார்கள். இது விஷயமாக தொடர்ந்து உமர் (ரலி) அவர்கள் என்னிடம் வலியுறுத்திக்கொண்டேயிருந்தார்கள். முடிவில், உமர் (ரலி) அவர்களின் மனதை அல்லாஹ் எதற்காக விரிவாக்கினானோ அதற்காக என் மனத்தையும் அவன் விரிவாக்கினான்; இந்த விஷயத்தில் உமர் (ரலி) அவர்கள் கருதியதையே நானும் (உசிதமானதாகக்) கண்டேன். பிறகு அபூபக்ர் (ரலி) அவர்கள் (என்னிடம்), “நீங்கள் புத்திசாலியான இளைஞர்; உங்களை நாங்கள் (எந்த விதத்திலும்) சந்தேகப்பட்டதில்லை. நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக வஹீ (வேதஅறி விப்பை) எழுதக்கூடியவராயிருந்தீர்கள். எனவே, (தனித்தனி பிரதிகளில் பல் வேறு நபித்தோழர்களிடம் இருக்கும்) குர்ஆன் வசனங்களைத் தேடி (ஒரே பிரதியில்) ஒன்றுதிரட்டுங்கள்” என்று சொன்னார்கள். அல்லாஹ்வின் மீதாணையாக! மலை களில் ஒன்றை நகர்த்த வேண்டுமென என்னை அவர்கள் பணித்திருந்தாலும்கூட அது எனக்குப் பளுவாக இருந்திருக்காது. குர்ஆனை ஒன்றுதிரட்டுமாறு எனக்கு அவர்கள் கட்டளையிட்டது அதைவிட எனக்குப் பளுவாக இருந்தது. நான், “அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்யாத ஒன்றை நீங்கள் இருவரும் எப்படிச் செய்யப்போகிறீர்கள்?” என்று கேட்டேன். அதற்கு அபூபக்ர் (ரலி) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! இது நன்மை(யான பணி)தான்” என்று சொன்னார்கள். இதையே என்னிடம் அன்னார் தொடர்ந்து வலியுறுத்திக்கொண்டிருந்தார்கள். முடிவில் எதற்காக அபூபக்ர் மற்றும் உமர் (ரலி) ஆகியோரின் மனத்தை அல்லாஹ் விரிவாக்கினானோ அதற்காக என் மனத்தையும் அல்லாஹ் விரிவாக்கினான். அவர்கள் இருவரும் கருதியதையே நானும் (உசிதமானதாகக்) கருதினேன். ஆகவே, நான் (மக்களின் கரங்களிலிருந்த) குர்ஆன் (சுவடிகளைத்) தேடினேன். அகலமான பேரீச்சமட்டைகள், துண்டுத் தோல்கள், ஓடுகள் மற்றும் (குர்ஆனை மனனம் செய்திருந்த) மனிதர்களின் நெஞ்சங்கள் ஆகியவற்றிலிருந்து குர்ஆன் வசனங்களைத் திரட்டினேன். அப்போது நான் ‘அத்தவ்பா’ எனும் (9ஆவது) அத்தியாயத்தின் இறுதி வசனத்தை ‘குஸைமா’ (ரலி) அவர்களிடம் அல்லது ‘அபூகுஸைமா’ (ரலி) அவர்களிடம் இருக்கக் கண்டேன். அதை நான் அதற்குரிய அத்தியாயத்தில் சேர்த்தேன். “உங்களிலிருந்தே ஒரு தூதர் உங்களிடம் வந்திருக்கிறார்” என்று தொடங்கும் (9:128ஆவது) வசனமே அந்த வசனமாகும். (என் வாயிலாகத் திரட்டித் தொகுக் கப்பெற்ற) குர்ஆன் பிரதிகள் (கலீஃபா) அபூபக்ர் (ரலி) அவர்களிடம், அவர் களை அல்லாஹ் இறக்கச்செய்யும் வரை அவர்களது வாழ்நாள் முழுக்க இருந்துவந்தது. பிறகு (கலீஃபா) உமர் (ரலி) அவர்களிடம் அவர்களை அல்லாஹ் இறக்கச் செய்யும்வரை அவர்களது வாழ்நாள் முழுக்க இருந்துவந்தது. பிறகு (நபிகளாரின் துணைவியாரான) ஹஃப்ஸா பின்த் உமர் (ரலி) அவர்களிடம் இருந்துவந்தது. முஹம்மத் பின் உபைதில்லாஹ் (ரஹ்) அவர்கள், “(இந்த ஹதீஸின் மூலத்திலுள்ள) ‘லிகாஃப்’ எனும் சொல்லுக்கு ‘ஓடு’ என்று பொருள்” எனக் கூறினார்கள்.58 அத்தியாயம் : 93",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 53
			}
		}
	]
}