{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": 7207,
			"text": "மிஸ்வர் பின் மக்ரமா (ரலி) அவர்கள் கூறியதாவது: உமர் (ரலி) அவர்கள் (தமக்குப்பின் ஆட்சித் தலைவரைத் தேர்ந்தெடுத்திடும்) பொறுப்பை ஒப்படைத்திருந்த (ஆறு பேர் கொண்ட) குழுவினர் ஒன்றுகூடி தமக்குள் கலந்தாலோசித்தனர்.68 அவர்களிடம் (அக்குழுவில் இடம்பெற்றிருந்த) அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள், “நான் இந்த ஆட்சியதிகாரத் திற்காக உங்களுடன் போட்டியிடக் கூடியவன் அல்லன். ஆயினும், நீங்கள் விரும்பினால் உங்களிலிருந்தே ஒருவரை நான் உங்களுக்கு (ஆட்சித் தலைவராக)த் தேர்ந்தெடுக்கின்றேன்” என்று சொன்னார்கள். ஆகவே, குழுவினர் அந்தப் பணியை அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களிடம் ஒப்படைத்தார்கள். இவ்வாறு அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் வசம் தங்கள் விவகாரத்தை அவர்கள் ஒப்படைத்துவிட்டபோது, மக்கள் அப்துர் ரஹ்மான் (ரலி) அவர்களையே மொய்க்கத் தொடங்கிவிட்டனர். எந்த அளவுக்கென்றால், மக்களில் எவருமே அக்குழுவினரைப் பின்தொடர்ந்ததாகவோ அவர்கள் பின்னே சென்றதாகவோ நான் காணவில்லை. அந்த நாட்களில் அவரிடம் மட்டுமே மக்கள் ஆலோசனை கலந்தபடி அவரையே சுற்றிவரத் தொடங்கி விட்டனர். எந்த நாள் காலையில் நாங்கள் உஸ்மான் (ரலி) அவர்களுக்கு விசுவாசப் பிரமாணம் (பைஅத்) செய்து அளித்தோமோ அன்றைய இரவு சிறிது நேரம் தூங்கியபிறகு அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் வந்து திடீரென என் வீட்டுக் கதவைத் தட்டினார்கள். நான் விழித்துக்கொண்டேன். என்னிடம் அவர்கள், “நீங்களோ உறங்குகிறீர்கள். அல்லாஹ்வின் மீதாணையாக! இன்றிரவு என்னைப் பெரிய அளவில் தூக்கம் தழுவவில்லை. நீங்கள் போய் ஸுபைர் பின் அல்அவ்வாமையும் சஅத் பின் அபீவக்காஸையும் அழைத்து வாருங்கள்” என்று சொல்ல, நான் போய் அவர்களை அப்துர் ரஹ்மான் அவர்களிடம் அழைத்துவந்தேன். பிறகு அவ்விருவருடன் கலந்தாலோசித்து விட்டு என்னை அழைத்து, “அலீ (ரலி) அவர்களை என்னிடம் அழைத்துவருக” என்று சொன்னார்கள். அவ்வாறே நான் அலீ (ரலி) அவர்களை அழைத்துவர, அவர்களிடம் நடுநிசிவரை ஆலோசனை செய்தார்கள். பிறகு அலீ (ரலி) அவர்கள் (ஆட்சிப் பொறுப்பேற்க) ஆவல் கொண்டவர்களாக அப்துர் ரஹ்மான் (ரலி) அவர்களிடமிருந்து எழுந்தார்கள். அலீ (ரலி) அவர்களிடமிருந்து ஏதேனும் பிரச்சினை வருமோ என அப்துர் ரஹ்மான் அஞ்சியிருந்தார்கள். பிறகு, “உஸ்மான் (ரலி) அவர்களை என்னிடம் அழைத்துவருக” என்று சொன்னார்கள். நானும் அவ்வாறே உஸ்மான் (ரலி) அவர்களை அழைத்து வர, அவர்களிடமும் ஆலோசனை செய்தார்கள். இறுதியில், சுப்ஹ் தொழுகைக்கு பாங்கு சொன்னவர் சொல்ல அவ்விருவரும் கலைந்தனர். அப்துர் ரஹ்மான் (ரலி) அவர்கள் மக்களுக்கு சுப்ஹ் தொழுவித்துவிட்டபின் அந்த ஆலோசனைக் குழுவினர் சொற்பொழிவு மேடை (மிம்பர்) அருகே ஒன்றுகூடினார்கள். பின்னர் முஹாஜிர்கள் மற்றும் அன்சாரிகளில் அங்கு வந்திருந்தவர்களிடமும் மாகாணங்களின் ஆளுநர்களிடமும் ஆளனுப்பினார்கள். அந்த ஆளுநர்கள் (மக்கா வந்து) அந்த ஹஜ்ஜில் உமர் (ரலி) அவர்களுடன் கலந்துகொண்டிருந்(துவிட்டு மதீனா வந்திருந்)தனர்.69 அவர்கள் ஒன்று கூடியபோது அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் ஓரிறை உறுதிமொழியைக் கூறிவிட்டுப் பிறகு, “இறைவாழ்த்துக்குப்பின் கூறுகிறேன்: அலீ (ரலி) அவர்களே! நான் மக்களின் கருத்தை ஆராய்ந்து பார்த்தேன். அவர்கள் உஸ்மானுக்குச் சமமாக எவரையும் கருதுவதாக எனக்குத் தெரியவில்லை. ஆகவே, உங்கள் உள்ளத்தில் (என்மீது) வருத்தம் ஏதும் கொள்ள வேண்டாம்” என்று கூறினார்கள். பிறகு (உஸ்மான் (ரலி) அவர்களை நோக்கி), “அல்லாஹ் வகுத்த வழிமுறைப் படியும் அவனுடைய தூதரின் நடைமுறைப்படியும் அவர்களுக்குப் பின்னுள்ள கலீஃபாக்கள் இருவரின் நடைமுறைகளின்படியும் உங்களுக்கு உறுதிமொழி அளிக்கிறேன்” என்று கூறினார்கள். இப்படி அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் விசுவாசப் பிரமாணம் செய்ய முஹாஜிர்கள், அன்சாரிகள், மாகாண ஆளுநர்கள், முஸ்லிம்கள் என்று மக்கள் அனைவரும் (உஸ்மான் (ரலி) அவர்களுக்கு) விசுவாசப் பிரமாணம் செய்தனர்.70 அத்தியாயம் : 93",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 67
			}
		}
	]
}