{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7304,
			"arabicnumber": 7304,
			"text": "சஹ்ல் பின் சஅத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: ‘அஜ்லான்’ குலத்தைச் சேர்ந்த உவைமிர் (ரலி) அவர்கள், ஆஸிம் பின் அதீ (ரலி) அவர்களிடம் வந்து, “ஒரு மனிதன் தன் மனைவியுடன் வேறொரு (அந்நிய) ஆடவன் (தகாத உறவு கொண்ட நிலையில்) இருக்கக் கண்டால் அவனை இவன் கொன்றுவிடலாமா? (அவ்வாறு கொன்றுவிட்டால் பழிவாங்கும் சட்டப்படி) அவனை நீங்கள் கொன்றுவிடுவீர்களா? எனக்காக (இதைப் பற்றி) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கேளுங்கள், ஆஸிமே!” என்றார். அவ்வாறே ஆஸிம் (ரலி) அவர்களும் நபியவர்களிடம் கேட்டார்கள். நபி (ஸல்) அவர்கள் (இத்தகைய) கேள்விகளை விரும்பவில்லை. அவற்றை அநாகரிகமாகக் கருதினார்கள். ஆகவே, ஆஸிம் (ரலி) அவர்கள் திரும்பிவந்து உவைமிர் (ரலி) அவர்களிடம், “நபி (ஸல்) அவர்கள் (இத்தகைய) கேள்விகளை விரும்பவில்லை” என்று தெரிவித்தார்கள். அதற்கு உவைமிர் (ரலி) அவர்கள், “அல்லாஹ்வின் மீது சத்தியமாக! நான் நபி (ஸல்) அவர்களிடம் (இதைப் பற்றி நேரடியாகக் கேட்பதற்காகச்) செல்வேன்” என்று கூறிவிட்டு நபி (ஸல்) அவர்களிடம் வந்தார். ஆஸிம் (ரலி) அவர்கள் வந்துவிட்டுச் சென்றபின் உயர்ந்தோன் அல்லாஹ் குர்ஆன் வசனத்தை அருளியிருந்தான். ஆகவே, (தம்மிடம் வந்த) உவைமிர் (ரலி) அவர்களிடம் நபி (ஸல்) அவர்கள், “உங்கள் விஷயத்தில் அல்லாஹ் குர்ஆன் (வசனத்தை) அருளிவிட்டான்” என்று கூறி, தம்பதியர் இருவரையும் அழைத்தார்கள். அவர்கள் இருவரும் வந்து பரஸ்பரம் சாபஅழைப்புப் பிரமாணம் (லிஆன்) செய்தார்கள். பிறகு உவைமிர் (ரலி) அவர்கள், “(இதற்குப் பிறகும்) அவளை நான் என்னுடனேயே வைத்துக்கொண்டிருந்தால் நான் பொய் சொன்னதாக ஆகிவிடும், அல்லாஹ்வின் தூதரே!” என்று கூறிவிட்டு (மணவிலக்குச் செய்து) மனைவியிடமிருந்து (தாமாகவே) பிரிந்துகொண்டார்கள். அவ்வாறு அவளைப் பிரிந்துவிடுமாறு அவருக்கு நபி (ஸல்) அவர்கள் கட்டளையிடவில்லை. (அவராகவே அந்த முடிவுக்கு வந்தார்.) பிறகு (இந்தத் தம்பதியரின் சம்பவமே) சாபஅழைப்புப் பிரமாணம் செய்வோருக்கான வழிமுறையாகத் தொடர்ந்தது. மேலும், நபி (ஸல்) அவர்கள், “இவளைக் கண்காணித்துவாருங்கள்; இவள் அரணையைப் போன்று குட்டையான சிவப்புநிறக் குழந்தையைப் பெற்றெடுத்தால் கணவன் சொன்னது பொய் என்றே நான் கருதுவேன். இவள் கறுப்பு நிறத்தில் விசாலமான கண்கள் கொண்ட, பெரிய பிட்டங்களை உடைய குழந்தையைப் பெற்றெடுத்தால் அவள்மீது உவைமிர் சொன்னது உண்மை என்றே நான் கருதுவேன்” என்று சொன்னார்கள். பிறகு விரும்பத் தகாத அந்தத் தோற்றத்திலேயே அவள் குழந்தை பெற்றெடுத்தாள்.32 அத்தியாயம் : 96",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 35
			}
		}
	]
}