{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7323,
			"arabicnumber": 7323,
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களுக்கு குர்ஆனை ஓதிக் கொடுத்துவந்தேன். உமர் (ரலி) அவர்கள் செய்த இறுதி ஹஜ்ஜின்போது மினாவில் அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (என்னிடம்), “நீங்கள் இறைநம்பிக்கையாளர்களின் தலைவர் (உமர்-ரலி) அவர்களுடன் இருந்திருக்க வேண்டும். (இன்று) அவர்களிடம் ஒரு மனிதர் வந்து, “இறைநம்பிக்கையாளர் களின் தலைவரே! இன்னான், ‘இறைநம்பிக்கையாளர்களின் (இன்றைய) தலைவர் இறந்துவிட்டிருந்தால் இன்னாருக்கு நான் விசுவாசப் பிரமாணம் செய்து கொடுத்திருப்பேன்’ என்று கூறினான்” என்றார். இதைக் கேட்ட உமர் (ரலி) அவர்கள், “இன்று மாலையே நான் (மக்கள்முன்) நின்று, தங்களுக்குச் சம்பந்தமில்லாத விஷயங்களில் தலையிட நினைக்கும் இவர்களை எச்சரிக்கை செய்யவுள்ளேன்” என்று சொன்னார்கள். நான், “அவ்வாறு செய்யாதீர்கள். ஏனெனில், ஹஜ் பருவத்தில் (நல்லவர்களுடன்) விவரமற்ற மக்களும் குழுமுகின்றனர். அவர்கள்தான் உங்கள் அவையில் மிகுந்திருப்பர். (நீங்கள் எழுந்து நின்று ஏதோ ஒன்றைச் சொல்ல) அதற்கு உரிய பொருள் தராமல், ஒவ்வொருவரும் (தம் மனம்போன போக்கில்) அதைத் தவறாகப் புரிந்துகொள்வார்களோ என நான் அஞ்சுகிறேன். ஆகவே, நீங்கள் ஹிஜ்ரத் மற்றும் நபிவழி பூமியான மதீனா சென்று சேரும்வரைக் காத்திருங்கள். அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய தோழர்களான முஹாஜிர்களையும் அன்சாரிகளையும் தனியாகச் சந்தி(த்து அவர்களிடம் நீங்கள் தெரிவிக்க வேண்டியதை அழுத்தமாகத் தெரிவி)யுங்கள். அவர்கள் உங்கள் சொல்லை நினைவில் நிறுத்திக்கொண்டு, அதற்குரிய முறையில் அதைப் புரிந்துகொள்வார்கள்” என்று சொன்னேன். அதற்கு உமர் (ரலி) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் மதீனா சென்றபின் முதலாவது கூட்டத்திலேயே இதைப் பற்றிப் பேசப்போகிறேன்” என்று சொன்னார்கள். இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறுகிறார்கள்: அவ்வாறே நாங்கள் மதீனா சென்றடைந்தோம். “நிச்சயமாக அல்லாஹ் முஹம்மத் (ஸல்) அவர்களை சத்திய (மார்க்க)த்துடன் அனுப்பினான். மேலும், அவர்களுக்கு (குர்ஆன் எனும்) வேதத்தையும் அருளினான். அல்லாஹ் அருளிய (வேதத்)தில் கல்லெறி தண்டனை (ரஜ்ம்) சம்பந்தமான வசனம் இருந்தது” என உமர் (ரலி) அவர்கள் பேசத் தொடங்கி னார்கள்.55 அத்தியாயம் : 96",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 53
			}
		}
	]
}