{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "உபைதுல்லாஹ் பின் அப்தில்லாஹ் பின் உத்பா பின் மஸ்ஊத் (ரஹ்) அவர்கள் கூறியதாவது: மூசா (அலை) அவர்கள் (சந்தித்த அந்த) நண்பர் யார் என்பது தொடர்பாக, இப்னு அப்பாஸ் (ரலி) அவர்களும் ஹுர்ரு பின் கைஸ் பின் ஹிஸ்ன் அல் ஃபஸாரீ (ரலி) அவர்களும் விவாதித்துக் கொண்டனர். “அவர் ‘களிர்’ (அலை) அவர்கள்தான்” என்று இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள். (ஹுர்ரு பின் கைஸ் (ரலி) அவர்கள் வேறொரு மனிதர் என்றார்கள்.) அப்போது அவர்கள் இருவரையும் கடந்து உபை பின் கஅப் (ரலி) அவர்கள் சென்றார்கள். அவரை இப்னு அப்பாஸ் (ரலி) அவர்கள் அழைத்து, “நானும் என்னுடைய இந்தத் தோழரும் மூசா (அலை) அவர்கள் எந்த நண்பரைச் சந்திக்க (அல்லாஹ்விடம்) வழி கேட்டார்களோ அந்த நண்பர் (யார் என்பது) தொடர்பாக) விவாதித்துக் கொண்டோம். அவர் தொடர்பாக நபி (ஸல்) அவர்கள் எதுவும் சொல்ல நீங்கள் கேட்டிருக்கிறீர்களா?” என்று கேட்டார்கள். அதற்கு உபை பின் கஅப் (ரலி) அவர்கள் “ஆம்; அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பின்வருமாறு) சொல்ல நான் கேட்டேன்” என்றார்கள்: பனூ இஸ்ராயீல் குலத்தாரின் (பிரமுகர் கள்) கூட்டம் ஒன்றில் ஒரு மனிதர் வந்து மூசா (அலை) அவர்களிடம், “உங்களை விட அதிகமாக அறிந்தவர் யாரையாவது உங்களுக்குத் தெரியுமா?” என்று கேட்டார். அதற்கு மூசா (அலை) அவர்கள், “(அப்படி யாரும் இருப்பதாக) எனக்குத் தெரிய வில்லை” என்றார்கள். அப்போது அல்லாஹ், “அப்படியல்ல; நம் அடியார் ‘களிர்’ (உங்களைவிட அறிந்தவராக) இருக்கிறார்” என்று கூறினான். உடனே மூசா (அலை) அவர்கள் அவரைச் சந்திக் கும் வழி என்னவென்று (அல்லாஹ்விடம்) கேட்டார்கள். அதற்கு அல்லாஹ், மூசா (அலை) அவர்களுக்கு மீனை அடையாளமாக்கி னான். “இந்த மீனை எங்கே தொலைத்து விடுகிறீரோ அங்கிருந்து வந்த வழியே திரும்பிவிட வேண்டும். அங்கு அவரை நீர் சந்திப்பீர்” என்று சொல்லப்பட்டது. அவ்வாறே, மூசா (அலை) அவர்கள் கடலில் மீன் (தொலைந்து போனபின் அதன்) சுவட்டைப் பின்பற்றிச் சென்றார்கள். அதாவது மூசா (அலை) அவர்களுடன் வந்த உதவியாளர், “நாம் ஒரு பாறை ஓரமாக ஒதுங்கி ஓய்வெடுத்தோம் பார்த்தீர்களா? அந்த இடத்தில் மீனை நான் மறந்து (தவற விட்டு) விட்டேன். அதைக் கூறவிடாமல் என்னை ஷைத்தான்தான் மறக்கடித்துவிட்டான்” என்று கூறினார். மூசா (அலை) அவர்கள், “அதைத்தான் நாம் எதிர்பார்த்துக் கொண்டிருந்தோம்” என்று சொன்னார்கள். பிறகு இருவரும் தம் (பாதச்) சுவடுகளைத் தேடித் திரும்பிச் சென்றார்கள்; அங்கே களிர் (அலை) அவர்களைக் கண்டார்கள். பிறகு வல்லமையும் மாண்பும் மிக்க அல்லாஹ் தனது வேதத்தில் (18:60-82) எடுத்துரைத்துள்ள அவ்விருவர் தொடர்பான நிகழ்ச்சிகள் நடைபெற்றன. அத்தியாயம் : 3",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		}
	]
}