{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7437,
			"arabicnumber": 7437,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: “அல்லாஹ்வின் தூதரே! மறுமை நாளில் நாங்கள் எங்கள் இறைவனைக் காண்போமா?” என்று மக்கள் (நபி (ஸல்) அவர்களிடம்) கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “பௌர்ணமி இரவில் முழு நிலாவைக் காண்பதில் உங்களுக்குச் சிரமம் இருக்குமா?” என்று கேட்டார்கள். மக்கள் “இல்லை; அல்லாஹ்வின் தூதரே!” என்றார்கள். நபி (ஸல்) அவர்கள், “மேகம் மறைக்காத சூரியனைக் காண்பதில் உங்களுக்குச் சிரமம் இருக்குமா?” என்று கேட்டார்கள். மக்கள். “இல்லை; அல்லாஹ்வின் தூதரே!” என்று பதிலளித்தனர். நபி (ஸல்) அவர்கள் சொன்னார்கள்: இவ்வாறுதான் உங்கள் இறைவனை நீங்கள் (மறுமை நாளில்) காண்பீர்கள். அல்லாஹ் மறுமை நாளில் மனிதர்களை ஒன்றுகூட்டி, “(உலகத்தில்) யார் எதை வழிபட்டுக்கொண்டிருந்தாரோ அவர் அதைப் பின்பற்றிச் செல்லட்டும்” என்று கூறுவான். எனவே, சூரியனை வழிபட்டுக்கொண்டிருந்தவர்கள் சூரியனைப் பின்தொடர்வார்கள். சந்திரனை வழிபட்டுக்கொண்டிருந்தவர்கள் சந்திரனைப் பின்தொடர்வார்கள். ஷைத்தான்களை வழிபட்டுவந்தவர்கள் ஷைத்தான்களைப் பின்தொடர்வார்கள். இறுதியில் இந்தச் சமுதாயத்தார் மட்டும் எஞ்சியிருப்பார்கள். அவர்களிடையே ‘பரிந்துரைப்போர்’ அல்லது ‘நயவஞ்சகர்கள்’ இருப்பார்கள். அப்போது அல்லாஹ், அவர்களிடம் (அவர்கள் அறிந்திராத தோற்றத்தில்) வந்து, “நானே உங்கள் இறைவன்” என்று கூறுவான். அதற்கு அவர்கள், “எங்கள் இறைவன் எங்களிடம் வரும்வரை நாங்கள் இங்கேயே இருப்போம் (நீ எங்கள் இறைவன் அல்லன்). அவன் எங்களிடம் வந்தால் அவனை நாங்கள் அறிந்துகொள்வோம்” என்று கூறுவர். அப்போது அல்லாஹ் அவர்களிடம் அவர்கள் அறிந்துகொள்ளும் தோற்றத்தில் வந்து, “நான்தான் உங்கள் இறைவன்” என்று சொல்வான். அப்போது அவர்கள், “நீதான் எங்கள் இறைவன்” என்று கூறியபடி அவனைப் பின்தொடர்வார்கள். அங்கு நரகத்திற்குமேலே பாலம் அமைக்கப்படும். அப்போது நானும் என் சமுதாயத்தாருமே அ(ந்தப் பாலத்)தை முதன்முதலாகக் கடப்போம். அன்றைய தினம் இறைத்தூதர்கள் மட்டுமே பேசுவார் கள். அப்போது இறைத்தூதர்களின் பிரார்த்தனை “(இறைவா!) காப்பாற்று! காப்பாற்று!” என்பதாகவே இருக்கும். கருவேல மரத்தின் முட்களைப் போன்ற கொக்கிகள் நரகத்தில் மாட்டப்பட்டிருக்கும். “கருவேல மரத்தைப் பார்த்திருக்கிறீர்களா?” என்று கேட்டார்கள். மக்கள், “ஆம், அல்லாஹ்வின் தூதரே!” என்று பதிலளித்தனர். அந்தக் கொக்கிகள் கருவேலமர முள்ளைப் போன்றுதானிருக்கும். ஆயினும், அதன் பருமனை அல்லாஹ்வைத் தவிர வேறெவரும் அறியமாட்டார்கள். அந்தக் கொக்கிகள் மக்களை அவர்களின் (தீய) செயல்களுக்கேற்ப கவ்விப் பிடிக்கும். மக்களில் சிலர் தமது செயலால் அழிந்துவிடுவார்கள். இன்னும் சிலர் (கொக்கியின் பிடி தளர்ந்து நரகத்தில்) விழுந்துவிடுவார்கள். மற்றச் சிலர் வேறு நிலையில் இருப்பார்கள். பிறகு இறைவன் காட்சியளித்து, தன் அடியார்களிடையே தீர்ப்பளித்து முடித்த பின், நரகவாசிகளில் தான் நாடிய சிலரை தன் கருணையால் (நரகத்திலிருந்து) வெளியேற்ற விரும்புவான். ஆகவே, அல்லாஹ்வுக்கு எதையும் இணைகற்பிக்காமல் வாழ்ந்தவர்களை நரகத்திலிருந்து வெளியேற்றிடுமாறு வானவர்களுக்கு அவன் கட்டளையிடுவான். அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை (லா இலாஹ இல்லல்லாஹ்) என உறுதி கூறியவர்களில் யாருக்குத் தான் கருணை புரிய வேண்டுமென நாடுகின்றானோ அவர்களை (நரகத்திலிருந்து வெளியேற் றிடுமாறு ஆணையிடுவான்). நரகத்திலிருக் கும் அவர்களை (அவர்கள் செய்த) சஜ்தா வின் (சிரவணக்கத்தின்) அடையாளத்தை வைத்து வானவர்கள் இனங்கண்டு கொள்வார்கள். ஆதமின் மகனின் (மனிதனின்) சஜ்தா அடையாள(ம் உள்ள இட)த்தை தவிர அவனை (முழுமையாக) நரகம் தீண்டும். (ஆனால்,) சஜ்தா அடையாளத்தைத் தீண்டக் கூடாதென நரகத்திற்கு இறைவன் தடை விதித்துள் ளான். ஆகவே, அவர்கள் அங்கமெல்லாம் கரிந்துவிட்ட நிலையில் நரகத்திலிருந்து வெறியேறுவார்கள். அப்போது அவர்கள் மீது ஜீவ நீர் (மாஉல் ஹயாத்) ஊற்றப் படும். உடனே அவர்கள் சேற்று வெள்ளத் தில் விதைப்பயிர் முளைப்பதைப் போன்று (புதுப் பொலிவுடன்) நிறம் மாறிவிடுவார்கள். பின்னர் அடியார்களிடையே அல்லாஹ் தீர்ப்பளித்து முடிக்கும்போது நரகத்தை முன்னோக்கியபடி ஒரு மனிதர் எஞ்சியிருப்பார். அவர்தான் சொர்க்கத்தில் நுழையக் காத்திருக்கும் கடைசி நரகவாசியாவார். அவர், “என் இறைவா! நரகத்தைவிட்டு என் முகத்தை (வேறு பக்கம்) திருப்புவாயாக! அதன் (வெப்பக்) காற்றால் எனக்கு மூச்சடைக்கிறது; அதன் சுவாலை என்னைக் கரித்துவிட்டது” என்று கூறுவார். பின்னர் எதைச் சொல்லி அவர் பிரார்த்திக்க வேண்டுமென அல்லாஹ் நாடுவானோ அதைச் சொல்லி அவர் பிரார்த்திப்பார். பிறகு அல்லாஹ் (அவரிடம்), “நீ கேட்பதை நான் கொடுத்தால் இஃதல்லாத வேறொன்றை நீ என்னிடம் கேட்கக்கூடும் அல்லவா?” என்பான். அதற்கு அவர், “இல்லை. உன் கண்ணியத்தின் மீதாணையாக! இதைத் தவிர வேறெதையும் நான் உன்னிடம் கேட்கமாட்டேன்” என்று கூறி, இறைவன் நாடிய வாக்குறுதிகளையும் உறுதிமொழிகளையும் அவர் தம் இறைவனிடம் வழங்குவார். அப்போது அல்லாஹ் நரகத்தைவிட்டு அவருடைய முகத்தை (வேறு பக்கம்) திருப்பிவிடுவான். அவர் சொர்க்கத்தை முன்னோக்கி பார்வையைச் செலுத்தும்போது அல்லாஹ் நாடிய நேரம்வரை அவர் அமைதியாக இருப்பார். பிறகு, “என் இறைவா! சொர்க்கத் தின் வாயில்வரை என்னைக் கொண்டு செல்வாயாக!” என்று கூறுவார். அதற்கு அல்லாஹ் அவரிடம், “உனக்கு வழங்கப்பட்ட இதைத் தவிர வேறெதையும் ஒருபோதும் என்னிடம் கேட்கமாட்டாய் என உறுதிமொழி களையும் வாக்குறுதிகளையும் நீ வழங்க வில்லையா? மனிதா! உனக்குக் கேடுதான். உன்னுடைய ஏமாற்று வேலைதான் என்ன?” என்று கூறுவான். அதற்கு அவர், “இல்லை. உன் கண்ணியத்தின் மீதாணையாக! இதைத் தவிர வேறெதையும் உன்னிடம் நான் கேட்கமாட்டேன்” எனக் கூறி, அவன் நாடிய வாக்குறுதிகளையும் உறுதிமொழிகளையும் (இறைவனிடம்) வழங்குவார். ஆகவே, அல்லாஹ் அவரை சொர்க்கத் தின் வாயில்வரை கொண்டுசெல்வான். சொர்க்க வாயிலில் அவர் நிற்கும்போது சொர்க்க வாயில் அவருக்காகத் திறக்கும். அப்போது அவர் அதிலுள்ள உல்லாச சுகங்களைப் பார்த்தவாறு அல்லாஹ் நாடிய வரை அமைதியாக இருப்பார். பிறகு, “என் இறைவா! என்னைச் சொர்க்கத்திற்குள் அனுப்புவாயாக!” என்று கூறுவார். அப்போது அல்லாஹ், “உனக்கு வழங்கப்பட்டதைத் தவிர வேறெதையும் கேட்கமாட்டேன் என்று கூறி வாக்குறுதிகளையும் உறுதிமொழிகளையும் நீ வழங்கவில்லையா?” என்று கேட்டுவிட்டு, “மனிதா! உனக்குக் கேடுதான். உனது ஏமாற்று வேலைதான் என்ன?” என்று கூறுவான். அதற்கு அவர், “என் இறைவா! உன் படைப்புகளிலேயே நற்கதியற்றவனாய் நான் ஆகிவிடக் கூடாது” என்று பிரார்த்தித்துக்கொண்டேயிருப்பார். இறுதியில் அவரைக் கண்டு அல்லாஹ் சிரித்துவிடுவான். அவரைக் கண்டு சிரித்ததும், “சொர்க்கத்தில் நுழைந்துகொள்” என்று அவரிடம் அல்லாஹ் கூறுவான். சொர்க்கத்திற்குள் அவர் நுழைந்தபின், “நீ (விரும்பிய) அதை ஆசைப்படலாம்” என்று அவரிடம் இறைவன் சொல்வான். அவ்வாறே அவர் ஆசைப்பட்டு தம் இறைவனிடம் கேட்பார். இறுதியில் அல்லாஹ்வே அவருக்கு (ஆசைப்பட வேண்டியவற்றை ஒவ்வொன்றாகச் சொல்லி) “இன்னதை இன்னதை நீ ஆசைப்படு” என்று நினைவுபடுத்துவான். கடைசியில் அந்த மனிதரின் ஆசைகள் எல்லாம் அடங்கும். (அப்போது) அல்லாஹ், “(நீ கேட்ட) இதுவும் உனக்குக் கிடைக்கும். இதைப் போன்று இன்னொரு மடங்கும் உனக்குக் கிடைக்கும்” என்று சொல்வான்.76 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}