{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மறுமை நாளில் இறைநம்பிக்கையாளர் கள் கவலைப்படும் அளவுக்கு நிறுத்தி வைக்கப்படுவார்கள். அப்போது அவர்கள், “(அதி பயங்கரமான) இந்த இடத்திலிருந்து நம்மை விடுவிக்க நம் இறைவனிடம் பரிந்துரைக்கும்படி (யாரையாவது) நாம் கேட்டுக்கொண்டால் என்ன?” என்று பேசிக்கொள்வார்கள். பிறகு அவர்கள் ஆதம் (அலை) அவர்களிடம் சென்று, “நீங்கள் மனிதர்களின் தந்தை ஆதம் ஆவீர்; அல்லாஹ் தனது கையால் உங்களைப் படைத்தான்; தனது சொர்க்கத்தில் உங்களை குடியிருக்கச் செய்தான்; தன்னுடைய வானவர்களை உங்களுக்குச் சிரம்பணியச் செய்தான்; எல்லாப் பொருட்களின் பெயர்களையும் உங்களுக்கு அவன் கற்பித்தான். (எனவே,) இந்த(ச் சோதனையான) கட்டத்திலிருந்து எங்களை விடுவிப்பதற்காக உங்கள் இறைவனிடத்தில் எங்களுக்காகப் பரிந்துரை செய்யுங்கள்” என்று கோருவர். அதற்கு ஆதம் (அலை) அவர்கள், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று கூறிவிட்டு, உண்ணக் கூடாதெனத் தடை விதிக்கப்பட்டிருந்த மரத்திலிருந்து புசித்துவிட்டதால் தாம் புரிந்த தவற்றினை அவர்கள் எடுத்துக் கூறுவார்கள். “(எனக்குப் பின்) பூமியிலுள்ளவர்களுக்கு இறைவனால் நியமிக்கப்பட்ட (முக்கியமான) இறைத்தூதர்களில் முதலாமவரான நூஹ் (அலை) அவர்களிடம் செல்லுங்கள்” என்று கூறுவார்கள். உடனே இறைநம்பிக்கையாளர்கள் நூஹ் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அன்னாரும் “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று கூறி, அறியாமல் தம் இறைவனிடம் வேண்டியதால் ஏற்பட்ட தமது தவற்றினை அவர்கள் நினைவு கூர்வார்கள். பிறகு, “நீங்கள் பேரருளாள(ன் இறைவ)னின் உற்றநண்பர் இப்ராஹீம் (அலை) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் இப்ராஹீம் (அலை) அவர்களிடம் செல்வார்கள். அப்போது அவர்களும், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று சொல்லிவிட்டு, தாம் (உலக வாழ்வில்) சொன்ன மூன்று பொய்களை எடுத்துக்கூறுவார்கள். பிறகு, “நீங்கள் மூசா (அலை) அவர்களிடம் செல்லுங்கள். அவருக்கு அல்லாஹ் தவ்ராத் (வேதத்)தை வழங்கி, அவருடன் உரையாடி, தன்னுடன் கலந்துரையாடும் அளவுக்கு நெருக்கம் அளித்த அடியார் ஆவார் அவர்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் மூசா (அலை) அவர்களிடம் செல்வார்கள். அப்போது அன்னாரும், “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை” என்று சொல்லிவிட்டு, (உலகில்) ஒருவரைக் கொலை செய்துவிட்டதால் தாம் செய்த குற்றத்தை எடுத்துக்கூறுவார்கள். பிறகு “நீங்கள் அல்லாஹ்வின் அடியாரும் தூதருமான, அவனது ஆவியும் வார்த்தையுமான ஈசா (அலை) அவர்களிடம் செல்லுங்கள்” என்று மூசா கூறுவார்கள். உடனே இறைநம்பிக்கையாளர்கள் ஈசா (அலை) அவர்களிடம் செல்வார்கள். அவர்களும் “(நீங்கள் நினைக்கும்) அந்த இடத்தில் நான் இல்லை; இறைவனால் முன்பின் பாவங்கள் மன்னிக்கப்பட்ட அடியாரான முஹம்மத் (ஸல்) அவர்களிடம் செல்லுங்கள்” என்று சொல்வார்கள். உடனே இறைநம்பிக்கையாளர்கள் என்னிடம் வருவார்கள். அப்போது நான் என் இறைவனை அவனது இல்ல(மான சொர்க்க)த்தில் சந்திக்க அனுமதி கோருவேன். எனக்கு அதற்கான அனுமதி வழங்கப்படும். நான் என் இறைவனைக் காணும்போது சஜ்தாவில் விழுந்துவிடுவேன். தான் நாடிய வரை அல்லாஹ் என்னை (அப்படியே) விட்டுவிடுவான். பிறகு அவன், “எழுங்கள், முஹம்மதே! சொல்லுங்கள்; செவியேற்கப்படும். பரிந்துரை செய்யுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும். கேளுங்கள்; உங்களுக்குத் தரப்படும்” என்று கூறுவான். அப்போது நான் எனது தலையை உயர்த்தி இறைவன் எனக்குக் கற்றுத்தரும் புகழ் மொழிகளைக் கூறி என் இறைவனைப் போற்றிப் புகழ்வேன். பிறகு நான் பரிந்துரை செய்வேன். அப்போது இறைவன் (நான் யார் யாருக்குப் பரிந்துரை செய்யலாம் என்பதை வரையறுத்து) எனக்கு வரம்பு விதிப்பான். பின்னர் நான் (அவனது இல்லத்திலிருந்து) வெளியேறி அவர்களைச் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். -கத்தாதா (ரஹ்) அவர்கள் கூறினார்கள்: “பின்னர் நான் (அவனது இல்லத்திலிருந்து) புறப்பட்டுச் சென்று (நரகத்திலிருந்து) அவர்களை வெளியேற்றி, சொர்க்கத்திற்குள் அனுப்பிவைப்பேன்” என்றும் அனஸ் (ரலி) அவர்கள் கூற நான் கேட்டேன்.- பிறகு மீண்டும் (இரண்டாம் முறையாக) என் இறைவனை அவனது இல்லத்தில் சந்திக்க நான் அனுமதி கோருவேன். எனக்கு அதற்கான அனுமதி வழங்கப்படும். நான் இறைவனைக் காணும்போது சஜ்தாவில் விழுவேன். தான் நாடிய வரை அல்லாஹ் என்னை (அப்படியே) விட்டுவிடுவான். பின்னர் “முஹம்மதே! எழுங்கள். சொல்லுங்கள்; செவியேற்கப்படும். பரிந்துரை செய்யுங்கள்; ஏற்கப்படும். கேளுங்கள்; தரப்படும்” என்று கூறுவான். அப்போது நான் எனது தலையைத் தூக்கி, இறைவன் எனக்குக் கற்றுத்தரும் புகழ்மாலைகளைக் கூறி அவனைப் போற்றிப் புகழ்வேன். பின்னர் நான் பரிந்துரைப்பேன். (நான் யார்யாருக்குப் பரிந்துரை செய்ய வேண்டுமென) எனக்கு அவன் வரம்பு விதிப்பான். அப்போது நான் (அவனது இல்லத்திலிருந்து) வெளியேறிச் சென்று அவர்களை சொர்க்கத்திற்கு அனுப்பி வைப்பேன். -”நான் வெளியேறிச் சென்று, அவர் களை நரகத்திலிருந்து வெளியேற்றி சொர்க்கத்திற்கு அனுப்பிவைப்பேன் என்று அனஸ் (ரலி) அவர்கள் அறிவித்ததை நான் கேட்டேன்” என கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்.- பின்னர் மூன்றாம் முறையாக மறுபடி யும் என் இறைவனை அவனது இல்லத் தில் சந்திக்க நான் அனுமதி கேட்பேன். எனக்கு அந்த அனுமதி வழங்கப்படும். இறைவனை நான் காணும்போது சிரவணக்கத்தில் விழுவேன். தான் நாடிய வரை (அப்படியே) என்னை அல்லாஹ் விட்டுவிடுவான். பிறகு “முஹம்மதே! எழுங்கள். சொல்க; செவியேற்கப்படும். பரிந்துரை செய்க; ஏற்கப்படும். கோருக; அது தரப்படும்” என இறைவன் கூறுவான். அப்போது நான் எழுந்து, என் இறைவன் எனக்குக் கற்றுத்தரும் புகழ்மாலைகளைக் கூறி அவனைப் போற்றிப் புகழ்வேன். பின்னர் பரிந்துரைப்பேன். அவன் எனக்கு வரம்பு விதிப்பான். நான் வெளியேறிச் சென்று, அவர்களைச் சொர்க்கத்திற்கு அனுப்பிவைப்பேன். -”நான் வெளியேறிச் சென்று அவர்களை நரகத்திலிருந்து வெளியேற்றி சொர்க்கத்திற்கு அனுப்பிவைப்பேன் என்று கூறியதை நான் கேட்டேன்” என கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்.- “இறுதியில் குர்ஆன் தடுத்துவிட்ட, அதாவது நிரந்தர நரகம் கட்டாயமாகிவிட்டவர்களைத் தவிர வேறு யாரும் நரகத்தில் இருக்கமாட்டார்கள்” என்று (நபி (ஸல்) அவர்கள்) கூறிவிட்டு, “(நபியே!) உம் இறைவன் உம்மை (‘மகாமும் மஹ்மூத்’ எனும்) உயர் தகுதிக்கு அனுப்பலாம்” எனும் (17:79 ஆவது வசனத்தை) ஓதினார்கள். பிறகு இந்த ‘மகாமும் மஹ்மூத்’ எனும் இடம் உங்கள் நபிக்காக வாக்களிக்கப்பட்ட இடமாகும்” என்று கூறினார்கள்.80 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		}
	]
}