{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கஅபா பள்ளிவாசலிலிருந்து (விண் பயணத்திற்கு) இரவில் அழைத்துச் செல்லப்பட்டது பற்றி அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்களுக்கு (சட்டங்கள் தொடர்பாக) வேதஅறிவிப்பு (வஹீ) வருவதற்கு முன்பு (ஒருநாள் இரவு) அவர்கள் புனித (கஅபா) பள்ளிவாசலில் உறங்கிக்கொண்டிருந்தார்கள். அப்போது அவர்களிடம் (வானவர்கள்) மூன்று பேர் வந்தனர். அவர்களில் முதலாமவர், (அங்கு படுத்திருந்த ஹம்ஸா (ரலி), முஹம்மத் (ஸல்), ஜஅஃபர் (ரலி) ஆகியோரை நோக்கி) “இவர்களில் அவர் (முஹம்மத்-ஸல்) யார்?” என்று கேட்டார். அதற்கு நடுவிலிருந்த (வான)வர் “இவர்களில் (நடுவில் படுத்திருக்கும்) சிறந்தவரே அவர்” என்று பதிலளித்தார். அப்போது அம்மூவரில் மூன்றாமவர், “இவர்களில் சிறந்தவரை (விண் பயணத்திற்காக) எடுத்துவாருங்கள்” என்று கூறினார். அன்றிரவு இவ்வளவுதான் நடந்தது. அடுத்த (நாள்) இரவில் நபி (ஸல்) அவர்கள் தமது உள்ளம் பார்க்கின்ற நிலையில் (உறக்க நிலையில்) அம்மூவரும் வந்தபோதுதான் அவர்களைக் கண்டார்கள். நபி (ஸல்) அவர்களின் கண் மட்டுமே உறங்கும்; அவர்களது உள்ளம் உறங்குவதில்லை. -இறைத்தூதர்கள் நிலை இவ்வாறுதான்; அவர்களின் கண்கள் மட்டுமே உறங்கும்; அவர்களின் உள்ளங்கள் உறங்கா.- பிறகு அந்த வானவர்கள் நபி (ஸல்) அவர்களிடம் ஏதும் பேசாமல் அவர்களைத் தூக்கிக் கொண்டு வந்து ‘ஸம்ஸம்’ கிணற்றின் அருகில் இறக்கினர். அவர்களிடமிருந்து நபி (ஸல்) அவர்களின் பொறுப்பை (வானவர்) ஜிப்ரீல் (அலை) ஏற்றுக்கொண்டார்கள்.158 அவர் நபி (ஸல்) அவர்களின் காறை யெலும்பிருந்து நெஞ்சின் நடுப்பகுதிவரை பிளந்து, நெஞ்சிலிருந்தவற்றையும் வயிற்றி லிருந்தவற்றையும் அகற்றினார். பின்னர் தமது கையால் நபியவர்களின் இருத யத்தை ‘ஸம்ஸம்’ நீரால் கழுவி, அவர்களது வயிற்றைச் சுத்தப்படுத்தினார். பிறகு தங்கத் தட்டு ஒன்று கொண்டுவரப்பட்டது. அதில் தங்கக் கோப்பை ஒன்று இருந்தது. அது இறைநம்பிக்கையாலும் ஞானத்தாலும் நிரப்பப்பட்டிருந்தது. அதை நபியவர் களின் இருதயத்திலும் தொண்டை நாளங் களிலும் இட்டு நிரப்பினார் ஜிப்ரீல்; பின்னர் இருதயத்தை மூடிவிட்டார். (பிறகு ‘புராக்’ வாகனம் கொண்டு வரப்பட்டு அதில் ஏற்றப்பட்ட நபியவர்கள் பைத்துல் முகத்தஸை அடைந்தார்கள். அங்கிருந்து) நபி (ஸல்) அவர்களை அழைத்துக்கொண்டு அவர் முதல் வானத்திற்கு உயர்ந்தார். அந்த வானத்தின் கதவுகளில் ஒன்றை அவர் தட்டினார். அப்போது அந்த வானத்திலிருந்த (வான)வர்கள், “யார் அவர்?” என்று கேட்டார்கள். அதற்கு அவர், ‘ஜிப்ரீல்’ என்று பதிலளித்தார். “உங்களுடன் வந்திருப்பவர் யார்?” என்று கேட்டார்கள். அதற்கு அவர், “என்னுடனிருப்பவர் முஹம்மத்” என்று பதிலளித்தார். “(அவரை அழைத்துவரச் சொல்லி) ஆள் அனுப்பப்பட்டிருந்ததா?” என்று கேட்டனர். அதற்கு ஜிப்ரீல் (அலை) ‘ஆம்’ என்றார்கள். “அவரது வரவு நல்வரவாகட்டும்! வாழ்த்துகள்!” என்று கூறினர். நபியவர்களின் வருகையால் வானில் இருப்போர் மகிழ்ச்சியடைகிறார்கள். பூமியில் அல்லாஹ் எதை (நிகழச்செய்ய) நினைக்கிறானோ அதை அவனாக வானவர்களிடம் அறிவிக்காத வரை வானவர்கள் அதை அறிந்துகொள்ளமாட்டார்கள். அந்த முதல் வானத்தில் நபி (ஸல்) அவர்கள் (ஆதி மனிதர்) ஆதம் (அலை) அவர்களைக் கண்டார்கள். அப்போது ஜிப்ரீல் (அலை) அவர்கள் நபி (ஸல்) அவர்களிடம், “இவர்தான் உங்கள் தந்தை. இவருக்கு நீங்கள் சலாம் (முகமன்) கூறுங்கள்” என்று சொன்னார்கள். அவ்வாறே அவருக்கு நபி (ஸல்) அவர்கள் முகமன் கூற, அதற்கு ஆதம் (அலை) அவர்கள் பதில் (முகமன்) சொல்லிவிட்டு, “அருமை மகனே! வருக! வருக! நீரே நல்ல புதல்வர். (உங்கள் வரவிற்கு) வாழ்த்துகள்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் அந்த முதல் வானத்தில் பாய்ந்தோடும் இரு நதிகளைக் கண்டார்கள். உடனே “ஜிப்ரீலே! இவை எந்த நதிகள்?” என்று கேட்டார்கள். அதற்கு ஜிப்ரீல் (அலை) அவர்கள், “இவையிரண்டும் நைல் மற்றும் யூப்ரடீஸ் நதியின் மூலங்கள்” என்று பதிலளித்தார்கள். பிறகு நபி (ஸல்) அவர்களை அழைத்துக்கொண்டு அந்த வானத்தில் சென்றுகொண்டிருந்தபோது இன்னொரு நதியையும் கண்டார்கள். அதன் மீது முத்துகளாலும் பச்சை மரகதத்தாலும் ஆன மாளிகை ஒன்று இருந்தது. (அந்த நதியில்) நபி (ஸல்) அவர்கள் தமது கையால் அடித்தார்கள். அ(தன் மண்ணான)து உயர்ந்த நறுமணமிக்க கஸ்தூரியாக இருந்தது. நபி (ஸல்) அவர்கள், “இது என்ன நதி ஜிப்ரீலே?” என்று கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், “இது உங்களுக்காக உங்கள் இறைவன் ஒதுக்கிவைத்துள்ள ‘கவ்ஸர்’ (எனும் நதி) ஆகும்” என்று பதிலளித்தார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் இரண்டாம் வானத்திற்கு உயர்ந்தார். அப்போது அவரிடம் முதல் வானத்திலிருந்த வானவர்கள் கேட்டதைப் போன்றே (இந்த வானத்திலிருந்த) வானவர்களும், “யார் அவர்?” என்று கேட்டனர். அதற்கு ஜிப்ரீல் (அலை) அவர்கள் ‘ஜிப்ரீல்’ என்று பதிலளித்தார்கள். வானவர்கள், “உம்முடன் இருப்பவர் யார்?” என்று கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், ‘முஹம்மத் (ஸல்) அவர்கள்’ என்று பதிலளித்தார்கள். “அவருக்கு ஆளனுப்பப்பட்டிருந்ததா?” என்று வானவர்கள் கேட்டார்கள். ஜிப்ரீல் (அலை) அவர்கள், ‘ஆம்’ என்றார்கள். அப்போது அவ்வானவர்கள், “அவரது வரவு நல்வரவாகட்டும்! வாழ்த்துகள்” என்று கூறினர். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் மூன்றாம் வானத்திற்கு உயர்ந்தார்கள். அ(வ்வானத்திலிருந்த வான)வர்களும் முதலாவது மற்றும் இரண்டாவது வானத்திலிருந்தவர்கள் கூறியதைப் போன்றே கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் நான்காம் வானத்திற்கு உயர்ந்தார்கள். அங்கிருந்த (வான)வர் களும் அதைப் போன்றே கூறினர். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் ஐந்தாம் வானிற்கு உயர்ந்தார்கள். அ(ங்கிருந்த வான)வர்களும் அதைப் போன்றே கூறினர். பின்னர் நபியவர்களுடன் ஆறாம் வானிற்கு உயர்ந்தார்கள். அவர்களும் அவ்வாறே கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் ஏழாம் வானிற்கு உயர்ந்தார்கள். அப்போது அங்கிருந்த (வான)வர்களும் அவரிடம் முன்போலவே கூறினர். ஒவ்வொரு வானத்திலும் இறைத்தூதர்கள் இருந்ததாகக் கூறிய நபி (ஸல்) அவர்கள் அவர்களுடைய பெயர்களையும் குறிப்பிட்டார்கள். இத்ரீஸ் (அலை) அவர்கள் இரண்டாம் வானிலும், ஹாரூன் (அலை) அவர்கள் நான்காம் வானிலும், இன்னொருவர் ஐந்தாம் வானிலும், -அவருடைய பெயர் நினைவில்லை-. இப்ராஹீம் (அலை) அவர்கள் ஆறாம் வானிலும், மூசா (அலை) அவர்கள், அல்லாஹ்வுடன் உரையாடியவர் என்ற சிறப்பின் அடிப்படையில் ஏழாம் வானிலும் இருந்ததாக நான் மனனமிட்டுள்ளேன். அப்போது மூசா (அலை) அவர்கள், “என் இறைவா! எனக்குமேலே வேறொருவர் உயர்த்தப்படுவார் என்று நான் எண்ணியிருக்கவில்லை” என்று கூறினார்கள். பிறகு நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் அதற்கு மேலேயும் ஏறினார். -அல்லாஹ்வுக்கு மட்டுமே அதன் நிலை தெரியும். -இறுதியாக (வான் எல்லையிலுள்ள இலந்தை மரமான) ‘சித்ரத்துல் முன்தஹா’விற்குச் சென்றார்கள். அங்கு சர்வ வல்லமை படைத்தவனும் கண்ணியத்தின் அதிபதியுமான (இறை) வன், வில்லின் இரு முனையளவு அல்லது அதைவிட மிக அருகில் நெருங்கி வந்தான். அப்போது அல்லாஹ் நபி (ஸல்) அவர்களுக்கு அறிவித்தவற்றில், “நாள் ஒன்றுக்கு ஐம்பது நேரத் தொழுகைகள் உங்கள் சமுதாயத்தார்மீது (கடமையாக் கப்பட்டு) உள்ளது” என்பதும் அடங்கும். பிறகு நபி (ஸல்) அவர்கள் (அங்கிருந்து) இறங்கி மூசா (அலை) அவர்களிடம் வந்துசேர்ந்தார்கள். அப்போது நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்திய மூசா (அலை) அவர்கள், “முஹம்மதே! உங்கள் இறைவன் உங்களிடம் என்ன உறுதிமொழி வாங்கினான்?” என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், “நாள் ஒன்றுக்கு ஐம்பது நேரத் தொழுகைகளை (நான் கட்டாயம் தொழ வேண்டுமென) அவன் என்னிடம் உறுதிமொழி வாங்கினான்” என்று பதிலளித்தார்கள். மூசா (அலை) அவர்கள், “உங்கள் சமுதாயத்தாரால் அதை நிறைவேற்ற முடியாது. ஆகவே, நீங்கள் திரும்பிச் சென்று, உங்கள் இறைவனிடம் உங்களுக்கும் (உங்கள் சமுதாயத்தாரான) அவர்களுக்கும் (தொழுகைகளின் எண்ணிக்கையை) குறைக்குமாறு கேளுங்கள்” என்று கூறினார்கள். அப்போது நபி (ஸல்) அவர்கள் அது தொடர்பாக ஆலோசனை கேட்பதைப் போன்று ஜிப்ரீல் (அலை) அவர்களைத் திரும்பிப் பார்த்தார்கள். ‘நீர் விரும்பினால் ஆகட்டும்’ என்று கூறுவதைப் போன்று ஜிப்ரீல் (அலை) அவர்கள் நபி (ஸல்) அவர்களிடம் சைகை செய்தார்கள். ஆகவே, நபி (ஸல்) அவர்களுடன் ஜிப்ரீல் (அலை) அவர்கள் சர்வ வல்லமை படைத்த(வனான இறைவ)னிடம் உயர்ந்தார்கள். (முதலில் தாம் நின்றிருந்த) அதே இடத்தில் நின்றவாறு நபி (ஸல்) அவர்கள், “என் இறைவா! எங்களுக்காக (தொழுகைகளின் எண்ணிக்கையை) குறைத்திடுவாயாக! ஏனெனில், என் சமுதாயத்தாரால் இதை நிறைவேற்ற இயலாது” என்று சொன்னார்கள். அப்போது அல்லாஹ் அவர்களுக்குப் பத்து தொழுகைகளைக் குறைத்தான். பிறகு நபி (ஸல்) அவர்கள் மூசா (அலை) அவர்களிடம் திரும்பிவந்தார்கள். மீண்டும் அவர்கள் நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்தினார்கள். அவ்வாறே மீண்டும் மீண்டும் நபி (ஸல்) அவர்களை இறைவனிடம் மூசா (அலை) அவர்கள் திருப்பி அனுப்பிக்கொண்டேயிருந்தார்கள். முடிவில் அந்த (ஐம்பது) தொழுகை (நாள் ஒன்றுக்கு) ஐந்து தொழுகைகளாக மாறியது. ஐந்துக்கு வந்தபோதும் மூசா (அலை) அவர்கள் நபி (ஸல்) அவர்களைத் தடுத்து நிறுத்தி, “முஹம்மதே! அல்லாஹ்வின் மீது சத்தியமாக! நான் என் சமுதாயத்தாரான பனூ இஸ்ராயீல்களுக்கு இதைவிடக் குறைந்த அளவிலான தொழுகையையே கோரிப்பெற்றேன். ஆனால், அவர்கள் (அதைக்கூட நிறைவேற்றாது) பலவீனமடைந்து கை விட்டுவிட்டார்கள். உங்கள் சமுதாயத்தாரோ உடலாலும் உள்ளத்தாலும் மேனியாலும் பார்வையாலும் கேள்வியாலும் பலவீனமானவர்கள். ஆகவே, திரும்பச் சென்று உங்களுக்காக (உங்கள் ஐநேரத் தொழுகைகளின் எண்ணிக்கையை) குறைத்துக் கேளுங்கள்” என்று கூறினார்கள். ஒவ்வொரு தடவையும் நபி (ஸல்) அவர்கள் ஜிப்ரீல் (அலை) அவர்களிடம் யோசனை பெறுவதற்காக அவர் பக்கம் திரும்பிப்பார்த்துக்கொண்டிருந்தார்கள். அவரும் அதை வெறுக்கவில்லை. ஐந்தாவது தடவை ஜிப்ரீல் (அலை) அவர்கள் நபிகளாரை மேலே அழைத்துச் சென்றபோது நபி (ஸல்) அவர்கள், “என் இறைவா! என் சமுதாயத்தார் உடலாலும் உள்ளத்தாலும் கேள்வியாலும் பார்வையாலும் மேனியாலும் பலவீனமானவர்கள். ஆகவே, (தொழுகைகளை) குறைத்திடு வாயாக!” என்று கோரினார்கள். அதற்கு சர்வ வல்லமை படைத்தவ(னானஇறைவ)ன், “முஹம்மதே!” என்று அழைத்தான். அதற்கு “இதோ இறைவா! நான் காத்திருக்கிறேன்; கட்டளையிடு” என்று பதிலளித்தார்கள். அதற்கு அல்லாஹ், “(ஒருமுறை சொல்லப்பட்ட) சொல் என்னிடம் மாற்றப் படுவதில்லை; அதை (-ஐவேளைத் தொழுகையை) நான் உங்கள்மீது ‘லவ்ஹுல் மஹ்ஃபூல்’ எனும் பாதுகாக்கப்பெற்ற பதிவேட்டில் கடமையாக(ப் பதிவு) ஆக்கி விட்டேன். மேலும், ஒரு நற்செயலுக்குப் பத்து நன்மைகள் உண்டு. ஆகவே, அவை உங்களுக்கு ஐந்து நேரத் தொழுகைகளாக இருப்பினும், பாதுகாக்கப்பெற்ற பதிவேட்டில் அவை ஐம்பது நேரத் தொழுகைகள் (உடைய நன்மைக்கு நிகர்) ஆகும்” என்று சொன்னான். பின்னர் நபி (ஸல்) அவர்கள், மூசா (அலை) அவர்களிடம் திரும்பிவந்தார்கள். அப்போது “என்ன செய்தீர்?” என்று மூசா (அலை) அவர்கள் கேட்டார்கள். அதற்கு நபி (ஸல்) அவர்கள் எங்களுக்கு (ஐம்பதாயிருந்த தொழுகைகளின் எண்ணிக்கையை ஐந்தாக) அவன் குறைத்தான். ஒவ்வொரு நற்செயலுக்கும் அதைப் போன்ற பத்து மடங்கு நன்மைகளை வழங்கினான்” என்று சொன்னார்கள். அதற்கு மூசா (அலை) அவர்கள், “அல்லாஹ்வின் மீது சத்தியமாக! இதைவிடக் குறைவான எண்ணிக்கையையே பனூ இஸ்ராயீல்களுக்கு நான் (இறைவனிடம்) கோரிப்பெற்றேன். அப்படியிருந்தும் அதைக்கூட அவர்கள் கைவிட்டார்கள். நீங்கள் உங்கள் இறைவனிடம் திரும்பிச் சென்று இன்னும் உங்களுக்காகக் குறைக்கும்படி கேளுங்கள்” என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், “மூசாவே! அல்லாஹ்வின் மீது சத்தியமாக! திரும்பத் திரும்ப இறைவனிடம் நான் சென்றுவிட்டதால் (மீண்டும் செல்ல) வெட்கப்படுகிறேன்” என்றார்கள். அப்போது ஜிப்ரீல் (அலை) அவர்கள், “(நபியே!) அல்லாஹ்வின் திருப்பெயரால் (பூமிக்கு) இறங்குங்கள்” என்றார்கள். அப்போது நபி (ஸல்) அவர்கள் விழித்தெழுந்தார்கள்; மஸ்ஜிதுல் ஹராம் புனிதப் பள்ளிவாசலில் இருந்தார்கள்.159 அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		}
	]
}