{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "ஸஹ்தம் பின் முளர்ரிப் அல்ஜர்மீ (ரஹ்) அவர்கள் கூறியதாவது: ஜர்ம் குலத்தாரைச் சேர்ந்த இந்தக் குடும்பத்தாருக்கும் அஷ்அரீ குலத்துக்கு மிடையே நேசமும் சகோதரத்துவ உறவும் இருந்துவந்தது. நாங்கள் அபூமூசா அல் அஷ்அரீ (ரலி) அவர்களிடம் இருந்தோம். அப்போது அவர்களுக்குக் கோழி இறைச்சியுடன் உணவு பரிமாறப்பட்டது. அன்னாருடன் பனூ தைமுல்லாஹ் குலத்தைச் சேர்ந்த ஒரு மனிதரும் இருந்தார். அவர் விடுதலை செய்யப்பட்ட அடிமைகளில் ஒருவர் போன்றிருந்தார். அவரை அபூமூசா (ரலி) அவர்கள் உணவுண்ண அழைத்தார்கள். அப்போது அவர், “இந்தக் கோழி (இனம், அசுத்தம்) எதையோ தின்பதைக் கண்டு அதனால் அருவருப்படைந்து அதை உண்ணமாட்டேன் என நான் சத்தியம் செய்துவிட்டேன்” என்று கூறினார். அதைக் கேட்ட அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறினார்கள்: இங்கே வா! நான் உனக்கு இதைப் பற்றி (விவரமாக)த் தெரிவிக்கின்றேன். நான் நபி (ஸல்) அவர்களிடம் (என்) அஷ்அரீ குலத்தார் சிலருடன் வாகனம் கேட்டுச் சென்றேன். அதற்கு நபி (ஸல்) அவர்கள், “அல்லாஹ்வின் மீதாணையாக! நான் உங்களை வாகனம் எதிலும் ஏற்றியனுப்பமாட்டேன். உங்களை ஏற்றியனுப்ப என்னிடம் வாகனம் எதுவுமில்லை” என்று சொன்னார்கள். பின்னர் நபி (ஸல்) அவர்களிடம் போரில் கிடைத்த ஒட்டகங்கள் சில கொண்டுவரப்பட்டன. அப்போது நபி (ஸல்) அவர்கள் எங்களைப் பற்றி “அஷ்அரீ குலத்து ஆட்கள் எங்கே?” என்று கேட்டுவிட்டு, “வெள்ளைத் திமில்கள் கொண்ட ஐந்து ஒட்டக மந்தைகளை எங்களுக்கு வழங்கும்படி உத்தரவிட்டார்கள். பிறகு நாங்கள் சென்றுவிட்டோம். (என்றாலும்,) “நாம் என்ன காரியம் செய்துவிட்டோம்? அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நம்மை வாகனத்தில் ஏற்றி அனுப்ப மாட்டேன் என்றும், தம்மிடம் நமக்கு வழங்க வாகனம் இல்லை என்றும் சத்தியம் செய்தார்கள். பிறகு நமக்கு வாகனம் வழங்கிவிட்டார்களே! நாம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை, அவர்களது சத்தியத்திலிருந்து கவனத்தைத் திருப்பிவிட்டோம். அல்லாஹ்வின் மீதாணையாக! நாம் ஒருபோதும் வெற்றியடையமாட்டோம்” என்று எங்க ளுக்குள் பேசிக்கொண்டோம். பிறகு நபி (ஸல்) அவர்களிடம் திரும்பிச் சென்று இதைப் பற்றிக் கூறினோம். அதற்கு அவர்கள் “உங்களை நான் (வாகனத்தில்) ஏற்றியனுப்ப வில்லை; உங்களை அல்லாஹ்வே ஏற்றியனுப்பினான். அல்லாஹ்வின் மீதாணையாக! நான் ஒரு சத்தியம் செய்து அஃதல்லாத வேறொன்று அந்தச் சத்தியத்தைவிடச் சிறந்ததாக எனக்குத் தென்பட்டால், அந்த வெறோன்றையே செய்வேன். சத்தியத்தை முறித்து, அதற் காகப் பரிகாரமும் செய்துவிடுவேன்” என்று சொன்னார்கள்.194 இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 97",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		}
	]
}