{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: மக்கள் (நபி (ஸல்) அவர்களிடம்) “அல்லாஹ்வின் தூதரே! நாங்கள் எங்கள் இறைவனைக் காண்போமா?” என்று வினவினர். அதற்கு நபி (ஸல்) அவர்கள், “பௌர்ணமி இரவில் மேகம் மறைக்காத சந்திரனைக் காண முடியும் என்பதில் நீங்கள் ஐயம் கொள்வீர்களா?” என்று கேட்டார்கள். மக்கள், “இல்லை (ஐயம் கொள்ளமாட்டோம்), அல்லாஹ்வின் தூதரே!” என்றார்கள். மீண்டும் நபி (ஸல்) அவர்கள், “மேகம் மறைக்காத சூரியனைக் காணலாம் என்பதில் நீங்கள் ஐயம் கொள்வீர்களா?” எனக் கேட்டார்கள். அதற்கும் மக்கள், “இல்லை” என்று பதிலளித்தனர். அப்போது நபி (ஸல்) அவர்கள், “இவ்வாறுதான் உறுதியாக நீங்கள் இறைவனைக் காண்பீர்கள்” என்று கூறிவிட்டு (பின்வருமாறும்) கூறினார்கள்: மறுமை நாளில் மக்கள் அனைவரும் ஒன்று திரட்டப்படுவார்கள். அப்போது “(உலகத்தில்) யார் எதை வழிபட்டுக்கொண்டிருந்தார்களோ அதைப் பின்பற்றிச் செல்லட்டும்!” என்பான் (இறைவன்). ஆகவே, சிலர் சூரியனைப் பின்பற்றிச் செல்வர். இன்னும் சிலர் சந்திரனைப் பின்பற்றிச் செல்வர். வேறுசிலர் (சாத்தான்கள், சிலைகள் போன்ற) தீய சக்திகளைப் பின்பற்றிச் செல்வர். இறுதியில் (என்னுடைய) இந்தச் சமுதாயத்தார் மட்டும் எஞ்கியிருப்பார்கள். அவர்களிடையே நயவஞ்சகர்களும் (கலந்து) இருப்பார்கள். அப்போது வ-மையும் மாண்பும் மிக்க இறைவன் (அவர்கள் அறியாத தோற்றத்தில்) அவர்களிடம் வந்து, “நான் உங்கள் இறைவன்” என்பான். உடனே அவர்கள் “எங்கள் இறைவன் எங்களிடம் வரும் வரை நாங்கள் இங்கேயே இருப்போம்; எங்கள் இறைவன் எங்களிடம் வந்தால் அவனை நாங்கள் அறிந்துகொள்வோம்” என்று கூறுவார்கள். அப்போது அல்லாஹ் (அவர்கள் அறிந்த தோற்றத்தில்) அவர்களிடம் வந்து, “நானே உங்கள் இறைவன்” என்பான். அப்போது அவர்கள், “நீ எங்கள் இறைவன்தான்” என்பார்கள். பிறகு அவர்களை இறைவன் அழைப்பான். நரகத்தின் மேலே பாலம் அமைக்கப்படும். தம் சமுதாயத்தாருடன் அதைக் கடந்து செல்லும் இறைத்தூதர்களில் நானே முதல் ஆளாக இருப்பேன். அன்றைய தினத்தில் இறைத் தூதர்களைத் தவிர வேறுயாரும் பேசமாட்டார்கள். அன்றைய தினம் ‘இறைவா! காப்பாற்று! காப்பாற்று!’ என்பதே இறைத்தூதர்களின் பேச்சாக இருக்கும். தொடர்ந்து நபி (ஸல்) அவர்கள், “அந்நரகத்தி(ன் பாலத்தி)ல் கருவேல மரத்தின் முற்களைப் போன்ற கொக்கிகள் மாட்டப்பட்டிருக்கும்.” என்று கூறிவிட்டு, “கருவேல மரத்தின் முள்ளை நீங்கள் பார்த்திருக்கிறீர்களா?” என்று கேட்டார்கள். மக்கள், “ஆம் (பார்த்திருக்கிறோம்)” என்று பதிலளித்தார்கள். தொடர்ந்து நபி (ஸல்) அவர்கள் கூறினார்கள்: அந்தக் கொக்கிகள் கருவேல மரத்தின் முள்ளைப் போன்றிருந்தாலும், அதன் பருமனை அல்லாஹ்வைத் தவிர வேறெவரும் அறியமாட்டார்கள். அந்தக் கொக்கிகள் மக்களை, அவர்களின் (தீய) செயல்களுக்கேற்ப கவ்விப் பிடிக்கும். அவர்களில் தம் (தீய) செயல்களால் பேரழிவுக்கு ஆளாகுவோரும் இருப்பார் கள். (கொக்கிகளால்) கிழிக்கப்பட்டு, பின்னர் தப்பிப்போரும் இருப்பார்கள். இறுதியாக இறைவன் நரகத்திற்குரிய வர்களில் தான் நாடிய சிலர்மீது கருணை காட்ட நினைக்கும்போது வானவர்களிடம், அல்லாஹ்வை வழிபட்டு வந்தவர்களை நரகத்தி-ருந்து வெளியேற்றுமாறு கட்டளையிடுவான். அவ்வாறே அவர் களை வானவர்கள் வெளியேற்றுவார்கள். சஜ்தா செய்த அடையாளங்களை வைத்து அவர்களை வானவர்கள் அடையாளம் காண்பார்கள். சஜ்தா அடையாளங்களைத் தீண்டக் கூடாதென நரகத்திற்கு இறைவன் தடை விதித்துள்ளான். ஆகவே, (அல்லாஹ்வை வழிபட்டவர் கள்) நரகத்தி-ருந்து வெளியேற்றப்படு வார்கள். சஜ்தா அடையாளத்தைத் தவிர மற்ற உறுப்புகளை எல்லாம் நரகம் தீண்டிவிட்ட நிலையில் உள்ள ஒவ்வொரு மனிதரும் அங்கமெல்லாம் கருகியவாறு நரகத்தி-ருந்து வெளியேறுவார்கள். அப்போது அவர்கள்மீது (மாஉல் ஹயாத் எனும்) ஜீவநீர் ஊற்றப்படும். உடனே அவர்கள் சேற்று வெள்ளத்தில் விதைப் பயிர் முளைப்பதைப் போன்று (புதுப்பொலிவு டன்) நிறம் மாறிவிடுவார்கள். பின்னர் அல்லாஹ் அடியார்களிடையே தீர்ப்பளித்து முடிப்பான். இறுதியாக ஒரே ஒரு மனிதர் சொர்க்கத்திற்கும் நரகத்திற்கும் இடையே எஞ்சியிருப்பார். அவர்தான் நரகவாசிகளில் கடைசியாகச் சொர்க்கத்திற்கு செல்பவர். அவர் நரகத்தை முன்னோக்கியபடி, “இறைவா! நரகத்தைவிட்டு என் முகத்தை (வேறு பக்கம்) திருப்பு வாயாக! அதன் நச்சுக் காற்று என்னை அழித்துவிட்டது. அதன் சுவாலை என்னைக் கரித்துவிட்டது.” என்று கூறுவார். அப்போது அல்லாஹ், “இ(ப்போது நீ கோரிய)து உனக்குச் செய்து கொடுக்கப் பட்டால் வேறொன்றையும் நீ கோரலாம் அல்லவா?” என்று கேட்பான். அதற்கு அம்மனிதர், “இல்லை, உன் கண்ணியத் தின் மீதாணையாக! (வேறு எதையும் கேட்கமாட்டேன்)” என்பார். அந்த மனிதர் அல்லாஹ்விடம், அவன் நாடிய உறுதிமொழியையும் வாக் குறுதிகளையும் வழங்குவார். நரகத்தை விட்டு அம்மனிதரின் முகத்தை (வேறு பக்கம்) அல்லாஹ் திருப்பிவிடுவான். சொர்க்கத்தை நோக்கி அவரது முகத்தைத் திருப்பியதும் அம்மனிதர் சொர்க்கத்தின் செழிப்பைப் பார்த்தவாறு அல்லாஹ் நாடிய நேரம்வரை அமைதியாக இருப்பார். பிறகு “இறைவா! என்னைச் சொர்க்கத் தின் வாசல்வரை கொண்டுசெல்வாயாக!” என்று கேட்பார். அதற்கு இறைவன், “முன்பு கேட்டதைத் தவிர வேறெதையும் நீ என்னிடம் கேட்கமாட்டாய் என்று கூறி உறுதிமொழியும் வாக்குறுதியும் அளித் தாயே?” என்று கேட்பான். அதற்கு அம்மனிதர், “இறைவா! நான் உன் படைப்புக்களிலேயே நற்கதியற்ற வனாய் ஆகிவிடக் கூடாது” என்று கூறுவார். அதற்கு இறைவன், “(நீ கேட்டது) உனக்கு வழங்கப்பட்டால் வேறு எதையும் நீ கேட்கலாம் அல்லவா?” என்பான். அம்மனிதர், “இல்லை, உன் கண்ணியத்தின் மீதாணையாக! இஃதல்லாத வேறெதையும் நான் கேட்கமாட்டேன்” என்பார். இது குறித்து இறைவனிடம், அவன் நாடிய உறுதிமொழியும் வாக்குறுதியும் அந்த மனிதர் அளிப்பார். உடனே இறைவன் அந்த மனிதரை சொர்க்கத்தின் வாசல்வரை கொண்டுசெல்வான். அதன் வாசலை அவர் அடைந்ததும் அதன் வசந்தத்தையும் அதிலுள்ள செழுமை, சந்தோஷம் ஆகியவற்றையும் காண்பார். பிறகு அல்லாஹ் நாடிய அளவுக்கு அவர் அமைதியாக இருப்பார். அதன்பின் அந்த மனிதர், “இறைவா! என்னைச் சொர்க்கத்திற்குள் அனுமதிப்பாயாக!” என்று கூறுவார். அதற்கு உயர்ந்தோன் அல்லாஹ், “ஆதமின் மகனே! உனக்குக் கேடுதான்! ஏன் வாக்கைக் காப்பாற்றத் தவறிவிட்டாய்? முன்பு வழங்கப்பட்டதைத் தவிர வேறெதையும் நான் கேட்கமாட் டேன் என உறுதிமொழியும் வாக்குறுதியும் நீ அளிக்கவில்லையா?” என்று கேட்பான். அதற்கு அம்மனிதர், “இறைவா! உன் படைப்புகளிலேயே என்னை நற்கதியற்ற வனாய் ஆக்கிவிடாதே” என்பார். இம்மனிதனின் நிலை கண்டு வல்லமையும் மாண்பும் மிக்க அல்லாஹ் சிரிப்பான். பிறகு அவருக்குச் சொர்க்கத்திற்குள் செல்ல அனுமதியளித்துவிடுவான். அதன் பின் இறைவன் அம்மனிதரிடம், “நீ ஆசைப்படுவதைக் கேள்!” என்று கூறுவான். அம்மனிதரும் தாம் ஆசைப் படுவதைக் கூறுவார். இறுதியில் அவர் தம் ஆசைகள் யாவும் முற்றுப்பெறும்போது (அவரிடம்) இறைவன், “இதைவிட அதிகமானதை நீ ஆசைப்படு!” என்று சொல்-க்கொடுப்பான். இறுதியில் ஆசைகள் முற்றுப்பெற்றுவிடும்போது உயர்ந்தோன் அல்லாஹ், “உனக்கு இதுவும் உண்டு. இதைப் போன்று இன்னொரு மடங்கும் உண்டு” என்பான். இதன் அறிவிப்பாளரான அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் தமக்கு இதை அறிவித்த அபூஹுரைரா (ரலி) அவர்களிடம், “உனக்கு இதுவும் உண்டு. இதைப் போன்று பத்து மடங்கும் உண்டு’ என்று அல்லாஹ் கூறியதாகத்தானே நபி (ஸல்) அவர்கள் சொன்னார்கள்?” என்று கேட்டார்கள். அதற்கு அபூஹுரைரா (ரலி) அவர்கள், “நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து ‘உனக்கு இதுவும் உண்டு. இதுபோன்று இன்னொரு மடங்கும் உண்டு’ என்று அல்லாஹ் கூறியதாகவே மனனமிட்டேன்” என்றார்கள். அதற்கு அபூசயீத் (ரலி) அவர்கள், “இதுவும் உண்டு. இதுபோன்று பத்து மடங்கும் உண்டு” என்றே நான் நபி (ஸல்) அவர்களிட மிருந்து செவியுற்றுள்ளேன்” என்று கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 201
			}
		}
	]
}