{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"13": "The Two Festivals (Eids)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "ஹஃப்ஸா பின்த் சீரீன் (ரஹ்) அவர்கள் கூறியதாவது: பெருநாளன்று எங்கள் இளம்பெண்கள் (தொழும் திடலுக்கு) வெளியேறக் கூடாது என்று நாங்கள் தடுத்துவந்தோம். இந் நிலையில், ஒரு பெண்மணி ‘பனூ கலஃப்’ குலத்தாரின் மாளிகையில் தங்கியிருந்தார். நான் அவரிடம் சென்றேன். அவர் தம் சகோதரி (உம்மு அத்தியா -ர-) வழியாக வந்த ஹதீஸ் ஒன்றை அறிவித்தார்: -என் சகோதரியின் கணவர் நபி (ஸல்) அவர்களுடன் சேர்ந்து பன்னிரண்டு போர் களில் கலந்துகொண்டார். என் சகோதரி ஆறு போர்களில் தம் கணவருடன் இருந்தார்- என் சகோதரி கூறினார்: (பெண்களாகிய) நாங்கள் (போர்கள் நடை பெறும்போது) காயமுற்றவர்களுக்கு மருந்திடுவோம்; நோயாளிகளைக் கவனிப் போம். நான் நபி (ஸல்) அவர்களிடம், “அல்லாஹ்வின் தூதரே! எங்களில் ஒரு பெண்ணுக்குத் துப்பட்டா இல்லாவிட்டால், (பெருநாளன்று தொழும் திடலுக்குப்) புறப்பட்டுச் செல்லாமல் (வீட்டிலேயே) அவள் இருப்பது குற்றமா?” என்று கேட்டேன். அதற்கு நபி (ஸல்) அவர்கள், (ஒரு பெண்ணிடம் துப்பட்டா இல்லாவிட்டால்) அவளுடைய தோழி தன் துப்பட்டாக்களில் ஒன்றை அவளுக்கு அணியக் கொடுக்கட்டுமே! பெண்களும் நன்மையான காரியங்களிலும் இறைநம்பிக்கை யாளர்களின் பிரார்த்தனையிலும் கலந்துகொள்ளட்டுமே!” என்று சொன்னார்கள். ஹஃப்ஸா பின்த் சீரீன் (ரஹ்) அவர்கள் கூறுகிறார்கள்: உம்மு அத்தியா (ரலி) அவர்கள் வந்தபோது நான் அவர்களிடம் சென்று, “நபி (ஸல்) அவர்கள் இவ்வாறு கூறியதை நீங்கள் செவியுற்றீர்களா?” என்று கேட்டேன். அதற்கு உம்மு அத்திய்யா (ரலி) அவர்கள், “என் தந்தை (நபியவர்களுக்கு) அர்ப்பணமாகட்டும்! ஆம் (நான் செவியுற்றேன்)” என்று பதிலளித்தார்கள். உம்மு அத்திய்யா (ரலி) அவர்கள் நபி (ஸல்) அவர்களின் பெயரைக் கூறும்போதெல்லாம் “என் தந்தை (நபியவர்களுக்கு) அர்ப் பணமாகட்டும்” என்று கூறாமல் இருந்தது அபூர்வமே. ‘திரைக்குள்ளிருக்கும் கன்னிப் பெண் களும்’ அல்லது ‘கன்னிப் பெண்களும், திரைக்குள்ளிருக்கும் பெண்களும்’ மாத விடாய் ஏற்பட்டுள்ள பெண்களும் (தொழும் திடலுக்குப்) புறப்பட்டுச் செல்லட்டும். மாதவிடாய் ஏற்பட்டுள்ள பெண்கள் தொழும் இடத்தைவிட்டு ஒதுங்கி இருப்பார்கள்; நன்மையான காரியங்களிலும் இறைநம்பிக்கையாளர் களின் பிரார்த்தனையிலும் அவர்கள் கலந்துகொள்ளட்டும்” என்று நபி (ஸல்) அவர்கள் கூறினார்கள் என்றார்கள் உம்மு அத்திய்யா (ரலி). பனூ கலஃப் குலத்தாரின் மாளிகையில் தங்கியிருந்த அந்தப் பெண்மணி தொடர்ந்து கூறுகிறார்: நான் உம்மு அத்திய்யா (ரலி) அவர்களிடம், “மாதவிடாய் ஏற்பட்டுள்ள பெண்களுமா (பெருநாள் தொழுகை நடக்கும் திடலுக்குச் செல்வார்கள்)?” என்று கேட்டேன். அதற்கு உம்மு அத்திய்யா (ரலி) அவர்கள், “ஆம். மாதவிடாய் ஏற்பட்டுள்ள பெண் அரஃபா (மினா, முஸ்த-ஃபா போன்ற) இன்ன இன்ன இடங்களுக்குச் செல்வதில்லையா?” என்று (திருப்பிக்) கேட்டார்கள். அத்தியாயம் : 13",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		}
	]
}