{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"22": "Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "Yahia Ibn Sa'id a rapporté: «J'avais fait vœu de marcher, mais soudain j'ai eu mal aux reins; je montai jusqu'à mon arrivée à la Mecque. J'ai demandé à Ata Ibn Abi Rabah et à d'autres à ce sujet, et tous me disent: «Tu as à faire une offrande». Ainsi, dès mon arrivée à Médine, j'ai interrogé ses ulémas, qui m'ordonnèrent de marcher de nouveau, du lieu ou je me suis senti incapable de poursuivre; et je l'accompli». Yahia a rapporté qu'il a entendu Malek dire: «Celui qui, à Médine, se dit faire vœu de marcher jusqu'à la Maison d'Allah, s'il se trouve impuissant de poursuivre qu'il monte, puis qu'il reprenne la marche du lieu où il s'est arrêté. S'il ne peut plus marcher, qu'il continue la distance qu'il peut faire, puis qu'il monte. Il aura à faire l'offrande d'une chamelle, ou d'une vache ou d'un mouton, s'il ne trouve que cette dernière offrande. On demanda à Malek au sujet d'un homme qui dit à un autre: «Je te porterai jusqu'à la Maison d'Allah». Il répondit: «S'il a fait vœu de le porter sur ses épaules, voulant par là souffrir, et se fatiguer, il ne doit rien, et qu'il marche à pieds et fasse une offrande. Et s'il n'avait pas fait vœu d'une telle proposition, qu'il fasse le pèlerinage et qu'il monte, en tenant compagnie à cet homme, car, il s'est antérieurement dit: «Je te porterai jusqu'à la Maison d'Allah. Or si l'homme refuse le pèlerinage, le premier ne devra à son égard aucune obligation». Yahia a rapporté qu'on a demandé à Malek au sujet d'un homme qui a juré de faire vœu d'un grand nombre de marches à pieds jusqu'à la maison d'Allah, ou qui a fait vœu de ne pas adresser la parole ni à son frère, ni à son père s'il n'accomplissait pas telle ou telle chose, vœu fait pour ce qu'il ne pourra accomplir, même s'il essayait chaque année d'en accomplir une partie, ou ceux qu'il s'est désignés»? Malek répondit: «Ce que je sais, c'est que cet homme aura à accomplir ses vœux tant que cela lui est possible; et qu'il marche tant qu'il sera capable de la faire et qu'il se rapproche d'Allah par les actes bénéfiques». Chapitre III Le fait de se rendre à pieds à la Ka'ba. (.....) 7 - Malek a dit: «Ce que j'ai de mieux entendu dire des hommes versés au sujet de l'homme ou de la femme qui a fait vœu de marcher à pieds jusqu'à la maison d'Allah que, au cas où cette personne ira à pieds pour une visite pieuse, elle devra marcher jusqu'à faire la course entre Al-Safa Et Al-Marwa; une fois cette course accomplie, elle aura son vœu expié. Si cette personne fait vœu de marcher pour un pèlerinage, elle marchera jusqu'à son arrivée à la Mecque, puis reprendra la marche afin qu'elle puisse accomplir tous les rites et poursuivra la marche jusqu'à accomplir la tournée processionnelle d'adieu autour de la Maison». Malek a dit: «Et la marche n'est à faire que pour un pèlerinage ou pour une visite pieuse». Chapitre IV De l'interdiction des vœux quand il s'agit de la désobéissance à Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1014
			}
		}
	]
}