{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"26": "The 'Aqiqa"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1067,
			"arabicnumber": 1067,
			"text": "Malek a dit: «Que ce qu'il a de mieux entendu, au sujet de l'homme qui est contraint de manger de la chair d'un animal mort, c'est qu'il peut en manger jusqu'à se rassasier, en faisant une provision. Mais s'il peut s'en dispenser, qu'il repousse cette chair” On demanda à Malek au sujet d'un homme, qui se trouve par necessité obligé de manger de la chair d'un animal mort, alors que se trouve des fruits ou des récoltes ou des moutons appartenant à des gens, dans le même lieu où se trouve cet homme. Malek a dit: «S'il pense que les propriétaires de ces fruits, ou de ces récoltes, ou de ces moutons, veulent bien lui faire l'aumône en tant que nécessité, pour qu'il ne soit pas considéré voleur et que l'on lui coupe la main, je pense qu'il peut manger de ce qu'il a trouvé, afin de subsister, sans qu'il ne fasse provision. Et ceci m'est de beaucoup plus préférable que de manger la chair d'un animal mort. Et si l'homme risque qu'on ne lui fasse pas l'aumône, et qu'il soit considéré voleur pour avoir pris quelque chose, dans ce cas. le fait de manger la chair d'un animal mort m'est préféré. Et il peut manger suffisamment de cette chair bien que je crains qu'il ne devienne transgresseur s'il ne prend pas de cette chair, préfereant mieux s'emparer des biens d'autrui d'une façon ilicite, sans une obligation». Malek a dit: «C'est ce que j'ai de mieux entendu». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 26 Le Livre de Al-'aqiqa Chapitre Premier Du sujet de Al-'aqiqa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 1067
			}
		},
		{
			"hadithnumber": 1067.5,
			"arabicnumber": 1067.5,
			"text": "Un homme de Abi Damra a rapporté d'après son père qu'on a demandé à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) au sujet de Al-\"âqiqa». Il répondit: «Je n'aime pas la négligeance des obligations». Comme s'il avait répugné l'écoute de ce terme. Il dit: «Celui, à qui Allah a accordé un enfant, j'aime bien qu'il fasse un sacrifice à son égard, s'il est capable»",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}