{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "• Hicham Ibn Ourwa a rapporté que son père Ourwa Al-Zoubair sacrifiait aux noms de ses enfants, mâles et femelles, un mouton pour chacun». Malek a dit au sujet de Al-'aqiqa: «Celui qui veut faire sacrifice au nom de ses enfants, qu'il le fasse d'un mouton pour chacun d'eux, mâle soit-il on femelle. Bien que ce sacrifice ne soit pas d'obligation cependant c'est une bonne tradition qui jusque là, est toujours suivie. Ainsi, celui qui fait Al-'âqiqa au nom de son enfant, ceci est considéré comme un rite et un sacrifice. Et il n'est pas permis que le mouton soit borgne, ou maigre ou fracturé ou malade. Rien de sa viande ne sera à vendre, ni sa peau, et ses os sont à fracturer. La famille qui a fait ce sacrifice, peut manger de cette chair, peut faire même une aumône, mais l'enfant au nom de qui ce sacrifice a été fait, ne peut pas toucher de son sang». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 27 Le Livre des successions Chapitre Premier De la succession des réservataires (1089) - Malek a dit: «Ce qui est traditionnellement pratiqué, et que j'ai vu les hommes versés dans la religion appliquer pour la question de la destination de l'héritage à un fils, et qui lui provient d'un père ou d'une mère c'est que: lorsque l'un d'eux meurt en laissant des enfants mâles et femelles, le garçon aura la part de deux filles; si les filles en sont plus que deux, elles auront les deux tiers de l'héritage, et s'il n'y a qu'une seule, elle aura la moitié. Au cas ou d'autres partenaires se présentent (selon les prescriptions d'Allah), ayant droit à l'héritage et que parmi eux se trouve un garçon, on commence par donner à ceux qui en ont le droit, puis on partagera ce qui reste entre eux, chacun selon la part qui lui revient. Les enfants du fils, mâles soient-ils ou femelles, auront la part du propre fils, privant par là les autres successeurs. Au cas où se trouvent de propres fils et des enfants d'un propre fils (décédé), et que les propres fils aient des garçons, ces derniers n'auront pas à faire part de l'héritage avec les enfants du décédé. Si le décédé n'a pas un garçon, mais deux filles ou plus, les filles de son fils mort, n'auront pas part à l'héritage avec ses filles, sauf s'il se trouve avec elles, un garçon qui jouit tout comme elles de la même parenté ou de plus loin, laissant un reste de l'héritage qui en sera réparti entre elles de telle façon que la part du garçon sera égale à celle de deux filles; mais si rien n'en reste ils n'auront droit à aucune part. Si le décédé n'a qu'une seule fille, elle a droit à la moitié de l'héritage, quant à la fille de son fils, une soit-elle ou plus, elle recevra (tout comme les autres), chacune le sixième. Mais au cas où il y a avec elles un garçon, elles n'auront plus rien même pas un sixième. Mais si après que l'héritage en soit partagé, il en reste quelque part, ceci doit-être donné au garçon et aux filles du fils de telle sorte que la part du garçon -soit égale à celle de deux filles; d'autre part, celui qui jouit d'une parenté lointaine, n'a droit à rien. Au cas où le partage de l'héritage eut lieu, et qu'il n'en reste rien, ils n'auront aucune part, et cela est en conformité aux paroles d'Allah Béni et Très-Haut dans son Livre: «Quant à vos enfants. Allah vous ordonne d'attribuer au garçon une part égale à celle de deux filles. Si les filles sont plus que deux, les deux tiers de l'héritage leur reviendront; s'il n'y en a qu'une, la moitié lui appartiendra». Coran IV, 11. Chapitre II De l'héritage de l'homme lui provenant de sa femme et celui de la femme lui provenant de son mari (1090) - Malek a dit: «Et de l'héritage de l'homme qui lui provient de sa femme morte, ne laissant ni un fils, ni un enfant d'un fils ou d'un autre, est de la moitié. Mais si la femme laisse un fils ou un enfant d'un fils, qu'il soit mâle ou femelle, son mari recevra la quart, et cela après avoir fait ou un testament ou des dettes qui auront été acquittées». Quant à l'héritage de la femme qui lui provient de son mari mort, ne laissant ni un fils, ni un enfant d'un fils, il en est le quart. Mais s'il laisse un fils, ou un enfant d'un fils, garçon soit-il ou fille, sa femme aura le huitième après que ses legs et ses dettes en fussent acquittés. Cela par référence aux paroles d'Allah Béni et Très-Haut dans son Livre: «Si vos épouses n'ont pas d'enfants, la moitié de ce qu'elles vous ont laissé vous revient. Si elles ont un enfant, le quart de ce qu'elles vous ont laissé vous revient, après que leurs legs ou leurs dettes auront été acquittés. Si vous n'avez pas d'enfants, le quart de ce que vous avez laissé reviendra à vos épouses. Si vous avez en enfant, le huitième de ce que vous avez laissé leur appartient, après que vos legs ou vos dettes auront été acquittés» Coran IV, 12. Chapitre III L'héritage du père et de la mère leur provenant de leur enfant (1091) - Malek a dit: «Ce qui est incontestablement suivi et que j'ai vu les hommes versés appliquer à Médine au sujet de l'héritage du père lui revenant de son fils ou de sa fille est ce qui suit au cas de la mort du fils ou de la fille, laissant un enfant mâle ou un fils d'un enfant mâle, la part du père est d'un sixième de l'héritage d'après ce qui est prescrit par Allah; si le fils ou la fille morts, ne laissant ni un fils, ni un enfant d'un fils et qu'il soit mâle, on commence par faire don des parts aux ayants-droits (autrement dit les réservataires), et si ce qui reste est du sixième ou plus, il est de la part du père. Si ce qui reste n'est pas équivalent au sixième, ou qu'il le dépasse, le père a droit au sixième selon les formes prescrites». Pour l'héritage de la mère qui lui revient de son fils ou de sa fille morte: «Si l'un ou l'autre a un enfant ou un fils d'un enfant mâle ou femelle avec des frères, deux ou plus, mâles soient-ils ou femelles germains, ou même d'un père ou d'une mère, la part de la mère est du sixième». Si le décédé ne laisse ni un enfant, ni un fils d'un enfant, ni deux frères ou plus, la mère a droit au tiers, sauf si deux autres cas se présentent à savoir: - Dans l'un des cas, où l'homme meurt, en laissant sa femme et ses père et mère; sa femme a droit au quart, sa mère au tiers de ce qui reste et qui est le quart du capital». - Dans l'autre, où la femme meurt, en laissant son mari et ses père et mère; son mari a droit à la moitié, sa mère au tiers de ce qui reste et qui est le sixième du capitale». Cela est conforme aux paroles d'Allah Béni et Très-Haut dans son Livre: «Si le défunt a laissé un fils, un sixième de l'héritage reviendra à chacun de ses père et mère. S'il n'a pas d'enfants et que ses parents héritent de lui: Le tiers reviendra à sa mère. S'il a des frères: Le sixième reviendra à sa mère» Coran IV, 11 . Et la tradition suivie est à de considérer que les frères sont deux ou plus». Chapitre IV L’héritage revenant aux frères utérins (1092) - Malek a dit: «Ce qui est suivi à Médine, c'est que les frères utérins n'auront pas part à l'héritage s'il se trouve un fils, ou des enfants d'un fils, qu'ils soient mâles ou femelles; les frères utérins ne méritent rien de l'héritage en présence d'un grand-père (le père du père); mais ils héritent dans n'importe quel autre cas de telle façon que chacun ait le sixième de l'héritage, mâle soit-il ou femelle, s'ils sont deux; au cas où ils sont plus que deux, ils seront partenaires, recevant tous le tiers de l'héritage réparti entre eux, de façon que la part du garçon soit égale à celle de deux filles. Cela, est conforme à ce qui est dit par Allah Béni et Très-Haut dans son Livre: «Quand un homme ou une femme, n'ayant ni parents, ni enfants, laisse un héritage, s'il a un frère ou une sœur: le sixième reviendra à chacun d'entre eux. S'ils sont plusieurs, ils se répartiront le tiers de l'héritage» Coran IV, 12. Pour ce cas, mâle et femelle sont à un même pied d'égalité». Chapitre V L'héritage des frères germains (1093) - Malek a dit: «Ce qui est suivi à Médine, c'est que les frères germains n'auront pas part à l'héritage en présence d'un fils, ou d'un enfant d'un fils ou du père. Mais ils héritent avec les filles, et les filles d'un fils, le reste de l'héritage, à moins qu'il ne se trouve en vie un père du père, et qu'ils en soient des agnats. On commence par répartir l'héritage à ceux qui sont les réservataires, et s'il en reste de l'héritage, il sera de la part des frères et sœurs germains, le partageant entre eux selon qui est prescrit dans Le Livre d'Allah à savoir, que le garçon aura une part égale à celle de deux filles; et s'il n'en reste rien de l'héritage, ils n'auront rien». Malek a dit: «Si le décédé ne laisse ni un père, ni un grand-père (père du père), ni un fils, ni un enfant d'un fils, qu'il soit mâle ou femelle, sa sœur germaine aura la moitié de l'héritage; si ses sœurs sont plus que deux et qu'elles soient germaines, elles auront les deux tiers; si elles ont un frère, ces sœurs, étant deux ou plus, elles n'auront rien de l'héritage. On commence par donner les parts de l'héritage aux réservataires; s'il en reste de cet héritage, il sera réparti entre les frères et sœurs germains, en faisant que, la part du garçon en soit égale à celle de deux filles. A excepter un seul cas où ils ne recevront rien, étant des partenaires avec les fils de la mère, dans leur part qui est le tiers. Pour ce cas il s'agit du fait qu'une femme meurt en laissant un mari, une mère, des frères et sœurs utérins, des frères et sœurs germains, son mari aura la moitié, sa mère le tiers, ses frères et sœurs utérins le tiers; pour ce qui reste, il sera la part des frères et sœurs germains qui seront des partenaires avec les fils de la mère, du tiers, de façon que le garçon aura une part égale à celle de la fille. étant tous frères et sœurs de la mère décédée, d'ailleurs ils ont hérité de par leur renvoi à la mère. Allah Béni et Très-Haut a dit dans son Livre: «Quand un homme ou une femme n'ayant ni parents, ni enfants, laisse un héritage: S'il a un frère ou une sœur: Le sixième en reviendra à chacun d'entre eux. S'ils sont plusieurs: Ils se répartiront le tiers de l'héritage». Coran IV, 12. Pour cela, ils sont des partenaires dans cette part prescrite, parce qu'ils sont tous des frères et sœurs de la part le la mère». Chapitre VI L'héritage des frères consanguins (1094) - Malek a dit: «Ce qui est suivi à Médine, au cas où un homme meurt, ne laissant que des frères et sœurs consanguins, sans qu'il ait avec eux des enfants germains, les consanguins auront leur part de la succession tout comme s'ils étaient des enfants germains, à savoir au même titre des mâles et des femelles; cependant les consanguins n'auront rien de l'héritage des enfants utérins s'ils existent, car les consanguins en sont de pareils aux enfants germains, mais loin d'être rapprochés aux enfants utérins qui en sont engendrés de la même mère». Malek a dit: «Si, à la réunion des frères et sœurs germains, et avec eux, les frères consanguins, on se rend compte que pour les premiers, il y a un mâle, les frères consanguins n'auront aucune part de l'héritage. Si les héritiers germains en sont une femme, ou plus qu'une femelle, n'ayant pas avec elles un mâle, la sœur germaine reçoit la moitié de l'héritage, et les sœurs consanguines auront le sixième, complétant les deux tiers. S'il se trouve un mâle avec les sœurs consanguines (du père), celles-ci n'auront plus part à l'héritage. On commence l'héritage, et ce qui reste de l'héritage sera réparti entre frères et sœurs consanguins (du père) de façon que le mâle aura une part égale à celle de deux femelles; s'il n'en reste rien des legs, ils n'auront rien. Si les héritières en sont deux sœurs germaines ou plus, elles recevront les deux tiers de ce qui est légué, et les sœurs consanguines n'auront aucun droit à l'héritage, sauf si avec elles, se trouve un frère consanguin, dans ce cas on commence par donner aux propres héritiers leurs parts, et ce qui reste de l'héritage revient aux consanguins (du père) de façon que le mâle aura deux fois la part d'une femelle. Si rien ne reste de l'héritage, ils n'auront rien. D'autre part, les frères et sœurs utérins, les germains, les consanguins, si chacun d'eux, en est un, il aura le sixième, s'ils sont deux et au-delà, ils auront le tiers, en rappelant que la part du mâle sera égale à celle de la femelle, étant tous deux, à un même pied d'égalité». Chapitre VII L'héritage du grand-père",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1074
			}
		}
	]
}