{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "Zaid Ibn Aslam a rapporté que Omar Ibn Al-Khattab demanda l'Envoyé d'Allah r (salallahou alayhi wa salam)(Sur lui la grâce et la paix d'Allah) au sujet de l'héritage des consanguins il lui répondit: «II te suffit, à ce sujet de faire référence, au verset qui a été révélé en été, et qui se trouve à la fin de la sourate «Les femmes». Malek a dit: «Ce qui est suivi et qui est incontestable, et que les hommes versés à Médine appliquent, c'est de considérer les collatéraux, à deux aspects: ainsi, ce qui est du verset mentionné au début de la sourate «Les femmes: verset No 12» «Quand un homme ou une femme, n'ayant ni parents ni enfants laisse un héritage: S'il a un frère ou une sœur: le sixième en reviendra à chacun d'eux. S'ils sont plusieurs: Ils se répartiront, le tiers de l'héritage». Cette première forme de l'héritage ne donne droit d'aucune part aux sœurs et frères utérins, afin qu'il n'y ait ni fils ni père. Pour l'autre forme de l'héritage, elle est à retrouver dans le verset mentionné à la fin de la sourate Les Femmes, verset No 176, où Allah Béni et Très-Haut a dit: «Ils te demandent une décision concernant les successions. Dis: «Allah vous donne des instructions au sujet de la parenté éloignée: Si quelqu'un meurt sans laisser d'enfants mais seulement une sœur, la moitié de sa succession reviendra à celle-ci. Un homme hérite de sa sœur si celle-ci n'a pas d'enfants. S'il a deux sœurs, les deux tiers de la succession leur reviendront. S'il laisse des frères et des sœurs, une part égale à celle de deux femmes revient à un homme. Allah vous donne une explication claire afin que vous ne vous égariez pas. Allah connaît toute chose». Coran II, 176. Malek a dit: «Cette dernière forme de l'héritage, où les frères et sœurs en sont des successeurs-agnats, s'il ne se trouve pas un enfant au décédé, ils se partageront l'héritage avec le grand-père, à qui revient le droit d'hériter en présence des frères et sœurs, car il en a la primauté plus qu'eux; même il hérite avec les enfants mâles du décédé, la part du sixième, quant aux frères, (du décédé), ils n'héritent rien, en présence de ses enfants mâles (du décédé). Comment ne sera-t-il pas comme l'un d'eux, alors qu'il a la part du sixième en présence des enfants du décédé? Comment n'aura-t-il pas le tiers avec les frères et sœurs germains, et les frères et sœurs utérins ont eu le tiers? Ainsi c'est le grand-père qui rend absent la part de l'héritage des frères et sœurs utérins, et sa présence les prive à jamais. Et c'est lui qui mérite la part qui, en fait était de leur droit. Si le grand-père n'avait pas eu le tiers, les frères et sœurs utérins, auraient dû l'avoir, ainsi, le grand-père a pris ce qui devait revenir aux frères et sœurs consanguins, et où les frères et sœurs utérins avaient plus le droit du tiers que les premiers. Or le grand-père a la primauté d'avoir le tiers des successeurs utérins». Chapitre X Au sujet de la tante paternelle",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1080
			}
		}
	]
}