{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "Malek a rapporté, d'après plusieurs dires, que Abdallah Ibn Mass'oud a été interrogé sur son avis alors qu'il était à Koufa, au sujet du mariage d'avec la mère.après la fille,si celle-ci n'a pas été touchée. Il l'autorisa. Puis se rendant à Médine, Ibn Mass'oud allait se renseigner à ce sujet du mariage, sur quoi on lui rapporta une réponse tout à fait différente de la sienne; cependant que l'autorisation était pour le cas des belles filles placées sous tutelle. Ainsi Ibn Mass'oud rebroussant chemin à Koufa, et avant même de rentrer chez lui, il se rendit chez l'homme qui lui avait demandé son avis au sujet du mariage (de la mère à la suite de la fille), à qui il ordonna de quitter sa femme». - Malek a dit au sujet de l'homme qui, épousant une femme, puis se mariera de sa mère, sa femme lui sera interdite, et aura à les quitter toutes deux, les ayant ensemble interdites, s'il avait eu des rapports avec la mère. Mais, s'il n'avait pas touché la mère, sa femme ne lui sera pas interdite, mais il quittera la mère». - Malek a aussi dit au sujet de l'homme qui épouse une femme, puis se marie de sa mère en ayant des rapports charnels avec elle, la mère ne sera licite ni pour lui, ni pour son père, ni pour son fils, la fille même de cette femme lui sera interdite et par conséquent sa propre femme lui en sera telle». - Malek a finalement dit: «Cependant, s'il s'agit d'un concubinage rien n'en sera interdit, car Allah Béni et Très-Haut a dit: «Les mères de vos femmes (qui vous sont interdites)» Coran IV, 23.. Ainsi, ce qui est illicite, c'est le mariage, sans qu'il en soit mentionné, que c'est le concubinage qui est illicite (ce qui est de ce verset). Donc tout mariage entendu être accordé avec une femme qui n'est pas interdite, sera considéré licite». Et Malek ajoute: «C'est ce que j'ai entendu être suivi, à Médine». Chapitre X Le mariage d'un homme avec la mère de la femme qu'il avait déjà touchée, d'une façon illicite (1133) - Concernant l'homme qui fornique avec une femme, sur qui l'on a appliqué la peine prescrite, Malek a dit: «Cet homme peut épouser la fille de cette femme, et encore, il peut donner la fille de cette femme en mariage à son fils s'il le veut, du moment que ses rapports avec la femme étaient illicites. De ce fait Allah a interdit toute transgression au licite ou même ce qui est du mariage douteux et II a dit (le sens): «N'épousez pas les femmes que vos pères ont eues pour épouses» Coran IV, 22. Malek a dit: «Si un homme épouse une femme, alors qu'elle est au cours de sa période d'attente, et que ce mariage en soit licite, de telle sorte qu'il eut des rapports avec elle, cette femme en sera interdite au fils de cet homme, de l'épouser du fait même que son père l'avait licitement épousée, sans être soumis à la peine prescrite. Et l'enfant que ce mariage engendrera, sera d'appartenance au père. Tout comme cette femme a été interdite à son fils de l'épouser, quand son père l'a prise en mariage, alors qu'elle était dans sa période d'attente, et a eu avec elle des rapports, la fille même de cette femme en sera interdite au père s'il avait déjà cohabité sa mère». Chapitre XI Les mariages illicites",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		}
	]
}