{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "On rapporta à Malek que Ibn Chéhab et Al-Kassem Ibn Mouhammad disaient: «Si l'homme libre se marie d'une esclave et a eu des rapports avec elle, elle l'engage dans le mariage». Malek a dit: «Et toute personne que j'ai connue disait pareillement, que l'esclave engage l'homme libre dans le mariage. S'il se marie d'elle, en ayant des rapports charnels, elle l'engage dans le mariage». Malek a ajouté: «Un esclave qui se marie d'une femme libre en ayant avec elle des rapports, il l'engage en mariage. Mais une femme libre qui se marie d'un esclave ne l'engage pas en mariage, à moins qu'il ne soit libéré, et une fois qu'il l'est, elle pourra l'avoir en tant que mari. Mais s'il se sépare d'elle avant qu'il ne soit libéré, il n'est pas engagé pour le mariage, attendant qu'il soit libéré et qu'il se marie d'une femme (libre soit-elle ou esclave). - Malek a aussi dit: «Si une femme esclave se trouve l'épouse d'un homme libre, qui se sépare d'elle, avant qu'il ne la libère, son mariage d'avec elle, ne peut la rendre une femme de bonne condition, tant qu'elle n'est pas libérée et que son mari la cohabite après sa libération, et c'est le cas qui engage cette esclave dans le mariage. Encore que, une esclave mariée d'avec un homme libre, et libérée tout en étant sa femme, avant même qu'il ne sépare d'elle, il la rend une femme de bonne condition s'il se sépare d'elle, il la rend une femme de bonne condition s'il la libère tant qu'elle est sa femme, et qu'il ait eu des rapports avec elle, après qu'il l'eût libéré». - Malek a finalement dit: «La femme libre chrétienne ou juive, et la femme esclave musulmane, engagent l'homme libre dans le mariage, s'il se marie avec l'une d'elles, et avec qui, il a eu des rapports». Chapitre XVIII Le mariage de la jouissance",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		}
	]
}