{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "Amr Ibn Cho'aib a rapporté d'après son père, d'après son grand-père que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit la vente par gage». - Malek, interprétant le hadith ci-dessus dit: «Ce que je pense, et Allah est le plus informé, que pour le gage, il s'agit du fait que l'homme s'achète un ou une esclave, ou même qu'il se loue une monture, puis qu'il dise à celui de chez qui il s'est acheté ou s'est loué: «Je te verserai un dinar ou un dirham ou plus, ou moins que ce prix, à condition que si je garde la marchandise ou que je me sers de la monture, ce que je t'aurais versé pour somme fera partie du prix de la marchandise, ou de la monture; et si je ne veux plus m'acheter ni la marchandise, ni me louer la monture, ce que tu aurais eu pour somme versée, ne sera nullement de ton droit». a - Ce qui est suivi parmi nous (à Médine), c'est qu'il est admis que l'homme s'achète l'esclave éloquent et doué pour les affaires commerciales en échange avec d'autres esclaves Ethiopiens ou même d'autres origines qui n'ont pas l'éloquence de cet esclave, ni même son habileté commerciale, ni non plus sa conviction, ni finalement sa connaissance. Ainsi, il est permis de s'acheter cet esclave, de l'échanger contre deux ou plusieurs autres, pour un temps bien déterminé. Cependant si, ultérieurement, il se montre différent, le moindre rapprochement qui sera souligné, est de suffisant pour que son échange contre deux en soit annulé même pour un temps limité. Et il en est de même pour la différence des origines. b - II est toléré que l'on puisse revendre ce qu'on a acheté avant de le prendre, si ce prix a été encaissé à un autre homme qui n'est pas celui chez qui on a fait l'achat». c - II n'est pas permis, au cas où se fait la vente d'une femme, de la rendre exempte de l'enfant qu'elle a dans son giron, car cela est un marché abusé, à titre d'ignorer si c'est un mâle ou une femelle, s'il est beau ou laid, s'il est une créature complète ou incomplète, s'il est vivant ou mort, par conséquent cela dévaluera le prix de cette femme». d - Pour le cas ou un homme qui achète un ou une esclave contre cent dinars à terme, puis le vendeur regrette cette vente et demande à l'acheteur de déclarer le contrat nul, en lui payant dix dinars comptant ou à terme, et en considérant les cent dinars comme annulés, Malek a dit: «Cela est valide. Mais si le vendeur regrette et demande à l'acheteur d'annuler l'achat de l'esclave mâle ou femelle , en lui payant dix dinars comptant ou à terme, en surplus, dans une date qui dépasse le terme prévu, cela n'est pas permis. Autrement dit, c'est comme si le vendeur a vendu l'esclave à cent dinars pour une période inférieure à un an, et à dix dinars comptant ou à un terme pour une durée de plus d'un an. Ce qui fait que c'est la vente de l'or contre l'or qui entre en jeu, à terme. e - Concernant l'homme qui vend une esclave à un autre, pour cent dinars, à payer à terme, puis qu'il l'achète à un prix dépassant celui du prix de vente, pour une période au delà de celle du terme, cela n'est pas toléré. Et ceci s'explique par le fait que, soit que l'homme vende l'esclave femelle pour une période bien déterminée, puis qu'il l'achète pour une période dépassant la première, de façon à ce qu'il la vende à trente dinars à un terme d'un mois et qu'il l'achète à soixante à un terme d'un an, ou six mois. Ainsi, c'est comme si sa marchandise lui est revenue telle quelle, et que l'autre homme lui ait donné trente dinars pour un mois, soixante pour un an ou même pour six. Or, ceci n'est pas toléré». Chapitre II Le sujet des biens de l'esclave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		}
	]
}