{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "On rapporta à Malek que Mouhammad Ibn Sirine disait: «Ne vendez pas les grains tant qu'ils sont dans leurs épis avant qu'ils ne soient devenus épais». - Malek a dit: A - Quand un homme achète de la nourriture pour un prix précis, et à un temps bien déterminé, puis que ce temps prenne fin, et que le vendeur dise à l'acheteur: «Je ne possède pas la nourriture que je t'ai promise, ainsi vends-la moi pour un temps déterminé», l'acheteur lui répond: «Ceci n'est pas toléré car l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit la vente de la nourriture avant qu'elle ne soit possédée». Le vendeur de répliquer: «Vends-moi donc cette nourriture pour un temps déterminé afin que je puisse m'en acquitter», ceci est encore interdit car c'est comme s'il lui a donné de la nourriture pour qu'il la reprenne, et l'or qu'il lui avait donné, sera le prix de ce qu'il devait, et la nourriture qu'il lui avait donnée deviendra licite. Une telle transaction, si elle est exécutée, consistera à vendre de la nourriture avant de ne l'avoir possédée». B - Concernant l'homme qui doit une nourriture d'un autre, et que ce dernier le doit pareillement d'un troisième; que le second dise au premier: «tu auras à négocier, au sujet de ta nourriture, avec un autre, qui me doit la même nourriture qui est d'ailleurs de la même valeur que celle que tu me dois». Malek a dit: «agir ainsi, est interdit, car c'est une façon de vendre la nourriture avant qu'elle ne soit possédée. Cependant si la nourriture est déjà possédée , il sera permis qu'il y ait négociation entre le premier et le troisième, car ce cas ne présente plus une action de vendre, pour la bonne raison, qu'il est bien connue, l'interdiction de vendre une nourriture avant qu'elle ne soit possédée. Ceci est, par conséquent, conforme au refus de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) concernant le sujet ci-dessus, alors que les hommes versés dans la religion ont considéré admissibles l'association, la délégation, et la résolution du contrat, quand il est question de la nourriture. Ils ont d'ailleurs assimilé ce cas, à un acte de bien sans qu'ils le prennent pour une vente. Ils ont, à ce titre, donné l'exemple d'un homme qui prête à un autre des dirhams dont le poids est inférieur à la norme légale pour les avoir ultérieurement des dirhams dont le poids est légal; cela est toléré même s'il y a une différence de poids. Mais qu'il s'achète des dirhams d'une qualité inférieure pour en avoir après, d'autres qui sont légaux, cela n'est pas toléré. Il est de même interdit, qu'il prête des dirhams inférieurs à ce qui est légal et compte les reprendre après le temps déterminé, d'autres dirhams d'un poids légal»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		}
	]
}