{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "Malek a rapporté qu'il a demandé Ibn Chéhab au sujet de la vente d'un animal contre deux, à terme? Ibn Chéhab répondit: «Cela est toléré». - Malek a dit: * Ce qui est suivi chez nous (à Médine), c'est que l'on tolère la vente d'un chameau contre un chameau pareil, en payant des dirhams en plus, de main à main. Il est de même toléré la vente d'un chameau contre un autre chameau, et que les dirhams payés en plus, soient versés à terme. Par contre, il n'est pas bon que l'on vende un chameau contre un autre, à terme, et que les dirhams payés en plus soient versés comme somme au comptant. Il n'est pas bon non plus, que le chameau et les dirhams soient livrés à terme». * II est bon que l'on s'achète un chameau de bonne race, échangé contre deux ou plusieurs autres d'une race ordinaire d'un troupeau de chameaux même s'ils sont de la même espèce. Il est même toléré que l'on s'achète un chameau contre deux à terme, pourvu qu'ils ne se montrent à la suite nettement différents, ou au contraire tout à fait semblables, avec la variation ou non de leur espèce, car dans ce cas, il n'est pas convenable de vendre à terme, un, contre deux». * L'interprétation de ce refus, s'explicite par le fait, que cet échange au cours de la vente, d'un chameau contre deux, a montré, qu'il n'y a ni supériorité de race, ni puissance de charge. Ainsi, si ces deux distinctions étaient introuvables, il ne faut pas que l'on s'achète à terme, deux pour un. Mais il est toléré que l'on vende ce que l'on s'est acheté, avant qu'il soit possédé, à un autre que celui chez qui on a acheté, si le prix a été payé à ce dernier». * Celui qui paye d'avance, pour un animal, à terme, et qu'il ait fait la description de cet animal, ceci est toléré. Par conséquent, ceci devient une obligation et pour le vendeur et pour l'acheteur pour avoir fait la description de cet animal. D'ailleurs, une telle façon de marchander, est toujours suivie par les gens, et admise même, par les hommes versés chez nous (à Médine)». Chapitre XXVI Les animaux qu'il est interdit de vendre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1350
			}
		}
	]
}