{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "On rapporta à Malek que Abdallah Ibn Mass'oud enseignait que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) avait dit:«Un vendeur et un acheteur, qui entre eux, ont conclu une vente et se disputent, on tient compte de ce que le vendeur stipule, autrement, le contrat de vente est à annuler». Malek a dit: «Un homme, achete une marchandise, et le vendeur stipule, avant que la vente ne soit conclue, qu'il doit consulter une tierce personne de telle façon que: «Si ce dernier l'agrée, la vente est permise, sinon, il n'y aura plus de vente». Le contrat est conclu entre eux, puis aussitôt après l'acheteur le regrette avant même que le vendeur n'ait consulté, la tierce personne», Malek dit: «Cette vente est une obligation, selon ce qui a été entendu entre eux, par conséquent, l'acheteur n'a pas à choisir, si la troisième personne consultée l'agrée. - Malek a enfin dit: «Qu'un homme s'achète d'un autre une marchandise, puis qu'ils se disputent tous deux le prix, et que le vendeur dise: «Je te l'ai vendue à dix dinars» et que l'acheteur lui répond: «non, je l'ai achetée à cinq», l'on dira, dans ce cas au vendeur: «Si, tu veux, tu peux la lui vendre, au prix qu'il a fixé, ou bien, fais serment de ne la lui vendre que selon le prix que tu viens de le lui dire». Or, si le vendeur fait serment, on dira à l'acheteur: «Soit que tu achètes la marchandise, au prix que le vendeur a fixé, ou que tu fasses serment de ne l'acheter qu'au prix que tu as toi-même fixé». Si l'acheteur fait serment, l'on considère, dans ce cas, que chacun de ces deux l'acheteur et le vendeur, s'accuse l'un l'autre». Chapitre XXXIX Les dettes à usure",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1365
			}
		}
	]
}