{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "Malek a rapporté que Moussa Ibn Maissara avait entendu un homme demander à Sa'id Ibn Al-Moussaiab: «Je suis un homme qui vend à crédit». Alors Sa'id lui répondit: «Ne vends qu'avec ce qui te faut pour rentrer chez toi». - Malek a dit: «Concernant un homme qui achète une marchandise de chez un autre, à condition qu'il la lui livre à une date précise, et cela soit pour une foire où il y souhaite la vendre, soit pour une nécessité au temps désigné puis que le vendeur ne la lui délivre pas à la date prévue, ce qui portera l'acheteur à rendre cette marchandise». A ce propos, Malek a dit: «L'acheteur n'aura pas le droit d'agir ainsi, et il doit verser le prix de la marchandise achetée, car si le vendeur la lui avait délivrée avant cette date, l'acheteur l'aurait acceptée». - Malek a aussi dit: «Pour celui qui achète de la nourriture, et qu'il la mesure ou la pèse, puis arrive quelqu'un chez lui, voulant la lui acheter, or le possesseur de la nourriture lui apprenant qu'il l'avait achetée pour lui-même, et l'ayant même pesée, l'acheteur le croit et veut la lui prendre selon la mesure déjà faite, en payant le prix comptant». Malek à ce propos dit: «Ce qui est vendu selon tel critère, est permis; mais s'il est vendu, selon ce critère à terme, cela est répugné, à moins que l'acheteur ne pèse ou ne mesure, lui-même la marchandise.Cet achat ne doit pas être fait à terme, car, c'est une façon de pratiquer l'usure, encore que, se présente le risque, que la marchandise ne soit pas de la même mesure ou du même poids. Et si cette vente est faite à terme, cela est répugné, Et il n'y a pas de désacord sur ce sujet chez nous (à Médine)». -Malek a ajouté: «Il ne faut pas acheter une dette d'un homme, qu'il soit ou non présent, s'il n'y a pas une déclaration faite de la part de l'endetté, ni non plus d'un mort même si l'on connaît ce que ce mort a laissé, car, le fait d'acheter ainsi, est aléatoire, d'autant plus que l'on ne sait pas s'il est possible ou non de completer cette transaction». Quant à l'interprétation de cette répugnance, elle s'explique comme suit: «Si l'on achète une dette d'un absent ou d'un mort, l'on ne sait pas quel créditeur inconnu est attaché a cette dette, ce. Ainsi, si le mort devait une dette, la somme qui en avait été versée, restera vaine et inutile». - Malek a finalement dit: «Soulignons, aussi, la présence d'un autre vice: C'est qu'il a acheté ce qui n'est pas de garanti pour lui. Et si ce qui est acheté n'est pas livré à l'acheteur, le prix qu'il aurait dû payer, serait vain et invalable. Et c'est encore aléatoire, et cela n'est pas permis». - Cependant, ajouta Malek, il y a une différence entre le fait que l'homme ne vende que ce qu'il possède, et d'autre part, que l'homme fasse avance pour quelque chose qu'il ne possède pas en fait. Celui qui veut s'acheter une marchandise porte son argent, ce par quoi il compte acheter et dit: «que veux-tu que je t'achète d'avec ces dix dinars? Or, agissant tel, c'est comme, s'il les vend comptant pour quinze à terme. C'est pour cette raison, que la vente est considérée comme interdite et est une usure, même une imposture». Chapitre XLI L'association, la délégation (des dettes) et la résiliation",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		}
	]
}