{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «N'allez pas vous mettre devant des caravanes, que l'un de vous ne vende pas à un autre, une marchancise qu'il avait déjà vendue, ne vous adonnez pas à la surenchère, qu'un citadin ne vende pas pour un bédouin, ne laissez pas le lait s'accumuler dans les seins des femelles chamelles et brebis, car celui qui aura acheté l'une d'elles, aura droit en les trayant soit de la garder s'il en sera satisfait, soit de la rendre si elle ne lui plait pas avec un sa' de dattes (en échange contre son lait). En interprétant ce hadith, Malek a dit: «Ce qu'on veut dire par là, et Allah en est le plus informé, du fait qu'il ne faut pas faire de surenchère dans les ventes, qu'il est intolérable qu'un homme surenchère une marchandise, alors que son frère coreligionnaire l'a déjà négociée, et que le vendeur de sa part s'est entendu avec l'acheteur sur le poids de l'or, et a garanti contre tout défaut qui pourrai exister dans la marchandise ,constatant par là que le vendeur ne veut pas donner sa marchandise au deuxième acheteur. Tel est ce que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit, et Allah en est le plus informé. - Malek a ajouté: «Il n'y a pas de mal, dans le marchandage du prix, où toute vente finale sera suspendue, du moment que chacun aura le droit de participer au marchandage. Si les gens délaissaient le marchandage en s'arrêtant au prix que le premier acheteur avait déjà proposé, la marchandise aurait été vendue à un prix vil et les vendeurs seraient endommagés. Et c'est ce qui est toujours pratiqué à Médine»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1380
			}
		}
	]
}