{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"33": "Sharecropping"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 1388
			}
		},
		{
			"hadithnumber": 1388.5,
			"arabicnumber": 1388.5,
			"text": "A propos d'un commandité qui a acheté d'un capital reçu d'un commanditaire, une marchandise, que ce dernier lui impose de vendre ce contre quoi s'oppose le commandité, et qui par conséquent les fait entrer en dispute, Malek a dit: «Il ne faut pas qu'on se mette à l'écoute de l'un sans l'autre, il vaut mieux demander à des experts leurs points de vue; ainsi s'ils jugent que la marchandise devrait etre vendue, qu'elle le soit pour les deux; s'ils pensent qu'il vaut mieux attendre, qu'ils attendent». - Malek a dit: «Dans le cas où un commandité a mis en commerce un capital, qui lui est livré par un commanditaire, et que ce dernier le lui réclame ce à quoi l'autre répond: «Je l'ai en entier»; le commanditaire insistant sur le fait d'avoir son capital, le commandité lui dit: «J'ai perdu de ce capital telle somme, qu'il cite, et je t'ai dit que je l'ai afin que tu le laisses encore avec moi», Malek trouve qu'il faut tenir compte de la première réponse du commandité à savoir où il est dit qu'il possède tout le capital, car il ne lui sert à rien de le renier après, à moins qu'il n'avance des arguments déterminants justifiant la cause de la perte; dans le cas contraire il doit s'acquitter de tout le capital». Il en est de même, poursuit Malek, si le commandité avait fait bénéfice de telle somme; et une fois que le commanditaire lui revendique son capital et son gain, que l'autre lui répond: «En fait je n'ai rien bénéficié, et je ne te l'avais dit que pour que tu me laisses garder ce capital; or là encore, il ne lui est pas bon de se démentir s'il n'avance pas des arguments valables justifiant la cause de la perte». - Malek a aussi dit: «Dans le cas où un commandité, bénéficiant d'une somme lui provenant d'un capital qui lui est livré par un commanditaire, ira dire à ce dernier: «J'ai prie cette somme pour faire du commerce, à condition que je reçoive les deux tiers du bénéfice», et le commanditaire lui répond: «Non,je t'ai versé cet argent pour faire du commerce à condition que tu en ais uniquement le tiers», il faut, dit Malek, être pour ce qui est proposé par le commandité, et il aura à faire serment prouvant sa présomption, à savoir qu'il veut entendre dire que telle est la coutume suivie entre les deux partenaires et qui d'ailleurs est pratiquée par les gens. Autrement, on ne donneras pas d'importance ni à ses paroles, ni à son serment, et il est responsable de remettre le capital au commanditaire avec le bénéfice, selon ce qui est usuelement pratiqué pour une affaire en commandité similaire». - D'autre part, à propos d'un commanditaire qui a donné à un commandité cent dinars, avec quoi il achètera une marchandise. Au moment de payer au vendeur la marchandise, il se rend compte que les cents dinars ont été volés, le commanditaire propose au commandité de vendre cette marchandise, et de prendre le prix de ce qui est vendu plus le bénéfice qui en sortirait, et s'il y a une perte, ce sera au commandité de couvrir l'argent perdu. Or, à cela le commandité répondit:«Plutôt c'est à toit que revient le fait de payer le prix de cette marchandise que j'ai acheté avec ton argent». Malek à ce sujet dit: «En fait c'est au commandité de payer le prix au vendeur, et l'on demande au commanditaire: «ou que tu donnes au commandité les cent dinars et que la marchandise en soit pour vous deux, par conséquent ces nouveaux cent dinars seront un nouveau capital selon les termes du premier contrat, ou que tu abandonnes la marchandise. Ainsi, s'il paie les cent dinars au commandité, cette somme sera considérée un nouveau capital selon les conditions du premier contrat, et s'il refuse, la marchandise est la propriété du commandité et c'est à lui de payer son prix». - Malek a dit finalement: «S'il reste, après l'acquittement du capital et le partage du bénéfice, de la camelote, cela revient au commandité. Et je n'ai pas entendu dire autrement. Mais si ce qui reste est de la valeur d'une bête, ou d'un chameau ou des vêtements d'un tissu grossier, ou ce qui leur est pareil, le commandité aura à les rendre au commanditaire, sauf si ce dernier les lui laisse». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 33 Le Livre du contrat d'arrosage Chapitre Premier Au sujet de l'arrosage",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}