{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "Rabi'a Ibn Abi Abdul-Rahman a rapporté qu'un homme de l'Iraq vint auprès de Omar Ibn Al-Khattab et lui dit: «Je viens te voir pour une question qui n'a pas ni début ni fin»; Omar lui répondit: «Quelle est cette question»? L'homme de répondre: «Les faux témoignages qui sont présents dans notre pays». Omar lui demanda: «Est-ce que c'est vraiment ainsi»? - Oui, répondit l'homme. Alors Omar s'écria: «Par Allah! Nul homme n'est détenu dans un pays de l'Islam, sans le témoignage des hommes justes». j (......) 5 - On rapporta à Malek que Omar Ibn Al-Khattab a dit: «Le témoignage d'un adversaire et d'un accusé, n'est pas admis». Chapitre III Le témoignage de celui qui a subi une peine prescrite - On rapporta à Malek qu'on demanda à Soulaiman Ibn Yassar et à d'autres, au sujet d'un homme, qui ayant subi une peine de flagellation, peut-on accepter son témoignage? Ils répondirent: «Oui s'il a fait preuve de repentir». (......) 6 - Malek a rapporté, qu'en posant la même question à Ibn Chéhab, il répondit pareillement à Soulaiman Ibn Yassar». Malek a dit: «Et telle est la règle suivie à Médine, et il est des paroles d'Allah Béni et Très Haut (le sens): «Frappez de quatre-vingts coups de fouet ceux qui accusent les femmes honnêtes sans pouvoir désigner quatre témoins; et n'acceptez plus jamais leur témoignage; voilà ceux qui sont pervers à l'exception de ceux qui, à la suite de cela, se repentent et se réforment. Allah est en vérité Celui qui pardonne, Il est miséricordieux» (Coran XXIV, 4,5). Malek a encore dit: «Ainsi, ce qui est incontestable, à Médine, c'est que celui qui, a subi une peine de flagellation, et après il s'est repenti et réformé, son témoignage sera admis. Et c'est ce que j'ai de mieux entendu à ce, sujet». Chapitre IV Le sujet du jugement basé sur le serment d'un témoin",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1404
			}
		}
	]
}