{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "On rapporta à Malek que Abou Salama Ibn Abdul Rahman et Soulaiman Ibn Yassar ont été interrogé si l'on pouvait juger d'aprés le serment du plaintif et, un témoin»? Ils répondirent: «Oui». * Malek a dit: Le précédent dans la sounna prescrit que l'on juge d'après le serment du plaintif et le témoignage d'un seul homme, ainsi si le plaintif fait un serment avec son témoin, il est confirmé dans son droit. Ainsi, si le plaintif renonce au serment et le refuse, on demande à l'accusé de le faire, si ce dernier fait serment, il est jugé innocent, et s'il refuse de le faire, cela donne complètement raison au plaintif,». * Cependant cette sounna est suivie pour tout ce qui est des biens privés; ce qui n'est pas le cas pour tout ce qui concerne la délimitation (d'une terre), ni le mariage, ni le divorce, ni l'affranchissement, ni le vol, ni la diffamation. Ainsi, si l'on veut dire: «L'affranchissement fait partie des biens, on aura tort, car s'il en est ainsi, l'esclave et son témoin celui-ci étant présent auraient fait un serment, que son maître l'a affranchi. D'autre part si l'esclave avait fait présenté un témoin, qui atteste qu'il est le propriétaire de l'argent, et qu'ils fassent tous deux serment, il aura pleinement son droit, tout comme le cas d'un homme libre». ' * Ainsi, il est de la sounna suivie à Médine, au cas où un esclave présente un témoin, qui atteste qu'il a été affranchi, de porter le maître de cet esclave à faire serment qu'il ne l'a pas affranchi si cela est fait, ce que l'esclave a prétendu être n'est plus considéré». * II en est de même pour la sounna suivie concernant le divorce, ainsi si la femme présente un témoin, attestant grâce à lui, que son mari l'a divorcé , on portera son mari à faire serment qu'il ne l'a pas divorcé; s'il le fait, elle ne sera pas divorcée». * Malek pousuit et dit:\"Il y a une seule sounna, , concernant le divorce et l'affranchissement, soutenus par le témoignage d'un seul homme; le serment sera fait par le mari de la femme, et par le maître de l'esclave, du moment que l'affranchissement est l'une des lois prescrites et on ne tolère pas à ce sujet le témoignage de la femme, car si l'esclave est affranchi, sa personne sera intègre,et sera de ce fait soumis aux mêmes peines prescrites, tout comme un homme libre; s'il commet l'adultère, alors qu'il est marié, il sera lapidé; s'il tue, il sera tué; il a finalement le droit de faire hériter ses successeurs. Si l'on proteste en disant: «Si jamais un homme a affranchi son esclave, et qu'un autre vint, revendiquer au maître de cet esclave, une dette que ce dernier lui doit, de telle manière, qu'il ait pour témoins, qu'il lui doit une dette, un homme et deux femmes. Au cas où l'esclave ne possède aucun bien, et que l'homme insiste de devoir avoir sa dette, le maître sera porté à tenir cette dette en charge afin de la payer, et par conséquent l'affranchissement ne sera plus considéré. Cet homme qui est venu revendiquer sa dette, a cherché à rendre le témoignage des femmes, un témoignage toléré au sujet de l'affranchissement; or leur témoignage ne tient compte que de la question de la dette. Le cas de cet homme est pareil à celui qui, affranchissant son esclave, un homme vient, soutenu par un témoin, jurant réclamer une dette que lui doit cet esclave. S'il se trouve que cette dette est due, l'affranchissement ne sera plus considéré. Ou encore qu'un homme qui, ayant avec le maître d'un esclave un litige financier, vient prétendre qu'il a une dette que le maître de l'esclave doit le lui payer, l'on dira à ce maître: «Jure que tu ne lui dois pas, ce qu'il prétend avoir chez toi»; s'il renonce et refuse de jurer, l'on demandera au plaintif de faire ce serment, qui, par conséquent, en le faisant, met en preuve qu'il a droit à cette dette du maître de l'esclave. Ce qui fait que l'affranchissement de l'esclave n'est plus considéré, si il est prouvé que le maître doit une dette à l'homme en question». - Il en est de même pour le cas d'un homme qui épouse une esclave; devenu sa femme, le maître de cette dernière vient dire à l'homme: «Tu as acheté mon esclave pour tant de dinars»; le mari reniant cela, le maître de l'esclave fait appel à un homme et deux femmes témoignant et justifiant ses paroles. Ainsi la vente est maintenue, le maître aura son droit, la femme esclave sera illicite pour son mari, et se séparera de lui. Le témoignage des femmes, dans le cas d'un divorce, n'est pas admis». - Un autre exemple: Qu'un homme accuse un homme libre d'une calomnie, ce qui fait qu'il finit par être soumis à la peine prescrite. Il appelle un homme et deux femmes témoignant et certifiant ses paroles que l'homme accusé est un esclave. Ainsi, l'homme qui a tissé la calomnie, fuit la peine prescrite. Le témoignage des femmes n'est plus admis concernant la calomnie». - Ce qui est encore pareil à ce cas, où l'on souligne la divergence entre les juges et qui est de la sounna suivie, c'est quand deux femmes témoignent qu'un enfant est né vivant, et de ce fait, il a droit à l'héritage, et léguera par la suite ses biens à ses successeurs. Si le garçon meurt, et que les femmes qui ont été témoins, se trouvent non accompagnées d'un homme, et n'ayant pas fait serment, et que l'héritage en soit une grande fortune constituée d'or, d'argent, de demeures, de jardins, d'esclaves ou d'autres biens encore, par conséquent les deux femmes qui avaient déjà témoigné, d'un dirham ou de plus ou même de moins leur témoignage n'est pas à considérer, si elles ne sont pas soutenues, par un homme témoin et un serment à faire». - Il y en a, parmi les gens, qui disent, qu'un serment fait par un seul homme témoin, n'est pas considéré, justifiant leur protestation, en s'appuyant sur ce qui est dit par Allah Béni et Très Haut (le sens): «Demandez le témoignage de deux témoins parmi vos hommes. Si vous ne trouvez pas deux hommes, choisissez un homme et deux femmes, parmi ceux que vous agréez comme témoins» (Coran II,282). Malek a dit: «si on ne fait pas appel à un homme et deux femmes pour témoigner l'homme plaintif n'aura droit à rien et par conséquent, on ne doit pas lui demander de faire un serment avec son témoin, l'homme plaintif n'aura droit à rien et par conséquent, on ne doit pas lui demander de faire un serment avec son témoin». Il est de l'argument de celui qui a dit ce hadith, de lui dire: «Que penses-tu d'un homme qui prétend avoir une dette d'un autre, ne demandera-t-on pas à ce dernier de jurer qu'il ne doit rien, ainsi la prétention de l'autre sera refusée; S'il renonce à jurer, on demandera au plaintif de faire ce serment, et alors, son droit sera affirmé. D'ailleurs, cela n'est contesté par personne ni non plus dans aucun pays. Cependant, à quel verset du Livre d'Allah, s'est-il référé? S'il veut bien affirmer cela, qu'il le fasse en désignant son témoin qui fera le serment, même si cela n'a pas été mentionné dans le Livre d'Allah. Et, il est suffisant de suivre la tradition qui a été adoptée par nos ancêtres. Mais l'homme veut bien savoir ce qui est juste et ce qui est argumenté. Et, c'est là une explication de ce qui pourra troubler l'esprit, si Allah le veut». Chapitre V Le jugement concernant l'homme qui meurt et laisse une dette à rembourser et une autre dette qui lui esr due et n'ayant à ce sujet qu'un seul témoin (1431) - Malek a dit: «Quand un homme meurt, et qu'on lui doit une dette, et qu'il n'a à ce sujet qu'un seul témoin, et d'autre part qu'il doit aux gens une dette, n'ayant encore là qu'un seul témoin, puis que ses héritiers refusent de faire, avec leur témoin, un serment, de ne pas devoir une telle dette, on demande aux créanciers de faire serment pour récupérer ce qu'ils doivent. Dans ce cas,s'il reste une partie de la succession, les héritiers n'en auront aucun droit car ils ont été appelés à faire un serment et l'ont refusé, sauf qu'ils disent: «Selon nous, notre défunt n'a rien laissé comme héritage», et l'on se rend compte qu'ils ont refusé de faire un serment à cause de cela. Ainsi, à mon avis, ils doivent faire un tel serment et prendre le reste une fois que la dette est payée». Chapitre VI Le jugement concernant un procès",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1408
			}
		}
	]
}