{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "On rapporta à Malek, que Omar Ibn Al-Khattab ou Osman Ibn Affan, avait jugé le cas d'une esclave, qui invita un homme à l'adultère, en lui disant qu'elle était libre, il se maria avec elle et lui donna plusieurs enfants: «Que l'homme rançonne ses enfants avec ce qui est équivalent». Malek à ce propos, à dit: «Et les rançonner à la valeur de leur prix est plus juste, dans ce cas, si Allah le veut». Chapitre XXII Le jugement relatif au sujet de l'héritage de l'enfant reconnu (1453) -Malek a dit: - Ce que nous suivons chez nous (à Médine), est ce qui s'ensuit: «quand un homme meurt, et que l'un de ses nombreux fils, dise: «Mon père a reconnu tel, être son fils»; cette parenté n'est jamais prise en considération, à partir du témoignage d'une seule personne. D'autre part, celui qui fait une telle reconnaissance, aura à donner de sa part reçue de l'héritage paternel, une part pareille à celui qu'il a reconnu être fils de son père». • Interprétant cela, Malek a dit: «Considérons qu'un homme meurt en laissant deux fils, et une somme de six-cent dinars, où chacun aura trois cent dinars pour part. L'un d'eux, témoignant que son père lui avait, avant sa mort, déclaré que untel est son fils, il devra donner de sa part, cent dinars au fils en question. Une telle somme constitue la moitié de la part de l'enfant reconnu; d'autre part si l'autre frère avait fait le même témoignage, l'enfant devrait avoir encore cent dinars, recevant ainsi sa part complète de l'héritage, et par conséquent sa parenté en serait évidente (soulignons que, l'héritage étant ainsi partagé, chacun aura eu sa part équitable à savoir deux cent dinars). Son cas est similaire à celui d'une femme qui avoue que son père ou son mari, doit une dette, et que les autres héritiers la renient; ainsi, elle devra s'acquitter de cette dette au créancier, proportionnellement à-ce quelle recevra comme part de l'héritage, s'il est fait que la dette reviendra à tous les héritiers: par exemple, si elle hérite le huitième de l'héritage en tant qu'épouse, elle doit s'acquitter du huitième de la dette au créancier; et si elle hérite la moitié en tant que fille unique, elle paiera la moitié de la dette. Telle est la norme que l'on doit appliquer aux femmes reconnaissant la dette». Si encore, un homme avoue pareillement, à la femme, que son père devait une dette quelconque, le créancier est porté à faire un serment avec son témoin, et aura de ce fait toute la dette. Cependant ce cas n'est pas pris au même titre que celui de la femme, du moment que le témoignage de l'homme est toléré; ainsi celui-ci ayant reconnu la dette, l'on demande au créancier de faire un serment avec son témoin, et aura donc tout son droit. Si le créancier reruse de faire ce serment, il aura de l'héritage de celui qui lui a reconnu la dette, une part qui est proportionnelle, à la part revenant au successeur de l'héritage; quant aux autres, ils auraient renié cette dette». Chapitre XXIII Le jugement fait au sujet des mères-esclaves des enfants",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1425
			}
		}
	]
}