{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "• Rabi'a Ibn Abdul Rahman a rapporté que Al-Zoubair Ibn Al-Awam avait acheté un esclave et l'avait affranchi. Cet esclave, avait des enfants d'une femme libre, et Al-Zoubair l'ayant affranchi, lui dit: «Ces enfants sont mes affranchis», et de leur part, les proches de la mère les réclament comme étant des leurs. Portant leurs accusations à Osman Ibn Affan, il donna à Al-Zoubair le droit de les patronner». (......) 22 - On rapporta à Malek, que Sa'id Ibn Al-Moussaiab, demanda au sujet d'un esclave qui a des enfants d'une femme libre, à qui doit-on donner de droit de les patronner? Sa'id répondit: «Si leur père meurt, avant d'être libéré, le droit de leur patronage revient aux proches de leur mère». - Malek a dit: «Ce cas, est à rapprocher, à celui d'un enfant adultérin, qui, rattaché aux proches de sa mère, le patronnent, l'héritent même s'il meurt, et lui payent encore la compensation légale ou le prix du sang au cas où il commettra un crime ou un délit. Cependant si son père le reconnaît (en tant que fils), cet enfant sera rattaché à lui et à ses proches, et de ce fait pourront l'hériter, tout comme ils lui paieront la compensation légale ou le prix du sang, s'il avait commis un crime ou un délit, d'autre part, son père sera soumis à la peine prèscrite (à savoir qu'il sera flagellé». - Malek de continuer: «Il en est de même pour le cas d'une femme libre Arabe, pratiquant l'adultère; si son mari lui porte, à ce sujet, accusation et appelle la malediction sur elle, et ne reconnaît pas le fils mis au monde,. Cependant l'héritage de cet enfant à sa mort, reviendra aux musulmans, après qu'on ait écarté la part de la mère et de ses frères utérins, sauf si le père ne rattache l'enfant en question, à lui. Car cet enfant, avant qu'il ne soit reconnu par son père, il avait été subordonné au patronage des proches de sa mère, vu qu'il n'avait ni appartenance, ni «assaba». Ainsi, grâce à la reconnaissance du père, son appartenance est revenue à son «assaba». - Malek d'ajouter: «ce qui est suivi, chez nous (à Médine), au sujet d'un enfant dont le père est un esclave, et la mère est libre, et qu'il se trouve que le père de l'esclave est libre, c'est que le grand-père, à savoir, le père de l'esclave, peut emporter le droit de patronner des enfants libres, nés d'une femme libre; par conséquent, ce grand-père peut les hériter, tant que leur père est toujours esclave. Cependant sî le père esclave, est affranchi, le droit du patronage des enfants revient aux proches du père, et s'il meurt tout en étant esclave, leur patronage et héritage reviennent au grand-père. Si l'esclave a deux enfants libres, et que l'un d'eux meurt alors que le père est esclave, le grand-père emporte le droit et du patronage et de l'héritage». - D'autre part, au sujet d'une esclave, qui se trouve affranchie alors qu'elle est enceinte, alors que son mari est esclave, puis qu'il soit affranchi après qu'elle ait mis au monde son enfant, Malek a dit: «Le patronage du nouveau-né est du droit de celui qui avait affranchi sa mère, car ce nourrisson aurait été sujet à l'esclavage, si sa mère n'avait pas auparavant été affranchie, d'autant plus, qu'il n'est pas considéré à un même pied d'égalité que celui, qui était toujours dans le giron de sa mère, après son affranchissement; car s'il en était ainsi, et que son père n'est plus esclave, celui-ci emporte le droit de le patronner». - Finalement, Malek a dit: «Pour l'esclave qui demande à son maître de lui permettre l'affranchissement d'un autre esclave qui lui appartient, et que son maître le lui accorde: le droit du patronage revient au maître de l'esclave et non plus à l'esclave qui avait été affranchi». Chapitre XII Le sujet de l'héritage du «Walaa»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		}
	]
}