{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "Malek a demandé Ibn Chéhab, au sujet de la «Saiba»? Il lui répondit: «il peut donner le droit de son patronage, à celui qu'il veut; ainsi s'il meurt, il ne l'accordera à personne, son héritage par conséquent reviendra aux musulmans, à qui il revient de lui payer la compensation légale». - Malek a dit: «Ce que j'ai de mieux entendu au sujet de la «Saiba» c'est qu'il n'est d'appartenance à personne; quant à son héritage, il est du droit des musulmans, à condition, de lui payer, la compensation légale, s'il l'avait à le faire». - Et Malek d'ajouter: «Au cas où l'esclave d'un juif ou d'un chrétien, devient partisan de l'Islam, et que son maître l'affranchit avant qu'il ne soit vendu, le Walaa de cet esclave libéré, revient aux musulmans; et si le juif ou le chrétien, deviennent à leur tour, partisans de l'Islam, le Walaa du libéré ne lui reviendra pas. Mais si un juif ou un chrétien libèrent un esclave, alors qu'il est de leur religion à la suite de quoi, il se sera converti à l'Islam, avant même que ceux qui l'ont libéré à savoir le juif ou le chrétien, se soient eux même encore convertis à l'Islam, le Walaa revient à l'affranchisseur, car ceci lui a été justifié du jour même où il a affranchi». «Saiba» (2) II s'agit de l'esclave, affranchi par son maître, sans qu'il lui accorde le droit du patronage, mais plutôt le donne à l'affranchi. - Malek a finalement dit: «Si un juif ou un chrétien avait un enfant musulman, celui-ci hérite les affranchis de son père juif ou chrétien si l'affranchi s'est montré partisan de l'Islam avant que cela soit suivi par l'affranchisseur; d'autre part l'enfant musulman d'un juif ou d'un chrétien n'hérite pas le Walaa de l'affranchi musulman, du moment que ce Walaa ne revient ni au juif, ni au chrétien, mais à la communauté musulmane». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 39 Le Livre de l'affranchi contractuel et dit «AI-Moukatab» Chapitre 1 Le jugement fait au sujet de l'affranchi contractuel. (1528)1 - Nafe' a rapporté que Abdallah Ibn Omar disait.: «Le moukatab dit encore libéré par contrat, restera toujours tenu pour esclave, tant qu'il aura une certaine somme, qui n'est pas encore versée, du prix de sa libération»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1488
			}
		}
	]
}