{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "Houmaid Ibn Qais al-Makki a rapporté qu'Ibn al-Moutawakel avait un moukatab, qui mourut à la Mecque, laissant à sa charge quelques termes du prix de son affranchissement aussi bien que les dettes qu'il devait aux gens, et laissant encore une fille. Le préfet de la Mecque, tombant dans l'embarras, en voulant juger de cette affaire, il envoya demander par écrit à ce sujet, à Abdul Malek Ibn Marwan, qui à son tour lui répondit par écrit: «Acquitte tout d'abord les dettes des créanciers, puis complète ce qui reste du prix de son affranchissement, et finalement, partage à égalité ce qui reste de ses biens, entre sa fille et son maître». (1) «Le moukatab» se dit de l'esclave, qui doit obtenir de son maître, un affranchissement, ayant conclu avec lui un contrat à titre de quoi il lui versera une somme déterminée et qui s'étend selon les termes de ce contrat. L'on a donné à ce genre de contrat, le nom de «kitaba». - Malek a dit: «ce qui est suivi (chez nous) à Médine, c'est que le maître de l'esclave n'est en aucun cas obligé de conclure un contrat avec son esclave, si celui-ci le lui demande. Et je n'ai pas entendu même aucun imam obliger un maître à conclure un tel contrat avec son esclave. Encore, il m'est arrivé de savoir que, demandé à ce sujet, un homme versé dans la religion de répondre: «Allah Béni et Très Haut a dit (le sens): «…..Rédigez un contrat d'affranchissement pour ceux de vos esclaves qui le désirent, si vous reconnaissez en eux des qualités…..» (Coran XXIV, verset 33), encore cet homme récitait les deux versets suivants (le sens): «….chassez lorsque vous êtes revenus à l'état profane….» (CoranV,2) et: «….lorsque la prière est achevée, dispersez-vous dans le pays, et recherchez la grâce d'Allah » (Coran LXII,10). Interprétant cela, Malek a dit: «Cela, est une tolérance de la part d'Allah, accordée aux gens bien qu'elle n'est pas obligatoire. - Malek a dit: «J'ai entendu quelques hommes versés dans la religion, dire au sujet du verset suivant: «…et donnez-leur des biens que Allah vous a accordés…» (Coran XXIV.33), que l'on sous-entend, que l'homme peut conclure un contrat d'affranchissement avec son esclave, puis peut lui faire une remise d'une somme déterminée à la fin de l'acquittement. C'est d'ailleurs, ce que j'ai entendu, les hommes versés dans la religion, dire et qui a été suivi par les gens à Médine. On m'a même rapporté que Abdallah Ibn Omar avait conclu un contrat d'affranchissement avec son esclave à titre d'une somme qui est de trente et cinq mille dirhams, et à la suite, il lui a fait une remise de cinq mille». - D'autre part Malek a ajouté: «Ce qui est suivi à Médine, au sujet de l'esclave avec qui son maître avait conclu un contrat d'affranchissement, c'est que ce dernier libérera les biens de l'affranchi, ce qui ne le sera pas pour ses enfants, sauf si le maître les avait, encore eux, inclus dans le contrat». - Yahia a rapporté qu'il a entendu Malek dire au sujet du \"moukatab\", qui avait conclu un contrat d'affranchissement avec son maître, tout en ayant à lui une esclave enceinte, dont il ignorait l'affaire, aussi bien que son maître, lors du contrat, que l'enfant une fois né, ne fera pas partie du contrat, et sera de ce fait, esclave du maître; quant à la femme esclave, elle est déjà libérée car, elle était partie intégrante des biens du moukatab». -A propos d'un homme qui, héritant de sa femme morte, aussi bien que le fils de celle-ci, un moukatab, Malek a dit: «Si le moukatab meurt avant qu'il ne se soit acquitté de sa Kitaba, l'homme et le fils se partageront son héritage selon ce qui est prescrit dans le Livre d'Allah; mais si le moukatab avait, au complet, versé le prix de son affranchissement, tout son héritage reviendra au fils sans que rien ne soit donné au mari». - A propos du moukatab qui conclut avec son esclave une Kitaba, Malek a dit: «On vérifie ce contrat, ainsi si cela a été fait de la part du Moukattab pour se montrer aimable à l'égard de son esclave, et pour vouloir lui alléger son œuvre, cela n'est pas toléré. Mais si ce contrat a été fait par désir, ou par besoin d'argent, ou même encore pour avoir l'avantage et l'aide, cela est toléré. -Au sujet de l'homme, qui a conclu avec son esclave (femelle) un contrat, Malek a dit: «Si, pour avoir eu des rapports avec elle, elle est devenue enceinte, elle aura à choisir: ou qu'elle soit la mère de l'enfant, ou qu'elle soit affranchie, une fois sa Kitaba, fût accomplie. S'il se trouve qu'elle n'est pas enceinte, elle est à sa kitaba». - Malek a dit: «ce qui est suivi chez nous (à Médine) au cas où un esclave est d'appartenance à deux hommes, c'est qu'il n'est pas toléré que l'un d'eux conclut une Kitaba, alors que son partenaire veut ou non le lui permettre, du moment que les deux doivent se concerter sur la Kitaba, car ceci constitue pour l'esclave un affranchissement complet. Si, cette Kitaba est faite par l'un des deux partenaires, l'esclave sera à moitié affranchi, et l'on ne peut porter l'autre partenaire à affranchir l'autre moitié; par conséquent, ce sera une contradiction avec les paroles de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) qui a dit: «Celui qui affranchit la part qu'il possède au sujet d'un esclave, doit l'affranchir au complet si cela lui est possible, après avoir fait l'évalution de l'esclave». - Malek de continuer: «si le partenaire ignore la Kitaba de l'autre attendant que l'esclave ait accompli le paiement de sa Kitaba ou même avant, l'on doit lui rendre ce qu'il avait déj à payé, et les deux partenaires se partageront la somme déjà payée entre eux proportionnellement à leur part; par conséquent la Kitaba sera annulée, et l'esclave restera commun aux deux partenaires». - Pour l'affranchi contractuel qui est d'appartenance à deux hommes, et il est fait que l'un d'eux a accordé à l'esclave un délai pour s'acquitter, quant à l'autre, il le lui a refusé, ce dernier est porté, dit Malek, à fixer ce qui est de son droit, surtout si l'esclave meurt, laissant une somme qui ne lui permet pas de s'acquitter totalement». Pour ce qui est toujours de ce sujet Malek a dit: «les deux partenaires recevront ce qui leur est dû, d'une façon proportionnelle, chacun sa part; quant à ce qui est du reste du prix de l'affranchissement qui est à titre d'un surplus laissé par l'esclave, il sera partagé entre les deux partenaires à égalité. Si l'esclave, n'avait pas au complet versé toute la somme, et que celui qui avait refusé de lui accorder un délai ait reçu plus que son partenaire, de la somme en question, le prix de l'esclave sera partagé à égalité entre les deux partenaires, et la somme déjà reçue par l'un des partenaires n'est pas à rembourser, car il ne l'a reçue qu'après la concertation de son partenaire. D'autre part, si l'un des deux partenaires avait fait remise de ce qu'il doit, et que l'autre avait reçu une somme en plus, ce dernier ne doit rien à l'égard du premier qui n'avait d'ailleurs reçu que ce qui lui était dû; quant au prix de l'esclave, il est à répartir à égalité entre les deux. Ce cas est à comparer à celui où l'on a une dette de laquelle un seul débiteur doit s'acquitter à deux hommes où l'un d'eux lui avait accordé un délai, alors que l'autre avait déjà partiellement récupéré ce qui est de son droit, et qu'il est fait que le débiteur fasse faillite; ainsi le créancier qui avait déjà reçu une partie de la dette, ne doit rembourser à l'autre aucune somme». Chapitre II De la garantie du prix de l'affranchissement",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1491
			}
		}
	]
}