{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "On rapporta à Malek que Oum Salama, la femme du Prophète r (Sur lui la grâce et la paix d'Allah) concluait avec ses esclaves, des contrats d'affranchissement, en percevant d'avance, leur prix et en argent et en or». - Malek a dit: «Ce qui est incontestablement suivi au sujet d'un affranchi contractuel, commun à deux maîtres, c'est qu'il n'est pas permis à l'un d'eux, d'affranchir cet esclave, en demandant un prix forfaitaire, sans qu'il ait eu la concertation de son partenaire, du moment que l'esclave en question aussi bien que ce qu'il possède appartiennent aux deux patenaires; par conséquent il n'est pas toléré que l'un d'eux s'empare de quoi que ce soit sans avoir eu le permis de l'autre. Si l'un d'eux allait agir sans qu'il ait eu le permis de l'autre, et qu'il est fait que l'esclave meurt en laissant ses biens, ou encore qu'il soit incapable de s'acquitter de son propre prix, le partenaire qui avait déjà affranchi l'esclave n'aura rien de ses biens, par suite il ne devra rien rendre de ce qu'il avait déjà lui-même eu, à son partenaire, et par conséquent il n'aura aucun droit sur cet esclave. Mais celui qui affranchit son esclave moyennant un prix forfaitaire, en ayant eu le permis de son partenaire, puis que l'esclave se trouve incapable de compléter son contrat d'affranchissement, celui qui l'avait fait affranchir peut, s'il le veut, rendre ce qu'il avait déjà pris et continuera à jouir de son droit sur cet esclave, d'ailleurs, cela lui est permis. Si l'esclave meurt en laissant des biens, le partenaire qui ne l'avait pas encore affranchi aura ce qui est de son droit de ce qui reste du prix de l'affranchissement, quant au reste des biens, il sera partagé entre les deux partenaires, selon la part que chacun a dans cet esclave. Au cas où l'un des deux partenaires a déjà reçu le prix forfaitaire de l'esclave, et que, par contre, l'autre maintient le contrat, puis que l'esclave se trouve incapable, l'on dira au premier: «Si tu veux, tu pourras rendre à ton partenaire la moitié du prix que tu avais déjà reçu, et l'esclave est en commun à vous deux, autrement, l'esclave est de la possession de celui qui tient toujours sur lui le contrat». - A propos de l'esclave possédé par deux partenaires, où l'un d'eux cherche à l'affranchir, moyennant une somme forfaitaire tout en ayant eu le permis de l'autre, qui à son tour demande la même somme prise par l'autre ou plus, et que l'esclave se trouve incapable, Malek a dit: «L'esclave reste de commun aux deux, car le deuxième a reçu ce qui est de son droit; s'il reçoit de moins que la somme reçue par le premier et que l'esclave se trouve incapable, ce qui fait que le premier compte rendre au deuxième la moitié de la différence de la somme qu'il avait déjà eue pourvu que l'esclave en soit possédé à égalité entre les deux, ceci lui est permis; au cas, où il le refuse, l'esclave restera de la possession du deuxième. Au cas où le moukatab meurt en laissant des biens, et que le partenaire qui l'avait déjà affranchi, veut bien rendre à l'autre la moitié de ce qu'il avait obtenue de plus que lui, de telle façon que l'héritage des biens de l'esclave, en soit partagé à égalité entre les deux, il peut le faire. Si, celui qui a maintenu le contrat avait, de sa part, eu la même somme que le premier ou même de plus, l'héritage sera proportionnellement réparti, convenablement aux parts de possession du moment que le deuxième n'avait touché que ce qu'il lui revenait. - Concernant le moukatab, qui est d'appartenance à deux partenaires, et où l'un d'eux l'affranchit en touchant la moitié de ce qui est de son droit, tout en ayant eu le permis de son partenaire, quant à l'autre qui maintient toujours le contrat qu'il touche moins que la somme que le premier avait déjà eue, et que le moukatab se trouve incapable de compléter son contrat d'affranchisement, Malek a dit: «Si le partenaire, qui avait déjà affranchi l'esclave, veut bien rendre à l'autre la moitié de la différence, l'esclave leur appartient à égalité, et s'il refuse de la lui rendre, celui qui maintient le contrat, aura la moitié de la part de son partenaire». Interprétant cela, Malek dit: «L'esclave étant possédé à égalité entre eux, et que tous deux avaient conclu avec lui, un contrat d'affranchissement moyennant une certaine somme, puis que l'un libère l'esclave tout en ayant la permission de l'autre, touchant ainsi, la moitié de sa part, qui est le quart du prix réel de l'esclave, et que ce dernier soit incapable de l'acquittement, l'on dira alors qu premier partenaire: «Tu peux rendre à ton partenaire la moitié de ce que tu avais touché et l'esclave est possédé à égalité par vous deux. Si tu e refuses, celui qui maintient le contrat aura droit au quart du prix et encore la moitié qui lui est propre de l'esclave, ce qui fait qu'il aura en tout les trois quarts de l'esclave, alors que l'autre n'aura eu que le quart, qu'il avait rerusé de rendre». - Pour le moukatab, qui pour vouloir être libéré, ira conclure avec son maître un contrat d'affranchissement, en se prescrivant une dette de ce qui reste du prix de sa libération, et qu'il meurt sans qu'il ait été acquitté de cette dette et devait des dettes aux autres, Malek a dit: «le maître n'a pas le droit de réclamer ce qui est de son droit avant que les créanciers n'aient déjà touché ce qui doit leur revenir et ils auront même la primauté d'en jouir. D'autre part, le moukatab n'a pas le droit de procéder à un tel contrat, s'il a une dette à payer aux gens, devenant ainsi libéré alors qu'il ne possède rien, car les créanciers ont plus que le maître de cet esclave, le droit de réclamer leur dette». Ainsi, ceci, ne lui est pas toléré. - Malek, a finalement dit: «Ce qu'on suit chez nous (à Médine), au sujet d'un homme, qui fait avec son esclave, un contrat d'affranchissement, stipulant ainsi une somme d'or en lui faisant une remise du montant du contrat, s'il lui verse d'avance, il n'y a pas de mal à cela. Cependant certains ont refusé ce genre de contrat, car il est pris au même titre qu'une dette qu'un homme doit à un autre, la lui remettant à condition qu'il s'en acquitte avant l'échéance de la date. Or, ce fait n'est pas effectivement une dette, mais plutôt une somme forfaitaire, que le maître demande d'avance pour l'affranchissement, par conséquent l'esclave aura à jouir des droits de l'héritage, du témoignage et sera même soumis aux peines prescrites tout comme un homme libre. Ainsi, il ne s'agit pas de l'achat d'argent contre argent ou de l'or contre l'or, mais son cas est pareil à celui où un homme dit à son esclave: «Apporte-moi tel et tel dinars, et tu seras libéré», et il lui fait une remise de cette façon. Ou encore que l'homme dise: «Si tu m'apportes moins que tel, tu seras libéré», et là encore, il ne s'agit pas d'une dette bien déterminée; car si la dette était telle, et que l'esclave meurt ou fasse déficit, le maître aurait le droit de réclamer ce qui est de son revenant, des biens de l'esclave, tout comme le feront les créanciers». Chapitre IV Les blessures causées par un moukattab",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1493
			}
		}
	]
}