{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Malek a dit: «Ce qui est suivi chez nous (à Médine), concernant les blessures causées involontairement, c'est que le prix du sang n'est à verser, qu'une fois que le blessé a guéri. Encore, s'il s'agit d'une fracture à la main ou au pied, ou autre membre du corps de l'homme, involontairement causée, puis qu'elle soit guérie, reprenant son état initial, il n'y a pas un prix à payer, mais si cette plaie a causé une déformation ou un enlaidissement, le prix du sang qui est à verser doit être proportionnel à ce qui a été déformé et enlaidi». - Et Malek de poursuivre: «S'il s'agit d'une fracture des os, dont le Prophète r (Sur lui la grâce et la paix d'Allah) avait précisé le prix du sang qui lui est convenable, cela doit être conforme aux prescriptions du Prophète; mais s'il est fait que le Prophète (Sur lui la grâce et la paix d'Allah) n'a pas précisé le prix du sang, et qu'il n'y ait à ce sujet ni une sounna, ni un prix fixe, l'on essaie de donner une sentence convenable». - Malek aussi a dit: «les cicatrices causées par erreur, au corps involontairement, n'exigent pas un prix du sang, si la cicatrice devient saine, reprenant son état initial. Mais, si la citratrice laisse une déformation ou un enlaidissement, on estisme ce qui lui est de convenable comme diya, sauf s'il s'agit d'une «jaifa», qui exige que la dyia en soit le tiers de celle d'un meurtre. Il n'y a pas non plus, continue Malek, une dyia pour le cas d'une «mounakkila»^ qui est tout comme «la moudiha»^. - Malek a finalement dit: «Ce qui est suivi chez nous (à Médine), au cas où un médecin en circoncisant fait couper le gland du pénis, c'est que ceci lui impose une dyia. Et ceci est une des erreurs que doit assumer la'aqila dans ses responsabilités. Il en est de même pour toute erreur commise par un médecin, ou encore qu'il dépasse ses fonctions, sans qu'il le veuille; s'il en est tel, la dyia est exigible». Chapitre VI Le prix du sang de la femme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1558
			}
		}
	]
}