{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Yahia ibn Sa'id a rapporté que Sa'id Ibn Al Moussaiab disait:«Le prix du sang de la femme est du tiers de celui d'un homme, mais la dyia est la même s'il s'agit d'un doigt amputé ou une dent cassée, ou encore des mêmes blessures dites moudiha et mounakkila». (......) 10 - Malek a rapporté que Ibn Chéhab et Ourwa Ibn al Zoubair disaient pareillement à Sa'id Ibn Al Moussaiab au sujet du prix du sang d'une femme, à savoir qu'il est du tiers de celui de l'homme. Et si ce prix atteint déjà le tiers, la dyia sera de la moitié de celle de l'homme». Interprétant ceci, Malek a dit: «Ainsi pour les blessures dites la «moudiha» et la «mounakkila», la dyia est la même que celle de l'homme; mais pour ce qui est de la «jaifa» et la «ma'mouma» , et autres blessures pareilles, soumises au tiers du prix du sang, la dyia de la femme sera la moitié de celle de l'homme». (......) 11 - Malek a rapporté qu'il a entendu Ibn Chéhab dire: «Il est de la sounna qu'un homme causant une blessure à sa femme, qu'il lui paie la dyia convenable à cette blessure, sans qu'il soit soumis à la peine prescrite». - Malek aussi a dit: «Or il en est tel au cas où cette blessure est involontairement causée par l'homme, en frappant sa femme avec un fouet et en lui crevant un œil par exemple». (1) «jaifa»: c'est une blessure atteignant l'intérieur du corps. (2) «mounakkila»: une blessure avec luxation. (3) «moudiha»: une blessure sans fracture. (4) «la m'amouma»: c'est une fracture à la tête atteignant le crâne. - Malek a finalement dit: «Concernant la femme qui a un mari et des enfants qui ne sont ni de ses \"acebs\" ni de son peuple, son mari, surtout si il est d'une autre tribu, n'aura pas à verser un prix du sang au cas d'un délit, ni à l'égard de cette femme, ni à l'égard de ses enfants qui ne sont pas de sa tribu à lui, ni encore à l'égard de ses frères utérins qui ne sont ni de ses \"acebs\" ni de son peuple, car ceux-là ont droit à l'héritage de cette femme. Quant aux proches, ils avaient, et du temps de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), à payer le prix du sang, jusqu'à nos jours. Il en est de même pour les affranchis de la femme dont leur héritage revient aux enfants de la femme même s'ils ne sont pas de sa tribu. Et le prix du sang d'un crime involontairement commis par les affranchis, devra être payé par la tribu de la femme». (2) «l'aceb»: est le mâle qui hérite d'un mort, le reste de l'héritage, après que les réservataires aient eu leur part; ou encore qui hérite tout s'il n'y a pas de réservataires. Chapitre VII Le prix du sang du fœtus",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1560
			}
		}
	]
}