{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Yahia Ibn Sa'id a entendu Soulaiman Ibn Yassar dire: «la moudiha» au visage est traitée pareillement à celle qui est faite à la tête, sauf si elle enlaidit le visage; alors ainsi, on ajoute sa dyia, en tenant compte de la différence entre celle-ci, et la moitié de la dyia correspondant à la tête et elle sera de soixante et quinze dinars. - Malek a dit: «ce qui est suivi à Médine au sujet de la «mounakkila», c'est de donner quinze chameaux à titre d'une dyia. «La mounakkila», poursuit Malek, est la blessure qui fait perdre les os fins de la tête sans atteindre le cerveau; elle peut être aussi bien à la tête qu'au visage». - Malek de dire aussi: «ce qui est suivi à Médine, au sujet de la «maamouma» et de la «Jaifa», c'est qu'elles m'imposent pas la peine prescrite». Et Ibn Chéhab a dit: «la maamouma n'exige pas la peine». - Et Malek interprétant dit: «la maamouma est une fracture pénétrant les os du crâne; et elle n'est considérée que comme telle». - Finalement Malek a dit: «Ce qui est suivi à Médine, c'est qu'il n'y a pas à verser une dyia pour une blessure qui en soit moins grande que la moudiha; en fait la dyia est pour ce qui est de la moudiha et d'une blessure plus grande, car l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) l'avait soulignée dans sa lettre envoyée à Amr Ibn Hazm, où il l'a faite correspondre à cinq chameaux. D'ailleurs les imams d'autrefois et d'aujourd'hui n'ont rien exigé comme dyia à propos de la moudiha». (......) 22 - Yahia Ibn Sa'id a rapporté que Sa'id Ibn Al Moussaiab a dit: «Toute blessure profonde pratiquée dans l'un des membres, exige une dyia équivalente au tiers de celle de ce membre». (......) 23 - Malek a dit: «Ibn Chéhab n'était pas de l'avis (cité ci-dessus); quant à moi, je n'ai pas trouvé qu'on s'est concerté au sujet de la blessure profonde pratiquée dans l'un des membres, mais plutôt c'est à l'imam de trouver un sentence convenable». - Aussi Malek a dit: «Ce qui est appliqué à Médine, c'est de ne considérer une blessure à titre d'une maamouma ou mounakkila ou même moudiha, que si elle est au visage ou à la tête. Mais toute autre blessure faite dans n'importe quelle partie du corps, ne fait appel qu'à une sentence». - Finalement Malek a dit: «je ne conçois pas, pour ce qui est de la mâchoire inférieure et le nez, de les considérer comme faiant partie de la tête, du moment qu'ils en sont séparés, et que la tête en soit à lui, un seul os». (......) 24 - Rabi'a Ibn Abdul Rahman a rapporté que Abdallah Ibn Al Zoubair avait appliqué la loi du talion à un homme qui a causé la mounakkila». Chapitre XI La dyia correspondant aux doigts",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1567
			}
		}
	]
}