{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "On rapporta à Malek que Sa'id Ibn Al Moussaiab et Soulaiman Ibn Yassar disaient: «la moudiha de l'esclave exige une dyia valant la moitié du dixième de son prix». (......) 32 - On rapporta aussi à Malek que Marwan Ibn Al Hakkam décidait au sujet de l'esclave qui fut blessé, qu'il est du devoir de celui qui a blessé, de donner le paiement d'une dyia équivalente à ce qui est de la diminution du prix de l'esclave». * Malek a dit: «Ce qui est suivi chez nous (à Médine), c'est que la dyia payée pour la blessure causée à un esclave, dépend de la nature de cette dernière, tout comme ce qui s'ensuit: * pour la moudiha, une dyia valant le dixième de la moite du prix de l'esclave. * pour la mounakkila, elle est du dixième et la moitié du dixième. * pour la maamouma et la jaifa: chacune est du tiers de son prix. Quant à ce qui est des autres blessures, à savoir tout ce qui peut diminuer le prix de l'esclave, l'on estime, après la guérison de l'esclave, de combien est la différence, entre la valeur du prix de l'esclave après sa blessure, et sa valeur avant qu'il ne l'ait subie. Puis l'on demande à l'auteur de la blessure le paiement d'une dyia équivalente à la différence des deux prix». - Également, au sujet de l'esclave dont la main ou le pied ont été fracturés, après quoi, le membre a guéri, Malek a dit: «En fait, celui qui a causé cette fracture, n'aura rien à payer, sauf si cette fracture cause la diminution du prix de l'esclave, ou encore sa luxation alors ainsi, la dyia à payer sera équivalente a la diminution du prix». - Et Malek de continuer: «ce qui est suivi à Médine, c'est que la loi du talion est appliquée aussi bien aux esclaves qu'aux hommes libres à savoir: une esclave peut être tuée pour un esclave, leurs blessures encore sont pareilles. Aussi, si un esclave tue volontairement un autre esclave, le maître de ce dernier aura à opter: ou qu'il applique la loi du talion à l'esclave, ou qu'il ait à récupérer la dyia, équivalente au prix de son esclave tué. D'autre part, si le maître de l'esclave homicide veut bien payer le prix de l'esclave tué, il pourra le faire, ou encore, il livrera son esclave au maître de l'esclave meurtrier et encore l'autre maître ayant déjà l'esclave meurtrier, n'aura pas à le tuer. Telle est la règle suivie entre les esclaves au cas même où il s'agit d'une main ou d'un pied coupés ou encore d'autre peine tel le meurtre qui est lui aussi soumis à la loi du talion». - Malek a finalement dit au sujet de l'esclave musulman, blessant un juif ou un chrétien, que le maître de cet esclave peut lui payer la dyia pour son faire, ou encore qu'il le livre pour être vendu. Etant tel, l'on donne au juif ou au chrétien, une dyia provenant du prix de l'esclave, ou encore tout le prix afin que la dyia soit payée; mais l'on ne livrera jamais ni au juif ni au chrétien un esclave musulman». Chapitre XV La dyia des gens du Livre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1577
			}
		}
	]
}