{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père, qu'il disait: «L'aqila n'est pas soumise au paiement du prix du sang, quand il s'agit d'un crime volontairement commis; mais ce prix est à payer, si le crime est involontaire». (......) 36 - Malek a rapporté que Ibn Chéhab a dit: «Il est de la sounna de ne plus exiger de l'aquila le paiement du prix du sang d'un crime volontaire sauf si elle veut bien le faire». (......) 37 - Malek a ajouté, que Yahia Ibn Sa'id était du même avis (cité ci-dessus). -Et Malek de continuer que Ibn Chéhab a dit: «Il est de la sounna, au cas où il s'agit d'un meurtre volontaire, et où les parents de la victime se sont désisté, que la dyia soit payée des propres biens du meurtrier, sauf si l'aqila compte le soutenir pour s'acquitter de son gré». - Malek a aussi dit: «ce qui est suivi à Médine, c'est que la dyia n'est pas d'obligation de l'acquitter, sauf au cas où la dyia est du tiers et au delà; étant telle, elle est exigée de l'aqila; si elle est de moins que le tiers, la dyia est payée du propre argent de l'auteur». - Malek a ajouté: «Ce qui est incontestablement suivi à Médine au sujet de qui, l'on accepte le paiement d'une dyia, pour avoir commis un meurtre volontaire ou même pour une blessure causée volontairement, et où les parents de la victime avaient accepté la dyia, c'est que rien n'est exigé de l'aqila sauf si elle ne le fait de bon gré; car en fait le prix du sang, est à payer du propre argent du meurtrier ou de celui qui a causé la blessure, s'il possède l'argent; autrement, ceci reste une dette, de laquelle il devra s'acquitter; par conséquent, l'aqila n'aura rien à payer sauf si elle le désire». - Malek a encore dit: «Rien n'est exigé de l'aqila, au cas où un homme se tue ou se blesse volontairement ou involontairement; d'ailleurs tel est l'avis des hommes versés dans la religion à ce sujet. Et je n'ai jamais entendu quelqu'un dire que l'aqila doit garantir la dyia d'un crime volontaire. Ceci est connu de par les paroles d'Allah Béni et Très Haut dans Son Livre (le sens): «On doit user de procédés convenables envers celui auquel son frère a remis une partie de la dette, et lui-même dédommagera celui-ci de la meilleure façon» (Coran II,178). Cela est interprété comme suit, et Allah est le plus savant: «Celui qui aura pris une partie de la dyia de son frère, qu'il le suive par un acte convenable, et que l'auteur le dédommage charitablement». - «Concernant le garçon ou la femme, commettant un forfait dont la dyia n'est pas au delà du tiers du prix du sang, et que tous deux ne possèdent pas l'argent qui leur est nécessaire, Malek a dit: «En fait, cela doit être garanti de leurs propres biens, d'où l'on prend la somme; mais si ni l'un, ni l'autre ne possède l'argent, le prix du sang sera une dette dont ils auront à s'acquitter, sans que l'aqila n'ait rien à ce propos. D'autre part, le père du garçon n'aura pas à payer ce qui en est du devoir de ce garçon». - Finalement Malek a dit: «Ce qui est incontestablement suivi chez nous (à Médine), au sujet de l'esclave tué, c'est que sa dyia est à évaluer le jour même de son meurtre. Quant à l'aqila du meurtrier, elle ne devra rien de cette dyia de quelque valeur soit-elle, à savoir de moins ou de plus. Car, c'est au meurtrier que revient le fait de dédommager de son propre argent autant que sera la dyia. D'autre part, si le prix de l'esclave est équivalent à la dyia ou qu'il lui soit supérieur ou inférieur, elle sera prise de l'argent du meurtrier, du moment que l'esclave est considéré comme une marchandise parmi d'autres». Chapitre XVII L'héritage de la dyia et de son exécution",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1584
			}
		}
	]
}