{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"48": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Jaber Ibn Abdallah Al-Ansari a rapporté: «Nous quittâmes avec l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) pour l'expédition de «Bani Anmar». J'étais à l'ombre d'un arbre, et voyant l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), je lui dis: «ô Envoyé d'Allah viens te mettre à l'ombre de cet arbre». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) descendit, et je me levai pour chercher dans un grand sac, de quoi manger; trouvant quelques concombres, je coupai un et le donnai à l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) qui me demanda: «D'où avez-vous apporté cela»? Jaber de dire: «Nous l'avons apporté avec nous, en sortant de Médine», et Jaber de poursuivre: «Nous avions un homme, à qui nous donnions ce qui est nécessaire, et qui mène notre troupeau au pâturage. Ainsi, je donnai, à cet homme, dit Jaber ce qui lui est nécessaire, puis il parti à la canicule, ayant mis deux vêtements râpés. «L'Envoyé d'Allah (salallahou alayhi wa salam) r le ragarda et lui dit: «N'a-t-il pas autre chose que ces deux vêtements»? «Certes, oui, répondis-je, il en a deux autres dans le vestiaire, que je lui avais donnés». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «appelle-le, et ordonne-lui de les mettre». J'appelai l'homme pour qu'il mette les deux vêtements, puis il partit. Alors l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «Qu'a-t-il cet homme; que Allah frappe son cou; ces deux vêtements ne sont-ils pas mieux que les autres»? L'homme entendant les paroles de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), dit: «ô Envoyé d'Allah que je meure dans la voie d'Allah». L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit: «Que ça soit dans la voie d'Allah». L'homme plus tard, fut tué dans la voie d'Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1651
			}
		}
	]
}