{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"49": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Anas Ibn Malek a rapporté ce qui suit: «Abou Talha a dit à Oum Soulaim: «J'ai entendu la voix de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) si faible en parlant, et j'y ai reconnu qu'il avait faim; as-tu quelque chose à manger? Elle répondit: «oui», en faisant sortir de chez elle, des galettes d'orge qu'elle couvra de son voile, puis le plaça sous mon bras, et m'envoya chez l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah)»: Anas continua et dit: en le portant à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), je le voyais assis, entouré de ses compagnons dans la mosquée. Je me dirigeait vers lui, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) me dit: «Est-ce Abou Talha qui t'a envoyé»? - «Oui, répondit Anas»; Et l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) de reprendre: «Pour un repas qu'il nous a préparé»? Oui, répondis-je». L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit à ceux qui lui tenaient compagnie: «Allons-y» II partit avec ses compagnons, et moi avec eux jusqu'à ce que je les ai devancés chez Abou Talha, lui apprenant ce qui a eu lieu. Alors Abou Talha s'écria: «ô Oum Soulaim, l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) vient d'arriver avec tout un monde, et nous n'avons pas de nourriture pour leur donner à manger». Elle répondit: «Allah et Son Envoyé le savent mieux que nous». Abou Talha sortit pour la rencontre de l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) et de ses compagnons, afin de les inviter à entrer. L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit à Oum Soulaim: «allez, Oum Soulaim, apporte-nous ce que tu as pour nourriture». Elle lui apporta les galettes que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ordonne de réduire en miettes, sur quoi Oum Soulaim versa de la graisse d'une outre. Puis, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) prononçant la bénédiction qui lui a été inspirée par Allah Y , dit à Abou Talha: «Fais entrer dix d'entre eux»; Abou Talha les fit entrer,ils mangèrent jusqu'à satiété puis sortirent; L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) s'adressant à Abou Talha, lui dit, de nouveau: «Fais entrer dix autres»; eux aussi entrèrent, mangèrent tout comme les premiers puis sortirent; puis L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) donna l'ordre qu'on fasse entrer dix autres, qui à leur tour entrèrent, mangèrent puis sortirent, puis dix autres derniers, jusqu'à ce que tous les hommes aient bien mangé, tout en étant rassasiés; et ils étaient au nombre de soixante et dix ou même de quatre vingt hommes»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1689
			}
		}
	]
}