{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Abou Saib, l'affranchi de Hicham Ibn Zouhra a rapporté: «J'entrais chez Abou Sa'id Al Khoudri, et je le trouvais dans la prière, je m'assieds, en attendant qu'il finisse sa prière. J'entendis un mouvement sous un lit dans sa maison, et ce fut un serpent; je me levai pour le tuer quand Abou Sa'id me fit signe de m'asseoir. Puis terminant (sa prière) il me montra de sa main une maison et dit: «vois-tu cette maison»? - «oui, répondis-je». Et lui de reprendre: «il y avait un jeune homme tout nouvellement marié, qui était sorti avec l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) participant ainsi à la bataille de «Khandaq». Alors qu'il était présent, un jeune homme vint lui dire: «ô Envoyé d'Allah permets moi de revenir chez moi, car je suis nouvellement marié». L'Envoyé d'Allah r (salallahou alayhi wa salam), le lui accorda, il lui dit: «Prends ton arme avec toi car je crains que tu ne rencontres les Bani Kouraiza». Ainsi, en revenant chez lui, le jeune homme trouva sa femme debout entre deux portes; pris de jalousie, il voulait la transpercer de sa lance, elle lui dit: «Ne te hâte pas pour me tuer; entre et regarde ce qu'il y a dans ta maison».En entrant, il vit un serpent enroulé sur son lit; il le fixa du bout de sa lance puis le porta au seuil de la porte. Le serpent remuant toujours au bout de la lance, morda l'homme qui tomba mort. Nous ne savions pas qui fut le premier à mourir, l'homme ou le serpent. On rapporta ceci à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) il dit: «à Médine, il y a des génies qui sont devenus musulmans; ainsi si vous en rencontrez un, donnez-lui un délai de trois jours; une fois qu'il paraîtra après ce délai; tuez-le, car il n'est que le diable». Chapitre XIII Les invocations lors d'un voyage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1795
			}
		}
	]
}