{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"1": "The Times of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "Zaid Ibn Aslam a rapporté: «une nuit, allant à la Mecque, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit halte et chargea Bilal de réveiller les hommes au moment de la prière (de l'aurore). Bilal se coucha ainsi que tous les hommes. Quand le soleil fut déjà du haut, au-dessus de l'horizon, les hommes se réveillèrent tous effrayés; alors, l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) leur ordonna de monter et partir pour sortir de la vallée (où ils se trouvaient) en disant: «un démon se trouve dans cette vallée». Ils montèrent et quittèrent la vallée, puis l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) les ordonna de descendre et de faire leurs ablutions et demanda à Bilal d'appeler à la prière. L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) fit la prière de l'aurore en commun; une fois la prière achevée, et s'apercevant de leur frayeur, il leur dit: «Hommes! Allah a enlevé nos âmes, et s'il le veut, il nous les aura rendues dans d'autres circonstances. Lorsque l'un de vous s'endort sans avoir fait sa prière, ou qu'il a oublié de la faire, qu'il l'accomplisse quand il s'en souvienne, tout comme s'il l'avait accomplie à son heure fixe». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) tourna du côté de Abou Bakr en disant: «le diable vint surprendre Bilal alors qu'il voulait faire la prière, et l'endormit; il ne cesse de le bercer comme une mère qui dodeline son petit». Puis l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) ayant convoqué Bilal, ce dernier lui raconta ce que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) avait dit à Abou Bakr qui s'écria: «Je témoigne que tu es l'Envoyé d'Allah (salallahou alayhi wa salam)» Chapitre VII L'interdiction de faire la prière du midi au moment de la canicule",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		}
	]
}