{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "Abdallah Ibn Abbas a rapporté: «Il y eut une éclipse .alors que l'Envoyé d'Allah (salallahou alayhi wa salam)r (Sur lui la grâce et la paix d'Allah) se trouvait avec les hommes. Il se leva pour prier avec eux, et demeura debout, le temps de réciter environ la sourate «La Vache», puis il fit une longue inclinaison, et releva ensuite la tête pour rester debout dans une durée moins longue que la première fois; il s'inclina ensuite pour un temps moins long que celui de la première inclinaison puis il se prosterna. Après cela, il se leva et demeura debout pour un temps moins long que celui de la première fois, puis s'inclina pour une durée moins longue que celle de la première inclinaison, releva la tête et resta ainsi debout pour un temps moins long que la première fois, puis il s'inclina de nouveau pour un temps moins long que la fois précédente, ensuite il se prostema. La prière achevée, le soleil se dégagea, il dit: «le soleil et la lune sont deux signes d'entre ceux d'Allah, qui ne subissent pas une éclipse à cause, soit de la mort de quelqu'un, soit de sa naissance. Or, si vous assistez à ce phénomène, invoquez Allah»? On lui demanda: «Ô Envoyé d'Allah nous t'avons vu prendre quelque chose de ta place, puis tu t'es reculé»? Il répondit: «Je viens de voir le Paradis et j'ai voulu cueillir une grappe de ses raisins. Or, si je l'avais prise, vous en auriez mangé tant que le monde existe. J'ai vu également l'Enfer, et je n'ai jamais vu un spectacle aussi horrible que celui que j'ai vu aujourd'hui. J'ai vu que les femmes étaient de majorité en Enfer». On lui demanda: «pourquoi cela, ô Envoyé d'Allah»? Il répondit: «à cause de leur infidélité». On répliqua: «Seraient-elles infidèles à Allah»? Il rétorqua: «elles sont infidèles à leurs maris et elles sont ingrates. Si tu fais du bien à l'une d'elles toute la vie, et qu'elle voit ensuite de ta part une chose qui lui déplait, elle s'écriera: «Je n'ai jamais reçu de toi la moindre chose»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		}
	]
}