{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"15": "The Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "Ourwa a rapporté que Omar Ibn Al-Khattab, étant en chaire, il récita une sourate où il y a eu une prosternation, dans un jour de Vendredi, puis descendit, fit une prosternation et les hommes firent de même. Omar récita la même sourate un autre jour de Vendredi, et comme les hommes s'apprêtèrent à se prosterner, il leur dit: «Doucement, Allah ne nous a pas prescrit cette prosternation à moins que nous voulons la faire». Il ne s'est pas prosterné et il a empêché les hommes de la faire». Malek dit: «L'imam n'a pas à quitter sa chaire pour faire une prosternation quand il récite un verset qui l'exige». Malek a dit: «nous considérons qu'il y a dans le Coran onze prosternations dont aucune ne se trouve dans les sourates du «Moufassal». Et Malek a dit: «Il ne convient à personne de réciter, après les prières de l'aurore, et de l'asr, du Coran renfermant une prosternation parce que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit toute prière faite après celle de l'aurore jusqu'au lever du soleil et après celle de l'asr jusqu'à son coucher. Et comme la prosternation fait partie de la prière, il est inconvenable de réciter du Coran, où il y a une prosternation en ces deux moments». On demanda à Malek au sujet de celui qui récite du Coran où il y a une prosternation alors que sa femme a ses menstrues: doit-elle se prosterner»? Il répondit: «ni l'homme, ni la femme n'auront à se prosterner, que quand ils sont en état de pureté». On demanda à Malek, , au sujet d'une femme qui récite du Coran, où il y a une prosternation, alors que son mari est à l'écoute; doit-il se prosterner avec elle II répondit: «Il n'aura pas à se prosterner, car à vrai dire; la prosternation n'est d'exigence que lorsque l'homme se trouve avec d'autres en présidant la prière, alors il récite le verset où il y a une prosternation, il se prosterne et les hommes la font avec lui. Mais au cas où un homme entend un tel verset récité par un autre qui n'est pas son imam, il ne doit pas faire la prosternation. Chapitre VI Les deux sourates «al-Ikhlas et al-Mulk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 485
			}
		}
	]
}