{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "Al-Kassem Ibn Mouhammad a raconté: «Une de mes femmes mourut; Mouhammad Ibn Ka'b Al-Quorzi vint me consoler et dit: «Parmi les hommes de Bani Israël, il y avait un homme versé dans la religion et un adorateur d'Allah. Il avait une femme dont il était émerveillé et l'aimait à la folie. Cette femme mourut, et son mari éprouva pour elle un grand chagrin et une peine insupportable à un tel point qu'il se renferma chez lui, s'isola des gens et nul n'entrait chez lui. Une femme entendant parler de lui, vint le trouver en disant: «J'ai besoin de lui, afin qu'il me conseille pour une affaire qui me préoccupe et rien ne me convaincra qu'un entretien direct avec lui». Les gens quittèrent la maison de cet homme, quant à la femme, elle resta à sa porte. On fit savoir à l'homme qu'une femme vint le consulter au sujet d'une affaire personnelle et insiste à te voir personnellement; alors que les gens étaient partis, elle resta, ne quittant pas la porte». L'homme dit: «Qu'elle entre». Elle entra chez lui et dit: «Je viens te demander ton avis sur un problème»; il lui demanda: «quel est ce problème»? Elle reprit: «J'avais emprunté de ma voisine des bijoux que je portais souvent et depuis longtemps, même je les prêtais quelquefois. On vient maintenant réclamer les bijoux, devrai-je les leur rendre»? Il rétorqua: «Par Allah! Oui». Elle reprit: «Mais, ça fait longtemps, que je les ai fardés»! Il lui répondit: «Ils ont, maintenant, plus de droit de les réclamer, du moment qu'ils te les ont prêtés depuis un bon temps»! La femme dit alors à l'homme «Que Allah te fasse miséricorde! Tu regrettes d'avoir rendu à Allah, ce qu'Il t'a prêté; puis qu'Il le reprenne, bien qu'Il en ait plus de droit que toi»? L'homme pensa aux paroles de la femme, se rendit compte de son état, et d'Allah qui fit que ces paroles soient d'une grande utilité pour lui». Chapitre XV De ceux qui fouillent les sépulcres",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 562
			}
		}
	]
}