{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "Yahia a rapporté que Malek a dit: «S'il y a un mélange de deux troupeaux, et un seul berger, et où il y a un seul étalon, un seul pâturage et un seul seau, les propriétaires de ce troupeau mélangé, sont des associés même si l'on peut déterminer la part de chacun. Par contre, si l'on ne connaît pas la part de chacun, ils ne sont pas des associés mais des co-propriétaires». Malek a dit: «au cas où les propriétaires sont de commun, la zakat n'est exigible que lorsque la part de chacun est déterminée être à ce titre. Cela s'interprète de la façon suivante: «Celui qui en est possesseur de quarante moutons, il doit la zakat; quant à l'autre qui en a de moins, la zakat ne lui est pas d'obligation. Au cas, où chaque part est redevable d'une zakat, on peut ré unir les deux parts, pour ne percevoir qu'une zakat. A prendre pour exemple ce qui suit: Si l'un a mille moutons ou moins, et l'autre quarante ou plus, ils sont des propriétaires communs et chacun paye la zakat correspondant à sa part; pour le cas des mille et des quarante chameaux, leurs propriétaires communs réagiront comme ceux qui possèdent des moutons et où chacun paiera la zakat convenable à sa part, si celle-ci est redevable d'une zakat; car l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «La zakat n'est pas à payer pour le nombre de chameaux de moins que cinq»; et Omar Ibn Al-Khattab a dit: «Pour moins que quarante moutons, la zakat n'est pas payable». Malek a dit: «c'est, à ce sujet, de ce que j'ai, de mieux, entendu dire». Malek a ajouté: «Omar Ibn Al-Khattaba a dit: «De ne jamais réunir deux parts, et de ne pas non plus séparer deux parts, à cause de la zakat», en parlant de ceux qui possèdent des troupeaux. Pour préciser beaucoup plus: «De ne jamais réunir deux parts séparées»; à supposer qu'il s'agit de trois personnes, et que chacun est possesseur de quarante moutons; dans ce cas, la zakat que doit chacun est d'un mouton. Par ailleurs, si les trois personnes avaient réuni leur possession, ils peuvent dupant par là, le collecteur, faire qu'un seul mouton soit de zakat; or cela, est catégoriquement interdit». Tel est ce qui est à entendre de par les paroles de Omar Ibn Al-Khattab: de ne jamais réunir deux parts, et de ne pas non plus séparer deux parts»; et «c'est ce que j'ai entendu de mieux, dire», dit Malek. Chapitre XIV De ce qui est dit de la zakat des chèvres",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 601
			}
		}
	]
}