{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "Malek a rapporté qu'il s'est renseigné au sujet de la zakat des olives, auprès de Ibn Chéhab qui lui répondit: «elle est du dixième». Malek a dit: «la zakat prévue pour l'olive, est du dixième, mais après l'avoir pressé, et que la quantité soit de cinq «Wasqs» et au-delà; si elle est de moins, la zakat n'est plus de droit. Et les oliviers sont considérésr comme les palmiers, au sujet de l'arrosage: que la terre plantée d'oliviers soit arrosée par la pluie et les sources d'eau, la zakat, est là du dixième; arrosée par l'eau puisée des puits ou autres, elle est à la moitié du dixième; pour les oliviers, il n'y a pas à les estimer, alors que les olives sont toujours sur les arbres». Pour ce qui est des grains que les gens réservent pour les manger par la suite, la zakat est du dixième si la terre est arrosée par la pluie ou les sources d'eau; elle est de la moitié du dixième si l'arrosage se fait par de l'eau apportée. On doit tenir compte, que le poids soit de cinq «Wasqs» selon le «sa'» du Prophète (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), Malek a dit, et toujours au sujet des grains, que ce qui en est soumis, ce sont les genres suivants: froment, orge, soult (genre d'orge), maïs, mil, riz, lentille, vesce, haricot, sésame et autres genres qui leur sont similaires, et sont d'usage alimentaire. Cependant la zakat, prévue pour ces grains, est de droit, une fois qu'ils sont moissonnés et décortiqués. Et, les gens sont de payables à cette zakat, et l'on accepte d'eux tout ce qu'ils donnent». Et, on demanda à Malek le temps, où la zakat des olives, qui est soit du dixième ou de la moitié du deuxième, est à payer; est-ce avant ou après la réduction des frais d'entretien? Il répondit: «on n'a pas à considérer les frais dont les propriétaires se chargent, tout comme le cas de la nourriture et l'on ne s'intéresse qu'à ce qui est de déclaré. Celui, chez qui le poids des olives est de cinq «Wasqs» et au-delà, la zakat est du dixième de l'huile, après que l'olive ait été pressée; si le poids est de moins, la zakat n'est pas à remettre». Malek a dit: «Celui qui vend sa récolte de grains après qu'ils soient devenus secs, indemnes et gardés dans leurs enveloppes, doit lui-même payer la zakat, et non pas l'acheteur. Et les grains ne peuvent être vendus qu'après s'être asséchés dans leurs enveloppes, et sans qu'ils aient encore besoin de l'eau, pour les arroser». Malek a dit, «pour le verset: «Payez-en les droits le jour de la récolte» Coran VI, 141, en l'interprétant: c'est à propos de la zakat, qui est à payer, et c'est dit-il, «ce que j'ai bien entendu dire de plusieurs». Malek finalement a dit: «Celui qui vend son jardin, ou son terrain, qui donne des récoltes, ou à arbres fruitiers, mais, au temps où les fruits ne sont pas mangeables, c'est à l'acheteur de payer la zakat. Au cas, où les frruits sont devenus mangeables, le vendeur doit cette zakat à moins que cela en convient à l'acheteur». Chapitre XXI Les fruits exempts de la zakat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 610
			}
		}
	]
}