{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "On rapporta à Malek, que Omar Ibn Abdel Aziz avait écrit à ses gouverneurs: «De remettre les impôts aux tributaires qui ont embrassé l'Islam». Malek a dit: «Il est de la sunna, de ne pas imposer l'impôt ni aux femmes des gens du Livre, ni à leurs enfants, et qu'il soit d'obligation pour les hommes pubères. D'autre part, la capitation n'est pas perçue de ceux qui sont protégés par les musulmans, ni des mages, pour ce qu'ils possèdent de propriétés tels les palmiers, les vignes, les plantations, les troupeaux, car, l'aumône n'a été en principe voulu des musulmans, que dans le but de les purifier, et de la donner aux pauvres, Et cette capitation a été imposée aux gens du Livre pour les humilier, ils ne devaient, dans leurs pays, aucun tribut sur leurs propres biens, car ils ont conclu un pacte de soumission, que s'ils font des transactions commerciales dans les pays des musulmans, qui est d'ailleurs leur fin, on perçoit le dixième de leurs transactions. En outre, la capitation, leur a été imposée, et ils l'ont acceptée, afin qu'ils demeurent dans leur pays et le défendent contre l'ennemi. Si l'un d'eux quitte son pays, pour un autre où il pratiquera le commerce, il doit le dixième de ses transactions. Il en est de pour ceux qui sont de l'Egypte et qui quittent pour la Syrie, ceux de Syrie pour l'Irak, ceux de l'Irak pour la Médine, ou pour le Yemen ou autres pays (des musulmans), tous ont à payer le dixième. Il est de la tradition, que les gens du Livre n'ont aucune zakat, ainsi que les Mages, dans leurs biens, leurs troupeaux, leurs fruits et leurs plantations. Ils peuvent même garder leurs religions, sans qu'ils soient obligés de les renier. Mais, tant qu'ils ont à faire le commerce dans les pays musulmans, ils doivent payer le dixième de leurs transactions, car cela ne forme pas une clause du pacte qu'ils ont conclu, ni une faveur qui leur a été accordée. C'est ce que j'ai bien vu, appliquer par les Ulémas de Médine». Chapitre XXV La dime perçue de ceux qui jouissent de la protection des musulmans",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 619
			}
		}
	]
}