{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 660,
			"arabicnumber": 660,
			"text": "• Sa'id Ibn AI Moussaiab a rapporté qu'un bédouin arriva chez l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en se frappant la poitrine, en tirant ses cheveux et disant: «Je suis perdu». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui demanda: «qu'as-tu»? «Je viens d'avoir des rapports charnels avec ma femme alors que je jeûne au mois de Ramadan» répondit l'homme. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui dit: «Es-tu capable d'affranchir un esclave» Non», répondit l'homme. «Es-tu capable de sacrifier une chamelle»? - «Non» répondit l'homme. «Assis-toi, donc»; on apporta, à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à ce moment un couffin de dattes; il le donna à l'homme lui disant: «Prends cela, et fais-en une aumône». Le bédouin dit: «Nul, n'en a besoin, plus que moi». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «manges-en, mais à jeûner un jour à titre d'expier ce que tu as commis». -Ata demanda à Sa'id Ibn Al Moussaiab: «quel était le poids des dattes contenues dans ce couffin»? Il lui répondit: «une affaire de quinze à vingt sa's». Malek a dit: «J'ai entendu les hommes versés dire: «Celui qui, pour avoir eu des rapports charnels avec sa femme, ou pour une autre cause, a rompu un jour de jeûne au mois de Ramadan, n'aura pas à faire expiation, comme d'ailleurs, cela a été mentionné par l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet de celui qui a eu déjà des rapports durant le jour; mais il aura à compenser ce jour, dans d'autres mois de l'année». C'est ce que, j'ai entendu de mieux dit à ce sujet. Chapitre X Celui qui à l’état de jeûne pratique une saignée",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 660
			}
		}
	]
}