{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"19": "I'tikaf in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 696,
			"arabicnumber": 696,
			"text": "Aicha a rapporté: «Voulant faire sa retraite spirituelle (itikaf) , l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) se rendit au lieu de sa retraite, et il fut surpris de la présence des tentes dressées, entre autres, la tente de Aicha, et celle de Hafsa. En les voyant, il alla se renseigner, et on lui dit: «Celle la est la tente de Aicha, cette autre de Hafsa, et finalement celle de Zainab». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «Vous croyez que vous faites par là une œuvre pieuse?»; puis il quitta l'endroit sans débuter sa retraite, et la fit plus tard dans une décennie du mois de Chawal». On demanda à Malek, à propos d'un homme qui s'est rendu à la mosquée, pour la retraite spirituelle dans la dernière décennie du mois de Ramadan; il y demeura pour un ou deux jours, puis tomba malade, et quitta la mosquée. Doit-il faire la retraite pour ce qui lui reste des dix jours, s'il est guéri, ou est-il dispensé»? Malek répondit: «Il doit s'acquitter des jours de la retraite qui lui restent, s'il est guéri à Ramadan, ou même après, ci ce mois prit fin. Et on m'a rapporté, que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) voulait faire une retraite spirituelle au mois de Ramadan, puis il est rentré sans l'accomplir, de telle sorte que, une fois que ce mois ait pris fin, il parti faire sa retraite de dix-jours au mois de Chawal». D'autre part, celui qui, volontairement fait une retraite spirituelle, et celui qui a à s'en acquitter, sont pareils concernant ce qui leur est de rituel à suivre, ou de non rituel. Et on ne m'a pas rapporté que le volontariat de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet de la retraite spirituelle n'était que surérogatoire». Au sujet de la femme, qui faisant sa retraite spirituelle, au cours de quoi, elle a eu ses mentrues, Malek a dit: «Elle doit rompre sa retraite et rentrer chez elle; elle fera sa lotion de purification, et sera de nouveau à la mosquée du moment qu'elle s'est purifiée; ainsi, elle continuera, les jours qui lui restent de sa retraite en tenant compte des jours de ses menstrues. C'est le cas pareil d'une femme, qui a à jeûner pour deux mois successives; ayant ses menstrues, elle se purifiera puis poursuivra son jeûne en considérant les jours qu'elle avait déjà jeûnés; et mieux vaut qu'elle ne les tarde pas»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 696
			}
		}
	]
}