{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 756,
			"arabicnumber": 756,
			"text": "Rabi'a Ibn Abdallah Ibn Al-Houdair a rapporté qu'il a vu, en Iraq, un homme se comportant en pèlerin. Il a demandé à son sujet, les gens qui lui dirent: «Il a ordonné qu'on lui orne son animal sacrifié, et dès lors il s'est comporté tel». Rencontrant Abdallah Ibn Al-Zoubair, je lui rapportai ce qui a été dit; il s'écria: «C'est une innovation; et je le jure au nom du Seigneur de la Ka'ba». On demanda à Malek au sujet d'un homme qui lui-même amène son offrande en lui faisant une saignée et en l'ornant à Zoul-Houlaifa, sans qu'il ne soit en état d'ihram qu'à son arrivée à Al-Jouhfa? Il répondit: «Je n'aime pas cela, et je ne pense pas que cet homme at suivi ce qui est traditionnel, car il n'est pas permis de faire cela sauf à un homme qui orne sa bête pour le sacrifice, en lui faisant une saignée lors de la talbiat, et qui ne compte pas faire le pèlerinage, et dans ce cas il l'envoie et demeure avec les siens». On demanda aussi à Malek, à propos de l'homme qui apporte la bête victime sans qu'il ne soit encore en état d'ihram»? Il répondit: «Il n'y a pas de mal à cela». Et on lui demanda encore pour la question de l'homme qui ne veut effectuer ni le pèlerinage, ni la visite pieuse; doit-il être en état d'ihram pour orner la bête sacrifiée, car cette affaire a créé un débat entre les gens»? Il répondit: «Nous aurons à suivre, le hadith rapporté par Aicha, la mère des croyants, où il est dit que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) avait envoyé sa bête sacrifiée puis il demeura sans s'interdire des choses que Allah lui a rendues licites jusqu'à ce que la bête soit sacrifiée». Chapitre XVI Ce que doit faire celle qui a ses menstrues au cours du pèlerinage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 756
			}
		}
	]
}