{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "Hicham Ibn Ourwa a rapporté que Sawda bint Abdallah Ibn Omar était chez Ourwa Ibn Al-Zoubair. Elle allait, à pieds, faire le parcours entre Al-Safa et Al-Marwa pour un pèlerinage ou pour une visite pieuse. Comme elle était une femme obèse, elle arriva au moment où les gens venaient achever la prière du soir, sans qu'elle ait déjà terminé le parcours, que lorsqu'on fit appel à la prière de l'aurore. Son parcours fut complété entre la prière du soir et celle de l'aurore (le soir et la nuit)». Ourwa voyant les gens faire le parcours, assis sur leur monture, le leur interdisait. Eux prétendant, par honte, être malades, Ourwa nous disait en secret: «ceux-ci ont échoué, et sont perdus». Malek a dit: «Celui qui, au cours d'une visite pieuse, oublie le parcours entre Al-Safa et Al-Marwa, et ne se le rappela qu'une fois éloigné de la Mecque, il doit revenir et faire ce parcours. Et s'il a eu des rapports avec sa femme .qu'il revienne faire le parcours entre Al-Safa et Al-Marwa, pour qu'il complète tous les rites de la visite pieuse; puis il doit refaire une autre visite pieuse l'année qui suit, et sacrifier une offrande». On demanda à Malek au sujet d'un homme, qui, rencontrant un autre, au cours entre Al-Safa et Al-Marwa, s'arrête pour s'entretenir avec lui»? Il répondit: «Cela ne m'est pas plaisant». Malek a dit: «Celui, qui oublie le nombre des tournées processionnelles effectuées autour de la Maison., ou qui s'en doute du nombre, et ne s'en rappelle qu'en faisant le parcours'entre Al-Safa et Al-Marwa, il doit rompre son parcours, pour compléter les tournées processionnelles, qu'il a manquées, autour de la Maison, en considérant les tournées déjà accomplies, puis fera deux raka'ts après les tournées, et il recommencera son parcours entre Al-Safa et Al-Marwa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 831
			}
		}
	]
}