{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "Ata Ibn Abdallah Al-Khourassani a rapporté: «J'étais au marché de «Al-Bouram» à Koufa, un vieil homme me rapporta que Ka'b Ibn Oujra lui a raconté ce qui suit: «L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) vint me trouver, alors que je ravivifiais le feu au-dessus d'une marmite, pour mes compagnons. Les poux grouillaient dans ma tête et ma barbe. L'Envoyé d'Allah (salallahou alayhi wa salam), r me prit de mon front et me dit: «Va raser ces cheveux, et jeûne pour trois jours, ou fais manger six pauvres». Et l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) savait que je ne possédais pas une victime à immoler». Malek a dit: «Pour le rachat du délit, il consiste dans le fait que personne ne doit se racheter avant qu'il n'ait accompli, ce qui exige un rachat. Quant à la réparation, elle n'est de devoir que lorsque le sujet est obligé de s'en acquitter; et il peut effectuer l'expiation, là où il veut, à la Mecque ou ailleurs, en optant soit pour le sacrifice, ou le jeûne ou l'aumône». Malek a ajouté: «Celui qui est en ihram, ne peut ni s'épiler les cheveux, ni se les raser, ni se les raccoucir, avant qu'il ne quitte l'ihram. Mais s'il subit une maladie à la tête, (dans ses cheveux), il doit, comme Allah l'a ordonné, se racheter. Il ne peut, se couper les ongles, ni tuer les poux, ni les ôter de la tête et les jeter sur terre, ni se débarasser des poux de sa peau, ni de ses habits. Si celui qui est en ihram se débarasse de ces insectes, qu'il donne à manger une poignée de nourriture». Malek finalement a dit: «Celui qui s'épile le nez ou les aisselles, ou se couvre le corps des produits d'épilation, ou se rase par nécessité la tête à cause d'une plaie, ou se rase le cou pour une saignée au moment où il est en ihram, et cela par oubli ou par ignorance, il doit, par compensation se racheter. Il ne doit pas se raser la tête pour pratiquer une saignée; par conséquent, celui qui, par oubli, se rase la tête avant de jeter les cailloux, il doit un rachat». Chapitre LXXIX Ce que l'on doit faire au cas où l'on oublie un rite",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 942
			}
		}
	]
}