{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Abou Katada Ibn Rib'i a rapporté ce qui suit: «Nous sortîmes avec l'Envoyé d'Allah (salallahou alayhi wa salam),r l'année de Hounain. Les musulmans entrèrent dans un combat acharné avec l'ennemi. Je vis un des ennemis sur le point de tuer un musulman. Je me tournai vers lui et je l'attaquai par derrière en lui donnant un coup de sabre sur la carotide. Il me fit face et me pressa d'une façon que j'allais sentir le mort puis me lâcha et tomba mort. Je croisait Omar Ibn Al-Khattab, il me dit: «Qu'ont-ils les hommes»? Je lui répondis: «C'est l'ordre d'Allah». Les hommes revenus, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) leur dit: «Celui qui a tué un ennemi, en prouvant cela, il aura ses dépouilles». Puis je me levais et dis: «Qui peut être mon témoin»? Puis je m'assieds. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) reprit sa question: «Celui qui a tué un ennemi, en prouvant cela, il aura ses dépouilles». De nouveau je me levai pour dire: «Qui peut être mon témoin»? Puis je m'assieds. Enfin pour la troisième fois, l'Envoyé d'Allah (salallahou alayhi wa salam), r reprit la même question; me levant, il me dit: «Qù'as-tu donc, ô Abou Katada»? Je lui racontai la scène, un homme se leva et dit: «C'est vrai, ô Envoyé d'Allah, et les dépouilles du mort sont chez moi. Fais-donc qu'il soit satisfait de ce qu'il en a de droit». Abou Bakr se leva et dit à l'homme: «Non! Par Allah! L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ne fera pas tort à un des lions d'Allah qui a combattu pour Allah et son Envoyé, qu'il te donne ses dépouilles». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) s'écria alors: «Abou Bakr a dit la vérité» puis s'adressant à l'homme, il lui dit: «Remets-lui ces dépouilles». L'homme me donna les dépouilles et en vendant la cuirasse, je me suis acheté avec son prix un jardin chez Bani Salama; et tel fut le premier bien que j'ai bénéficié de l'islam»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 976
			}
		}
	]
}