{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1071,
			"arabicnumber": 1071,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Sizden biriniz veya ölü kabre konulunca simsiyah mavi gözlü iki melek ona gelir onlardan birine münker diğerine nekîr denilir. O iki melek şöyle derler: Bu Muhammed denilen adam hakkında ne dersin? O kimse ise ölmeden önce söylediğini aynen tekrar ederek: O Allah’ın kulu ve Rasûlüdür. Ben şehâdet ederim ki Allah’tan başka gerçek ilah yoktur. Muhammed’de onun kulu ve elçisidir. O iki melek derler ki: Senin böyle söyleyeceğini biliyorduk. Sonra o kabir yetmiş arşın kadar genişletilir ve aydınlık hale getirilir ve rahatça yat uyu burada denilir. O kimse bu durumu benim aileme dönüp haber verebilir miyim? Deyince o iki melek; gelin güvey gibi rahatça uyu gelin güveyi olan kimseyi ailesinden en çok sevdiği kimse uyandırır derler. O kişi o kabirde mahşer için diriltilinceye kadar rahat rahat uyur. kabre konulan kimse münafık ise Muhammed (sallallahü aleyhi ve sellem) hakkında sorulan soruya; İnsanların peygamber dediklerini duydum bende aynen öyle söyledim, gerçek midir? değil midir? bilemiyorum diyecek. Bunun üzerine o iki melek; senin böyle söyleyeceğini biliyorduk derler. O kabre, sıkıştır onu denilir, kabirde onu sıkıştırır da kaburga kemikleri yerlerinden oynar. Allah onu böylece mahşer günü uyandırıncaya kadar azab etmeye devam eder.” (Nesâî, Cenaiz: 114; Buhârî, Cenaiz: 86) konuda Ali, Zeyd b. Sabit, İbn Abbâs, Berâ b. Âzib, Ebû Eyyûb, Enes, Câbir, Âişe, Ebû Saîd’den de kabir azabıyla alakalı hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 107
			}
		}
	]
}