{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "Bu olaya delil olabilecek bir hadiseyi Mahmûd b. Gaylân şöyle aktarır. Ebû Dâvûd’tan aktarıldığına göre, Şu’be şöyle haber vermiştir. Sûfyân es Sevrî’den işittim Ebû İshâk’a şöyle sormuştu: “Ebû Bürde’nin Rasûlüllah (sallallahü aleyhi ve sellem)’in velisiz hiçbir şekilde nikah olmaz dediğini kendisinden işittin mi? Ebû İshâk’ta “Evet” dedi. hadis Şu’be ve Sevrî’nin, Mekhül’den aynı zamanda işittiklerine işaret ediyor. İsrail’in Ebû İshâk’tan rivâyeti sağlam ve güvenilirdir. b. Müsenna’dan işittim şöyle diyordu: Abdurrahman b. Mehdî’den işittiğime göre, şöyle aktarıyordu: “Sevrî’nin Ebû İshâk’tan rivâyet ettiği hadislerden ne kaçırdımsa İsrail’e güvendiğimden dolayı kaçırmışımdır. Çünkü İsrail, Ebû İshâk’ın hadislerini daha sağlam olarak getirmiştir.” Âişe’nin bu konuda rivâyet ettiği “Velisiz hiçbir şekilde nikah olmaz” hadisi bence hasendir. İbn Cüreyc bu hadisi Süleyman b. Mûsâ’dan, Zührî’den, Urve’den ve Âişe’den rivâyet etmişlerdir. b. Ertae ve Cafer b. Rabia, Zührî’den, urve’de ve Âişe’den rivâyet etmişlerdir. Hişâm b. Urve babasından ve Âişe’den bu hadisin bir benzerini rivâyet etmiştir. hadisçiler Urve ve Âişe’den gelen Zührî hadisi hakkında söz etmişlerdir. Cüreyc der ki: Sonra Zührî ile karşılaştığımda kendisine sordum rivâyet etmediğini söyledi ve pek hoş karşılamadı bu yönden hadis zayıf kabul edilmiştir. b. Main’in; Şöyle dediği nakledilir: Bu hadisi İbn Cüreyc’den sadece İsmail b. İbrahim zikretmiştir. b. Main: İsmail b. İbrahim’in, İbn Cüreyc’den işittiği bu şekilde değildir. O kendi notlarını Abdülmecid b. Abdulaziz b. Ebû Revvâd’ın yazılarıyla karşılaştırarak düzeltmiş ve İbn Cüreyc’den hadis işitmemiştir. Diyor. Yahya; İsmail b. İbrahim’in, İbn Cüreyc’den rivâyetini zayıf kabul etmektedir. (sallallahü aleyhi ve sellem)’in “Velisiz hiçbir şekilde nikah olmaz” hadisi Peygamber (sallallahü aleyhi ve sellem)’in ashabından Ömer b. el Hattâb, Ali b. ebî Tâlib, Abdullah b. Abbâs ve Ebû Hüreyre’nin de bulunduğu ilim adamları uygulamalarını bu hadisle yaparlar. Tabiin fıkıhçılarından da aynı şekilde rivâyet ederler; “Velisiz nikah olmaz” denilmiştir. Saîd b. Müseyyeb, Hasan el Basrî, Şüreyh, İbrahim Nehaî, Ömer b. Abdulaziz ve başkaları da bu görüştedirler. Sûfyân es Sevrî, Evzâî, Abdullah b. Mübarek, Mâlik, Şâfii, Ahmed ve İshâk’ta aynı kanaattedirler",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		}
	]
}