{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "Ebû Bekir b. Cehm (r.a.)’den rivâyete göre, şöyle demiştir: Ben ve Ebû Seleme b. Abdurrahman Fatıma b. Kays’ın yanına gitmiştik. Bize kocasının kendisini üç talakla boşadığını oturacak bir yer göstermeyip yiyecek ve içecek de vermediğinden bahsetti ve dedi ki: “Benim için amca oğlunun yanına on ölçek yiyecek bırakmış beş ölçek arpa beş ölçek buğday…” Fatıma şöyle devam etti: Rasûlullah (s.a.v.)’e geldim durumu anlattım “Kocanın yaptığı doğrumudur?” buyurdular ve bana Ümmü Şerîk’in evinde iddet süresini doldurmamı emrettiler sonrada şöyle buyurdular: “Ümmü Şerîk’in evi muhâcirlerin çok girip çıktıkları bir evdir artık sen iddet süresini İbn Ümmü Mektum’un evinde doldur o gözleri görmediği için senin dış elbiseni üzerinden attığın takdirde seni görmez ve o evde daha rahat edersin iddetin biter ve sana bir dünür de gelirse bana haber ver..!” İddetim bitince Ebû Cehm ve Muaviye bana dünür oldular. Fatıma diyor ki: Bunun üzerine Rasûlullah (s.a.v.)’e gelerek durumdan haber verdim, buyurdular ki: “Muaviye parası malı mülkü olmayan birisidir. Ebû Cehm ise kadınlara karşı sert davranan birisidir.” Fatıma dedi ki: Sonra Üsâme b. Zeyd bana dünür olup benimle evlendi ve Allah beni Usame ile mutlu kıldı.” Diğer tahric: Müslim, Talak; Ebû Dâvûd, Nikah Tirmîzî: Bu hadis sahihtir. Sûfyân es Sevrî bu hadisi Ebû Bekir b. ebî Cehm’den benzeri şekilde rivâyet etmiş ve şu fazlalığı yapmıştır: “Rasûlullah (s.a.v.) bana Üsâme ile evlen” buyurdu. Bu hadisi bize Mahmûd, Vekî’ yoluyla Sûfyân’dan, Ebû Bekir b. ebî Cehm’den bu şekilde rivâyet etmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		}
	]
}