{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyet edilmiştir. Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: “Temiz toprak, Müslüman’ın temizleyici maddelerindendir on sene su bulamasa bile toprakla temizlenebilir. Ama suyu bulduğunda onunla yıkan çünkü bu daha hayırlıdır.” (Ebû Dâvûd,Tahara:123; Nesâî, Gusül: 26) râvîlerinden Mahmûd: “Temiz toprak Müslümanın abdest suyudur” demektedir. Bu konuda Ebû Hüreyre, Abdullah b. Amr ve Imrân b. Husayn’dan da hadis rivâyet edilmiştir. Bu hadisi Hâlid b. Hazza’dan Ebû Kılâbe, Amr b. Bücdân, ve Ebû Zerr yoluyla birçok kişi böylece rivâyet etmişlerdir. Eyyûb ise bu hadisi Ebû Kılabe, Âmir oğullarından ismini vermediği bir kimse ve Ebû Zerr’den rivâyet etmektedir. hadis hasen sahihtir. Fıkıhçıların genelinin görüşü “Cünüp ve hayızlı kimse su bulamazsa teyemmüm ederler” şeklindedir. Mes’ûd’un; Su bulamayan cünüp için teyemmüm olmaz görüşünden sonradan döndüğü de rivâyet edilmiştir. Sûfyân es Sevrî, Mâlik, Şâfii, Ahmed ve İshâk da aynı görüştedirler. Muaviye kendi rivâyetinde: “Her vakit namazı için abdest al hayız zamanın gelinceye kadar” demektedir. Bu konuda Ümmü Seleme’den de hadis rivâyet edilmiştir. Âişe (radıyallahü anha)’nın bu hadisi hasen sahihtir. Peygamber (sallallahü aleyhi ve sellem)’in ashabından ve tabiinden pek çok ilim adamlarının görüşü de budur. Sûfyân es Sevrî, Mâlik İbn’ül Mübarek ve Şâfii demektedirler ki: “Aybaşı kanının süresini fazla gören kadın hayız günleri geçince yıkanır ve her namaz için abdest alır.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 124
			}
		}
	]
}