{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "Zeyd b. Hâlid el Cühenî (radıyallahü anh)’den rivâyete göre yitik malın hükmü soruldu bunun üzerine şöyle buyurdu: “Bir yıl ilan et tanıyan çıkarsa onu ona ver. Aksi halde tüm özelliklerini tespit edip öğren ve kullan sonra sahibi gelirse ödersin.” (Buhârî, Lukata: 2; İbn Mace, Lukata: 1) Bu konuda Übey b. Ka’b’den, Abdullah b. Amr’dan, Carûd b. Mualla’dan, İyaz b. Hımar’dan ve Cerir b. Abdullah’tan da hadis rivâyet edilmiştir. Zeyd b. Hâlid hadisi bu şekliyle hasen garibtir. Ahmed b. Hanbel diyor ki: Bu hadis bu konuda rivâyet edilen en sahih hadistir. Değişik şekillerde de rivâyet edilmiştir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göredir. Yitik mal hakkında bir yıl süreyle tanıtıp sahibi çıkmadığı takdirde ondan istifade edilebileceğine izin vermişlerdir. Şâfii, Ahmed ve İshâk bunlardandır. (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamları ise: “Onu bir sene tanıtır ve sahibi gelirse ona verir yoksa tasadduk eder” diyorlar. Sûfyân es Sevrî, Abdullah b. Mübarek Küfelîler böyle düşünürler; “Yitik malı bulan kimse zengin ise o maldan yararlanamaz” derler. Zengin de olsa yararlanabilir der. Çünkü Übey b. Ka’b, Rasûlüllah (sallallahü aleyhi ve sellem) zamanında içinde yüz dinar bulunan bir kese altın bulmuştu ki: Rasûlüllah (sallallahü aleyhi ve sellem) onu tanıtıp ilan etmesi ve ondan istifade etmesini emretmişti. Übey b. Ka’b malı çok olan Rasûlüllah (sallallahü aleyhi ve sellem)’in zengin ashabından idi. Peygamber (sallallahü aleyhi ve sellem), o malı tanıtıp ilan etmesini, sahibi bulunmaz ise onu yemesini emretti. Yitik mal sadece sadaka alması caiz olanlara helal olmuş olsaydı Ali b. ebî Tâlib’e helal olmazdı. Çünkü Ali b. ebî Talib, Rasûlüllah (sallallahü aleyhi ve sellem) zamanında bir dinar bulmuştu onu tanıttı sahibini bulamadı bunun üzerine onu yemesini emretti. Ali’ye sadaka yemesi helal değildi. Bazı ilim adamları yitik eşya az bir şey ise ilan edilmeden yararlanabileceğini söylemişlerdir. Bazıları ise “Bir dinardan az ise bir hafta süreyle onu tanıtır.” İshâk b. İbrahim’in görüşü budur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 54
			}
		}
	]
}