{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "Ebû Hureyre, Zeyd b. Hâlid ve Şibl (r.anhüm)’den rivâyete göre, şöyle demişlerdir: Bu kimselerin üçü de Rasûlullah (s.a.v.)’in yanında bulundukları bir sırada birbirinden davacı olan iki kimse geldi onlardan biri sözüne şöyle başladı: “Ey Allah’ın Rasûlü! Allah aşkına aramızda Allah’ın kitabıyla hükmedeceksin. Bunun üzerine bu kimseden daha anlayışlı olan diğer kimse de; Evet Allah’ın kitabına göre aramızda hüküm ver, müsaade et ben konuşayım dedi ve sözüne şöyle başladı: Oğlum bu adamın işçisi idi sonra onun karısıyla zina etti, oğlumun cezasının recm olduğunu bana bildirdiler. Ben de bu ceza karşılığında yüz koyun ile bir hizmetçiyi fidye olarak verdim. Sonra bu işi bilen insanlarla karşılaştım ve dediler ki: Oğluna yüz değnek vurulması gerekir, bir yılda sürgün edilecektir. Recmedilmek ise bu adamın karısına uygulanacaktır dediler. Bunun üzerine Rasûlullah (s.a.v.) buyurdular ki: Varlığım kudret elinde olan Allah’a yemin olsun ki aramız da Allah’ın kitabıyla hükmedeceğim: Yüz koyun ve hizmetçi sana iade edilecektir, oğluna da yüz değnek ve bir yıl sürgün cezası verilecektir. Ya Üneys! Bu adamın karısına git suçunu kabul edip itiraf ederse onu recmet. Üneys kadının yanına gitti o da suçunu itiraf edince kadını recmetti. İshâk b. Musa el Ensârî, Ma’n vasıtasıyla Mâlik’den İbn Şihâb’tan, Ubeydullah b. Abdullah’tan, Ebû Hüreyre’den, Zeyd b. Hâlid el Cühenî’den mana olarak bu hadisin bir benzerini rivâyet etmiştir. Yine Kuteybe, Leys vasıtasıyla İbn Şihâb’tan kendi senediyle mana olarak Mâlik’in hadisinin bir benzerini bize rivâyet etmiştir. Diğer tahric: Buhârî, Muhâribîn; Müslim, Hudûd",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1433.3,
			"arabicnumber": 1433.3,
			"text": "Tirmizî: Bu konuda Ebû Bekre, Ubede b. Sâmit, Ebû Hüreyre, Ebû Saîd, İbn Abbâs, Câbir b. Semure, Hezzal, Büreyde, Seleme b. Muhabbik, Ebû Berze ve Imrân b. Husayn’dan da hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre Zeyd b. Hâlid hadisi hasen sahihtir. Aynı şekilde Mâlik b. Enes; Ma’mer ve pek çok kimse Zürî’den, Ubeydullah b. Abdullah b. Utbe’den, Ebû Hüreyre’den ve Zeyd b. Hâlid’den rivâyet etmiştir. Aynı şekilde aynı senedle Rasûlullah (s.a.v.)’den şu şekilde rivâyet etmişlerdir: “Cariye zina ederse ona yüz değnek vurun dördüncü sefer yine zina ederse değersiz bir ip parasına bile olsa satıp elden çıkarın.” Sûfyân b. Uyeyne; Zührî’den, Ubeydullah’tan, Ebû Hüreyre’den, Zeyd b. Hâlid’den ve Şibl’den rivâyet ederek şöyle der: “Rasûlullah (s.a.v.)’in yanında idik…” İbn Uyeyne her iki hadisi de topluca Ebû Hüreyre’den Zeyd b. Hâlid’den ve Şibl’den rivâyet ediyor. İbn Uyeyne rivâyet ettiği bu hadiste vehme kapılmıştır. Sûfyân b. Uyeyne iki hadisi birbirine karıştırmıştır. Sahih olan rivâyet Muhammed b. el Velîd ez Zebîdî, Yunus b. Ubeyde, Zührî’nin kardeşinin oğlunun Zührî’den, Ubeydullah’tan, Ebû Hüreyre’den ve Zeyd b. Hâlid’den yapılan rivâyetidir ki; şöyle başlar: “Cariye zina ederse ona yüz değnek vurun…” Zührî; Ubeybullah’tan, Şibl b. Hâlid, Abdullah b. Mâlik el Evsî’den rivâyet etti şöyle demiştir: Cariye zina ederse…” hadisçiler yanında sahih kabul edilen rivâyet budur. Şibl b. Hâlid, Peygamber (s.a.v.)’e yetişmemiştir. Şibl sadece Abdullah b. Mâlik el Evsî vasıtasıyla hadis rivâyet etmektedir. Doğru olanı budur. İbn Uyeyne rivâyeti pek makbul değildir. İbn Uyeyne’den, Şibl b. Hamid dediği rivâyet edildi ki bu bir yanlışlıktır. Gerçekte o Şibl b. Hâlid’tir. Aynı şekilde ona Şibl b. Huleyd’de deniliyor",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}