{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"22": "The Book on Virtues of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "Ebû Yezîd el Havlânî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Fedâle b. Ubeyd’den işittim şöyle diyordu: Ömer b. Hattâb’tan işittim şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle demiştir: Şehîdler dört çeşittir; 1- Düşmanla karşılaşıp öldürülünceye kadar Allah’a sadık kalan, sağlam imanlı mümin kişidir. Bu kişiye kıyamet günü insanlar gözlerini kaldırarak bakacaklardır derken başını o derece kaldırdı ki başındaki külahı düştü. Râvî diyor ki külahı düşen Peygamber mi idi yoksa Ömer mi idi bilemiyorum. 2- Yine bir kimse ki düşmanla karşı karşıya gelip şaşkın bir okun kendisine isabet etmesiyle şehîd olmuştur, bunun da duyduğu acı sanki muz ağacının dikeni batmış gibi ürkeklik duyan kimse gibidir. Bu da sağlam imanlı, mümin bir kişidir ki ikinci derecede olan da budur. 3- Hayatta iken iyi işleri de olup kötü işler de işleyen günahkar bir mümin kimse düşmanla karşılaşır ve Allah’a verdiği sözü yerine getirinceye kadar sözünde durup şehîd olan kimsedir ki buda üçüncü derecedir. 4- Yine bir adam ki hayatı boyunca nefsine zulmederek fazla günah işleyerek düşmanla karşılaşmış ve Allah’a verdiği sözde durarak şehîd oluncaya kadar savaşan kimsedir ki dördüncü derecede budur.” (Müsned: 145) hadis hasen garibtir. Bu hadisi sadece Atâ b. Dinar’ın rivâyetiyle bilmekteyiz. Muhammed’den işittim şöyle diyordu: Saîd b. ebî Eyyûb bu hadisi Atâ b. Dinar’dan rivâyet etmiştir. Dedi ki: Havlân şeyhlerinden rivâyet etmiştir ve bu rivâyetinde de “Ebû Yezîd”ten dememiştir. Atâ b. Dinar rivâyet yönünden zararsız makbul bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		}
	]
}