{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"22": "The Book on Virtues of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "İshâk b. Abdullah b. Ebî Talha (radıyallahü anh)’den rivâyet edilmiştir: Enes’den şöyle dediğini işitti: Rasûlüllah (sallallahü aleyhi ve sellem), Milhan’ın kızı Ümmü Haram’ın yanına girerdi. Ümmü Haram kendisine yemek yedirirdi. Ümmü Haram, Ubâde b. Sâmit’in nikahlısıydı. Günlerden bir gün onun yanına girmişti de o da Rasûlüllah (sallallahü aleyhi ve sellem)’e yemek yedirmişti. Biraz istirahat için uyuyan Rasûlüllah (sallallahü aleyhi ve sellem)’in başı ucuna oturmuştu. Rasûlüllah (sallallahü aleyhi ve sellem) uyudu biraz sonra gülerek uyandı. Ümmü Haram dedi ki: Ey Allah’ın Rasûlü neden güldün? Dedim. Buyurdular ki: Ümmetimden bazı kimseler gazi olarak rüyamda bana gösterdiler şu denizin üzerindeki gemilere tahtlar üzerindeki hükümdarlar gibi binmiş Allah yolunda savaşa gidiyorlardı. Ben: Ey Allah’ın Rasûlü! Allah’a dua et de beni onlardan kılsın dedim, Rasûlüllah (sallallahü aleyhi ve sellem) ona dua etti. Sonra başını koyup uyudu, hemen arkasından gülerek yine uyandı. O’na Ey Allah’ın Rasûlü dedim seni güldüren nedir? Şöyle buyurdular: Ümmetimden bazı kimseler Allah yolunda gazi olarak bana gösterildiler diyerek önceki sözünün bir benzerini söyledi. Ümmü Haram dedi ki: Ey Allah’ın Rasûlü dedim beni onlardan kılması için Allah’a dua et. Rasûlüllah (sallallahü aleyhi ve sellem), sen öncekilerdensin buyurdu. Muaviye b. Ebî Sûfyân zamanında Ümmü Haram, deniz yolculuğuna çıktı. Dönüşünde binmesi için ona bir katır getirilmişti de o hayvan onu sırtından atmıştı boynu kırılarak orada vefat etmişti. (Buhârî, Cihâd: 62; Ebû Dâvûd, Cihâd: 15; Dârimî Cihâd: 29) Bu hadis hasen sahihtir. Ümmü Haram binti Milhan Ümmü Süleym’in kız kardeşidir. Enes b. Mâlik’in teyzesidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		}
	]
}