{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"30": "Chapters On Wasaya (Wills and Testament)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"text": "Ebû Umâme el Bahîli (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim veda haccındaki hutbesinde şöyle buyurdu: “Allah her hak sahibine hakkını vermiştir, dolayısıyla miras alana vasiyet yoktur. çocuk yatağın sahibi olan erkek veya efendinindir. Zina edenin hakkı mirastan mahrum edilmektir veya taşlanarak öldürülmektir. ve onların hesabı (sevap, ceza, bağışlanma) Allah’a aittir. Her kim babasından başkasına intisab ederse yani başka birine babam budur derse veya bir köle sahibinin dışında başka birisinin efendisi olduğunu iddia ederse kıyamete kadar Allah’ın laneti=yani rahmetinden uzak kalmasıonun üzerinedir. Kadın kocasının evinden uzak kalması onun üzerinedir. Kadın kocasının evinde ancak kocasının izniyle harcamada bulunabilir. Bu esnada Ey Allah’ın Rasûlü! Kadın kocasının evinden bir fakire yiyecek de mi veremez? Denildi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), esasen mallarımızın en değerlisi odur buyurdu. Sonra şöyle devam etti: Ödünç alınan her şey ödenecektir. Ödünç olarak verilen hayvan, ağaç, ve arazide sahibine geri verilecektir. Her türlü borç ta mutlaka ödenecektir. Kefil olan da borç ödenmezse o borcu ödeyecektir.” (Ebû Dâvûd, Vesâyâ: 1; İbn Mâce, Vesâyâ: 2) Bu konuda Amr b. Harîce ve Enes’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bu hadis Ebû Umâme’den değişik yollarla da rivâyet edilmiştir. b. Ayyaş’ın, Iraklılardan ve Hicazlılardan tek başına rivâyeti pek sağlam değildir. Çünkü onlardan münker hadisler rivâyet etmektedir. Şamlılardan rivâyeti ise daha sağlamdır. Muhammed b. İsmail bu konuda böyle söylemiştir. Ahmed b. Hasan’ın, Ahmed b. Hanbel’den şöyle naklettiğini işittim: İsmail b. Ayyaş’ın durumu diğer münker hadisler aktaranlara göre daha iyidir. Diğerlerinin güvenilir kimselerden rivâyet ettiği münker hadisler vardır. Abdullah b. Abdurrahman’dan işittim şöyle diyordu: Zekeriyya b. Adiyy’den işittim şöyle diyordu: Ebû İshâk el Fezarî şöyle diyor: Bakiyye denilen kişilerin güvenilen kişilerden yaptıkları rivâyetleri alın İsmail b. Ayyaş’ın ise gerek güvenilir gerekse başka kimselerden yaptığı rivâyetlerini almayın. (Bakıyye: İsmail b. Ayyaş’ın dışındaki münker hadisler aktaran kimseler)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 5
			}
		}
	]
}