{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "Abdullah b. Amr b. As’tan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bir gün elinde iki kitap olduğu halde çıkageldi ve şöyle buyurdu: Bu iki kitabın ne olduğunu biliyor musunuz? Biz de hayır Ey Allah’ın Rasûlü! Sen bize bildirirsen biliriz dedik. Bunun üzerine sağ elindeki kitap için; bu kitap alemlerin rabbinden bir kitap olup Cennetlik kimselerin isimleri babalarının isimleri ve kabilelerin isimleri bu kitaptadır. Cennetliklerin sonuncusuna varıncaya kadar yazılmış ve toplanmıştır. Bunların sayısı artırılıp eksiltilmeyecektir. Sonra sol elindeki kitap için, bu kitap ta alemlerin Rabbin’den bir kitap olup Cehennemlik kimselerin, babalarının ve kabilelerinin isimlerini içermekte olup Cehennemliklerin sonuncusuna varıncaya kadar yazılmış ve toplanmıştır. Bunların sayısı da artırılıp eksiltilmeyecektir, buyurdu. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabı Ey Allah’ın Rasûlü! Dediler. Durum önceden tamamlanmış ve bitirilmiş ise çalışıp çabalamamız ne işe yarar? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Dosdoğru olun! Hayırlı amellerinizi artırın. Çünkü Cennetlik kişinin ameli hangi işi işlerse işlesin Cennetlik kişilerin ameliyle son bulacaktır. Cehenneme girecek kimse de hangi ameli işlemiş olursa olsun onun ameli de Cehennemlik kişilerin amelleriyle son bulacaktır. Sonra Rasûlüllah (sallallahü aleyhi ve sellem), O iki kitabı elinden bıraktı ve şöyle buyurdu: “Rabbiniz kulların yapacakları her şeyi bildiğinden dolayı ona göre kaderlerini yazıp bitirmiştir. Bir kısmı Cennetlik bir kısmı da Cehennemlik olacaktır.” (İbn Mâce, Mukaddime: 10) Bekir b. Mudar vasıtasıyla Ebû Kâbîl’den bu hadisin bir benzerini bize rivâyet etmiştir. Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Bu hadis hasen garibtir. Kâbîl’in ismi: Hubey b. Hânî’dir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		}
	]
}