{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "Abdulvahid b. Süleym (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Mekke’ye geldim, Atâ b. ebî Rebah’la karşılaştığım da kendisine: “Ey Ebû Muhammed” dedim. Basralılar kader konusunda dengesiz şeyler söylüyorlar ne dersin? Dedi ki: Evladım Kur’ân okuyor musun? Ben de evet dedim, Zuhruf sûresini oku dedi; Bende: “Ha mîm, düşün gerçekleri ortaya koyan bu kitabı, onu düşünüp kavrayabilesiniz diye Arapça olarak indirdik O Kur’ân katımızda bulunan ana kitapta mevcut olup şân, büyüklük ve hikmetlerle doludur” diye Zuhruf sûresinin dört ayetini okudum. Bunun üzerine Ana kitap nedir bilir misiniz? Dedi. Allah ve Rasûlü bilir dedim. Dedi ki: O öyle öyle bir kitap veya yazgıdır ki; Allah gökleri ve yeri yaratmadan önce Allah’ın yazmış olduğu bir kitaptır ki içersinde Firavunun Cehennemlik olduğu ve Ebû Leheb’in tüm imkanlarıyla yok olup gideceği de orada yazılıdır. Atâ diyor ki: Rasûlüllah (sallallahü aleyhi ve sellem)’in sahabesi Ubâde b. Sâmit’in oğlu Velid ile karşılaştım ve kendisine; ölümü esnasında babasının vasiyeti nasıldı? Diye sordum. Dedi ki: Babam beni çağırdı ve şöyle dedi: Ey evladım Allah’a karşı devamlı sorumluluk bilinci içerisinde ol iyi bilki Allah’a karşı sorumluluk bilincine ulaşabilmek ancak Allah’a inanmak ve hayır ve şer her türlü kaderin Allah’tan olduğuna imanla mümkündür. Bu inanç dışında bir inançla ölürsen Cehenneme girersin çünkü ben Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: Allah önce kalemi yarattı ve yaz buyurdu. Kalem ne yazayım dedi. Allah’ta kaderi ve ebediyete kadar olup bitecek her şeyi yaz buyurdu. (Tirmizî rivâyet etmiştir.) Bu hadis bu şekliyle garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		}
	]
}