{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"text": "Huzeyfe b. Yemân (r.a.)’den rivâyete göre, şöyle aktarmıştır: Rasûlullah (s.a.v.), bize iki konudan bahsetmişti birini gördüm diğerini beklemekteyim; Emanetten bahsetmişti ki: Emanet; önceleri insanların kalblerinin derinliklerine indiğini sonra Kur’ân’ın inip emanet konusunu insanların Kur’ân’dan ve sünnetten öğrendiklerini haber verip emanetin kalkacağından bahsederek şöyle buyurdu: Kişi uykuya dalacak kalbinden emanet duygusu yok edilecek ve basit bir nokta gibi iz kalacaktır. Sonra yine uykuya dalacak bu sefer emanet duygusunun geri kalanı da yok edilerek, çok çalışanın elindeki nasır izi gibi hafif bir iz kalacaktır. Sanki ayağının üzerinde yuvarladığın ve derinin kabarmasına sebeb olan ateş parçasının meydana getirdiği iz gibi onu şişkin görürsün fakat içinde bozuk sudan başka hiçbirşey yoktur. Bunun üzerine Rasûlullah (s.a.v.) bir çakıl taşı alarak ayağının üzerinden yuvarladı ve şöyle buyurdu: Sonra insanlar aralarında alışveriş edecekleri hemen hemen hiç kimsenin emaneti yerine getirmeyeceği bir güne geleceklerdir. Hatta filan oğullarında dürüst bir kişi vardır… denilecek yine kalbinde hardal tanesi kadar imanı olmayan kişilere ne bahadır bir insan, ne kibar, ne akıllı insan denilecektir. Huzeyfe şöyle devam etti: Öyle zamanlarda yaşadım ki: O günlerde kiminle alışveriş ettiğime aldırmazdım. Müslüman ise o kişiyi dini dürüst olmaya sevkederdi. Yahudî ve Hıristiyan ise onunda başında bulunan devlet gücü ve otoritesi kötülük yapmasına engel olurdu. Ama bugün ise sizden şu birkaç kişiyle alışveriş yapabilmekteyim. Diğer tahric: Buhârî, Rikak; İbn Mâce: Fiten Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 22
			}
		}
	]
}