{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "Fatıma binti Kays (r.anha)’dan rivâyete göre, Nebi (s.a.v.), minbere çıkıp gülümsedi ve şöyle konuştu: Temim-i Dâri bana bir olayı aktardı da bende sevindim ve onu size anlatmak istedim. Filistin halkından bazı kimseler deniz yolculuğunda gemiye binmişler fırtınaya yakalanan gemi onları bir süre başıboş dolaştırıp sonunda deniz içerisindeki adalardan birine atmıştı. Birde ne görsünler çok tüylü bir yaratık! Sen kimsin derler. Ben Cessase’yim diye cevap verir. O halde bize bildiklerinden haber ver derler. O da der ki: Ben size bir şeyler haber verecek konumda da değilim ve sizden de hiçbir haber soracak değilim. Kasabanın biraz ötesine geldik birde ne görelim! Zincire vurulmuş bir adam! Bu adam bize “Aynı Zuğar” dan bana haber verin dedi. Biz de dopdolu ve su akmaya devam ediyor dedik. Taberiye gölünden bana haber verin dedi. Bizde sularla doludur dedik. Sonra Ürdün ve Filistin arasındaki Beysan hurmalıklarından bana haber verin meyve verdi mi dedi. Biz de evet dedik bana son peygamberden haber verin gönderildi mi? dedi. Bizde evet dedik. İnsanlar o peygambere karşı nasıl davranıyorlar. Dedi. Biz de koşuyorlar adeta dedik. Bunun üzerine bir sıçrayışla sıçradı ki az kaldı zincirlerini koparıyordu. Biz de sen kimsin? Dedik. Ben Deccâl’ım dedi. Taybe’de başka her yere girecektir. Taybe’de Medîne’dir. Diğer tahric: Müslim, Fiten; Ebû Dâvûd, Melahim Tirmizî: Bu hadis Katâde’nin Şa’bî’den rivâyeti olarak hasen sahih garibtir. pek çok kimse Şa’bî’den ve Fatıma binti Kays’tan bu hadisi rivâyet etmişlerdir. Cessase: Haber toplayan demektir- Nevevi'nin dediğine göre bu yaratık Deccal'e haber topladığı için bu adı almıştır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 96
			}
		}
	]
}