{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"34": "Chapters On Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2293,
			"arabicnumber": 2293,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, şöyle demiştir: Ebû Hureyre şöyle bir hadis anlatırdı: “Adamın biri Rasûlullah (s.a.v.)’e gelerek dedi ki: Bu gece Rüyamda bir bulut gördüm ondan bal ve yağ akıyordu. İnsanlarda elleriyle o bal ve yağdan alıyorlardı; Kimi çok çok alıyor kimi de az alıyordu. Gökten yere uzatılmış bir ip gördüm.” Ey Allah’ın Rasûlü! baktım ki siz o ipe tutundunuz ve yükseldiniz, sonra başka bir kimse daha o ipi tuttu ve o da yükseldi ondan sonra bir kimse daha o ipi tuttu o da yükseldi sonra bir adam daha o ipi tuttu fakat ip koptu, ip bağlandı o da yükseldi. Bunun üzerine Ebû Bekir dedi ki: Ey Allah’ın Rasûlü! anam babam sana feda olsun… Müsaade ediniz de bu rüyayı ben yorumlayayım. Rasûlullah (s.a.v.); Yorumla bakalım dedi ve Ebû Bekir şöyle yorumladı: Gölgelik yapan bulut İslam’dır, akan yağ ve bal Kur’ân’ın yumuşaklığı ve tadıdır. Çok veya az alanlar ise Kur’ân’dan nasibini az veya çok almış kimselerdir. Gökten yere doğru uzatılan ip ise üzerinde bulunduğun hak olan İslam’dır. Siz onu tutmuşsunuz Allah’ta sizi yükseltecektir. Sizden sonra o hakkı başka bir kimse tutacak ve onunla yükselecektir. Onun peşinden başka biri tutacak; O’da onunla yükselecektir. Sonra başka biri tutacak onun yüzünden ip kopacak sonra bağlanacak ve oda onunla yükselecektir. Ey Allah’ın Rasûlü! bu yorumlamada doğru mu? Yoksa yanlış mı? yaptım. Rasûlullah (s.a.v.): “Bir kısmını doğru bir kısmını yanlış yorumladın” buyurdular. Bunun üzerine Ebû Bekir: Ey Allah’ın Rasûlü! Anam babam sana feda olsun yemin ederim ki yanıldığım tarafı bana söyleyeceksiniz. Rasûlullah (s.a.v.): “Yemin etme” buyurdular. Diğer tahric: Müslim, Rüya; İbn Mâce: Rüya Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		}
	]
}