{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "Hilâl b. Yisâf (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rakkâ bölgesinde iken Ziyâd b. ebî’l Ca’d elimden tuttu. Esed oğullarından Vâbisa b. Ma’bed denilen bir ihtiyarın yanına götürdü ve bu ihtiyar bana şu hadisi aktarmıştı dedi: “Bir adam saffın arkasında tek başına namaz kılmıştı. O ihtiyar dinliyordu. Rasûlüllah (sallallahü aleyhi ve sellem) ona namazını iade etmesini emretti.” (Ebû Dâvûd, Salat: 99; İbn Mâce, İkame: 54) Bu konuda Ali b. Şeyban ve İbn Abbâs’dan da hadis rivâyet edilmiştir. hadisi hasendir. Bazı ilim adamları safların arkasında tek olarak namaz kılmayı hoş karşılamamışlar ve “Saffın arkasında tek olarak namaz kılan namazını iade eder” demektedirler. Ahmed ve İshâk bu şekilde düşünmektedirler. Kimi ilim adamları ise: “Saffın arkasında tek başına kılan kimse namazı iade etmez” demektedirler. Sûfyân es Sevrî, İbn’ül Mübarek ve Şâfii bu görüştedir. bir gurup Vâbisa’nın bu hadisine dayanarak: “Saffın arkasında tek başına namaz kılan namazını iade eder” demektedirler. Hammad b. ebî Süleyman, İbnü ebî Leylâ ve Vekî’ bunlardandır. Hilâl b. Yisâf’tan rivâyet ettiği bu hadisi pek çok kimse Ebûl Ahvas’ın, Ziyâd b. ebil Ca’d’den, Vâbisa b. Ma’bed’den rivâyeti gibi rivâyet etmiştir. hadisinde Hilâl’in, Vâbisa’ya yetişip ondan hadis dinlediğine işaret vardır. Hadisçiler bu konuda değişik görüşler ortaya koymuşlardır. kısmı: Amr b. Mürre’nin, Hilâl b. Yisâf’tan, Amr b. Râşid’den, Vâbisa b. Ma’bed’den rivâyeti daha sahihtir, demektedirler. kısmı ise: Husayn’ın Hilâl b. Yisâf’tan, Ziyâd b. ebil Ca’d’den, Vâbisa b. Ma’bed’den rivâyeti daha sahihtir. Bence bu hadis Amr b. Mürre’nin hadisinden daha sahihtir. Çünkü Hilâl b. Yisâf’ın, Ziyâd b. ebî’l Ca’d’den, Vâbisa’dan rivâyetinden başka yollarla da rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		}
	]
}