{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), her zaman çıkmadığı ve kimseyle buluşamayacağı bir saatte evinden dışarı çıkmıştı. Derken Ebû Bekir yanına çıkageldi. Hangi şeyden dolayı bu saatte buradasın Ey Ebû Bekir! Dedi. Ebû Bekir de: Rasûlullah (s.a.v.) ile buluşup yüzünü görür ve selam veririm ümidiyle çıktım dedi. Az sonra Ömer geldi. Rasûlullah (s.a.v.), ona, Hangi şey seni bu saatte çıkardı dedi. Ömer: Açlık Ey Allah’ın Rasûlü! dedi. Rasûlullah (s.a.v.)’de Açlık bende de var dedi. Sonra üçü birden Ebû’l Heysem et Teyyihan el Ensarî’nin evine doğru yürüdüler. Ebû’l Heysem, hurması ve koyunları bol olan bir kişi idi, hizmetçisi yoktu. Evde kendisini bulamadılar ve evin hanımına eşin nerede? Dediler. Hanım: Bize, tatlı içme suyu getirmeye gitmişti dedi. Biraz sonra Ebû’l Heysem dopdolu bir su kırbasıyla çıkageldi. Kırbasını yere koyduktan sonra gelip Peygamberimize sarılıp anne ve babasının Rasûlullah (s.a.v.)’e feda olduğunu söyledi. Sonra onları bahçesine götürdü ve bir sergi serdi ve hurma ağacından olgunu ve olgun olmayanı bir arada bulunan bir hurma dalı salkımı getirdi ve ortaya koydu. Bunun üzerine Rasûlullah (s.a.v.): Bize olgunlarından seçip getirmedin mi? buyurdu. Ebû’l Heysem: Ey Allah’ın Rasûlü! kendiniz seçesiniz diye veya yaş ve kuru hangisinden isterseniz seçip yemeniz için bu şekilde getirdim dedi. Böylece o hurmalardan yediler, tatlı sudan içtiler. Bunun üzerine Rasûlullah (s.a.v.), şöyle buyurdu: “Canımı kudret elinde tutan Allah’a yemin olsun ki bu nimetlerden kıyamet günü sorguya çekileceksiniz. Serinlik ve gölge, güzel hurma ve su…” Ebû’l Heysem yemek hazırlatmak için giderken Rasûlullah (s.a.v.) şöyle buyurdu: Sakın ha! Sütlü bir hayvan kesmeyin! Ebû’l Heysem dişi veya erkek bir oğlak kesti hazırlayıp getirdi ve hep birlikte yediler, Rasûlullah (s.a.v.), Hizmetçin var mı? dedi. Ebû’l Heysem hayır dedi. Rasûlullah (s.a.v.) savaş esirleri gelince bize gel buyurdu. Rasûlullah (s.a.v.)’e iki savaş esiri getirilmişti. Bir üçüncüsü yoktu. Ebû’l Heysem müracaat etti, Rasûlullah (s.a.v.)’de ikisinden birini seç buyurdu. Ebû’l Heysem: Ey Allah’ın Rasûlü benim yerime siz seçiniz dedi. Bunun üzerine Rasûlullah (s.a.v.): İstişare edilen kimse güvenilen kimsedir, dedi. Şunu al çünkü onu namaz kılarken gördüm dedi. Ve ona iyi davran buyurdu. Ebû’l Heysem hanımına gitti ve durumunu ona anlattı bunun üzerine hanımı Rasûlullah (s.a.v.)’in “Ona iyi davran” sözünü yerine getirebilmek için onu hürriyetine kavuşturmalısın, dedi. Ebû’l Heysem de o hürdür dedi. Daha sonra Rasûlullah (s.a.v.) şöyle buyurdu: Allah’ın gönderdiği her Peygamber ve devlet idarecisinin iki tür halkı vardır; Biri ona daima iyiliği emredip kötülükten sakındırır bir diğeri de ona devamlı güçlük çıkarıp yük olur kim kötü arkadaş ve personelden korunmuş olursa gerçekten her tür kötülükten korunmuş olur. Diğer tahric: Müslim, Eşribe Tirmizî: Bu hadis hasen sahih garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		}
	]
}