{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir; Ehli Suffe denilen mescidin yanı başında barınan kimseler Müslümanların misafirleri idiler, ne malları nede çoluk çocukları vardı. Kendisinden başka ilah bulunmayan Allah'a andolsun ki, açlığın tesirinden yüzükoyun yatarak ciğerimi yere dayardım ve yine açlığın tesirinden karnıma taş bağlar­dım. Bir gün, onların çıktıkları yol üzerine oturdum, Ebû Bekir oradan geçti Allah'ın kitabından bir ayet sordum maksadım beni doyurması içindi geçti gitti içimden geçirdiğim şeyi yapmadı sonra Ömer geçti Ona da, Allah’ın kitabından bir ayet sordum sormaktaki maksadım beni doyurması içindi O da geçti gitti isteğimi yapmadı sonra Ebûl Kâsım Muhammed (s.a.v.) geç­ti. Beni görünce gülümsedi ve “Ey Ebû Hureyre” buyurdu. “Ya Rasûllah! emrine hazırım Ey Allah’ın Rasûlü!” dedim. Rasûlullah (s.a.v.) “Beni takip et!” buyurdu ve geçti Ben de peşinden gittim evine girdi. Ben de girmek için izin istedim, izin verildi ve girdim. Evde bir tas süt gördü ve sordu: Bu süt size nereden geldi? diye. “Falan kimse bize hediye olarak getirmişti!” dediler. Bunun üzerine Rasûlullah (s.a.v.) şöyle buyurdu: “Ey Ebû Hureyre!” Ben de “Emrinize hazırım Ey Allah’ın elçisi!” dedim. “Suffelilere git ve onları buraya çağır onlar Müslümanların misafirleridir. Ne malları, ne de çocukları yoktur onların!” dedi. Rasûlullah (s.a.v.)’in kendisine zekat malı geldiğinde ondan hiçbir şey yemez Suffelilere gönderirdi. Hediye geldiğinde ise onlara haber gönderir, kendisi de bu hediyeden yer onları da buna ortak ederdi. Bu Suffelileri çağırma vazifesi hoşuma gitmedi. Peygamber'in el­çisi olarak Suffelileri çağırmaya giderken kendi kendime şöyle dedim: Bir tas süt Suffelilere yetmez ki hem de Peygamber (s.a.v.) ve ben de varım bu ikram edilecekler arasında Rasûlullah (s.a.v.), o bir tas sütü onlara dolaştırmamı emredecek ki benim payıma bundan ne düşebilir? Ben açlığımı giderecek kadar ondan içmek isterdim ama Allah’a ve Rasûlüne itaatten başka çare yok.. Suffelilere geldim ve onları çağırdım. Rasûlullah (s.a.v.)’in yanına girdiler ve herkes yerini aldı. Rasûlullah (s.a.v.), “Ey Ebû Hüreyre!” süt tasını al onlara ikram et buyurdu. Ben de tası alıp tek tek herkese veriyordum her alan doyasıya içiyor sonra bana veriyor bende bir başkasına veriyordum sonunda Rasûlullah (s.a.v.)’e vardım, bütün cemaat doyuncaya kadar içmişlerdi Rasûlullah (s.a.v.) süt tasını aldı ellerinin arasına koydu sonra başını kaldırarak gülümsedi ve “Ebû Hureyre iç!” buyurdu. içtim. Sonra tekrar “İç!” buyurdu. Ben içmeye devam ediyorum, O da “İç!” buyuruyordu. Sonunda şöyle dedim: “Seni hak ile gönderen Allah’a yemin olsun ki, artık içmeyeceğim…” Sonunda tası eline aldı, AIlah’a hamdetti, besmele çekti ve sütten içti. Diğer tahric: Buhârî, Etıme Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		}
	]
}