{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "Ebû Zerr (radıyallahü anh)’den rivâyete göre Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu; “Allah şöyle buyurur: “Ey kullarım! Hepiniz dalalettesiniz ancak benim hidayet nasib ettiğim kişiler hariç benden hidayet isteyiniz ki, size hidayet vereyim. Hepiniz fakirsiniz, ancak benim zengin ettiğim kimseler hariç; benden isteyin, sizi rızıklandırayım. Hepiniz günahkarsınız, benim affettiklerim dışında; içinizden her kim, benim bağışlama gücüne sahip olduğumu bilir ve benden bağışlanmasını isterse günahlarının çokluğuna ve büyüklüğüne aldırmaksızın onu affederim. öncekileriniz, sonrakileriniz, ölüleriniz ve dirileriniz yaşlarınız ve kurularınız kullarımdan en takvalı bir kimse gibi olsalar benim saltanatımda sivrisineğin kanadı kadar bir şey artmaz. sizin öncekileriniz ve sonrakileriniz, ölüleriniz ve dirileriniz yaşlarınız ve kurularınız kullarımdan en kötü ve bedbaht bir kimse gibi olsalar benim saltanatımdan sivrisineğin kanadı kadar bir şey eksilmez. sizin öncekileriniz ve sonrakileriniz, ölüleriniz ve dirileriniz yaşlarınız ve kurularınız büyük bir meydanda toplansa ve herkes hayalinde canlandırabileceği her şeyi istese hepsini veririm ve bu verilenler benim mülkümden hiç bir şey eksiltmez; ancak bir kişinin denize iğne daldırıp çıkardığında ne kadar su eksilirse o kadar eksilir. Çünkü ben cömerdim, varlık sahibiyim, güçlüyüm istediğimi yapabilirim, bağışlamam bir söze bağlıdır. Azabım da yine bir söze bağlıdır. Bir şeyin olmasını istediğimde sadece ol derim ve o şey hemen oluverir.” (Müslim, Birr ve Sıla: 17; İbn Mâce, Zühd: 27) hadis hasendir. Bazıları da bu hadisi Şehr b. Havşeb’den, Ma’dikerb’den ve Ebû Zerr’den benzeri şekilde rivâyet etmişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		}
	]
}