{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Allah Cenneti ve Cehennemi yarattığında Cibrîli Cennet'e gönderdi ve şöyle dedi: Cenneti ve Cennetlikler için hazırladığım şeylere bak gözden geçir. Cibril Cennete geldi, Cenneti ve Cennet’teki Cennetlikler için hazırlanan şeyleri gözden geçirdi ve Allah’a döndü ve şöyle dedi: İzzetin hakkı için kim bu Cennet’teki hazırlananı görürse mutlaka girmek isteyecektir. Böylece Allah emretti ve Cennet, güçlük ve zorluklarla kuşatıldı ve Allah Dön ve Cenneti ve Cennet’te Cennetlikler için hazırladıklarıma bak gözden geçir buyurdu. Cibril Cennete döndü ve orayı güçlüklerle kuşatılmış olarak buldu. Ve Allah’a döndü, İzzetin hakkı için Cennete hiç kimsenin giremeyeceğinden korktum. Bunun üzerine Allah: Cehenneme git Cehennemi ve Cehennemlikler için hazırladığım şeyleri kontrol et gözden geçir buyurdu. Cibril Cehenneme gitti bir de ne görsün sıkıntılar, işkenceler ve ızdıraplar birbiri üstüne yığılmış. Allah’a döndü ve şöyle dedi: İzzetine yemin olsun ki kim Cehennemin durumunu işitir ve oraya girer, dedi. Allah Cehenneme emretti de etrafı şehvetlerle kuşatıldı. Bunun üzerine Cibril’e: Cehenneme dön buyurdu Cibril Cehenneme döndü, İzzetin hakkı için hiç kimsenin Cehennem’den kurtulamayıp oraya gireceğinden korktum.” Diğer tahric: Buhari rikak; Müslim, Cennet; Nesai iman, beya’; Müslim, Cennet Ebu Davud, sunne; Darimi, rikak; Ahmed b. Hanbel) Tirmizî: Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 38
			}
		}
	]
}