{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "Ebû’d Derdâ (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Cehennemlik olanlara azâblarına eşit biçimde açlık verilir de doyurulmaları için yardım isterler, kendilerine “Dari`” denilen acı ve kuru dikenler ikram edilecektir o dikenler ne besler ne de açlığı giderir. (88 Gaşiye sûresi 6-7) sonra yine doyurulmalarını isterler de kendilerine boğazdan geçmeyen dikenli yemekler ikram edilir (73 Müzzemmil: 13) Dünyada boğaza duran yiyecekleri içecekle geçirdiklerini hatırlayarak kendilerine içecek yardımı yapılmasını isterlerde kendilerine demir çengelli kaynar sular ikram edilir onlar yüzlerine yaklaştığında yüzlerini yakar ve kavurur. Karınlarına girdiği zaman karınlarında bulunan her şeyi parçalar bu arada Cehennem bekçilerini çağırın derler. Cehennem bekçileri şöyle derler: Elçilerimiz size apaçık delillerle gelmiş değiller miydi? Onlar da evet diyecekler ve Cehennem bekçileri: Yalvarın bakalım! Allah’tan gelen gerçekleri inkar edenlerin yalvarması boşunadır.” (40 Mü’min 50) kafirler Mâlik’i çağırın deyip, “Ey Mâlik, Rabbin hükmünü verip işimizi bitiriversin böyle yapmaktansa ölüp kül ve kömür olmak iyidir” diyecekler. Mâlik te cevap verip şöyle diyecek: “Hayır siz burada ölmeden bu şekilde ebedi kalacaksınız.” (43 Zuhruf: 77) diyor ki: Bize bildirdiğine göre kafirlerin çağırması ile Mâlik’in onlara cevap vermesi arasında bin yıl geçecektir. (sallallahü aleyhi ve sellem) sözünü şöyle sürdürdü: Sonra kafirler, Rabbinize dua edin çünkü Rabbinizden başka rahmeti bol bir kimse yoktur derler ve şu duayı yaparlar: “Ey Rabbimiz bize kötülüklerimiz üstün geldi de bu yüzden yoldan çıkan kimseler olduk Ey Rabbimiz bizi bu Cehennem’den çıkar eğer tekrar işlediğimiz günahlara dönersek o zaman gerçekten zâlimlerden olmuş oluruz.” (23 Müminûn 106-109) “Allah ta onlara Alçaldıkça alçalın yıkılıp kalın orada susun konuşmayın benimle” (23/108) diyecektir. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: Her kurtuluş çaresinden ümidlerini kesecekler işte o zaman bağrışıp çağrışmaya pişmanlığa ve yazıklar olsun bize demeye başlayacaklardır.” (Tirmizî rivâyet etmiştir.) b. Abdurrahman diyor ki: Hadisçiler bu hadisi merfu olarak rivâyet etmiyorlar. Bu hadis A’meş’den, Şimr b. Atıyye’den, Şehr b. Havşeb’den, Ümmü Derdâ’dan ve Ebû’d Derdâ’dan kendi sözü olarak rivâyet edildiğini bilmekteyiz dolayısıyla merfu değildir. b. Abdulaziz hadisçiler yanında güvenilir bir kişidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		}
	]
}