{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "Yahya b. Ya’mur (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Kader konusunu inkar konusunda ilk konuşan kişi Ma’bed el Cühenî idi nihayet ben ve Humeyd b. Abdurrahman el Hımyerî ile birlikte çıkıp Medîne’ye kadar geldik. Peygamber (sallallahü aleyhi ve sellem)’in ashabından bir kişi ile karşılaşırsak ona şu kimselerin ortaya çıkardıkları kader konusunu soracağız dedik. Derken Abdullah b. Ömer ile karşılaştık mescidden dışarı çıkıyordu arkadaşımla birlikte onun yanına vardık. Arkadaşımın bu konuda konuşmayı bana bırakacağına inandığım için İbn Ömer’e: Ey Ebû Abdurrahman: Bazı kimseler Kur’ân okuyorlar ve ilimde derin meselelere dalıyorlar kader diye bir şeyin olmadığını her işin hemen o anda meydana geliveren bir durum olduğunu söylüyorlar. Abdullah b. Ömer şöyle dedi: Onlarla bir daha karşılaşırsan benim onlardan uzak olduğumu onların da benden uzak olduklarını kendilerine haber ver. Abdullah’ın yeminle söyleyebileceği bir gerçek varsa oda şudur: Onlardan biri Allah yolunda Uhud dağı kadar altın harcasa kadere ve kaderin hayrına ve şerrine iman etmedikçe kendisinden kabul edilmez. b. Ya’mur dedi ki: Sonra Abdullah b. Ömer bir hadis anlatmaya başladı ve dedi ki: Ömer b. Hattâb şöyle demiştir: Bir zamanlar Rasûlüllah (sallallahü aleyhi ve sellem)’in yanında idik. Bu esnada elbisesi bembeyaz saçları simsiyah bir adam çıkageldi. Üzerinde yolculuk izleri görülmüyordu, içimizden hiçbir kimse de kendisini tanımıyordu. Bu kimse Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına geldi dizini Rasûlüllah (sallallahü aleyhi ve sellem)’in dizine yapıştırdı ve Ey Muhammed! İman nedir? Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Allah’a, meleklerine, kitaplarına, peygamberlerine ahiret gününe, hayır ve şerri ile kadere inanmaktır. Sonra o adam İslam nedir? diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: Allah’tan başka ilah olmadığına, Muhammed’in, Allah’ın kulu ve elçisi olduğuna şehâdet edip namazı kılmak Zekât vermek haccetmek ve Ramazan orucunu tutmaktır. Sonra o adam ihsan nedir? Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem) de şöyle buyurdu Allah’ı görür gibi ibadet etmendir. Sen onu görmesen bile o seni her an görmektedir. Ömer dedi ki: Tüm bu sorduğu sorularda Rasûlüllah (sallallahü aleyhi ve sellem)’in cevabı üzerine o kimse hep “doğru söylüyorsun” diyordu. Biz de bu adama hayret ettik, hem soru soruyor hem de doğru söyledin diyerek tasdik ediyordu. O adam tekrar sordu: Kıyamet ne zaman kopacaktır? Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: Kıyamet hakkında soru sorulan kişi; soran kişiden daha bilgili değildir. Bu sefer o adam kıyametin alametleri nedir? Diye sordu. Rasûlüllah (sallallahü aleyhi ve sellem)’de şöyle buyurdu: Cariyenin hanımefendisini doğurması, (yani doğan çocuklar ana ve babalarına köle muamelesi yapacaklar) yalın ayak çıplak ve fakir koyun çobanlarını yaptırdıkları binalarla boy ölçüşürken görmendir. Ömer dedi ki: Bu olaydan üç gün sonra Rasûlüllah (sallallahü aleyhi ve sellem), benimle karşılaştı ve Ey Ömer! O soru soran kim idi! biliyor musun? O Cibril idi, size dini konuları öğretmeye gelmişti.” (Müslim, İman: 1; Nesâî, İman: 6)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		}
	]
}