{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"41": "Chapters on Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "Kays b. Kesîr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Bir adam Medîne’den Şam’da bulunan Ebû’d Derdâ’nın yanına geldi. O da şöyle dedi. Ey kardeşim seni buraya kadar getiren sebeb nedir? Adam: Rasûlüllah (sallallahü aleyhi ve sellem)’den rivâyet ettiğini haber aldığım bir hadistir diye cevap verdi. Ebû’d Derdâ sen başka bir iş için gelmedin mi dedi. Adam: “Hayır” dedi. Ebû’d Derdâ ticaret için de mi gelmedin dedi. Adam: “Hayır” dedi. Sadece o hadisi öğrenmek için geldim dedi. Bunun üzerine Ebû’d Derdâ şöyle dedi: Ben Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işittim: “Kim ilim elde etmek için bir yol tutarsa Allah’ta onu Cennetine giden yola iletir. Melekler ilim öğrencisinin razı olması için kanatlarını indirirler. Bir âlim için göktekiler ve yerdekiler hatta denizdeki balıklar bile o âlimin bağışlanması için Allah’a yalvarırlar. Âlim bilgili bir kimsenin cahillikle ibadet eden bir kimseye karşı üstünlüğü, Ayın diğer yıldızlara üstünlüğü gibidir. peygamberlerin varisleridirler. Peygamberler miras olarak ne dinar ne de dirhem bırakmışlardır; onlar sadece miras olarak ilim bırakmışlardır. Kim ilimden nasibini alırsa çok büyük hayırlara kavuşmuş olur.” (Ebû Dâvûd, İlim: 17; İbn Mâce, Mukaddime: 27) Bu hadisi sadece Âsım b. Reca b. Hayve’nin rivâyetiyle bilmekteyiz. Bence bu hadisin senedi burada olduğu gibi muttasıl değildir. Mahmûd b. Hıdaş aynı senedle bu hadisi bize aktarmıştır. Aynı zamanda bu hadis Âsım b. Reca b. Hayve’den, Velid b. Cemil’den, Kesîr b. Kays’tan ve Ebû’d Derdâ’dan da rivâyet edilmiş olup bu rivâyet Mahmûd b. Hıdaş’ın rivâyetinden daha sahihtir. Muhammed b. İsmail “Bu daha sahihtir” demektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		}
	]
}