{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "İbn Mes’ûd (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), akşam namazını kıldırdıktan sonra kalktı Abdullah b. Mes’ûd’un elinden tuttu, onu Mekke’nin Batha denilen yerine kadar çıkardı. Sonra onu oturttu ve çevresine bir çizgi çizerek şöyle buyurdu: Bu çizgiden dışarıya asla çıkma! Sana bazı kimseler gelecekler onlarla konuşma! Çünkü onlar seninle konuşmayacaklardır. Rasûlüllah (sallallahü aleyhi ve sellem) istediği yere çekip gitti. Ben çizginin içersinde oturmakta iken cisimleri ve saçları sudanlılara benzeyen bazı kişiler yanıma geldiler ne avretlerini görüyor nede üzerlerinde bir elbise... Bana kadar geliyorlar fakat çizgiyi geçemiyorlardı. Sonra Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına doğru yöneliyorlardı. Gecenin son kısmı olunca onlar gelmediler fakat Rasûlüllah (sallallahü aleyhi ve sellem) geldi. Ben oturmaya devam ediyordum, şöyle buyurdu: Gece boyu ayaktayım sonra benim çizgimin içersine girdi uyluğumu yastık yapıp uyudu. Rasûlüllah (sallallahü aleyhi ve sellem) uyuduğunda hafif horultu ile uyurdu. Ben oturuyor, Rasûlüllah (sallallahü aleyhi ve sellem)’de dizimi yastık yapıp uyurken üzerlerinde beyaz elbiseler olan bazı kimseler gözüme ilişti. Onlardaki güzelliği ancak Allah bilir. Bana kadar geldiler bir kısmı Rasûlüllah (sallallahü aleyhi ve sellem)’in başucunda bir kısmı da ayak ucunda oturdular ve aralarında şöyle konuştular: “Hiçbir kul görmedik ki bu peygambere verilen şeyler ona da verilmiş olsun, onun gözleri uyuyor fakat kalbi uyanıktır. O’na dair bir örnekleme yapınız. bir büyük lider durumunda olup bir saray yaptırmıştır ve bir sofra kurarak insanları yemeye ve içmeye çağırmıştır. Kim onun davetine uyarsa yemeğinden yer ve içeceğinden içer. Kim de icabet etmezse ona ceza vardır -veya azab vardır- sonra onlar dağılıp gittiler bu sırada Rasûlüllah (sallallahü aleyhi ve sellem) uyandı. Bunların söylediklerini işittin mi? Kimdir onlar bilir misin? Ben de Allah ve Rasûlü daha iyi bilir dedim. Rasûlüllah (sallallahü aleyhi ve sellem) onlar meleklerdir, buyurdu. Getirdikleri örnekleme nedir biliyor musun? Ben de Allah ve Rasûlü daha iyi bilir dedim. Bunun üzerine buyurdular ki: Rahman olan Allah Cenneti yaptı kullarını Cennete davet etti. Kim bu çağrıya icabet ederse Cennete girer, kim de çağrıya kulak asmazsa Rahman onlara azâb eder ve cezalandırır.” (Dârimî, Mukaddime: 17) Bu hadis bu şekliyle hasen sahih garibtir. Temime, Huceymî’li olup adı Tarîf b. Mûcâlid’tir. Ebû Osman en Nehdî’nin ismi Abdurrahman b. Müll’dür. Mu’temir’den bu hadisi rivâyet eden Süleyman et Teymî ise Süleyman b. Tarhan’dır. Teym oğullarına indiği için ona nispet edilmiştir. Ali, Yahya b. Saîd’den naklederek şöyle dedi: Süleyman et Teymî’den daha çok Allah’tan korkan birini görmedim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		}
	]
}