{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "Hâris (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Mescide uğradım cemaati bazı dedikodulara dalmış buldum ve Ali’nin yanına girerek şöyle dedim: Ey Mü’minlerin emiri! İnsanların lüzümsuz dedikodulara daldıklarını görmüyor musunuz? Bunun üzerine Ali gerçekten böyle yapıyorlar mı? diye sordu; ben de evet dedim. Bunun üzerine Ali şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem)’den işittim şöyle buyurmuştu: Dikkat edin büyük bir fitne olacaktır! Ben de bu fitneden kurtuluş nasıl olacaktır Ey Allah’ın Rasûlü! dedim. Şöyle buyurdular: Allah’ın Kitab’ına sarılmakla çünkü onda sizden öncekilerin haberi, sizden sonrakilerin haberi, aranızdaki meselelerin hükmü ondadır. O hak ile batılı birbirinde ayıran kesin bir hüküm olup saçmalama değildir. Her kim zorbalık yaparak ondan uzaklaşırsa Allah onun işini bitirir. Her kim de doğru yolu o Kur’ân’dan başkasında ararsa Allah onu sapıklığa düşürür. O, Allah’ın sağlam ipidir ve hikmet dolu sözleridir. O Sırat-ı müstakîm’dir. O Kur’ân arzu ve isteklerin bozamadığı dillerin karışıklığa düşüremediği, ilim adamlarının kendisinden doyamadığı fazla tekrarlamakla eskimeyen ve bıkkınlık vermeyen hayranlık veren yönleri, bitip tükenmeyen öyle bir kitaptır ki: Cinlerden bir gurup onu dinleyince şöyle demek mecburiyetinde kalmışlardır: “Biz ne güzel bir Kur’ân dinledik, doğruyu eğriden ayırt etme bilincine ulaştıran bir Kur’ân ve böylece ona iman ettik artık bundan sonra Rabbimizden başkalarına ilahlık yakıştırmayacağız.” (Cin süresi: 1-2) dayanarak konuşan doğru söz söylemiştir. Onunla amel eden sevap kazanır onunla hükmeden adaletli davranmış ona davet eden doğru yola iletilmiş olur. Ey A’ver bu sözleri iyi dinle! (Dârimî, Fedail-ül Kur’ân: 27) Bu hadisi sadece bu şekliyle bilmekteyiz. Senedi mechuldûr. Harîs’in rivâyeti hakkında söylenti vardır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		}
	]
}