{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "Abdullah b. Ömer, Ebû Bekir es Sıddîk (radıyallahü anhüma)’dan şöyle aktarmıştır: Rasûlüllah (sallallahü aleyhi ve sellem)’in yanındaydım şu âyet indirildi: (Nisa 123. âyet) “Öteki alemdeki kurtuluş; ne sizin vahye dayanmayan kuruntularınızla, ne de bize de kitap verildi diyen, önceki toplumların kuruntularıyla gerçekleşecek değildir. Kim bir kötülük yaparsa, onunla cezalanır, kendisi için Allah’tan başka dost da, yardımcı da bulamaz.” üzerine Rasûlüllah (sallallahü aleyhi ve sellem), “Bana indirilen bir ayeti sana okuyayım mı?” buyurdu. Ben de “Evet oku! Ey Allah’ın Rasûlü” dedim. Rasûlüllah (sallallahü aleyhi ve sellem), o ayeti bana okudu bu esnada ben sırtımdaki bir ağrıdan dolayı farkında olmadan dolayı gerindim. Rasûlüllah (sallallahü aleyhi ve sellem): “Neyin var! Ey Ebû Bekir” diye sordu. Ben de “Anam, babam yoluna feda olsun Ey Allah’ın Rasûlü” dedim. Hangimiz kötülük yapmamıştır, bizler yaptıklarımızla cezalandırılacağız! Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), buyurdular ki: “Sana ve tüm mü’minlere gelince sizler yaptığınız kötülüklerin cezasını bu dünyada çekecek ve Allah’a günahsız olarak kavuşacaksınız. Diğer kafir olanlara gelince kötülükleri onlar için birikecek ve neticede bunun cezasını kıyamet günü çekeceklerdir.” (Müsned: 23) Bu hadis garib olup senedinde söylenti vardır. Mûsâ b. Übeyde’nin hadis konusunda zayıf olduğu söylenmiştir. Onu Yahya b. Saîd ve Ahmed b. Hanbel zayıf bulmaktadırlar. İbn Sebba’ın azâdlısı ise mechüldür. Bu hadis başka bir yoldan da yine Ebû Bekir’den rivâyet edilmiş olup bu rivâyetin de senedi pek sağlam değildir. konuda Âişe’den de hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 91
			}
		}
	]
}