{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "Ebû Humeyd es Saidî (radıyallahü anh)’den aktardığına göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından on kişilik bir guruptan birisi olan Ebû Katâde er Rib’î’den işittim şöyle diyordu; Rasûlüllah (sallallahü aleyhi ve sellem)’in namazını en iyi bileniniz benim bunun üzerine dediler ki: “Müslüman olmada bizden eski değilsin Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına en çok gidip gelenlerimizden de değilsin” dedi ki: Evet o halde anlat bakalım dediler; O’da dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem) namaza başladığında ayakta dosdoğru durur, ellerini omuz hizasına kadar kaldırarak tekbîr alırdı, sonra rükû’a varmak istediğinde yine ellerini omuzları hizasına kadar kaldırır ve tekbîr getirerek rükû’a varırdı. Rükû’da düzgün vaziyette durur başını ne aşağı sarkıtır nede yukarıya doğru dikerdi ellerini de dizleri üzerine koyardı sonra “Semiallahü limen hamideh” diyerek ellerini kaldırır ve doğrulurdu vücudunu aynen ayakta durduğu şekle gelirdi. Sonra secdeye gitmek üzere eğilir Allahü ekber der kollarını koltuklarından aralar ayak parmaklarını serbest bırakır sol ayağını bükerek üzerine oturur ve dimdik dururdu sonra Allahü ekber diyerek ikinci secdeye iner sol ayağını bükerek üzerine oturur ve dimdik durur ve sonra ikinci rek’at için ayağa kalkardı ve ikinci rek’atta da aynen yapardı iki secdeden kalkınca tekbîr alır ellerini omuzları hizasına kadar kaldırırdı ilk namaza başlarken aldığı tekbîr gibi tüm rek’atları bu şekilde kılar namazın biteceği son rek’atın oturumunda sol ayağını çıkararak kalçası üzerine oturur ve selam vererek namazdan çıkardı. (Dârimî, Salat: 92) Bu hadis hasen sahihtir. Hadiste geçen “iki secdeden kalkınca” ifadesi iki rek’atı tamamlayınca anlamındadır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 156
			}
		}
	]
}