{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "Temîm ed Dâri (radıyallahü anh)’den rivâyete göre, Maide sûresi 106. ayeti; “Ey iman edenler! Ölüm size yaklaşıp vasiyyette bulunmak üzereyken yapılacak işler için, kendi aranızda iki dürüst kişi şâhid bulundurun. Yahut evinizden uzakta seyahatte olup yeryüzünde dolaşırken, ölüm işaretleri baş göstermişse, namazdan sonra misafir olduğunuz topluluktan, iki kişiyi alıkoyun; ve eğer içinize bir şüphe düşerse, her birini Allah’a şöyle yemin ettirin: “Bu sözümüzü yakın bir akrabanın hatırı için de olsa, hiçbir bedel karşılığında satmayacağız ve Allah’ın huzurunda şâhid olduğumuz hiçbir şeyi gizlemeyeceğiz, yoksa günahkarlar arasına gireriz.” Benden ve Adiyy b. Bedda’dan başka herkes bu ayetin hükmü altına girmekten kurtulmuştur, dedi. Temim ve Adiyy İslam’dan önce Hıristiyan idiler ticaret için Şam’a gider gelirlerdi. Yine bir seferinde ticaret için Şam’a gelmişlerdi. Adına Büdeyl b. Ebî Meryem denilen Haşim oğullarının azâdlı kölesi olan bir kimse de ticaret mallarıyla birlikte bunlara katılmıştı yanında gümüş bir kap vardı ve onu krala satmak istiyordu. Ticaretinin büyük bir kısmı bu gümüş kap idi. Orada hastalandı ve o iki kişiye vasiyette bulundu ve bıraktığı eşyaları ailesine teslim etmelerini istedi. diyor ki: Büdeyl öldüğü zaman o gümüş kabı alıp bin dirheme satıp parasını ben ve Adiyy b. Bedda paylaştık. Büdeyl’in ailesine geldiğimizde eşyalarını kendilerine verdik. Gümüş kabı aradılar ve bize sordular. Biz de sadece bunları bıraktı başka bir şey vermedi dedik. dedi ki: Peygamber (sallallahü aleyhi ve sellem), Medîne’ye gelip ben de Müslümanlığı kabul edince bu olaydan dolayı kuşkulandım. Büdeyl’in ailesine gelerek durumu kendilerine anlattım, hisseme düşen beş yüz dirhemi kendilerine verdim arkadaşımda da bir bu kadar para olduğunu bildirdim. Adiyy b. Bedda’ı, Rasûlüllah (sallallahü aleyhi ve sellem)’e götürdüler. Rasûlüllah (sallallahü aleyhi ve sellem), kendilerinden delil istedi, delil bulamadılar. Kendi dinlerine göre kutsal saydıkları bir şeye yemin etmelerini emretti. Adiyy ise yemin etti. Bunun üzerine Maide sûresi: 105 - 108. âyetleri nazil oldu: “Ey iman edenler! Siz yalnız kendinizden sorumlusunuz. Eğer siz doğru yolda iseniz, sapıklığa düşenler size hiçbir zarar veremezler. Hepinizin dönüşü Allah’a olacaktır. ve o zaman Allah size hayatta yapmış olduğunuz herşeyi bildirecektir.” “Şâhidliği gereği gibi yapmalarına yahut yeminlerinden sonra, yalancılıklarının ortaya çıkıp, yeminlerinin reddedilmesinden korkmalarına, en uygun olan budur. Öyleyse hayatınızı Allah ve kitabıyla tanzim edin ve O’na kulak verin. Zira Allah, yoldan çıkmışlar topluluğuna, rehberlik ederek doğru yolu göstermez.” Amr b. Âs ile bir başkası kalkıp yemin ettiler ve böylece Adiyy b. Bedda’dan beş yüz dirhem alınmış oldu. (Tirmizî rivâyet etmiştir.) Bu hadis garibtir. Senedi sahih değildir. b. İshâk’ın bu hadisi kendisinden rivâyet ettiği Ebû’n Nadr, bence Muhammed b. Sâib el Kelbî’dir. Ebû’n Nadr künyesi ile anılıyor. Hadisçiler bu adamı terk etmişlerdir. Kendisinin tefsiri vardır. Muhammed b. İsmail’den şöyle dediğini işittim: Muhammed b. Sâib el Kelbî; Ebû’n Nadr künyesiyle anılır. Sâlim’in, Ebû’n Nadr el Medenî’den ve Ümmü Hanî’in azâdlısı Ebû Salih’den hadis rivâyet ettiğini bilmiyoruz. İbn Abbâs’tan başka bir şekilde kısa olarak bu hadis rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 111
			}
		}
	]
}