{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "Ebû Hureyre (r.a.)’den rivâyet edilmiştir: “Rasûlullah (s.a.v.) sesli okuduğu bir namazda namazını bitirince şöyle sordular: Ben namazda okurken sizden biriniz de benimle birlikte okudu mu? Bir adam, evet Ya Rasûlullah deyince; “Bende niçin benim okumama karışılıyor diyordum!” buyurdular. Bunu duyan sahabîler Rasûlullah (s.a.v.)’in sesli okuduğu namazlarda onunla beraber okumalarına son verdiler.” Diğer tahric: Nesaî, İftitah; Müslim, Salat Bu konuda İbn Mes’ud, Imrân b. Husayn, Câbir b. Abdullah’tan da hadis rivâyet edilmiştir. Tirmîzî: Bu hadis hasendir. İbn-ü Ükeyme Elleysî’nin adı Umare’dir kendisine Amr b. Ükeyme de denilir. Zührî’nin arkadaşlarından bir kısmı aynı hadisi rivâyet ederek şu ilaveyi yapmışlardır: “İnsanlar bunu Rasûlullah (s.a.v.)’den işitince okumaya son verdiler.” Bu hadiste imâmın arkasında okumayı kabul edenlere ters düşen bir durum yoktur. Çünkü bu hadisi rivâyet eden Ebû Hureyre’nin şöyle bir rivâyeti daha vardır “Bir kimse namaz kılar kıldığı namazda fatiha sûresini okumazsa namazı eksiktir; tamam değildir. Hadis râvîlerinden biri Ebû Hureyre’ye şöyle dedi: “Bazen imâmın arkasında oluyorum ne yapmalıyım? Ebû Hureyre de, “İçinden oku” buyurdular. Ebû Osman en Nehdî, Ebû Hureyre’den rivâyet ettiği bir hadiste şöyle diyor: “Fatiha sûresi okunmaksızın namaz olmadığı ilan etmemi Rasûlullah (s.a.v.) bana emretti.” Hadisçiler ise: imâmın sesli okuduğu namazlarda okumaksızın imâmı dinlemeleri gerektiği, imâmın okuma anındaki yaptığı durak yerlerini takip ederek o esnalarda okumalıdır” demektedirler. İlim adamları imâmın arkasında okuma konusunda ayrı görüşler ortaya koymuşlar, Peygamber (s.a.v.)’in ashabından ve tabiinden pek çok kimse “imâmın arkasında okunması kanaatindedirler.” Mâlik b. Enes, Abdullah b. Mübarek, Şâfii, Ahmed ve İshâk bu görüştedirler. Abdullah b. Mübarek’in şöyle dediği rivâyet olunmuştur. “Ben imâmın arkasında okurum, herkes de okur, sadece Küfeli bazı kimseler okumazlar ben onların namazlarının da caiz olduğu görüşündeyim.” Bazı ilim adamları bu konuda şiddetli davranarak: “Gerek kendi başına gerek imâmın arkasında olsun fatiha okunmadan namaz olmaz” diyerek Ubade b. Sâmit’in hadisine dayanmışlardır. Ubade b. Sâmit Peygamber (s.a.v.)’in vefatından sonra da imâmın arkasında fatiha sûresini okumuş olup “Fatiha sûresi okunmadan namaz olmaz” hadisiyle amel etmiştir. Şâfii, İshâk ve diğer bir kısım kimseler bu görüştedirler. Ahmed b. Hanbel diyor ki: Rasûlullah (s.a.v.)’in “Fatihayı okumayanın namazı yoktur.” hadisinin manası cemaat olmaksızın kendi başına namaz kılanlar içindir. Ahmed b. Hanbel 313 numaralı Câbir hadisini delil göstererek bu kanaate sahip olmuştur ve şöyle demektedir. Bu hadisi rivâyet eden kimse Rasûlullah (s.a.v.)’in ashabından olup “Fatiha sûresi okunmadan namaz olmaz” sözünü tek başına namaz kılanlar için diyerek yorumlanmıştır. Tüm bunlara rağmen Ahmed b. Hanbel: imâmın arkasında veya kendi başına bile olsa kişinin fatihayı okuması gerektiğini tercih etmektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 164
			}
		}
	]
}