{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "Imrân b. Husayn (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem), Hac sûresi 1-2. âyetleri nazil olunca bir seferde idi ve ashabına o gün nasıl bir gündür biliyor musunuz? dedi. Ashab ta: Allah ve Rasûlü daha iyi bilir dediler. Bunun üzerine buyurdular ki: Allah o gün Adem’e, Cehennemin payını Cehenneme gönder, buyuracak. Adem de Cehennem’in payı ne kadardır? Diye soracak Allah’ta dokuz yüz doksan dokuzu Cehennem’e biri Cennet’e, buyuracaktır. Bunun üzerine Müslümanlar ağlamaya başladılar. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Orta yolu tutarak doğru yola yöneliniz. Hiçbir peygamber yoktur ki ondan önce bir cahiliye dönemi olmamış olsun. Bu sayı cahiliye döneminden olacaktır. Eğer bu sayı cahiliye döneminden tamamlanmaz ise münafıklardan üzeri tamamlanacaktır. Önceki ümmetlere göre sizin örneğiniz, binit hayvanlarının ayaklarındaki tırnaklarının iç kısmındaki çıkıntı gibidir veya devenin bir yanındaki ben kadar sayılırsınız.” Sonra sözlerine şöyle devam etti: “Ben sizin Cennetliklerin dörtte biri olmanızı ümit etmekteyim.” Bunun üzerine Müslümanlar tekbir getirdiler. Sonra Rasûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: “Cennetliklerin üçte biri olmanızı kuvvetle ümid etmekteyim.” Müslümanlar yine tekbir getirdiler. Rasûlüllah (sallallahü aleyhi ve sellem)’de “Cennetliklerin yarısı olmanızı ümid etmekteyim.” Müslümanlar tekrar tekbir getirdiler. Artık Rasûlüllah (sallallahü aleyhi ve sellem)’in üçte ikisini deyip demediğini bilemiyorum. (Müsned: 19055) Bu hadis hasen sahihtir. Bir başka şekilde Imrân b. Husayn tarafından da rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 220
			}
		}
	]
}