{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3178,
			"arabicnumber": 3178,
			"text": "Saîd b. Cübeyr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Mus’ab b. Umeyr’in Irak valiliği döneminde lian yapan karı koca hakkında bunlar birbirinden ayrılması gerekir mi diye bana soruldu. Ben de ne cevap vereceğimi bilemedim. Bulunduğum yerden Mekke’deki Abdullah b. Ömer’in evine gitmek üzere yola çıktım. Mekke’ye vardığımda onun yanına girmek için izin istedim. Bana öğle istirahatı (kaylule) yapmaktadır denildi. Benim sesimi duyunca içeriden kendisi şöyle seslendi: Cübeyr’in oğlu gir, mutlaka seni buraya kadar önemli bir iş getirmiştir. Ben de girdim hayvanın palanından bir yatak yapıp yattığı gözüme ilişti ve hemen Ey Ebû Abdurrahman! Lian yapan karı koca birbirinden ayrılır mı? dedim. Abdullah: “Sübhanallah, evet ayrılır” dedi. Bu konuyu ilk önce soran kişi falan oğlu falandır. Peygamber (sallallahü aleyhi ve sellem)’e gelerek Ey Allah’ın Rasûlü! dedi. Birimiz karısını zina eder durumda görürse ne yapmasını emredersiniz? Konuşsa büyük bir meseleyi ifşa etmiş sussa büyük bir meseleyi geçiştirmiş olacaktır. Peygamber (sallallahü aleyhi ve sellem), sustu ve kendisine cevap vermedi. O kişi o günden sonra tekrar Rasûlüllah (sallallahü aleyhi ve sellem)’e geldi ve gerçek şu ki size sorduğum duruma kendim düşmüş bulunmaktayım. Bunun üzerine Allah Nur sûresi 6. 7. 8. 9. âyetleri indirdi: “6) Kendi eşlerini zina ile suçlayan, fakat kendilerinden başka şâhidleri olmayan kimselere gelince, bu suçlamayı yapanların her biri doğru söylediklerine dair, dört defa Allah’ı şâhid tutsunlar. 7) ve beşincisinde de, bu suçlamayı yapan kişi, eğer yalancılardansa, Allah’ın lanetine razı olduğunu ifade etsin. 8) ve suçlanan kadına gelince, onun kocasının yalan söylediğine dair, Allah’ı dört defa şâhid tutması, bu suça verilecek cezayı ondan giderir. 9) ve beşincisinde, kocası doğruyu söylüyorsa, Allah’ın gazabına razı olduğunu ifade etmesidir.” Sonra Rasûlüllah (sallallahü aleyhi ve sellem), O adamı çağırdı ona bu âyetleri okudu va’z, nasihat ederek hatırlatmalarda bulundu ve dünya azabının ahiret azabından daha hafif olduğunu haber verdi. Adam: Seni hak ile gönderen Allah’a yemin ederim ki bu karım hakkında yalan söylemedim. ikinci olarak kadını çağırdı ona da va’z ve hatırlatmalarda bulundu dünya azabının ahiret azabından çok daha hafif olduğunu bildirdi. Kadın da dedi ki: Hayır seni hak ile gönderen Allah’a yemin olsun ki kocam doğru söylemedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) önce erkekten başladıve erkek kendisinin doğru söylediğine dair Allah’a dört sefer yemin etti, beşincisinde ise eğer yalancılardan ise Allah’ın lanetinin kendi üzerine olmasını diledi. Sonra Rasûlüllah (sallallahü aleyhi ve sellem), kadına döndü kadın kocasının gerçekten yalancı olduğuna dair Allah’a dört defa yemin etti. Beşincisinde şayet kocası doğrulardan ise Allah’ın gazabının kendisi üzerine olmasını diledi. Sonra Rasûlüllah (sallallahü aleyhi ve sellem), onları birbirinden ayırdı. (Buhârî, Tefsir-ül Kur’ân: 27; Müslim, Lian: 17) konuda Süheyl ibn Saîd’den de hadis rivâyet edilmiştir. hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 230
			}
		}
	]
}