{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "Enes b. Mâlik (r.a.)’den rivâyete göre, şöyle demiştir: Nebi (s.a.v) evlenmiş ve zifaf yapmıştı. Bu münasebetle annem Ümmü Süleym hurma keş ve yağdan yapılan “Hays” yemeği yapmıştı ve bir tabağa koymuş ve, Ey Enes bunu Rasûlullah (s.a.v.)’e götür ve ona deki: “Bunu size annem gönderdi. Size selamı var bu yemek biraz az oldu.” Yemeği Rasûlullah (s.a.v.)’e götürdüm, Annemin selamı var bu yemeği gönderdi ve az olduğunu da söyledi dedim. Rasûlullah (s.a.v.) onu oraya bırak sonra bazı kişilerin adlarını vererek falan falanı ve tüm karşılaştığın kimseleri çağır dedi. Ben de isimlerini verdiği kimseleri ve karşılaştığım kimseleri çağırdım. Enes’e sordum kaç kişiydiler diye üçyüz kişi kadar vardı dedi. Rasûlullah (s.a.v.), bana dedi ki: Enes Kase’yi getir. Onlarda içeri girdiler sofa ve hücre doldu. Rasûlullah (s.a.v.) şöyle buyurdu: “Onar kişilik halkalar oluşturulsun ve herkes önünden yesin.” Herkes doyuncaya kadar yedi, bir gurup çıktı bir gurup girdi. Hepsi yedi Rasûlullah (s.a.v.), Ey Enes Kaseyi kaldır buyurdu. Ben de kaldırdım koyduğum zaman mı daha çoktu yoksa kaldırdığım zaman mı daha çoktu bilemiyorum. Davetlilerden bazı insanlar Nebiin evinde oturup sohbete daldılar. Rasûlullah (s.a.v.)’de oturuyordu. Ailesi ise yüzünü duvardan yana çevirmişti. Nebi (s.a.v)’e bu davranışları ağır geldi. Bunun üzerine Nebi (s.a.v) çıktı, öteki hanımlarına selam verdi ve dönüp geldi. Nebi (s.a.v)’in dönüp geldiğini görünce onu üzdüklerini anlayarak kapıya doğru yüklenip çıkıp gittiler. Rasûlullah (s.a.v.) geldi ve ara yerdeki perdeyi indirdi ve ailesiyle zifaf yaptı. Ben ise hücrede oturmakta idim. Rasûlullah (s.a.v.) kısa bir zaman kaldıktan sonra benim yanıma çıktı sonra Ahzab sûresi 53. ayet nazil oldu: “Ey inananlar! İzin verilmedikçe, Nebiin evlerine girmeyin ve yemek için davet edildiğiniz zaman, erkenden gidip, hazırlanmasını beklemeye kalkışmayın. Çağrıldığınızda en uygun zamanda girin, yemeği yiyince hemen ayrılın, lafa dalmayın, bu durum Nebii üzüyordu fakat O, size bunu söylemekten utanıyordu. Ama Allah, doğruyu size öğretmekten çekinmez. Nebi hanımlarından birşey isteyeceğiniz veya soracağınız zaman, perde arkasından isteyin ve sorun. Bu durum, hem sizin kalpleriniz, hem de onların kalpleri bakımından fitne ve kötü zannı giderici, temiz bir davranıştır. Allah’ın Nebiini incitmeniz ve kendisinden sonra, O’nun eşleriyle evlenmeniz, size asla helal değildir. Çünkü bu, Allah katında büyük bir günahtır.” Bunun üzerine Rasûlullah (s.a.v.) bu ayetleri Müslümanlara okudu. Ca’d, Enes’den naklederek şöyle dedi: Bu ayetlerin iniş zamanına en yakın olan benim. Bundan sonra Nebi (s.a.v)’in hanımları kapandılar ve yabancılardan uzak kalmaya başladılar",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 270
			}
		}
	]
}