{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, Nebi (s.a.v) şöyle buyurdu: Musa (a.s.) çok utangaç ve hayalı idi. Hayasından dolayı derisinden bile bir şey görünmezdi. İsrailoğulları bu yüzden kendisine eziyet ederlerdi ve şöyle derlerdi: “Bunun böylece örtünmesinin tek sebebi ya derisinde cilt hastalığı olması veya kasık yarığı hastalığı yada başka bir hastalığı vardır.” Allah, Musa’yı onların söylediklerinden temize çıkarmak istedi. Musa bir gün yalnız kalmıştı, elbiselerini bir taşın üzerine koyarak yıkanmıştı. Yıkanma işini bitirdiği zaman elbiselerini almak üzere taşa yöneldi fakat taş elbiselerini alıp yürümeye başladı. Musa da asasını alarak taşın arkasına düştü ve ey taş! elbisemi ver ey taş elbisemi ver! demeye başladı sonunda İsrailoğullarından bir toplumun yanına bu vaziyette varmış oldu onlarda Musa’yı çıplak vaziyette ve yaratılış olarak insanların en güzeli olarak gördüler. Böylece Allah ta O’nu onları söylemekte oldukları şeylerden temize çıkardı. Rasûlullah (s.a.v.), sözüne şöyle devam etti: Taş durdu, Musa da elbisesini aldı ve giydi. Asasıyla taşa vurmaya başladı. Vallahi Musa’nın asasının darbelerinden dolayı o taşla üç dört ve beş yara izi vardır. İşte Allah’ın Ahzab sûresi 69. ayetinde söylediği sözün anlamı budur: “Ey iman edenler! Siz de Musa’ya eziyet eden, İsrailoğulları gibi olmayın. Unutmayın ki Allah onu, kendisine karşı ileri sürdükleri iddialardan temize çıkardı. Çünkü o, Allah katında pek değerliydi, büyük şeref ve itibar sahibiydi.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 273
			}
		}
	]
}