{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "Ferve b. Müseyk el Murâdî (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)’e geldim ve Ey Allah’ın Rasûlü! Müslümanlıktan yüzçevirenlerine karşı müslümanlığa yönelenleriyle beraber savaşabilir miyim? Rasûlüllah (sallallahü aleyhi ve sellem), onlara karşı bana savaş izni verdi ve beni komutan tayin etti. Yanından çıktığım zaman Gutayfî ne yaptı? Diyerek beni sormuş ve kendisine benim hareket ettiğim bildirilmişti. Hemen peşimden adam gönderip beni geri çevirdi. Yanına geldim kendisi ashabıyla beraberdi. Buyurdu ki: Kavmini İslam’a davet et onlardan müslüman olanlardan Müslümanlıklarını kabul eyle. Kim de müslüman olmazsa sana yeni bir emir verinceye kadar acele etme… Sonradan Sebe’ hakkında indirilen âyetler indirildi. Bunun üzerine bir adam: Ey Allah’ın Rasûlü! Sebe’ nedir? Bir ülke mi, yoksa bir kadın mı? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Sebe’ ne bir ülkedir ne de bir kadın… Fakat O, Arapların on çocuğu olan bir adamdır. Bu çocuklardan altısı Yemen dolaylarına indi dördü de Şam tarafına yerleşmiştir. Şam tarafına inenler: Lahm, Cüzam, Gassan ve Âmile’dir. Yemen’e inenler de Ezd, Eşariler, Hımyer, Müzhiç, Enmar ve Kindelilerdir. Bir adam Ey Allah’ın Rasûlü! Enmar kimlerdir? Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Onlar Has’am ve Becîle’dir. Aynı şekilde bu hadis İbn Abbâs’tan da hadis rivâyet edilmiştir. (Ebû Dâvûd, Huruf: 27) Bu hadis hasen garibtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 274
			}
		}
	]
}