{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3298,
			"arabicnumber": 3298,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), ashabıyla birlikte oturmakta iken üzerlerine bir bulut geldi. Peygamber (sallallahü aleyhi ve sellem), bunun ne olduğunu biliyor musunuz? Diye sordu. Ashab: Allah ve Rasûlü daha iyi bilir dediler. Rasûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: Bu buluttur! Bu bulutlar toprağın sulayıcılarıdır. Allah onları kendisine şükretmeyen kulluk yapmayan kimselere bile gönderiyor. Sonra üzerinizde ne var biliyor musunuz? diye sordu. Ashab: Allah ve Rasûlü daha iyi bilir dediler. Bunun üzerine şöyle buyurdu: O dünyamızın semasıdır, korunmuş bir tavan ve önüne geçilmiş bir dalgadır. Sonra Rasûlüllah (sallallahü aleyhi ve sellem): Bu gökle sizin aranızdaki mesafe ne kadardır? Diye sordu. Ashab: Allah ve Rasûlü daha iyi bilir dediler. Şöyle buyurdu: Sizinle onun arasında beşyüz yıllık mesafe vardır. Sonra konuşmasına şöyle devam etti: Onun üstünde ne var biliyor musunuz? Ashab: Allah ve Rasûlü daha iyi bilir dediler. Şöyle buyurdu: Onun üzerinde iki gök daha vardır ki aralarındaki mesafe beşyüz senelik yoldur… Rasûlüllah (sallallahü aleyhi ve sellem), yedi göğün hepsini saydı her iki göğün arası dünya ile dünya göğünün arası kadardır. Sonra şöyle buyurdu: Onun da üzerinde ne var biliyor musunuz? Ashab: Allah ve Rasûlü daha iyi bilir dediler. Şöyle buyurdu: Onun da üzerinde arş vardır, arş ile yedinci gök arasındaki mesafe iki gök arasındaki mesafe kadardır. Rasûlüllah (sallallahü aleyhi ve sellem), altınızda ne var biliyor musunuz? buyurdu. Ashab: Allah ve Rasûlü daha iyi bilir dediler. Şöyle buyurdu: Altınızdaki yeryüzüdür. Sonra onunda altında ne var biliyor musunuz? buyurdu Allah ve Rasûlü daha iyi bilir dediler. Şöyle buyurdu: O’nun altında başka bir arz vardır ki ikisinin arasındaki mesafe beş yüz senelik yoldur. Rasûlüllah (sallallahü aleyhi ve sellem), yedi arza kadar saydı ve her arzın arasında beş yüz yıllık mesafe olduğunu söyledi. Sonra şöyle buyurdu: Muhammed’in canı kudret elinde bulunan Allah’a yemin olsun ki siz en alttaki dünyaya bir ip sarkıtmış olsaydınız o ip Allah’a kadar ulaşırdı dedi ve Hadid sûresi 3. ayetini okudu. (Müsned: 8472) Bu hadis bu şekliyle garibtir. Eyyûb, Yunus b. Ubeyd ve Ali b. Zeyd’in şöyle dedikleri rivâyet edilmiştir. Hasan, Ebû Hüreyre’den hadis işitmemiştir. ilim adamları bu hadisi şöyle tefsir etmişlerdir: İp ancak Allah’ın ilmi kudreti ve saltanatı üzerine iner. Çünkü Allah’ın ilmi, kudreti ve saltanatı her yerde mevcuttur. Kendisi kitabında bildirdiği gibi arşın üzerindedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 350
			}
		}
	]
}