{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "Ali b. ebî Tâlib (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), ben, Zübeyr ve Mıkdat b. Esved’i göndererek dedi ki: Gidiniz “Hah” bahçesine vardığınız da orada bir kadın bulacaksınız üzerindeki mektubu alıp bana getiriniz buyurdu. Biz de çıktık, atlarımız bizimle koşturuyordu. Nihayet o bahçeye geldik ve birdenbire yolcu kadınla karşılaştık bunun üzerine mektubu çıkar dedik. Ben de mektub falan yok dedi. Biz de ya mektubu çıkaracaksın veya üzerinden elbiseleri çıkaracaksın dedik. Bunun üzerine mektubu saç örgülerinin arasından çıkardı. Mektubu, Rasûlüllah (sallallahü aleyhi ve sellem)’e getirdik. Bir de gördük ki mektup Hatıb b. Beltea’dan Mekke’deki bazı müşrik kişilere gönderilmiş. Hâtıb müşriklere Peygamber (sallallahü aleyhi ve sellem)’in bazı işlerini bildiriyor. (sallallahü aleyhi ve sellem), Ey Hâtıb bu Nedir? diye sordu. Hâtib: Ey Allah’ın Rasûlü! hakkımda hüküm vermek için acele etme ben Kureyş’e sığıntı olarak gelip yerleşen biriyim. Gerçek Kureyşli değilim. Sizin beraberinizdeki olan muhâcirlerin ise mallarını ve ailelerini koruyacak hısımları var. Ben bu Kureyş’in nesebinden olmadığım için onlara bir iyilikte bulunmak istedim ki bu yüzden benim yakınlarımı korusunlar. Bu işi kafir olduğum için veya dinimden döndüğüm için veya küfre razı olduğumdan dolayı yapmış değilim. Bunun üzerine, Peygamber (sallallahü aleyhi ve sellem), Doğru söyledi buyurdu. Ömer b. Hattâb ise; Ey Allah’ın Rasûlü! Beni bırak ta şu münafığın başını uçurayım. Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: O, Bedir gazasına katılmıştır, ne biliyorsun? Belki de; Allah, Bedire katılanlara bakmış ve onlara: “Dilediğinizi yapın, Ben sizi affetmişimdir,” buyurmuştur. İşte, Mümtahine sûresi 1. âyet, Hâtıb b. Beltea hakkında inmiştir; “Ey iman edenler! Benim de düşmanım, sizin de düşmanınız olan kimseleri dost edinmeyin. Onlar size gelen gerçek mesajı inkâr ettikleri, Rabbiniz olan Allah’a inandığınızdan dolayı, Rasulünü ve sizi yurdunuzdan sürüp çıkardıkları halde, siz onlara sevgi belirterek mektup ulaştırıyorsunuz. Eğer benim yolumda savaşmak ve benim rızamı kazanmak için savaşa çıktınızsa, içinizde onlara sevgi mi besleyip gizliyorsunuz? Oysa ben sizin gizlediğinizi ve açığa vurduğunuz herşeyi bilirim. Sizden kim böyle yaparsa, gerçekten o doğru yolun ortasında, şaşırıp sapıtmıştır.” (Buhârî, Cihâd: 27; Müslim, Fedail-üs Sahabe: 17) dedi ki: İbn ebî Rafi’i gördüm, Ali b. ebî Tâlib’in katibi idi. Bu hadis hasen sahihtir. konuda Amr ve Câbir b. Abdullah’tan da hadis rivâyet edilmiştir. Pek çok kişi bu hadisi Sûfyân b. Uyeyne’den buradaki gibi rivâyet etmiş olup râvîler hadisteki şu bölümü aktarmışlardır: “Ya mektubu çıkarırsın veya elbiselerini atarsın.” hadis aynı zamanda Ebû Abdurrahman b. Yahya’dan, Ali’den yukarıdaki hadise benzer şekilde rivâyet edilmiştir. bu hadiste “Ya mektubu çıkaracaksın ya da elbiseni soyacağız” demişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 357
			}
		}
	]
}