{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Allah’ın, Tahrim sûresi 4. ayeti olan: “İkiniz de tevbe ederek Allah’a yönelin çünkü ikinizin de kalbi haktan ayrılmıştı.” Buyurduğu peygamber hanımlarından iki hanımın kim olduğu konusunda Ömer’e soru sormaya pek istekliydim. Nihayet Ömer haccetti. Bende kendisiyle beraber haccettim. Su kabından kendisine su döktüm o da abdest aldı ve ey mü’minlerin Emiri! Allah’ın, Tahrim sûresi 4. ayetinde bahsettiği iki peygamber hanımı kimlerdir? dedim. Ömer; şu karşılığı verdi: Hayretsana ey Abbâs’ın oğlu! Zührî diyor ki: “Ömer, İbn Abbâs’ın sorusundan hoşlanmamış fakat onu gizlemekte istememişti” dedi. Onlar, Âişe ve Hafsa’dır demişti ve hadisi bana anlatmaya başlamıştı. Kureyş topluluğu kadınlara üstün gelmeye çalışırdık Medîne’ye gelince burada kadınların erkeklere hâkim durumda olduklarını gördük derken bizim kadınlarımız onların kadınlarından bazı şeyler öğrenmeye başladılar. Bir gün hanımıma kızmıştım onun bana karşılık verdiğini gördüm bu karşılık vermesini yadırgamadım. Hanımım: Bunu neden yadırgıyorsun? Vallahi Rasûlüllah (sallallahü aleyhi ve sellem)’in hanımları bile kendisine karşılık veriyorlar hatta onlardan biri günü geceye kadar ondan ayrı geçiyorlar dedi. Bende içimden kendi kendime: “Böyle yapan kadın tamamen zarar ve ziyandadır” dedim. Ümeyyeoğulları semtinde Avali denilen yerde idi. Ensardan bir komşum vardı. Rasûlüllah (sallallahü aleyhi ve sellem)’in yanına nöbetleşe iniyorduk. Bir gün o iner vahiy ve diğer haberleri getirildi. Bir gün de ben iner haberleri ona getirdim. O sıralarda Gassanlıların biz Müslümanlarla savaşmak için atlarını nalladıklarından bahsederdik. Birgün komşum akşam vakti bana geldi ve kapımı çaldı. Ben de çıktım, “Büyük bir hadise oldu” Ben de Gassaniler mi geldiler yoksa dedim. O da: “Bundan daha büyük bir hadise” dedi. Rasûlüllah (sallallahü aleyhi ve sellem), zevcelerini boşadı. Bunun üzerine kendi kendime: “Hafsa kaybetti ve zarardadır” dedim. Böyle bir işin olacağını tahmin ediyordum sabah namazını kılınca elbisemi giydim ve yola çıktım. Hafsa’nın yanına girdiğimde onu ağlar vaziyette buldum: “Rasûlüllah (sallallahü aleyhi ve sellem), sizi boşadı mı?” diye sordum. Hafsa: “Bilemiyorum” dedi. İşte kendisi şu odacıkta uzlete çekilmiştir, dedi. Kalkıp yanına girebilmek için o odaya geldim. Rasûlüllah (sallallahü aleyhi ve sellem)’e hizmet eden siyah bir delikanlıya dedim ki: Ömer için izin iste! İçeri girdi çıktı bildirdim fakat bir şey demedi, dedi. Bunun üzerine mescide gittim. Minberin etrafında ağlayan birkaç kişiyle karşılaştım. Onların yanına oturdum. Sonra sıkıntım daha da arttı tekrar Peygamber (sallallahü aleyhi ve sellem)’e hizmet eden siyahî delikanlıya geldim, Ömer için izin iste dedim girdi çıktı ve: Seni Rasûlüllah (sallallahü aleyhi ve sellem)’e bildirdim fakat bir şey söylemedi dedi. Tekrar mescide gittim oturdum, fakat duramadım yine siyahî gencin yanına geldim. Ömer için izin iste dedim, girdi çıktı fakat seni Rasûlüllah (sallallahü aleyhi ve sellem)’e bildirdim bir şey söylemedi dedi. Ben de arkamı dönüp giderken delikanlı dönüp beni çağırdı; gir sana izin verdi dedi. Ben de girdim, Rasûlüllah (sallallahü aleyhi ve sellem)’i kuru bir hasır üzerine yaslanmış vaziyette buldum ve yanında hasırın izini gördüm ve dedim ki: Ey Allah’ın Rasûlü! Hanımlarını boşadın mı? “Hayır” dedi. Bunun üzerine “Allahü ekber” dedim. Bizlerde aynı durumdayız. Biz Kureyş topluluğu olarak kadınlar üzerinde hâkim idik. Medîne’ye gelince erkeklerine hâkim olan kadınlar topluluğu bulduk. Bizim hanımlarda onlardan bir şeyler öğrenmeye başladılar. Bir gün hanımıma kızmıştım da o da bana karşılık vermişti. Ben de hoş karşılamamıştım. Hanımım: “Niçin yadırgıyorsun” dedi. Vallahi peygamberin hanımları bile ona karşılık veriyorlar hatta onlardan biri bir günü geceye kadar ondan ayrı geçiriyor. Sonra Hafsa’ya Rasûlüllah (sallallahü aleyhi ve sellem)’e karşılık verir misin? diye sordum. O da evet dedi. Hatta bizden birimiz gününü geceye kadar ondan ayrı geçirir, dedi. Ben de sizden bunu kim yapmışsa kaybetmiş ve zarardadır. Herhangi biriniz, Rasûlüllah (sallallahü aleyhi ve sellem)’in darılması yüzünden Allah’ın gazabına uğramaktan ve helak olmaktan emin olabilir? Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) gülümsedi. Hafsa’ya dedim ki: Rasûlüllah (sallallahü aleyhi ve sellem)’e karşılık verme ondan bir şey isteme her ne istersen benden iste arkadaşın (Âişe) senden daha güzel ve Rasûlüllah (sallallahü aleyhi ve sellem)’e daha sevgili ise ve buna da güvenerek onun karşılık vermesi seni aldatmasın dedim. Rasûlüllah (sallallahü aleyhi ve sellem), bir kere daha gülümsedi. Sonra Ey Allah’ın Rasûlü! konuyu değiştirelim mi? dedim. Rasûlüllah (sallallahü aleyhi ve sellem): “Evet” dedi. Bunun üzerine başımı kaldırdım ve o arada üç tane işlenmemiş ham deri gördüm ve “Ey Allah’ın Rasûlü! Ümmetine bol rızık vermesi için Allah’a duâ et…” dedim. Kendisine ibadet etmedikleri halde İran ve Rumlara bol bol vermiştir. Oturduğu yerden doğruldu ve: “Ey Hattâb’ın oğlu yoksa sen şüphe içinde misin? O toplumlara iyilikler ve nimetler çabucak bu dünya hayatında kendilerine verilmiştir.” Rasûlüllah (sallallahü aleyhi ve sellem), bir ay boyunca hanımlarının yanına girmemeye yemin etmişti. Allah bu konuda peygamberine kızdı ve bu konuda ona yemin keffâreti vermesini emir buyurdu. (Buhârî, İlim: 27; Müslim, Sıyam: 17)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 370
			}
		}
	]
}