{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3319,
			"arabicnumber": 3319,
			"text": "Abdulvahit b. Süleym (r.a.)’den rivâyete göre, şöyle demiştir: Mekke’ye geldim Atâ b. ebî Rebah ile karşılaştığımda: “Ey Ebû Muhammed! Bizim o taraflarda bazı kişiler kader konusunda ileri geri konuşuyorlar” dedim. Ata şu karşılığı verdi. Ben Ubade b. Sâmit’in oğlu Velid ile karşılaşmıştım o şöyle demişti: Babam bana Rasûlullah (s.a.v.)’den şöyle işittiğini söyledi: Allah’ın yarattığı ilk şey kalemdir sonra o kalem'e yaz dedi. O da sonsuza kadar olacak şeyleri yazdı. Bu hadis buradakinden çok uzuncadır. Diğer tahric: Müsned: 21647 (24473) Tirmizî: Bu hadis hasen garibtir. Bu konuda İbn Abbâs’tan da hadis rivâyet edilmiştir. Hadis’in Müsned’deki metni: Ubade b. el-Velid b. Ubade, babasından bildiriyor: Hasta olan Ubade'nin yanına girdim. Onun ölmek üzere olduğunu gördüm. Ona: \"Ey Babacığım! Bana vasiyetini bildir, ne söylemek istiyorsan söyle\" dedim. Bunun üzerine: \"Beni oturtun\" dedi. Onu oturttukları zaman da: \"Evladım! Kaderde hayır ve şerrin Allah'tan olduğuna iman etmedikçe imanın tadını tadamaz ve Allah'ı hakkıyla bilemezsin\" dedi. Kendisine: \"Ey babacığım! Kaderin hayrını şerrinden nasıl ayırt edebilirim?\" dediğimde: \"Allah'ın senin hakkında yazmadığı bir şeyin asla başına gelmeyeceğini ve Allah'ın senin hakkında yazdığı bir şeyin mutlaka seni bulacağını bilmendir. Evladım! Resulullah (Sallallahu aleyhi ve Sellem)'in şöyle buyurduğunu işittim: ''Ailah ilk olarak kalemi yarattı. Sonra ona: ''Yaz!'' buyurdu. Kalem de o zamandan kıyamet gününe kadar olacak her şeyi yazdı. '' Evladım! Eğer bu hal üzere ölmezsen cehenneme girersin.\" [Sahih]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 371
			}
		}
	]
}