{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3368,
			"arabicnumber": 3368,
			"text": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.), şöyle buyurdu: “Allah, Adem’i yaratıp ruhundan ona üfürdüğü zaman Adem aksırdı ve Elhamdülillah diyerek Allah’ın izniyle, Allah’a hamdetti. Rabbi ona şöyle buyurdu: “Allah seni esirgesin. Meleklere veya meleklerden oluşan şu guruba git ve: “esselamü aleyküm” de. Onlarda: “ve aleykümselam ve Rahmetullah” dediler. Sonra Adem Rabbine döndü, Rabbi buyurdu ki: “İşte senin selamın ve oğullarının kendi aralarında verip alacakları selam budur.” Allah: İki avucu kapalı vaziyette Adem’e hangisini istersen seç buyurdu. Adem de Rabbimin sağ elini seçtim dedi. Rabbimin her iki eli de kutlu ve mübarektir. Sonra Rab sağ elini açtı ve onun içinde Adem ve zürriyeti vardı. Adem: Ey Rabbim bunlar kimdir? Rabb: Bunlar senin zürriyetindendir. Adem bir de ne görsün! Her insanın ömrü, iki gözü arasında yazılmıştır. Onlar arasında parlak veya parlaklıklarından biri vardı ki; Adem: Ya Rabbi bu kimdir? diye sordu. Bu senin oğlun Dâvûd’tur. Ben kendisine kırk yıl ömür yazdım. Adem: Ey Rabbim onun ömrünü artır dedi. Allah’ta ben ona o kadar ömür yazdım dedi. Adem ben ömrümden altmış seneyi o'na bağışladım. Allah: Sen ve O, sen bilirsin buyurdu. Sonra Adem, Allah’ın dilediği sûre Cennet'e yerleştirildi. Sonra Cennet’ten yeryüzüne indirildi. Sonra Adem, ömrünü saymakta idi. Ölüm meleği kendisine gelip canını almak isteyince, Adem; ölüm meleğine acele ettin dedi. Bana bin yıl ömür yazılmıştır. Ölüm meleği: Evet ama sen oğlun Dâvûd’a altmış senesini vermiştin. Adem hatırlayamadı ve unuttu işte bu yüzden ümmeti de unutmaktadır. İşte o günden bu yana yazmak ve şâhidler emredilmiştir.” (Taha sûresi 115. ayet)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}