{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3421,
			"arabicnumber": 3421,
			"text": "Ali b. ebî Tâlib (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.), namaza kalktığı zaman şöyle derdi: “Yönümü, yerleri ve gökleri yaratan Allah’a samimi bir şekilde yönelttim. Ve ben müşriklerden değilim. Benim namazım ve tüm kulluklarım, ölümüm ve diriliğim Alemlerin rabbi olan Allah içindir. Onun hiçbir ortağı yoktur. Böyle olmam bana emredildi ve ben Müslümanlardanım. Allah’ım hükümdar sensin, senden başka hükümdar yoktur. Sen benim hayatımı programlayansın. Ben de senin kulunum. Ben nefsime zulmettim, günahlarımı itiraf ettim. Benim tüm günahlarımı bağışla gerçekten günahları bağışlayan sensin. Beni en güzel ahlaklı olmaya yönelt gerçekten sen ahlakın en güzeline yöneltirsin. Benden kötülükleri gider çünkü kötülükleri ancak sen giderirsin. Sana iman ettim sen ne yüce ve ne büyüksün, senden bağışlanma diler ve sana yönelirim. Rükû’a vardığında ise şöyle derdi: “Allah’ım sadece senin önünde eğildim sana inandım irademi sana teslim ettim. Kulağım gözüm iliklerim kemiklerim ve tüm sinirlerim sana olan sevgi ve korku ile saygı halindedir.” Başını rükû’dan kaldırdığı anda ise şöyle derdi: “Ey Rabbim gökler, yerler ve her ikisi arasındaki mesafeler dolusu derdi. Ve dilediğin şeyler dolusu kadar hamd sanadır.” Secdeye vardığında ise: “Allah’ım sadece sana secde ettim, sana inandım, irademi sana teslim ettim. Yüzüm, kendisini yaratıp şekil veren kulak ve göz verene secde etti. Her şeyi en güzel şekliyle yaratan Allah güzellerin güzeli ve ne mübarektir.” Sonra teşehhüd oturumu ve selam arasında da şöyle derdi: “Allah’ım öne alıp işlediğimi ve ertelediğimi, gizli ve aşikar olarak yaptığımı senin benden daha iyi bildiğin günahlarımı bağışla, öne geçiren ve geri bırakan sensin senden başka gerçek ilah yoktur.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 52
			}
		}
	]
}