{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3422,
			"arabicnumber": 3422,
			"text": "Ali b. ebî Tâlib (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) namaza kalktığı vakit şöyle derdi: “Yüzümü yerleri ve gökleri yaratana samimi olarak yönelttim ve ben müşriklerden değilim. Muhakkak ki benim namazım ve tüm ibadetlerim yaşamam ve ölümüm, alemlerin rabbi olan Allah içindir. Onun ortağı yoktur. Ben bu şekilde söylemek ve yaşamakla emrolundum. Ve ben Müslümanlardanım. Allah’ım hükümdar sensin senden başka gerçek ilah yoktur. Sen benim Rabbimsin ben de senin kulunum ben benliğime zulmettim, günahımı itiraf ettim. Tüm günahlarımı affet senden başka günahları bağışlayacak kimse yoktur. Ancak sen varsın. Beni en güzel ahlaka ulaştır. Senden başka güzel ahlaka ulaştıracak yoktur. Kötülükleri benden uzaklaştır. Senden başka kötülükleri uzaklaştıracak kimse yoktur. Her türlü emrine hazır vaziyetteyim. Senden başkasına kul köle olmam! Bütün hayırlar senin elindedir. Kötülükler senden değildir. Ben senin sayende varım ve sana dönmüşüm. Sen ne ulusun ve ne yücesin. Senden günahlarımın bağışlanmasını diler ve sana yönelirim.” Rükû’a vardığında ise şöyle derdi: “Allah’ım sadece senin önünde eğildim sana iman ettim irademi sana teslim ettim. Kulağım gözüm sinirlerim ve kemiklerim sana olan sevgi ve korku ile saygı halindedir.” Rükû’dan doğrulunca ise şöyle derdi: “Allah’ım gökler ve yerler dolusu ve ikisinin arasındaki mesafeler dolusu ve dilediğin şeyler dolusu kadar hamd ve övgüler sana mahsustur.” Secdeye vardığında ise: “Allah’ım sadece sana secde ettim sana inandım irademi sana teslim ettim. Yüzüm kendisini yaratıp şekil veren kulak ve göz verene secde etti. Her şeyi en güzel şekliyle yaratan Allah, güzellerin güzeli ve ne mübarektir.” Sonra teşehhüd oturumu ve selam arasında da şöyle derdi: “Allah’ım, öne alıp işlediğimi ve ertelediğimi, gizli ve aşikâr olarak yaptığımı ve aşırı giderek işlediğim tüm günahlarımı ve senin benden daha iyi bildiğin günahlarımı affet bağışla. Öne geçiren ve geri bırakan sensin. Senden başka gerçek ilah yoktur, ancak sen varsın.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 53
			}
		}
	]
}