{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3570,
			"arabicnumber": 3570,
			"text": "İbn Abbâs (r.a.)’dan rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.)’in yanında iken ansızın Ali b. ebî Tâlib geldi ve: “Annem babam sana feda olsun Ey Allah’ın Rasûlü! Bu Kur’ân, benim göğsümden kaybolup gidiyor ve buna engel de olamıyorum.” Bunun üzerine Rasûlullah (s.a.v.), ona: “Ey Ebû’l Hasan sana bazı kelimeler öğreteyim mi? ki Allah bu kelimelerle seni faydalandırsın, sendeki o şeyler de başkalarını faydalandırsın ve öğrendiğin şeyi de kalbine yerleştirsin. Ali: “Evet, ey Allah’ın Rasûlü! öğret bana” dedi. Rasûlullah (s.a.v.) şöyle buyurdu: “Cuma gecesi gecenin son üçte birinde kalkmaya gücün yeterse bu saat meleklerin hazır bulundukları bir saattir bu saatte duâ kabul edilir. Kardeşim Yakup Nebi de çocuklarına: “İleride sizin için rabbime duâ edeceğim” (Yusuf sûresi: 98) demişti ki bu Cuma gecesine gelince demektir. Eğer buna gücün yetmezse gecenin yarısında kalk, şayet buna da gücün yetmezse gecenin başlangıcında kalkıp dört rekat namaz kıl. Birinci rekatta fatiha ile birlikte Yasin sûresini oku ikinci rekatta, Hâ mim, Duhan sûresini oku. Üçüncü rekatta ise Fatiha ve Elif lam mim Secde sûresini oku dördüncü rekatta ise Fatiha ile birlikte Tebareke sûresini okursun. Teşehhüdü bitirdiğin vakit Allah’a hamdeyle Allah’a en güzel şekilde senada bulun bana da salevatı güzel bir şekilde getir. Sonra tüm Nebilere de salevat getir. Sonra tüm mü’min erkekler ve kadınları bağışlanma talebinde bulun ve senden önce gelip geçen tüm imanlı kardeşlerin için bağışlanma isteğinde bulun bunlardan sonra da şöyle söyle: Allah’ım hayatta bıraktığın sürece beni kötülüklere bulaştırma bana acı. Beni ilgilendirmeyen şeylere özenmekten beni esirge. Razı olduğun şeylere eğilmeyi bana nasib et. Allah’ım ey gökleri ve yeri eşsiz benzersiz yaratan ey Celal ve ikram sahibi! Ey Allah’ım! Erişilmez güç sahibi Sensin. Ey Rahman olan Allah’ım, Ey Allah’ım senin celalin için isterim. Yüzünün nuru için öğrettiğin şekilde Kur’ân-ı bana ezberletmeni isterim. Seni benden razı edecek şekilde O kitabı okumayı bana nasib et. Göklerin ve yerin eşsiz ve benzersiz yaratıcısı Allah’ım, Celal, ikram ve İzzet sahibi Allah’ım senin gücüne hiçbir güç erişemez. Ey Allah’ım, Ey Rahman olan senin celalinle yüzünün nuru ile ve senin kitabınla gözümü aydınlatmanı isterim. Dilimi onunla söyletmeni, kalbimdeki sıkıntıyı onunla gidermeni gönlümü onunla açmanı bedenimi onunla tamir etmeni isterim nitekim hak uğrunda bana senden başkası yardım etmez ve hakkı sadece sen verirsin senden başka güç kuvvet yoktur, ancak sen varsın sen büyüksün ve ulusun. Ey Ebû’l Hasen bunu üç veya beş veya yedi Cuma yapacak olursan Allah’ın izniyle duân mutlaka kabul edilecektir. Beni hak ile gönderen Allah’a yemin ederim ki bu duâ mü’minden hiçbir zaman şaşmamıştır. Abdullah b. Abbâs dedi ki: Vallahi Ali beş veya yedi Cuma geçtikten sonra böyle bir toplantıda Rasûlullah (s.a.v.)’e geldi ve Ey Allah’ın Rasûlü bundan önce ancak dört ayet kadar ezberlemekte idim ondan fazlası benden sıyrılır yok olur giderdi. Bugün kırk ayet kadar ezberliyor ve bunları okurken sanki kitap gözlerimin önünde gibidir. Nitekim bir hadis dinlerdim onu başkasına aktaracağım zaman benden kaybolur giderdi. Bugün ise hadisler işitiyorum ve onları bir başkasına aktardığım zaman bir harf bile eksik etmeden anlatabiliyorum. Bunun üzerine Rasûlullah (s.a.v.) şöyle buyurdu: Ey Ebû’l Hasen Ka’be’nin Rabbine andolsun ki sen gerçek bir mü’minsin.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 201
			}
		}
	]
}