{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3600,
			"arabicnumber": 3600,
			"text": "Ebû Saîd ve Ebû Hüreyre (radıyallahü anhüma)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “İnsanların sevap ve günahlarını yazan meleklerden başka Allah’ın yeryüzünde dolaşan melekleri vardır ki Allah’ı hatırlayıp devamlı gündemde tutan toplulukları görünce aradığınıza koşun diye çağrışırlar ve hemen oraya gelerek dünya semasına kadar onları çepeçevre kuşatırlar. Allah, o meleklere sorar: Kullarımı hangi hal üzere bıraktınız? Onlar da derler ki: Sana hamd ediyorlar seni en büyük olarak kabul ediyorlar ve seni daima gündemde tutuyorlar. Allah: Beni gördüler mi buyurur. Melekler: Hayır diye cevap verirler. Allah: Beni görselerdi durumları nasıl olurdu? Melekler: Seni görmüş olsalardı. Şüphesiz daha çok hamd ederler daha çok seni büyük kabul ederler ve daha çoğunlukla seni gündemde tutarlardı. Allah: O kullarım neyi istiyorlar? Buyurur. Melekler: Cenneti istiyorlar derler. Allah: Cenneti gördüler mi? buyurur. Melekler: Hayır derler. Allah: Görmüş olsalardı durum nasıl olurdu? Buyurur. Melekler: Cenneti görmüş olsalardı onu daha çok isterler ve hırslanırlardı, derler. Allah: Hangi şeyden sığınıyorlar? Der. Melekler: Cehennem’den derler. Allah: Cehennemi gördüler mi? buyurur. Melekler: Hayır derler. Allah: görselerdi durum nasıl olurdu? der. Melekler: Cehennemi görselerdi elbette ondan daha çok kaçarlar ondan daha çok korkarlar ve ondan daha çok Allah’a sığınırlardı, derler. Allah: Sizler şâhid olunuz ki ben onları bağışladım. Melekler: O toplum içinde isteyerek oraya gelmeyen fakat bir ihtiyaç için orada bulunan günahkar kimseler de vardır, derler. Allah: Onlar öyle bir topluluktur ki onların yanında bulunanlar affedilmekten mahrum bırakılmazlar.” (Buhârî, Deavat: 27; Müslim, Zikr: 17) Bu hadis hasen sahihtir. Ebû Hüreyre’den değişik şekillerde de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 231
			}
		}
	]
}