{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "Sümâme b. Hazn el Kuşeyrî (r.a.)’den rivâyete göre, şöyle demiştir: Osman evinin çevresini muhasara eden kendisini öldüreceklere yukarıdan baktığında ben de O’nun evinin yanında idim. Osman şöyle demişti: “Sizi üzerime düşüren iki adamınızı getiriniz.” İki adam getirildi sanki iki deve veya iki merkeb gibidirler. Osman yukarıdan onlara baktı ve şöyle dedi: “Allah ve İslam adına sizden istiyorum. Rasûlullah (s.a.v.)’in, Medîne’ye gelişinde Medîne’de Rûme kuyusundan başka tatlı içme suyu bulunmadığını, “Kim Rûme kuyusunu Cennet’te ondan daha hayırlısını elde etmek isterse Müslümanlara vakfetmek ister?” buyurduğunu, benim de o kuyuyu öz malımla satın aldığımı bilir misiniz? Bugün siz o sudan beni içmekten men ediyorsunuz, tuzlu deniz suyu içmeye zorluyorsunuz.” Dediler ki: “Evet doğrudur.” Osman: “Allah ve İslam adına size soruyorum! Medîne mescidinin cemaate dar geldiğini, Nebi (s.a.v)’in falanların arsasını kim satın alıp mescide ilave etmek ve Cennet’te ondan daha hayırlısına sahip olmak ister dediğini, Benim de o arsayı öz malımdan satın alıp mescidi genişlettiğimi bilir misiniz? Bu gün beni sizler orada iki rekat namaz kılmaktan men ediyorsunuz” dedi. Onlar da: “Allah’ım evet” dediler. Osman: “Allah ve İslam adına size soruyorum! Tebûk ordusunu kendi öz malımdan techiz ettiğimi biliyor musunuz?” dedi. Onlar da: “Evet Allah’ım” dediler. Sonra Osman dedi ki: “Allah ve İslam adına size soruyorum! Rasûlullah (s.a.v.) ile birlikte Mekke dağı üzerinde Ebû Bekir ve Ömer ile birlikte olduğumuz anda dağın harekete geçtiğini ve taşların yuvarlanıp aşağı doğru düştüğünü Rasûlullah (s.a.v.)’in dağa tekme atarak: Dağ sakin ol çünkü senin üzerinde bir Nebi, bir sıddîk ve iki şehîd vardır dediğini...” Onlar da: “Allah’ım evet” dediler. Osman: “Üç kere Allahuekber diyerek Ka’be’nin Rabbine andolsun ki benim şehid olacağıma şâhidlik ettiler” dedi. Diğer tahric: Nesâî, Ahbas) Tirmizî: Bu hadis hasendir. Osman’dan değişik şekillerde de rivâyet edilmiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 99
			}
		}
	]
}