{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "Osman b. Abdullah b. Mevheb (radıyallahü anh)’den rivâyete göre, mısır halkından bir adam Ka’be’yi haccetti ve orada oturmakta olan bir cemaat gördü bunlar kimlerdir diye sordu Kureyş’tir, dediler. Şu ihtiyar kimdir? diye sordu. İbn Ömer’dir, dediler. Yanına geldi ve: “Sana bir şeyler soracağım; Ka’be’nin hakkı için bana doğruyu söylemeni isterim! Uhud savaşında Osman’ın kaçtığını bilir misin?” İhtiyar: “Evet” diye cevap verdi. Adam: “Rıdvan biatına katılmayıp geri kaldığını biliyor musun?” dedi. İhtiyar kimse: “Evet” dedi. Adam: “Bedir savaşından geri kalıp savaşa katılmadığını biliyor musun?” İhtiyar: “Evet” diye cevap verdi. Bunun üzerine Adam, hayret etmiş olacak ki: “Allahuekber” dedi. İbn Ömer de ona dedi ki: “Gel sorduğun soruları sana açıklayayım; Uhud günü Osman’ın kaçması Allah tarafından bağışlanmış suçlardandır. (Âl-i Imrân: 155) Bedir savaşından geri kalmasına gelince; Peygamber (sallallahü aleyhi ve sellem)’in kızı O’nun nikahı altında ve hasta durumdaydı. O’nun yanında kalması ve savaşa katılmamasını bizzat Peygamber (sallallahü aleyhi ve sellem), emir buyurmuştu ve savaşa katılan kimsenin sevâbına ve ganimet payına da sahib olacağını söylemişti. Rıdvan biatından geri kalmasına gelince; Mekkeliler yanında Osman’dan daha değerli ve saygıdeğer biri olsaydı o zaman onu elçi olarak göndermezdi de Osman’nın yerine onu gönderirdi. Rıdvan biatı Osman Mekkeye elçi olarak gönderildikten sonra gerçekleşmişti. O zaman Rasûlüllah (sallallahü aleyhi ve sellem) sağ eli için bu Osman’ın elidir, buyurarak sağ elini sol elinin üzerine koyarak abu biat Osman içindir, buyurdu.” İbn Ömer: “Bu bilgileri al ve git” dedi. (Buhârî Menakîb: 27) Bu hadis hasen sahihtir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 102
			}
		}
	]
}