{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "İmrân b. Husayn (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) bir askeri kuvvet göndermiş Ali b. ebî Tâlib’i de bunun başına komutan tayin etmişti. Ali bu müfreze ile yoluna devam etti. Sonra savaştan elde ettiği bir cariye ile cinsel ilişkide bulundu. Beraberinde bulunan askerler Ali’nin yaptığı bu hareketi doğru bulmadılar ve dört kişi kendi aralarında anlaşarak, eğer Rasûlullah (s.a.v.) ile karşılaşırsak Ali’nin bu yaptığını haber vereceğiz dediler. Müslümanlar bir savaştan döndükleri zaman önce Nebi (s.a.v)’in yanına gelip selam verirler sonra evlerine dağılırlardı. Bu müfreze de geri dönünce Nebi (s.a.v)’e geldiler ve selam verdiler. O dört kişiden biri kalkıp: “Ey Allah’ın Rasûlü! Ali b. ebî Talîb’e bakmaz mısın? O şöyle şöyle yaptı.” Nebi (s.a.v), bu kimseden yüz çevirdi. Sonra ikinci kişi kalktı birinci kimsenin konuştuğu gibi konuştu. Rasûlullah (s.a.v.), ondan da yüz çevirdi. Üçüncü kişi kalktı ve onların söylediklerini aynen söyledi. Rasûlullah (s.a.v.) ondan da yüz çevirdi. Nihayet dördüncü kişi kalkıp onların söylediklerini aynen söyledi. Sonra Rasûlullah (s.a.v.) yüzünde öfke belirtisi olduğu halde bu kişiye dönerek: “Ali’den Ne istiyorsunuz? Ali’den ne istiyorsunuz? Ali’den ne istiyorsunuz? Ali’den ne istiyorsunuz? Ali, bendendir. Ben de ondanım. Benden sonra her mü’minin velisi O’dur” buyurdu. Diğer tahric: Müsned: 19081 Tirmizî: Bu hadis hasen garibtir. Bu hadisi sadece Cafer b. Süleyman’ın rivâyetiyle bilmekteyiz",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 108
			}
		}
	]
}