{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3715,
			"arabicnumber": 3715,
			"text": "Rıb’î b. Hıraş (r.a.)’tan rivâyete göre, Ali b. ebî Tâlib, Kûfedeki geniş bir meydanlık olan Rahbe’de bize anlattı ve şöyle dedi: Hudeybiye günü müşriklerden bazı kimseler yanımıza çıkıp gelmişlerdi. Aralarında Sühehl b. Amr ve Müşriklerin ileri gelenlerinden birkaç kişi vardı. Rasûlullah (s.a.v.)’e şöyle dediler: Ey Allah’ın Rasûlü! oğullarımız, kardeşlerimiz ve kölelerimizden bazı anlayışsız kimseler sana kaçıp gelmişlerdir. Onların din konusunda bilgileri yoktur. Mallarımız ve topraklarımızda çalışan işçiler olup işten kaçıp gelmişlerdir. Onları bize geri teslim et, onlar din konusunda bilgili değillerse biz onlara bilgi verir bilgilendiririz. Bu teklifleri karşısında Nebi (s.a.v): “Ey Kureyş topluluğu, mutlaka kötü hallerinizden vazgeçmeli İslam’a geri dönmelisiniz. Aksi halde Allah din uğrunda boyunlarınızı vuracak bir kişi gönderecektir. O din konusunda bilgileri yoktur dediğiniz kimselerin kalblerini Allah iman üzere imtihan etmiştir” buyurdu. Ashab: “Ey Allah’ın Rasûlü! o kimse kimdir?” diye sordular. Ebû Bekir: “Ey Allah’ın Rasûlü o kimse kimdir?” diye sordu. Ömer: “O kimse kimdir?” diye sordu. Rasûlullah (s.a.v.): “O ayakkabı tamircisidir” buyurdu. Rasûlullah (s.a.v.), ayakkabısını tamir için Ali’ye vermişti. Sonra Ali bize döndü ve şöyle dedi: Rasûlullah (s.a.v.) şöyle buyurdu: “Her kim bilerek benim adıma yalan söylerse Cehennem’deki yerine hazırlansın.” Diğer tahric: Buhârî, İlim; Müslim,i Mukaddime Tirmizî: Bu hadis hasen sahih garibtir. Rib’î’nin, Ali’den rivâyeti olarak bilmekteyiz. Carûd’tan işittim şöyle diyordu: Vekî’den işittim şöyle diyordu: Rıb’î b. Hıraş, İslam’da hiçbir konuda yalan söylememiştir. Muhammed b. İsmail’in bana haber verdiğine göre Abdullah b. eb’îl Esved şöyle demiştir: Abdurrahman b. Mehdî’den işittim şöyle demişti: Mansur b. Mu’temir, Kûfeliler yanında sağlam bir kimsedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 111
			}
		}
	]
}