{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyet edilmiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bir gün dört rek’atlı namazı iki rek’at kılarak namazdan ayrıldı. Zülyedeyn isimli bir kimse: “Namaz mı kısaldı yoksa unuttun mu? Ey Allah’ın Rasûlü!” dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): “Zülyedeyn doğru mu söylüyor” dedi. Cemaatte: “Evet” dediler. “Rasûlüllah (sallallahü aleyhi ve sellem)’de kalktı ve son iki rek’atı kıldırdı ve selam verdi, sonra tekbîr alarak normal secdeleri gibi veya daha uzun bir secde daha yaptı. Sonra tekbir alarak doğruldu tekrar normal secdesi gibi veya uzun bir secde daha yaptı.” (Nesâî, Sehv: 22; İbn Mâce, İkame: 134) Bu konuda Imrân b. Husayn, İbn Ömer, Zülyedeyn’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir. Bu hadis hakkında alimler değişik görüşler ortaya koymuşlardır. Küfelilerden bir kısmı: “Unutarak, bilmeyerek veya hangi şekilde olursa olsun konuşan kimse namazını tekrar eder.” Bu hadisin namazda konuşmanın haram kılınışından önce olduğunu ileri sürerler. Şâfii, bu hadisi sahih olarak kabul eder ve der ki: Bu hadis Rasûlüllah (sallallahü aleyhi ve sellem)’den; “Unutarak yiyen içen oruçlunun orucunu kaza etmeyeceği yiyip içtiği şeylerin Allah’ın bir rızkı olduğunu açıklayan hadisten daha sahihtir.” Şâfii diyor ki: Ebû Hüreyre hadisiyle oruçlunun bilerek ve unutarak yeme ve içmesi arasında ayırım yapmışlardır. Ahmed: Ebû Hüreyre’nin bu hadisi hakkında: imâm namazının tamam olduğunu tahmin ederek namazı ile ilgili bir konuda konuşur ve namazının eksik olduğunu öğrenirse namazını tamamlar. Her kim namazının noksan olduğunu bildiği halde imâma arkasından konuşursa o kimsenin namazını yeniden kılması gerekir diyor ve şöyle delil getiriyor. Rasûlüllah (sallallahü aleyhi ve sellem) zamanında farzlar artırılır ve eksiltilebilirdi. Zülyedeyn de bundan dolayı konuşmuştur. Bugün ise böyle değildir, Zülyedeyn’in konuştuğu gibi kimse o anlamda konuşmaz çünkü farzlar ne artırılır nede eksiltilir. Ahmed’de yaklaşık olarak böyle demiştir. İshâk’ta bu konuda Ahmed’in dediği gibi demektedir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 252
			}
		}
	]
}