{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.) güneş ve ay tutulması esnasında Küsûf namazı kıldı, okudu sonra rükû’ a vardı sonra okudu tekrar rükû’ a vardı sonra okudu tekrar rükû’ a vardı sonra iki secde yaptı. İkinci rek’atı da aynen bu şekilde kıldı.” Diğer tahric: Ebû Dâvûd, İstiska; Nesâî, Küsûf Tirmîzî: Bu konuda Ali, Âişe, Abdullah b. Amr, Numân b. Beşîr, Muğîre b. Şu’be, Ebû Mes’ûd, Ebû Bekre, Semure, Ebû Musa el Eşarî, İbn Mes’ûd, Esmâ binti ebî Bekrinis Sıddık, İbn Ömer, Kabîsatel Hilalî, Câbir b. Abdillah, Abdurrahman b. Semure, Übey b. Ka’b’tan da hadis rivâyet edilmiştir. Tirmîzî: İbn Abbâs hadisi hasen sahihtir. Yine İbn Abbâs (r.a.)’den Rasûlullah (s.a.v.)’in dört rükû’lu ve dört secdeli olarak Kûsuf namazı kıldığı da rivâyet edilmiştir. Şâfii, Ahmed ve İshâk’ta bu görüştedirler. Tirmîzî: İlim adamları Kûsuf namazında okunacak şeyler hakkında değişik görüşler ortaya koymuşlardır. Bir kısmı Kûsuf namazı gündüz kılınır ise okumanın sessiz olması görüşündedir. Bir kısmı da Cuma ve Bayram namazlarında olduğu gibi açıktan okunur demektedirler. Mâlik, Ahmed, İshâk açıktan okunması taraftarıdırlar. Şâfii ise açıktan okunmaz diyor. Her iki rivâyette Rasûlullah (s.a.v.)’den sahih olarak gelmiştir. Yine sahih olarak: Dört rükû’ dört secde rivâyeti de vardır. Aynı şekilde altı rükû’ dört secde şeklinde de rivâyet edilmiştir. İlim adamlarına göre bu namazı güneş ve ayın tutulma sürelerine göre uzatıp kısaltmak caizdir. Tutulma uzarsa altı rükû’, dört secde yapmak caiz olduğu gibi, dört rükû’, dört secde yaparak okumayı uzatmakta caizdir. Hadisçiler Güneş ve Ay tutulmalarında bu namazı cemaatle kılmak görüşündedirler",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		}
	]
}