{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "Enes (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: Nebi (s.a.v.)’in yanında otururken akıllı bir kimse gelse, soru sorsa da bizde bazı şeyleri öğrenmiş olsak derdik. Yine böyle bir durumda iken bir adam geldi ve Peygamber (s.a.v.)’in önüne diz çöküp oturdu ve; “Ya Muhammed! senin gönderdiğin kimse bize geldi ve senin Allah tarafından gönderilmiş bir Peygamber olduğunu söyledi.” Peygamber (s.a.v.)’de: “Evet” buyurdular. O kimse dedi ki: “Göğü yükselten, yeryüzünü serip döşeyen ve dağları meydana getiren Allah mı seni gönderdi?” Peygamber (s.a.v.): “Evet” dedi. Bunun üzerine o kimse dedi ki: “Senin gönderdiğin kimse bize; bir gün ve gecede beş vakit namaz kılınması gerektiğini söyledi” deyince, Peygamber (s.a.v.): “Evet” dediler. O kimse: “Seni gönderen zat hakkı için bunu Allah mı emretti?” deyince, Rasûlullah (s.a.v.): “Evet” dediler. Bunun üzerine o adam: “Senin gönderdiğin o görevli kimse bize senede bir ay oruç tutulmasının farz olduğunu söyledi” deyince; Peygamber (s.a.v.): “Doğrudur” dedi. Bu sefer o adam: “Seni gönderen zat hakkı için bunu sana Allah mı emretti” deyince, Peygamber (s.a.v.): “Evet” buyurdu. Yine o adam: “Senin gönderdiğin kimse mallarımızdan zekat verilmesi gerektiğini söyledi” deyince, Rasûlullah (s.a.v.): “Doğrudur” dedi. O adam da: “Seni gönderen zat hakkı için bunu sana Allah mı emretti” diye sorunca; Peygamber (s.a.v.) “Evet” dediler. Yine o adam: “Senin gönderdiğin yetkili kimse bize; gücü yetenlerin Hac yapması gerektiğini söyledi” deyince Peygamber (s.a.v.): “Evet” dediler. O adam da: “Seni gönderen zat hakkı için bunuda mı Allah emretti” deyince, Peygamber (s.a.v.): “Evet” dediler. Bunun üzerine o kimse: “Seni hak üzere gönderen o zat için bunlardan hiç birini terk etmeyeceğim ve fazlada yapmayacağım” dedi hızlıca kalkıp gitti. Bunun üzerine Peygamber (s.a.v.) buyurdular ki: “Bu adam bu söylediklerinde doğru ve ciddi ise Cennete girer.” Diğer tahric: Buhârî, İlim; Müslim, İman Tirmîzî: Bu hadis bu şekliyle hasen garibtir. Enes vasıtasıyla Rasûlullah (s.a.v.)’den değişik bir şekilde de rivâyet edilmiştir. Muhammed b. İsmail’den işittim şöyle diyordu: Bazı hadisçiler bu hadisten; “Alim bir kimseye bir şeyi okuyup arz etmenin ondan dinlemek gibi caiz olduğunu çıkarmışlardır.” Bu hadisteki kimsenin Rasûlullah (s.a.v.)’e bazı bilgileri sunması ve Rasûlullah (s.a.v.)’in de onları tasdik etmesini delil olarak göstermişlerdir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		}
	]
}