{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "Câbir b. Abdillah (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) Fetih yılı Mekke’ye doğru yola çıkmıştı. Küra-ül Gamîm denilen yere varıncaya kadar kendisi de ashabı da oruçlu idiler Rasûlüllah (sallallahü aleyhi ve sellem)’e şöyle denildi: “Oruç insanlara zor geliyor insanlar sizin yaptığınıza bakıp duruyorlar. Rasûlüllah (sallallahü aleyhi ve sellem) ikindiden sonra bir bardak su istedi ve insanların gözü önünde içti. Bunu görenlerin bir kısmı oruçlarını açtılar bir kısmı ise oruca devam ettiler. Bir kısım ashabının oruçlarına devam ettikleri haberi kendisine ulaşınca onlar itâat etmiyorlar isyan etmişlerdir” buyurdular. (Müslim, Sıyam: 15) Bu konuda Ka’b b. Âsım, İbn Abbâs ve Ebû Hüreyre’den de hadis rivâyet edilmiştir. Câbir hadisi hasen sahihtir. (sallallahü aleyhi ve sellem)’den “Yolculukta oruç tutmak iyi Müslüman olmak demek değildir” diye de bir hadis rivâyet edilmiştir. (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı alimler yolculukta oruç tutulması taraftarıdırlar hatta bir kısmı yolculukta tutulan orucun kaza edilmesi görüşündedirler. Ahmed ve İshâk yolculukta oruç tutmamayı tercih etmişlerdir. Ahmed ve İshâk yolculukta oruç tutmamayı tercih etmişlerdir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve diğer bazı alimler ise “Gücü yeterde oruç tutarsa ne güzeldir ve değerli bir iş yapmış olur” derler. Sûfyân es Sevrî, Mâlik b. Enes, Abdullah b. Mübarek bunlardandır. Şâfii diyor ki: Rasûlüllah (sallallahü aleyhi ve sellem)’in “Yolculukta oruç tutmak iyi Müslüman olmak demek değildir” sözünün manası ve “bazı kimselerin oruçlu kalması haberi ulaşınca” onlar âsidirler sözünün manası: Allah’ın verdiği bu izni gönlü kaldıramayan kimseler içindir. Kişi yolculukta oruç tutmayı mübah görür fakat dayanabileceği için oruç tutarsa bu benim hoşuma gider",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		}
	]
}