{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber iken Ensâr’dan bir kadının evine girdik. Kadın ona bir koyun kesti. Rasûlüllah (sallallahü aleyhi ve sellem), onun etinden yedi. Sonra bir tabak yaş hurma getirdi ondan da yedi sonra öğle namazı için abdest alıp namazını kıldı. Sonra tekrar o kadının yanına geldi de kadın öğleden önceki yenilen koyun etinin parçalarından biraz daha et getirdi Rasûlüllah (sallallahü aleyhi ve sellem)’de ondan yedi ve abdest almadan ikindi namazını kıldı.” (Müslim, Hayz: 24; İbn Mâce, Tahara: 66) konuda Ebû Bekir es Sıddîk, İbn Abbâs, Ebû Hüreyre, İbn Mes’ûd, Ebû Rafi’, Ümmül Hakem, Amr b. Ümeyye, Ümmü Âmir, Süveyd b. Numân ve Ümmü Seleme’den de hadis rivâyet edilmiştir. Ebû Bekir’in bu konudaki hadisi sened yönünden sahih değildir. Çünkü sadece Husâm b. Misâk bu hadisi İbn Sirîn, İbn Abbâs ve Ebû Bekir’den rivâyet etmektedir. Sahih olan rivâyet şekli budur. Hadis hafızlarının rivâyeti de bu şekildedir. Bu hadis değişik yollarla İbn Sirin’den, İbn Abbâs’dan da rivâyet edilmektedir. Atâ b. Yesâr, İkrime, Muhammed b. Amr b. Atâ, Ali b. Abdullah b. Abbâs’tan rivâyet ederek, Ebû Bekir’i rivâyete almadılar ki bu rivâyet daha sahihtir. Peygamber (sallallahü aleyhi ve sellem) ashabı tabiin ve tebe-i tabiinden pek çok kimsenin görüşü bu hadis üzeredir. Sûfyân es Sevrî, İbn’ül Mübarek, Şâfii, Ahmed ve İshâk, ateşte pişen gıdalardan dolayı abdest gerekmediği görüşündedirler. Bu, Rasûlüllah (sallallahü aleyhi ve sellem)’in son tatbikatıdır. Bu hadis bir önceki hadisin hükmünü kaldırmış gibidir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		}
	]
}