{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "İbn Şihâb (radıyallahü anh)’den rivâyet edildiğine göre: Sâlim b. Abdullah, Şam halkından bir adamın Abdullah b. Ömer’e hac ve umreyi birlikte yapmayı sorduğunu İbn Şihâb’a anlatmıştı. Abdullah b. Ömer; “Bu tür hac ve umre yapmak helaldir” dedi. Şamlı adam: “Baban bu tür hac ve umre yapmayı yasaklamıştır” deyince Abdullah b. Ömer dedi ki: “Babam yasaklamış olsa bile Rasûlüllah (sallallahü aleyhi ve sellem) hac ve umreyi ikisini bir arada yapmıştır. Böyle bir durumda babamın emrine mi uyulur, yoksa Rasûlüllah (sallallahü aleyhi ve sellem)’in emrine mi? dedi. Şamlı adam: “Elbette Rasûlüllah (sallallahü aleyhi ve sellem)’in emrine uyulur” deyince Abdullah b. Ömer de: “Rasûlüllah (sallallahü aleyhi ve sellem)’in bu şekilde hac ve umreyi bir arada yaptığı bir gerçektir” dedi. (Tirmizî rivâyet etmiştir.) Bu konuda Ali, Osman, Câbir, Sa’d, Esma binti ebî Bekir ve İbn Ömer’den de hadis rivâyet edilmiştir. İbn Abbâs hadisi hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve diğerlerinden bir kısım ilim adamları temettu haccının yapılabileceğini tercih etmişlerdir. Temettu: Hac aylarında umre yapmaya niyet etmek demektir. Bu kimse hac edinceye kadar Mekke’de kalır ve haccını da yapar kurbanını da keser kurban bulamaz ise üç gün Mekke’de yedi gün de memleketine gidince oruç tutmalıdır. Tutacağı üç gün orucun son gününün arefe günü olması müstehabtır. Zilhiccenin on gününde bu üç orucu tutamazsa Teşrik günleri denilen bayramın 2-3-4. günleri tutmalıdır. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından İbn Ömer, Âişe, Mâlik, Şâfii, Ahmed ve İshâk’da bu görüştedirler. Kimi ilim adamları da: “teşrik günleri oruç tutamaz” diyorlar ki: Küfeliler bu görüştedirler. Hadisçiler, Temettu haccını tercih ederler. Şâfii, Ahmed ve İshâk’da bunlardandır",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		}
	]
}