{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "Hasan b. Muhammed ez Zaferânî ve Abdurrahman b. Esved, Ebû Amr el Basrî dediler ki: Ubeyde b. Humeyd, Umare b. Gâziyye’den, Ebû Hazim’den, Sehl b. Sa’d’den ve Peygamber (sallallahü aleyhi ve sellem)’den İsmail b. Ayyaş hadisinin benzerini bize naklettiler. Bu konuda İbn Ömer ve Câbir’den de hadis rivâyet edilmiştir. Ebû Bekr hadisi garibtir. Bu hadisi sadece İbn ebî Füdeyk’in, Dahhâk b. Osman’dan yaptığı rivâyetiyle bilmekteyiz. Muhammed b. Münkedir, Abdurrahman b. Yerbu’dan hadis işitmemiştir. Muhammed b. Münkedir, Abdurrahman b. Yerbu’dan hadis işitmemiştir. Muhammed b. Münkedir, Abdurrahman b. Yerbu’un oğlu Said vasıtasıyla Abdurrahman b. Yerbu’dan başka bir hadis rivâyet etmiştir. Ebû Nuaym et Tahhan, Dırar b. Surad bu hadisi İbn ebî Füdeyk’den, Dahhâk b. Osman’dan, Muhammed b. Münkedir’den Saîd b. Abdurrahman b. Yerbu’dan ve babasından Ebû Bekir’den rivâyet etmiş olup Dırar bu rivâyetinde yanılmıştır. Ahmed b. Hasen’den işitim şöyle diyordu: Ahmed b. Hanbel şöyle diyor: Her kim bu hadisin senedinde Muhammed b. Münkedir, İbn Abdurrahman b. Yerbu’ ve babasından diyerek rivâyet ederse mutlaka yanılmıştır. işittim şöyle diyordu: Dırar b. Sured’in, İbn ebî Füdeyk’den rivâyetini ona hatırlattığımda “o yanlıştır” dedi. Bende başkalarının da İbn ebî Füdeyk’den Dırar’ın rivâyeti gibi rivâyet ettiklerini söyledim. Dedi ki: Bunlar “hiçbir şey” değildir. Doğrusu şudur ki o hadisi ibn ebî Füdeyk’den rivâyet ettiler ve senedinde Saîd b. Abdurrahman demediler. Buhârî’nin, Dırar b. Sured’i zayıf kabul ettiğini gördüm. “Ac” Telbiyeyi yüksek sesle getirmek demektir. “Sec” ise deve kesmek demektir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		}
	]
}