{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre: “Rasûlüllah (sallallahü aleyhi ve sellem) hanımlarından bazısını öper ve abdest almadan namaza çıkardı.” Hadisin râvîsi Urve diyor ki: Âişe (radıyallahü anha)’ya o hanımı mutlaka sen olmalısın dediğimde Âişe (radıyallahü anha) güldü, demiştir. (Ebû Dâvûd, Tahara: 68; Nesâî, Tahara: 121) Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve sonraki dönemlerdeki ilim adamlarının bu görüşte oldukları rivâyet edilmiştir. Sûfyân es Sevrî ve Küfeliler de bu görüştedirler yani “Öpmeden dolayı abdest almak gerekmez.” b. Enes, Evzâî, Şâfii, Ahmed ve İshâk öpmekten dolayı abdest almak gerekir diyorlar. Sahabe ve Tabiinden bir kısım kimseler de bu görüştedirler. Âişe’nin Rasûlüllah (sallallahü aleyhi ve sellem)’den rivâyet ettiği bu hadisi hadisçilerin kabul etmemeleri sened yönünden sıhhatli görmemelerinden dolayıdır. Bekir el Attar el Basrî’nin, Ali b. el Medînî’den naklen şöyle dediğini işittim: Yahya b. Saîd el Kattan bu hadisi zayıf bulmuş ve hiç hükmünde olduğunu söylemiştir. taraftan Muhammed b. İsmail bu hadisi zayıf görmüş ve “Habib b. ebî Sabit, Urve’den bir şey işitmemiştir” demiştir. et Teymî Âişe (radıyallahü anha)’dan şöyle rivâyet etmiştir: “Rasûlüllah (sallallahü aleyhi ve sellem), öptü ve abdest almadı.” Bu hadiste yukarıdaki gibi sahih değildir. Çünkü İbrahim et Teymî’nin, Âişe (radıyallahü anha)’dan hadis işittiğini bilmiyoruz. Bu konuda Rasûlüllah (sallallahü aleyhi ve sellem) sahih olarak bir hadis rivâyet edilmemiştir",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 86
			}
		}
	]
}