{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "İbn Abbâs (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.), kurban edeceği hayvanın boynuna iki takunya takmış Zu’l-huleyfe denilen yerde hayvan’ın sağ tarafına kurbanlık olduğunu belirtmek için yararak kan akıttı ve kan izlerini de silip yok etti.” Diğer tahric: Müslim, Hac; Buhârî, Hac Tirmîzî: Bu konuda Misver b. Mahreme’den de hadis rivâyet edilmiştir. Tirmîzî: İbn Abbâs hadisi hasen sahihtir. Ebû Hassân el A’rec’in adı Müslim’dir. Rasûlullah (s.a.v.)’in ashabından ve sonraki dönemlerden ilim adamları bu hadisle amel ederler, kurbanlık hayvanların işaretlenmesi görüşündedirler. Sevrî, Şâfii, Ahmed ve İshâk’ın görüşleri böyledir. Yusuf b. İsa’dan işittim Vekî’den işittiğini söylüyordu bu hadisi rivâyet edince şöyle dedi: Bu konuda kendi görüşlerine iltifat etmeyin! Çünkü kurbanlık hayvanı işaretlemek sünnet onların sözleri ise bidattır. Ebû’s Sâib’den işittim şöyle diyordu: Vekî’nin yanında idik Vekî’ kendi görüşlerine göre konuşanlardan birine dedi ki: Rasûlullah (s.a.v.) kurbanlık develere işaret koymak üzere hayvanı yaraladı. Ebû Hanife ise bu işe “Müsle” yapmaktır diyor. O adamda bu mesele İbrahim Nehai’den rivâyet edilmiştir. O der ki: Kurbanlık hayvana işaret koymak müsle yapmak demektir. Bu söz üzerine Vekî’ çok şiddetli bir şekilde kızdı ve şöyle dedi: Ben sana Peygamber (s.a.v.) söyledi diyorum sen bana İbrahim söyledi diyorsun, bu sözünden vazgeçinceye kadar hapsedilmeyi nasılda hak etmişsin",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		}
	]
}