{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "Ümmü Atıyye (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)’in kızlarından biri vefat etmişti. Bunun üzerine: “Rasûlüllah (sallallahü aleyhi ve sellem); O’nu, tek olarak, üç veya beş gerek duyarsanız daha fazla yıkayın su ve sidr ile yıkayın sonuncusunda ise kafur veya kafurdan bir parça koyarak yıkayın işiniz bitince bana bildirin buyurdu. Bizde işimiz bitince bildirdik. Bize kendi giydiği hıkv denilen elbisesini verdi ve bunu ona iç gömleği yapın buyurdular.” (Buhârî, Cenaiz: 8; Müslim, Cenaiz: 12) diyor ki: Bu hadisin başka rivâyetlerinde -belki Hişâm’da onlardan olabilir- Ümmü Atıyye şöyle demiştir: Onun saçını üç örgü halinde yapmıştık. Yine Hüşeym diyor ki: Zannedersem saçının örgüsünü arka tarafına getirdik dedi ve sözünü şöyle sürdürdü: Rivâyet edenler arasından Hâlid, Hafsa’dan, Muhammed’den Ümmü Atıyye’den naklederek şöyle dediler. Rasûlüllah (sallallahü aleyhi ve sellem) bize şöyle buyurdu: “Cenazeyi yıkamaya sağ tarafından ve abdest organlarından başlayın.” konuda Ümmü Süleym’den de hadis rivâyet edilmiştir. Ümmü Atıyye hadisi hasen sahihtir. İlim adamlarının uygulaması bu hadise göredir. Nehaî’den: Rivâyete göre, şöyle demektedir. Cenaze yıkamak aynen cünüplükten temizlenmek için yapılan yıkama gibidir. b. Enes der ki: Bizce cenaze yıkama işinde belli bir sınırlama ve belli bir yoktur. Cenaze tertemiz yıkanır. der ki: Mâlik kirden arındırılır ve temizlenir demekle kısa ve özlü konuşmuştur. Düz su veya sabun karıştırılmış su ile yıkarsa bu gusül yerine geçer. Fakat benim hoşuma giden üç ve üçten fazla yıkanmasıdır. Rasûlüllah (sallallahü aleyhi ve sellem)’in “O’nu üç, beş kere yıkayın” emrinden dolayı üçten eksik yıkanmamalıdır. Üçten az yıkamakla da kirden temizlenirse buda yeterlidir. Bizce Rasûlüllah (sallallahü aleyhi ve sellem)’in “Üç, beş kere yıkayın” sözü sınır koymadığı için sadece temizleyin anlamındadır. Fıkıhçılar da aynı kanaatte olup, hadisin manalarını daha iyi bilirler. Ahmed ve İshâk ta şöyle demektedirler: Yıkamalar su ve sidr ile olur sonuncusunda ise kafurdan bir parça atılarak yıkama bitirilmiş olur",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		}
	]
}