{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "حَدَّثَنَا أَبُو عُبَيْدٍ، مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ الْمَدَنِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَدْ هَمَّ بِالْبُوقِ وَأَمَرَ بِالنَّاقُوسِ فَنُحِتَ فَأُرِيَ عَبْدُ اللَّهِ بْنُ زَيْدٍ فِي الْمَنَامِ قَالَ رَأَيْتُ رَجُلاً عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ يَحْمِلُ نَاقُوسًا فَقُلْتُ لَهُ يَا عَبْدَ اللَّهِ تَبِيعُ النَّاقُوسَ قَالَ وَمَا تَصْنَعُ بِهِ قُلْتُ أُنَادِي بِهِ إِلَى الصَّلاَةِ ‏.‏ قَالَ أَفَلاَ أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ قُلْتُ وَمَا هُوَ قَالَ تَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ حَىَّ عَلَى الْفَلاَحِ ‏.‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ قَالَ فَخَرَجَ عَبْدُ اللَّهِ بْنُ زَيْدٍ حَتَّى أَتَى رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَخْبَرَهُ بِمَا رَأَى ‏.‏ قَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ رَجُلاً عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ يَحْمِلُ نَاقُوسًا ‏.‏ فَقَصَّ عَلَيْهِ الْخَبَرَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ صَاحِبَكُمْ قَدْ رَأَى رُؤْيَا فَاخْرُجْ مَعَ بِلاَلٍ إِلَى الْمَسْجِدِ فَأَلْقِهَا عَلَيْهِ وَلْيُنَادِ بِلاَلٌ فَإِنَّهُ أَنْدَى صَوْتًا مِنْكَ ‏\"‏ ‏.‏ قَالَ فَخَرَجْتُ مَعَ بِلاَلٍ إِلَى الْمَسْجِدِ فَجَعَلْتُ أُلْقِيهَا عَلَيْهِ وَهُوَ يُنَادِي بِهَا ‏.‏ قَالَ فَسَمِعَ عُمَرُ بْنُ الْخَطَّابِ بِالصَّوْتِ فَخَرَجَ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ رَأَيْتُ مِثْلَ الَّذِي رَأَى ‏.‏ قَالَ أَبُو عُبَيْدٍ فَأَخْبَرَنِي أَبُو بَكْرٍ الْحَكَمِيُّ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الأَنْصَارِيَّ قَالَ فِي ذَلِكَ أَحْمَدُ اللَّهَ ذَا الْجَلاَلِ وَذَا الإِكْرَامِ حَمْدًا عَلَى الأَذَانِ كَثِيرًا إِذْ أَتَانِي بِهِ الْبَشِيرُ مِنَ اللَّهِ فَأَكْرِمْ بِهِ لَدَىَّ بَشِيرًا فِي لَيَالٍ وَالَى بِهِنَّ ثَلاَثٍ كُلَّمَا جَاءَ زَادَنِي تَوْقِيرًا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ الْوَاسِطِيُّ، حَدَّثَنَا أَبِي، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اسْتَشَارَ النَّاسَ لِمَا يُهِمُّهُمْ إِلَى الصَّلاَةِ فَذَكَرُوا الْبُوقَ فَكَرِهَهُ مِنْ أَجْلِ الْيَهُودِ ثُمَّ ذَكَرُوا النَّاقُوسَ فَكَرِهَهُ مِنْ أَجْلِ النَّصَارَى فَأُرِيَ النِّدَاءَ تِلْكَ اللَّيْلَةَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ زَيْدٍ وَعُمَرُ بْنُ الْخَطَّابِ فَطَرَقَ الأَنْصَارِيُّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَيْلاً فَأَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِلاَلاً بِهِ فَأَذَّنَ ‏.‏ قَالَ الزُّهْرِيُّ وَزَادَ بِلاَلٌ فِي نِدَاءِ صَلاَةِ الْغَدَاةِ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ فَأَقَرَّهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ عُمَرُ يَا رَسُولَ اللَّهِ قَدْ رَأَيْتُ مِثْلَ الَّذِي رَأَى وَلَكِنَّهُ سَبَقَنِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ، - وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي مَحْذُورَةَ بْنِ مِعْيَرٍ حِينَ جَهَّزَهُ إِلَى الشَّامِ - فَقُلْتُ لأَبِي مَحْذُورَةَ أَىْ عَمِّ إِنِّي خَارِجٌ إِلَى الشَّامِ وَإِنِّي أُسْأَلُ عَنْ تَأْذِينِكَ فَأَخْبَرَنِي أَنَّ أَبَا مَحْذُورَةَ قَالَ خَرَجْتُ فِي نَفَرٍ فَكُنَّا بِبَعْضِ الطَّرِيقِ فَأَذَّنَ مُؤَذِّنُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بِالصَّلاَةِ عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَمِعْنَا صَوْتَ الْمُؤَذِّنِ وَنَحْنُ عَنْهُ مُتَنَكِّبُونَ فَصَرَخْنَا نَحْكِيهِ نَهْزَأُ بِهِ فَسَمِعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَرْسَلَ إِلَيْنَا قَوْمًا فَأَقْعَدُونَا بَيْنَ يَدَيْهِ فَقَالَ ‏\"‏ أَيُّكُمُ الَّذِي سَمِعْتُ صَوْتَهُ قَدِ ارْتَفَعَ ‏\"‏ ‏.‏ فَأَشَارَ إِلَىَّ الْقَوْمُ كُلُّهُمْ وَصَدَقُوا فَأَرْسَلَ كُلَّهُمْ وَحَبَسَنِي وَقَالَ لِي ‏\"‏ قُمْ فَأَذِّنْ ‏\"‏ ‏.‏ فَقُمْتُ وَلاَ شَىْءَ أَكْرَهُ إِلَىَّ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَلاَ مِمَّا يَأْمُرُنِي بِهِ فَقُمْتُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَلْقَى عَلَىَّ رَسُولُ اللَّهِ التَّأْذِينَ هُوَ بِنَفْسِهِ فَقَالَ ‏\"‏ قُلِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ ثُمَّ قَالَ لِي ‏\"‏ ارْجِعْ فَمُدَّ مِنْ صَوْتِكَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ حَىَّ عَلَى الْفَلاَحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ ثُمَّ دَعَانِي حِينَ قَضَيْتُ التَّأْذِينَ فَأَعْطَانِي صُرَّةً فِيهَا شَىْءٌ مِنْ فِضَّةٍ ثُمَّ وَضَعَ يَدَهُ عَلَى نَاصِيَةِ أَبِي مَحْذُورَةَ ثُمَّ أَمَرَّهَا عَلَى وَجْهِهِ مِنْ بَيْنِ يَدَيْهِ ثُمَّ عَلَى كَبِدِهِ ثُمَّ بَلَغَتْ يَدُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ سُرَّةَ أَبِي مَحْذُورَةَ ثُمَّ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَمَرْتَنِي بِالتَّأْذِينِ بِمَكَّةَ قَالَ ‏\"‏ نَعَمْ قَدْ أَمَرْتُكَ ‏\"‏ ‏.‏ فَذَهَبَ كُلُّ شَىْءٍ كَانَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ كَرَاهِيَةٍ وَعَادَ ذَلِكَ كُلُّهُ مَحَبَّةً لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَدِمْتُ عَلَى عَتَّابِ بْنِ أَسِيدٍ عَامِلِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بِمَكَّةَ فَأَذَّنْتُ مَعَهُ بِالصَّلاَةِ عَلَى أَمْرِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ وَأَخْبَرَنِي ذَلِكَ مَنْ أَدْرَكَ أَبَا مَحْذُورَةَ عَلَى مَا أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَيْرِيزٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ عَامِرٍ الأَحْوَلِ، أَنَّ مَكْحُولاً، حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مُحَيْرِيزٍ حَدَّثَهُ أَنَّ أَبَا مَحْذُورَةَ حَدَّثَهُ قَالَ عَلَّمَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الأَذَانَ تِسْعَ عَشْرَةَ كَلِمَةً وَالإِقَامَةَ سَبْعَ عَشْرَةَ كَلِمَةً الأَذَانُ ‏\"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ حَىَّ عَلَى الْفَلاَحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ وَالإِقَامَةُ سَبْعَ عَشْرَةَ كَلِمَةً ‏\"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ حَىَّ عَلَى الْفَلاَحِ قَدْ قَامَتِ الصَّلاَةُ قَدْ قَامَتِ الصَّلاَةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ، مُؤَذِّنِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَمَرَ بِلاَلاً أَنْ يَجْعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ وَقَالَ ‏ \"‏ إِنَّهُ أَرْفَعُ لِصَوْتِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ حَجَّاجِ بْنِ أَرْطَاةَ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ بِالأَبْطَحِ وَهُوَ فِي قُبَّةٍ حَمْرَاءَ فَخَرَجَ بِلاَلٌ فَأَذَّنَ فَاسْتَدَارَ فِي أَذَانِهِ وَجَعَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ، عَنْ مَرْوَانَ بْنِ سَالِمٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ خَصْلَتَانِ مُعَلَّقَتَانِ فِي أَعْنَاقِ الْمُؤَذِّنِينَ لِلْمُسْلِمِينَ صَلاَتُهُمْ وَصِيَامُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شَرِيكٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ بِلاَلٌ لاَ يُؤَخِّرُ الأَذَانَ عَنِ الْوَقْتِ وَرُبُّمَا أَخَّرَ الإِقَامَةَ شَيْئًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ أَشْعَثَ، عَنِ الْحَسَنِ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، قَالَ كَانَ آخِرُ مَا عَهِدَ إِلَىَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ أَنْ لاَ أَتَّخِذَ مُؤَذِّنًا يَأْخُذُ عَلَى الأَذَانِ أَجْرًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَسَدِيُّ، عَنْ أَبِي إِسْرَائِيلَ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ بِلاَلٍ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ أُثَوِّبَ فِي الْفَجْرِ وَنَهَانِي أَنْ أُثَوِّبَ فِي الْعِشَاءِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ بِلاَلٍ، أَنَّهُ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ يُؤْذِنُهُ بِصَلاَةِ الْفَجْرِ فَقِيلَ هُوَ نَائِمٌ ‏.‏ فَقَالَ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ فَأُقِرَّتْ فِي تَأْذِينِ الْفَجْرِ فَثَبَتَ الأَمْرُ عَلَى ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ، حَدَّثَنَا الإِفْرِيقِيُّ، عَنْ زِيَادِ بْنِ نُعَيْمٍ، عَنْ زِيَادِ بْنِ الْحَارِثِ الصُّدَائِيِّ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي سَفَرٍ فَأَمَرَنِي فَأَذَّنْتُ فَأَرَادَ بِلاَلٌ أَنْ يُقِيمَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ أَخَا صُدَاءٍ قَدْ أَذَّنَ وَمَنْ أَذَّنَ فَهُوَ يُقِيمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنْ عَبَّادِ بْنِ إِسْحَاقَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا أَذَّنَ الْمُؤَذِّنُ فَقُولُوا مِثْلَ قَوْلِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "حَدَّثَنَا شُجَاعُ بْنُ مَخْلَدٍ أَبُو الْفَضْلِ، قَالَ حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا أَبُو بِشْرٍ، عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ أَبِي سُفْيَانَ، حَدَّثَتْنِي عَمَّتِي أُمُّ حَبِيبَةَ، أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ إِذَا كَانَ عِنْدَهَا فِي يَوْمِهَا وَلَيْلَتِهَا فَسَمِعَ الْمُؤَذِّنَ يُؤَذِّنُ قَالَ كَمَا يَقُولُ الْمُؤَذِّنُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا كَمَا يَقُولُ الْمُؤَذِّنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏ \"‏ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا غُفِرَ لَهُ ذَنْبُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَالْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، وَمُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ، قَالُوا حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ الأَلْهَانِيُّ، حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ - إِلاَّ حَلَّتْ لَهُ الشَّفَاعَةُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، - وَكَانَ أَبُوهُ فِي حِجْرِ أَبِي سَعِيدٍ - قَالَ قَالَ لِي أَبُو سَعِيدٍ إِذَا كُنْتَ فِي الْبَوَادِي فَارْفَعْ صَوْتَكَ بِالأَذَانِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ لاَ يَسْمَعُهُ جِنٌّ وَلاَ إِنْسٌ وَلاَ شَجَرٌ وَلاَ حَجَرٌ إِلاَّ شَهِدَ لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ، عَنْ أَبِي يَحْيَى، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ مِنْ، فِي رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْمُؤَذِّنُ يُغْفَرُ لَهُ مَدَّ صَوْتِهِ وَيَسْتَغْفِرُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ وَشَاهِدُ الصَّلاَةِ يُكْتَبُ لَهُ خَمْسٌ وَعِشْرُونَ حَسَنَةً وَيُكَفَّرُ عَنْهُ مَا بَيْنَهُمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عِيسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى، أَخُو سُلَيْمٍ الْقَارِي عَنِ الْحَكَمِ بْنِ أَبَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لِيُؤَذِّنْ لَكُمْ خِيَارُكُمْ وَلْيَؤُمَّكُمْ قُرَّاؤُكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُخْتَارُ بْنُ غَسَّانَ، حَدَّثَنَا حَفْصُ بْنُ عُمَرَ الأَزْرَقُ الْبُرْجُمِيُّ، عَنْ جَابِرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، ح وَحَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، حَدَّثَنَا أَبُو حَمْزَةَ، عَنْ جَابِرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ أَذَّنَ مُحْتَسِبًا سَبْعَ سِنِينَ كَتَبَ اللَّهُ لَهُ بَرَاءَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنْ أَذَّنَ ثِنْتَىْ عَشْرَةَ سَنَةً وَجَبَتْ لَهُ الْجَنَّةُ وَكُتِبَ لَهُ بِتَأْذِينِهِ فِي كُلِّ يَوْمٍ سِتُّونَ حَسَنَةً وَلِكُلِّ إِقَامَةٍ ثَلاَثُونَ حَسَنَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ الْتَمَسُوا شَيْئًا يُؤْذِنُونَ بِهِ عِلْمًا لِلصَّلاَةِ فَأُمِرَ بِلاَلٌ أَنْ يَشْفَعَ الأَذَانَ وَيُوتِرَ الإِقَامَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ أُمِرَ بِلاَلٌ أَنْ يَشْفَعَ، الأَذَانَ وَيُوتِرَ الإِقَامَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ، مُؤَذِّنِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ أَذَانَ بِلاَلٍ كَانَ مَثْنَى مَثْنَى وَإِقَامَتُهُ مُفْرَدَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "حَدَّثَنَا أَبُو بَدْرٍ، عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنِي مَعْمَرُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، مَوْلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ حَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عُبَيْدِ اللَّهِ عَنْ أَبِي رَافِعٍ قَالَ رَأَيْتُ بِلاَلاً يُؤَذِّنُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مَثْنَى مَثْنَى وَيُقِيمُ وَاحِدَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ أَبِي الشَّعْثَاءِ، قَالَ كُنَّا قُعُودًا فِي الْمَسْجِدِ مَعَ أَبِي هُرَيْرَةَ فَأَذَّنَ الْمُؤَذِّنُ فَقَامَ رَجُلٌ مِنَ الْمَسْجِدِ يَمْشِي فَأَتْبَعَهُ أَبُو هُرَيْرَةَ بَصَرَهُ حَتَّى خَرَجَ مِنَ الْمَسْجِدِ فَقَالَ أَبُو هُرَيْرَةَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ ـ صلى الله عليه وسلم ـ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا عَبْدُ الْجَبَّارِ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي فَرْوَةَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ أَبِيهِ، عَنْ عُثْمَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ أَدْرَكَهُ الأَذَانُ فِي الْمَسْجِدِ ثُمَّ خَرَجَ لَمْ يَخْرُجْ لِحَاجَةٍ وَهُوَ لاَ يُرِيدُ الرَّجْعَةَ فَهُوَ مُنَافِقٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		}
	]
}