{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"31": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ، قَالَ شَهِدْتُ الأَعْرَابَ يَسْأَلُونَ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَعَلَيْنَا حَرَجٌ فِي كَذَا أَعَلَيْنَا حَرَجٌ فِي كَذَا فَقَالَ لَهُمْ ‏\"‏ عِبَادَ اللَّهِ وَضَعَ اللَّهُ الْحَرَجَ إِلاَّ مَنِ اقْتَرَضَ مِنْ عِرْضِ أَخِيهِ شَيْئًا فَذَاكَ الَّذِي حَرَجٌ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ هَلْ عَلَيْنَا جُنَاحٌ أَنْ نَتَدَاوَى قَالَ ‏\"‏ تَدَاوَوْا عِبَادَ اللَّهِ فَإِنَّ اللَّهَ سُبْحَانَهُ لَمْ يَضَعْ دَاءً إِلاَّ وَضَعَ مَعَهُ شِفَاءً إِلاَّ الْهَرَمَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا خَيْرُ مَا أُعْطِيَ الْعَبْدُ قَالَ ‏\"‏ خُلُقٌ حَسَنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": 3437,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ أَبِي خِزَامَةَ، عَنْ أَبِي خِزَامَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَرَأَيْتَ أَدْوِيَةً نَتَدَاوَى بِهَا وَرُقًى نَسْتَرْقِي بِهَا وَتُقًى نَتَّقِيهَا هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا قَالَ ‏ \"‏ هِيَ مِنْ قَدَرِ اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": 3438,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ دَوَاءً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": 3439,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا أَبُو أَحْمَدَ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا عَطَاءٌ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": 3440,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا صَفْوَانُ بْنُ هُبَيْرَةَ، حَدَّثَنَا أَبُو مَكِينٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَادَ رَجُلاً فَقَالَ لَهُ ‏\"‏ مَا تَشْتَهِي ‏\"‏ ‏.‏ فَقَالَ أَشْتَهِي خُبْزَ بُرٍّ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ كَانَ عِنْدَهُ خُبْزُ بُرٍّ فَلْيَبْعَثْ إِلَى أَخِيهِ ‏\"‏ ‏.‏ ثُمَّ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا اشْتَهَى مَرِيضُ أَحَدِكُمْ شَيْئًا فَلْيُطْعِمْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": 3441,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ دَخَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى مَرِيضٍ يَعُودُهُ قَالَ ‏ \"‏ أَتَشْتَهِي شَيْئًا أَتَشْتَهِي كَعْكًا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَطَلَبُوا لَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": 3442,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، وَأَبُو دَاوُدَ قَالاَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ، عَنْ أُمِّ الْمُنْذِرِ بِنْتِ قَيْسٍ الأَنْصَارِيَّةِ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَعَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ وَعَلِيٌّ نَاقِهٌ مِنْ مَرَضٍ وَلَنَا دَوَالِي مُعَلَّقَةٌ وَكَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَأْكُلُ مِنْهَا فَتَنَاوَلَ عَلِيٌّ لِيَأْكُلَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَهْ يَا عَلِيُّ إِنَّكَ نَاقِهٌ ‏\"‏ ‏.‏ قَالَتْ فَصَنَعْتُ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ سِلْقًا وَشَعِيرًا فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ يَا عَلِيُّ مِنْ هَذَا فَأَصِبْ فَإِنَّهُ أَنْفَعُ لَكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": 3443,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ عَبْدِ الْحَمِيدِ بْنِ صَيْفِيٍّ، - مِنْ وَلَدِ صُهَيْبٍ - عَنْ أَبِيهِ، عَنْ جَدِّهِ، صُهَيْبٍ قَالَ قَدِمْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَبَيْنَ يَدَيْهِ خُبْزٌ وَتَمْرٌ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ ادْنُ فَكُلْ ‏\"‏ ‏.‏ فَأَخَذْتُ آكُلُ مِنَ التَّمْرِ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ تَأْكُلُ تَمْرًا وَبِكَ رَمَدٌ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ إِنِّي أَمْضُغُ مِنْ نَاحِيَةٍ أُخْرَى ‏.‏ فَتَبَسَّمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": 3444,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ، عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ، عَنْ أَبِيهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ وَالشَّرَابِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": 3445,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا مُحَمَّدُ بْنُ السَّائِبِ بْنِ بَرَكَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَخَذَ أَهْلَهُ الْوَعْكُ أَمَرَ بِالْحَسَاءِ ‏.‏ قَالَتْ وَكَانَ يَقُولُ ‏ \"‏ إِنَّهُ لَيَرْتُو فُؤَادَ الْحَزِينِ وَيَسْرُو عَنْ فُؤَادِ السَّقِيمِ كَمَا تَسْرُو إِحْدَاكُنَّ الْوَسَخَ عَنْ وَجْهِهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": 3446,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ أَيْمَنَ بْنِ نَابِلٍ، عَنِ امْرَأَةٍ، مِنْ قُرَيْشٍ يُقَالَ لَهَا كَلْثَمُ عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ عَلَيْكُمْ بِالْبَغِيضِ النَّافِعِ التَّلْبِينَةِ ‏\"‏ ‏.‏ يَعْنِي الْحَسَاءَ ‏.‏ قَالَتْ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا اشْتَكَى أَحَدٌ مِنْ أَهْلِهِ لَمْ تَزَلِ الْبُرْمَةُ عَلَى النَّارِ حَتَّى يَنْتَهِيَ أَحَدُ طَرَفَيْهِ ‏.‏ يَعْنِي يَبْرَأُ أَوْ يَمُوتُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": 3447,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، وَمُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيَّانِ، قَالاَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِنَّ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏ ‏.‏ وَالسَّامُ الْمَوْتُ ‏.‏ وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": 3448,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُثْمَانَ بْنِ عَبْدِ الْمَلِكِ، قَالَ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ فَإِنَّ فِيهَا شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": 3449,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، قَالَ خَرَجْنَا وَمَعَنَا غَالِبُ بْنُ أَبْجَرَ فَمَرِضَ فِي الطَّرِيقِ فَقَدِمْنَا الْمَدِينَةَ وَهُوَ مَرِيضٌ فَعَادَهُ ابْنُ أَبِي عَتِيقٍ وَقَالَ لَنَا عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ فَخُذُوا مِنْهَا خَمْسًا أَوْ سَبْعًا فَاسْحَقُوهَا ثُمَّ اقْطُرُوهَا فِي أَنْفِهِ بِقَطَرَاتِ زَيْتٍ فِي هَذَا الْجَانِبِ وَفِي هَذَا الْجَانِبِ فَإِنَّ عَائِشَةَ حَدَّثَتْهُمْ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ هَذِهِ الْحَبَّةَ السَّوْدَاءَ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ أَنْ يَكُونَ السَّامُ ‏\"‏ ‏.‏ قُلْتُ وَمَا السَّامُ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": 3450,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ، حَدَّثَنَا سَعِيدُ بْنُ زَكَرِيَّاءَ الْقُرَشِيُّ، حَدَّثَنَا الزُّبَيْرُ بْنُ سَعِيدٍ الْهَاشِمِيُّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سَالِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ لَعِقَ الْعَسَلَ ثَلاَثَ غَدَوَاتٍ كُلَّ شَهْرٍ لَمْ يُصِبْهُ عَظِيمٌ مِنَ الْبَلاَءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": 3451,
			"text": "حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عُمَرُ بْنُ سَهْلٍ، حَدَّثَنَا أَبُو حَمْزَةَ الْعَطَّارُ، عَنِ الْحَسَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أُهْدِيَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ عَسَلٌ فَقَسَمَ بَيْنَنَا لُعْقَةً لُعْقَةً فَأَخَذْتُ لُعْقَتِي ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ أَزْدَادُ أُخْرَى قَالَ ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": 3452,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ عَلَيْكُمْ بِالشِّفَاءَيْنِ الْعَسَلِ وَالْقُرْآنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": 3453,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي سَعِيدٍ، وَجَابِرٍ، قَالاَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِي شِفَاءٌ مِنَ الْجَنَّةَ ‏\"‏ ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقِّيَّانِ، قَالاَ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ بْنِ هِشَامٍ، عَنِ الأَعْمَشِ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": 3454,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، سَمِعَ عَمْرَو بْنَ حُرَيْثٍ، يَقُولُ سَمِعْتُ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، يُحَدِّثُ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّ ‏ \"‏ الْكَمْأَةُ مِنَ الْمَنِّ الَّذِي أَنْزَلَ اللَّهُ عَلَى بَنِي إِسْرَائِيلَ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": 3455,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ، حَدَّثَنَا مَطَرٌ الْوَرَّاقُ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا نَتَحَدَّثُ عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَذَكَرْنَا الْكَمْأَةَ فَقَالُوا هِيَ جُدَرِيُّ الأَرْضِ ‏.‏ فَنُمِيَ الْحَدِيثُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِيَ شِفَاءٌ مِنَ السَّمِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": 3456,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا الْمُشْمَعِلُّ بْنُ إِيَاسٍ الْمُزَنِيُّ، حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْعَجْوَةُ وَالصَّخْرَةُ مِنَ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ حَفِظْتُ الصَّخْرَةَ مِنْ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": 3457,
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ بْنِ سَرْجٍ الْفِرْيَابِيُّ، حَدَّثَنَا عَمْرُو بْنُ بَكْرٍ السَّكْسَكِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ، قَالَ سَمِعْتُ أَبَا أُبَىٍّ ابْنَ أُمِّ حَرَامٍ، وَكَانَ، قَدْ صَلَّى مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ الْقِبْلَتَيْنِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ عَلَيْكُمْ بِالسَّنَى وَالسَّنُّوتِ فَإِنَّ فِيهِمَا شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا السَّامُ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏ قَالَ عَمْرٌو قَالَ ابْنُ أَبِي عَبْلَةَ السَّنُّوتُ الشِّبِتُّ ‏.‏ وَقَالَ آخَرُونَ بَلْ هُوَ الْعَسَلُ الَّذِي يَكُونُ فِي زِقَاقِ السَّمْنِ وَهُوَ قَوْلُ الشَّاعِرِ هُمُ السَّمْنُ بِالسَّنُّوتِ لاَ أَلْسَ فِيهِمُ وَهُمْ يَمْنَعُونَ جَارَهُمْ أَنْ يُقَرَّدَا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": 3458,
			"text": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا السَّرِيُّ بْنُ مِسْكِينٍ، حَدَّثَنَا ذُؤَادُ بْنُ عُلْبَةَ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ هَجَّرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَهَجَّرْتُ فَصَلَّيْتُ ثُمَّ جَلَسْتُ فَالْتَفَتَ إِلَىَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ اشِكَمَتْ دَرْدْ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُمْ فَصَلِّ فَإِنَّ فِي الصَّلاَةِ شِفَاءً ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ الْقَطَّانُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَنَا ذُؤَادُ بْنُ عُلْبَةَ، فَذَكَرَ نَحْوَهُ وَقَالَ فِيهِ اشِكَمَتْ دَرْدْ ‏.‏ يَعْنِي تَشْتَكِي بَطْنَكَ بِالْفَارِسِيَّةِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ حَدَّثَ بِهِ رَجُلٌ لأَهْلِهِ فَاسْتَعْدَوْا عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": 3459,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدَّوَاءِ الْخَبِيثِ ‏.‏ يَعْنِي السُّمَّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": 3460,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ شَرِبَ سُمًّا فَقَتَلَ نَفْسَهُ فَهُوَ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": 3461,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مَوْلًى، لِمَعْمَرٍ التَّيْمِيِّ عَنْ مَعْمَرٍ التَّيْمِيِّ، عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ، قَالَتْ قَالَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ بِمَاذَا كُنْتِ تَسْتَمْشِينَ ‏\"‏ ‏.‏ قُلْتُ بِالشُّبْرُمِ قَالَ ‏\"‏ حَارٌّ جَارٌّ ‏\"‏ ‏.‏ ثُمَّ اسْتَمْشَيْتُ بِالسَّنَى ‏.‏ فَقَالَ ‏\"‏ لَوْ كَانَ شَىْءٌ يَشْفِي مِنَ الْمَوْتِ كَانَ السَّنَى وَالسَّنَى شِفَاءٌ مِنَ الْمَوْتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": 3462,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَقَدْ أَعْلَقْتُ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ ‏ \"‏ عَلاَمَ تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ يُسْعَطُ بِهِ مِنَ الْعُذْرَةِ وَيُلَدُّ بِهِ مِنْ ذَاتِ الْجَنْبِ ‏\"‏ ‏.‏ حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏ قَالَ يُونُسُ أَعْلَقْتُ يَعْنِي غَمَزْتُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3463,
			"arabicnumber": 3463,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ شِفَاءُ عِرْقِ النَّسَا أَلْيَةُ شَاةٍ أَعْرَابِيَّةٍ تُذَابُ ثُمَّ تُجَزَّأُ ثَلاَثَةَ أَجْزَاءٍ ثُمَّ يُشْرَبُ عَلَى الرِّيقِ فِي كُلِّ يَوْمٍ جُزْءٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": 3464,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جُرِحَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمَ أُحُدٍ وَكُسِرَتْ رَبَاعِيَتُهُ وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ فَكَانَتْ فَاطِمَةُ تَغْسِلُ الدَّمَ عَنْهُ وَعَلِيٌّ يَسْكُبُ عَلَيْهِ الْمَاءَ بِالْمِجَنِّ فَلَمَّا رَأَتْ فَاطِمَةُ أَنَّ الْمَاءَ لاَ يَزِيدُ الدَّمَ إِلاَّ كَثْرَةً أَخَذَتْ قِطْعَةَ حَصِيرٍ فَأَحْرَقَتْهَا حَتَّى إِذَا صَارَ رَمَادًا أَلْزَمَتْهُ الْجُرْحَ فَاسْتَمْسَكَ الدَّمُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الْمُهَيْمِنِ بْنِ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ إِنِّي لأَعْرِفُ يَوْمَ أُحُدٍ مَنْ جَرَحَ وَجْهَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَنْ كَانَ يُرْقِئُ الْكَلْمَ مِنْ وَجْهِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَيُدَاوِيهِ وَمَنْ يَحْمِلُ الْمَاءَ فِي الْمِجَنِّ وَبِمَا دُووِيَ بِهِ الْكَلْمُ حَتَّى رَقَأَ ‏.‏ قَالَ أَمَّا مَنْ كَانَ يَحْمِلُ الْمَاءَ فِي الْمِجَنِّ فَعَلِيٌّ وَأَمَّا مَنْ كَانَ يُدَاوِي الْكَلْمَ فَفَاطِمَةُ أَحْرَقَتْ لَهُ حِينَ لَمْ يَرْقَأْ قِطْعَةَ حَصِيرٍ خَلَقٍ فَوَضَعَتْ رَمَادَهُ عَلَيْهِ فَرَقَأَ الْكَلْمُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": 3466,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": 3467,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَيْمُونٍ، حَدَّثَنِي أَبِي، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ نَعَتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ ذَاتِ الْجَنْبِ وَرْسًا وَقُسْطًا وَزَيْتًا يُلَدُّ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": 3468,
			"text": "حَدَّثَنَا أَبُو طَاهِرٍ، أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، وَابْنُ، سَمْعَانَ عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ عَلَيْكُمْ بِالْعُودِ الْهِنْدِيِّ - يَعْنِي بِهِ الْكُسْتَ - فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏ ‏.‏ قَالَ ابْنُ سَمْعَانَ فِي الْحَدِيثِ ‏\"‏ فَإِنَّ فِيهِ شِفَاءً مِنْ سَبْعَةِ أَدْوَاءٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": 3469,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُبَيْدَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ذُكِرَتِ الْحُمَّى عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَبَّهَا رَجُلٌ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تَسُبَّهَا فَإِنَّهَا تَنْفِي الذُّنُوبَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": 3470,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي صَالِحٍ الأَشْعَرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ عَادَ مَرِيضًا وَمَعَهُ أَبُو هُرَيْرَةَ مِنْ وَعْكٍ كَانَ بِهِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَبْشِرْ فَإِنَّ اللَّهَ يَقُولُ هِيَ نَارِي أُسَلِّطُهَا عَلَى عَبْدِيَ الْمُؤْمِنِ فِي الدُّنْيَا لِتَكُونَ حَظَّهُ مِنَ النَّارِ فِي الآخِرَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": 3471,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": 3472,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏ \"‏ إِنَّ شِدَّةَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏ فَدَخَلَ عَلَى ابْنٍ لِعَمَّارٍ فَقَالَ ‏\"‏ اكْشِفِ الْبَاسْ رَبَّ النَّاسْ إِلَهَ النَّاسْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": 3474,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا كَانَتْ تُؤْتَى بِالْمَرْأَةِ الْمَوْعُوكَةِ فَتَدْعُو بِالْمَاءِ فَتَصُبُّهُ فِي جَيْبِهَا وَتَقُولُ إِنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ ابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِنَّهَا مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": 3475,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ الْحُمَّى كِيرٌ مِنْ كِيرِ جَهَنَّمَ فَنَحُّوهَا عَنْكُمْ بِالْمَاءِ الْبَارِدِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": 3476,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنْ كَانَ فِي شَىْءٍ مِمَّا تَدَاوَوْنَ بِهِ خَيْرٌ فَالْحِجَامَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": 3477,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي بِمَلإٍ مِنَ الْمَلاَئِكَةِ إِلاَّ كُلُّهُمْ يَقُولُ لِي عَلَيْكَ يَا مُحَمَّدُ بِالْحِجَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": 3478,
			"text": "حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ نِعْمَ الْعَبْدُ الْحَجَّامُ يَذْهَبُ بِالدَّمِ وَيُخِفُّ الصُّلْبَ وَيَجْلُو الْبَصَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": 3479,
			"text": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ، حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي بِمَلإٍ إِلاَّ قَالُوا يَا مُحَمَّدُ مُرْ أُمَّتَكَ بِالْحِجَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": 3480,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ ـ صلى الله عليه وسلم ـ اسْتَأْذَنَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْحِجَامَةِ فَأَمَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا ‏.‏ وَقَالَ حَسِبْتُ أَنَّهُ كَانَ أَخَاهَا مِنَ الرَّضَاعَةِ أَوْ غُلاَمًا لَمْ يَحْتَلِمْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": 3481,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي عَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِلَحْىِ جَمَلٍ وَهُوَ مُحْرِمٌ وَسْطَ رَأْسِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": 3482,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ سَعْدٍ الإِسْكَافِ، عَنِ الأَصْبَغِ بْنِ نُبَاتَةَ، عَنْ عَلِيٍّ، قَالَ نَزَلَ جِبْرِيلُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ بِحِجَامَةِ الأَخْدَعَيْنِ وَالْكَاهِلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": 3483,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ فِي الأَخْدَعَيْنِ وَعَلَى الْكَاهِلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": 3484,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ ثَوْبَانَ، عَنْ أَبِيهِ، عَنْ أَبِي كَبْشَةَ الأَنْمَارِيِّ، أَنَّهُ حَدَّثَهُ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَحْتَجِمُ عَلَى هَامَتِهِ وَبَيْنَ كَتِفَيْهِ وَيَقُولُ ‏ \"‏ مَنْ أَهْرَاقَ مِنْهُ هَذِهِ الدِّمَاءَ فَلاَ يَضُرُّهُ أَنْ لاَ يَتَدَاوَى بِشَىْءٍ لِشَىْءٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": 3485,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ سَقَطَ مِنْ فَرَسِهِ عَلَى جِذْعٍ فَانْفَكَّتْ قَدَمُهُ ‏.‏ قَالَ وَكِيعٌ يَعْنِي أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ عَلَيْهَا مِنْ وَثْءٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": 3486,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عُثْمَانُ بْنُ مَطَرٍ، عَنْ زَكَرِيَّا بْنِ مَيْسَرَةَ، عَنِ النَّهَّاسِ بْنِ قَهْمٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنْ أَرَادَ الْحِجَامَةَ فَلْيَتَحَرَّ سَبْعَةَ عَشَرَ أَوْ تِسْعَةَ عَشَرَ أَوْ إِحْدَى وَعِشْرِينَ وَلاَ يَتَبَيَّغْ بِأَحَدِكُمُ الدَّمُ فَيَقْتُلَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": 3487,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عُثْمَانُ بْنُ مَطَرٍ، عَنِ الْحَسَنِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ يَا نَافِعُ قَدْ تَبَيَّغَ بِيَ الدَّمُ فَالْتَمِسْ لِي حَجَّامًا وَاجْعَلْهُ رَفِيقًا إِنِ اسْتَطَعْتَ وَلاَ تَجْعَلْهُ شَيْخًا كَبِيرًا وَلاَ صَبِيًّا صَغِيرًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَفِيهِ شِفَاءٌ وَبَرَكَةٌ وَتَزِيدُ فِي الْعَقْلِ وَفِي الْحِفْظِ فَاحْتَجِمُوا عَلَى بَرَكَةِ اللَّهِ يَوْمَ الْخَمِيسِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الأَرْبِعَاءِ وَالْجُمُعَةِ وَالسَّبْتِ وَيَوْمَ الأَحَدِ تَحَرِّيًا وَاحْتَجِمُوا يَوْمَ الاِثْنَيْنِ وَالثُّلاَثَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي عَافَى اللَّهُ فِيهِ أَيُّوبَ مِنَ الْبَلاَءِ وَضَرَبَهُ بِالْبَلاَءِ يَوْمَ الأَرْبِعَاءِ فَإِنَّهُ لاَ يَبْدُو جُذَامٌ وَلاَ بَرَصٌ إِلاَّ يَوْمَ الأَرْبِعَاءِ أَوْ لَيْلَةَ الأَرْبِعَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": 3488,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِصْمَةَ، عَنْ سَعِيدِ بْنِ مَيْمُونٍ، عَنْ نَافِعٍ، قَالَ قَالَ ابْنُ عُمَرَ يَا نَافِعُ تَبَيَّغَ بِيَ الدَّمُ فَأْتِنِي بِحَجَّامٍ وَاجْعَلْهُ شَابًّا وَلاَ تَجْعَلْهُ شَيْخًا وَلاَ صَبِيًّا ‏.‏ قَالَ وَقَالَ ابْنُ عُمَرَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَهِيَ تَزِيدُ فِي الْعَقْلِ وَتَزِيدُ فِي الْحِفْظِ وَتَزِيدُ الْحَافِظَ حِفْظًا فَمَنْ كَانَ مُحْتَجِمًا فَيَوْمَ الْخَمِيسِ عَلَى اسْمِ اللَّهِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْجُمُعَةِ وَيَوْمَ السَّبْتِ وَيَوْمَ الأَحَدِ وَاحْتَجِمُوا يَوْمَ الاِثْنَيْنِ وَالثُّلاَثَاءِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الأَرْبِعَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي أُصِيبَ فِيهِ أَيُّوبُ بِالْبَلاَءِ وَمَا يَبْدُو جُذَامٌ وَلاَ بَرَصٌ إِلاَّ فِي يَوْمِ الأَرْبِعَاءِ أَوْ لَيْلَةِ الأَرْبِعَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3489,
			"arabicnumber": 3489,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنْ عَقَّارِ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنِ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3490,
			"arabicnumber": 3490,
			"text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، وَيُونُسَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْكَىِّ فَاكْتَوَيْتُ فَمَا أَفْلَحْتُ وَلاَ أَنْجَحْتُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3491,
			"arabicnumber": 3491,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، حَدَّثَنَا سَالِمٌ الأَفْطَسُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏ \"‏ الشِّفَاءُ فِي ثَلاَثٍ شَرْبَةِ عَسَلٍ وَشَرْطَةِ مِحْجَمٍ وَكَيَّةٍ بِنَارٍ وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏ ‏.‏ رَفَعَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3492,
			"arabicnumber": 3492,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، غُنْدَرٌ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ الأَنْصَارِيُّ، قَالَ سَمِعْتُ عَمِّي، يَحْيَى - وَمَا أَدْرَكْتُ رَجُلاً مِنَّا بِهِ شَبِيهًا يُحَدِّثُ النَّاسَ أَنَّ سَعْدَ بْنَ زُرَارَةَ - وَهُوَ جَدُّ مُحَمَّدٍ مِنْ قِبَلِ أُمِّهِ أَنَّهُ أَخَذَهُ وَجَعٌ فِي حَلْقِهِ يُقَالُ لَهُ الذُّبْحَةُ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ لأُبْلِغَنَّ أَوْ لأُبْلِيَنَّ فِي أَبِي أُمَامَةَ عُذْرًا ‏\"‏ ‏.‏ فَكَوَاهُ بِيَدِهِ فَمَاتَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مِيتَةَ سُوءٍ لِلْيَهُودِ يَقُولُونَ أَفَلاَ دَفَعَ عَنْ صَاحِبِهِ ‏.‏ وَمَا أَمْلِكُ لَهُ وَلاَ لِنَفْسِي شَيْئًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": 3493,
			"text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ مَرِضَ أُبَىُّ بْنُ كَعْبٍ مَرَضًا فَأَرْسَلَ إِلَيْهِ النَّبِيُّ طَبِيبًا فَكَوَاهُ عَلَى أَكْحَلِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3494,
			"arabicnumber": 3494,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَوَى سَعْدَ بْنَ مُعَاذٍ فِي أَكْحَلِهِ مَرَّتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": 3495,
			"text": "حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الْمَلِكِ، قَالَ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ عَلَيْكُمْ بِالإِثْمِدِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3496,
			"arabicnumber": 3496,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ عَلَيْكُمْ بِالإِثْمِدِ عِنْدَ النَّوْمِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3497,
			"arabicnumber": 3497,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ خَيْرُ أَكْحَالِكُمُ الإِثْمِدُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3498,
			"arabicnumber": 3498,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ حُصَيْنٍ الْحِمْيَرِيِّ، عَنْ أَبِي سَعْدِ الْخَيْرِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنِ اكْتَحَلَ فَلْيُوتِرْ مَنْ فَعَلَ فَقَدْ أَحْسَنَ وَمَنْ لاَ فَلاَ حَرَجَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3499,
			"arabicnumber": 3499,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ عَبَّادِ بْنِ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتْ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ مُكْحُلَةٌ يَكْتَحِلُ مِنْهَا ثَلاَثًا فِي كُلِّ عَيْنٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3500,
			"arabicnumber": 3500,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ، عَنْ طَارِقِ بْنِ سُوَيْدٍ الْحَضْرَمِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ بِأَرْضِنَا أَعْنَابًا نَعْتَصِرُهَا فَنَشْرَبُ مِنْهَا قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ فَرَاجَعْتُهُ قُلْتُ إِنَّا نَسْتَشْفِي بِهِ لِلْمَرِيضِ ‏.‏ قَالَ ‏\"‏ إِنَّ ذَلِكَ لَيْسَ بِشِفَاءٍ وَلَكِنَّهُ دَاءٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3501,
			"arabicnumber": 3501,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عُتْبَةَ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ، حَدَّثَنَا سَعَّادُ بْنُ سُلَيْمَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ خَيْرُ الدَّوَاءِ الْقُرْآنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3502,
			"arabicnumber": 3502,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا فَائِدٌ، مَوْلَى عُبَيْدِ اللَّهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ حَدَّثَنِي مَوْلاَىَ، عُبَيْدُ اللَّهِ حَدَّثَتْنِي جَدَّتِي، سَلْمَى أُمُّ رَافِعٍ مَوْلاَةُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَتْ كَانَ لاَ يُصِيبُ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَرْحَةٌ وَلاَ شَوْكَةٌ إِلاَّ وَضَعَ عَلَيْهِ الْحِنَّاءَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3503,
			"arabicnumber": 3503,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، مِنْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَاجْتَوَوُا الْمَدِينَةَ فَقَالَ ـ صلى الله عليه وسلم ـ ‏ \"‏ لَوْ خَرَجْتُمْ إِلَى ذَوْدٍ لَنَا فَشَرِبْتُمْ مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَفَعَلُوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3504,
			"arabicnumber": 3504,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدٍ، عَنْ أَبِي سَلَمَةَ، حَدَّثَنِي أَبُو سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ فِي أَحَدِ جَنَاحَىِ الذُّبَابِ سُمٌّ وَفِي الآخَرِ شِفَاءٌ فَإِذَا وَقَعَ فِي الطَّعَامِ فَامْقُلُوهُ فِيهِ فَإِنَّهُ يُقَدِّمُ السُّمَّ وَيُؤَخِّرُ الشِّفَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3505,
			"arabicnumber": 3505,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا وَقَعَ الذُّبَابُ فِي شَرَابِكُمْ فَلْيَغْمِسْهُ فِيهِ ثُمَّ لْيَطْرَحْهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الآخَرِ شِفَاءً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3506,
			"arabicnumber": 3506,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ أُمَيَّةَ بْنِ هِنْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ الْعَيْنُ حَقٌّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3507,
			"arabicnumber": 3507,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ مُضَارِبِ بْنِ حَزْنٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْعَيْنُ حَقٌّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3508,
			"arabicnumber": 3508,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي وَاقِدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ اسْتَعِيذُوا بِاللَّهِ فَإِنَّ الْعَيْنَ حَقٌّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3509,
			"arabicnumber": 3509,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ مَرَّ عَامِرُ بْنُ رَبِيعَةَ بِسَهْلِ بْنِ حُنَيْفٍ وَهُوَ يَغْتَسِلُ فَقَالَ لَمْ أَرَ كَالْيَوْمِ وَلاَ جِلْدَ مُخَبَّأَةٍ ‏.‏ فَمَا لَبِثَ أَنْ لُبِطَ بِهِ فَأُتِيَ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقِيلَ لَهُ أَدْرِكْ سَهْلاً صَرِيعًا ‏.‏ قَالَ ‏\"‏ مَنْ تَتَّهِمُونَ بِهِ ‏\"‏ ‏.‏ قَالُوا عَامِرَ بْنَ رَبِيعَةَ ‏.‏ قَالَ ‏\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ إِذَا رَأَى أَحَدُكُمْ مِنْ أَخِيهِ مَا يُعْجِبُهُ فَلْيَدْعُ لَهُ بِالْبَرَكَةِ ‏\"‏ ‏.‏ ثُمَّ دَعَا بِمَاءٍ فَأَمَرَ عَامِرًا أَنْ يَتَوَضَّأَ فَيَغْسِلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَرُكْبَتَيْهِ وَدَاخِلَةَ إِزَارِهِ وَأَمَرَهُ أَنْ يَصُبَّ عَلَيْهِ ‏.‏ قَالَ سُفْيَانُ قَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ وَأَمَرَهُ أَنْ يَكْفَأَ الإِنَاءَ مِنْ خَلْفِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3510,
			"arabicnumber": 3510,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عُرْوَةَ بْنِ عَامِرٍ، عَنْ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ، قَالَ قَالَتْ أَسْمَاءُ يَا رَسُولَ اللَّهِ إِنَّ بَنِي جَعْفَرٍ تُصِيبُهُمُ الْعَيْنُ فَأَسْتَرْقِي لَهُمْ قَالَ ‏ \"‏ نَعَمْ فَلَوْ كَانَ شَىْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3511,
			"arabicnumber": 3511,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، عَنْ عَبَّادٍ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَتَعَوَّذُ مِنْ عَيْنِ الْجَانِّ وَأَعْيُنِ الإِنْسِ فَلَمَّا نَزَلَتِ الْمُعَوِّذَتَانِ أَخَذَهُمَا وَتَرَكَ مَا سِوَى ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3512,
			"arabicnumber": 3512,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، وَمِسْعَرٍ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَمَرَهَا أَنْ تَسْتَرْقِيَ مِنَ الْعَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3513,
			"arabicnumber": 3513,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ بُرَيْدَةَ بْنِ الْحُصَيْبِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ رُقْيَةَ إِلاَّ مِنْ عَيْنٍ أَوْ حُمَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3514,
			"arabicnumber": 3514,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، أَنَّ خَالِدَةَ بِنْتَ أَنَسٍ أُمَّ بَنِي حَزْمٍ السَّاعِدِيَّةَ، جَاءَتْ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَعَرَضَتْ عَلَيْهِ الرُّقَى فَأَمَرَهَا بِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3515,
			"arabicnumber": 3515,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا يَحْيَى بْنُ عِيسَى، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ كَانَ أَهْلُ بَيْتٍ مِنَ الأَنْصَارِ يُقَالُ لَهُمْ آلُ عَمْرِو بْنِ حَزْمٍ يَرْقُونَ مِنَ الْحُمَةِ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَدْ نَهَى عَنِ الرُّقَى فَأَتَوْهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّكَ قَدْ نَهَيْتَ عَنِ الرُّقَى وَإِنَّا نَرْقِي مِنَ الْحُمَةِ ‏.‏ فَقَالَ لَهُمُ ‏\"‏ اعْرِضُوا عَلَىَّ ‏\"‏ ‏.‏ فَعَرَضُوهَا عَلَيْهِ فَقَالَ ‏\"‏ لاَ بَأْسَ بِهَذِهِ هَذِهِ مَوَاثِيقُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3516,
			"arabicnumber": 3516,
			"text": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَخَّصَ فِي الرُّقْيَةِ مِنَ الْحُمَةِ وَالْعَيْنِ وَالنَّمْلَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3517,
			"arabicnumber": 3517,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ رَخَّصَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الرُّقْيَةِ مِنَ الْحَيَّةِ وَالْعَقْرَبِ ‏.‏",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3518,
			"arabicnumber": 3518,
			"text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ بَهْرَامَ، حَدَّثَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَدَغَتْ عَقْرَبٌ رَجُلاً فَلَمْ يَنَمْ لَيْلَتَهُ فَقِيلَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ إِنَّ فُلاَنًا لَدَغَتْهُ عَقْرَبٌ فَلَمْ يَنَمْ لَيْلَتَهُ ‏.‏ فَقَالَ ‏ \"‏ أَمَا إِنَّهُ لَوْ قَالَ حِينَ أَمْسَى أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ - مَا ضَرَّهُ لَدْغُ عَقْرَبٍ حَتَّى يُصْبِحَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3519,
			"arabicnumber": 3519,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ، عَنْ عَمْرِو بْنِ حَزْمٍ، قَالَ عَرَضْتُ النَّهْشَةَ مِنَ الْحَيَّةِ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَمَرَ بِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3520,
			"arabicnumber": 3520,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَتَى الْمَرِيضَ فَدَعَا لَهُ قَالَ ‏ \"‏ أَذْهِبِ الْبَاسْ رَبَّ النَّاسْ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3521,
			"arabicnumber": 3521,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ رَبِّهِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ مِمَّا يَقُولُ لِلْمَرِيضِ بِبُزَاقِهِ بِإِصْبَعِهِ ‏ \"‏ بِسْمِ اللَّهِ بِتُرْبَةِ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3522,
			"arabicnumber": 3522,
			"text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، أَنَّهُ قَالَ قَدِمْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَبِي وَجَعٌ قَدْ كَادَ يُبْطِلُنِي فَقَالَ لِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ اجْعَلْ يَدَكَ الْيُمْنَى عَلَيْهِ وَقُلْ بِسْمِ اللَّهِ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏ فَقُلْتُ ذَلِكَ فَشَفَانِيَ اللَّهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3523,
			"arabicnumber": 3523,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ جِبْرَائِيلَ، أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا مُحَمَّدُ اشْتَكَيْتَ قَالَ ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنٍ أَوْ حَاسِدٍ اللَّهُ يَشْفِيكَ بِسْمِ اللَّهِ أَرْقِيكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3524,
			"arabicnumber": 3524,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَحَفْصُ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ زِيَادِ بْنِ ثُوَيْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَعُودُنِي فَقَالَ لِي ‏\"‏ أَلاَ أَرْقِيكَ بِرُقْيَةٍ جَاءَنِي بِهَا جِبْرَائِيلُ ‏\"‏ ‏.‏ قُلْتُ بِأَبِي وَأُمِّي بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ بِسْمِ اللَّهِ أَرْقِيكَ وَاللَّهُ يَشْفِيكَ مِنْ كُلِّ دَاءٍ فِيكَ مِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3525,
			"arabicnumber": 3525,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ بْنِ هِشَامٍ الْبَغْدَادِيُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا أَبُو عَامِرٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ مِنْهَالٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ يَقُولُ ‏\"‏ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَكَانَ أَبُونَا إِبْرَاهِيمُ يَعُوِّذُ بِهَا إِسْمَاعِيلَ وَإِسْحَاقَ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ إِسْمَاعِيلَ وَيَعْقُوبَ ‏\"‏ ‏.‏ وَهَذَا حَدِيثُ وَكِيعٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3526,
			"arabicnumber": 3526,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِبْرَاهِيمُ الأَشْهَلِيُّ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يُعَلِّمُهُمْ مِنَ الْحُمَّى وَمِنَ الأَوْجَاعِ كُلِّهَا أَنْ يَقُولُوا ‏\"‏ بِسْمِ اللَّهِ الْكَبِيرِ أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ عِرْقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عَامِرٍ أَنَا أُخَالِفُ النَّاسَ فِي هَذَا أَقُولُ يَعَّارٍ ‏.‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي حَبِيبَةَ الأَشْهَلِيُّ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ وَقَالَ ‏\"‏ مِنْ شَرِّ عِرْقٍ نَعَّارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3527,
			"arabicnumber": 3527,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَبِي، عَنِ ابْنِ ثَوْبَانَ، عَنْ عُمَيْرٍ، أَنَّهُ سَمِعَ جُنَادَةَ بْنَ أَبِي أُمَيَّةَ، قَالَ سَمِعْتُ عُبَادَةَ بْنَ الصَّامِتِ، يَقُولُ أَتَى جِبْرَائِيلُ عَلَيْهِ السَّلاَمُ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَهُوَ يُوعَكُ فَقَالَ بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ حَسَدِ حَاسِدٍ وَمِنْ كُلِّ عَيْنٍ اللَّهُ يَشْفِيكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3528,
			"arabicnumber": 3528,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَنْفِثُ فِي الرُّقْيَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": 3529,
			"text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، قَالَ حَدَّثَنَا مَعْنُ بْنُ عِيسَى، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ الْمُعَوِّذَاتِ وَيَنْفِثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3530,
			"arabicnumber": 3530,
			"text": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بِشْرٍ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنِ ابْنِ أُخْتِ، زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ زَيْنَبَ، قَالَتْ كَانَتْ عَجُوزٌ تَدْخُلُ عَلَيْنَا تَرْقِي مِنَ الْحُمْرَةِ وَكَانَ لَنَا سَرِيرٌ طَوِيلُ الْقَوَائِمِ وَكَانَ عَبْدُ اللَّهِ إِذَا دَخَلَ تَنَحْنَحَ وَصَوَّتَ فَدَخَلَ يَوْمًا فَلَمَّا سَمِعَتْ صَوْتَهُ احْتَجَبَتْ مِنْهُ فَجَاءَ فَجَلَسَ إِلَى جَانِبِي فَمَسَّنِي فَوَجَدَ مَسَّ خَيْطٍ فَقَالَ مَا هَذَا فَقُلْتُ رُقًى لِي فِيهِ مِنَ الْحُمْرَةِ فَجَذَبَهُ وَقَطَعَهُ فَرَمَى بِهِ وَقَالَ لَقَدْ أَصْبَحَ آلُ عَبْدِ اللَّهِ أَغْنِيَاءَ عَنِ الشِّرْكِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ ‏\"‏ ‏.‏ قُلْتُ فَإِنِّي خَرَجْتُ يَوْمًا فَأَبْصَرَنِي فُلاَنٌ فَدَمَعَتْ عَيْنِي الَّتِي تَلِيهِ فَإِذَا رَقَيْتُهَا سَكَنَتْ دَمْعَتُهَا وَإِذَا تَرَكْتُهَا دَمَعَتْ ‏.‏ قَالَ ذَاكِ الشَّيْطَانُ إِذَا أَطَعْتِيهِ تَرَكَكِ وَإِذَا عَصَيْتِيهِ طَعَنَ بِإِصْبَعِهِ فِي عَيْنِكِ وَلَكِنْ لَوْ فَعَلْتِ كَمَا فَعَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ خَيْرًا لَكِ وَأَجْدَرَ أَنْ تَشْفِينَ تَنْضَحِينَ فِي عَيْنِكِ الْمَاءَ وَتَقُولِينَ ‏\"‏ أَذْهِبِ الْبَاسْ رَبَّ النَّاسْ اشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3531,
			"arabicnumber": 3531,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ مُبَارَكٍ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَأَى رَجُلاً فِي يَدِهِ حَلْقَةٌ مِنْ صُفْرٍ فَقَالَ ‏\"‏ مَا هَذِهِ الْحَلْقَةُ ‏\"‏ ‏.‏ قَالَ هَذِهِ مِنَ الْوَاهِنَةِ ‏.‏ قَالَ ‏\"‏ انْزِعْهَا فَإِنَّهَا لاَ تَزِيدُكَ إِلاَّ وَهْنًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3532,
			"arabicnumber": 3532,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أُمِّ جُنْدَبٍ، قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَمَى جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي يَوْمَ النَّحْرِ ثُمَّ انْصَرَفَ وَتَبِعَتْهُ امْرَأَةٌ مِنْ خَثْعَمٍ وَمَعَهَا صَبِيٌّ لَهَا بِهِ بَلاَءٌ لاَ يَتَكَلَّمُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ هَذَا ابْنِي وَبَقِيَّةُ أَهْلِي وَإِنَّ بِهِ بَلاَءً لاَ يَتَكَلَّمُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ائْتُونِي بِشَىْءٍ مِنْ مَاءٍ ‏\"‏ ‏.‏ فَأُتِيَ بِمَاءٍ فَغَسَلَ يَدَيْهِ وَمَضْمَضَ فَاهُ ثُمَّ أَعْطَاهَا فَقَالَ ‏\"‏ اسْقِيهِ مِنْهُ وَصُبِّي عَلَيْهِ مِنْهُ وَاسْتَشْفِي اللَّهَ لَهُ ‏\"‏ ‏.‏ قَالَتْ فَلَقِيتُ الْمَرْأَةَ فَقُلْتُ لَوْ وَهَبْتِ لِي مِنْهُ ‏.‏ فَقَالَتْ إِنَّمَا هُوَ لِهَذَا الْمُبْتَلَى ‏.‏ قَالَتْ فَلَقِيتُ الْمَرْأَةَ مِنَ الْحَوْلِ فَسَأَلْتُهَا عَنِ الْغُلاَمِ فَقَالَتْ بَرَأَ وَعَقَلَ عَقْلاً لَيْسَ كَعُقُولِ النَّاسِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3533,
			"arabicnumber": 3533,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عُتْبَةَ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ حَدَّثَنَا مُعَّادُ بْنُ سُلَيْمَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الدَّوَاءِ الْقُرْآنُ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3534,
			"arabicnumber": 3534,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِقَتْلِ ذِي الطُّفْيَتَيْنِ فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ وَيُصِيبُ الْحَبَلَ ‏.‏ يَعْنِي حَيَّةً خَبِيثَةً ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3535,
			"arabicnumber": 3535,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ اقْتُلُوا الْحَيَّاتِ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ وَيُسْقِطَانِ الْحَبَلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3536,
			"arabicnumber": 3536,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُعْجِبُهُ الْفَأْلُ الْحَسَنُ وَيَكْرَهُ الطِّيَرَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3537,
			"arabicnumber": 3537,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3538,
			"arabicnumber": 3538,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ، عَنْ عِيسَى بْنِ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الطِّيَرَةُ شِرْكٌ وَمَا مِنَّا إِلاَّ وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3539,
			"arabicnumber": 3539,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ هَامَةَ وَلاَ صَفَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3540,
			"arabicnumber": 3540,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي جَنَابٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ هَامَةَ ‏\"‏ ‏.‏ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ الْبَعِيرُ يَكُونُ بِهِ الْجَرَبُ فَتَجْرَبُ بِهِ الإِبِلُ ‏.‏ قَالَ ‏\"‏ ذَلِكَ الْقَدَرُ فَمَنْ أَجْرَبَ الأَوَّلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3541,
			"arabicnumber": 3541,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يُورِدُ الْمُمْرِضُ عَلَى الْمُصِحِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3542,
			"arabicnumber": 3542,
			"text": "حَدَّثَنَا أَبُو بَكْرٍ، وَمُجَاهِدُ بْنُ مُوسَى، وَمُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، قَالُوا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَخَذَ بِيَدِ رَجُلٍ مَجْذُومٍ فَأَدْخَلَهَا مَعَهُ فِي الْقَصْعَةِ ثُمَّ قَالَ ‏ \"‏ كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلاً عَلَى اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3543,
			"arabicnumber": 3543,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، عَنِ ابْنِ أَبِي الزِّنَادِ، ح وَحَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُمِّهِ، فَاطِمَةَ بِنْتِ الْحُسَيْنِ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ تُدِيمُوا النَّظَرَ إِلَى الْمَجْذُومِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3544,
			"arabicnumber": 3544,
			"text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ رَجُلٍ، مِنْ آلِ الشَّرِيدِ يُقَالُ لَهُ عَمْرٌو عَنْ أَبِيهِ قَالَ كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ ارْجِعْ فَقَدْ بَايَعْنَاكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3545,
			"arabicnumber": 3545,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَحَرَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَهُودِيٌّ مِنْ يَهُودِ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الأَعْصَمِ حَتَّى كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَلاَ يَفْعَلُهُ ‏.‏ قَالَتْ حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ كَانَ ذَاتَ لَيْلَةٍ دَعَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ دَعَا ثُمَّ دَعَا ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ أَشَعَرْتِ أَنَّ اللَّهَ قَدْ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ جَاءَنِي رَجُلاَنِ فَجَلَسَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالآخَرُ عِنْدَ رِجْلِي فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلَّذِي عِنْدَ رِجْلِي أَوِ الَّذِي عِنْدَ رِجْلِي لِلَّذِي عِنْدَ رَأْسِي مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ ‏.‏ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ ‏.‏ قَالَ فِي أَىِّ شَىْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ وَجُفِّ طَلْعَةِ ذَكَرٍ ‏.‏ قَالَ وَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذِي أَرْوَانَ ‏\"‏ ‏.‏ قَالَتْ فَأَتَاهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ فِي أُنَاسٍ مِنْ أَصْحَابِهِ ثُمَّ جَاءَ فَقَالَ ‏\"‏ وَاللَّهِ يَا عَائِشَةُ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ أَحْرَقْتَهُ قَالَ ‏\"‏ لاَ أَمَّا أَنَا فَقَدْ عَافَانِيَ اللَّهُ وَكَرِهْتُ أَنْ أُثِيرَ عَلَى النَّاسِ مِنْهُ شَرًّا ‏\"‏ ‏.‏ فَأَمَرَ بِهَا فَدُفِنَتْ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3546,
			"arabicnumber": 3546,
			"text": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا أَبُو بَكْرٍ الْعَنْسِيُّ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، وَمُحَمَّدِ بْنِ يَزِيدَ الْمِصْرِيَّيْنِ، قَالاَ حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ لاَ يَزَالُ يُصِيبُكَ كُلَّ عَامٍ وَجَعٌ مِنَ الشَّاةِ الْمَسْمُومَةِ الَّتِي أَكَلْتَ ‏.‏ قَالَ ‏ \"‏ مَا أَصَابَنِي شَىْءٌ مِنْهَا إِلاَّ وَهُوَ مَكْتُوبٌ عَلَىَّ وَآدَمُ فِي طِينَتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3547,
			"arabicnumber": 3547,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلاَنَ، عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ مَالِكٍ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا نَزَلَ مَنْزِلاً قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ - لَمْ يَضُرَّهُ فِي ذَلِكَ الْمَنْزِلِ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3548,
			"arabicnumber": 3548,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنِي عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبِي، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، قَالَ لَمَّا اسْتَعْمَلَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى الطَّائِفِ جَعَلَ يَعْرِضُ لِي شَىْءٌ فِي صَلاَتِي حَتَّى مَا أَدْرِي مَا أُصَلِّي فَلَمَّا رَأَيْتُ ذَلِكَ رَحَلْتُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ ابْنُ أَبِي الْعَاصِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ مَا جَاءَ بِكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ عَرَضَ لِي شَىْءٌ فِي صَلاَتِي حَتَّى مَا أَدْرِي مَا أُصَلِّي ‏.‏ قَالَ ‏\"‏ ذَاكَ الشَّيْطَانُ ادْنُهْ ‏\"‏ ‏.‏ فَدَنَوْتُ مِنْهُ فَجَلَسْتُ عَلَى صُدُورِ قَدَمَىَّ ‏.‏ قَالَ فَضَرَبَ صَدْرِي بِيَدِهِ وَتَفَلَ فِي فَمِي وَقَالَ ‏\"‏ اخْرُجْ عَدُوَّ اللَّهِ ‏\"‏ ‏.‏ فَفَعَلَ ذَلِكَ ثَلاَثَ مَرَّاتٍ ثُمَّ قَالَ ‏\"‏ الْحَقْ بِعَمَلِكَ ‏\"‏ ‏.‏ قَالَ فَقَالَ عُثْمَانُ فَلَعَمْرِي مَا أَحْسِبُهُ خَالَطَنِي بَعْدُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3549,
			"arabicnumber": 3549,
			"text": "حَدَّثَنَا هَارُونُ بْنُ حَيَّانَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو جَنَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِيهِ أَبِي لَيْلَى، قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ إِذْ جَاءَهُ أَعْرَابِيٌّ فَقَالَ إِنَّ لِي أَخًا وَجِعًا ‏.‏ قَالَ ‏\"‏ مَا وَجَعُ أَخِيكَ ‏\"‏ ‏.‏ قَالَ بِهِ لَمَمٌ ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَأْتِنِي بِهِ ‏\"‏ ‏.‏ قَالَ فَذَهَبَ فَجَاءَ بِهِ فَأَجْلَسَهُ بَيْنَ يَدَيْهِ فَسَمِعْتُهُ عَوَّذَهُ بِفَاتِحَةِ الْكِتَابِ وَأَرْبَعِ آيَاتٍ مِنْ أَوَّلِ الْبَقَرَةِ وَآيَتَيْنِ مِنْ وَسَطِهَا وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ وَآيَةِ الْكُرْسِيِّ وَثَلاَثِ آيَاتٍ مِنْ خَاتِمَتِهَا وَآيَةٍ مِنْ آلِ عِمْرَانَ - أَحْسِبُهُ قَالَ ‏{شَهِدَ اللَّهُ أَنَّهُ لاَ إِلَهَ إِلاَّ هُوَ}‏ - وَآيَةٍ مِنَ الأَعْرَافِ ‏{إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ}‏ الآيَةَ وَآيَةٍ مِنَ الْمُؤْمِنِينَ ‏{وَمَنْ يَدْعُ مَعَ اللَّهِ إِلهًا آخَرَ لاَ بُرْهَانَ لَهُ بِهِ }‏ وَآيَةٍ مِنَ الْجِنِّ ‏{وَأَنَّهُ تَعَالَى جَدُّ رِبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلاَ وَلَدًا}‏ وَعَشْرِ آيَاتٍ مِنْ أَوَّلِ الصَّافَّاتِ وَثَلاَثِ آيَاتٍ مِنْ آخِرِ الْحَشْرِ وَ ‏{قُلْ هُوَ اللَّهُ أَحَدٌ }‏ وَالْمُعَوِّذَتَيْنِ ‏.‏ فَقَامَ الأَعْرَابِيُّ قَدْ بَرَأَ لَيْسَ بِهِ بَأْسٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 114
			}
		}
	]
}