{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَحَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوا لاَ إِلَهَ إِلاَّ اللَّهُ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، أَنَّ عَمْرَو بْنَ أَوْسٍ، أَخْبَرَهُ أَنَّ أَبَاهُ أَوْسًا أَخْبَرَهُ قَالَ إِنَّا لَقُعُودٌ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَهُوَ يَقُصُّ عَلَيْنَا وَيُذَكِّرُنَا إِذْ أَتَاهُ رَجُلٌ فَسَارَّهُ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ اذْهَبُوا بِهِ فَاقْتُلُوهُ ‏\"‏ ‏.‏ فَلَمَّا وَلَّى الرَّجُلُ دَعَاهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ هَلْ تَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ قَالَ ‏\"‏ اذْهَبُوا فَخَلُّوا سَبِيلَهُ فَإِنَّمَا أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا فَعَلُوا ذَلِكَ حَرُمَ عَلَىَّ دِمَاؤُهُمْ وَأَمْوَالُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، عَنِ السُّمَيْطِ بْنِ السُّمَيْرِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ أَتَى نَافِعُ بْنُ الأَزْرَقِ وَأَصْحَابُهُ فَقَالُوا هَلَكْتَ يَا عِمْرَانُ ‏.‏ قَالَ مَا هَلَكْتُ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ مَا الَّذِي أَهْلَكَنِي قَالُوا قَالَ اللَّهُ ‏{وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ}‏ ‏.‏ قَالَ قَدْ قَاتَلْنَاهُمْ حَتَّى نَفَيْنَاهُمْ فَكَانَ الدِّينُ كُلُّهُ لِلَّهِ إِنْ شِئْتُمْ حَدَّثْتُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالُوا وَأَنْتَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ نَعَمْ شَهِدْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَقَدْ بَعَثَ جَيْشًا مِنَ الْمُسْلِمِينَ إِلَى الْمُشْرِكِينَ فَلَمَّا لَقُوهُمْ قَاتَلُوهُمْ قِتَالاً شَدِيدًا فَمَنَحُوهُمْ أَكْتَافَهُمْ فَحَمَلَ رَجُلٌ مِنْ لُحْمَتِي عَلَى رَجُلٍ مِنَ الْمُشْرِكِينَ بِالرُّمْحِ فَلَمَّا غَشِيَهُ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ إِنِّي مُسْلِمٌ فَطَعَنَهُ فَقَتَلَهُ فَأَتَى رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكْتُ قَالَ ‏\"‏ وَمَا الَّذِي صَنَعْتَ ‏\"‏ ‏.‏ مَرَّةً أَوْ مَرَّتَيْنِ فَأَخْبَرَهُ بِالَّذِي صَنَعَ فَقَالَ لَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ فَهَلاَّ شَقَقْتَ عَنْ بَطْنِهِ فَعَلِمْتَ مَا فِي قَلْبِهِ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ شَقَقْتُ بَطْنَهُ أَكُنْتُ أَعْلَمُ مَا فِي قَلْبِهِ قَالَ ‏\"‏ فَلاَ أَنْتَ قَبِلْتَ مَا تَكَلَّمَ بِهِ وَلاَ أَنْتَ تَعْلَمُ مَا فِي قَلْبِهِ ‏\"‏ ‏.‏ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَلَمْ يَلْبَثْ إِلاَّ يَسِيرًا حَتَّى مَاتَ فَدَفَنَّاهُ فَأَصْبَحَ عَلَى ظَهْرِ الأَرْضِ فَقَالُوا لَعَلَّ عَدُوًّا نَبَشَهُ فَدَفَنَّاهُ ثُمَّ أَمَرْنَا غِلْمَانَنَا يَحْرُسُونَهُ فَأَصْبَحَ عَلَى ظَهْرِ الأَرْضِ فَقُلْنَا لَعَلَّ الْغِلْمَانَ نَعَسُوا فَدَفَنَّاهُ ثُمَّ حَرَسْنَاهُ بِأَنْفُسِنَا فَأَصْبَحَ عَلَى ظَهْرِ الأَرْضِ فَأَلْقَيْنَاهُ فِي بَعْضِ تِلْكَ الشِّعَابِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي حِجَّةِ الْوَدَاعِ ‏\"‏ أَلاَ إِنَّ أَحْرَمَ الأَيَّامِ يَوْمُكُمْ هَذَا أَلاَ وَإِنَّ أَحْرَمَ الشُّهُورِ شَهْرُكُمْ هَذَا أَلاَ وَإِنَّ أَحْرَمَ الْبَلَدِ بَلَدُكُمْ هَذَا أَلاَ وَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلاَ هَلْ بَلَّغْتُ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "حَدَّثَنَا أَبُو الْقَاسِمِ بْنُ أَبِي ضَمْرَةَ، نَصْرُ بْنُ مُحَمَّدِ بْنِ سُلَيْمَانَ الْحِمْصِيُّ حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَيْسٍ النَّصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَطُوفُ بِالْكَعْبَةِ وَيَقُولُ ‏ \"‏ مَا أَطْيَبَكِ وَأَطْيَبَ رِيحَكِ مَا أَعْظَمَكِ وَأَعْظَمَ حُرْمَتَكِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَحُرْمَةُ الْمُؤْمِنِ أَعْظَمُ عِنْدَ اللَّهِ حُرْمَةً مِنْكِ مَالِهِ وَدَمِهِ وَأَنْ نَظُنَّ بِهِ إِلاَّ خَيْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، وَيُونُسُ بْنُ يَحْيَى، جَمِيعًا عَنْ دَاوُدَ بْنِ قَيْسٍ، عَنْ أَبِي سَعِيدٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ كُرَيْزٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ أَبِي هَانِئٍ، عَنْ عَمْرِو بْنِ مَالِكٍ الْجَنْبِيِّ، أَنَّ فَضَالَةَ بْنَ عُبَيْدٍ، حَدَّثَهُ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ الْمُؤْمِنُ مَنْ أَمِنَهُ النَّاسُ عَلَى أَمْوَالِهِمْ وَأَنْفُسِهِمْ وَالْمُهَاجِرُ مَنْ هَجَرَ الْخَطَايَا وَالذُّنُوبَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ أَبْصَارَهُمْ حِينَ يَنْتَهِبُهَا وَهُوَ مُؤْمِنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا الْحَسَنُ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنِ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ ثَعْلَبَةَ بْنِ الْحَكَمِ، قَالَ أَصَبْنَا غَنَمًا لِلْعَدُوِّ فَانْتَهَبْنَاهَا فَنَصَبْنَا قُدُورَنَا فَمَرَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِالْقُدُورِ فَأَمَرَ بِهَا فَأُكْفِئَتْ ثُمَّ قَالَ ‏ \"‏ إِنَّ النُّهْبَةَ لاَ تَحِلُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ الأَسَدِيُّ، حَدَّثَنَا أَبُو هِلاَلٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شَرِيكٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، قَالَ سَمِعْتُ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ، يُحَدِّثُ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ فِي حِجَّةِ الْوَدَاعِ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ وَيْحَكُمْ - أَوْ وَيْلَكُمْ - لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنِ الصُّنَابِحِ الأَحْمَسِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَلاَ إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ وَإِنِّي مُكَاثِرٌ بِكُمُ الأُمَمَ فَلاَ تَقْتَتِلُنَّ بَعْدِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنْ عَبْدِ الْوَاحِدِ بْنِ أَبِي عَوْنٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ حَابِسٍ الْيَمَانِيِّ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ صَلَّى الصُّبْحَ فَهُوَ فِي ذِمَّةِ اللَّهِ فَلاَ تُخْفِرُوا اللَّهَ فِي عَهْدِهِ فَمَنْ قَتَلَهُ طَلَبَهُ اللَّهُ حَتَّى يَكُبَّهُ فِي النَّارِ عَلَى وَجْهِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا أَشْعَثُ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنْ صَلَّى الصُّبْحَ فَهُوَ فِي ذِمَّةِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا أَبُو الْمُهَزِّمِ، يَزِيدُ بْنُ سُفْيَانَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْمُؤْمِنُ أَكْرَمُ عَلَى اللَّهِ عَزَّ وَجَلَّ مِنْ بَعْضِ مَلاَئِكَتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ زِيَادِ بْنِ رِيَاحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ قَاتَلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَدْعُو إِلَى عَصَبِيَّةٍ أَوْ يَغْضَبُ لِعَصَبِيَّةٍ فَقِتْلَتُهُ جَاهِلِيَّةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": 3949,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ الْيُحْمِدِيُّ، عَنْ عَبَّادِ بْنِ كَثِيرٍ الشَّامِيِّ، عَنِ امْرَأَةٍ، مِنْهُمْ يُقَالَ لَهَا فُسَيْلَةُ قَالَتْ سَمِعْتُ أَبِي يَقُولُ، سَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ أَمِنَ الْعَصَبِيَّةِ أَنْ يُحِبَّ الرَّجُلُ قَوْمَهُ قَالَ ‏ \"‏ لاَ وَلَكِنْ مِنَ الْعَصَبِيَّةِ أَنْ يُعِينَ الرَّجُلُ قَوْمَهُ عَلَى الظُّلْمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا مُعَانُ بْنُ رِفَاعَةَ السَّلاَمِيُّ، حَدَّثَنِي أَبُو خَلَفٍ الأَعْمَى، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِنَّ أُمَّتِي لَنْ تَجْتَمِعَ عَلَى ضَلاَلَةٍ فَإِذَا رَأَيْتُمُ اخْتِلاَفًا فَعَلَيْكُمْ بِالسَّوَادِ الأَعْظَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": 3951,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ رَجَاءٍ الأَنْصَارِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمًا صَلاَةً فَأَطَالَ فِيهَا فَلَمَّا انْصَرَفَ قُلْنَا - أَوْ قَالُوا - يَا رَسُولَ اللَّهِ أَطَلْتَ الْيَوْمَ الصَّلاَةَ قَالَ ‏ \"‏ إِنِّي صَلَّيْتُ صَلاَةَ رَغْبَةٍ وَرَهْبَةٍ سَأَلْتُ اللَّهَ عَزَّ وَجَلَّ لأُمَّتِي ثَلاَثًا فَأَعْطَانِي اثْنَتَيْنِ وَرَدَّ عَلَىَّ وَاحِدَةً سَأَلْتُهُ أَنْ لاَ يُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لاَ يُهْلِكَهُمْ غَرَقًا فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لاَ يَجْعَلَ بَأْسَهُمْ بَيْنَهُمْ فَرَدَّهَا عَلَىَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ، عَنْ قَتَادَةَ، أَنَّهُ حَدَّثَهُمْ عَنْ أَبِي قِلاَبَةَ الْجَرْمِيِّ عَبْدِ اللَّهِ بْنِ زَيْدٍ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ زُوِيَتْ لِيَ الأَرْضُ حَتَّى رَأَيْتُ مَشَارِقَهَا وَمَغَارِبَهَا وَأُعْطِيتُ الْكَنْزَيْنِ الأَصْفَرَ - أَوِ الأَحْمَرَ - وَالأَبْيَضَ - يَعْنِي الذَّهَبَ وَالْفِضَّةَ - وَقِيلَ لِي إِنَّ مُلْكَكَ إِلَى حَيْثُ زُوِيَ لَكَ وَإِنِّي سَأَلْتُ اللَّهَ عَزَّ وَجَلَّ ثَلاَثًا أَنْ لاَ يُسَلِّطَ عَلَى أُمَّتِي جُوعًا فَيُهْلِكَهُمْ بِهِ عَامَّةً وَأَنْ لاَ يَلْبِسَهُمْ شِيَعًا وَيُذِيقَ بَعْضَهُمْ بَأْسَ بَعْضٍ وَإِنَّهُ قِيلَ لِي إِذَا قَضَيْتُ قَضَاءً فَلاَ مَرَدَّ لَهُ وَإِنِّي لَنْ أُسَلِّطَ عَلَى أُمَّتِكَ جُوعًا فَيُهْلِكَهُمْ فِيهِ وَلَنْ أَجْمَعَ عَلَيْهِمْ مَنْ بَيْنَ أَقْطَارِهَا حَتَّى يُفْنِيَ بَعْضُهُمْ بَعْضًا وَيَقْتُلَ بَعْضُهُمْ بَعْضًا ‏.‏ وَإِذَا وُضِعَ السَّيْفُ فِي أُمَّتِي فَلَنْ يُرْفَعَ عَنْهُمْ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّ مِمَّا أَتَخَوَّفُ عَلَى أُمَّتِي أَئِمَّةً مُضِلِّينَ وَسَتَعْبُدُ قَبَائِلُ مِنْ أُمَّتِي الأَوْثَانَ وَسَتَلْحَقُ قَبَائِلُ مِنْ أُمَّتِي بِالْمُشْرِكِيِنَ وَإِنَّ بَيْنَ يَدَىِ السَّاعَةِ دَجَّالِينَ كَذَّابِينَ قَرِيبًا مِنْ ثَلاَثِينَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيٌّ وَلَنْ تَزَالَ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ مَنْصُورِينَ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ لَمَّا فَرَغَ أَبُو عَبْدِ اللَّهِ مِنْ هَذَا الْحَدِيثِ قَالَ مَا أَهْوَلَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ حَبِيبَةَ، عَنْ أُمِّ حَبِيبَةَ، عَنْ زَيْنَبَ بِنْتِ جَحْشٍ، أَنَّهَا قَالَتِ اسْتَيْقَظَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ نَوْمِهِ وَهُوَ مُحْمَرٌّ وَجْهُهُ وَهُوَ يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ ‏\"‏ ‏.‏ وَعَقَدَ بِيَدَيْهِ عَشَرَةً ‏.‏ قَالَتْ زَيْنَبُ قُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ ‏\"‏ إِذَا كَثُرَ الْخَبَثُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": 3954,
			"text": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْوَلِيدِ بْنِ سُلَيْمَانَ بْنِ أَبِي السَّائِبِ، عَنْ عَلِيِّ بْنِ يَزِيدَ، عَنِ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سَتَكُونُ فِتَنٌ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا إِلاَّ مَنْ أَحْيَاهُ اللَّهُ بِالْعِلْمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَأَبِي، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ كُنَّا جُلُوسًا عِنْدَ عُمَرَ فَقَالَ أَيُّكُمْ يَحْفَظُ حَدِيثَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْفِتْنَةِ قَالَ حُذَيْفَةُ فَقُلْتُ أَنَا ‏.‏ قَالَ إِنَّكَ لَجَرِيءٌ قَالَ كَيْفَ قَالَ سَمِعْتُهُ يَقُولُ ‏ \"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَوَلَدِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصِّيَامُ وَالصَّدَقَةُ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ لَيْسَ هَذَا أُرِيدُ إِنَّمَا أُرِيدُ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ ‏.‏ فَقَالَ مَالَكَ وَلَهَا يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا ‏.‏ قَالَ فَيُكْسَرُ الْبَابُ أَوْ يُفْتَحُ قَالَ لاَ بَلْ يُكْسَرُ ‏.‏ قَالَ ذَاكَ أَجْدَرُ أَنْ لاَ يُغْلَقَ ‏.‏ قُلْنَا لِحُذَيْفَةَ أَكَانَ عُمَرُ يَعْلَمُ مَنِ الْبَابُ قَالَ نَعَمْ كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ اللَّيْلَةَ إِنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالأَغَالِيطِ ‏.‏ فَهِبْنَا أَنْ نَسْأَلَهُ مَنِ الْبَابُ فَقُلْنَا لِمَسْرُوقٍ سَلْهُ فَسَأَلَهُ فَقَالَ عُمَرُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَعَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ رَبِّ الْكَعْبَةِ، قَالَ انْتَهَيْتُ إِلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ وَالنَّاسُ مُجْتَمِعُونَ عَلَيْهِ فَسَمِعْتُهُ يَقُولُ بَيْنَا نَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي سَفَرٍ إِذْ نَزَلَ مَنْزِلاً فَمِنَّا مَنْ يَضْرِبُ خِبَاءَهُ وَمِنَّا مَنْ يَنْتَضِلُ وَمِنَّا مَنْ هُوَ فِي جَشَرِهِ إِذْ نَادَى مُنَادِيهِ الصَّلاَةُ جَامِعَةٌ فَاجْتَمَعْنَا فَقَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَخَطَبَنَا فَقَالَ ‏ \"‏ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ قَبْلِي إِلاَّ كَانَ حَقًّا عَلَيْهِ أَنْ يَدُلَّ أُمَّتَهُ عَلَى مَا يَعْلَمُهُ خَيْرًا لَهُمْ وَيُنْذِرَهُمْ مَا يَعْلَمُهُ شَرًّا لَهُمْ وَإِنَّ أُمَّتَكُمْ هَذِهِ جُعِلَتْ عَافِيَتُهَا فِي أَوَّلِهَا وَإِنَّ آخِرَهُمْ يُصِيبُهُمْ بَلاَءٌ وَأُمُورٌ تُنْكِرُونَهَا ثُمَّ تَجِيءُ فِتَنٌ يُرَقِّقُ بَعْضُهَا بَعْضًا فَيَقُولُ الْمُؤْمِنُ هَذِهِ مُهْلِكَتِي ثُمَّ تَنْكَشِفُ ثُمَّ تَجِيءُ فِتْنَةٌ فَيَقُولُ الْمُؤْمِنُ هَذِهِ مُهْلِكَتِي ‏.‏ ثُمَّ تَنْكَشِفُ فَمَنْ سَرَّهُ أَنْ يُزَحْزَحَ عَنِ النَّارِ وَيُدْخَلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَوْتَتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَلْيَأْتِ إِلَى النَّاسِ الَّذِي يُحِبُّ أَنْ يَأْتُوا إِلَيْهِ وَمَنْ بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَمِينِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ مَا اسْتَطَاعَ فَإِنْ جَاءَ آخَرُ يُنَازِعُهُ فَاضْرِبُوا عُنُقَ الآخَرِ ‏\"‏ ‏.‏ قَالَ فَأَدْخَلْتُ رَأْسِي مِنْ بَيْنِ النَّاسِ فَقُلْتُ أَنْشُدُكَ اللَّهَ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ فَأَشَارَ بِيَدِهِ إِلَى أُذُنَيْهِ فَقَالَ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3957,
			"arabicnumber": 3957,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ عُمَارَةَ بْنِ حَزْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ كَيْفَ بِكُمْ وَبِزَمَانٍ يُوشِكُ أَنْ يَأْتِيَ يُغَرْبَلُ النَّاسُ فِيهِ غَرْبَلَةً وَتَبْقَى حُثَالَةٌ مِنَ النَّاسِ قَدْ مَرِجَتْ عُهُودُهُمْ وَأَمَانَاتُهُمْ فَاخْتَلَفُوا وَكَانُوا هَكَذَا ‏\"‏ ‏.‏ وَشَبَّكَ بَيْنَ أَصَابِعِهِ قَالُوا كَيْفَ بِنَا يَا رَسُولَ اللَّهِ إِذَا كَانَ ذَلِكَ قَالَ ‏\"‏ تَأْخُذُونَ بِمَا تَعْرِفُونَ وَتَدَعُونَ مَا تُنْكِرُونَ وَتُقْبِلُونَ عَلَى خَاصَّتِكُمْ وَتَذَرُونَ أَمْرَ عَوَامِّكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنِ الْمُشَعَّثِ بْنِ طَرِيفٍ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كَيْفَ أَنْتَ يَا أَبَا ذَرٍّ وَمَوْتًا يُصِيبُ النَّاسَ حَتَّى يُقَوَّمَ الْبَيْتُ بِالْوَصِيفِ ‏\"‏ ‏.‏ يَعْنِي الْقَبْرَ قُلْتُ مَا خَارَ اللَّهُ لِي وَرَسُولُهُ - أَوْ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ - قَالَ ‏\"‏ تَصَبَّرْ ‏\"‏ ‏.‏ قَالَ ‏\"‏ كَيْفَ أَنْتَ وَجُوعًا يُصِيبُ النَّاسَ حَتَّى تَأْتِيَ مَسْجِدَكَ فَلاَ تَسْتَطِيعَ أَنْ تَرْجِعَ إِلَى فِرَاشِكَ وَلاَ تَسْتَطِيعَ أَنْ تَقُومَ مِنْ فِرَاشِكَ إِلَى مَسْجِدِكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ أَوْ - مَا خَارَ اللَّهُ لِي وَرَسُولُهُ - قَالَ ‏\"‏ عَلَيْكَ بِالْعِفَّةِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ كَيْفَ أَنْتَ وَقَتْلاً يُصِيبُ النَّاسَ حَتَّى تُغْرَقَ حِجَارَةُ الزَّيْتِ بِالدَّمِ ‏\"‏ ‏.‏ قُلْتُ مَا خَارَ اللَّهُ لِي وَرَسُولُهُ ‏.‏ قَالَ ‏\"‏ الْحَقْ بِمَنْ أَنْتَ مِنْهُ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ آخُذُ بِسَيْفِي فَأَضْرِبَ بِهِ مَنْ فَعَلَ ذَلِكَ قَالَ ‏\"‏ شَارَكْتَ الْقَوْمَ إِذًا وَلَكِنِ ادْخُلْ بَيْتَكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ فَإِنْ دُخِلَ بَيْتِي قَالَ ‏\"‏ إِنْ خَشِيتَ أَنْ يَبْهَرَكَ شُعَاعُ السَّيْفِ فَأَلْقِ طَرَفَ رِدَائِكَ عَلَى وَجْهِكَ فَيَبُوءَ بِإِثْمِهِ وَإِثْمِكَ فَيَكُونَ مِنْ أَصْحَابِ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3959,
			"arabicnumber": 3959,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، حَدَّثَنَا أَسِيدُ بْنُ الْمُتَشَمِّسِ، قَالَ حَدَّثَنَا أَبُو مُوسَى، حَدَّثَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ بَيْنَ يَدَىِ السَّاعَةِ لَهَرْجًا ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا الْهَرْجُ قَالَ ‏\"‏ الْقَتْلُ ‏\"‏ ‏.‏ فَقَالَ بَعْضُ الْمُسْلِمِينَ يَا رَسُولَ اللَّهِ إِنَّا نَقْتُلُ الآنَ فِي الْعَامِ الْوَاحِدِ مِنَ الْمُشْرِكِينَ كَذَا وَكَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَيْسَ بِقَتْلِ الْمُشْرِكِينَ وَلَكِنْ يَقْتُلُ بَعْضُكُمْ بَعْضًا حَتَّى يَقْتُلَ الرَّجُلُ جَارَهُ وَابْنَ عَمِّهِ وَذَا قَرَابَتِهِ ‏\"‏ ‏.‏ فَقَالَ بَعْضُ الْقَوْمِ يَا رَسُولَ اللَّهِ وَمَعَنَا عُقُولُنَا ذَلِكَ الْيَوْمَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تُنْزَعُ عُقُولُ أَكْثَرِ ذَلِكَ الزَّمَانِ وَيَخْلُفُ لَهُ هَبَاءٌ مِنَ النَّاسِ لاَ عُقُولَ لَهُمْ ‏\"‏ ‏.‏ ثُمَّ قَالَ الأَشْعَرِيُّ وَايْمُ اللَّهِ إِنِّي لأَظُنُّهَا مُدْرِكَتِي وَإِيَّاكُمْ وَايْمُ اللَّهِ مَا لِي وَلَكُمْ مِنْهَا مَخْرَجٌ إِنْ أَدْرَكَتْنَا فِيمَا عَهِدَ إِلَيْنَا نَبِيُّنَا ـ صلى الله عليه وسلم ـ إِلاَّ أَنْ نَخْرُجَ كَمَا دَخَلْنَا فِيهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3960,
			"arabicnumber": 3960,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُبَيْدٍ، مُؤَذِّنُ مَسْجِدِ جُرْدَانَ قَالَ حَدَّثَتْنِي عُدَيْسَةُ بِنْتُ أُهْبَانَ، قَالَتْ لَمَّا جَاءَ عَلِيُّ بْنُ أَبِي طَالِبٍ هَاهُنَا الْبَصْرَةَ دَخَلَ عَلَى أَبِي فَقَالَ يَا أَبَا مُسْلِمٍ أَلاَ تُعِينُنِي عَلَى هَؤُلاَءِ الْقَوْمِ قَالَ بَلَى ‏.‏ قَالَ فَدَعَا جَارِيَةً لَهُ فَقَالَ يَا جَارِيَةُ أَخْرِجِي سَيْفِي ‏.‏ قَالَ فَأَخْرَجَتْهُ فَسَلَّ مِنْهُ قَدْرَ شِبْرٍ فَإِذَا هُوَ خَشَبٌ فَقَالَ إِنَّ خَلِيلِي وَابْنَ عَمِّكَ ـ صلى الله عليه وسلم ـ عَهِدَ إِلَىَّ إِذَا كَانَتِ الْفِتْنَةُ بَيْنَ الْمُسْلِمِينَ فَأَتَّخِذُ سَيْفًا مِنْ خَشَبٍ فَإِنْ شِئْتَ خَرَجْتُ مَعَكَ ‏.‏ قَالَ لاَ حَاجَةَ لِي فِيكَ وَلاَ فِي سَيْفِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3961,
			"arabicnumber": 3961,
			"text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ ثَرْوَانَ، عَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ بَيْنَ يَدَىِ السَّاعَةِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنَ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي فَكَسِّرُوا قِسِيَّكُمْ وَقَطِّعُوا أَوْتَارَكُمْ وَاضْرِبُوا بِسُيُوفِكُمُ الْحِجَارَةَ فَإِنْ دُخِلَ عَلَى أَحَدٍ مِنْكُمْ فَلْيَكُنْ كَخَيْرِ ابْنَىْ آدَمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3962,
			"arabicnumber": 3962,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ، - أَوْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ شَكَّ أَبُو بَكْرٍ - عَنْ أَبِي بُرْدَةَ، قَالَ دَخَلْتُ عَلَى مُحَمَّدِ بْنِ مَسْلَمَةَ فَقَالَ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّهَا سَتَكُونُ فِتْنَةٌ وَفُرْقَةٌ وَاخْتِلاَفٌ فَإِذَا كَانَ كَذَلِكَ فَأْتِ بِسَيْفِكَ أُحُدًا فَاضْرِبْهُ حَتَّى يَنْقَطِعَ ثُمَّ اجْلِسْ فِي بَيْتِكَ حَتَّى تَأْتِيَكَ يَدٌ خَاطِئَةٌ أَوْ مَنِيَّةٌ قَاضِيَةٌ ‏\"‏ ‏.‏ فَقَدْ وَقَعَتْ وَفَعَلْتُ مَا قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": 3963,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُبَارَكُ بْنُ سُحَيْمٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَا مِنْ مُسْلِمَيْنِ الْتَقَيَا بِأَسْيَافِهِمَا إِلاَّ كَانَ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": 3964,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، وَسَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ أَرَادَ قَتْلَ صَاحِبِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": 3965,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا الْمُسْلِمَانِ حَمَلَ أَحَدُهُمَا عَلَى أَخِيهِ السِّلاَحَ فَهُمَا عَلَى جُرُفِ جَهَنَّمَ فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ دَخَلاَهَا جَمِيعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": 3966,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَبْدِ الْحَكَمِ السَّدُوسِيِّ، حَدَّثَنَا شَهْرُ بْنُ حَوْشَبٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مِنْ شَرِّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ عَبْدٌ أَذْهَبَ آخِرَتَهُ بِدُنْيَا غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": 3967,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ لَيْثٍ، عَنْ طَاوُسٍ، عَنْ زِيَادٍ، سِيمِينْ كُوشْ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلاَهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": 3968,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِيَّاكُمْ وَالْفِتَنَ فَإِنَّ اللِّسَانَ فِيهَا مِثْلُ وَقْعِ السَّيْفِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": 3969,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، عَلْقَمَةَ بْنِ وَقَّاصٍ قَالَ مَرَّ بِهِ رَجُلٌ لَهُ شَرَفٌ فَقَالَ لَهُ عَلْقَمَةُ إِنَّ لَكَ رَحِمًا وَإِنَّ لَكَ حَقًّا وَإِنِّي رَأَيْتُكَ تَدْخُلُ عَلَى هَؤُلاَءِ الأُمَرَاءِ وَتَتَكَلَّمُ عِنْدَهُمْ بِمَا شَاءَ اللَّهُ أَنْ تَتَكَلَّمَ بِهِ وَإِنِّي سَمِعْتُ بِلاَلَ بْنَ الْحَارِثِ الْمُزَنِيَّ صَاحِبَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ أَحَدَكُمْ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ فَيَكْتُبُ اللَّهُ عَزَّ وَجَلَّ لَهُ بِهَا رِضْوَانَهُ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّ أَحَدَكُمْ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ فَيَكْتُبُ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِ بِهَا سَخَطَهُ إِلَى يَوْمِ يَلْقَاهُ ‏\"‏ ‏.‏ قَالَ عَلْقَمَةُ فَانْظُرْ وَيْحَكَ مَاذَا تَقُولُ وَمَاذَا تَكَلَّمُ بِهِ فَرُبَّ كَلاَمٍ - قَدْ - مَنَعَنِي أَنْ أَتَكَلَّمَ بِهِ مَا سَمِعْتُ مِنْ بِلاَلِ بْنِ الْحَارِثِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": 3970,
			"text": "حَدَّثَنَا أَبُو يُوسُفَ الصَّيْدَلاَنِيُّ، مُحَمَّدُ بْنُ أَحْمَدَ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ ابْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ لاَ يَرَى بِهَا بَأْسًا فَيَهْوِي بِهَا فِي نَارِ جَهَنَّمَ سَبْعِينَ خَرِيفًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": 3971,
			"text": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": 3972,
			"text": "حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَاعِزٍ الْعَامِرِيِّ، أَنَّ سُفْيَانَ بْنَ عَبْدِ اللَّهِ الثَّقَفِيَّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِأَمْرٍ أَعْتَصِمُ بِهِ ‏.‏ قَالَ ‏\"‏ قُلْ رَبِّيَ اللَّهُ ثُمَّ اسْتَقِمْ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَكْثَرُ مَا تَخَافُ عَلَىَّ فَأَخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِلِسَانِ نَفْسِهِ ثُمَّ قَالَ ‏\"‏ هَذَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": 3973,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاذٍ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ، عَنْ أَبِي وَائِلٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي سَفَرٍ فَأَصْبَحْتُ يَوْمًا قَرِيبًا مِنْهُ وَنَحْنُ نَسِيرُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدُنِي مِنَ النَّارِ ‏.‏ قَالَ ‏\"‏ لَقَدْ سَأَلْتَ عَظِيمًا وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ تَعْبُدُ اللَّهَ لاَ تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلاَةَ وَتُؤْتِي الزَّكَاةَ وَتَصُومُ رَمَضَانَ وَتَحُجُّ الْبَيْتَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَلاَ أُدُلُّكَ عَلَى أَبْوَابِ الْجَنَّةِ الصَّوْمُ جُنَّةٌ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ النَّارَ الْمَاءُ وَصَلاَةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ‏}‏ حَتَّى بَلَغَ ‏{جَزَاءً بِمَا كَانُوا يَعْمَلُونَ}‏ ثُمَّ قَالَ ‏\"‏ أَلاَ أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ الْجِهَادُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَلاَ أُخْبِرُكَ بِمِلاَكِ ذَلِكَ كُلِّهِ ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏ فَأَخَذَ بِلِسَانِهِ فَقَالَ ‏\"‏ تَكُفُّ عَلَيْكَ هَذَا ‏\"‏ ‏.‏ قُلْتُ يَا نَبِيَّ اللَّهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ قَالَ ‏\"‏ ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ وَهَلْ يَكُبُّ النَّاسَ عَلَى وُجُوهِهِمْ فِي النَّارِ إِلاَّ حَصَائِدُ أَلْسِنَتِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": 3974,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ الْمَكِّيُّ، قَالَ سَمِعْتُ سَعِيدَ بْنَ حَسَّانَ الْمَخْزُومِيَّ، قَالَ حَدَّثَتْنِي أُمُّ صَالِحٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ أُمِّ حَبِيبَةَ، زَوْجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ كَلاَمُ ابْنِ آدَمَ عَلَيْهِ لاَ لَهُ إِلاَّ الأَمْرَ بِالْمَعْرُوفِ وَالنَّهْىَ عَنِ الْمُنْكَرِ وَذِكْرَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": 3975,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا خَالِي، يَعْلَى عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي الشَّعْثَاءِ، قَالَ قِيلَ لاِبْنِ عُمَرَ إِنَّا نَدْخُلُ عَلَى أُمَرَائِنَا فَنَقُولُ الْقَوْلَ فَإِذَا خَرَجْنَا قُلْنَا غَيْرَهُ ‏.‏ قَالَ كُنَّا نَعُدُّ ذَلِكَ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ النِّفَاقَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": 3976,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَيْوَئِيلَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مِنْ حُسْنِ إِسْلاَمِ الْمَرْءِ تَرْكُهُ مَا لاَ يَعْنِيهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": 3977,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، أَخْبَرَنِي أَبِي، عَنْ بَعْجَةَ بْنِ عَبْدِ اللَّهِ بْنِ بَدْرٍ الْجُهَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ خَيْرُ مَعَايِشِ النَّاسِ لَهُمْ رَجُلٌ مُمْسِكٌ بِعِنَانِ فَرَسِهِ فِي سَبِيلِ اللَّهِ وَيَطِيرُ عَلَى مَتْنِهِ كُلَّمَا سَمِعَ هَيْعَةً أَوْ فَزْعَةً طَارَ عَلَيْهِ إِلَيْهَا يَبْتَغِي الْمَوْتَ أَوِ الْقَتْلَ مَظَانَّهُ وَرَجُلٌ فِي غُنَيْمَةٍ فِي رَأْسِ شَعَفَةٍ مِنْ هَذِهِ الشِّعَافِ أَوْ بَطْنِ وَادٍ مِنْ هَذِهِ الأَوْدِيَةِ يُقِيمُ الصَّلاَةَ وَيُؤْتِي الزَّكَاةَ وَيَعْبُدُ رَبَّهُ حَتَّى يَأْتِيَهُ الْيَقِينُ لَيْسَ مِنَ النَّاسِ إِلاَّ فِي خَيْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": 3978,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا الزُّبَيْدِيُّ، حَدَّثَنِي الزُّهْرِيُّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ أَىُّ النَّاسِ أَفْضَلُ قَالَ ‏\"‏ رَجُلٌ مُجَاهِدٌ فِي سَبِيلِ اللَّهِ بِنَفْسِهِ وَمَالِهِ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ امْرُؤٌ فِي شِعْبٍ مِنَ الشِّعَابِ يَعْبُدُ اللَّهَ عَزَّ وَجَلَّ وَيَدَعُ النَّاسَ مِنْ شَرِّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": 3979,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، أَنَّهُ سَمِعَ حُذَيْفَةَ بْنَ الْيَمَانِ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَكُونُ دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا قَالَ ‏\"‏ هُمْ قَوْمٌ مِنْ جِلْدَتِنَا يَتَكَلَّمُونَ بِأَلْسِنَتِنَا ‏\"‏ ‏.‏ قُلْتُ فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ قَالَ ‏\"‏ فَالْزَمْ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلاَ إِمَامٌ فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ كَذَلِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": 3980,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": 3981,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، حَدَّثَنَا أَبُو عَامِرٍ الْخَزَّازُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ قُرْطٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَكُونُ فِتَنٌ عَلَى أَبْوَابِهَا دُعَاةٌ إِلَى النَّارِ فَأَنْ تَمُوتَ وَأَنْتَ عَاضٌّ عَلَى جِذْلِ شَجَرَةٍ خَيْرٌ لَكَ مِنْ أَنْ تَتْبَعَ أَحَدًا مِنْهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": 3982,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيُّ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": 3984,
			"text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ عَلَى الْمِنْبَرِ وَأَهْوَى بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشْتَبِهَاتٌ لاَ يَعْلَمُهَا كَثِيرٌ مِنَ النَّاسِ فَمَنِ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ كَالرَّاعِي حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلاَ وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلُحَتْ صَلُحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلاَ وَهِيَ الْقَلْبُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": 3985,
			"text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنِ الْمُعَلَّى بْنِ زِيَادٍ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ قَالَ رَسُولُ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْعِبَادَةُ فِي الْهَرْجِ كَهِجْرَةٍ إِلَىَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": 3986,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، وَسُوَيْدُ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ بَدَأَ الإِسْلاَمُ غَرِيبًا وَسَيَعُودُ غَرِيبًا فَطُوبَى لِلْغُرَبَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": 3987,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ، وَابْنُ، لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سِنَانِ بْنِ سَعْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ الإِسْلاَمَ بَدَأَ غَرِيبًا وَسَيَعُودُ غَرِيبًا فَطُوبَى لِلْغُرَبَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": 3988,
			"text": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ الإِسْلاَمَ بَدَأَ غَرِيبًا وَسَيَعُودُ غَرِيبًا فَطُوبَى لِلْغُرَبَاءِ ‏\"‏ ‏.‏ قَالَ قِيلَ وَمَنِ الْغُرَبَاءُ قَالَ النُّزَّاعُ مِنَ الْقَبَائِلِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": 3989,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، عَنْ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّهُ خَرَجَ يَوْمًا إِلَى مَسْجِدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَوَجَدَ مُعَاذَ بْنَ جَبَلٍ قَاعِدًا عِنْدَ قَبْرِ النَّبِيِّ ـ صلى الله عليه وسلم ـ يَبْكِي فَقَالَ مَا يُبْكِيكَ قَالَ يُبْكِينِي شَىْءٌ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِنَّ يَسِيرَ الرِّيَاءِ شِرْكٌ وَإِنَّ مَنْ عَادَى لِلَّهِ وَلِيًّا فَقَدْ بَارَزَ اللَّهَ بِالْمُحَارَبَةِ إِنَّ اللَّهَ يُحِبُّ الأَبْرَارَ الأَتْقِيَاءَ الأَخْفِيَاءَ الَّذِينَ إِذَا غَابُوا لَمْ يُفْتَقَدُوا وَإِنْ حَضَرُوا لَمْ يُدْعَوْا وَلَمْ يُعْرَفُوا قُلُوبُهُمْ مَصَابِيحُ الْهُدَى يَخْرُجُونَ مِنْ كُلِّ غَبْرَاءَ مُظْلِمَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": 3990,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ النَّاسُ كَإِبِلِ مِائَةٍ لاَ تَكَادُ تَجِدُ فِيهَا رَاحِلَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": 3991,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَفَرَّقَتِ الْيَهُودُ عَلَى إِحْدَى وَسَبْعِينَ فِرْقَةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلاَثٍ وَسَبْعِينَ فِرْقَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": 3992,
			"text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا عَبَّادُ بْنُ يُوسُفَ، حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو، عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ افْتَرَقَتِ الْيَهُودُ عَلَى إِحْدَى وَسَبْعِينَ فِرْقَةً فَوَاحِدَةٌ فِي الْجَنَّةِ وَسَبْعُونَ فِي النَّارِ وَافْتَرَقَتِ النَّصَارَى عَلَى ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً فَإِحْدَى وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتَفْتَرِقَنَّ أُمَّتِي عَلَى ثَلاَثٍ وَسَبْعِينَ فِرْقَةً فَوَاحِدَةٌ فِي الْجَنَّةِ وَثِنْتَانِ وَسَبْعُونَ فِي النَّارِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ مَنْ هُمْ قَالَ ‏\"‏ الْجَمَاعَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": 3993,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو عَمْرٍو، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ بَنِي إِسْرَائِيلَ افْتَرَقَتْ عَلَى إِحْدَى وَسَبْعِينَ فِرْقَةً وَإِنَّ أُمَّتِي سَتَفْتَرِقُ عَلَى ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً كُلُّهَا فِي النَّارِ إِلاَّ وَاحِدَةً وَهِيَ الْجَمَاعَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": 3994,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَتَتَّبِعُنَّ سُنَّةَ مَنْ كَانَ قَبْلَكُمْ بَاعًا بِبَاعٍ وَذِرَاعًا بِذِرَاعٍ وَشِبْرًا بِشِبْرٍ حَتَّى لَوْ دَخَلُوا فِي جُحْرِ ضَبٍّ لَدَخَلْتُمْ فِيهِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ الْيَهُودُ وَالنَّصَارَى قَالَ ‏\"‏ فَمَنْ إِذًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": 3995,
			"text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَخَطَبَ فَقَالَ ‏\"‏ لاَ وَاللَّهِ مَا أَخْشَى عَلَيْكُمْ أَيُّهَا النَّاسُ إِلاَّ مَا يُخْرِجُ اللَّهُ لَكُمْ مِنْ زَهْرَةِ الدُّنْيَا ‏\"‏ ‏.‏ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ أَيَأْتِي الْخَيْرُ بِالشَّرِّ فَصَمَتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ سَاعَةً ثُمَّ قَالَ ‏\"‏ كَيْفَ قُلْتَ ‏\"‏ ‏.‏ قَالَ قُلْتُ وَهَلْ يَأْتِي الْخَيْرُ بِالشَّرِّ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ الْخَيْرَ لاَ يَأْتِي إِلاَّ بِخَيْرٍ أَوَخَيْرٌ هُوَ إِنَّ كُلَّ مَا يُنْبِتُ الرَّبِيعُ يَقْتُلُ حَبَطًا أَوْ يُلِمُّ إِلاَّ آكِلَةَ الْخَضِرِ أَكَلَتْ حَتَّى إِذَا امْتَلأَتْ خَاصِرَتَاهَا اسْتَقْبَلَتِ الشَّمْسَ فَثَلَطَتْ وَبَالَتْ ثُمَّ اجْتَرَّتْ فَعَادَتْ فَأَكَلَتْ فَمَنْ يَأْخُذُ مَالاً بِحَقِّهِ يُبَارَكُ لَهُ وَمَنْ يَأْخُذُ مَالاً بِغَيْرِ حَقِّهِ فَمَثَلُهُ كَمَثَلِ الَّذِي يَأْكُلُ وَلاَ يَشْبَعُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": 3996,
			"text": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْمِصْرِيُّ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ أَنَّ يَزِيدَ بْنَ رَبَاحٍ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\"‏ إِذَا فُتِحَتْ عَلَيْكُمْ خَزَائِنُ فَارِسَ وَالرُّومِ أَىُّ قَوْمٍ أَنْتُمْ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ نَقُولُ كَمَا أَمَرَنَا اللَّهُ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَوْ غَيْرَ ذَلِكَ تَتَنَافَسُونَ ثُمَّ تَتَحَاسَدُونَ ثُمَّ تَتَدَابَرُونَ ثُمَّ تَتَبَاغَضُونَ أَوْ نَحْوَ ذَلِكَ ثُمَّ تَنْطَلِقُونَ فِي مَسَاكِينِ الْمُهَاجِرِينَ فَتَجْعَلُونَ بَعْضَهُمْ عَلَى رِقَابِ بَعْضٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": 3997,
			"text": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى الْمِصْرِيُّ، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏.‏ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَهُ عَنْ عَمْرِو بْنِ عَوْفٍ، - وَهُوَ حَلِيفُ بَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ - أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ إِلَى الْبَحْرَيْنِ يَأْتِي بِجِزْيَتِهَا وَكَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ هُوَ صَالَحَ أَهْلَ الْبَحْرَيْنِ وَأَمَّرَ عَلَيْهِمُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ فَقَدِمَ أَبُو عُبَيْدَةَ بِمَالٍ مِنَ الْبَحْرَيْنِ فَسَمِعَتِ الأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَوْا صَلاَةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَلَمَّا صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ انْصَرَفَ فَتَعَرَّضُوا لَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حِينَ رَآهُمْ ثُمَّ قَالَ ‏\"‏ أَظُنُّكُمْ سَمِعْتُمْ أَنَّ أَبَا عُبَيْدَةَ قَدِمَ بِشَىْءٍ مِنَ الْبَحْرَيْنِ ‏\"‏ ‏.‏ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ أَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ وَلَكِنِّي أَخْشَى عَلَيْكُمْ أَنْ تُبْسَطَ الدُّنْيَا عَلَيْكُمْ كَمَا بُسِطَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا فَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": 3998,
			"text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا أَدَعُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": 3999,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ خَارِجَةَ بْنِ مُصْعَبٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا مِنْ صَبَاحٍ إِلاَّ وَمَلَكَانِ يُنَادِيَانِ وَيْلٌ لِلرِّجَالِ مِنَ النِّسَاءِ وَوَيْلٌ لِلنِّسَاءِ مِنَ الرِّجَالِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": 4000,
			"text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَامَ خَطِيبًا فَكَانَ فِيمَا قَالَ ‏ \"‏ إِنَّ الدُّنْيَا خَضِرَةٌ حُلْوَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَنَاظِرٌ كَيْفَ تَعْمَلُونَ أَلاَ فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": 4001,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ مُوسَى بْنِ عُبَيْدَةَ، عَنْ دَاوُدَ بْنِ مُدْرِكٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ بَيْنَمَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ جَالِسٌ فِي الْمَسْجِدِ إِذْ دَخَلَتِ امْرَأَةٌ مِنْ مُزَيْنَةَ تَرْفُلُ فِي زِينَةٍ لَهَا فِي الْمَسْجِدِ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَا أَيُّهَا النَّاسُ انْهَوْا نِسَاءَكُمْ عَنْ لُبْسِ الزِّينَةِ وَالتَّبَخْتُرِ فِي الْمَسْجِدِ فَإِنَّ بَنِي إِسْرَائِيلَ لَمْ يُلْعَنُوا حَتَّى لَبِسَ نِسَاؤُهُمُ الزِّينَةَ وَتَبَخْتَرْنَ فِي الْمَسَاجِدِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": 4002,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَاصِمٍ، عَنْ مَوْلَى أَبِي رُهْمٍ، - وَاسْمُهُ عُبَيْدٌ - أَنَّ أَبَا هُرَيْرَةَ، لَقِيَ امْرَأَةً مُتَطَيِّبَةً تُرِيدُ الْمَسْجِدَ فَقَالَ يَا أَمَةَ الْجَبَّارِ أَيْنَ تُرِيدِينَ قَالَتِ الْمَسْجِدَ قَالَ وَلَهُ تَطَيَّبْتِ قَالَتْ نَعَمْ ‏.‏ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ أَيُّمَا امْرَأَةٍ تَطَيَّبَتْ ثُمَّ خَرَجَتْ إِلَى الْمَسْجِدِ لَمْ تُقْبَلْ لَهَا صَلاَةٌ حَتَّى تَغْتَسِلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": 4003,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\"‏ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَأَكْثِرْنَ مِنَ الاِسْتِغْفَارِ فَإِنِّي رَأَيْتُكُنَّ أَكْثَرَ أَهْلِ النَّارِ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ مِنْهُنَّ جَزْلَةٌ وَمَا لَنَا يَا رَسُولَ اللَّهِ أَكْثَرَ أَهْلِ النَّارِ قَالَ ‏\"‏ تُكْثِرْنَ اللَّعْنَ وَتَكْفُرْنَ الْعَشِيرَ مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَدِينٍ أَغْلَبَ لِذِي لُبٍّ مِنْكُنَّ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ وَمَا نُقْصَانُ الْعَقْلِ وَالدِّينِ قَالَ ‏\"‏ أَمَّا نُقْصَانُ الْعَقْلِ فَشَهَادَةُ امْرَأَتَيْنِ تَعْدِلُ شَهَادَةَ رَجُلٍ فَهَذَا مِنْ نُقْصَانِ الْعَقْلِ وَتَمْكُثُ اللَّيَالِيَ مَا تُصَلِّي وَتُفْطِرُ فِي رَمَضَانَ فَهَذَا مِنْ نُقْصَانِ الدِّينِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": 4004,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ عُثْمَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ مُرُوا بِالْمَعْرُوفِ وَانْهَوْا عَنِ الْمُنْكَرِ قَبْلَ أَنْ تَدْعُوا فَلاَ يُسْتَجَابَ لَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": 4005,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ قَامَ أَبُو بَكْرٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الآيَةَ ‏{يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لاَ يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ}‏ وَإِنَّا سَمِعْنَا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ النَّاسَ إِذَا رَأَوُا الْمُنْكَرَ لاَ يُغَيِّرُونَهُ أَوْشَكَ أَنْ يَعُمَّهُمُ اللَّهُ بِعِقَابِهِ ‏\"‏ ‏.‏ قَالَ أَبُو أُسَامَةَ مَرَّةً أُخْرَى فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": 4006,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلِيِّ بْنِ بَذِيمَةَ، عَنْ أَبِي عُبَيْدَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ بَنِي إِسْرَائِيلَ لَمَّا وَقَعَ فِيهِمُ النَّقْصُ كَانَ الرَّجُلُ يَرَى أَخَاهُ عَلَى الذَّنْبِ فَيَنْهَاهُ عَنْهُ فَإِذَا كَانَ الْغَدُ لَمْ يَمْنَعْهُ مَا رَأَى مِنْهُ أَنْ يَكُونَ أَكِيلَهُ وَشَرِيبَهُ وَخَلِيطَهُ فَضَرَبَ اللَّهُ قُلُوبَ بَعْضِهِمْ بِبَعْضٍ وَنَزَلَ فِيهِمُ الْقُرْآنُ فَقَالَ ‏{لُعِنَ الَّذِينَ كَفَرُوا مِنْ بَنِي إِسْرَائِيلَ عَلَى لِسَانِ دَاوُدَ وَعِيسَى ابْنِ مَرْيَمَ}‏ حَتَّى بَلَغَ ‏{وَلَوْ كَانُوا يُؤْمِنُونَ بِاللَّهِ وَالنَّبِيِّ وَمَا أُنْزِلَ إِلَيْهِ مَا اتَّخَذُوهُمْ أَوْلِيَاءَ وَلَكِنَّ كَثِيرًا مِنْهُمْ فَاسِقُونَ }‏ ‏\"‏ ‏.‏ قَالَ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مُتَّكِئًا فَجَلَسَ وَقَالَ ‏\"‏ لاَ حَتَّى تَأْخُذُوا عَلَى يَدَىِ الظَّالِمِ فَتَأْطِرُوهُ عَلَى الْحَقِّ أَطْرًا ‏\"‏ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، - أَمْلاَهُ عَلَىَّ - حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْوَضَّاحِ، عَنْ عَلِيِّ بْنِ بَذِيمَةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِمِثْلِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": 4007,
			"text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَامَ خَطِيبًا فَكَانَ فِيمَا قَالَ ‏ \"‏ أَلاَ لاَ يَمْنَعَنَّ رَجُلاً هَيْبَةُ النَّاسِ أَنْ يَقُولَ بِحَقٍّ إِذَا عَلِمَهُ ‏\"‏ ‏.‏ قَالَ فَبَكَى أَبُو سَعِيدٍ وَقَالَ قَدْ وَاللَّهِ رَأَيْنَا أَشْيَاءَ فَهِبْنَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": 4008,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ يَحْقِرْ أَحَدُكُمْ نَفْسَهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ يَحْقِرُ أَحَدُنَا نَفْسَهُ قَالَ ‏\"‏ يَرَى أَمْرًا لِلَّهِ عَلَيْهِ فِيهِ مَقَالٌ ثُمَّ لاَ يَقُولُ فِيهِ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ لَهُ يَوْمَ الْقِيَامَةِ مَا مَنَعَكَ أَنْ تَقُولَ فِي كَذَا وَكَذَا فَيَقُولُ خَشْيَةُ النَّاسِ ‏.‏ فَيَقُولُ فَإِيَّاىَ كُنْتَ أَحَقَّ أَنْ تَخْشَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": 4009,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عُبَيْدِ اللَّهِ بْنِ جَرِيرٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا مِنْ قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي هُمْ أَعَزُّ مِنْهُمْ وَأَمْنَعُ لاَ يُغَيِّرُونَ إِلاَّ عَمَّهُمُ اللَّهُ بِعِقَابٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": 4010,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ لَمَّا رَجَعَتْ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُهَاجِرَةُ الْبَحْرِ قَالَ ‏\"‏ أَلاَ تُحَدِّثُونِي بِأَعَاجِيبِ مَا رَأَيْتُمْ بِأَرْضِ الْحَبَشَةِ ‏\"‏ ‏.‏ قَالَ فِتْيَةٌ مِنْهُمْ بَلَى يَا رَسُولَ اللَّهِ بَيْنَا نَحْنُ جُلُوسٌ مَرَّتْ بِنَا عَجُوزٌ مِنْ عَجَائِزِ رَهَابِينِهِمْ تَحْمِلُ عَلَى رَأْسِهَا قُلَّةً مِنْ مَاءٍ فَمَرَّتْ بِفَتًى مِنْهُمْ فَجَعَلَ إِحْدَى يَدَيْهِ بَيْنَ كَتِفَيْهَا ثُمَّ دَفَعَهَا فَخَرَّتْ عَلَى رُكْبَتَيْهَا فَانْكَسَرَتْ قُلَّتُهَا فَلَمَّا ارْتَفَعَتِ الْتَفَتَتْ إِلَيْهِ فَقَالَتْ سَوْفَ تَعْلَمُ يَا غُدَرُ إِذَا وَضَعَ اللَّهُ الْكُرْسِيَّ وَجَمَعَ الأَوَّلِينَ وَالآخِرِينَ وَتَكَلَّمَتِ الأَيْدِي وَالأَرْجُلُ بِمَا كَانُوا يَكْسِبُونَ فَسَوْفَ تَعْلَمُ كَيْفَ أَمْرِي وَأَمْرُكَ عِنْدَهُ غَدًا ‏.‏ قَالَ يَقُولُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ صَدَقَتْ صَدَقَتْ كَيْفَ يُقَدِّسُ اللَّهُ أُمَّةً لاَ يُؤْخَذُ لِضَعِيفِهِمْ مِنْ شَدِيدِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": 4011,
			"text": "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُصْعَبٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا إِسْرَائِيلُ، أَنْبَأَنَا مُحَمَّدُ بْنُ جُحَادَةَ، عَنْ عَطِيَّةَ الْعَوْفِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَفْضَلُ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": 4012,
			"text": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي غَالِبٍ، عَنْ أَبِي أُمَامَةَ، قَالَ عَرَضَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ رَجُلٌ عِنْدَ الْجَمْرَةِ الأُولَى فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ الْجِهَادِ أَفْضَلُ فَسَكَتَ عَنْهُ فَلَمَّا رَأَى الْجَمْرَةَ الثَّانِيَةَ سَأَلَهُ فَسَكَتَ عَنْهُ فَلَمَّا رَمَى جَمْرَةَ الْعَقَبَةِ وَضَعَ رِجْلَهُ فِي الْغَرْزِ لِيَرْكَبَ قَالَ ‏\"‏ أَيْنَ السَّائِلُ ‏\"‏ ‏.‏ قَالَ أَنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ كَلِمَةُ حَقٍّ عِنْدَ ذِي سُلْطَانٍ جَائِرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": 4013,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أَخْرَجَ مَرْوَانُ الْمِنْبَرَ فِي يَوْمِ عِيدٍ فَبَدَأَ بِالْخُطْبَةِ قَبْلَ الصَّلاَةِ فَقَالَ رَجُلٌ يَا مَرْوَانُ خَالَفْتَ السُّنَّةَ أَخْرَجْتَ الْمِنْبَرَ فِي هَذَا الْيَوْمِ وَلَمْ يَكُنْ يُخْرَجُ وَبَدَأْتَ بِالْخُطْبَةِ قَبْلَ الصَّلاَةِ وَلَمْ يَكُنْ يُبْدَأُ بِهَا ‏.‏ فَقَالَ أَبُو سَعِيدٍ أَمَّا هَذَا فَقَدْ قَضَى مَا عَلَيْهِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَاسْتَطَاعَ أَنْ يُغَيِّرَهُ بِيَدِهِ فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الإِيمَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": 4014,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنِي عُتْبَةُ بْنُ أَبِي حَكِيمٍ، حَدَّثَنِي عَمِّي، عَمْرُو بْنُ جَارِيَةَ عَنْ أَبِي أُمَيَّةَ الشَّعْبَانِيِّ، قَالَ أَتَيْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ قَالَ قُلْتُ كَيْفَ تَصْنَعُ فِي هَذِهِ الآيَةِ قَالَ أَيَّةُ آيَةٍ قُلْتُ ‏{يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لاَ يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ}‏ قَالَ سَأَلْتَ عَنْهَا خَبِيرًا سَأَلْتُ عَنْهَا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ بَلِ ائْتَمِرُوا بِالْمَعْرُوفِ وَتَنَاهَوْا عَنِ الْمُنْكَرِ حَتَّى إِذَا رَأَيْتَ شُحًّا مُطَاعًا وَهَوًى مُتَّبَعًا وَدُنْيَا مُؤْثَرَةً وَإِعْجَابَ كُلِّ ذِي رَأْىٍ بِرَأْيِهِ وَرَأَيْتَ أَمْرًا لاَ يَدَانِ لَكَ بِهِ فَعَلَيْكَ خُوَيْصَّةَ نَفْسِكَ وَدَعْ أَمْرَ الْعَوَامِّ فَإِنَّ مِنْ وَرَائِكُمْ أَيَّامَ الصَّبْرِ الصَّبْرُ فِيهِنَّ مِثْلُ قَبْضٍ عَلَى الْجَمْرِ لِلْعَامِلِ فِيهِنَّ مِثْلُ أَجْرِ خَمْسِينَ رَجُلاً يَعْمَلُونَ بِمِثْلِ عَمَلِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": 4015,
			"text": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا زَيْدُ بْنُ يَحْيَى بْنِ عُبَيْدٍ الْخُزَاعِيُّ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَبُو مُعَيْدٍ، حَفْصُ بْنُ غَيْلاَنَ الرُّعَيْنِيُّ عَنْ مَكْحُولٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ مَتَى نَتْرُكُ الأَمْرَ بِالْمَعْرُوفِ وَالنَّهْىَ عَنِ الْمُنْكَرِ قَالَ ‏\"‏ إِذَا ظَهَرَ فِيكُمْ مَا ظَهَرَ فِي الأُمَمِ قَبْلَكُمْ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ وَمَا ظَهَرَ فِي الأُمَمِ قَبْلَنَا قَالَ ‏\"‏ الْمُلْكُ فِي صِغَارِكُمْ وَالْفَاحِشَةُ فِي كِبَارِكُمْ وَالْعِلْمُ فِي رُذَالَتِكُمْ ‏\"‏ ‏.‏ قَالَ زَيْدٌ تَفْسِيرُ مَعْنَى قَوْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏\"‏ وَالْعِلْمُ فِي رُذَالَتِكُمْ ‏\"‏ ‏.‏ إِذَا كَانَ الْعِلْمُ فِي الْفُسَّاقِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": 4016,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنِ الْحَسَنِ، عَنْ جُنْدُبٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ يُذِلُّ نَفْسَهُ قَالَ ‏\"‏ يَتَعَرَّضُ مِنَ الْبَلاَءِ لِمَا لاَ يُطِيقُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": 4017,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَبُو طُوَالَةَ، حَدَّثَنَا نَهَارٌ الْعَبْدِيُّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِنَّ اللَّهَ لَيَسْأَلُ الْعَبْدَ يَوْمَ الْقِيَامَةِ حَتَّى يَقُولَ مَا مَنَعَكَ إِذْ رَأَيْتَ الْمُنْكَرَ أَنْ تُنْكِرَهُ فَإِذَا لَقَّنَ اللَّهُ عَبْدًا حُجَّتَهُ قَالَ يَا رَبِّ رَجَوْتُكَ وَفَرِقْتُ مِنَ النَّاسِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": 4018,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ اللَّهَ يُمْلِي لِلظَّالِمِ فَإِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": 4019,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو أَيُّوبَ، عَنِ ابْنِ أَبِي مَالِكٍ، عَنْ أَبِيهِ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ أَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ يَا مَعْشَرَ الْمُهَاجِرِينَ خَمْسٌ إِذَا ابْتُلِيتُمْ بِهِنَّ وَأَعُوذُ بِاللَّهِ أَنْ تُدْرِكُوهُنَّ لَمْ تَظْهَرِ الْفَاحِشَةُ فِي قَوْمٍ قَطُّ حَتَّى يُعْلِنُوا بِهَا إِلاَّ فَشَا فِيهِمُ الطَّاعُونُ وَالأَوْجَاعُ الَّتِي لَمْ تَكُنْ مَضَتْ فِي أَسْلاَفِهِمُ الَّذِينَ مَضَوْا ‏.‏ وَلَمْ يَنْقُصُوا الْمِكْيَالَ وَالْمِيزَانَ إِلاَّ أُخِذُوا بِالسِّنِينَ وَشِدَّةِ الْمَؤُنَةِ وَجَوْرِ السُّلْطَانِ عَلَيْهِمْ ‏.‏ وَلَمْ يَمْنَعُوا زَكَاةَ أَمْوَالِهِمْ إِلاَّ مُنِعُوا الْقَطْرَ مِنَ السَّمَاءِ وَلَوْلاَ الْبَهَائِمُ لَمْ يُمْطَرُوا وَلَمْ يَنْقُضُوا عَهْدَ اللَّهِ وَعَهْدَ رَسُولِهِ إِلاَّ سَلَّطَ اللَّهُ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ فَأَخَذُوا بَعْضَ مَا فِي أَيْدِيهِمْ ‏.‏ وَمَا لَمْ تَحْكُمْ أَئِمَّتُهُمْ بِكِتَابِ اللَّهِ وَيَتَخَيَّرُوا مِمَّا أَنْزَلَ اللَّهُ إِلاَّ جَعَلَ اللَّهُ بَأْسَهُمْ بَيْنَهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": 4020,
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ حَاتِمِ بْنِ حُرَيْثٍ، عَنْ مَالِكِ بْنِ أَبِي مَرْيَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ الأَشْعَرِيِّ، عَنْ أَبِي مَالِكٍ الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لَيَشْرَبَنَّ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا يُعْزَفُ عَلَى رُءُوسِهِمْ بِالْمَعَازِفِ وَالْمُغَنِّيَاتِ يَخْسِفُ اللَّهُ بِهِمُ الأَرْضَ وَيَجْعَلُ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": 4021,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ، عَنْ لَيْثٍ، عَنِ الْمِنْهَالِ، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ‏{يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللاَّعِنُونَ }‏ ‏\"‏ ‏.‏ قَالَ ‏\"‏ دَوَابُّ الأَرْضِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": 4022,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْجَعْدِ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يَزِيدُ فِي الْعُمْرِ إِلاَّ الْبِرُّ وَلاَ يَرُدُّ الْقَدَرَ إِلاَّ الدُّعَاءُ وَإِنَّ الرَّجُلَ لَيُحْرَمُ الرِّزْقَ بِالذَّنْبِ يُصِيبُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": 4023,
			"text": "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ، وَيَحْيَى بْنُ دُرُسْتَ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ النَّاسِ أَشَدُّ بَلاَءً قَالَ ‏ \"‏ الأَنْبِيَاءُ ثُمَّ الأَمْثَلُ فَالأَمْثَلُ يُبْتَلَى الْعَبْدُ عَلَى حَسَبِ دِينِهِ فَإِنْ كَانَ فِي دِينِهِ صُلْبًا اشْتَدَّ بَلاَؤُهُ وَإِنْ كَانَ فِي دِينِهِ رِقَّةٌ ابْتُلِيَ عَلَى حَسَبِ دِينِهِ فَمَا يَبْرَحُ الْبَلاَءُ بِالْعَبْدِ حَتَّى يَتْرُكَهُ يَمْشِي عَلَى الأَرْضِ وَمَا عَلَيْهِ مِنْ خَطِيئَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": 4024,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ دَخَلْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَهُوَ يُوعَكُ فَوَضَعْتُ يَدِي عَلَيْهِ فَوَجَدْتُ حَرَّهُ بَيْنَ يَدَىَّ فَوْقَ اللِّحَافِ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَشَدَّهَا عَلَيْكَ قَالَ ‏\"‏ إِنَّا كَذَلِكَ يُضَعَّفُ لَنَا الْبَلاَءُ وَيُضَعَّفُ لَنَا الأَجْرُ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ النَّاسِ أَشَدُّ بَلاَءً قَالَ ‏\"‏ الأَنْبِيَاءُ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ الصَّالِحُونَ إِنْ كَانَ أَحَدُهُمْ لَيُبْتَلَى بِالْفَقْرِ حَتَّى مَا يَجِدُ أَحَدُهُمْ إِلاَّ الْعَبَاءَةَ يُحَوِّيهَا وَإِنْ كَانَ أَحَدُهُمْ لَيَفْرَحُ بِالْبَلاَءِ كَمَا يَفْرَحُ أَحَدُكُمْ بِالرَّخَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": 4025,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ يَحْكِي نَبِيًّا مِنَ الأَنْبِيَاءِ ضَرَبَهُ قَوْمُهُ وَهُوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ وَيَقُولُ رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": 4026,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ نَحْنُ أَحَقُّ بِالشَّكِّ مِنْ إِبْرَاهِيمَ إِذْ قَالَ ‏{رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَ لَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي}‏ وَيَرْحَمُ اللَّهُ لُوطًا لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ وَلَوْ لَبِثْتُ فِي السِّجْنِ طُولَ مَا لَبِثَ يُوسُفُ لأَجَبْتُ الدَّاعِيَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": 4027,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا كَانَ يَوْمُ أُحُدٍ كُسِرَتْ رَبَاعِيَةُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَشُجَّ فَجَعَلَ الدَّمُ يَسِيلُ عَلَى وَجْهِهِ وَجَعَلَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ وَيَقُولُ ‏ \"‏ كَيْفَ يُفْلِحُ قَوْمٌ خَضَبُوا وَجْهَ نَبِيِّهِمْ بِالدَّمِ وَهُوَ يَدْعُوهُمْ إِلَى اللَّهِ ‏\"‏ ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": 4028,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ أَنَسٍ، قَالَ جَاءَ جِبْرِيلُ عَلَيْهِ السَّلاَمُ ذَاتَ يَوْمٍ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ جَالِسٌ حَزِينٌ قَدْ خُضِبَ بِالدِّمَاءِ قَدْ ضَرَبَهُ بَعْضُ أَهْلِ مَكَّةَ فَقَالَ مَا لَكَ فَقَالَ ‏\"‏ فَعَلَ بِي هَؤُلاَءِ وَفَعَلُوا ‏\"‏ ‏.‏ قَالَ أَتُحِبُّ أَنْ أُرِيَكَ آيَةً قَالَ ‏\"‏ نَعَمْ أَرِنِي ‏\"‏ ‏.‏ فَنَظَرَ إِلَى شَجَرَةٍ مِنْ وَرَاءِ الْوَادِي فَقَالَ ادْعُ تِلْكَ الشَّجَرَةَ ‏.‏ فَدَعَاهَا فَجَاءَتْ تَمْشِي حَتَّى قَامَتْ بَيْنَ يَدَيْهِ قَالَ قُلْ لَهَا فَلْتَرْجِعْ فَقَالَ لَهَا فَرَجَعَتْ حَتَّى عَادَتْ إِلَى مَكَانِهَا فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ حَسْبِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": 4029,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَحْصُوا لِي كُلَّ مَنْ تَلَفَّظَ بِالإِسْلاَمِ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ أَتَخَافُ عَلَيْنَا وَنَحْنُ مَا بَيْنَ السِّتِّمِائَةِ إِلَى السَّبْعِمِائَةِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّكُمْ لاَ تَدْرُونَ لَعَلَّكُمْ أَنْ تُبْتَلَوْا ‏\"‏ ‏.‏ قَالَ فَابْتُلِينَا حَتَّى جَعَلَ الرَّجُلُ مِنَّا مَا يُصَلِّي إِلاَّ سِرًّا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": 4030,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ، عَنْ قَتَادَةَ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ لَيْلَة�� أُسْرِيَ بِهِ وَجَدَ رِيحًا طَيِّبَةً فَقَالَ ‏ \"‏ يَا جِبْرِيلُ مَا هَذِهِ الرِّيحُ الطَّيِّبَةُ قَالَ هَذِهِ رِيحُ قَبْرِ الْمَاشِطَةِ وَابْنَيْهَا وَزَوْجِهَا ‏.‏ قَالَ وَكَانَ بَدْءُ ذَلِكَ أَنَّ الْخَضِرَ كَانَ مِنْ أَشْرَافِ بَنِي إِسْرَائِيلَ وَكَانَ مَمَرُّهُ بِرَاهِبٍ فِي صَوْمَعَتِهِ فَيَطْلُعُ عَلَيْهِ الرَّاهِبُ فَيُعَلِّمُهُ الإِسْلاَمَ فَلَمَّا بَلَغَ الْخَضِرُ زَوَّجَهُ أَبُوهُ امْرَأَةً فَعَلَّمَهَا الْخَضِرُ وَأَخَذَ عَلَيْهَا أَنْ لاَ تُعْلِمَهُ أَحَدًا وَكَانَ لاَ يَقْرَبُ النِّسَاءَ فَطَلَّقَهَا ثُمَّ زَوَّجَهُ أَبُوهُ أُخْرَى فَعَلَّمَهَا وَأَخَذَ عَلَيْهَا أَنْ لاَ تُعْلِمَهُ أَحَدًا فَكَتَمَتْ إِحَدَاهُمَا وَأَفْشَتْ عَلَيْهِ الأُخْرَى فَانْطَلَقَ هَارِبًا حَتَّى أَتَى جَزِيرَةً فِي الْبَحْرِ فَأَقْبَلَ رَجُلاَنِ يَحْتَطِبَانِ فَرَأَيَاهُ فَكَتَمَ أَحَدُهُمَا وَأَفْشَى الآخَرُ وَقَالَ قَدْ رَأَيْتُ الْخَضِرَ ‏.‏ فَقِيلَ وَمَنْ رَآهُ مَعَكَ قَالَ فُلاَنٌ فَسُئِلَ فَكَتَمَ وَكَانَ فِي دِينِهِمْ أَنَّ مَنْ كَذَبَ قُتِلَ قَالَ فَتَزَوَّجَ الْمَرْأَةَ الْكَاتِمَةَ فَبَيْنَمَا هِيَ تَمْشُطُ ابْنَةَ فِرْعَوْنَ إِذْ سَقَطَ الْمُشْطُ فَقَالَتْ تَعِسَ فِرْعَوْنُ ‏.‏ فَأَخْبَرَتْ أَبَاهَا وَكَانَ لِلْمَرْأَةِ ابْنَانِ وَزَوْجٌ فَأَرْسَلَ إِلَيْهِمْ فَرَاوَدَ الْمَرْأَةَ وَزَوْجَهَا أَنْ يَرْجِعَا عَنْ دِينِهِمَا فَأَبَيَا فَقَالَ إِنِّي قَاتِلُكُمَا ‏.‏ فَقَالاَ إِحْسَانًا مِنْكَ إِلَيْنَا إِنْ قَتَلْتَنَا أَنْ تَجْعَلَنَا فِي بَيْتٍ فَفَعَلَ فَلَمَّا أُسْرِيَ بِالنَّبِيِّ ـ صلى الله عليه وسلم ـ وَجَدَ رِيحًا طَيِّبَةً فَسَأَلَ جِبْرِيلَ فَأَخْبَرَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": 4031,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعْدِ بْنِ سِنَانٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏ \"‏ عِظَمُ الْجَزَاءِ مَعَ عِظَمِ الْبَلاَءِ وَإِنَّ اللَّهَ إِذَا أَحَبَّ قَوْمًا ابْتَلاَهُمْ فَمَنْ رَضِيَ فَلَهُ الرِّضَا وَمَنْ سَخِطَ فَلَهُ السُّخْطُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": 4032,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ صَالِحٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، عَنِ الأَعْمَشِ، عَنْ يَحْيَى بْنِ وَثَّابٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْمُؤْمِنُ الَّذِي يُخَالِطُ النَّاسَ وَيَصْبِرُ عَلَى أَذَاهُمْ أَعْظَمُ أَجْرًا مِنَ الْمُؤْمِنِ الَّذِي لاَ يُخَالِطُ النَّاسَ وَلاَ يَصْبِرُ عَلَى أَذَاهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": 4033,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ طَعْمَ الإِيمَانِ - وَقَالَ بُنْدَارٌ حَلاَوَةَ الإِيمَانِ - مَنْ كَانَ يُحِبُّ الْمَرْءَ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ ‏.‏ وَمَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا ‏.‏ وَمَنْ كَانَ أَنْ يُلْقَى فِي النَّارِ أَحَبَّ إِلَيْهِ مِنْ أَنْ يَرْجِعَ فِي الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ مِنْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": 4034,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، قَالاَ حَدَّثَنَا رَاشِدٌ أَبُو مُحَمَّدٍ الْحِمَّانِيُّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ أَوْصَانِي خَلِيلِي ـ صلى الله عليه وسلم ـ أَنْ ‏ \"‏ لاَ تُشْرِكْ بِاللَّهِ شَيْئًا وَإِنْ قُطِّعْتَ وَحُرِّقْتَ وَلاَ تَتْرُكْ صَلاَةً مَكْتُوبَةً مُتَعَمِّدًا فَمَنْ تَرَكَهَا مُتَعَمِّدًا فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ وَلاَ تَشْرَبِ الْخَمْرَ فَإِنَّهَا مِفْتَاحُ كُلِّ شَرٍّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": 4035,
			"text": "حَدَّثَنَا غِيَاثُ بْنُ جَعْفَرٍ الرَّحْبِيُّ، أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، سَمِعْتُ ابْنَ جَابِرٍ، يَقُولُ قَالَ سَمِعْتُ أَبَا عَبْدِ رَبِّهِ، يَقُولُ سَمِعْتُ مُعَاوِيَةَ، يَقُولُ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ لَمْ يَبْقَ مِنَ الدُّنْيَا إِلاَّ بَلاَءٌ وَفِتْنَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": 4036,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ قُدَامَةَ الْجُمَحِيُّ، عَنْ إِسْحَاقَ بْنِ أَبِي الْفُرَاتِ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سَيَأْتِي عَلَى النَّاسِ سَنَوَاتٌ خَدَّاعَاتٌ يُصَدَّقُ فِيهَا الْكَاذِبُ وَيُكَذَّبُ فِيهَا الصَّادِقُ وَيُؤْتَمَنُ فِيهَا الْخَائِنُ وَيُخَوَّنُ فِيهَا الأَمِينُ وَيَنْطِقُ فِيهَا الرُّوَيْبِضَةُ قِيلَ وَمَا الرُّوَيْبِضَةُ قَالَ الرَّجُلُ التَّافِهُ فِي أَمْرِ الْعَامَّةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": 4037,
			"text": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِي إِسْمَاعِيلَ الأَسْلَمِيِّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَذْهَبُ الدُّنْيَا حَتَّى يَمُرَّ الرَّجُلُ عَلَى الْقَبْرِ فَيَتَمَرَّغَ عَلَيْهِ وَيَقُولُ يَا لَيْتَنِي كُنْتُ مَكَانَ صَاحِبِ هَذَا الْقَبْرِ وَلَيْسَ بِهِ الدِّينُ إِلاَّ الْبَلاَءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": 4038,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي حُمَيْدٍ، - يَعْنِي مَوْلَى مُسَافِعٍ - عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لَتُنْتَقَوُنَّ كَمَا يُنْتَقَى التَّمْرُ مِنْ أَغْفَالِهِ فَلْيَذْهَبَنَّ خِيَارُكُمْ وَلَيَبْقَيَنَّ شِرَارُكُمْ فَمُوتُوا إِنِ اسْتَطَعْتُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ إِدْرِيسَ الشَّافِعِيُّ، حَدَّثَنِي مُحَمَّدُ بْنُ خَالِدٍ الْجَنَدِيُّ، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنِ الْحَسَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ يَزْدَادُ الأَمْرُ إِلاَّ شِدَّةً وَلاَ الدُّنْيَا إِلاَّ إِدْبَارًا وَلاَ النَّاسُ إِلاَّ شُحًّا وَلاَ تَقُومُ السَّاعَةُ إِلاَّ عَلَى شِرَارِ النَّاسِ وَلاَ الْمَهْدِيُّ إِلاَّ عِيسَى ابْنُ مَرْيَمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، وَأَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ قَالاَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، حَدَّثَنَا أَبُو حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ ‏\"‏ ‏.‏ وَجَمَعَ بَيْنَ إِصْبَعَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": 4041,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ فُرَاتٍ الْقَزَّازِ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، قَالَ اطَّلَعَ عَلَيْنَا النَّبِيُّ ـ صلى الله عليه وسلم ـ مِنْ غُرْفَةٍ وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ فَقَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَكُونَ عَشْرُ آيَاتٍ الدَّجَّالُ وَالدُّخَانُ وَطُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": 4042,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، حَدَّثَنِي عَوْفُ بْنُ مَالِكٍ الأَشْجَعِيُّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ فِي غَزْوَةِ تَبُوكَ وَهُوَ فِي خِبَاءٍ مِنْ أَدَمٍ فَجَلَسْتُ بِفِنَاءِ الْخِبَاءِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ادْخُلْ يَا عَوْفُ ‏\"‏ ‏.‏ فَقُلْتُ بِكُلِّي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُلِّكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ يَا عَوْفُ احْفَظْ خِلاَلاً سِتًّا بَيْنَ يَدَىِ السَّاعَةِ إِحْدَاهُنَّ مَوْتِي ‏\"‏ ‏.‏ قَالَ فَوَجَمْتُ عِنْدَهَا وَجْمَةً شَدِيدَةً ‏.‏ فَقَالَ ‏\"‏ قُلْ إِحْدَى ثُمَّ فَتْحُ بَيْتِ الْمَقْدِسِ ثُمَّ دَاءٌ يَظْهَرُ فِيكُمْ يَسْتَشْهِدُ اللَّهُ بِهِ ذَرَارِيَّكُمْ وَأَنْفُسَكُمْ وَيُزَكِّي بِهِ أَمْوَالَكُمْ ثُمَّ تَكُونُ الأَمْوَالُ فِيكُمْ حَتَّى يُعْطَى الرَّجُلُ مِائَةَ دِينَارٍ فَيَظَلَّ سَاخِطًا وَفِتْنَةٌ تَكُونُ بَيْنَكُمْ لاَ يَبْقَى بَيْتُ مُسْلِمٍ إِلاَّ دَخَلَتْهُ ثُمَّ تَكُونُ بَيْنَكُمْ وَبَيْنَ بَنِي الأَصْفَرِ هُدْنَةٌ فَيَغْدِرُونَ بِكُمْ فَيَسِيرُونَ إِلَيْكُمْ فِي ثَمَانِينَ غَايَةٍ تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": 4043,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، حَدَّثَنَا عَمْرٌو، - مَوْلَى الْمُطَّلِبِ - عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَقْتُلُوا إِمَامَكُمْ وَتَجْتَلِدُوا بِأَسْيَافِكُمْ وَيَرِثُ دُنْيَاكُمْ شِرَارُكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": 4044,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمًا بَارِزًا لِلنَّاسِ فَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ فَقَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ وَلَكِنْ سَأُخْبِرُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الأَمَةُ رَبَّتَهَا فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا كَانَتِ الْحُفَاةُ الْعُرَاةُ رُءُوسَ النَّاسِ فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا تَطَاوَلَ رِعَاءُ الْغَنَمِ فِي الْبُنْيَانِ فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ فَتَلاَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏{إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الأَرْحَامِ}‏ الآيَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": 4045,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَلاَ أُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ، رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لاَ يُحَدِّثُكُمْ بِهِ أَحَدٌ بَعْدِي سَمِعْتُهُ مِنْهُ ‏ \"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَظْهَرَ الْجَهْلُ وَيَفْشُوَ الزِّنَا وَيُشْرَبَ الْخَمْرُ وَيَذْهَبَ الرِّجَالُ وَيَبْقَى النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً قَيِّمٌ وَاحِدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": 4046,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ فَيَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ عَشَرَةٍ تِسْعَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": 4047,
			"text": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَفِيضَ الْمَالُ وَتَظْهَرَ الْفِتَنُ وَيَكْثُرَ الْهَرْجُ ‏\"‏ ‏.‏ قَالُوا وَمَا الْهَرْجُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْقَتْلُ الْقَتْلُ الْقَتْلُ ‏\"‏ ‏.‏ ثَلاَثًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": 4048,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ زِيَادِ بْنِ لَبِيدٍ، قَالَ ذَكَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ شَيْئًا فَقَالَ ‏\"‏ ذَاكَ عِنْدَ أَوَانِ ذَهَابِ الْعِلْمِ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ وَكَيْفَ يَذْهَبُ الْعِلْمُ وَنَحْنُ نَقْرَأُ الْقُرْآنَ وَنُقْرِئُهُ أَبْنَاءَنَا وَيُقْرِئُهُ أَبْنَاؤُنَا أَبْنَاءَهُمْ إِلَى يَوْمِ الْقِيَامَةِ قَالَ ‏\"‏ ثَكِلَتْكَ أُمُّكَ زِيَادُ إِنْ كُنْتُ لأَرَاكَ مِنْ أَفْقَهِ رَجُلٍ بِالْمَدِينَةِ أَوَلَيْسَ هَذِهِ الْيَهُودُ وَالنَّصَارَى يَقْرَءُونَ التَّوْرَاةَ وَالإِنْجِيلَ لاَ يَعْمَلُونَ بِشَىْءٍ مِمَّا فِيهِمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": 4049,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَدْرُسُ الإِسْلاَمُ كَمَا يَدْرُسُ وَشْىُ الثَّوْبِ حَتَّى لاَ يُدْرَى مَا صِيَامٌ وَلاَ صَلاَةٌ وَلاَ نُسُكٌ وَلاَ صَدَقَةٌ وَلَيُسْرَى عَلَى كِتَابِ اللَّهِ عَزَّ وَجَلَّ فِي لَيْلَةٍ فَلاَ يَبْقَى فِي الأَرْضِ مِنْهُ آيَةٌ وَتَبْقَى طَوَائِفُ مِنَ النَّاسِ الشَّيْخُ الْكَبِيرُ وَالْعَجُوزُ يَقُولُونَ أَدْرَكْنَا آبَاءَنَا عَلَى هَذِهِ الْكَلِمَةِ لاَ إِلَهَ إِلاَّ اللَّهُ فَنَحْنُ نَقُولُهَا ‏\"‏ ‏.‏ فَقَالَ لَهُ صِلَةُ مَا تُغْنِي عَنْهُمْ لاَ إِلَهَ إِلاَّ اللَّهُ وَهُمْ لاَ يَدْرُونَ مَا صَلاَةٌ وَلاَ صِيَامٌ وَلاَ نُسُكٌ وَلاَ صَدَقَةٌ فَأَعْرَضَ عَنْهُ حُذَيْفَةُ ثُمَّ رَدَّهَا عَلَيْهِ ثَلاَثًا كُلَّ ذَلِكَ يُعْرِضُ عَنْهُ حُذَيْفَةُ ثُمَّ أَقْبَلَ عَلَيْهِ فِي الثَّالِثَةِ فَقَالَ يَا صِلَةُ تُنْجِيهِمْ مِنَ النَّارِ ‏.‏ ثَلاَثًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": 4050,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَكُونُ بَيْنَ يَدَىِ السَّاعَةِ أَيَّامٌ يُرْفَعُ فِيهَا الْعِلْمُ وَيَنْزِلُ فِيهَا الْجَهْلُ وَيَكْثُرُ فِيهَا الْهَرْجُ ‏\"‏ ‏.‏ وَالْهَرْجُ الْقَتْلُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": 4051,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ مِنْ وَرَائِكُمْ أَيَّامًا يَنْزِلُ فِيهَا الْجَهْلُ وَيُرْفَعُ فِيهَا الْعِلْمُ وَيَكْثُرُ فِيهَا الْهَرْجُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ قَالَ ‏\"‏ الْقَتْلُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": 4052,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَرْفَعُهُ قَالَ ‏\"‏ يَتَقَارَبُ الزَّمَانُ وَيَنْقُصُ الْعِلْمُ وَيُلْقَى الشُّحُّ وَتَظْهَرُ الْفِتَنُ وَيَكْثُرُ الْهَرْجُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ قَالَ ‏\"‏ الْقَتْلُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": 4053,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ حُذَيْفَةَ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَدِيثَيْنِ قَدْ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الآخَرَ حَدَّثَنَا ‏\"‏ أَنَّ الأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ ‏\"‏ ‏.‏ - قَالَ الطَّنَافِسِيُّ يَعْنِي وَسْطَ قُلُوبِ الرِّجَالِ - وَنَزَلَ الْقُرْآنُ فَعَلِمْنَا مِنَ الْقُرْآنِ وَعَلِمْنَا مِنَ السُّنَّةِ ‏.‏ ثُمَّ حَدَّثَنَا عَنْ رَفْعِهِمَا فَقَالَ ‏\"‏ يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُرْفَعُ الأَمَانَةُ مِنْ قَلْبِهِ فَيَظَلُّ أَثَرُهَا كَأَثَرِ الْوَكْتِ ثُمَّ يَنَامُ النَّوْمَةَ فَتُنْزَعُ الأَمَانَةُ مِنْ قَلْبِهِ فَيَظَلُّ أَثَرُهَا كَأَثَرِ الْمَجْلِ كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَىْءٌ ‏\"‏ ‏.‏ ثُمَّ أَخَذَ حُذَيْفَةُ كَفًّا مِنْ حَصًى فَدَحْرَجَهُ عَلَى سَاقِهِ ‏.‏ قَالَ ‏\"‏ فَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ وَلاَ يَكَادُ أَحَدٌ يُؤَدِّي الأَمَانَةَ حَتَّى يُقَالَ إِنَّ فِي بَنِي فُلاَنٍ رَجُلاً أَمِينًا ‏.‏ وَحَتَّى يُقَالَ لِلرَّجُلِ مَا أَعْقَلَهُ وَأَجْلَدَهُ وَأَظْرَفَهُ ‏.‏ وَمَا فِي قَلْبِهِ حَبَّةُ خَرْدَلٍ مِنْ إِيمَانٍ ‏\"‏ ‏.‏ وَلَقَدْ أَتَى عَلَىَّ زَمَانٌ وَلَسْتُ أُبَالِي أَيَّكُمْ بَايَعْتُ لَئِنْ كَانَ مُسْلِمًا لَيَرُدَّنَّهُ عَلَىَّ إِسْلاَمُهُ وَلَئِنْ كَانَ يَهُودِيًّا أَوْ نَصْرَانِيًّا لَيَرُدَّنَّهُ عَلَىَّ سَاعِيهِ فَأَمَّا الْيَوْمَ فَمَا كُنْتُ لأُبَايِعَ إِلاَّ فُلاَنًا وَفُلاَنًا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": 4054,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنْ سَعِيدِ بْنِ سِنَانٍ، عَنْ أَبِي الزَّاهِرِيَّةِ، عَنْ أَبِي شَجَرَةَ، كَثِيرِ بْنِ مُرَّةَ عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَرَادَ أَنْ يُهْلِكَ عَبْدًا نَزَعَ مِنْهُ الْحَيَاءَ فَإِذَا نَزَعَ مِنْهُ الْحَيَاءَ لَمْ تَلْقَهُ إِلاَّ مَقِيتًا مُمَقَّتًا فَإِذَا لَمْ تَلْقَهُ إِلاَّ مَقِيتًا مُمَقَّتًا نُزِعَتْ مِنْهُ الأَمَانَةُ فَإِذَا نُزِعَتْ مِنْهُ الأَمَانَةُ لَمْ تَلْقَهُ إِلاَّ خَائِنًا مُخَوَّنًا فَإِذَا لَمْ تَلْقَهُ إِلاَّ خَائِنًا مُخَوَّنًا نُزِعَتْ مِنْهُ الرَّحْمَةُ فَإِذَا نُزِعَتْ مِنْهُ الرَّحْمَةُ لَمْ تَلْقَهُ إِلاَّ رَجِيمًا مُلَعَّنًا فَإِذَا لَمْ تَلْقَهُ إِلاَّ رَجِيمًا مُلَعَّنًا نُزِعَتْ مِنْهُ رِبْقَةُ الإِسْلاَمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": 4055,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ فُرَاتٍ الْقَزَّازِ، عَنْ عَامِرِ بْنِ وَاثِلَةَ أَبِي الطُّفَيْلِ الْكِنَانِيِّ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ أَبِي سَرِيحَةَ، قَالَ اطَّلَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ غُرْفَةٍ وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ فَقَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَكُونَ عَشْرُ آيَاتٍ طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدَّجَّالُ وَالدُّخَانُ وَالدَّابَّةُ وَيَأْجُوجُ وَمَأْجُوجُ وَخُرُوجُ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ السَّلاَمُ وَثَلاَثُ خُسُوفٍ خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَنَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنِ أَبْيَنَ تَسُوقُ النَّاسَ إِلَى الْمَحْشَرِ تَبِيتُ مَعَهُمْ إِذَا بَاتُوا وَتَقِيلُ مَعَهُمْ إِذَا قَالُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": 4056,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، وَابْنُ، لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سِنَانِ بْنِ سَعْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ بَادِرُوا بِالأَعْمَالِ سِتًّا طُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدُّخَانَ وَدَابَّةَ الأَرْضِ وَالدَّجَّالَ وَخُوَيْصَّةَ أَحَدِكُمْ وَأَمْرَ الْعَامَّةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": 4057,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَوْنُ بْنُ عُمَارَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى بْنِ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الآيَاتُ بَعْدَ الْمِائَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": 4058,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا نُوحُ بْنُ قَيْسٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَعْقِلٍ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أُمَّتِي عَلَى خَمْسِ طَبَقَاتٍ فَأَرْبَعُونَ سَنَةً أَهْلُ بِرٍّ وَتَقْوَى ثُمَّ الَّذِينَ يَلُونَهُمْ إِلَى عِشْرِينَ وَمِائَةِ سَنَةٍ أَهْلُ تَرَاحُمٍ وَتَوَاصُلٍ ثُمَّ الَّذِينَ يَلُونَهُمْ إِلَى سِتِّينَ وَمِائَةِ سَنَةٍ أَهْلُ تَدَابُرٍ وَتَقَاطُعٍ ثُمَّ الْهَرْجُ الْهَرْجُ النَّجَا النَّجَا ‏\"‏ ‏.‏ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا خَازِمٌ أَبُو مُحَمَّدٍ الْعَنَزِيُّ، حَدَّثَنَا الْمِسْوَرُ بْنُ الْحَسَنِ، عَنْ أَبِي مَعْنٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أُمَّتِي عَلَى خَمْسِ طَبَقَاتٍ كُلُّ طَبَقَةٍ أَرْبَعُونَ عَامًا فَأَمَّا طَبَقَتِي وَطَبَقَةُ أَصْحَابِي فَأَهْلُ عِلْمٍ وَإِيمَانٍ وَأَمَّا الطَّبَقَةُ الثَّانِيَةُ مَا بَيْنَ الأَرْبَعِينَ إِلَى الثَّمَانِينَ فَأَهْلُ بِرٍّ وَتَقْوَى ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": 4059,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا بَشِيرُ بْنُ سَلْمَانَ، عَنْ سَيَّارٍ، عَنْ طَارِقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ بَيْنَ يَدَىِ السَّاعَةِ مَسْخٌ وَخَسْفٌ وَقَذْفٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": 4060,
			"text": "حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّهُ سَمِعَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ يَكُونُ فِي آخِرِ أُمَّتِي خَسْفٌ وَمَسْخٌ وَقَذْفٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": 4061,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، حَدَّثَنَا أَبُو صَخْرٍ، عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَتَى ابْنَ عُمَرَ فَقَالَ إِنَّ فُلاَنًا يَقْرَأُ عَلَيْكَ السَّلاَمَ قَالَ إِنَّهُ بَلَغَنِي أَنَّهُ قَدْ أَحْدَثَ فَإِنْ كَانَ قَدْ أَحْدَثَ فَلاَ تُقْرِئْهُ مِنِّي السَّلاَمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ يَكُونُ فِي أُمَّتِي - أَوْ فِي هَذِهِ الأُمَّةِ - مَسْخٌ وَخَسْفٌ وَقَذْفٌ ‏\"‏ ‏.‏ وَذَلِكَ فِي أَهْلِ الْقَدَرِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": 4062,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَمُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْحَسَنِ بْنِ عَمْرٍو، عَنْ أَبِي الزُّبَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَكُونُ فِي أُمَّتِي خَسْفٌ وَمَسْخٌ وَقَذْفٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": 4063,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عُمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أُمَيَّةَ بْنِ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ صَفْوَانَ، يَقُولُ أَخْبَرَتْنِي حَفْصَةُ، أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ لَيَؤُمَّنَّ هَذَا الْبَيْتَ جَيْشٌ يَغْزُونَهُ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ مِنَ الأَرْضِ خُسِفَ بِأَوْسَطِهِمْ وَيَتَنَادَى أَوَّلُهُمْ آخِرَهُمْ فَيُخْسَفُ بِهِمْ فَلاَ يَبْقَى مِنْهُمْ إِلاَّ الشَّرِيدُ الَّذِي يُخْبِرُ عَنْهُمْ ‏\"‏ ‏.‏ فَلَمَّا جَاءَ جَيْشُ الْحَجَّاجِ ظَنَنَّا أَنَّهُمْ هُمْ فَقَالَ رَجُلٌ أَشْهَدُ عَلَيْكَ أَنَّكَ لَمْ تَكْذِبْ عَلَى حَفْصَةَ وَ أَنَّ حَفْصَةَ لَمْ تَكْذِبْ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": 4064,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي إِدْرِيسَ الْمُرْهِبِيِّ، عَنْ مُسْلِمِ بْنِ صَفْوَانَ، عَنْ صَفِيَّةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ يَنْتَهِي النَّاسُ عَنْ غَزْوِ هَذَا الْبَيْتِ حَتَّى يَغْزُوَ جَيْشٌ حَتَّى إِذَا كَانُوا بِالْبَيْدَاءِ - أَوْ بَيْدَاءَ مِنَ الأَرْضِ - خُسِفَ بِأَوَّلِهِمْ وَآخِرِهِمْ وَلَمْ يَنْجُ أَوْسَطُهُمْ ‏\"‏ ‏.‏ قُلْتُ فَإِنْ كَانَ فِيهِمْ مَنْ يُكْرَهُ قَالَ ‏\"‏ يَبْعَثُهُمُ اللَّهُ عَلَى مَا فِي أَنْفُسِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": 4065,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَنَصْرُ بْنُ عَلِيٍّ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ، سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنْ أُمِّ سَلَمَةَ، قَالَتْ ذَكَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ الْجَيْشَ الَّذِي يُخْسَفُ بِهِمْ فَقَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ لَعَلَّ فِيهِمُ الْمُكْرَهُ قَالَ ‏ \"‏ إِنَّهُمْ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": 4066,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ أَوْسِ بْنِ خَالِدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ تَخْرُجُ الدَّابَّةُ وَمَعَهَا خَاتَمُ سُلَيْمَانَ بْنِ دَاوُدَ وَعَصَا مُوسَى بْنِ عِمْرَانَ عَلَيْهِمَا السَّلاَمُ فَتَجْلُو وَجْهَ الْمُؤْمِنِ بِالْعَصَا وَ تَخْطِمُ أَنْفَ الْكَافِرِ بِالْخَاتَمِ حَتَّى أَنَّ أَهْلَ الْحِوَاءِ لَيَجْتَمِعُونَ فَيَقُولُ هَذَا يَا مُؤْمِنُ وَيَقُولُ هَذَا يَا كَافِرُ ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ الْقَطَّانُ حَدَّثَنَاهُ إِبْرَاهِيمُ بْنُ يَحْيَى، حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، فَذَكَرَ نَحْوَهُ وَقَالَ فِيهِ مَرَّةً فَيَقُولُ هَذَا يَا مُؤْمِنُ ‏.‏ وَهَذَا يَا كَافِرُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": 4067,
			"text": "حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ عَمْرٍو زُنَيْجٌ حَدَّثَنَا أَبُو تُمَيْلَةَ، حَدَّثَنَا خَالِدُ بْنُ عُبَيْدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ ذَهَبَ بِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى مَوْضِعٍ بِالْبَادِيَةِ قَرِيبٍ مِنْ مَكَّةَ فَإِذَا أَرْضٌ يَابِسَةٌ حَوْلَهَا رَمْلٌ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَخْرُجُ الدَّابَّةُ مِنْ هَذَا الْمَوْضِعِ ‏\"‏ ‏.‏ فَإِذَا فِتْرٌ فِي شِبْرٍ ‏.‏ قَالَ ابْنُ بُرَيْدَةَ فَحَجَجْتُ بَعْدَ ذَلِكَ بِسِنِينَ فَأَرَانَا عَصًا لَهُ فَإِذَا هُوَ بِعَصَاىَ هَذِهِ كَذَا وَكَذَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": 4068,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنَ مَنْ عَلَيْهَا فَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": 4069,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي حَيَّانَ التَّيْمِيِّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَوَّلُ الآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ عَلَى النَّاسِ ضُحًى ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ فَأَيَّتُهُمَا مَا خَرَجَتْ قَبْلَ الأُخْرَى فَالأُخْرَى مِنْهَا قَرِيبٌ ‏.‏ قَالَ عَبْدُ اللَّهِ وَلاَ أَظُنُّهَا إِلاَّ طُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": 4070,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ صَفْوَانَ بْنِ عَسَّالٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ مِنْ قِبَلِ مَغْرِبِ الشَّمْسِ بَابًا مَفْتُوحًا عَرْضُهُ سَبْعُونَ سَنَةً فَلاَ يَزَالُ ذَلِكَ الْبَابُ مَفْتُوحًا لِلتَّوْبَةِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ نَحْوِهِ فَإِذَا طَلَعَتْ مِنْ نَحْوِهِ لَمْ يَنْفَعْ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": 4071,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الدَّجَّالُ أَعْوَرُ عَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالُوا حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَنَّ الدَّجَّالَ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا خُرَاسَانُ يَتْبَعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": 4073,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ مَا سَأَلَ أَحَدٌ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَنِ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُهُ - وَقَالَ ابْنُ نُمَيْرٍ أَشَدَّ سُؤَالاً مِنِّي - فَقَالَ لِي ‏\"‏ مَا تَسْأَلُ عَنْهُ ‏\"‏ ‏.‏ قُلْتُ إِنَّهُمْ يَقُولُونَ إِنَّ مَعَهُ الطَّعَامَ وَالشَّرَابَ قَالَ ‏\"‏ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": 4074,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ مُجَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ يَوْمٍ وَصَعِدَ الْمِنْبَرَ وَكَانَ لاَ يَصْعَدُ عَلَيْهِ قَبْلَ ذَلِكَ إِلاَّ يَوْمَ الْجُمُعَةِ فَاشْتَدَّ ذَلِكَ عَلَى النَّاسِ فَمِنْ بَيْنِ قَائِمٍ وَجَالِسٍ فَأَشَارَ إِلَيْهِمْ بِيَدِهِ أَنِ اقْعُدُوا ‏\"‏ فَإِنِّي وَاللَّهِ مَا قُمْتُ مَقَامِي هَذَا لأَمْرٍ يَنْفَعُكُمْ لِرَغْبَةٍ وَلاَ لِرَهْبَةٍ وَلَكِنَّ تَمِيمًا الدَّارِيَّ أَتَانِي فَأَخْبَرَنِي خَبَرًا مَنَعَنِي الْقَيْلُولَةَ مِنَ الْفَرَحِ وَقُرَّةِ الْعَيْنِ فَأَحْبَبْتُ أَنْ أَنْشُرَ عَلَيْكُمْ فَرَحَ نَبِيِّكُمْ أَلاَ إِنَّ ابْنَ عَمٍّ لَتَمِيمٍ الدَّارِيِّ أَخْبَرَنِي أَنَّ الرِّيحَ أَلْجَأَتْهُمْ إِلَى جَزِيرَةٍ لاَ يَعْرِفُونَهَا فَقَعَدُوا فِي قَوَارِبِ السَّفِينَةِ فَخَرَجُوا فِيهَا فَإِذَا هُمْ بِشَىْءٍ أَهْدَبَ أَسْوَدَ قَالُوا لَهُ مَا أَنْتَ قَالَ أَنَا الْجَسَّاسَةُ ‏.‏ قَالُوا أَخْبِرِينَا ‏.‏ قَالَتْ مَا أَنَا بِمُخْبِرَتِكُمْ شَيْئًا وَلاَ سَائِلَتِكُمْ وَلَكِنْ هَذَا الدَّيْرُ قَدْ رَمَقْتُمُوهُ فَأْتُوهُ فَإِنَّ فِيهِ رَجُلاً بِالأَشْوَاقِ إِلَى أَنْ تُخْبِرُوهُ وَيُخْبِرَكُمْ فَأَتَوْهُ فَدَخَلُوا عَلَيْهِ فَإِذَا هُمْ بِشَيْخٍ مُوثَقٍ شَدِيدِ الْوَثَاقِ يُظْهِرُ الْحُزْنَ شَدِيدِ التَّشَكِّي فَقَالَ لَهُمْ مِنْ أَيْنَ قَالُوا مِنَ الشَّامِ ‏.‏ قَالَ مَا فَعَلَتِ الْعَرَبُ قَالُوا نَحْنُ قَوْمٌ مِنَ الْعَرَبِ عَمَّ تَسْأَلُ قَالَ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي خَرَجَ فِيكُمْ قَالُوا خَيْرًا نَاوَى قَوْمًا فَأَظْهَرَهُ اللَّهُ عَلَيْهِمْ فَأَمْرُهُمُ الْيَوْمَ جَمِيعٌ إِلَهُهُمْ وَاحِدٌ وَدِينُهُمْ وَاحِدٌ قَالَ مَا فَعَلَتْ عَيْنُ زُغَرَ قَالُوا خَيْرًا يَسْقُونَ مِنْهَا زُرُوعَهُمْ وَيَسْتَقُونَ مِنْهَا لِسَقْيِهِمْ قَالَ فَمَا فَعَلَ نَخْلٌ بَيْنَ عَمَّانَ وَبَيْسَانَ قَالُوا يُطْعِمُ ثَمَرَهُ كُلَّ عَامٍ ‏.‏ قَالَ فَمَا فَعَلَتْ بُحَيْرَةُ الطَّبَرِيَّةِ قَالُوا تَدَفَّقُ جَنَبَاتُهَا مِنْ كَثْرَةِ الْمَاءِ ‏.‏ قَالَ فَزَفَرَ ثَلاَثَ زَفَرَاتٍ ثُمَّ قَالَ لَوِ انْفَلَتُّ مِنْ وَثَاقِي هَذَا لَمْ أَدَعْ أَرْضًا إِلاَّ وَطِئْتُهَا بِرِجْلَىَّ هَاتَيْنِ إِلاَّ طَيْبَةَ لَيْسَ لِي عَلَيْهَا سَبِيلٌ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِلَى هَذَا يَنْتَهِي فَرَحِي هَذِهِ طَيْبَةُ وَالَّذِي نَفْسِي بِيَدِهِ مَا فِيهَا طَرِيقٌ ضَيِّقٌ وَلاَ وَاسِعٌ وَلاَ سَهْلٌ وَلاَ جَبَلٌ إِلاَّ وَعَلَيْهِ مَلَكٌ شَاهِرٌ سَيْفَهُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Matn"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": 4075,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ، حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلاَبِيَّ، يَقُولُ ذَكَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الدَّجَّالَ الْغَدَاةَ فَخَفَضَ فِيهِ وَرَفَعَ حَتَّى ظَنَنَّا أَنَّهُ فِي طَائِفَةِ النَّخْلِ فَلَمَّا رُحْنَا إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ عَرَفَ ذَلِكَ فِينَا فَقَالَ ‏\"‏ مَا شَأْنُكُمْ ‏\"‏ ‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ ذَكَرْتَ الدَّجَّالَ الْغَدَاةَ فَخَفَضْتَ فِيهِ ثُمَّ رَفَعْتَ حَتَّى ظَنَنَّا أَنَّهُ فِي طَائِفَةِ النَّخْلِ ‏.‏ قَالَ ‏\"‏ غَيْرُ الدَّجَّالِ أَخْوَفُنِي عَلَيْكُمْ إِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ قَطَطٌ عَيْنُهُ قَائِمَةٌ كَأَنِّي أُشَبِّهُهُ بِعَبْدِ الْعُزَّى بْنِ قَطَنٍ فَمَنْ رَآهُ مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ إِنَّهُ يَخْرُجُ مِنْ خَلَّةٍ بَيْنَ الشَّامِ وَالْعِرَاقِ فَعَاثَ يَمِينًا وَعَاثَ شِمَالاً يَا عِبَادَ اللَّهِ اثْبُتُوا ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ وَمَا لُبْثُهُ فِي الأَرْضِ قَالَ ‏\"‏ أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي كَسَنَةٍ تَكْفِينَا فِيهِ صَلاَةُ يَوْمٍ قَالَ ‏\"‏ فَاقْدُرُوا لَهُ قَدْرًا ‏\"‏ ‏.‏ قَالَ قُلْنَا فَمَا إِسْرَاعُهُ فِي الأَرْضِ قَالَ ‏\"‏ كَالْغَيْثِ اشْتَدَّ بِهِ الرِّيحُ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَيَأْتِي الْقَوْمَ فَيَدْعُوهُمْ فَيَسْتَجِيبُونَ لَهُ وَيُؤْمِنُونَ بِهِ فَيَأْمُرُ السَّمَاءَ أَنْ تُمْطِرَ فَتُمْطِرَ وَيَأْمُرُ الأَرْضَ أَنْ تُنْبِتَ فَتُنْبِتَ وَتَرُوحُ عَلَيْهِمْ سَارِحَتُهُمْ أَطْوَلَ مَا كَانَتْ ذُرًى وَأَسْبَغَهُ ضُرُوعًا وَأَمَدَّهُ خَوَاصِرَ ثُمَّ يَأْتِي الْقَوْمَ فَيَدْعُوهُمْ فَيَرُدُّونَ عَلَيْهِ قَوْلَهُ فَيَنْصَرِفُ عَنْهُمْ فَيُصْبِحُونَ مُمْحِلِينَ مَا بِأَيْدِيهِمْ شَىْءٌ ثُمَّ يَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا أَخْرِجِي كُنُوزَكِ فَيَنْطَلِقُ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ ثُمَّ يَدْعُو رَجُلاً مُمْتَلِئًا شَبَابًا فَيَضْرِبُهُ بِالسَّيْفِ ضَرْبَةً فَيَقْطَعُهُ جِزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ يَتَهَلَّلُ وَجْهُهُ يَضْحَكُ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ عِيسَى ابْنَ مَرْيَمَ فَيَنْزِلُ عِنْدَ الْمَنَارَةِ الْبَيْضَاءِ شَرْقِيَّ دِمَشْقَ بَيْنَ مَهْرُودَتَيْنِ وَاضِعًا كَفَّيْهِ عَلَى أَجْنِحَةِ مَلَكَيْنِ إِذَا طَأْطَأَ رَأْسَهُ قَطَرَ وَإِذَا رَفَعَهُ يَنْحَدِرُ مِنْهُ جُمَانٌ كَاللُّؤْلُؤِ وَلاَ يَحِلُّ لِكَافِرٍ أَنْ يَجِدَ رِيِحَ نَفَسِهِ إِلاَّ مَاتَ وَنَفَسُهُ يَنْتَهِي حَيْثُ يَنْتَهِي طَرْفُهُ فَيَنْطَلِقُ حَتَّى يُدْرِكَهُ عِنْدَ بَابِ لُدٍّ فَيَقْتُلُهُ ثُمَّ يَأْتِي نَبِيُّ اللَّهِ عِيسَى قَوْمًا قَدْ عَصَمَهُمُ اللَّهُ فَيَمْسَحُ وُجُوهَهُمْ وَيُحَدِّثُهُمْ بِدَرَجَاتِهِمْ فِي الْجَنَّةِ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ أَوْحَى اللَّهُ إِلَيْهِ يَا عِيسَى إِنِّي قَدْ أَخْرَجْتُ عِبَادًا لِي لاَ يَدَانِ لأَحَدٍ بِقِتَالِهِمْ وَأَحْرِزْ عِبَادِي إِلَى الطُّورِ ‏.‏ وَيَبْعَثُ اللَّهُ يَأْجُوجَ وَمَأْجُوجَ وَهُمْ كَمَا قَالَ اللَّهُ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ فَيَمُرُّ أَوَائِلُهُمْ عَلَى بُحَيْرَةِ الطَّبَرِيَّةِ فَيَشْرَبُونَ مَا فِيهَا ثُمَّ يَمُرُّ آخِرُهُمْ فَيَقُولُونَ لَقَدْ كَانَ فِي هَذَا مَاءٌ مَرَّةً وَيَحْضُرُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ حَتَّى يَكُونَ رَأْسُ الثَّوْرِ لأَحَدِهِمْ خَيْرًا مِنْ مِائَةِ دِينَارٍ لأَحَدِكُمُ الْيَوْمَ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ فَيُرْسِلُ اللَّهُ عَلَيْهِمُ النَّغَفَ فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ وَاحِدَةٍ ‏.‏ وَيَهْبِطُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ فَلاَ يَجِدُونَ مَوْضِعَ شِبْرٍ إِلاَّ قَدْ مَلأَهُ زَهَمُهُمْ وَنَتْنُهُمْ وَدِمَاؤُهُمْ فَيَرْغَبُونَ إِلَى اللَّهِ سُبْحَانَهُ فَيُرْسِلُ عَلَيْهِمْ طَيْرًا كَأَعْنَاقِ الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ ثُمَّ يُرْسِلُ اللَّهُ عَلَيْهِمْ مَطَرًا لاَ يُكِنُّ مِنْهُ بَيْتُ مَدَرٍ وَلاَ وَبَرٍ فَيَغْسِلُهُ حَتَّى يَتْرُكَهُ كَالزَّلَقَةِ ثُمَّ يُقَالُ لِلأَرْضِ أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ فَيَوْمَئِذٍ تَأْكُلُ الْعِصَابَةُ مِنَ الرُّمَّانَةِ فَتُشْبِعُهُمْ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارِكُ اللَّهُ فِي الرِّسْلِ حَتَّى إِنَّ اللِّقْحَةَ مِنَ الإِبِلِ تَكْفِي الْفِئَامَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْبَقَرِ تَكْفِي الْقَبِيلَةَ وَاللِّقْحَةَ مِنَ الْغَنَمِ تَكْفِي الْفَخِذَ ‏.‏ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ عَلَيْهِمْ رِيحًا طَيِّبَةً فَتَأْخُذُ تَحْتَ آبَاطِهِمْ فَتَقْبِضُ رُوحَ كُلِّ مُسْلِمٍ وَيَبْقَى سَائِرُ النَّاسِ يَتَهَارَجُونَ كَمَا تَتَهَارَجُ الْحُمُرُ فَعَلَيْهِمْ تَقُومُ السَّاعَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": 4076,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ جَابِرٍ، عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّوَّاسَ بْنَ سَمْعَانَ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سَيُوقِدُ الْمُسْلِمُونَ مِنْ قِسِيِّ يَأْجُوجَ وَمَأْجُوجَ وَنُشَّابِهِمْ وَأَتْرِسَتِهِمْ سَبْعَ سِنِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": 4077,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، عَنْ إِسْمَاعِيلَ بْنِ رَافِعٍ أَبِي رَافِعٍ، عَنْ أَبِي زُرْعَةَ السَّيْبَانِيِّ، يَحْيَى بْنِ أَبِي عَمْرٍو عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَكَانَ أَكْثَرُ خُطْبَتِهِ حَدِيثًا حَدَّثَنَاهُ عَنِ الدَّجَّالِ وَحَذَّرَنَاهُ فَكَانَ مِنْ قَوْلِهِ أَنْ قَالَ ‏\"‏ إِنَّهُ لَمْ تَكُنْ فِتْنَةٌ فِي الأَرْضِ مُنْذُ ذَرَأَ اللَّهُ ذُرِّيَّةَ آدَمَ أَعْظَمَ مِنْ فِتْنَةِ الدَّجَّالِ وَإِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا إِلاَّ حَذَّرَ أُمَّتَهُ الدَّجَّالَ وَأَنَا آخِرُ الأَنْبِيَاءِ وَأَنْتُمْ آخِرُ الأُمَمِ وَهُوَ خَارِجٌ فِيكُمْ لاَ مَحَالَةَ وَإِنْ يَخْرُجْ وَأَنَا بَيْنَ ظَهْرَانَيْكُمْ فَأَنَا حَجِيجٌ لِكُلِّ مُسْلِمٍ وَإِنْ يَخْرُجْ مِنْ بَعْدِي فَكُلُّ امْرِئٍ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ وَإِنَّهُ يَخْرُجُ مِنْ خَلَّةٍ بَيْنَ الشَّامِ وَالْعِرَاقِ فَيَعِيثُ يَمِينًا وَيَعِيثُ شِمَالاً ‏.‏ يَا عِبَادَ اللَّهِ أَيُّهَا النَّاسُ فَاثْبُتُوا فَإِنِّي سَأَصِفُهُ لَكُمْ صِفَةً لَمْ يَصِفْهَا إِيَّاهُ نَبِيٌّ قَبْلِي إِنَّهُ يَبْدَأُ فَيَقُولُ أَنَا نَبِيٌّ وَلاَ نَبِيَّ بَعْدِي ثُمَّ يُثَنِّي فَيَقُولُ أَنَا رَبُّكُمْ ‏.‏ وَلاَ تَرَوْنَ رَبَّكُمْ حَتَّى تَمُوتُوا وَإِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَإِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ أَوْ غَيْرِ كَاتِبٍ وَإِنَّ مِنْ فِتْنَتِهِ أَنَّ مَعَهُ جَنَّةً وَنَارًا فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ فَمَنِ ابْتُلِيَ بِنَارِهِ فَلْيَسْتَغِثْ بِاللَّهِ وَلْيَقْرَأْ فَوَاتِحَ الْكَهْفِ فَتَكُونَ عَلَيْهِ بَرْدًا وَسَلاَمًا كَمَا كَانَتِ النَّارُ عَلَى إِبْرَاهِيمَ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَقُولَ لأَعْرَابِيٍّ أَرَأَيْتَ إِنْ بَعَثْتُ لَكَ أَبَاكَ وَأُمَّكَ أَتَشْهَدُ أَنِّي رَبُّكَ فَيَقُولُ نَعَمْ ‏.‏ فَيَتَمَثَّلُ لَهُ شَيْطَانَانِ فِي صُورَةِ أَبِيهِ وَأُمِّهِ فَيَقُولاَنِ يَا بُنَىَّ اتَّبِعْهُ فَإِنَّهُ رَبُّكَ ‏.‏ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يُسَلَّطَ عَلَى نَفْسٍ وَاحِدَةٍ فَيَقْتُلَهَا وَيَنْشُرَهَا بِالْمِنْشَارِ حَتَّى يُلْقَى شِقَّتَيْنِ ثُمَّ يَقُولُ انْظُرُوا إِلَى عَبْدِي هَذَا فَإِنِّي أَبْعَثُهُ الآنَ ثُمَّ يَزْعُمُ أَنَّ لَهُ رَبًّا غَيْرِي ‏.‏ فَيَبْعَثُهُ اللَّهُ وَيَقُولُ لَهُ الْخَبِيثُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ وَأَنْتَ عَدُوُّ اللَّهِ أَنْتَ الدَّجَّالُ وَاللَّهِ مَا كُنْتُ بَعْدُ أَشَدَّ بَصِيرَةً بِكَ مِنِّي الْيَوْمَ ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ الطَّنَافِسِيُّ فَحَدَّثَنَا الْمُحَارِبِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ذَلِكَ الرَّجُلُ أَرْفَعُ أُمَّتِي دَرَجَةً فِي الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ قَالَ أَبُو سَعِيدٍ وَاللَّهِ مَا كُنَّا نُرَى ذَلِكَ الرَّجُلَ إِلاَّ عُمَرَ بْنَ الْخَطَّابِ حَتَّى مَضَى لِسَبِيلِهِ ‏.‏ قَالَ الْمُحَارِبِيُّ ثُمَّ رَجَعْنَا إِلَى حَدِيثِ أَبِي رَافِعٍ قَالَ ‏\"‏ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَأْمُرَ السَّمَاءَ أَنْ تُمْطِرَ فَتُمْطِرَ وَيَأْمُرَ الأَرْضَ أَنْ تُنْبِتَ فَتُنْبِتَ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَمُرَّ بِالْحَىِّ فَيُكَذِّبُونَهُ فَلاَ تَبْقَى لَهُمْ سَائِمَةٌ إِلاَّ هَلَكَتْ وَإِنَّ مِنْ فِتْنَتِهِ أَنْ يَمُرَّ بِالْحَىِّ فَيُصَدِّقُونَهُ فَيَأْمُرَ السَّمَاءَ أَنْ تُمْطِرَ فَتُمْطِرَ وَيَأْمُرَ الأَرْضَ أَنْ تُنْبِتَ فَتُنْبِتَ حَتَّى تَرُوحَ مَوَاشِيهِمْ مِنْ يَوْمِهِمْ ذَلِكَ أَسْمَنَ مَا كَانَتْ وَأَعْظَمَهُ وَأَمَدَّهُ خَوَاصِرَ وَأَدَرَّهُ ضُرُوعًا وَإِنَّهُ لاَ يَبْقَى شَىْءٌ مِنَ الأَرْضِ إِلاَّ وَطِئَهُ وَظَهَرَ عَلَيْهِ إِلاَّ مَكَّةَ وَالْمَدِينَةَ لاَ يَأْتِيهِمَا مِنْ نَقْبٍ مِنْ نِقَابِهِمَا إِلاَّ لَقِيَتْهُ الْمَلاَئِكَةُ بِالسُّيُوفِ صَلْتَةً حَتَّى يَنْزِلَ عِنْدَ الظُّرَيْبِ الأَحْمَرِ عِنْدَ مُنْقَطَعِ السَّبَخَةِ فَتَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلاَثَ رَجَفَاتٍ فَلاَ يَبْقَى مُنَافِقٌ وَلاَ مُنَافِقَةٌ إِلاَّ خَرَجَ إِلَيْهِ فَتَنْفِي الْخَبَثَ مِنْهَا كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ وَيُدْعَى ذَلِكَ الْيَوْمُ يَوْمَ الْخَلاَصِ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ شَرِيكٍ بِنْتُ أَبِي الْعُكَرِ يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ قَالَ ‏\"‏ هُمْ يَوْمَئِذٍ قَلِيلٌ وَجُلُّهُمْ بِبَيْتِ الْمَقْدِسِ وَإِمَامُهُمْ رَجُلٌ صَالِحٌ فَبَيْنَمَا إِمَامُهُمْ قَدْ تَقَدَّمَ يُصَلِّي بِهِمُ الصُّبْحَ إِذْ نَزَلَ عَلَيْهِمْ عِيسَى ابْنُ مَرْيَمَ الصُّبْحَ فَرَجَعَ ذَلِكَ الإِمَامُ يَنْكُصُ يَمْشِي الْقَهْقَرَى لِيَتَقَدَّمَ عِيسَى يُصَلِّي بِالنَّاسِ فَيَضَعُ عِيسَى يَدَهُ بَيْنَ كَتِفَيْهِ ثُمَّ يَقُولُ لَهُ تَقَدَّمْ فَصَلِّ فَإِنَّهَا لَكَ أُقِيمَتْ ‏.‏ فَيُصَلِّي بِهِمْ إِمَامُهُمْ فَإِذَا انْصَرَفَ قَالَ عِيسَى عَلَيْهِ السَّلاَمُ افْتَحُوا الْبَابَ ‏.‏ فَيُفْتَحُ وَوَرَاءَهُ الدَّجَّالُ مَعَهُ سَبْعُونَ أَلْفِ يَهُودِيٍّ كُلُّهُمْ ذُو سَيْفٍ مُحَلًّى وَسَاجٍ فَإِذَا نَظَرَ إِلَيْهِ الدَّجَّالُ ذَابَ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ وَيَنْطَلِقُ هَارِبًا وَيَقُولُ عِيسَى عَلَيْهِ السَّلاَمُ إِنَّ لِي فِيكَ ضَرْبَةً لَنْ تَسْبِقَنِي بِهَا ‏.‏ فَيُدْرِكُهُ عِنْدَ بَابِ اللُّدِّ الشَّرْقِيِّ فَيَقْتُلُهُ فَيَهْزِمُ اللَّهُ الْيَهُودَ فَلاَ يَبْقَى شَىْءٌ مِمَّا خَلَقَ اللَّهُ يَتَوَارَى بِهِ يَهُودِيٌّ إِلاَّ أَنْطَقَ اللَّهُ ذَلِكَ الشَّىْءَ لاَ حَجَرَ وَلاَ شَجَرَ وَلاَ حَائِطَ وَلاَ دَابَّةَ - إِلاَّ الْغَرْقَدَةَ فَإِنَّهَا مِنْ شَجَرِهِمْ لاَ تَنْطِقُ - إِلاَّ قَالَ يَا عَبْدَ اللَّهِ الْمُسْلِمَ هَذَا يَهُودِيٌّ فَتَعَالَ اقْتُلْهُ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَإِنَّ أَيَّامَهُ أَرْبَعُونَ سَنَةً السَّنَةُ كَنِصْفِ السَّنَةِ وَالسَّنَةُ كَالشَّهْرِ وَالشَّهْرُ كَالْجُمُعَةِ وَآخِرُ أَيَّامِهِ كَالشَّرَرَةِ يُصْبِحُ أَحَدُكُمْ عَلَى بَابِ الْمَدِينَةِ فَلاَ يَبْلُغُ بَابَهَا الآخَرَ حَتَّى يُمْسِيَ ‏\"‏ ‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي فِي تِلْكَ الأَيَّامِ الْقِصَارِ قَالَ ‏\"‏ تَقْدُرُونَ فِيهَا الصَّلاَةَ كَمَا تَقْدُرُونَهَا فِي هَذِهِ الأَيَّامِ الطِّوَالِ ثُمَّ صَلُّوا ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ فَيَكُونُ عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلاَمُ فِي أُمَّتِي حَكَمًا عَدْلاً وَإِمَامًا مُقْسِطًا يَدُقُّ الصَّلِيبَ وَيَذْبَحُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيَتْرُكُ الصَّدَقَةَ فَلاَ يُسْعَى عَلَى شَاةٍ وَلاَ بَعِيرٍ وَتُرْفَعُ الشَّحْنَاءُ وَالتَّبَاغُضُ وَتُنْزَعُ حُمَةُ كُلِّ ذَاتِ حُمَةٍ حَتَّى يُدْخِلَ الْوَلِيدُ يَدَهُ فِي فِي الْحَيَّةِ فَلاَ تَضُرَّهُ وَتُفِرُّ الْوَلِيدَةُ الأَسَدَ فَلاَ يَضُرُّهَا وَيَكُونُ الذِّئْبُ فِي الْغَنَمِ كَأَنَّهُ كَلْبُهَا وَتُمْلأُ الأَرْضُ مِنَ السِّلْمِ كَمَا يُمْلأُ الإِنَاءُ مِنَ الْمَاءِ وَتَكُونُ الْكَلِمَةُ وَاحِدَةً فَلاَ يُعْبَدُ إِلاَّ اللَّهُ وَتَضَعُ الْحَرْبُ أَوْزَارَهَا وَتُسْلَبُ قُرَيْشٌ مُلْكَهَا وَتَكُونُ الأَرْضُ كَفَاثُورِ الْفِضَّةِ تُنْبِتُ نَبَاتَهَا بِعَهْدِ آدَمَ حَتَّى يَجْتَمِعَ النَّفَرُ عَلَى الْقِطْفِ مِنَ الْعِنَبِ فَيُشْبِعَهُمْ وَيَجْتَمِعَ النَّفَرُ عَلَى الرُّمَّانَةِ فَتُشْبِعَهُمْ وَيَكُونَ الثَّوْرُ بِكَذَا وَكَذَا مِنَ الْمَالِ وَتَكُونَ الْفَرَسُ بِالدُّرَيْهِمَاتِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا يُرْخِصُ الْفَرَسَ قَالَ ‏\"‏ لاَ تُرْكَبُ لِحَرْبٍ أَبَدًا ‏\"‏ ‏.‏ قِيلَ لَهُ فَمَا يُغْلِي الثَّوْرَ قَالَ ‏\"‏ تُحْرَثُ الأَرْضُ كُلُّهَا وَإِنَّ قَبْلَ خُرُوجِ الدَّجَّالِ ثَلاَثَ سَنَوَاتٍ شِدَادٍ يُصِيبُ النَّاسَ فِيهَا جُوعٌ شَدِيدٌ يَأْمُرُ اللَّهُ السَّمَاءَ فِي السَّنَةِ الأُولَى أَنْ تَحْبِسَ ثُلُثَ مَطَرِهَا وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ ثُلُثَ نَبَاتِهَا ثُمَّ يَأْمُرُ السَّمَاءَ فِي السَّنَةِ الثَّانِيَةِ فَتَحْبِسُ ثُلُثَىْ مَطَرِهَا وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ ثُلُثَىْ نَبَاتِهَا ثُمَّ يَأْمُرُ اللَّهُ السَّمَاءَ فِي السَّنَةِ الثَّالِثَةِ فَتَحْبِسُ مَطَرَهَا كُلَّهُ فَلاَ تَقْطُرُ قَطْرَةٌ وَيَأْمُرُ الأَرْضَ فَتَحْبِسُ نَبَاتَهَا كُلَّهُ فَلاَ تُنْبِتُ خَضْرَاءَ فَلاَ تَبْقَى ذَاتُ ظِلْفٍ إِلاَّ هَلَكَتْ إِلاَّ مَا شَاءَ اللَّهُ ‏\"‏ ‏.‏ قِيلَ فَمَا يُعِيشُ النَّاسَ فِي ذَلِكَ الزَّمَانِ قَالَ ‏\"‏ التَّهْلِيلُ وَالتَّكْبِيرُ وَالتَّسْبِيحُ وَالتَّحْمِيدُ وَيُجْرَى ذَلِكَ عَلَيْهِمْ مَجْرَى الطَّعَامِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ سَمِعْتُ أَبَا الْحَسَنِ الطَّنَافِسِيَّ يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ الْمُحَارِبِيَّ يَقُولُ يَنْبَغِي أَنْ يُدْفَعَ هَذَا الْحَدِيثُ إِلَى الْمُؤَدِّبِ حَتَّى يُعَلِّمَهُ الصِّبْيَانَ فِي الْكُتَّابِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": 4078,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَنْزِلَ عِيسَى ابْنُ مَرْيَمَ حَكَمًا مُقْسِطًا وَإِمَامًا عَدْلاً فَيَكْسِرُ الصَّلِيبَ وَيَقْتُلُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيَفِيضُ الْمَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": 4079,
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي عَاصِمُ بْنُ عُمَرَ بْنِ قَتَادَةَ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ تُفْتَحُ يَأْجُوجُ وَمَأْجُوجُ فَيَخْرُجُونَ كَمَا قَالَ اللَّهُ تَعَالَى ‏{وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ}‏ فَيَعُمُّونَ الأَرْضَ وَيَنْحَازُ مِنْهُمُ الْمُسْلِمُونَ حَتَّى تَصِيرَ بَقِيَّةُ الْمُسْلِمِينَ فِي مَدَائِنِهِمْ وَحُصُونِهِمْ وَيَضُمُّونَ إِلَيْهِمْ مَوَاشِيَهُمْ حَتَّى أَنَّهُمْ لَيَمُرُّونَ بِالنَّهَرِ فَيَشْرَبُونَهُ حَتَّى مَا يَذَرُونَ فِيهِ شَيْئًا فَيَمُرُّ آخِرُهُمْ عَلَى أَثَرِهِمْ فَيَقُولُ قَائِلُهُمْ لَقَدْ كَانَ بِهَذَا الْمَكَانِ مَرَّةً مَاءٌ وَيَظْهَرُونَ عَلَى الأَرْضِ فَيَقُولُ قَائِلُهُمْ هَؤُلاَءِ أَهْلُ الأَرْضِ قَدْ فَرَغْنَا مِنْهُمْ وَلَنُنَازِلَنَّ أَهْلَ السَّمَاءِ حَتَّى إِنَّ أَحَدَهُمْ لَيَهُزُّ حَرْبَتَهُ إِلَى السَّمَاءِ فَتَرْجِعُ مُخَضَّبَةً بِالدَّمِ فَيَقُولُونَ قَدْ قَتَلْنَا أَهْلَ السَّمَاءِ ‏.‏ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ دَوَابَّ كَنَغَفِ الْجَرَادِ فَتَأْخُذُ بِأَعْنَاقِهِمْ فَيَمُوتُونَ مَوْتَ الْجَرَادِ يَرْكَبُ بَعْضُهُمْ بَعْضًا فَيُصْبِحُ الْمُسْلِمُونَ لاَ يَسْمَعُونَ لَهُمْ حِسًّا فَيَقُولُونَ مَنْ رَجُلٌ يَشْرِي نَفْسَهُ وَيَنْظُرُ مَا فَعَلُوا فَيَنْزِلُ مِنْهُمْ رَجُلٌ قَدْ وَطَّنَ نَفْسَهُ عَلَى أَنْ يَقْتُلُوهُ فَيَجِدُهُمْ مَوْتَى فَيُنَادِيهِمْ أَلاَ أَبْشِرُوا فَقَدْ هَلَكَ عَدُوُّكُمْ ‏.‏ فَيَخْرُجُ النَّاسُ وَيُخْلُونَ سَبِيلَ مَوَاشِيهِمْ فَمَا يَكُونُ لَهُمْ رَعْىٌ إِلاَّ لُحُومُهُمْ فَتَشْكَرُ عَلَيْهَا كَأَحْسَنِ مَا شَكِرَتْ مِنْ نَبَاتٍ أَصَابَتْهُ قَطُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": 4080,
			"text": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَبُو رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ يَأْجُوجَ وَمَأْجُوجَ يَحْفِرُونَ كُلَّ يَوْمٍ حَتَّى إِذَا كَادُوا يَرَوْنَ شُعَاعَ الشَّمْسِ قَالَ الَّذِي عَلَيْهِمُ ارْجِعُوا فَسَنَحْفِرُهُ غَدًا ‏.‏ فَيُعِيدُهُ اللَّهُ أَشَدَّ مَا كَانَ حَتَّى إِذَا بَلَغَتْ مُدَّتُهُمْ وَأَرَادَ اللَّهُ أَنْ يَبْعَثَهُمْ عَلَى النَّاسِ حَفَرُوا حَتَّى إِذَا كَادُوا يَرَوْنَ شُعَاعَ الشَّمْسِ قَالَ الَّذِي عَلَيْهِمُ ارْجِعُوا فَسَتَحْفِرُونَهُ غَدًا إِنْ شَاءَ اللَّهُ تَعَالَى وَاسْتَثْنَوْا فَيَعُودُونَ إِلَيْهِ وَهُوَ كَهَيْئَتِهِ حِينَ تَرَكُوهُ فَيَحْفِرُونَهُ وَيَخْرُجُونَ عَلَى النَّاسِ فَيَنْشِفُونَ الْمَاءَ وَيَتَحَصَّنُ النَّاسُ مِنْهُمْ فِي حُصُونِهِمْ فَيَرْمُونَ بِسِهَامِهِمْ إِلَى السَّمَاءِ فَتَرْجِعُ عَلَيْهَا الدَّمُ الَّذِي اجْفَظَّ فَيَقُولُونَ قَهَرْنَا أَهْلَ الأَرْضِ وَعَلَوْنَا أَهْلَ السَّمَاءِ فَيَبْعَثُ اللَّهُ نَغَفًا فِي أَقْفَائِهِمْ فَيَقْتُلُهُمْ بِهَا ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ دَوَابَّ الأَرْضِ لَتَسْمَنُ وَتَشْكَرُ شَكَرًا مِنْ لُحُومِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": 4081,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا الْعَوَّامُ بْنُ حَوْشَبٍ، حَدَّثَنِي جَبَلَةُ بْنُ سُحَيْمٍ، عَنْ مُؤْثِرِ بْنِ عَفَازَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ لَمَّا كَانَ لَيْلَةَ أُسْرِيَ بِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لَقِيَ إِبْرَاهِيمَ وَمُوسَى وَعِيسَى فَتَذَاكَرُوا السَّاعَةَ فَبَدَءُوا بِإِبْرَاهِيمَ فَسَأَلُوهُ عَنْهَا فَلَمْ يَكُنْ عِنْدَهُ مِنْهَا عِلْمٌ ثُمَّ سَأَلُوا مُوسَى فَلَمْ يَكُنْ عِنْدَهُ مِنْهَا عِلْمٌ فَرُدَّ الْحَدِيثُ إِلَى عِيسَى ابْنِ مَرْيَمَ فَقَالَ قَدْ عُهِدَ إِلَىَّ فِيمَا دُونَ وَجْبَتِهَا فَأَمَّا وَجْبَتُهَا فَلاَ يَعْلَمُهَا إِلاَّ اللَّهُ ‏.‏ فَذَكَرَ خُرُوجَ الدَّجَّالِ قَالَ فَأَنْزِلُ فَأَقْتُلُهُ فَيَرْجِعُ النَّاسُ إِلَى بِلاَدِهِمْ فَيَسْتَقْبِلُهُمْ يَأْجُوجُ وَمَأْجُوجُ وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ فَلاَ يَمُرُّونَ بِمَاءٍ إِلاَّ شَرِبُوهُ وَلاَ بِشَىْءٍ إِلاَّ أَفْسَدُوهُ فَيَجْأَرُونَ إِلَى اللَّهِ فَأَدْعُو اللَّهَ أَنْ يُمِيتَهُمْ فَتَنْتُنُ الأَرْضُ مِنْ رِيحِهِمْ فَيَجْأَرُونَ إِلَى اللَّهِ فَأَدْعُو اللَّهَ فَيُرْسِلُ السَّمَاءَ بِالْمَاءِ فَيَحْمِلُهُمْ فَيُلْقِيهِمْ فِي الْبَحْرِ ثُمَّ تُنْسَفُ الْجِبَالُ وَتُمَدُّ الأَرْضُ مَدَّ الأَدِيمِ فَعُهِدَ إِلَىَّ مَتَى كَانَ ذَلِكَ كَانَتِ السَّاعَةُ مِنَ النَّاسِ كَالْحَامِلِ الَّتِي لاَ يَدْرِي أَهْلُهَا مَتَى تَفْجَؤُهُمْ بِوِلاَدَتِهَا ‏.‏ قَالَ الْعَوَّامُ وَوُجِدَ تَصْدِيقُ ذَلِكَ فِي كِتَابِ اللَّهِ تَعَالَى ‏{حَتَّى إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": 4082,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا عَلِيُّ بْنُ صَالِحٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِذْ أَقْبَلَ فِتْيَةٌ مِنْ بَنِي هَاشِمٍ فَلَمَّا رَآهُمُ النَّبِيُّ ـ صلى الله عليه وسلم ـ اغْرَوْرَقَتْ عَيْنَاهُ وَتَغَيَّرَ لَوْنُهُ قَالَ فَقُلْتُ مَا نَزَالُ نَرَى فِي وَجْهِكَ شَيْئًا نَكْرَهُهُ ‏.‏ فَقَالَ ‏ \"‏ إِنَّا أَهْلُ بَيْتٍ اخْتَارَ اللَّهُ لَنَا الآخِرَةَ عَلَى الدُّنْيَا وَإِنَّ أَهْلَ بَيْتِي سَيَلْقَوْنَ بَعْدِي بَلاَءً وَتَشْرِيدًا وَتَطْرِيدًا حَتَّى يَأْتِيَ قَوْمٌ مِنْ قِبَلِ الْمَشْرِقِ مَعَهُمْ رَايَاتٌ سُودٌ فَيَسْأَلُونَ الْخَيْرَ فَلاَ يُعْطَوْنَهُ فَيُقَاتِلُونَ فَيُنْصَرُونَ فَيُعْطَوْنَ مَا سَأَلُوا فَلاَ يَقْبَلُونَهُ حَتَّى يَدْفَعُوهَا إِلَى رَجُلٍ مِنْ أَهْلِ بَيْتِي فَيَمْلَؤُهَا قِسْطًا كَمَا مَلَؤُوهَا جَوْرًا فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَلْيَأْتِهِمْ وَلَوْ حَبْوًا عَلَى الثَّلْجِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": 4083,
			"text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعُقَيْلِيُّ، حَدَّثَنَا عُمَارَةُ بْنُ أَبِي حَفْصَةَ، عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَبِي صِدِّيقٍ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ يَكُونُ فِي أُمَّتِي الْمَهْدِيُّ إِنْ قُصِرَ فَسَبْعٌ وَإِلاَّ فَتِسْعٌ فَتَنْعَمُ فِيهِ أُمَّتِي نَعْمَةً لَمْ يَنْعَمُوا مِثْلَهَا قَطُّ تُؤْتَى أُكُلَهَا وَلاَ تَدَّخِرُ مِنْهُمْ شَيْئًا وَالْمَالُ يَوْمَئِذٍ كُدُوسٌ فَيَقُومُ الرَّجُلُ فَيَقُولُ يَا مَهْدِيُّ أَعْطِنِي فَيَقُولُ خُذْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": 4084,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ يُوسُفَ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَقْتَتِلُ عِنْدَ كَنْزِكُمْ ثَلاَثَةٌ كُلُّهُمُ ابْنُ خَلِيفَةٍ ثُمَّ لاَ يَصِيرُ إِلَى وَاحِدٍ مِنْهُمْ ثُمَّ تَطْلُعُ الرَّايَاتُ السُّودُ مِنْ قِبَلِ الْمَشْرِقِ فَيَقْتُلُونَكُمْ قَتْلاً لَمْ يُقْتَلْهُ قَوْمٌ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ شَيْئًا لاَ أَحْفَظُهُ فَقَالَ ‏\"‏ فَإِذَا رَأَيْتُمُوهُ فَبَايِعُوهُ وَلَوْ حَبْوًا عَلَى الثَّلْجِ فَإِنَّهُ خَلِيفَةُ اللَّهِ الْمَهْدِيُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": 4085,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، حَدَّثَنَا يَاسِينُ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْمَهْدِيُّ مِنَّا أَهْلَ الْبَيْتِ يُصْلِحُهُ اللَّهُ فِي لَيْلَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ، حَدَّثَنَا أَبُو الْمَلِيحِ الرَّقِّيُّ، عَنْ زِيَادِ بْنِ بَيَانٍ، عَنْ عَلِيِّ بْنِ نُفَيْلٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ كُنَّا عِنْدَ أُمِّ سَلَمَةَ فَتَذَاكَرْنَا الْمَهْدِيَّ فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْمَهْدِيُّ مِنْ وَلَدِ فَاطِمَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": 4087,
			"text": "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا سَعْدُ بْنُ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ عَلِيِّ بْنِ زِيَادٍ الْيَمَامِيِّ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ نَحْنُ وَلَدَ عَبْدِ الْمُطَّلِبِ سَادَةُ أَهْلِ الْجَنَّةِ أَنَا وَحَمْزَةُ وَعَلِيٌّ وَجَعْفَرٌ وَالْحَسَنُ وَالْحُسَيْنُ وَالْمَهْدِيُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": 4088,
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ، وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا أَبُو صَالِحٍ عَبْدُ الْغَفَّارِ بْنُ دَاوُدَ الْحَرَّانِيُّ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ أَبِي زُرْعَةَ، عَمْرِو بْنِ جَابِرٍ الْحَضْرَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَخْرُجُ نَاسٌ مِنَ الْمَشْرِقِ فَيُوَطِّئُونَ لِلْمَهْدِيِّ ‏\"‏ ‏.‏ يَعْنِي سُلْطَانَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": 4089,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ الأَوْزَاعِيِّ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ، قَالَ مَالَ مَكْحُولٌ وَابْنُ أَبِي زَكَرِيَّا إِلَى خَالِدِ بْنِ مَعْدَانَ وَمِلْتُ مَعَهُمَا فَحَدَّثَنَا عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، قَالَ قَالَ لِي جُبَيْرٌ انْطَلِقْ بِنَا إِلَى ذِي مِخْمَرٍ - وَكَانَ رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ ـ صلى الله عليه وسلم ـ - فَانْطَلَقْتُ مَعَهُمَا فَسَأَلَهُ عَنِ الْهُدْنَةِ فَقَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ سَتُصَالِحُكُمُ الرُّومُ صُلْحًا آمِنًا ثُمَّ تَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا فَتُنْصَرُونَ وَتَغْنَمُونَ وَتَسْلَمُونَ ثُمَّ تَنْصَرِفُونَ حَتَّى تَنْزِلُوا بِمَرْجٍ ذِي تُلُولٍ فَيَرْفَعُ رَجُلٌ مِنْ أَهْلِ الصَّلِيبِ الصَّلِيبَ فَيَقُولُ غَلَبَ الصَّلِيبُ ‏.‏ فَيَغْضَبُ رَجُلٌ مِنَ الْمُسْلِمِينَ فَيَقُومُ إِلَيْهِ فَيَدُقُّهُ فَعِنْدَ ذَلِكَ تَغْدِرُ الرُّومُ وَيَجْتَمِعُونَ لِلْمَلْحَمَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": 4090,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ، عَنْ سُلَيْمَانَ بْنِ حَبِيبٍ الْمُحَارِبِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا وَقَعَتِ الْمَلاَحِمُ بَعَثَ اللَّهُ بَعْثًا مِنَ الْمَوَالِي هُمْ أَكْرَمُ الْعَرَبِ فَرَسًا وَأَجْوَدُهُ سِلاَحًا يُؤَيِّدُ اللَّهُ بِهِمُ الدِّينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": 4091,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنْ نَافِعِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ سَتُقَاتِلُونَ جَزِيرَةَ الْعَرَبِ فَيَفْتَحُهَا اللَّهُ ثُمَّ تُقَاتِلُونَ الرُّومَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تُقَاتِلُونَ الدَّجَّالَ فَيَفْتَحُهَا اللَّهُ ‏\"‏ ‏.‏ قَالَ جَابِرٌ فَمَا يَخْرُجُ الدَّجَّالُ حَتَّى تُفْتَحَ الرُّومُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": 4092,
			"text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، وَإِسْمَاعِيلُ بْنُ عَيَّاشٍ، قَالاَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي مَرْيَمَ، عَنِ الْوَلِيدِ بْنِ سُفْيَانَ بْنِ أَبِي مَرْيَمَ، عَنْ يَزِيدَ بْنِ قُطَيْبٍ السَّكُونِيِّ، - وَقَالَ الْوَلِيدُ يَزِيدُ بْنُ قُطْبَةَ - عَنْ أَبِي بَحْرِيَّةَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ الْمَلْحَمَةُ الْكُبْرَى وَفَتْحُ الْقُسْطُنْطِينِيَّةِ وَخُرُوجُ الدَّجَّالِ فِي سَبْعَةِ أَشْهُرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": 4093,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ أَبِي بِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ وَيَخْرُجُ الدَّجَّالُ فِي السَّابِعَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": 4094,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا أَبُو يَعْقُوبَ الْحُنَيْنِيُّ، عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَكُونَ أَدْنَى مَسَالِحِ الْمُسْلِمِينَ بِبَوْلاَءَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ـ صلى الله عليه وسلم ـ ‏\"‏ يَا عَلِيُّ يَا عَلِيُّ يَا عَلِيُّ ‏\"‏ ‏.‏ قَالَ بِأَبِي وَأُمِّي ‏.‏ قَالَ ‏\"‏ إِنَّكُمْ سَتُقَاتِلُونَ بَنِي الأَصْفَرِ وَيُقَاتِلُهُمُ الَّذِينَ مِنْ بَعْدِكُمْ حَتَّى تَخْرُجَ إِلَيْهِمْ رُوقَةُ الإِسْلاَمِ أَهْلُ الْحِجَازِ الَّذِينَ لاَ يَخَافُونَ فِي اللَّهِ لَوْمَةَ لاَئِمٍ فَيَفْتَتِحُونَ الْقُسْطُنْطِينِيَّةَ بِالتَّسْبِيحِ وَالتَّكْبِيرِ فَيُصِيبُونَ غَنَائِمَ لَمْ يُصِيبُوا مِثْلَهَا حَتَّى يَقْتَسِمُوا بِالأَتْرِسَةِ وَيَأْتِي آتٍ فَيَقُولُ إِنَّ الْمَسِيحَ قَدْ خَرَجَ فِي بِلاَدِكُمْ أَلاَ وَهِيَ كِذْبَةٌ فَالآخِذُ نَادِمٌ وَالتَّارِكُ نَادِمٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": 4095,
			"text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، حَدَّثَنِي عَوْفُ بْنُ مَالِكٍ الأَشْجَعِيُّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَكُونُ بَيْنَكُمْ وَبَيْنَ بَنِي الأَصْفَرِ هُدْنَةٌ فَيَغْدِرُونَ بِكُمْ فَيَسِيرُونَ إِلَيْكُمْ فِي ثَمَانِينَ غَايَةً تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": 4096,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا صِغَارَ الأَعْيُنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": 4097,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا صِغَارَ الأَعْيُنِ ذُلْفَ الأُنُوفِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": 4098,
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةُ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، عَنْ عَمْرِو بْنِ تَغْلِبَ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا عِرَاضَ الْوُجُوهِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ وَإِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا يَنْتَعِلُونَ الشَّعَرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": 4099,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ، حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا صِغَارَ الأَعْيُنِ عِرَاضَ الْوُجُوهِ كَأَنَّ أَعْيُنَهُمْ حَدَقُ الْجَرَادِ كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ يَنْتَعِلُونَ الشَّعَرَ وَيَتَّخِذُونَ الدَّرَقَ يَرْبِطُونَ خَيْلَهُمْ بِالنَّخْلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		}
	]
}